[
    {
        "id": "263c0adbc11e455c942a481a7fe1251a",
        "word": "nice",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/naɪs/",
            "us": "/naɪs/"
        },
        "nearby": [
            {
                "word": "Nicaragua",
                "pos": "noun"
            },
            {
                "word": "Nicaraguan",
                "pos": "noun, adjective"
            },
            {
                "word": "nice",
                "pos": "adjective"
            },
            {
                "word": "nice-looking",
                "pos": "adjective"
            },
            {
                "word": "nicely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pleasant or attractive",
                    "vi": "dễ chịu hoặc hấp dẫn"
                },
                "examples": [
                    {
                        "en": "a nice day/smile/place",
                        "vi": "một ngày tốt lành / nụ cười / địa điểm"
                    },
                    {
                        "en": "nice weather",
                        "vi": "thời tiết đẹp"
                    },
                    {
                        "en": "Did you have a nice time?",
                        "vi": "Bạn có khoảng thời gian tuyệt chứ?"
                    },
                    {
                        "en": "You look very nice.",
                        "vi": "Trông bạn tuyệt quá."
                    },
                    {
                        "en": "We all had the flu last week—it wasn't very nice.",
                        "vi": "Tất cả chúng tôi đều bị cúm tuần trước — nó không tốt lắm."
                    },
                    {
                        "en": "‘Do you want to come, too?’ ‘Yes, that would be nice.’",
                        "vi": "Bạn có muốn đến không?' 'Vâng, thật tốt quá.'"
                    },
                    {
                        "en": "The nicest thing about her is that she never criticizes us.",
                        "vi": "Điều tuyệt vời nhất ở cô ấy là cô ấy không bao giờ chỉ trích chúng tôi."
                    },
                    {
                        "en": "It was a nice touch to end the film as it started.",
                        "vi": "Đó là một liên lạc tốt đẹp để kết thúc bộ phim khi nó bắt đầu."
                    },
                    {
                        "en": "it is nice to do something It's nice to know that somebody appreciates what I do.",
                        "vi": "thật tuyệt khi làm điều gì đó Thật tuyệt khi biết rằng ai đó đánh giá cao những gì tôi làm."
                    },
                    {
                        "en": "Nice to meet you! (= a friendly greeting when you meet somebody for the first time)",
                        "vi": "Hân hạnh được biết bạn! (= một lời chào thân thiện khi bạn gặp ai đó lần đầu tiên)"
                    },
                    {
                        "en": "It is nice doing something It's been nice meeting you.",
                        "vi": "Thật là vui khi được làm điều gì đó. Rất vui được gặp bạn."
                    },
                    {
                        "en": "it is nice that… It's nice that you can come with us.",
                        "vi": "thật tuyệt khi… Thật vui khi bạn có thể đi cùng chúng tôi."
                    },
                    {
                        "en": "it would be nice if… It would be nice if he moved to London.",
                        "vi": "thật tuyệt nếu… Thật tuyệt nếu anh ấy chuyển đến London."
                    }
                ]
            },
            {
                "define": {
                    "en": "used before adjectives or adverbs to emphasize how pleasant something is",
                    "vi": "được sử dụng trước tính từ hoặc trạng từ để nhấn mạnh điều gì đó dễ chịu như thế nào"
                },
                "examples": [
                    {
                        "en": "a nice hot bath",
                        "vi": "một bồn tắm nước nóng tuyệt vời"
                    },
                    {
                        "en": "a nice long walk",
                        "vi": "một chuyến đi bộ dài"
                    },
                    {
                        "en": "It's a nice little place you have here.",
                        "vi": "Đó là một nơi nhỏ tốt đẹp mà bạn có ở đây."
                    },
                    {
                        "en": "nice and… He seemed nice and friendly.",
                        "vi": "tốt và… Anh ấy có vẻ dễ mến và thân thiện."
                    },
                    {
                        "en": "It was nice and warm yesterday.",
                        "vi": "Hôm qua thật đẹp và ấm áp."
                    },
                    {
                        "en": "Everyone arrived nice and early.",
                        "vi": "Mọi người đến sớm và tốt đẹp."
                    },
                    {
                        "en": "I felt nice and cosy.",
                        "vi": "Tôi cảm thấy tốt đẹp và ấm cúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind; friendly",
                    "vi": "Tốt bụng; thân thiện"
                },
                "examples": [
                    {
                        "en": "Our new neighbours are very nice.",
                        "vi": "Những người hàng xóm mới của chúng tôi rất tốt."
                    },
                    {
                        "en": "He's a really nice guy.",
                        "vi": "Anh ấy là một chàng trai thực sự tốt."
                    },
                    {
                        "en": "She's one of the nicest people you'll ever meet.",
                        "vi": "Cô ấy là một trong những người đẹp nhất mà bạn từng gặp."
                    },
                    {
                        "en": "nice to somebody Be nice to me. I'm not feeling well.",
                        "vi": "tốt với ai đó Hãy tốt với tôi. Tôi không được khỏe."
                    },
                    {
                        "en": "nice of somebody (to do something) It was nice of them to invite us.",
                        "vi": "tốt của ai đó (để làm điều gì đó) Thật tuyệt khi họ mời chúng tôi."
                    },
                    {
                        "en": "nice about something I complained to the manager and he was very nice about it.",
                        "vi": "tốt về điều gì đó tôi đã phàn nàn với người quản lý và anh ấy rất hài lòng về điều đó."
                    },
                    {
                        "en": "I asked him in the nicest possible way to put his cigarette out.",
                        "vi": "Tôi hỏi anh ấy bằng cách nào tốt nhất có thể để bỏ điếu thuốc của anh ấy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "bad or unpleasant",
                    "vi": "xấu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "That's a nice thing to say!",
                        "vi": "Đó là một điều tốt đẹp để nói!"
                    },
                    {
                        "en": "That's a nice way to speak to your mother!",
                        "vi": "Đó là một cách tốt để nói chuyện với mẹ của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a very small detail or difference",
                    "vi": "liên quan đến một chi tiết rất nhỏ hoặc sự khác biệt"
                },
                "examples": [
                    {
                        "en": "a nice point of law (= one that is difficult to decide)",
                        "vi": "một điểm tốt của luật (= một điểm rất khó quyết định)"
                    }
                ]
            },
            {
                "define": {
                    "en": "very kind and friendly, especially when you are not expecting it",
                    "vi": "rất tốt bụng và thân thiện, đặc biệt là khi bạn không mong đợi điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a friendly way of saying goodbye, especially to customers",
                    "vi": "một cách chào tạm biệt thân thiện, đặc biệt là với khách hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be pleasant or polite to somebody, especially when you do not really want to",
                    "vi": "tỏ ra dễ chịu hoặc lịch sự với ai đó, đặc biệt là khi bạn không thực sự muốn"
                },
                "examples": [
                    {
                        "en": "He tried to make nice with his ex, even though he was still angry with her.",
                        "vi": "Anh ấy cố gắng làm lành với người yêu cũ, mặc dù anh ấy vẫn còn giận cô ấy."
                    },
                    {
                        "en": "Cole and his opponent made nice for the cameras at the press event.",
                        "vi": "Cole và đối thủ tạo dáng đẹp trước ống kính tại sự kiện họp báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when something good has happened or somebody has said something funny",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi điều gì đó tốt đẹp đã xảy ra hoặc ai đó đã nói điều gì đó vui nhộn"
                },
                "examples": [
                    {
                        "en": "You got the job? Nice one!",
                        "vi": "Bạn nhận được công việc? Đẹp quá!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when somebody has done something well",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi ai đó đã làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "You did a good job today. Nice work, James!",
                        "vi": "Bạn đã làm một công việc tốt ngày hôm nay. Làm tốt lắm, James!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you wish that you had somebody’s success or good luck and think they have achieved it with little effort",
                    "vi": "được sử dụng khi bạn ước rằng bạn có được ai đó thành công hoặc may mắn và nghĩ rằng họ đã đạt được điều đó mà không cần nỗ lực"
                },
                "examples": [
                    {
                        "en": "He was paid £200 for a ten-minute speech? Nice work if you can get it.",
                        "vi": "Anh ta được trả 200 bảng cho một bài phát biểu dài mười phút? Làm tốt lắm nếu bạn có thể nhận được nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0ae4765210542d5a3669cbf0603b6b6",
        "word": "helpful",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhelpfl/",
            "us": "/ˈhelpfl/"
        },
        "nearby": [
            {
                "word": "help desk",
                "pos": "noun"
            },
            {
                "word": "helper",
                "pos": "noun"
            },
            {
                "word": "helpful",
                "pos": "adjective"
            },
            {
                "word": "helpfully",
                "pos": "adverb"
            },
            {
                "word": "helpfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to improve a particular situation",
                    "vi": "có thể cải thiện một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "helpful advice/information",
                        "vi": "lời khuyên / thông tin hữu ích"
                    },
                    {
                        "en": "helpful hints/tips/suggestions/comments",
                        "vi": "gợi ý / mẹo / gợi ý / nhận xét hữu ích"
                    },
                    {
                        "en": "Sorry I can't be more helpful.",
                        "vi": "Xin lỗi, tôi không thể hữu ích hơn."
                    },
                    {
                        "en": "helpful for somebody This approach may be helpful for people with very severe symptoms.",
                        "vi": "hữu ích cho ai đó Cách tiếp cận này có thể hữu ích cho những người có các triệu chứng rất nặng."
                    },
                    {
                        "en": "helpful to do something You may find it helpful to read this before making any decisions.",
                        "vi": "hữu ích khi làm điều gì đó Bạn có thể thấy hữu ích khi đọc phần này trước khi đưa ra bất kỳ quyết định nào."
                    },
                    {
                        "en": "It would be helpful to have more detailed information.",
                        "vi": "Sẽ rất hữu ích nếu có thêm thông tin chi tiết."
                    },
                    {
                        "en": "helpful for somebody to do something It would be helpful for me to see the damage for myself.",
                        "vi": "hữu ích cho ai đó làm điều gì đó Sẽ rất hữu ích cho tôi khi nhận ra thiệt hại cho bản thân."
                    },
                    {
                        "en": "helpful in doing something Role-play is helpful in developing communication skills.",
                        "vi": "hữu ích khi làm việc gì đó Đóng vai rất hữu ích trong việc phát triển kỹ năng giao tiếp."
                    },
                    {
                        "en": "helpful to somebody This final section will be particularly helpful to students.",
                        "vi": "hữu ích cho ai đó Phần cuối cùng này sẽ đặc biệt hữu ích cho sinh viên."
                    },
                    {
                        "en": "The booklet should be very helpful to parents of children with disabilities.",
                        "vi": "Tập sách sẽ rất hữu ích cho các bậc cha mẹ có con khuyết tật."
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to help somebody",
                    "vi": "sẵn sàng giúp đỡ ai đó"
                },
                "examples": [
                    {
                        "en": "I called the police but they weren't very helpful.",
                        "vi": "Tôi đã gọi cảnh sát nhưng họ không hữu ích lắm."
                    },
                    {
                        "en": "The staff couldn't have been more helpful.",
                        "vi": "Các nhân viên không thể hữu ích hơn."
                    },
                    {
                        "en": "She’s one of the most helpful people I know.",
                        "vi": "Cô ấy là một trong những người hữu ích nhất mà tôi biết."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5941f49bfc34e83804f3827203118a4",
        "word": "lovely",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlʌvli/",
            "us": "/ˈlʌvli/"
        },
        "nearby": [
            {
                "word": "Bernard Lovell",
                "pos": ""
            },
            {
                "word": "lovelorn",
                "pos": "adjective"
            },
            {
                "word": "lovely",
                "pos": "adjective"
            },
            {
                "word": "lovely",
                "pos": "noun"
            },
            {
                "word": "lovemaking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "beautiful; attractive",
                    "vi": "xinh đẹp; hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She looked particularly lovely that night.",
                        "vi": "Cô ấy trông đặc biệt đáng yêu vào đêm hôm đó."
                    },
                    {
                        "en": "He has a lovely voice.",
                        "vi": "Anh ấy có một giọng nói đáng yêu."
                    },
                    {
                        "en": "You've got lovely eyes.",
                        "vi": "Bạn có một đôi mắt đáng yêu."
                    },
                    {
                        "en": "We travelled through some lovely countryside.",
                        "vi": "Chúng tôi đã đi qua một số vùng quê đáng yêu."
                    },
                    {
                        "en": "She's got an absolutely lovely face.",
                        "vi": "Cô ấy có một khuôn mặt rất đáng yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very pleasant; wonderful",
                    "vi": "rất dễ chịu; tuyệt vời"
                },
                "examples": [
                    {
                        "en": "‘Can I get you anything?’ ‘A cup of tea would be lovely.’",
                        "vi": "Tôi có thể lấy gì cho bạn?' 'Một tách trà sẽ rất tuyệt.'"
                    },
                    {
                        "en": "What a lovely surprise!",
                        "vi": "Thật là một bất ngờ đáng yêu!"
                    },
                    {
                        "en": "How lovely to see you!",
                        "vi": "Thật đáng yêu khi gặp bạn!"
                    },
                    {
                        "en": "Isn't it a lovely day?",
                        "vi": "Đó không phải là một ngày đáng yêu phải không?"
                    },
                    {
                        "en": "We've had a lovely time.",
                        "vi": "Chúng tôi đã có một khoảng thời gian tuyệt vời."
                    },
                    {
                        "en": "It's a lovely old farm.",
                        "vi": "Đó là một trang trại cũ đáng yêu."
                    },
                    {
                        "en": "It's been lovely having you here.",
                        "vi": "Thật tuyệt khi có bạn ở đây."
                    },
                    {
                        "en": "(ironic) You've got yourself into a lovely mess, haven't you?",
                        "vi": "(mỉa mai) Bạn đã tự đưa mình vào một mớ hỗn độn đáng yêu, phải không?"
                    },
                    {
                        "en": "to smell/taste/sound lovely",
                        "vi": "ngửi / nếm / nghe có vẻ đáng yêu"
                    }
                ]
            },
            {
                "define": {
                    "en": "very kind, generous and friendly",
                    "vi": "rất tốt bụng, hào phóng và thân thiện"
                },
                "examples": [
                    {
                        "en": "Her mother was a lovely woman.",
                        "vi": "Mẹ cô là một người phụ nữ đáng yêu."
                    },
                    {
                        "en": "He is a lovely little boy.",
                        "vi": "Anh ấy là một cậu bé đáng yêu."
                    },
                    {
                        "en": "She is a lovely old lady and always full of laughter.",
                        "vi": "Cô ấy là một bà già đáng yêu và luôn tràn ngập tiếng cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are emphasizing that something is good because of the quality mentioned",
                    "vi": "được sử dụng khi bạn đang nhấn mạnh rằng một cái gì đó là tốt vì chất lượng được đề cập"
                },
                "examples": [
                    {
                        "en": "It's lovely and warm in here.",
                        "vi": "Ở đây thật dễ thương và ấm áp."
                    }
                ]
            }
        ]
    },
    {
        "id": "585fc2dfc4c64c77a324e45d7b47ff0a",
        "word": "polite",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/pəˈlaɪt/",
            "us": "/pəˈlaɪt/"
        },
        "nearby": [
            {
                "word": "polish off",
                "pos": "phrasal verb"
            },
            {
                "word": "politburo",
                "pos": "noun"
            },
            {
                "word": "polite",
                "pos": "adjective"
            },
            {
                "word": "politely",
                "pos": "adverb"
            },
            {
                "word": "politeness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or showing good manners and respect for the feelings of others",
                    "vi": "có hoặc thể hiện cách cư xử tốt và tôn trọng cảm xúc của người khác"
                },
                "examples": [
                    {
                        "en": "polite to somebody Please be polite to our guests.",
                        "vi": "lịch sự với ai đó Hãy lịch sự với khách của chúng tôi."
                    },
                    {
                        "en": "Our waiter was very polite and helpful.",
                        "vi": "Người phục vụ của chúng tôi rất lịch sự và hữu ích."
                    },
                    {
                        "en": "We were all too polite to object.",
                        "vi": "Tất cả chúng tôi đã quá lịch sự để phản đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "socially correct but not always sincere",
                    "vi": "xã hội đúng nhưng không phải lúc nào cũng chân thành"
                },
                "examples": [
                    {
                        "en": "I don't know how to make polite conversation.",
                        "vi": "Tôi không biết làm thế nào để nói chuyện lịch sự."
                    },
                    {
                        "en": "The performance was greeted with polite applause.",
                        "vi": "Màn biểu diễn được chào đón bằng những tràng pháo tay lịch sự."
                    },
                    {
                        "en": "She greeted me with a quick hello and a polite smile.",
                        "vi": "Cô ấy chào tôi bằng một câu chào nhanh và một nụ cười lịch sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "from a class of society that believes it is better than others",
                    "vi": "từ một tầng lớp trong xã hội tin rằng nó tốt hơn những người khác"
                },
                "examples": [
                    {
                        "en": "‘Bum’ is not a word we use in polite company.",
                        "vi": "Bum' không phải là từ chúng ta sử dụng trong các công ty lịch sự."
                    },
                    {
                        "en": "The scandal outraged polite society.",
                        "vi": "Vụ bê bối gây phẫn nộ xã hội lịch sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "f9df112329d54d36803c2be4851885b4",
        "word": "generous",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdʒenərəs/",
            "us": "/ˈdʒenərəs/"
        },
        "nearby": [
            {
                "word": "generically",
                "pos": "adverb"
            },
            {
                "word": "generosity",
                "pos": "noun"
            },
            {
                "word": "generous",
                "pos": "adjective"
            },
            {
                "word": "generously",
                "pos": "adverb"
            },
            {
                "word": "genesis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "giving or willing to give freely; given freely",
                    "vi": "cho hoặc sẵn sàng cho một cách tự do; cho một cách tự do"
                },
                "examples": [
                    {
                        "en": "The gallery was named after its most generous benefactor.",
                        "vi": "Phòng trưng bày được đặt tên theo nhà hảo tâm hào phóng nhất của nó."
                    },
                    {
                        "en": "a generous donation/gift/offer",
                        "vi": "một khoản đóng góp / món quà / đề nghị hào phóng"
                    },
                    {
                        "en": "generous with something You've been incredibly generous with your time.",
                        "vi": "hào phóng với điều gì đó Bạn đã vô cùng hào phóng với thời gian của mình."
                    },
                    {
                        "en": "generous to somebody He was generous to his friends and family.",
                        "vi": "hào phóng với ai đó Anh ấy hào phóng với bạn bè và gia đình của mình."
                    },
                    {
                        "en": "generous in something She was generous in her praise for her co-stars.",
                        "vi": "hào phóng trong một cái gì đó Cô ấy rất hào phóng khi khen ngợi bạn diễn của mình."
                    },
                    {
                        "en": "generous in doing something They were very generous in giving help",
                        "vi": "hào phóng khi làm điều gì đó Họ rất hào phóng trong việc giúp đỡ"
                    },
                    {
                        "en": "it is generous of somebody Thank you for your donation. It was very generous of you.",
                        "vi": "đó là sự hào phóng của ai đó Cảm ơn bạn đã đóng góp. Đó là rất hào phóng của bạn."
                    },
                    {
                        "en": "it is generous of somebody to do something It was extremely generous of him to offer to pay for us both.",
                        "vi": "Ai đó rất hào phóng khi làm điều gì đó. Anh ấy vô cùng hào phóng khi đề nghị trả tiền cho cả hai chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "more than is necessary; large",
                    "vi": "nhiều hơn mức cần thiết; lớn"
                },
                "examples": [
                    {
                        "en": "a generous helping of meat",
                        "vi": "một sự giúp đỡ hào phóng của thịt"
                    },
                    {
                        "en": "The car has a generous amount of space.",
                        "vi": "Xe có một khoảng không gian rộng rãi."
                    },
                    {
                        "en": "The review panel criticized the payments as overly generous.",
                        "vi": "Hội đồng đánh giá chỉ trích các khoản thanh toán là quá hào phóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind in the way you treat people; willing to see what is good about somebody/something",
                    "vi": "tử tế trong cách bạn đối xử với mọi người; sẵn sàng xem điều gì tốt về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a generous mind",
                        "vi": "một tâm hồn rộng lượng"
                    },
                    {
                        "en": "He wrote a very generous assessment of my work.",
                        "vi": "Anh ấy đã viết một đánh giá rất hào phóng về công việc của tôi."
                    },
                    {
                        "en": "Her generous spirit shone through in everything she did.",
                        "vi": "Tinh thần hào phóng của cô ấy đã tỏa sáng trong mọi việc cô ấy làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3affed7ad3b4ee8b1cc6875ad2c43cb",
        "word": "gentle",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdʒentl/",
            "us": "/ˈdʒentl/"
        },
        "nearby": [
            {
                "word": "gentile",
                "pos": "adjective"
            },
            {
                "word": "gentility",
                "pos": "noun"
            },
            {
                "word": "gentle",
                "pos": "adjective"
            },
            {
                "word": "gentlefolk",
                "pos": "noun"
            },
            {
                "word": "gentleman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "calm and kind; doing things in a quiet and careful way",
                    "vi": "điềm tĩnh và tốt bụng; làm mọi việc một cách yên tĩnh và cẩn thận"
                },
                "examples": [
                    {
                        "en": "a kind and gentle man",
                        "vi": "một người đàn ông tốt bụng và nhẹ nhàng"
                    },
                    {
                        "en": "Terry was a gentle soul.",
                        "vi": "Terry là một tâm hồn nhẹ nhàng."
                    },
                    {
                        "en": "He looks scary but he's really a gentle giant.",
                        "vi": "Anh ta trông đáng sợ nhưng anh ta thực sự là một người khổng lồ hiền lành."
                    },
                    {
                        "en": "She was the gentlest of nurses.",
                        "vi": "Cô ấy là người dịu dàng nhất trong các y tá."
                    },
                    {
                        "en": "a gentle voice/laugh/touch",
                        "vi": "một giọng nói nhẹ nhàng / cười / chạm vào"
                    },
                    {
                        "en": "a gentle reminder that your next payment is due on Friday",
                        "vi": "một lời nhắc nhở nhẹ nhàng rằng khoản thanh toán tiếp theo của bạn sẽ đến hạn vào thứ Sáu"
                    },
                    {
                        "en": "He lived in a gentler age than ours.",
                        "vi": "Anh ấy sống trong một thời đại dịu dàng hơn chúng ta."
                    },
                    {
                        "en": "gentle with somebody/something Be gentle with her!",
                        "vi": "nhẹ nhàng với ai đó / cái gì đó Hãy nhẹ nhàng với cô ấy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "not strong or extreme",
                    "vi": "không mạnh mẽ hoặc cực đoan"
                },
                "examples": [
                    {
                        "en": "a gentle breeze",
                        "vi": "một làn gió nhẹ"
                    },
                    {
                        "en": "the gentle swell of the sea",
                        "vi": "biển vỗ nhẹ"
                    },
                    {
                        "en": "Cook over a gentle heat.",
                        "vi": "Nấu trên lửa nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "having only a small effect; not strong or violent",
                    "vi": "chỉ có một ảnh hưởng nhỏ; không mạnh mẽ hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "We went for a gentle stroll.",
                        "vi": "Chúng tôi đi dạo nhẹ nhàng."
                    },
                    {
                        "en": "The doctor recommended a little gentle exercise.",
                        "vi": "Bác sĩ khuyên bạn nên tập thể dục nhẹ nhàng một chút."
                    },
                    {
                        "en": "gentle on something This soap is very gentle on the hands.",
                        "vi": "nhẹ nhàng trên một cái gì đó Xà phòng này rất nhẹ nhàng trên tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "not steep or sharp",
                    "vi": "không dốc hoặc sắc nét"
                },
                "examples": [
                    {
                        "en": "a gentle slope/curve",
                        "vi": "một đường cong / dốc thoải"
                    }
                ]
            }
        ]
    },
    {
        "id": "561aedbc751b4437ba47283e1796732a",
        "word": "grateful",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡreɪtfl/",
            "us": "/ˈɡreɪtfl/"
        },
        "nearby": [
            {
                "word": "grate",
                "pos": "noun"
            },
            {
                "word": "grate",
                "pos": "verb"
            },
            {
                "word": "grateful",
                "pos": "adjective"
            },
            {
                "word": "The Grateful Dead",
                "pos": ""
            },
            {
                "word": "gratefully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing thanks because somebody has done something kind for you or has done as you asked",
                    "vi": "cảm thấy hoặc bày tỏ sự cảm ơn vì ai đó đã làm điều gì đó tử tế cho bạn hoặc đã làm như bạn yêu cầu"
                },
                "examples": [
                    {
                        "en": "Thank you for doing this. I really am so grateful.",
                        "vi": "Cảm ơn bạn đã làm điều này. Tôi thực sự rất biết ơn."
                    },
                    {
                        "en": "grateful to somebody We are very grateful to all those who contributed.",
                        "vi": "biết ơn ai đó Chúng tôi rất biết ơn tất cả những người đã đóng góp."
                    },
                    {
                        "en": "grateful for something She said she was grateful for the support shown by the community.",
                        "vi": "biết ơn vì điều gì đó Cô ấy nói rằng cô ấy rất biết ơn vì sự hỗ trợ của cộng đồng."
                    },
                    {
                        "en": "grateful to somebody for something I am extremely grateful to all the teachers for their help.",
                        "vi": "biết ơn ai đó vì điều gì đó Tôi vô cùng biết ơn tất cả các giáo viên vì sự giúp đỡ của họ."
                    },
                    {
                        "en": "grateful to do something She seems to think I should be grateful to have a job at all.",
                        "vi": "biết ơn khi làm điều gì đó Cô ấy nghĩ rằng tôi nên biết ơn khi có một công việc nào đó."
                    },
                    {
                        "en": "grateful (that…) He was grateful that she didn't tell his parents about the incident.",
                        "vi": "biết ơn (điều đó…) Anh ấy biết ơn vì cô ấy đã không nói với bố mẹ anh ấy về vụ việc."
                    },
                    {
                        "en": "Grateful thanks are due to the following people for their help…",
                        "vi": "Cảm ơn sâu sắc là do những người sau đây đã giúp đỡ của họ…"
                    },
                    {
                        "en": "Kate gave him a grateful smile.",
                        "vi": "Kate nở một nụ cười biết ơn anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to make a request, especially in a letter or in a formal situation",
                    "vi": "được sử dụng để đưa ra một yêu cầu, đặc biệt là trong một bức thư hoặc trong một tình huống trang trọng"
                },
                "examples": [
                    {
                        "en": "I would be grateful if you could send the completed form back as soon as possible.",
                        "vi": "Tôi sẽ rất biết ơn nếu bạn có thể gửi lại biểu mẫu đã hoàn chỉnh càng sớm càng tốt."
                    },
                    {
                        "en": "I would be most grateful if you would keep this matter confidential.",
                        "vi": "Tôi sẽ rất biết ơn nếu bạn giữ bí mật vấn đề này."
                    },
                    {
                        "en": "grateful for something We would be grateful for any information you can give us.",
                        "vi": "biết ơn vì điều gì đó Chúng tôi sẽ biết ơn về bất kỳ thông tin nào bạn có thể cung cấp cho chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "4d2544caad514264b6c38efadffa8f89",
        "word": "kind",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/kaɪnd/",
            "us": "/kaɪnd/"
        },
        "nearby": [
            {
                "word": "kinaesthesia",
                "pos": "noun"
            },
            {
                "word": "kind",
                "pos": "noun"
            },
            {
                "word": "kind",
                "pos": "adjective"
            },
            {
                "word": "kinder",
                "pos": "noun"
            },
            {
                "word": "kindergarten",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "caring about others; gentle, friendly and generous",
                    "vi": "quan tâm đến người khác; nhẹ nhàng, thân thiện và hào phóng"
                },
                "examples": [
                    {
                        "en": "a very kind and helpful person",
                        "vi": "một người rất tốt bụng và hữu ích"
                    },
                    {
                        "en": "a kind heart/face",
                        "vi": "một trái tim nhân hậu / khuôn mặt"
                    },
                    {
                        "en": "a kind action/gesture/comment",
                        "vi": "một hành động / cử chỉ / nhận xét tử tế"
                    },
                    {
                        "en": "You've been very kind.",
                        "vi": "Bạn đã rất tốt."
                    },
                    {
                        "en": "kind to somebody/something kind to animals",
                        "vi": "tử tế với ai đó / tử tế với động vật"
                    },
                    {
                        "en": "(figurative) Soft water is kinder to your hair.",
                        "vi": "(nghĩa bóng) Nước mềm sẽ tốt hơn cho tóc của bạn."
                    },
                    {
                        "en": "(figurative) The weather was very kind to us.",
                        "vi": "(nghĩa bóng) Thời tiết rất tốt với chúng tôi."
                    },
                    {
                        "en": "kind to do something Was it kind to let her find out this way?",
                        "vi": "tử tế khi làm điều gì đó Có tử tế không khi để cô ấy tìm ra cách này?"
                    },
                    {
                        "en": "He was kind enough to take time out of his busy schedule to come here today.",
                        "vi": "Anh ấy đủ tốt bụng để bỏ thời gian ra khỏi lịch trình bận rộn của mình để đến đây hôm nay."
                    },
                    {
                        "en": "it is kind of somebody I think it was very kind of her.",
                        "vi": "đó là loại người mà tôi nghĩ đó là loại người rất tốt với cô ấy."
                    },
                    {
                        "en": "it is kind of somebody to do something It was really kind of you to help me.",
                        "vi": "Đó là loại ai đó làm điều gì đó. Thật là tốt bụng khi bạn giúp tôi."
                    },
                    {
                        "en": "(formal) Thank you for your kind words.",
                        "vi": "(trang trọng) Cảm ơn bạn vì những lời tốt đẹp của bạn."
                    },
                    {
                        "en": "The poems are reprinted here by kind permission of the author.",
                        "vi": "Các bài thơ được in lại ở đây với sự cho phép của tác giả."
                    },
                    {
                        "en": "(formal) ‘Do have another.’ ‘That's very kind of you (= thank you).’",
                        "vi": "(trang trọng) 'Do có cái khác.' 'Bạn rất tốt (= cảm ơn).'"
                    },
                    {
                        "en": "We need a kinder, gentler society.",
                        "vi": "Chúng ta cần một xã hội tử tế hơn, dịu dàng hơn."
                    },
                    {
                        "en": "If an animal is badly injured, often the kindest thing to do is to destroy it painlessly.",
                        "vi": "Nếu một con vật bị thương nặng, điều tốt nhất nên làm là tiêu diệt nó một cách không đau đớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to make a polite request or give an order",
                    "vi": "được sử dụng để đưa ra một yêu cầu lịch sự hoặc đưa ra một đơn đặt hàng"
                },
                "examples": [
                    {
                        "en": "Would you be kind enough to close the window?",
                        "vi": "Bạn có đủ tử tế để đóng cửa sổ không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "8b820de48bc849369d4b43b02a0ad1fa",
        "word": "kindness",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkaɪndnəs/",
            "us": "/ˈkaɪndnəs/"
        },
        "nearby": [
            {
                "word": "kindly",
                "pos": "adverb"
            },
            {
                "word": "kindly",
                "pos": "adjective"
            },
            {
                "word": "kindness",
                "pos": "noun"
            },
            {
                "word": "kindred",
                "pos": "noun"
            },
            {
                "word": "kindred",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being kind",
                    "vi": "phẩm chất của sự tử tế"
                },
                "examples": [
                    {
                        "en": "to treat somebody with kindness and consideration",
                        "vi": "đối xử tử tế và cân nhắc với ai đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "a kind act",
                    "vi": "một hành động tử tế"
                },
                "examples": [
                    {
                        "en": "I can never repay your many kindnesses to me.",
                        "vi": "Tôi không bao giờ có thể đền đáp nhiều lòng tốt của bạn dành cho tôi."
                    },
                    {
                        "en": "Small kindnesses meant a lot to her.",
                        "vi": "Những lòng tốt nhỏ bé có ý nghĩa rất lớn đối với cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be so kind to somebody/something that you in fact harm them",
                    "vi": "đối xử tốt với ai đó / điều gì đó mà bạn thực sự làm hại họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "kind behaviour, considered to be natural to humans",
                    "vi": "hành vi tử tế, được coi là tự nhiên của con người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d784318d4c8479d829a951b72d24d06",
        "word": "understanding",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌndəˈstændɪŋ/",
            "us": "/ˌʌndərˈstændɪŋ/"
        },
        "nearby": [
            {
                "word": "understandably",
                "pos": "adverb"
            },
            {
                "word": "understanding",
                "pos": "noun"
            },
            {
                "word": "understanding",
                "pos": "adjective"
            },
            {
                "word": "understandingly",
                "pos": "adverb"
            },
            {
                "word": "understate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing sympathy for other people’s problems and being willing to forgive them when they do something wrong",
                    "vi": "thể hiện sự thông cảm với những vấn đề của người khác và sẵn sàng tha thứ cho họ khi họ làm điều gì sai trái"
                },
                "examples": [
                    {
                        "en": "She has very understanding parents.",
                        "vi": "Cô ấy có bố mẹ rất hiểu chuyện."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ad885265cfc477684dd15ffbc654406",
        "word": "caring",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkeərɪŋ/",
            "us": "/ˈkerɪŋ/"
        },
        "nearby": [
            {
                "word": "caries",
                "pos": "noun"
            },
            {
                "word": "carillon",
                "pos": "noun"
            },
            {
                "word": "caring",
                "pos": "adjective"
            },
            {
                "word": "carious",
                "pos": "adjective"
            },
            {
                "word": "carjack",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, helpful and showing that you care about other people",
                    "vi": "tốt bụng, hữu ích và thể hiện rằng bạn quan tâm đến người khác"
                },
                "examples": [
                    {
                        "en": "He's a very caring person.",
                        "vi": "Anh ấy là một người rất quan tâm."
                    },
                    {
                        "en": "caring parents",
                        "vi": "cha mẹ quan tâm"
                    },
                    {
                        "en": "Children need a caring environment.",
                        "vi": "Trẻ em cần một môi trường chăm sóc."
                    },
                    {
                        "en": "a caring profession (= a job that involves looking after or helping other people)",
                        "vi": "một nghề quan tâm (= một công việc liên quan đến việc chăm sóc hoặc giúp đỡ người khác)"
                    },
                    {
                        "en": "He was described as ‘a good man, a caring father and a considerate neighbour’.",
                        "vi": "Anh được mô tả là 'một người đàn ông tốt, một người cha chu đáo và một người hàng xóm chu đáo'."
                    }
                ]
            }
        ]
    },
    {
        "id": "00508d0aef194d1a96a104f81b1452c8",
        "word": "comfort",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkʌmfət/",
            "us": "/ˈkʌmfərt/"
        },
        "nearby": [
            {
                "word": "comfit",
                "pos": "noun"
            },
            {
                "word": "comfort",
                "pos": "noun"
            },
            {
                "word": "comfort",
                "pos": "verb"
            },
            {
                "word": "comfortable",
                "pos": "adjective"
            },
            {
                "word": "comfortably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody who is worried or unhappy feel better by being kind and showing sympathy to them",
                    "vi": "để làm cho ai đó đang lo lắng hoặc không vui cảm thấy tốt hơn bằng cách tử tế và bày tỏ sự cảm thông với họ"
                },
                "examples": [
                    {
                        "en": "comfort somebody The victim's widow was today being comforted by family and friends.",
                        "vi": "an ủi ai đó Bà góa của nạn nhân hôm nay được gia đình và bạn bè an ủi."
                    },
                    {
                        "en": "The idea that he was not alone comforted him greatly.",
                        "vi": "Ý tưởng rằng anh không ở một mình đã an ủi anh rất nhiều."
                    },
                    {
                        "en": "I am comforted by the fact that Jamie died doing what he liked best.",
                        "vi": "Tôi được an ủi bởi thực tế là Jamie đã chết khi làm những gì anh ấy thích nhất."
                    },
                    {
                        "en": "comfort yourself with something She comforted herself with the thought that it would soon be spring.",
                        "vi": "tự an ủi mình bằng điều gì đó Cô tự an ủi mình với ý nghĩ chẳng mấy chốc sẽ sang xuân."
                    },
                    {
                        "en": "be comforted to do something He was comforted to know that most people in the class knew even less than he.",
                        "vi": "được an ủi để làm điều gì đó Anh ấy được an ủi khi biết rằng hầu hết mọi người trong lớp biết thậm chí ít hơn anh ấy."
                    },
                    {
                        "en": "it comforts somebody to do something It comforted her to feel his arms around her.",
                        "vi": "nó an ủi ai đó làm điều gì đó Nó an ủi cô ấy khi cảm thấy vòng tay anh ấy ôm lấy cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "e61fd4370ea94790bfaa0a76db9ff43a",
        "word": "sensitive",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsensətɪv/",
            "us": "/ˈsensətɪv/"
        },
        "nearby": [
            {
                "word": "sensible",
                "pos": "adjective"
            },
            {
                "word": "sensibly",
                "pos": "adverb"
            },
            {
                "word": "sensitive",
                "pos": "adjective"
            },
            {
                "word": "sensitively",
                "pos": "adverb"
            },
            {
                "word": "sensitivity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "aware of and able to understand other people and their feelings",
                    "vi": "nhận thức và có thể hiểu người khác và cảm xúc của họ"
                },
                "examples": [
                    {
                        "en": "a sensitive and caring man",
                        "vi": "một người đàn ông nhạy cảm và quan tâm"
                    },
                    {
                        "en": "sensitive to something She is very sensitive to other people's feelings.",
                        "vi": "nhạy cảm với điều gì Cô ấy rất nhạy cảm với cảm xúc của người khác."
                    },
                    {
                        "en": "Schools must be sensitive to the needs of students from different backgrounds.",
                        "vi": "Các trường học phải nhạy cảm với các nhu cầu của học sinh từ các thành phần khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "reacting quickly or more than usual to something",
                    "vi": "phản ứng nhanh hoặc nhiều hơn bình thường với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "sensitive areas of the body",
                        "vi": "vùng nhạy cảm của cơ thể"
                    },
                    {
                        "en": "sensitive to something My teeth are very sensitive to cold food.",
                        "vi": "nhạy cảm với thứ gì đó Răng của tôi rất nhạy cảm với thức ăn lạnh."
                    },
                    {
                        "en": "Young children are particularly sensitive to the harmful effects of pesticides.",
                        "vi": "Trẻ nhỏ là đối tượng đặc biệt nhạy cảm với tác hại của thuốc trừ sâu."
                    },
                    {
                        "en": "The eyes of some fish are acutely sensitive to light.",
                        "vi": "Đôi mắt của một số loài cá rất nhạy cảm với ánh sáng."
                    },
                    {
                        "en": "I have become increasingly sensitive to the sun.",
                        "vi": "Tôi ngày càng trở nên nhạy cảm với ánh nắng mặt trời."
                    },
                    {
                        "en": "These drugs can make skin extremely sensitive to sunlight.",
                        "vi": "Những loại thuốc này có thể làm cho da cực kỳ nhạy cảm với ánh nắng."
                    },
                    {
                        "en": "Coral reefs are very sensitive to changes in seawater temperature.",
                        "vi": "Các rạn san hô rất nhạy cảm với sự thay đổi của nhiệt độ nước biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to understand art, music and literature and to express yourself through them",
                    "vi": "có thể hiểu nghệ thuật, âm nhạc và văn học và thể hiện bản thân thông qua chúng"
                },
                "examples": [
                    {
                        "en": "an actor’s sensitive reading of the poem",
                        "vi": "một diễn viên nhạy cảm đọc bài thơ"
                    },
                    {
                        "en": "a sensitive portrait",
                        "vi": "một bức chân dung nhạy cảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "easily offended or upset",
                    "vi": "dễ bị xúc phạm hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "You're far too sensitive.",
                        "vi": "Bạn quá nhạy cảm."
                    },
                    {
                        "en": "sensitive about something He's very sensitive about his weight.",
                        "vi": "nhạy cảm về điều gì đó Anh ấy rất nhạy cảm về cân nặng của mình."
                    },
                    {
                        "en": "sensitive to something She's very sensitive to criticism.",
                        "vi": "nhạy cảm với điều gì Cô ấy rất nhạy cảm với những lời chỉ trích."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you have to treat with great care because it may offend people or make them angry or embarrassed",
                    "vi": "mà bạn phải đối xử hết sức cẩn thận vì nó có thể xúc phạm mọi người hoặc khiến họ tức giận hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "sensitive information/data",
                        "vi": "thông tin / dữ liệu nhạy cảm"
                    },
                    {
                        "en": "highly sensitive documents",
                        "vi": "tài liệu nhạy cảm cao"
                    },
                    {
                        "en": "Healthcare is a politically sensitive issue.",
                        "vi": "Chăm sóc sức khỏe là một vấn đề nhạy cảm về mặt chính trị."
                    },
                    {
                        "en": "That's a sensitive area.",
                        "vi": "Đó là một khu vực nhạy cảm."
                    },
                    {
                        "en": "a sensitive subject/topic/matter",
                        "vi": "một chủ đề / chủ đề / vấn đề nhạy cảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "able to measure very small changes",
                    "vi": "có thể đo lường những thay đổi rất nhỏ"
                },
                "examples": [
                    {
                        "en": "a sensitive instrument",
                        "vi": "một công cụ nhạy cảm"
                    },
                    {
                        "en": "The eyes can be a sensitive indicator of health.",
                        "vi": "Đôi mắt có thể là một chỉ số nhạy cảm về sức khỏe."
                    },
                    {
                        "en": "(figurative) The Stock Exchange is very sensitive to political change.",
                        "vi": "(nghĩa bóng) Sở giao dịch chứng khoán rất nhạy cảm với sự thay đổi chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc4540e0690344228e1d1351927e6c5c",
        "word": "sympathetic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsɪmpəˈθetɪk/",
            "us": "/ˌsɪmpəˈθetɪk/"
        },
        "nearby": [
            {
                "word": "symmetrically",
                "pos": "adverb"
            },
            {
                "word": "symmetry",
                "pos": "noun"
            },
            {
                "word": "sympathetic",
                "pos": "adjective"
            },
            {
                "word": "sympathetically",
                "pos": "adverb"
            },
            {
                "word": "sympathize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind to somebody who is hurt or sad; showing that you understand and care about their problems",
                    "vi": "tử tế với ai đó đang bị tổn thương hoặc buồn bã; cho thấy rằng bạn hiểu và quan tâm đến vấn đề của họ"
                },
                "examples": [
                    {
                        "en": "a sympathetic listener",
                        "vi": "một người nghe thông cảm"
                    },
                    {
                        "en": "a sympathetic response",
                        "vi": "một phản ứng thông cảm"
                    },
                    {
                        "en": "She was very sympathetic when I was sick.",
                        "vi": "Cô ấy rất thông cảm khi tôi bị ốm."
                    },
                    {
                        "en": "sympathetic to/towards somebody I did not feel at all sympathetic towards Kate.",
                        "vi": "cảm thông với / đối với ai đó Tôi không cảm thấy có thiện cảm với Kate."
                    },
                    {
                        "en": "I'm here if you need a sympathetic ear (= somebody to talk to about your problems).",
                        "vi": "Tôi ở đây nếu bạn cần một đôi tai thông cảm (= ai đó để trò chuyện về vấn đề của bạn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing that you approve of somebody/something or that you share their views and are willing to support them",
                    "vi": "cho thấy rằng bạn tán thành ai đó / điều gì đó hoặc bạn chia sẻ quan điểm của họ và sẵn sàng hỗ trợ họ"
                },
                "examples": [
                    {
                        "en": "He was speaking to a highly sympathetic audience.",
                        "vi": "Anh ấy đang nói chuyện với một khán giả rất thông cảm."
                    },
                    {
                        "en": "sympathetic to/towards somebody/something to be sympathetic to the party’s aims",
                        "vi": "đồng cảm với / đối với ai đó / điều gì đó để đồng cảm với mục tiêu của bên"
                    },
                    {
                        "en": "Russian newspapers are largely sympathetic to the president.",
                        "vi": "Báo chí Nga phần lớn có thiện cảm với tổng thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to like",
                    "vi": "dễ thích"
                },
                "examples": [
                    {
                        "en": "a sympathetic character in a novel",
                        "vi": "một nhân vật đồng cảm trong một cuốn tiểu thuyết"
                    },
                    {
                        "en": "I don't find her a very sympathetic person.",
                        "vi": "Tôi không thấy cô ấy là một người có thiện cảm cho lắm."
                    },
                    {
                        "en": "The character's faults actually make him more sympathetic.",
                        "vi": "Những lỗi lầm của nhân vật thực sự khiến anh ấy thông cảm hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "36ae19c2ae1b4d8e950d926a35dc1203",
        "word": "sympathy",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɪmpəθi/",
            "us": "/ˈsɪmpəθi/"
        },
        "nearby": [
            {
                "word": "sympathize",
                "pos": "verb"
            },
            {
                "word": "sympathizer",
                "pos": "noun"
            },
            {
                "word": "sympathy",
                "pos": "noun"
            },
            {
                "word": "symphonic",
                "pos": "adjective"
            },
            {
                "word": "symphony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of being sorry for somebody; showing that you understand and care about somebody’s problems",
                    "vi": "cảm giác có lỗi với ai đó; cho thấy rằng bạn hiểu và quan tâm đến vấn đề của ai đó"
                },
                "examples": [
                    {
                        "en": "sympathy for somebody to express/feel sympathy for somebody",
                        "vi": "cảm thông cho ai đó để bày tỏ / cảm thấy thông cảm cho ai đó"
                    },
                    {
                        "en": "I have no sympathy for Jan—it's all her own fault.",
                        "vi": "Tôi không có thiện cảm với Jan — tất cả đều là lỗi của cô ấy."
                    },
                    {
                        "en": "I wish he'd show me a little more sympathy.",
                        "vi": "Tôi ước anh ấy sẽ thông cảm cho tôi nhiều hơn một chút."
                    },
                    {
                        "en": "Our heartfelt sympathy goes out to the victims of the war.",
                        "vi": "Sự cảm thông chân thành của chúng tôi dành cho các nạn nhân của cuộc chiến."
                    },
                    {
                        "en": "out of sympathy for somebody Shops were closed out of sympathy for the victims.",
                        "vi": "vì thương cảm cho ai đó Các cửa hàng đã bị đóng cửa vì thương cảm cho các nạn nhân."
                    },
                    {
                        "en": "(formal) May we offer our deepest sympathies on the death of your wife.",
                        "vi": "(chính thức) Mong chúng tôi thông cảm sâu sắc nhất về cái chết của vợ bạn."
                    },
                    {
                        "en": "(formal) I would like to extend our sincere sympathies to his family at this sad time.",
                        "vi": "(trang trọng) Tôi xin gửi lời thông cảm chân thành đến gia đình anh ấy vào thời điểm đau buồn này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of showing support for or approval of an idea, a cause, an organization, etc.",
                    "vi": "hành động thể hiện sự ủng hộ hoặc tán thành một ý tưởng, một mục tiêu, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "in sympathy with somebody/something The seamen went on strike in sympathy with (= to show their support for) the dockers.",
                        "vi": "trong sự đồng cảm với ai đó / cái gì đó Các thủy thủ đã đình công trong sự đồng cảm với (= để thể hiện sự ủng hộ của họ đối với) những người thợ neo đậu."
                    },
                    {
                        "en": "Her sympathies lie with the anti-abortion lobby.",
                        "vi": "Sự đồng cảm của cô ấy nằm ở hành lang chống phá thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "friendship and understanding between people who have similar opinions or interests",
                    "vi": "tình bạn và sự hiểu biết giữa những người có cùng quan điểm hoặc sở thích"
                },
                "examples": [
                    {
                        "en": "There was no personal sympathy between them.",
                        "vi": "Không có sự đồng cảm cá nhân giữa họ."
                    },
                    {
                        "en": "He has a total lack of sympathy for young people.",
                        "vi": "Anh ấy hoàn toàn thiếu thiện cảm với những người trẻ tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "happening because something else has happened",
                    "vi": "đang xảy ra bởi vì điều gì đó khác đã xảy ra"
                },
                "examples": [
                    {
                        "en": "Share prices slipped in sympathy with the German market.",
                        "vi": "Giá cổ phiếu sụt giảm trong sự thông cảm với thị trường Đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "not agreeing with or not wanting to support somebody/something",
                    "vi": "không đồng ý hoặc không muốn hỗ trợ ai đó / điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "162b345a134241859423d7a24b8111c1",
        "word": "angel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈeɪndʒl/",
            "us": "/ˈeɪndʒl/"
        },
        "nearby": [
            {
                "word": "Anfield",
                "pos": ""
            },
            {
                "word": "The Angel, Islington",
                "pos": ""
            },
            {
                "word": "angel",
                "pos": "noun"
            },
            {
                "word": "Angela",
                "pos": ""
            },
            {
                "word": "angel dust",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a spirit who is believed to be a servant of God, and is sent by God to deliver a message or perform a task. Angels are often shown dressed in white, with wings.",
                    "vi": "một linh hồn được cho là tôi tớ của Đức Chúa Trời, và được Đức Chúa Trời cử đến để đưa ra một thông điệp hoặc thực hiện một nhiệm vụ. Các thiên thần thường mặc đồ trắng, có cánh."
                },
                "examples": [
                    {
                        "en": "a host of angels",
                        "vi": "một loạt các thiên thần"
                    },
                    {
                        "en": "She looks like an angel.",
                        "vi": "Cô ấy trông giống như một thiên thần."
                    },
                    {
                        "en": "a singer who has the voice of an angel",
                        "vi": "một ca sĩ có giọng hát của một thiên thần"
                    },
                    {
                        "en": "She wore a white costume with big furry angel wings.",
                        "vi": "Cô mặc một bộ trang phục màu trắng với đôi cánh thiên thần lớn đầy lông thú."
                    },
                    {
                        "en": "a book about anti-heroes and fallen angels",
                        "vi": "một cuốn sách về phản anh hùng và thiên thần sa ngã"
                    },
                    {
                        "en": "He liked to think of himself as an avenging angel fighting for justice.",
                        "vi": "Anh thích nghĩ về mình như một thiên thần báo thù chiến đấu cho công lý."
                    },
                    {
                        "en": "We lay back in the snow and made snow angels (= a shape made by moving your arms and legs back and forward while lying in snow).",
                        "vi": "Chúng tôi nằm lại trong tuyết và tạo ra các thiên thần tuyết (= một hình dạng được tạo ra bằng cách di chuyển cánh tay và chân của bạn về phía trước và về phía trước khi nằm trong tuyết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very good and kind; a child who behaves well",
                    "vi": "một người rất tốt và tốt bụng; một đứa trẻ cư xử tốt"
                },
                "examples": [
                    {
                        "en": "John is no angel, believe me (= he does not behave well).",
                        "vi": "John không phải là thiên thần, hãy tin tôi (= anh ấy cư xử không tốt)."
                    },
                    {
                        "en": "Mary’s children are little angels.",
                        "vi": "Các con của Mary là những thiên thần nhỏ."
                    },
                    {
                        "en": "I could hardly see Lisa in the role of ministering angel.",
                        "vi": "Tôi khó có thể nhìn thấy Lisa trong vai thiên thần hầu hạ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are talking to somebody and you are grateful to them",
                    "vi": "được sử dụng khi bạn đang nói chuyện với ai đó và bạn biết ơn họ"
                },
                "examples": [
                    {
                        "en": "Thanks Dad, you're an angel.",
                        "vi": "Cảm ơn bố, con là một thiên thần."
                    },
                    {
                        "en": "Be an angel and make me a cup of coffee.",
                        "vi": "Hãy là một thiên thần và pha cho tôi một tách cà phê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who supports a business by investing money in it, especially somebody who supports a new small business with their own money",
                    "vi": "một người hỗ trợ một doanh nghiệp bằng cách đầu tư tiền vào đó, đặc biệt là một người nào đó hỗ trợ một doanh nghiệp nhỏ mới bằng tiền của họ"
                },
                "examples": [
                    {
                        "en": "When will the angels get their money back?",
                        "vi": "Khi nào các thiên thần sẽ lấy lại được tiền?"
                    },
                    {
                        "en": "They started the business with the help of $2 million supplied by angel investors.",
                        "vi": "Họ bắt đầu kinh doanh với sự giúp đỡ của 2 triệu đô la do các nhà đầu tư thiên thần cung cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing",
                    "vi": "những người có ít kinh nghiệm cố gắng làm những việc khó khăn hoặc nguy hiểm mà những người có kinh nghiệm hơn sẽ không cho là làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a7dc60ae19454274aefa1e5184572feb",
        "word": "big-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbɪɡ ˈhɑːtɪd/",
            "us": "/ˌbɪɡ ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "big-head",
                "pos": "noun"
            },
            {
                "word": "big-headed",
                "pos": "adjective"
            },
            {
                "word": "big-hearted",
                "pos": "adjective"
            },
            {
                "word": "big hitter",
                "pos": "noun"
            },
            {
                "word": "the big house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very kind; generous",
                    "vi": "rất tốt bụng; rộng lượng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "57d9c4723ded40b1b6e3f4af8dcc5e12",
        "word": "broad-minded",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbrɔːd ˈmaɪndɪd/",
            "us": "/ˌbrɔːd ˈmaɪndɪd/"
        },
        "nearby": [
            {
                "word": "broadleaved",
                "pos": "adjective"
            },
            {
                "word": "broadly",
                "pos": "adverb"
            },
            {
                "word": "broad-minded",
                "pos": "adjective"
            },
            {
                "word": "broad-mindedness",
                "pos": "noun"
            },
            {
                "word": "Broadmoor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "willing to listen to other people’s opinions and accept behaviour that is different from your own",
                    "vi": "sẵn sàng lắng nghe ý kiến của người khác và chấp nhận hành vi khác với hành vi của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba756b1a77114ad2a42aa4a67f7e65ff",
        "word": "charitable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃærətəbl/",
            "us": "/ˈtʃærətəbl/"
        },
        "nearby": [
            {
                "word": "charismatic",
                "pos": "noun"
            },
            {
                "word": "charismatically",
                "pos": "adverb"
            },
            {
                "word": "charitable",
                "pos": "adjective"
            },
            {
                "word": "charitably",
                "pos": "adverb"
            },
            {
                "word": "charity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a charity or charities",
                    "vi": "kết nối với một tổ chức từ thiện hoặc các tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "a charitable institution/foundation/trust",
                        "vi": "một tổ chức từ thiện / quỹ / quỹ tín thác"
                    },
                    {
                        "en": "a charitable donation/gift",
                        "vi": "quyên góp / quà tặng từ thiện"
                    },
                    {
                        "en": "(British English) to have charitable status (= to be an official charity)",
                        "vi": "(Tiếng Anh Anh) để có trạng thái từ thiện (= trở thành một tổ chức từ thiện chính thức)"
                    }
                ]
            },
            {
                "define": {
                    "en": "helping people who are poor or in need",
                    "vi": "giúp đỡ những người nghèo hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "His later years were devoted largely to charitable work.",
                        "vi": "Những năm sau này của ông được dành phần lớn cho công việc từ thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind in your attitude to other people, especially when you are judging them",
                    "vi": "tử tế trong thái độ của bạn với người khác, đặc biệt là khi bạn đang đánh giá họ"
                },
                "examples": [
                    {
                        "en": "Let's be charitable and assume she just made a mistake.",
                        "vi": "Hãy làm từ thiện và cho rằng cô ấy chỉ phạm sai lầm."
                    },
                    {
                        "en": "Less charitable accounts of his character say he was vain and selfish.",
                        "vi": "Các tài khoản ít từ thiện về nhân vật của anh ta nói rằng anh ta vô ích và ích kỷ."
                    }
                ]
            }
        ]
    },
    {
        "id": "5de2321850d047a8bd42bd754fcd1c21",
        "word": "considerate",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈsɪdərət/",
            "us": "/kənˈsɪdərət/"
        },
        "nearby": [
            {
                "word": "considerable",
                "pos": "adjective"
            },
            {
                "word": "considerably",
                "pos": "adverb"
            },
            {
                "word": "considerate",
                "pos": "adjective"
            },
            {
                "word": "considerately",
                "pos": "adverb"
            },
            {
                "word": "consideration",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "always thinking of other people’s wishes and feelings; careful not to hurt or upset others",
                    "vi": "luôn nghĩ đến mong muốn và cảm xúc của người khác; cẩn thận để không làm tổn thương hoặc khó chịu người khác"
                },
                "examples": [
                    {
                        "en": "She is always polite and considerate towards her employees.",
                        "vi": "Cô ấy luôn lịch sự và ân cần đối với nhân viên của mình."
                    },
                    {
                        "en": "It was very considerate of him to wait.",
                        "vi": "Nó là rất chu đáo của anh ta để chờ đợi."
                    },
                    {
                        "en": "Louis was a kind, caring and considerate young man.",
                        "vi": "Louis là một chàng trai tốt bụng, chu đáo và chu đáo."
                    },
                    {
                        "en": "Try to be a bit more considerate.",
                        "vi": "Cố gắng chu đáo hơn một chút."
                    }
                ]
            }
        ]
    },
    {
        "id": "86ebc0df9923481a8bc97f25d652e415",
        "word": "darling",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdɑːlɪŋ/",
            "us": "/ˈdɑːrlɪŋ/"
        },
        "nearby": [
            {
                "word": "dark store",
                "pos": "noun"
            },
            {
                "word": "the Dark Web",
                "pos": "noun"
            },
            {
                "word": "darling",
                "pos": "noun"
            },
            {
                "word": "Grace Darling",
                "pos": ""
            },
            {
                "word": "darling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of addressing somebody that you love",
                    "vi": "một cách xưng hô với ai đó mà bạn yêu quý"
                },
                "examples": [
                    {
                        "en": "What's the matter, darling?",
                        "vi": "Có chuyện gì vậy anh yêu?"
                    },
                    {
                        "en": "I love you too, my darling.",
                        "vi": "Anh cũng yêu em, em yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very friendly and kind",
                    "vi": "một người rất thân thiện và tốt bụng"
                },
                "examples": [
                    {
                        "en": "You are a darling, Hugo.",
                        "vi": "Bạn là một người yêu dấu, Hugo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is especially liked and very popular",
                    "vi": "một người đặc biệt được yêu thích và rất nổi tiếng"
                },
                "examples": [
                    {
                        "en": "She is the darling of the newspapers and can do no wrong.",
                        "vi": "Cô ấy là con cưng của các tờ báo và không thể làm gì sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "6dfa91ac4196467bb78abde373c3f697",
        "word": "dear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪə(r)/",
            "us": "/dɪr/"
        },
        "nearby": [
            {
                "word": "dear",
                "pos": "adjective"
            },
            {
                "word": "dear",
                "pos": "exclamation"
            },
            {
                "word": "dear",
                "pos": "noun"
            },
            {
                "word": "dear",
                "pos": "adverb"
            },
            {
                "word": "Dear Abby",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kind person",
                    "vi": "một người tốt bụng"
                },
                "examples": [
                    {
                        "en": "Isn't he a dear?",
                        "vi": "Anh ấy không phải là người thân yêu sao?"
                    },
                    {
                        "en": "Be a dear and fetch me my coat.",
                        "vi": "Hãy là một người thân yêu và lấy cho tôi áo khoác của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when speaking to somebody you love",
                    "vi": "được sử dụng khi nói chuyện với người bạn yêu"
                },
                "examples": [
                    {
                        "en": "Would you like a drink, dear?",
                        "vi": "Bạn có muốn uống một ly không, bạn thân mến?"
                    },
                    {
                        "en": "Come here, my dear.",
                        "vi": "Đến đây, anh yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when speaking to somebody in a friendly way, for example by an older person to a young person or a child",
                    "vi": "được sử dụng khi nói chuyện với ai đó một cách thân thiện, ví dụ như một người lớn tuổi với một người trẻ tuổi hoặc một đứa trẻ"
                },
                "examples": [
                    {
                        "en": "What's your name, dear?",
                        "vi": "Bạn tên La Gi, thân mên?"
                    }
                ]
            }
        ]
    },
    {
        "id": "674e42854752414f80aaa0e52f8b43ca",
        "word": "dependable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈpendəbl/",
            "us": "/dɪˈpendəbl/"
        },
        "nearby": [
            {
                "word": "depend",
                "pos": "verb"
            },
            {
                "word": "dependability",
                "pos": "noun"
            },
            {
                "word": "dependable",
                "pos": "adjective"
            },
            {
                "word": "dependant",
                "pos": "noun"
            },
            {
                "word": "dependence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that can be relied on to do what you want or need",
                    "vi": "có thể dựa vào đó để làm những gì bạn muốn hoặc cần"
                },
                "examples": [
                    {
                        "en": "She is loyal and totally dependable.",
                        "vi": "Cô ấy trung thành và hoàn toàn đáng tin cậy."
                    },
                    {
                        "en": "The service was not entirely dependable and flights were often cancelled.",
                        "vi": "Dịch vụ này không hoàn toàn đáng tin cậy và các chuyến bay thường bị hủy."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd8a5244888b4becb426eb2c9ad5c274",
        "word": "empathy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈempəθi/",
            "us": "/ˈempəθi/"
        },
        "nearby": [
            {
                "word": "empathetically",
                "pos": "adverb"
            },
            {
                "word": "empathize",
                "pos": "verb"
            },
            {
                "word": "empathy",
                "pos": "noun"
            },
            {
                "word": "emperor",
                "pos": "noun"
            },
            {
                "word": "emperor penguin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to understand another person’s feelings, experience, etc.",
                    "vi": "khả năng hiểu được cảm xúc, kinh nghiệm của người khác, v.v."
                },
                "examples": [
                    {
                        "en": "empathy (with somebody/something) the writer’s imaginative empathy with his subject",
                        "vi": "sự đồng cảm (với ai đó / cái gì đó) sự đồng cảm trong tưởng tượng của nhà văn với chủ đề của anh ta"
                    },
                    {
                        "en": "empathy (for somebody/something) empathy for other people’s situations",
                        "vi": "đồng cảm (đối với ai đó / điều gì đó) đồng cảm với hoàn cảnh của người khác"
                    },
                    {
                        "en": "empathy (between A and B) The empathy between the two women was obvious.",
                        "vi": "sự đồng cảm (giữa A và B) Sự đồng cảm giữa hai người phụ nữ rất rõ ràng."
                    }
                ]
            }
        ]
    },
    {
        "id": "533bc55d26ec4413b0db078ffd9125d9",
        "word": "good-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɡʊd ˈhɑːtɪd/",
            "us": "/ˌɡʊd ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "Good Friday",
                "pos": "noun"
            },
            {
                "word": "the Good Friday Agreement",
                "pos": ""
            },
            {
                "word": "good-hearted",
                "pos": "adjective"
            },
            {
                "word": "Good Housekeeping",
                "pos": ""
            },
            {
                "word": "good humour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind; willing to help other people",
                    "vi": "Tốt bụng; sẵn sàng giúp đỡ người khác"
                },
                "examples": [
                    {
                        "en": "To be fair, she was a good-hearted woman who tried to do her best.",
                        "vi": "Công bằng mà nói, cô ấy là một người phụ nữ tốt bụng và cố gắng làm hết sức mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d8fbf9d9ce54c6e939fe22aff7f1c96",
        "word": "good nature",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɡʊd ˈneɪtʃə(r)/",
            "us": "/ˌɡʊd ˈneɪtʃər/"
        },
        "nearby": [
            {
                "word": "good morning",
                "pos": "exclamation"
            },
            {
                "word": "good name",
                "pos": "noun"
            },
            {
                "word": "good nature",
                "pos": "noun"
            },
            {
                "word": "good-natured",
                "pos": "adjective"
            },
            {
                "word": "good-naturedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being kind, friendly and patient when dealing with people",
                    "vi": "phẩm chất tốt bụng, thân thiện và kiên nhẫn khi đối xử với mọi người"
                },
                "examples": [
                    {
                        "en": "People are always taking advantage of her good nature.",
                        "vi": "Mọi người luôn lợi dụng bản chất tốt của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "57559163f8f84b089b5761887f52cbd7",
        "word": "good-natured",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɡʊd ˈneɪtʃəd/",
            "us": "/ˌɡʊd ˈneɪtʃərd/"
        },
        "nearby": [
            {
                "word": "good name",
                "pos": "noun"
            },
            {
                "word": "good nature",
                "pos": "noun"
            },
            {
                "word": "good-natured",
                "pos": "adjective"
            },
            {
                "word": "good-naturedly",
                "pos": "adverb"
            },
            {
                "word": "Good Neighbor Policy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, friendly and patient when dealing with people",
                    "vi": "tốt bụng, thân thiện và kiên nhẫn khi đối xử với mọi người"
                },
                "examples": [
                    {
                        "en": "a good-natured person/discussion",
                        "vi": "một người tốt bụng / cuộc thảo luận"
                    },
                    {
                        "en": "Anthony is so good-natured—he finds it difficult to hate anyone.",
                        "vi": "Anthony rất tốt bụng - anh ấy cảm thấy rất khó để ghét bất cứ ai."
                    },
                    {
                        "en": "The discussion was good-natured and positive.",
                        "vi": "Cuộc thảo luận diễn ra tốt đẹp và tích cực."
                    }
                ]
            }
        ]
    },
    {
        "id": "de3d49e796ba4c6f97812043e6a38c42",
        "word": "humanity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/hjuːˈmænəti/",
            "us": "/hjuːˈmænəti/"
        },
        "nearby": [
            {
                "word": "humanitarian",
                "pos": "noun"
            },
            {
                "word": "humanitarianism",
                "pos": "noun"
            },
            {
                "word": "humanity",
                "pos": "noun"
            },
            {
                "word": "humanize",
                "pos": "verb"
            },
            {
                "word": "humankind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people in general",
                    "vi": "mọi người nói chung"
                },
                "examples": [
                    {
                        "en": "He was found guilty of crimes against humanity.",
                        "vi": "Anh ta bị kết tội chống lại loài người."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being a person rather than a god, an animal or a machine",
                    "vi": "trạng thái là một con người chứ không phải là một vị thần, một con vật hay một cỗ máy"
                },
                "examples": [
                    {
                        "en": "The story was used to emphasize the humanity of Jesus.",
                        "vi": "Câu chuyện được dùng để nhấn mạnh nhân tính của Chúa Giê-xu."
                    },
                    {
                        "en": "united by a sense of common humanity",
                        "vi": "đoàn kết bởi một ý thức chung của nhân loại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being kind to people and animals by making sure that they do not suffer more than is necessary; the quality of being humane",
                    "vi": "phẩm chất đối xử tốt với con người và động vật bằng cách đảm bảo rằng họ không phải chịu đựng nhiều hơn mức cần thiết; phẩm chất của nhân đạo"
                },
                "examples": [
                    {
                        "en": "The judge was praised for his courage and humanity.",
                        "vi": "Vị thẩm phán được khen ngợi vì lòng dũng cảm và lòng nhân đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the subjects of study that are about the way people think and behave, for example literature, language, history and philosophy",
                    "vi": "các chủ đề nghiên cứu về cách con người suy nghĩ và hành xử, ví dụ như văn học, ngôn ngữ, lịch sử và triết học"
                },
                "examples": [
                    {
                        "en": "The college offers a wide range of courses in the arts and humanities.",
                        "vi": "Trường cung cấp một loạt các khóa học về nghệ thuật và nhân văn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e010bcd93dfb4c149213bf2921bf0f6e",
        "word": "kind-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkaɪnd ˈhɑːtɪd/",
            "us": "/ˌkaɪnd ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "kindergarten",
                "pos": "noun"
            },
            {
                "word": "kindergartener",
                "pos": "noun"
            },
            {
                "word": "kind-hearted",
                "pos": "adjective"
            },
            {
                "word": "kindle",
                "pos": "verb"
            },
            {
                "word": "kindliness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and generous",
                    "vi": "tốt bụng và hào phóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be405f24941146dd8c038c4670d736e7",
        "word": "kindly",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkaɪndli/",
            "us": "/ˈkaɪndli/"
        },
        "nearby": [
            {
                "word": "kindling",
                "pos": "noun"
            },
            {
                "word": "kindly",
                "pos": "adverb"
            },
            {
                "word": "kindly",
                "pos": "adjective"
            },
            {
                "word": "kindness",
                "pos": "noun"
            },
            {
                "word": "kindred",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and caring",
                    "vi": "tử tế và quan tâm"
                },
                "examples": [
                    {
                        "en": "The doctor was a quiet, kindly man.",
                        "vi": "Bác sĩ là một người trầm tính, tốt bụng."
                    },
                    {
                        "en": "The teachers were generally gentle and kindly.",
                        "vi": "Các giáo viên nói chung là nhẹ nhàng và tốt bụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "439a6f8bf2d941198964c58e9cb9d47a",
        "word": "mercy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɜːsi/",
            "us": "/ˈmɜːrsi/"
        },
        "nearby": [
            {
                "word": "the Mercury Prize",
                "pos": ""
            },
            {
                "word": "the Mercury program",
                "pos": ""
            },
            {
                "word": "mercy",
                "pos": "noun"
            },
            {
                "word": "mercy killing",
                "pos": "noun"
            },
            {
                "word": "mere",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kind or forgiving attitude towards somebody that you have the power to harm or right to punish",
                    "vi": "thái độ tử tế hoặc tha thứ đối với ai đó mà bạn có quyền làm hại hoặc có quyền trừng phạt"
                },
                "examples": [
                    {
                        "en": "to ask/beg/plead for mercy",
                        "vi": "cầu xin / cầu xin / cầu xin lòng thương xót"
                    },
                    {
                        "en": "They showed no mercy to their hostages.",
                        "vi": "Họ không hề thương xót con tin."
                    },
                    {
                        "en": "God have mercy on us.",
                        "vi": "Thiên Chúa thương xót chúng tôi."
                    },
                    {
                        "en": "The troops are on a mercy mission (= a journey to help people) in the war zone.",
                        "vi": "Quân đội đang thực hiện một nhiệm vụ thương xót (= một cuộc hành trình để giúp đỡ mọi người) trong vùng chiến sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or a situation to be grateful for, usually because it stops something unpleasant",
                    "vi": "một sự kiện hoặc một tình huống để biết ơn, thường là vì nó ngăn chặn điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "It is a mercy (that)… It's a mercy she wasn't seriously hurt.",
                        "vi": "Đó là một sự thương xót (đó)… Đó là một sự thương xót mà cô ấy không bị tổn thương nghiêm trọng."
                    },
                    {
                        "en": "His death was a mercy (= because he was in great pain).",
                        "vi": "Cái chết của anh ấy là một sự thương xót (= vì anh ấy rất đau đớn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to stop somebody/something harming you because they have power or control over you",
                    "vi": "không thể ngăn ai đó / điều gì đó làm hại bạn bởi vì họ có quyền lực hoặc quyền kiểm soát đối với bạn"
                },
                "examples": [
                    {
                        "en": "I'm not going to put myself at the mercy of the bank.",
                        "vi": "Tôi sẽ không đặt mình vào lòng thương hại của ngân hàng."
                    },
                    {
                        "en": "We were at the mercy of the weather.",
                        "vi": "Chúng tôi đã phụ thuộc vào thời tiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be happy that a situation that is bad is not as bad as it could have been",
                    "vi": "hạnh phúc vì một tình huống tồi tệ không tồi tệ như nó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "Well, at least you weren't hurt. I suppose we should be grateful for small mercies.",
                        "vi": "Chà, ít nhất thì bạn đã không bị thương. Tôi cho rằng chúng ta nên biết ơn những lòng nhân từ nhỏ bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave somebody/something in a situation that may cause them to suffer or to be treated badly",
                    "vi": "để lại ai đó / điều gì đó trong một tình huống có thể khiến họ đau khổ hoặc bị đối xử tệ"
                },
                "examples": [
                    {
                        "en": "privatized companies left to the mercy of market forces",
                        "vi": "các công ty tư nhân hóa bị bỏ mặc cho các lực lượng thị trường"
                    },
                    {
                        "en": "(humorous) I’ll leave you to the tender mercies of these ladies!",
                        "vi": "(hài hước) Tôi sẽ để bạn cho lòng nhân từ dịu dàng của những người phụ nữ này!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put yourself in a situation where you must rely on somebody to be kind to you and not harm or punish you",
                    "vi": "đặt bạn vào một tình huống mà bạn phải dựa vào ai đó tốt với bạn và không làm hại hoặc trừng phạt bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a8b2f1c37f2545bf8e50e1e7f2a93542",
        "word": "open-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌəʊpən ˈhɑːtɪd/",
            "us": "/ˌəʊpən ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "open-faced sandwich",
                "pos": "noun"
            },
            {
                "word": "open-handed",
                "pos": "adjective"
            },
            {
                "word": "open-hearted",
                "pos": "adjective"
            },
            {
                "word": "open-heart surgery",
                "pos": "noun"
            },
            {
                "word": "open house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and friendly",
                    "vi": "tốt bụng và thân thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "91d92125e83f44cca0b550534c649db5",
        "word": "open-minded",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌəʊpən ˈmaɪndɪd/",
            "us": "/ˌəʊpən ˈmaɪndɪd/"
        },
        "nearby": [
            {
                "word": "open marriage",
                "pos": "noun"
            },
            {
                "word": "open mic",
                "pos": "noun"
            },
            {
                "word": "open-minded",
                "pos": "adjective"
            },
            {
                "word": "open-mindedness",
                "pos": "noun"
            },
            {
                "word": "open-mouthed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "willing to listen to, think about or accept different ideas",
                    "vi": "sẵn sàng lắng nghe, suy nghĩ hoặc chấp nhận những ý tưởng khác nhau"
                },
                "examples": [
                    {
                        "en": "I encourage the children to be open-minded about new ideas and experiences.",
                        "vi": "Tôi khuyến khích bọn trẻ cởi mở về những ý tưởng và kinh nghiệm mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "79f4789584bf4b7986f0c242a70fb68f",
        "word": "saint",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/seɪnt/",
            "us": "/seɪnt/"
        },
        "nearby": [
            {
                "word": "sail through",
                "pos": "phrasal verb"
            },
            {
                "word": "Sainsbury's",
                "pos": ""
            },
            {
                "word": "saint",
                "pos": "noun"
            },
            {
                "word": "sainted",
                "pos": "adjective"
            },
            {
                "word": "sainthood",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person that the Christian Church recognizes as being very holy, because of the way they have lived or died",
                    "vi": "một người mà Giáo hội Cơ đốc công nhận là rất thánh, vì cách họ đã sống hoặc đã chết"
                },
                "examples": [
                    {
                        "en": "St John",
                        "vi": "St John"
                    },
                    {
                        "en": "St Valentine’s Day",
                        "vi": "Ngày lễ tình yêu"
                    },
                    {
                        "en": "The children were all named after saints.",
                        "vi": "Những đứa trẻ đều được đặt tên theo các vị thánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very good, kind or patient person",
                    "vi": "một người rất tốt, tốt bụng và kiên nhẫn"
                },
                "examples": [
                    {
                        "en": "She's a saint to go on living with that man.",
                        "vi": "Cô ấy là một vị thánh để tiếp tục sống với người đàn ông đó."
                    },
                    {
                        "en": "His behaviour would try the patience of a saint.",
                        "vi": "Hành vi của anh ta sẽ thử lòng kiên nhẫn của một vị thánh."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f2617d523364745845f143d4e6cbe6d",
        "word": "sweet",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/swiːt/",
            "us": "/swiːt/"
        },
        "nearby": [
            {
                "word": "sweepstake",
                "pos": "noun"
            },
            {
                "word": "sweep up",
                "pos": "phrasal verb"
            },
            {
                "word": "sweet",
                "pos": "adjective"
            },
            {
                "word": "sweet",
                "pos": "noun"
            },
            {
                "word": "sweet-and-sour",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing, or tasting as if it contains, a lot of sugar",
                    "vi": "chứa, hoặc nếm như thể nó chứa, rất nhiều đường"
                },
                "examples": [
                    {
                        "en": "a cup of hot sweet tea",
                        "vi": "một tách trà ngọt nóng"
                    },
                    {
                        "en": "sweet food",
                        "vi": "thức ăn ngọt"
                    },
                    {
                        "en": "I had a craving for something sweet.",
                        "vi": "Tôi thèm một thứ gì đó ngọt ngào."
                    },
                    {
                        "en": "roast duck with a sweet and sour sauce",
                        "vi": "vịt quay sốt chua ngọt"
                    },
                    {
                        "en": "sweet sherry",
                        "vi": "trái sơ ri ngọt"
                    },
                    {
                        "en": "This wine is too sweet for me.",
                        "vi": "Rượu này quá ngọt đối với tôi."
                    },
                    {
                        "en": "I found the dessert a bit sweet for my taste.",
                        "vi": "Tôi thấy món tráng miệng hơi ngọt đối với khẩu vị của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a pleasant smell",
                    "vi": "có mùi dễ chịu"
                },
                "examples": [
                    {
                        "en": "a sweet-smelling rose",
                        "vi": "một bông hồng thơm"
                    },
                    {
                        "en": "The air was sweet with incense.",
                        "vi": "Không khí ngào ngạt hương."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a pleasant sound",
                    "vi": "có một âm thanh vui vẻ"
                },
                "examples": [
                    {
                        "en": "a sweet voice",
                        "vi": "một giọng nói ngọt ngào"
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant and not containing any harmful substances",
                    "vi": "dễ chịu và không chứa bất kỳ chất độc hại nào"
                },
                "examples": [
                    {
                        "en": "the sweet air of a mountain village",
                        "vi": "không khí ngọt ngào của một ngôi làng miền núi"
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel happy and/or satisfied",
                    "vi": "làm cho bạn cảm thấy hạnh phúc và / hoặc hài lòng"
                },
                "examples": [
                    {
                        "en": "Goodnight. Sweet dreams.",
                        "vi": "Chúc ngủ ngon. Những giấc mơ ngọt ngào."
                    },
                    {
                        "en": "I can't tell you how sweet this victory is.",
                        "vi": "Tôi không thể nói với bạn rằng chiến thắng này ngọt ngào như thế nào."
                    },
                    {
                        "en": "He played a sweet shot onto the final green (= in golf).",
                        "vi": "Anh ấy đã chơi một cú đánh ngọt ngào vào green cuối cùng (= trong gôn)."
                    },
                    {
                        "en": "an act of sweet revenge",
                        "vi": "một hành động trả thù ngọt ngào"
                    }
                ]
            },
            {
                "define": {
                    "en": "attractive",
                    "vi": "hấp dẫn"
                },
                "examples": [
                    {
                        "en": "His sister's a sweet young thing.",
                        "vi": "Em gái của anh ấy là một điều trẻ trung ngọt ngào."
                    },
                    {
                        "en": "You look sweet in this photograph.",
                        "vi": "Bạn trông thật ngọt ngào trong bức ảnh này."
                    },
                    {
                        "en": "We stayed in a sweet little hotel on the seafront.",
                        "vi": "Chúng tôi ở trong một khách sạn nhỏ ngọt ngào trên bờ biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "having or showing a kind character",
                    "vi": "có hoặc thể hiện một nhân vật tốt bụng"
                },
                "examples": [
                    {
                        "en": "She gave him her sweetest smile.",
                        "vi": "Cô đã trao cho anh nụ cười ngọt ngào nhất của mình."
                    },
                    {
                        "en": "He's one of the sweetest people I know.",
                        "vi": "Anh ấy là một trong những người ngọt ngào nhất mà tôi biết."
                    },
                    {
                        "en": "it is sweet of somebody to do something It was sweet of them to offer to help.",
                        "vi": "Ai đó làm được điều gì đó thật tuyệt vời Họ đề nghị giúp đỡ."
                    },
                    {
                        "en": "He’s not what you’d call sweet-tempered!",
                        "vi": "Anh ấy không phải là những gì bạn gọi là nóng tính!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you approve of something",
                    "vi": "được sử dụng để cho thấy rằng bạn chấp thuận một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Free tickets? Sweet!",
                        "vi": "Vé miễn phí? Kẹo!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to like somebody very much in a romantic way",
                    "vi": "thích ai đó rất nhiều theo cách lãng mạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like food that contains a lot of sugar",
                    "vi": "thích thức ăn có nhiều đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say how pleasant your home is (especially when you really mean that it is not pleasant at all)",
                    "vi": "được sử dụng để nói ngôi nhà của bạn dễ chịu như thế nào (đặc biệt là khi bạn thực sự muốn nói rằng nó không dễ chịu chút nào)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "how and when you want to, even though this might annoy other people",
                    "vi": "làm thế nào và khi nào bạn muốn, mặc dù điều này có thể làm phiền người khác"
                },
                "examples": [
                    {
                        "en": "He always does the work, but in his own sweet time.",
                        "vi": "Anh ấy luôn luôn làm công việc, nhưng trong thời gian ngọt ngào của riêng mình."
                    },
                    {
                        "en": "She just ignores all the criticism and continues on her own sweet way.",
                        "vi": "Cô ấy bỏ qua tất cả những lời chỉ trích và tiếp tục con đường ngọt ngào của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do pleasant things in order to keep somebody in a good mood so that they will agree to do something for you",
                    "vi": "nói hoặc làm những điều thú vị để giữ cho ai đó có tâm trạng tốt để họ đồng ý làm điều gì đó cho bạn"
                },
                "examples": [
                    {
                        "en": "You’d better keep her sweet if you want her to lend you the money.",
                        "vi": "Tốt hơn bạn nên giữ cô ấy ngọt ngào nếu bạn muốn cô ấy cho bạn vay tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is important is what people or things are, not what they are called",
                    "vi": "điều quan trọng là con người hoặc sự vật là gì, chứ không phải chúng được gọi là gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everything is all right",
                    "vi": "mọi thứ đều ổn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pleasant but not lasting a long time",
                    "vi": "dễ chịu nhưng không kéo dài trong thời gian dài"
                },
                "examples": [
                    {
                        "en": "We haven't much time so I'll keep it short and sweet.",
                        "vi": "Chúng ta không có nhiều thời gian nên tôi sẽ nói ngắn gọn và thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "nothing at all. People say ‘sweet FA’ to avoid saying ‘fuck all’.",
                    "vi": "không có gì đâu. Người ta nói 'FA ngọt ngào' tránh nói 'đéo biết gì hết'."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "romantic words",
                    "vi": "lời yêu thương"
                },
                "examples": [
                    {
                        "en": "to whisper sweet nothings in somebody’s ear",
                        "vi": "thì thầm những điều ngọt ngào vào tai ai đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "the pleasant feeling of being successful",
                    "vi": "cảm giác dễ chịu khi thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a7f5097f0ef4a878c6a4ffb6620a50b",
        "word": "tactful",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtæktfl/",
            "us": "/ˈtæktfl/"
        },
        "nearby": [
            {
                "word": "Taco Bell",
                "pos": ""
            },
            {
                "word": "tact",
                "pos": "noun"
            },
            {
                "word": "tactful",
                "pos": "adjective"
            },
            {
                "word": "tactfully",
                "pos": "adverb"
            },
            {
                "word": "tactic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "careful not to say or do anything that will annoy or upset other people",
                    "vi": "cẩn thận không nói hoặc làm bất cứ điều gì có thể gây khó chịu hoặc khó chịu cho người khác"
                },
                "examples": [
                    {
                        "en": "That wasn't a very tactful thing to say!",
                        "vi": "Đó không phải là một điều rất tế nhị để nói!"
                    },
                    {
                        "en": "I tried to find a tactful way of telling her the truth.",
                        "vi": "Tôi cố gắng tìm một cách khéo léo để nói cho cô ấy biết sự thật."
                    },
                    {
                        "en": "It might be more tactful if you didn’t come to the wedding.",
                        "vi": "Sẽ khéo léo hơn nếu bạn không đến dự đám cưới."
                    }
                ]
            }
        ]
    },
    {
        "id": "533772a092284f969c2b209f31011c4f",
        "word": "tender",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtendə(r)/",
            "us": "/ˈtendər/"
        },
        "nearby": [
            {
                "word": "tendentiously",
                "pos": "adverb"
            },
            {
                "word": "tendentiousness",
                "pos": "noun"
            },
            {
                "word": "tender",
                "pos": "adjective"
            },
            {
                "word": "tender",
                "pos": "noun"
            },
            {
                "word": "tender",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, gentle and loving",
                    "vi": "tốt bụng, dịu dàng và yêu thương"
                },
                "examples": [
                    {
                        "en": "tender words",
                        "vi": "lời nói dịu dàng"
                    },
                    {
                        "en": "What he needs now is a lot of tender loving care (= sympathetic treatment).",
                        "vi": "Những gì anh ấy cần bây giờ là rất nhiều sự quan tâm yêu thương dịu dàng (= đối xử thông cảm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to bite through and cut",
                    "vi": "dễ dàng để cắn và cắt"
                },
                "examples": [
                    {
                        "en": "This meat is extremely tender.",
                        "vi": "Thịt này rất mềm."
                    },
                    {
                        "en": "Boil the beans until they are tender.",
                        "vi": "Đun sôi đậu cho đến khi chúng mềm."
                    },
                    {
                        "en": "four large slices of tender chicken",
                        "vi": "bốn lát thịt gà mềm lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "painful when you touch it",
                    "vi": "đau khi bạn chạm vào nó"
                },
                "examples": [
                    {
                        "en": "My leg is still very tender where I banged it.",
                        "vi": "Chân tôi vẫn còn rất mềm khi tôi va vào nó."
                    },
                    {
                        "en": "The back of my neck feels very tender.",
                        "vi": "Sau gáy của tôi cảm thấy rất mềm."
                    }
                ]
            },
            {
                "define": {
                    "en": "easily hurt or damaged",
                    "vi": "dễ bị tổn thương hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "tender young plants",
                        "vi": "cây non mềm"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in connection with somebody who is still young and does not have much experience",
                    "vi": "được sử dụng trong mối quan hệ với một người nào đó vẫn còn trẻ và chưa có nhiều kinh nghiệm"
                },
                "examples": [
                    {
                        "en": "He left home at the tender age of 15.",
                        "vi": "Anh rời nhà năm 15 tuổi."
                    },
                    {
                        "en": "She shouldn't be having to deal with problems like this at such a tender age.",
                        "vi": "Cô ấy không nên phải đối mặt với những vấn đề như thế này ở độ tuổi còn non nớt như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c37285be93f42c5b3c0fd2992fa9bad",
        "word": "thoughtful",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈθɔːtfl/",
            "us": "/ˈθɔːtfl/"
        },
        "nearby": [
            {
                "word": "thought",
                "pos": "noun"
            },
            {
                "word": "thoughtcrime",
                "pos": "noun"
            },
            {
                "word": "thoughtful",
                "pos": "adjective"
            },
            {
                "word": "thoughtfully",
                "pos": "adverb"
            },
            {
                "word": "thoughtfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "quiet, because you are thinking",
                    "vi": "yên lặng, bởi vì bạn đang suy nghĩ"
                },
                "examples": [
                    {
                        "en": "He looked thoughtful.",
                        "vi": "Trông anh ta có vẻ trầm ngâm."
                    },
                    {
                        "en": "They sat in thoughtful silence.",
                        "vi": "Họ ngồi trong im lặng trầm ngâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing that you think about and care for other people",
                    "vi": "cho thấy rằng bạn nghĩ về và quan tâm đến người khác"
                },
                "examples": [
                    {
                        "en": "The hotel manager was very kind and thoughtful.",
                        "vi": "Người quản lý khách sạn rất tốt bụng và chu đáo."
                    },
                    {
                        "en": "it is thoughtful (of somebody) (to do something) It was very thoughtful of you to send the flowers.",
                        "vi": "nó là chu đáo (của ai đó) (để làm một cái gì đó) Nó rất chu đáo của bạn để gửi những bông hoa."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing signs of careful thought",
                    "vi": "có dấu hiệu của sự suy nghĩ cẩn thận"
                },
                "examples": [
                    {
                        "en": "a player who has a thoughtful approach to the game",
                        "vi": "một người chơi có cách tiếp cận trò chơi chu đáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "e5ba64718ea544a1a3f2a905415914a9",
        "word": "tolerance",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɒlərəns/",
            "us": "/ˈtɑːlərəns/"
        },
        "nearby": [
            {
                "word": "tolerable",
                "pos": "adjective"
            },
            {
                "word": "tolerably",
                "pos": "adverb"
            },
            {
                "word": "tolerance",
                "pos": "noun"
            },
            {
                "word": "tolerant",
                "pos": "adjective"
            },
            {
                "word": "tolerantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being willing to accept or tolerate somebody/something, especially opinions or behaviour that you may not agree with, or people who are not like you",
                    "vi": "phẩm chất của việc sẵn sàng chấp nhận hoặc khoan dung với ai đó / điều gì đó, đặc biệt là những ý kiến hoặc hành vi mà bạn có thể không đồng ý hoặc những người không giống bạn"
                },
                "examples": [
                    {
                        "en": "She had no tolerance for jokes of any kind.",
                        "vi": "Cô không có lòng khoan dung đối với những trò đùa dưới bất kỳ hình thức nào."
                    },
                    {
                        "en": "religious tolerance",
                        "vi": "Long bao dung tôn giao"
                    },
                    {
                        "en": "a reputation for tolerance of alternative lifestyles",
                        "vi": "một danh tiếng về sự khoan dung của những lối sống thay thế"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to suffer something, especially pain, difficult conditions, etc. without being harmed",
                    "vi": "khả năng chịu đựng điều gì đó, đặc biệt là đau đớn, điều kiện khó khăn, v.v. mà không bị tổn hại"
                },
                "examples": [
                    {
                        "en": "tolerance to cold",
                        "vi": "chịu được lạnh"
                    },
                    {
                        "en": "Tolerance to alcohol decreases with age.",
                        "vi": "Khả năng chịu đựng rượu giảm dần theo tuổi tác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount by which the measurement of a value can vary without causing problems",
                    "vi": "số lượng mà phép đo giá trị có thể thay đổi mà không gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "They were working to a tolerance of 0.0001 of a centimetre.",
                        "vi": "Họ đang làm việc với dung sai 0,0001 của một cm."
                    }
                ]
            }
        ]
    },
    {
        "id": "eac17ff33fca40929ba24becf83b2d30",
        "word": "tolerant",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɒlərənt/",
            "us": "/ˈtɑːlərənt/"
        },
        "nearby": [
            {
                "word": "tolerably",
                "pos": "adverb"
            },
            {
                "word": "tolerance",
                "pos": "noun"
            },
            {
                "word": "tolerant",
                "pos": "adjective"
            },
            {
                "word": "tolerantly",
                "pos": "adverb"
            },
            {
                "word": "tolerate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to accept what other people say or do even if you do not agree with it",
                    "vi": "có thể chấp nhận những gì người khác nói hoặc làm ngay cả khi bạn không đồng ý với điều đó"
                },
                "examples": [
                    {
                        "en": "He has a very tolerant attitude towards other religions.",
                        "vi": "Ông có một thái độ rất khoan dung đối với các tôn giáo khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to survive or operate in difficult conditions",
                    "vi": "có thể tồn tại hoặc hoạt động trong điều kiện khó khăn"
                },
                "examples": [
                    {
                        "en": "The plants are tolerant of frost.",
                        "vi": "Cây chịu được sương giá."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce711e4c2c7a417d9cab0998d5fc4283",
        "word": "warm-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌwɔːm ˈhɑːtɪd/",
            "us": "/ˌwɔːrm ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "warmed-over",
                "pos": "adjective"
            },
            {
                "word": "warmer",
                "pos": "noun"
            },
            {
                "word": "warm-hearted",
                "pos": "adjective"
            },
            {
                "word": "warming",
                "pos": "noun"
            },
            {
                "word": "warming",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and friendly",
                    "vi": "tốt bụng và thân thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dcdf80a7b3d44b45933f46714d0003fb",
        "word": "accommodating",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkɒmədeɪtɪŋ/",
            "us": "/əˈkɑːmədeɪtɪŋ/"
        },
        "nearby": [
            {
                "word": "accolade",
                "pos": "noun"
            },
            {
                "word": "accommodate",
                "pos": "verb"
            },
            {
                "word": "accommodating",
                "pos": "adjective"
            },
            {
                "word": "accommodation",
                "pos": "noun"
            },
            {
                "word": "accompaniment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "willing to help and do things for other people",
                    "vi": "sẵn sàng giúp đỡ và làm những việc cho người khác"
                },
                "examples": [
                    {
                        "en": "David was gentle, generous and accommodating.",
                        "vi": "David là người nhẹ nhàng, hào phóng và có sức chứa."
                    },
                    {
                        "en": "accommodating to somebody They are very accommodating to foreign visitors.",
                        "vi": "có sức chứa với ai đó Họ rất có sức chứa với du khách nước ngoài."
                    },
                    {
                        "en": "They are very accommodating to people with special needs.",
                        "vi": "Họ rất thích ứng với những người có nhu cầu đặc biệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8e2edc7350d415697b4cd85a5cc668d",
        "word": "angelic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ænˈdʒelɪk/",
            "us": "/ænˈdʒelɪk/"
        },
        "nearby": [
            {
                "word": "angel food cake",
                "pos": "noun"
            },
            {
                "word": "angel hair",
                "pos": "noun"
            },
            {
                "word": "angelic",
                "pos": "adjective"
            },
            {
                "word": "angelica",
                "pos": "noun"
            },
            {
                "word": "angelically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good, kind or beautiful; like an angel",
                    "vi": "tốt, tốt bụng hoặc xinh đẹp; như một thiên thần"
                },
                "examples": [
                    {
                        "en": "an angelic smile",
                        "vi": "một nụ cười thiên thần"
                    }
                ]
            }
        ]
    },
    {
        "id": "d2dcc4b776e34e84baa4a329a481ae2e",
        "word": "benevolent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/bəˈnevələnt/",
            "us": "/bəˈnevələnt/"
        },
        "nearby": [
            {
                "word": "Stephen Vincent Benét",
                "pos": ""
            },
            {
                "word": "benevolence",
                "pos": "noun"
            },
            {
                "word": "benevolent",
                "pos": "adjective"
            },
            {
                "word": "benevolently",
                "pos": "adverb"
            },
            {
                "word": "Bengali",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, helpful and generous",
                    "vi": "tốt bụng, hữu ích và hào phóng"
                },
                "examples": [
                    {
                        "en": "a benevolent smile/attitude",
                        "vi": "một nụ cười / thái độ nhân từ"
                    },
                    {
                        "en": "belief in the existence of a benevolent god",
                        "vi": "niềm tin vào sự tồn tại của một vị thần nhân từ"
                    },
                    {
                        "en": "a benevolent dictatorship",
                        "vi": "một chế độ độc tài nhân từ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some organizations that give help and money to people in need",
                    "vi": "được sử dụng dưới danh nghĩa của một số tổ chức giúp đỡ và tiền cho những người cần"
                },
                "examples": [
                    {
                        "en": "the RAF Benevolent Fund",
                        "vi": "Quỹ nhân ái RAF"
                    }
                ]
            }
        ]
    },
    {
        "id": "f14c54c34eb64ca7b3691b48a59d14f9",
        "word": "benign",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪˈnaɪn/",
            "us": "/bɪˈnaɪn/"
        },
        "nearby": [
            {
                "word": "Ben-Hur",
                "pos": ""
            },
            {
                "word": "benighted",
                "pos": "adjective"
            },
            {
                "word": "benign",
                "pos": "adjective"
            },
            {
                "word": "benignly",
                "pos": "adverb"
            },
            {
                "word": "Benin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and gentle; not hurting anybody",
                    "vi": "tốt bụng và nhẹ nhàng; không làm tổn thương ai"
                },
                "examples": [
                    {
                        "en": "You would never have guessed his intentions from the benign expression on his face.",
                        "vi": "Bạn sẽ không bao giờ đoán được ý định của anh ấy từ biểu hiện lành tính trên khuôn mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "not causing damage or harm",
                    "vi": "không gây thiệt hại hoặc tổn hại"
                },
                "examples": [
                    {
                        "en": "The industry's environmental impact is relatively benign, even positive.",
                        "vi": "Tác động môi trường của ngành là tương đối lành tính, thậm chí là tích cực."
                    },
                    {
                        "en": "environmentally benign cleaning products",
                        "vi": "sản phẩm làm sạch lành tính với môi trường"
                    },
                    {
                        "en": "Many parents adopt a policy of benign neglect —making sure children are fed and clothed and attending school, but leaving them to entertain themselves out of school.",
                        "vi": "Nhiều bậc cha mẹ áp dụng chính sách bỏ mặc nhẹ nhàng - đảm bảo cho trẻ được ăn, mặc và đi học, nhưng lại để chúng tự giải trí khi nghỉ học."
                    }
                ]
            },
            {
                "define": {
                    "en": "not dangerous or likely to cause death",
                    "vi": "không nguy hiểm hoặc có khả năng gây tử vong"
                },
                "examples": [
                    {
                        "en": "She is recovering after surgery to remove a benign tumour.",
                        "vi": "Cô đang hồi phục sau ca phẫu thuật cắt bỏ khối u lành tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "2893711e1bec4c1896b4b9c9c3d685a1",
        "word": "bleeding heart",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbliːdɪŋ ˈhɑːt/",
            "us": "/ˌbliːdɪŋ ˈhɑːrt/"
        },
        "nearby": [
            {
                "word": "bleeding",
                "pos": "noun"
            },
            {
                "word": "bleeding edge",
                "pos": "noun"
            },
            {
                "word": "bleeding heart",
                "pos": "noun"
            },
            {
                "word": "bleep",
                "pos": "noun"
            },
            {
                "word": "bleep",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is too kind towards people that other people think do not deserve this treatment",
                    "vi": "một người quá tốt với những người mà người khác nghĩ rằng họ không đáng bị đối xử như vậy"
                },
                "examples": [
                    {
                        "en": "a bleeding-heart liberal",
                        "vi": "một trái tim tự do chảy máu"
                    },
                    {
                        "en": "All the bleeding hearts and socialists oppose the changes to the immigration law.",
                        "vi": "Tất cả những trái tim đang chảy máu và những người theo chủ nghĩa xã hội đều phản đối những thay đổi đối với luật nhập cư."
                    }
                ]
            }
        ]
    },
    {
        "id": "25f7d2c17e2e4b08a17ed4ee3968c33d",
        "word": "conciliate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈsɪlieɪt/",
            "us": "/kənˈsɪlieɪt/"
        },
        "nearby": [
            {
                "word": "conchie",
                "pos": "noun"
            },
            {
                "word": "concierge",
                "pos": "noun"
            },
            {
                "word": "conciliate",
                "pos": "verb"
            },
            {
                "word": "conciliation",
                "pos": "noun"
            },
            {
                "word": "conciliator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody less angry or more friendly, especially by being kind and pleasant or by giving them something",
                    "vi": "để làm cho ai đó bớt tức giận hoặc thân thiện hơn, đặc biệt là bằng cách tử tế và dễ chịu hoặc bằng cách cho họ một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f71453b19ec4ce1befc36b31edf8fda",
        "word": "cutie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkjuːti/",
            "us": "/ˈkjuːti/"
        },
        "nearby": [
            {
                "word": "cut glass",
                "pos": "noun"
            },
            {
                "word": "cuticle",
                "pos": "noun"
            },
            {
                "word": "cutie",
                "pos": "noun"
            },
            {
                "word": "cut in",
                "pos": "phrasal verb"
            },
            {
                "word": "cut-in",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is attractive or kind",
                    "vi": "một người hấp dẫn hoặc tốt bụng"
                },
                "examples": [
                    {
                        "en": "He's a real cutie.",
                        "vi": "Anh ấy là một người dễ thương thực sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f32b073df1d474dad6ec8f8f8291412",
        "word": "graceful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡreɪsfl/",
            "us": "/ˈɡreɪsfl/"
        },
        "nearby": [
            {
                "word": "W G Grace",
                "pos": ""
            },
            {
                "word": "grace and favour",
                "pos": "adjective"
            },
            {
                "word": "graceful",
                "pos": "adjective"
            },
            {
                "word": "gracefully",
                "pos": "adverb"
            },
            {
                "word": "gracefulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "moving in an attractive way that shows control; having a smooth, attractive form",
                    "vi": "di chuyển một cách hấp dẫn thể hiện sự kiểm soát; có một hình thức mượt mà, hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The dancers were all tall and graceful.",
                        "vi": "Các vũ công đều cao lớn và duyên dáng."
                    },
                    {
                        "en": "He gave a graceful bow to the audience.",
                        "vi": "Anh cúi chào khán giả một cách duyên dáng."
                    },
                    {
                        "en": "the graceful curves of the hills",
                        "vi": "những đường cong duyên dáng của những ngọn đồi"
                    },
                    {
                        "en": "Dolphins are incredibly graceful and efficient swimmers.",
                        "vi": "Cá heo là loài bơi vô cùng duyên dáng và hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "polite and kind in your behaviour, especially in a difficult situation",
                    "vi": "lịch sự và tử tế trong hành vi của bạn, đặc biệt là trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "His father had always taught him to be graceful in defeat.",
                        "vi": "Cha anh luôn dạy anh phải có duyên trong thắng bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "f91fc5873f324118a2a472416fd20cdb",
        "word": "gracious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡreɪʃəs/",
            "us": "/ˈɡreɪʃəs/"
        },
        "nearby": [
            {
                "word": "grace note",
                "pos": "noun"
            },
            {
                "word": "Gracie",
                "pos": ""
            },
            {
                "word": "gracious",
                "pos": "adjective"
            },
            {
                "word": "graciously",
                "pos": "adverb"
            },
            {
                "word": "graciousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, polite and generous, especially to somebody of a lower social position",
                    "vi": "tử tế, lịch sự và hào phóng, đặc biệt là với những người có địa vị xã hội thấp hơn"
                },
                "examples": [
                    {
                        "en": "a gracious lady",
                        "vi": "một người phụ nữ duyên dáng"
                    },
                    {
                        "en": "a gracious smile",
                        "vi": "một nụ cười duyên dáng"
                    },
                    {
                        "en": "Lady Caroline was gracious enough to accept our invitation.",
                        "vi": "Quý bà Caroline đủ duyên dáng để nhận lời mời của chúng tôi."
                    },
                    {
                        "en": "He has not yet learned how to be gracious in defeat.",
                        "vi": "Anh ta vẫn chưa học được cách hài lòng trong thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing the comfort and easy way of life that wealth can bring",
                    "vi": "cho thấy cuộc sống thoải mái và dễ dàng mà sự giàu có có thể mang lại"
                },
                "examples": [
                    {
                        "en": "gracious living",
                        "vi": "sống thanh nhã"
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a very polite word for royal people or their actions",
                    "vi": "được sử dụng như một từ rất lịch sự cho những người thuộc hoàng gia hoặc hành động của họ"
                },
                "examples": [
                    {
                        "en": "her gracious Majesty the Queen",
                        "vi": "Nữ hoàng nhân từ của cô ấy"
                    },
                    {
                        "en": "The performance will take place in the gracious presence of HRH the Prince of Wales.",
                        "vi": "Buổi biểu diễn sẽ diễn ra với sự hiện diện ân cần của HRH the Prince of Wales."
                    }
                ]
            },
            {
                "define": {
                    "en": "being kind and showing mercy",
                    "vi": "tử tế và thể hiện lòng thương xót"
                },
                "examples": [
                    {
                        "en": "a gracious act of God",
                        "vi": "một hành động nhân từ của Chúa"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for expressing surprise",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Goodness gracious!",
                        "vi": "Tốt đẹp duyên dáng!"
                    },
                    {
                        "en": "‘I hope you didn't mind my phoning you.’ ‘Good gracious, no, of course not.’",
                        "vi": "Tôi hy vọng bạn không phiền khi tôi gọi điện cho bạn.' \"Tốt, không, tất nhiên là không.\""
                    }
                ]
            }
        ]
    },
    {
        "id": "9739f6c8476245f89ad4f0c1fd4572ae",
        "word": "have a heart of gold",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɑːt/",
            "us": "/hɑːrt/"
        },
        "nearby": [
            {
                "word": "hearse",
                "pos": "noun"
            },
            {
                "word": "William Randolph Hearst",
                "pos": ""
            },
            {
                "word": "heart",
                "pos": "noun"
            },
            {
                "word": "heart",
                "pos": "verb"
            },
            {
                "word": "heartache",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the organ in the chest that sends blood around the body, usually on the left in humans",
                    "vi": "cơ quan trong lồng ngực đưa máu đi khắp cơ thể, thường ở bên trái ở người"
                },
                "examples": [
                    {
                        "en": "The patient's heart stopped beating for a few seconds.",
                        "vi": "Tim bệnh nhân ngừng đập trong vài giây."
                    },
                    {
                        "en": "I could feel my heart pounding in my chest (= because of excitement, etc.).",
                        "vi": "Tôi có thể cảm thấy tim mình đập thình thịch trong lồng ngực (= vì phấn khích, v.v.)."
                    },
                    {
                        "en": "to have a weak heart",
                        "vi": "có một trái tim yếu ớt"
                    },
                    {
                        "en": "heart disease/problems",
                        "vi": "bệnh tim / vấn đề"
                    },
                    {
                        "en": "to have a heart condition",
                        "vi": "để có một tình trạng tim"
                    },
                    {
                        "en": "heart patients/surgery",
                        "vi": "bệnh nhân tim / phẫu thuật"
                    },
                    {
                        "en": "a heart transplant",
                        "vi": "cấy ghép tim"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outside part of the chest where the heart is",
                    "vi": "phần bên ngoài của lồng ngực nơi có trái tim"
                },
                "examples": [
                    {
                        "en": "She clasped the photo to her heart.",
                        "vi": "Cô ôm chặt bức ảnh vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a heart in shape, often red and used as a symbol of love; a symbol like a heart used to mean the verb ‘love’",
                    "vi": "một thứ giống như hình trái tim, thường có màu đỏ và được dùng làm biểu tượng của tình yêu; một biểu tượng như trái tim được sử dụng để có nghĩa là động từ 'tình yêu'"
                },
                "examples": [
                    {
                        "en": "The words ‘I love you’ were written inside a big red heart.",
                        "vi": "Dòng chữ 'I love you' được viết bên trong một trái tim lớn màu đỏ."
                    },
                    {
                        "en": "She was drawing hearts on the cover of a loose-leaf binder.",
                        "vi": "Cô ấy đang vẽ những trái tim trên bìa một tờ bìa rời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in a person where the feelings and emotions are thought to be, especially those connected with love",
                    "vi": "nơi con người được cho là cảm xúc và tình cảm, đặc biệt là những cảm xúc được kết nối với tình yêu"
                },
                "examples": [
                    {
                        "en": "She has a kind heart.",
                        "vi": "Cô ấy có một trái tim nhân hậu."
                    },
                    {
                        "en": "Have you no heart?",
                        "vi": "Bạn không có trái tim?"
                    },
                    {
                        "en": "He returned with a heavy heart (= sad).",
                        "vi": "Anh trở về với lòng nặng trĩu (= buồn)."
                    },
                    {
                        "en": "Her novels tend to deal with affairs of the heart.",
                        "vi": "Tiểu thuyết của cô có xu hướng giải quyết các vấn đề của trái tim."
                    },
                    {
                        "en": "The story captured the hearts and minds of a generation.",
                        "vi": "Câu chuyện đã chiếm được trái tim và tâm trí của cả một thế hệ."
                    },
                    {
                        "en": "His sad story touched her heart.",
                        "vi": "Câu chuyện buồn của anh khiến trái tim cô cảm động."
                    },
                    {
                        "en": "the mysteries of the human heart",
                        "vi": "những bí ẩn của trái tim con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of character or personality mentioned",
                    "vi": "có loại nhân vật hoặc tính cách được đề cập"
                },
                "examples": [
                    {
                        "en": "simple-hearted",
                        "vi": "giản dị"
                    },
                    {
                        "en": "pure-hearted",
                        "vi": "trong sáng"
                    },
                    {
                        "en": "black-hearted",
                        "vi": "trái tim đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important part of something",
                    "vi": "phần quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something the heart of the matter/problem",
                        "vi": "trung tâm của một cái gì đó trung tâm của vấn đề / vấn đề"
                    },
                    {
                        "en": "The committee's report went to the heart of the government's dilemma.",
                        "vi": "Báo cáo của ủy ban đã đi vào trọng tâm của tình thế khó xử của chính phủ."
                    },
                    {
                        "en": "at the heart of something The distinction between right and wrong lies at the heart of all questions of morality.",
                        "vi": "ở trung tâm của điều gì đó Sự phân biệt giữa đúng và sai nằm ở trung tâm của tất cả các câu hỏi về đạo đức."
                    },
                    {
                        "en": "the issue at the heart of modern government",
                        "vi": "vấn đề trọng tâm của chính phủ hiện đại"
                    },
                    {
                        "en": "at the/its heart The story, at its heart, is a simple tale of loss and rediscovery.",
                        "vi": "tại / trái tim của nó Câu chuyện, ở trung tâm của nó, là một câu chuyện đơn giản về mất mát và khám phá lại."
                    },
                    {
                        "en": "Buddhism, at the heart, is about harmony.",
                        "vi": "Đạo Phật, ở trung tâm, là về sự hài hòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that is in the centre of something",
                    "vi": "phần nằm ở trung tâm của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something a quiet hotel in the very heart of the city",
                        "vi": "trung tâm của một cái gì đó một khách sạn yên tĩnh ở trung tâm của thành phố"
                    },
                    {
                        "en": "at the/its heart an open space with a small arena at the heart",
                        "vi": "tại / trái tim của nó một không gian rộng mở với một đấu trường nhỏ ở trung tâm"
                    },
                    {
                        "en": "Manchester contains at its heart a rather extended commercial district.",
                        "vi": "Manchester có trung tâm là một khu thương mại khá mở rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the smaller leaves in the middle of a cabbage, lettuce, etc.",
                    "vi": "những chiếc lá nhỏ hơn ở giữa bắp cải, rau diếp, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the four suits (= sets) in a pack of cards, with red heart symbols on them",
                    "vi": "một trong bốn bộ quần áo (= bộ) trong một gói thẻ, với biểu tượng trái tim màu đỏ trên chúng"
                },
                "examples": [
                    {
                        "en": "the queen of hearts",
                        "vi": "nữ hoàng của trái tim"
                    },
                    {
                        "en": "Hearts is/are trumps.",
                        "vi": "Hearts là / là át chủ bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "one card from the suit called hearts",
                    "vi": "một thẻ từ bộ đồ được gọi là trái tim"
                },
                "examples": [
                    {
                        "en": "Who played that heart?",
                        "vi": "Ai đã chơi trái tim đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say what somebody is really like even though they may seem to be something different",
                    "vi": "được sử dụng để nói ai đó thực sự như thế nào mặc dù họ có vẻ là một cái gì đó khác nhau"
                },
                "examples": [
                    {
                        "en": "He's still a socialist at heart.",
                        "vi": "Anh ấy vẫn là một nhà xã hội chủ nghĩa trong trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is etched on your heart, memory, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó đã khắc sâu vào trái tim, ký ức của bạn, v.v., bạn sẽ nhớ nó vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel very unhappy",
                    "vi": "làm cho ai đó cảm thấy rất không vui"
                },
                "examples": [
                    {
                        "en": "She broke his heart when she called off the engagement.",
                        "vi": "Cô đã làm tan nát trái tim anh khi cô hủy bỏ lời đính hôn."
                    },
                    {
                        "en": "It breaks my heart to see you like this.",
                        "vi": "Tôi tan nát trái tim khi nhìn thấy bạn như thế này."
                    }
                ]
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    },
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have a change of heart, your attitude towards something changes, usually making you feel more friendly, helpful, etc.",
                    "vi": "nếu bạn thay đổi trái tim, thái độ của bạn đối với điều gì đó thay đổi, thường khiến bạn cảm thấy thân thiện, hữu ích hơn, v.v."
                },
                "examples": [
                    {
                        "en": "Dan did not want to get married but recently he’s had a change of heart.",
                        "vi": "Dan không muốn kết hôn nhưng gần đây anh ấy đã thay đổi tình cảm."
                    },
                    {
                        "en": "He said he's not coming, but he might have a change of heart.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không đến, nhưng anh ấy có thể đã thay đổi trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of importance and interest for somebody",
                    "vi": "có rất nhiều tầm quan trọng và sự quan tâm đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize that you are telling the truth or will do what you promise",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn đang nói sự thật hoặc sẽ làm những gì bạn hứa"
                },
                "examples": [
                    {
                        "en": "I saw him do it—cross my heart.",
                        "vi": "Tôi đã thấy anh ấy làm điều đó - trái tim tôi rất vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to compare two things and say that one of them is better",
                    "vi": "được sử dụng để so sánh hai thứ và nói rằng một trong số chúng tốt hơn"
                },
                "examples": [
                    {
                        "en": "Look at him dance! Eat your heart out, Fred Astaire (= he dances even better than Fred Astaire).",
                        "vi": "Nhìn anh ấy nhảy! Hãy tận hưởng trái tim của bạn, Fred Astaire (= anh ấy còn nhảy giỏi hơn Fred Astaire)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able or willing to do something",
                    "vi": "để có thể hoặc sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Can you find it in your heart to forgive her?",
                        "vi": "Bạn có thể tìm thấy nó trong trái tim của bạn để tha thứ cho cô ấy?"
                    },
                    {
                        "en": "He couldn't find it in himself to trust anyone again.",
                        "vi": "Anh không thể tin tưởng bất cứ ai một lần nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is sincere",
                    "vi": "theo một cách chân thành"
                },
                "examples": [
                    {
                        "en": "I beg you, from the bottom of my heart, to spare his life.",
                        "vi": "Tôi cầu xin bạn, từ tận đáy lòng, hãy tha mạng cho anh ấy."
                    },
                    {
                        "en": "It was clearly an offer that came from the heart.",
                        "vi": "Đó rõ ràng là một lời đề nghị xuất phát từ trái tim."
                    },
                    {
                        "en": "I could tell he spoke from the heart.",
                        "vi": "Tôi có thể nói rằng anh ấy đã nói từ trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel positive, especially when they thought that they had no chance of achieving something",
                    "vi": "để làm cho ai đó cảm thấy tích cực, đặc biệt là khi họ nghĩ rằng họ không có cơ hội đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give your love to one person",
                    "vi": "trao tình yêu của bạn cho một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody to be kind and/or reasonable",
                    "vi": "được sử dụng để yêu cầu ai đó tử tế và / hoặc hợp lý"
                },
                "examples": [
                    {
                        "en": "Have a heart! I’ve nowhere else to stay!",
                        "vi": "Có một trái tim! Tôi không còn nơi nào khác để ở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a very kind person",
                    "vi": "trở thành một người rất tốt bụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a person who does not show other people sympathy",
                    "vi": "trở thành một người không thể hiện sự đồng cảm của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to want somebody to be happy and successful even though your actions may not show this",
                    "vi": "muốn ai đó hạnh phúc và thành công mặc dù hành động của bạn có thể không cho thấy điều này"
                },
                "examples": [
                    {
                        "en": "Although he was sometimes too strict with his children, he had their best interests at heart.",
                        "vi": "Mặc dù đôi khi ông quá nghiêm khắc với con cái, nhưng ông luôn hướng tới lợi ích tốt nhất của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very dear to somebody",
                    "vi": "rất thân thiết với ai đó"
                },
                "examples": [
                    {
                        "en": "He'll always have a place in my heart.",
                        "vi": "Anh ấy sẽ luôn có một vị trí trong trái tim tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a lot of energy and enthusiasm",
                    "vi": "với rất nhiều năng lượng và nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "They threw themselves heart and soul into the project.",
                        "vi": "Họ đã ném hết trái tim và tâm hồn vào dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not feel sympathy for somebody",
                    "vi": "từng nói rằng bạn không có thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "‘I have to go to Brazil on business.’ ‘My heart bleeds for you!’",
                        "vi": "Tôi phải đi công tác ở Brazil.' 'Trái tim tôi rỉ máu vì bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you feel a lot of sympathy for somebody",
                    "vi": "từng nói rằng bạn cảm thấy có nhiều thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "Our hearts go out to the families of the victims.",
                        "vi": "Trái tim của chúng tôi hướng về gia đình của các nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody feels nervous or frightened about something",
                    "vi": "ai đó cảm thấy lo lắng hoặc sợ hãi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart was in my mouth as I opened the envelope.",
                        "vi": "Trái tim tôi đang ở trong miệng khi tôi mở phong bì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody’s intentions are kind and sincere even though they sometimes do the wrong thing",
                    "vi": "được sử dụng để nói rằng ý định của ai đó là tử tế và chân thành mặc dù đôi khi họ làm điều sai trái"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are not very interested in or enthusiastic about something",
                    "vi": "đã từng nói rằng bạn không hứng thú hoặc không nhiệt tình với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Her heart isn't in her job.",
                        "vi": "Trái tim của cô ấy không ở trong công việc của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of happiness or excitement",
                    "vi": "thường nói rằng ai đó có cảm giác hạnh phúc hoặc phấn khích đột ngột"
                },
                "examples": [
                    {
                        "en": "My heart leapt at the news.",
                        "vi": "Trái tim tôi nhảy lên khi nghe tin này."
                    },
                    {
                        "en": "Her heart leaped with joy.",
                        "vi": "Trái tim cô nhảy lên vì sung sướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of fear, excitement, etc.",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên có cảm giác sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "My heart missed a beat when I saw who it was.",
                        "vi": "Trái tim tôi lỡ một nhịp khi tôi nhìn thấy đó là ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody suddenly feels sad or depressed about something",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên cảm thấy buồn hoặc chán nản về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart sank when I saw how much work there was left.",
                        "vi": "Trái tim tôi chùng xuống khi tôi thấy bao nhiêu công việc còn lại."
                    },
                    {
                        "en": "She watched him go with a sinking heart.",
                        "vi": "Cô nhìn anh ra đi với trái tim chìm đắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a home is where the people you love are",
                    "vi": "nhà là nơi có những người bạn yêu thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "happy and cheerful",
                    "vi": "vui vẻ và vui vẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you know something in your heart, you have a strong feeling that it is true",
                    "vi": "nếu bạn biết điều gì đó trong trái tim mình, bạn có cảm giác mạnh mẽ rằng đó là sự thật"
                },
                "examples": [
                    {
                        "en": "She knew in her heart of hearts that she was making the wrong decision.",
                        "vi": "Trong thâm tâm cô biết rằng mình đã quyết định sai lầm."
                    },
                    {
                        "en": "In my heart, I knew it wasn't true.",
                        "vi": "Trong thâm tâm, tôi biết đó không phải là sự thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "it makes somebody feel happy when they see or hear something",
                    "vi": "nó làm cho ai đó cảm thấy hạnh phúc khi họ nhìn thấy hoặc nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "It does my heart good to see the old place being taken care of so well.",
                        "vi": "Thật là chạnh lòng khi thấy nơi ở cũ được chăm sóc chu đáo như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop hoping for something or trying to do something because you no longer feel confident",
                    "vi": "ngừng hy vọng về điều gì đó hoặc cố gắng làm điều gì đó bởi vì bạn không còn cảm thấy tự tin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall in love with somebody/something",
                    "vi": "phải lòng ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man/woman who likes the same things or has the same opinions as you",
                    "vi": "một người đàn ông / phụ nữ thích những thứ giống nhau hoặc có cùng quan điểm với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to do something because you know that it will make somebody sad or upset",
                    "vi": "không thể làm điều gì đó bởi vì bạn biết rằng điều đó sẽ khiến ai đó buồn hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    },
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of kind feelings, without thinking about what advantage there will be for you",
                    "vi": "vì tình cảm tốt bụng mà không nghĩ đến việc bạn sẽ có lợi gì"
                },
                "examples": [
                    {
                        "en": "You're not telling me he offered to lend you the money out of the goodness of his heart?",
                        "vi": "Bạn không nói với tôi rằng anh ta đề nghị cho bạn vay tiền vì lòng tốt của anh ta?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody all your problems, feelings, etc.",
                    "vi": "để nói với ai đó tất cả các vấn đề, cảm xúc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Finally, he broke down in tears and poured out his heart to her.",
                        "vi": "Cuối cùng, anh đã gục ngã trong nước mắt và dốc hết trái tim mình cho cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want something very much",
                    "vi": "muốn một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "They’ve set their heart on a house in the country.",
                        "vi": "Họ đã đặt trái tim của họ vào một ngôi nhà trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unhappy or disappointed",
                    "vi": "rất không vui hoặc thất vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cry noisily for a long time because you are very sad",
                    "vi": "khóc thật lâu vì bạn rất buồn"
                },
                "examples": [
                    {
                        "en": "She flung herself at his chest and sobbed her heart out.",
                        "vi": "Cô ném mình vào ngực anh và thổn thức trái tim mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody fall in love with you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel more positive about something, especially when you thought that you had no chance of achieving something",
                    "vi": "để cảm thấy tích cực hơn về điều gì đó, đặc biệt là khi bạn nghĩ rằng bạn không có cơ hội đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The government can take heart from the latest opinion polls.",
                        "vi": "Chính phủ có thể lấy lòng từ các cuộc thăm dò dư luận mới nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very upset by something that somebody says or does",
                    "vi": "rất khó chịu bởi điều gì đó mà ai đó nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "You shouldn’t take everything he says to heart.",
                        "vi": "Bạn không nên ghi tất cả những gì anh ấy nói vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to strongly affect you in an emotional way",
                    "vi": "ảnh hưởng mạnh mẽ đến bạn theo cách cảm xúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to destroy the most important part or aspect of something",
                    "vi": "để phá hủy phần hoặc khía cạnh quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Closing the factory tore the heart out of the community.",
                        "vi": "Đóng cửa nhà máy xé nát trái tim của cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "as much as you want",
                    "vi": "Nhiều như bạn muốn"
                },
                "examples": [
                    {
                        "en": "a supervised play area where children can run around to their heart’s content",
                        "vi": "một khu vực vui chơi có giám sát, nơi trẻ em có thể chạy xung quanh để theo dõi nội dung của trái tim mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel happy or sympathetic",
                    "vi": "để làm cho ai đó cảm thấy hạnh phúc hoặc cảm thông"
                },
                "examples": [
                    {
                        "en": "Doesn’t that story just warm the cockles of your heart?",
                        "vi": "Câu chuyện đó chẳng phải chỉ làm ấm lòng bạn sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way to make somebody like or love you",
                    "vi": "cách để làm cho ai đó thích hoặc yêu bạn"
                },
                "examples": [
                    {
                        "en": "The way to a man's heart is through his stomach (= by giving him good food).",
                        "vi": "Đường đến trái tim của một người đàn ông là thông qua dạ dày của anh ta (= cho anh ta thức ăn ngon)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow your feelings to be seen by other people",
                    "vi": "để cho phép người khác nhìn thấy cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "He’s not one to wear his heart on his sleeve.",
                        "vi": "Anh ấy không phải là người để mặc trái tim mình trên tay áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person does not know about something that they would normally think was bad, then it cannot hurt them",
                    "vi": "nếu một người không biết về điều gì đó mà họ thường nghĩ là tồi tệ, thì điều đó không thể làm tổn thương họ"
                },
                "examples": [
                    {
                        "en": "What does it matter if I use his flat while he’s away? What the eye doesn’t see…!",
                        "vi": "Có vấn đề gì nếu tôi sử dụng căn hộ của anh ấy khi anh ấy đi vắng? Những gì mắt không thấy…!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "I hope with all my heart that things work out for you.",
                        "vi": "Tôi hy vọng với tất cả trái tim của tôi rằng mọi thứ sẽ thuận lợi cho bạn."
                    },
                    {
                        "en": "I wish you well with all my heart.",
                        "vi": "Tôi cầu chúc bạn khỏe mạnh với tất cả trái tim của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking and behaving like a young person even when you are old",
                    "vi": "suy nghĩ và hành xử như một người trẻ ngay cả khi bạn đã già"
                },
                "examples": [
                    {
                        "en": "My father is 76 but he’s still young at heart.",
                        "vi": "Cha tôi đã 76 nhưng trái tim ông vẫn còn trẻ."
                    },
                    {
                        "en": "He's over 70, but he's young at heart.",
                        "vi": "Ông ấy đã ngoài 70, nhưng tâm hồn còn trẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "015706a39085491291ea742cc8fe5cc6",
        "word": "magnanimous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/mæɡˈnænɪməs/",
            "us": "/mæɡˈnænɪməs/"
        },
        "nearby": [
            {
                "word": "magna cum laude",
                "pos": "adverb, adjective"
            },
            {
                "word": "magnanimity",
                "pos": "noun"
            },
            {
                "word": "magnanimous",
                "pos": "adjective"
            },
            {
                "word": "magnanimously",
                "pos": "adverb"
            },
            {
                "word": "magnate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind, generous and forgiving, especially towards an enemy or competitor",
                    "vi": "tốt bụng, rộng lượng và tha thứ, đặc biệt là đối với kẻ thù hoặc đối thủ cạnh tranh"
                },
                "examples": [
                    {
                        "en": "a magnanimous gesture",
                        "vi": "một cử chỉ hào hùng"
                    },
                    {
                        "en": "He was magnanimous in defeat and praised his opponent's skill.",
                        "vi": "Anh ta rất hào hùng trong thất bại và ca ngợi kỹ năng của đối thủ của mình."
                    },
                    {
                        "en": "The regime had to decide whether to be magnanimous in victory.",
                        "vi": "Chế độ phải quyết định hào hùng chiến thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "0399c4043dfb46b8972f3787382d52d8",
        "word": "merciful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɜːsɪfl/",
            "us": "/ˈmɜːrsɪfl/"
        },
        "nearby": [
            {
                "word": "The Merchant of Venice",
                "pos": ""
            },
            {
                "word": "Mercia",
                "pos": ""
            },
            {
                "word": "merciful",
                "pos": "adjective"
            },
            {
                "word": "mercifully",
                "pos": "adverb"
            },
            {
                "word": "merciless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "ready to forgive people and be kind to them",
                    "vi": "sẵn sàng tha thứ cho mọi người và đối xử tốt với họ"
                },
                "examples": [
                    {
                        "en": "a merciful God",
                        "vi": "Chúa nhân từ"
                    },
                    {
                        "en": "They asked her to be merciful to the prisoners.",
                        "vi": "Họ yêu cầu cô phải thương xót các tù nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming to be lucky, especially because it brings an end to somebody’s problems or pain",
                    "vi": "dường như là một điều may mắn, đặc biệt là vì nó kết thúc những vấn đề hoặc nỗi đau của ai đó"
                },
                "examples": [
                    {
                        "en": "Death came as a merciful release.",
                        "vi": "Cái chết đến như một sự giải thoát nhân từ."
                    }
                ]
            }
        ]
    },
    {
        "id": "90871a8796774ab6ae533d963b93c2e8",
        "word": "mild",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/maɪld/",
            "us": "/maɪld/"
        },
        "nearby": [
            {
                "word": "milage",
                "pos": "noun"
            },
            {
                "word": "milch cow",
                "pos": "noun"
            },
            {
                "word": "mild",
                "pos": "adjective"
            },
            {
                "word": "mild",
                "pos": "noun"
            },
            {
                "word": "mildew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not severe or strong",
                    "vi": "không nghiêm trọng hoặc mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a mild form of the disease",
                        "vi": "một dạng bệnh nhẹ"
                    },
                    {
                        "en": "a mild case of flu",
                        "vi": "một trường hợp cúm nhẹ"
                    },
                    {
                        "en": "The symptoms were mild.",
                        "vi": "Các triệu chứng nhẹ."
                    },
                    {
                        "en": "a mild punishment/criticism",
                        "vi": "một hình phạt / chỉ trích nhẹ"
                    },
                    {
                        "en": "It's safe to take a mild sedative.",
                        "vi": "An toàn khi dùng thuốc an thần nhẹ."
                    },
                    {
                        "en": "Use a soap that is mild on the skin.",
                        "vi": "Sử dụng xà phòng dịu nhẹ trên da."
                    }
                ]
            },
            {
                "define": {
                    "en": "not very cold, and therefore pleasant",
                    "vi": "không lạnh lắm, và do đó dễ chịu"
                },
                "examples": [
                    {
                        "en": "the mildest winter since records began",
                        "vi": "mùa đông ôn hòa nhất kể từ khi các kỷ lục bắt đầu"
                    },
                    {
                        "en": "a mild climate",
                        "vi": "khí hậu ôn hòa"
                    },
                    {
                        "en": "It's quite mild for the time of year.",
                        "vi": "Nó khá nhẹ nhàng cho thời gian trong năm."
                    },
                    {
                        "en": "Later in the week the weather turned very mild.",
                        "vi": "Cuối tuần, thời tiết chuyển biến rất nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not great or extreme",
                    "vi": "không tuyệt vời hay cực đoan"
                },
                "examples": [
                    {
                        "en": "mild irritation/amusement/disapproval",
                        "vi": "kích ứng nhẹ / giải trí / không tán thành"
                    },
                    {
                        "en": "a mild state of shock",
                        "vi": "một trạng thái sốc nhẹ"
                    },
                    {
                        "en": "She looked at him in mild surprise.",
                        "vi": "Cô nhìn anh với vẻ ngạc nhiên nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not strong, spicy or bitter",
                    "vi": "không mạnh, cay hoặc đắng"
                },
                "examples": [
                    {
                        "en": "a fairly mild flavour",
                        "vi": "một hương vị khá nhẹ"
                    },
                    {
                        "en": "mild cheese",
                        "vi": "pho mát nhẹ"
                    },
                    {
                        "en": "a mild curry",
                        "vi": "một món cà ri nhẹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "gentle and kind; not usually getting angry or violent",
                    "vi": "Nhẹ nhàng và tử tế; không thường tức giận hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "a mild woman, who never shouted",
                        "vi": "một người phụ nữ dịu dàng, người không bao giờ la hét"
                    }
                ]
            }
        ]
    },
    {
        "id": "8c026e6020d94c59a6e71e662a51f267",
        "word": "Prince Charming",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprɪns ˈtʃɑːmɪŋ/",
            "us": "/ˌprɪns ˈtʃɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "prince",
                "pos": "noun"
            },
            {
                "word": "Prince",
                "pos": ""
            },
            {
                "word": "Prince Charming",
                "pos": "noun"
            },
            {
                "word": "Prince Consort",
                "pos": "noun"
            },
            {
                "word": "Prince Edward Island",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man who seems to be a perfect boyfriend or husband because he is very attractive, kind, etc.",
                    "vi": "một người đàn ông có vẻ là một người bạn trai hoặc một người chồng hoàn hảo vì anh ấy rất hấp dẫn, tốt bụng, v.v."
                },
                "examples": [
                    {
                        "en": "I’m still waiting for my Prince Charming!",
                        "vi": "Tôi vẫn đang chờ đợi Prince Charming của tôi!"
                    }
                ]
            }
        ]
    },
    {
        "id": "dd48460f5b4f40d8a991676bb29b83a3",
        "word": "pussycat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊsikæt/",
            "us": "/ˈpʊsikæt/"
        },
        "nearby": [
            {
                "word": "pussy",
                "pos": "noun"
            },
            {
                "word": "Pussy Cat, Pussy Cat, Where Have You Been?",
                "pos": ""
            },
            {
                "word": "pussycat",
                "pos": "noun"
            },
            {
                "word": "pussyfoot",
                "pos": "verb"
            },
            {
                "word": "pussy willow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child’s word for a cat",
                    "vi": "từ của một đứa trẻ cho một con mèo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is kind and friendly, especially when you would not expect them to be like this",
                    "vi": "một người tốt bụng và thân thiện, đặc biệt là khi bạn không mong đợi họ sẽ như thế này"
                },
                "examples": [
                    {
                        "en": "He's just a pussycat really, once you get to know him.",
                        "vi": "Anh ấy thực sự chỉ là một kẻ thích quấy rối, một khi bạn đã quen anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7dfea1dcc7e45e4b2e217dcc7ccdbe5",
        "word": "soft",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/sɒft/",
            "us": "/sɔːft/"
        },
        "nearby": [
            {
                "word": "sofa bed",
                "pos": "noun"
            },
            {
                "word": "soft-shoe",
                "pos": "verb"
            },
            {
                "word": "soft",
                "pos": "adjective"
            },
            {
                "word": "softball",
                "pos": "noun"
            },
            {
                "word": "soft-boiled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "changing shape easily when pressed; not stiff or hard",
                    "vi": "thay đổi hình dạng dễ dàng khi ép; không cứng hoặc cứng"
                },
                "examples": [
                    {
                        "en": "soft margarine",
                        "vi": "bơ thực vật mềm"
                    },
                    {
                        "en": "soft feather pillows",
                        "vi": "gối lông mềm"
                    },
                    {
                        "en": "The grass was soft and springy.",
                        "vi": "Cỏ mềm và xuân."
                    },
                    {
                        "en": "They lay down on the soft sand.",
                        "vi": "Họ nằm dài trên bãi cát mềm."
                    },
                    {
                        "en": "These tomatoes have gone all soft.",
                        "vi": "Những quả cà chua này đã mềm hết."
                    },
                    {
                        "en": "The ground was soft and dry.",
                        "vi": "Mặt đất mềm và khô."
                    },
                    {
                        "en": "When the onion becomes soft, season with salt and pepper.",
                        "vi": "Khi hành tây trở nên mềm, nêm muối và tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "less hard than average",
                    "vi": "ít khó hơn mức trung bình"
                },
                "examples": [
                    {
                        "en": "soft rocks such as limestone",
                        "vi": "đá mềm như đá vôi"
                    },
                    {
                        "en": "soft corals",
                        "vi": "san hô mềm"
                    },
                    {
                        "en": "soft cheeses",
                        "vi": "pho mát mềm"
                    },
                    {
                        "en": "the soft palate",
                        "vi": "vòm miệng mềm"
                    }
                ]
            },
            {
                "define": {
                    "en": "smooth and pleasant to touch",
                    "vi": "mịn và dễ chịu khi chạm vào"
                },
                "examples": [
                    {
                        "en": "soft skin",
                        "vi": "làn da mềm mại"
                    },
                    {
                        "en": "a dress made from the finest, softest silk",
                        "vi": "một chiếc váy được làm từ lụa tốt nhất, mềm mại nhất"
                    },
                    {
                        "en": "The fabric has a beautifully soft texture.",
                        "vi": "Vải có kết cấu mềm mại đẹp mắt."
                    },
                    {
                        "en": "Clean the lens with a soft cloth.",
                        "vi": "Làm sạch ống kính bằng vải mềm."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having sharp angles or hard edges",
                    "vi": "không có góc nhọn hoặc cạnh cứng"
                },
                "examples": [
                    {
                        "en": "This season's fashions focus on warm tones and soft lines.",
                        "vi": "Thời trang mùa này tập trung vào tông màu ấm và đường nét mềm mại."
                    },
                    {
                        "en": "The moon's pale light cast soft shadows.",
                        "vi": "Ánh sáng nhàn nhạt của mặt trăng đổ bóng mềm mại."
                    }
                ]
            },
            {
                "define": {
                    "en": "not too bright, in a way that is pleasant and relaxing to the eyes",
                    "vi": "không quá sáng, theo cách dễ chịu và thư giãn cho mắt"
                },
                "examples": [
                    {
                        "en": "a soft pink",
                        "vi": "một màu hồng nhẹ nhàng"
                    },
                    {
                        "en": "the soft glow of candlelight",
                        "vi": "ánh nến dịu nhẹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "not strong or violent",
                    "vi": "không mạnh mẽ hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "A soft breeze rustled the trees.",
                        "vi": "Một làn gió nhẹ xào xạc cây cối."
                    }
                ]
            },
            {
                "define": {
                    "en": "not loud, and usually pleasant and gentle",
                    "vi": "không ồn ào, và thường dễ chịu và nhẹ nhàng"
                },
                "examples": [
                    {
                        "en": "He chose some soft background music and lit the candles.",
                        "vi": "Anh ấy chọn một vài bản nhạc nền nhẹ nhàng và thắp sáng những ngọn nến."
                    },
                    {
                        "en": "She had a soft voice and a kind face.",
                        "vi": "Cô ấy có một giọng nói nhẹ nhàng và một khuôn mặt nhân hậu."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind and showing sympathy; easily affected by other people’s pain and problems",
                    "vi": "tốt bụng và thể hiện sự cảm thông; dễ bị ảnh hưởng bởi nỗi đau và vấn đề của người khác"
                },
                "examples": [
                    {
                        "en": "Julia's soft heart was touched by his grief.",
                        "vi": "Trái tim mềm mại của Julia cảm động trước nỗi đau của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "not strict or severe; not strict or severe enough",
                    "vi": "không nghiêm khắc hoặc nghiêm khắc; không nghiêm ngặt hoặc đủ nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "soft (on somebody/something) The government is not becoming soft on crime.",
                        "vi": "mềm (về ai đó / cái gì đó) Chính phủ không trở nên mềm mỏng đối với tội phạm."
                    },
                    {
                        "en": "soft (with somebody) If you're too soft with these kids they'll never respect you.",
                        "vi": "mềm mỏng (với ai đó) Nếu bạn quá mềm mỏng với những đứa trẻ này, chúng sẽ không bao giờ tôn trọng bạn."
                    },
                    {
                        "en": "Critics say that this soft approach to truancy has failed.",
                        "vi": "Những người chỉ trích nói rằng cách tiếp cận mềm mỏng này để chống trốn học đã thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "stupid or crazy",
                    "vi": "ngu ngốc hay điên rồ"
                },
                "examples": [
                    {
                        "en": "He must be going soft in the head.",
                        "vi": "Anh ấy chắc đang mềm đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "not brave enough; wanting to be safe and comfortable",
                    "vi": "không đủ can đảm; muốn được an toàn và thoải mái"
                },
                "examples": [
                    {
                        "en": "Stay in a hotel? Don't be so soft. I want to camp out under the stars.",
                        "vi": "Ở lại trong khách sạn? Đừng mềm yếu như vậy. Tôi muốn cắm trại dưới những vì sao."
                    }
                ]
            },
            {
                "define": {
                    "en": "not involving much work; too easy and comfortable",
                    "vi": "không liên quan nhiều đến công việc; quá dễ dàng và thoải mái"
                },
                "examples": [
                    {
                        "en": "They had got too used to the soft life at home.",
                        "vi": "Họ đã quá quen với cuộc sống êm ấm ở quê nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "not containing mineral salts and therefore good for washing",
                    "vi": "không chứa muối khoáng và do đó tốt để rửa"
                },
                "examples": [
                    {
                        "en": "You won't need much soap—the water here is very soft.",
                        "vi": "Bạn sẽ không cần nhiều xà phòng - nước ở đây rất mềm."
                    }
                ]
            },
            {
                "define": {
                    "en": "not alcoholic",
                    "vi": "không có cồn"
                },
                "examples": [
                    {
                        "en": "soft beverages",
                        "vi": "nước giải khát"
                    },
                    {
                        "en": "‘What would you like to drink?’ ‘Oh, something soft—I'm driving.’",
                        "vi": "Bạn muốn uống gì?' \"Ồ, một cái gì đó nhẹ nhàng - tôi đang lái xe.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "not sounding hard, for example ‘c’ in city and ‘g’ in general",
                    "vi": "nghe không khó, ví dụ như 'c' ở thành phố và 'g' nói chung"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft spot for you.",
                        "vi": "Cô ấy luôn có một điểm yếu cho bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "033895558ed242a0a0917a5421b99055",
        "word": "soft-hearted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsɒft ˈhɑːtɪd/",
            "us": "/ˌsɔːft ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "soft furnishings",
                "pos": "noun"
            },
            {
                "word": "soft goods",
                "pos": "noun"
            },
            {
                "word": "soft-hearted",
                "pos": "adjective"
            },
            {
                "word": "soft hyphen",
                "pos": "noun"
            },
            {
                "word": "softie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kind and emotional",
                    "vi": "tốt bụng và tình cảm"
                },
                "examples": [
                    {
                        "en": "He’s too soft-hearted for his own good.",
                        "vi": "Anh ấy quá mềm lòng vì lợi ích của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "8df60a4e1da444e4bb084e3acb6639bb",
        "word": "softie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒfti/",
            "us": "/ˈsɔːfti/"
        },
        "nearby": [
            {
                "word": "soft-hearted",
                "pos": "adjective"
            },
            {
                "word": "soft hyphen",
                "pos": "noun"
            },
            {
                "word": "softie",
                "pos": "noun"
            },
            {
                "word": "soft key",
                "pos": "noun"
            },
            {
                "word": "soft launch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kind or emotional person",
                    "vi": "một người tốt bụng hoặc tình cảm"
                },
                "examples": [
                    {
                        "en": "There's no need to be afraid of him—he's a big softie.",
                        "vi": "Không cần phải sợ anh ta - anh ta là một người mềm mại lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "815af1335c724be58d9ab79c784aa5e5",
        "word": "softy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒfti/",
            "us": "/ˈsɔːfti/"
        },
        "nearby": [
            {
                "word": "software package",
                "pos": "noun"
            },
            {
                "word": "softwood",
                "pos": "noun"
            },
            {
                "word": "softy",
                "pos": "noun"
            },
            {
                "word": "soggy",
                "pos": "adjective"
            },
            {
                "word": "soh",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kind or emotional person",
                    "vi": "một người tốt bụng hoặc tình cảm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6fe7978cab09427981c1f72d624a1bec",
        "word": "sweetie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈswiːti/",
            "us": "/ˈswiːti/"
        },
        "nearby": [
            {
                "word": "sweetener",
                "pos": "noun"
            },
            {
                "word": "sweetheart",
                "pos": "noun"
            },
            {
                "word": "sweetie",
                "pos": "noun"
            },
            {
                "word": "sweetish",
                "pos": "adjective"
            },
            {
                "word": "sweetly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child’s word for a sweet",
                    "vi": "lời nói ngọt ngào của một đứa trẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is kind and easy to like",
                    "vi": "một người tốt bụng và dễ thích"
                },
                "examples": [
                    {
                        "en": "He's a real sweetie.",
                        "vi": "Anh ấy là một người yêu thực sự."
                    },
                    {
                        "en": "Be a sweetie and carry this for me.",
                        "vi": "Hãy là một người em yêu và mang cái này cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to address somebody in a kind and loving way",
                    "vi": "được sử dụng để nói với ai đó một cách tử tế và yêu thương"
                },
                "examples": [
                    {
                        "en": "If you ask me, sweetie, you’re making a big mistake.",
                        "vi": "Nếu em hỏi anh, em yêu, em đang mắc một sai lầm lớn."
                    },
                    {
                        "en": "Oh, sweetie. Don’t cry.",
                        "vi": "Thật ngọt ngào. Đừng khóc."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ccd56f14a274ce999a2e62877a9c049",
        "word": "tender-hearted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtendə ˈhɑːtɪd/",
            "us": "/ˌtendər ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "tender",
                "pos": "verb"
            },
            {
                "word": "tenderfoot",
                "pos": "noun"
            },
            {
                "word": "tender-hearted",
                "pos": "adjective"
            },
            {
                "word": "Tender is the Night",
                "pos": ""
            },
            {
                "word": "tenderize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a kind and gentle nature",
                    "vi": "có một bản chất tốt bụng và hiền lành"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a94e5b40207e4850b7a7926e9e4640de",
        "word": "well meaning",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌwel ˈmiːnɪŋ/",
            "us": "/ˌwel ˈmiːnɪŋ/"
        },
        "nearby": [
            {
                "word": "well mannered",
                "pos": "adjective"
            },
            {
                "word": "well matched",
                "pos": "adjective"
            },
            {
                "word": "well meaning",
                "pos": "adjective"
            },
            {
                "word": "well meant",
                "pos": "adjective"
            },
            {
                "word": "We'll Meet Again",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "intending to do what is right and helpful but often not succeeding",
                    "vi": "dự định làm những gì đúng và hữu ích nhưng thường không thành công"
                },
                "examples": [
                    {
                        "en": "a well-meaning attempt to be helpful",
                        "vi": "một nỗ lực có ý nghĩa để trở nên hữu ích"
                    },
                    {
                        "en": "He's very well meaning.",
                        "vi": "Anh ấy rất có ý nghĩa."
                    }
                ]
            }
        ]
    }
]