[
    {
        "id": "1563af08e30b4f1792f5ec18207d8599",
        "word": "page",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/peɪdʒ/",
            "us": "/peɪdʒ/"
        },
        "nearby": [
            {
                "word": "pagan",
                "pos": "adjective"
            },
            {
                "word": "paganism",
                "pos": "noun"
            },
            {
                "word": "page",
                "pos": "noun"
            },
            {
                "word": "page",
                "pos": "verb"
            },
            {
                "word": "pageant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one side or both sides of a sheet of paper in a book, magazine, etc.",
                    "vi": "một mặt hoặc cả hai mặt của tờ giấy trong sách, tạp chí, v.v."
                },
                "examples": [
                    {
                        "en": "Turn to page 64.",
                        "vi": "Chuyển sang trang 64."
                    },
                    {
                        "en": "Someone has torn a page out of this book.",
                        "vi": "Ai đó đã xé một trang của cuốn sách này."
                    },
                    {
                        "en": "She slowly turned the pages of the album.",
                        "vi": "Cô từ từ lật từng trang của cuốn album."
                    },
                    {
                        "en": "a blank page",
                        "vi": "một trang trống"
                    },
                    {
                        "en": "the title/index page",
                        "vi": "trang tiêu đề / chỉ mục"
                    },
                    {
                        "en": "the sports/news pages of the newspaper",
                        "vi": "các trang thể thao / tin tức của tờ báo"
                    },
                    {
                        "en": "the letters/opinion page",
                        "vi": "trang thư / ý kiến"
                    },
                    {
                        "en": "Some newspapers devoted several pages to the scandal.",
                        "vi": "Một số tờ báo dành nhiều trang cho vụ bê bối."
                    },
                    {
                        "en": "on a page The photograph was on the front page of every newspaper.",
                        "vi": "trên một trang Bức ảnh đã xuất hiện trên trang nhất của mọi tờ báo."
                    },
                    {
                        "en": "on the opposite/facing/next page",
                        "vi": "trên trang đối diện / đối mặt / tiếp theo"
                    },
                    {
                        "en": "over the page The address is over the page (= on the next page).",
                        "vi": "trên trang Địa chỉ ở trên trang (= ở trang tiếp theo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of data or information that can be shown on a computer screen at any one time",
                    "vi": "một phần dữ liệu hoặc thông tin có thể được hiển thị trên màn hình máy tính cùng một lúc"
                },
                "examples": [
                    {
                        "en": "to visit/view a page",
                        "vi": "để truy cập / xem một trang"
                    },
                    {
                        "en": "to load/update a page",
                        "vi": "để tải / cập nhật một trang"
                    },
                    {
                        "en": "Press F5 to refresh the page.",
                        "vi": "Nhấn F5 để làm mới trang."
                    },
                    {
                        "en": "The page was really slow to load.",
                        "vi": "Trang tải rất chậm."
                    },
                    {
                        "en": "a Twitter/an Instagram page",
                        "vi": "một trang Twitter / một Instagram"
                    },
                    {
                        "en": "on a page The message was posted on the company's official Facebook page.",
                        "vi": "trên một trang Thông báo được đăng trên trang Facebook chính thức của công ty."
                    },
                    {
                        "en": "This photo will no longer appear on your profile page.",
                        "vi": "Ảnh này sẽ không xuất hiện trên trang cá nhân của bạn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important event or period of history",
                    "vi": "một sự kiện quan trọng hoặc giai đoạn lịch sử"
                },
                "examples": [
                    {
                        "en": "a glorious page of Arab history",
                        "vi": "một trang huy hoàng của lịch sử Ả Rập"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small boy who helps or follows a bride during a marriage ceremony",
                    "vi": "một cậu bé giúp đỡ hoặc đi theo cô dâu trong hôn lễ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a boy or young man, usually in uniform, employed in a hotel to open doors, deliver messages for people, etc.",
                    "vi": "một cậu bé hoặc thanh niên, thường mặc đồng phục, làm việc trong khách sạn để mở cửa, đưa ra thông điệp cho mọi người, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a student who works as an assistant to a member of the US Congress",
                    "vi": "một sinh viên làm trợ lý cho một thành viên của Quốc hội Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a boy or young man who worked for a knight while training to be a knight himself",
                    "vi": "một cậu bé hoặc một người đàn ông trẻ tuổi đã làm việc cho một hiệp sĩ trong khi tự mình đào tạo để trở thành một hiệp sĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two or more people or groups are on the same page, they agree about what they are trying to achieve",
                    "vi": "nếu hai hoặc nhiều người hoặc nhóm trên cùng một trang, họ đồng ý về những gì họ đang cố gắng đạt được"
                },
                "examples": [
                    {
                        "en": "Are employers and employees on the same page when it comes to retirement benefits?",
                        "vi": "Người sử dụng lao động và người lao động có cùng quan điểm khi nói đến trợ cấp hưu trí không?"
                    },
                    {
                        "en": "It was an effort to get us all on the same page.",
                        "vi": "Đó là một nỗ lực để đưa tất cả chúng ta đến cùng một trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is published in books, newspapers, etc.",
                    "vi": "những gì được xuất bản trong sách, báo, v.v."
                },
                "examples": [
                    {
                        "en": "the power of the printed word",
                        "vi": "sức mạnh của từ in"
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin doing things in a different way and thinking in a more positive way after a period of difficulties",
                    "vi": "bắt đầu làm mọi thứ theo một cách khác và suy nghĩ theo hướng tích cực hơn sau một khoảng thời gian khó khăn"
                },
                "examples": [
                    {
                        "en": "It’s time to turn the page and make a fresh start.",
                        "vi": "Đã đến lúc lật trang và bắt đầu lại."
                    },
                    {
                        "en": "He turned the page on that chapter in his life a long time ago.",
                        "vi": "Anh đã lật lại trang đó trong cuộc đời mình từ rất lâu rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c7f93e7abcc4e3bb51803b98a64bc04",
        "word": "text",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/tekst/",
            "us": "/tekst/"
        },
        "nearby": [
            {
                "word": "the Texas Rangers",
                "pos": ""
            },
            {
                "word": "Tex-Mex",
                "pos": "adjective"
            },
            {
                "word": "text",
                "pos": "noun"
            },
            {
                "word": "text",
                "pos": "verb"
            },
            {
                "word": "textbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any form of written material",
                    "vi": "bất kỳ dạng tài liệu viết nào"
                },
                "examples": [
                    {
                        "en": "a computer that can process text",
                        "vi": "một máy tính có thể xử lý văn bản"
                    },
                    {
                        "en": "printed text",
                        "vi": "văn bản in"
                    },
                    {
                        "en": "Highlight the area of text on screen and press the ‘delete’ key.",
                        "vi": "Đánh dấu vùng văn bản trên màn hình và nhấn phím 'xóa'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of writing that you have to answer questions about in an exam or a lesson",
                    "vi": "một bài viết mà bạn phải trả lời các câu hỏi trong một bài kiểm tra hoặc một bài học"
                },
                "examples": [
                    {
                        "en": "Read the text carefully and then answer the questions.",
                        "vi": "Đọc kỹ văn bản và sau đó trả lời các câu hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written message that you send using a mobile phone",
                    "vi": "một tin nhắn bằng văn bản mà bạn gửi bằng điện thoại di động"
                },
                "examples": [
                    {
                        "en": "She sent me a text to say she would be late.",
                        "vi": "Cô ấy đã gửi cho tôi một tin nhắn để nói rằng cô ấy sẽ đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main printed part of a book or magazine, not the notes, pictures, etc.",
                    "vi": "phần được in chính của một cuốn sách hoặc tạp chí, không phải phần ghi chú, hình ảnh, v.v."
                },
                "examples": [
                    {
                        "en": "My job is to lay out the text and graphics on the page.",
                        "vi": "Công việc của tôi là sắp xếp văn bản và đồ họa trên trang."
                    },
                    {
                        "en": "She wrote the text for a book of photographs.",
                        "vi": "Cô ấy đã viết văn bản cho một cuốn sách ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the written form of a speech, a play, an article, etc.",
                    "vi": "dạng viết của một bài phát biểu, một vở kịch, một bài báo, v.v."
                },
                "examples": [
                    {
                        "en": "The newspaper had printed the full text of the president's speech.",
                        "vi": "Tờ báo đã in toàn văn bài phát biểu của tổng thống."
                    },
                    {
                        "en": "Can you act out this scene without referring to the text?",
                        "vi": "Bạn có thể diễn cảnh này mà không cần tham khảo văn bản không?"
                    },
                    {
                        "en": "The filmed version of Henry V stays close to the original text.",
                        "vi": "Phiên bản quay của Henry V vẫn gần với văn bản gốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book, play, etc., especially one that is being studied",
                    "vi": "một cuốn sách, vở kịch, v.v., đặc biệt là một cuốn sách đang được nghiên cứu"
                },
                "examples": [
                    {
                        "en": "a literary text",
                        "vi": "một văn bản văn học"
                    },
                    {
                        "en": "sacred/religious/ancient texts",
                        "vi": "văn bản thiêng liêng / tôn giáo / cổ đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that teaches a particular subject and that is used especially in schools and colleges",
                    "vi": "một cuốn sách dạy một chủ đề cụ thể và được sử dụng đặc biệt trong các trường học và cao đẳng"
                },
                "examples": [
                    {
                        "en": "medical texts",
                        "vi": "văn bản y tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sentence or short passage from the Bible that is read out and discussed by somebody, especially during a religious service",
                    "vi": "một câu hoặc đoạn văn ngắn trong Kinh thánh được ai đó đọc và thảo luận, đặc biệt là trong một buổi lễ tôn giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "85142eda1641433cae463c62bb4b4bfd",
        "word": "title",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtaɪtl/",
            "us": "/ˈtaɪtl/"
        },
        "nearby": [
            {
                "word": "titillation",
                "pos": "noun"
            },
            {
                "word": "titivate",
                "pos": "verb"
            },
            {
                "word": "title",
                "pos": "noun"
            },
            {
                "word": "title",
                "pos": "verb"
            },
            {
                "word": "title bar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the name of a book, poem, painting, piece of music, etc.",
                    "vi": "tên của một cuốn sách, bài thơ, bức tranh, bản nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "What's title of her new book?",
                        "vi": "Tên cuốn sách mới của cô ấy là gì?"
                    },
                    {
                        "en": "a book/album title",
                        "vi": "tựa sách / album"
                    },
                    {
                        "en": "Some of his song titles and lyrics have also attracted criticism.",
                        "vi": "Một số tên bài hát và lời bài hát của anh ấy cũng đã bị chỉ trích."
                    },
                    {
                        "en": "under a title His poems were published under the title of ‘Love and Reason’.",
                        "vi": "dưới một tiêu đề Các bài thơ của ông đã được xuất bản với tiêu đề 'Tình yêu và lý trí'."
                    },
                    {
                        "en": "the title track from their latest CD (= the song with the same title as the disc)",
                        "vi": "ca khúc chủ đề từ CD mới nhất của họ (= bài hát có cùng tiêu đề với đĩa)"
                    },
                    {
                        "en": "She has sung the title role in ‘Carmen’ (= the role of Carmen in that opera).",
                        "vi": "Cô đã hát vai chính trong 'Carmen' (= vai Carmen trong vở opera đó)."
                    },
                    {
                        "en": "The title character (= the person mentioned in the name of the book, play, etc.) is a native of Colombia.",
                        "vi": "Nhân vật tiêu đề (= người được đề cập trong tên cuốn sách, vở kịch, v.v.) là người gốc Colombia."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular book or magazine",
                    "vi": "một cuốn sách hoặc tạp chí cụ thể"
                },
                "examples": [
                    {
                        "en": "The company publishes twenty new titles a year.",
                        "vi": "Công ty xuất bản hai mươi đầu sách mới mỗi năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word in front of a person’s name to show their rank or profession, whether or not they are married, etc.",
                    "vi": "một từ phía trước tên của một người để thể hiện cấp bậc hoặc nghề nghiệp của họ, cho dù họ đã kết hôn hay chưa, v.v."
                },
                "examples": [
                    {
                        "en": "The present duke inherited the title from his father.",
                        "vi": "Vị công tước hiện tại được thừa kế tước vị từ cha mình."
                    },
                    {
                        "en": "Give your name and title (= Mr, Miss, Ms, Dr, etc.).",
                        "vi": "Cho biết tên và chức danh của bạn (= Mr, Miss, Ms, Dr, v.v.)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a name that describes a job",
                    "vi": "một cái tên mô tả một công việc"
                },
                "examples": [
                    {
                        "en": "The official title of the job is ‘Administrative Assistant’.",
                        "vi": "Chức danh chính thức của công việc là 'Trợ lý hành chính'."
                    },
                    {
                        "en": "What is your name and job title?",
                        "vi": "Tên và chức danh của bạn là gì?"
                    },
                    {
                        "en": "Bessie Smith earned the title ‘Empress of the Blues’.",
                        "vi": "Bessie Smith đã giành được danh hiệu 'Nữ hoàng của The Blues'."
                    },
                    {
                        "en": "In 2017, Brooks assumed the title of chairman.",
                        "vi": "Năm 2017, Brooks đảm nhận chức danh chủ tịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position of being the winner of a competition, especially a sports competition",
                    "vi": "vị trí của người chiến thắng trong một cuộc thi, đặc biệt là một cuộc thi thể thao"
                },
                "examples": [
                    {
                        "en": "She has won three world titles.",
                        "vi": "Cô đã giành được ba danh hiệu thế giới."
                    },
                    {
                        "en": "He'll be defending his title at this week's French Open.",
                        "vi": "Anh ấy sẽ bảo vệ danh hiệu của mình tại Pháp mở rộng tuần này."
                    },
                    {
                        "en": "the world heavyweight title",
                        "vi": "danh hiệu hạng nặng thế giới"
                    },
                    {
                        "en": "the league/division/national title",
                        "vi": "giải đấu / bộ phận / chức vô địch quốc gia"
                    },
                    {
                        "en": "a title fight (= in boxing)",
                        "vi": "một trận tranh đai (= trong quyền anh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the legal right to own something, especially land or property; the document that shows you have this right",
                    "vi": "quyền hợp pháp để sở hữu một cái gì đó, đặc biệt là đất đai hoặc tài sản; tài liệu cho thấy bạn có quyền này"
                },
                "examples": [
                    {
                        "en": "He claims he has title to the land.",
                        "vi": "Anh ta tuyên bố anh ta có quyền sở hữu đất đai."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f841ff885ad42589b6ad1b762d69d0b",
        "word": "chapter",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtʃæptə(r)/",
            "us": "/ˈtʃæptər/"
        },
        "nearby": [
            {
                "word": "Chapter 11",
                "pos": "noun"
            },
            {
                "word": "Chapter 7",
                "pos": "noun"
            },
            {
                "word": "chapter",
                "pos": "noun"
            },
            {
                "word": "chapter house",
                "pos": "noun"
            },
            {
                "word": "char",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a separate section of a book, usually with a number or title",
                    "vi": "một phần riêng biệt của sách, thường có số hoặc tiêu đề"
                },
                "examples": [
                    {
                        "en": "to read/write a chapter",
                        "vi": "để đọc / viết một chương"
                    },
                    {
                        "en": "He devotes an entire chapter to this topic.",
                        "vi": "Anh ấy dành hẳn một chương cho chủ đề này."
                    },
                    {
                        "en": "I've just finished Chapter 3.",
                        "vi": "Tôi vừa hoàn thành Chương 3."
                    },
                    {
                        "en": "I read chapter after chapter of the book.",
                        "vi": "Tôi đọc hết chương này đến chương khác của cuốn sách."
                    },
                    {
                        "en": "in a chapter in the previous/next/first/last chapter",
                        "vi": "trong một chương trong chương trước / tiếp theo / đầu tiên / cuối cùng"
                    },
                    {
                        "en": "in a later chapter",
                        "vi": "trong một chương sau"
                    },
                    {
                        "en": "There is a useful summary at the end of the chapter.",
                        "vi": "Có một bản tóm tắt hữu ích ở cuối chương."
                    },
                    {
                        "en": "chapter of something the final chapter of her autobiography",
                        "vi": "chương gì đó chương cuối cùng trong cuốn tự truyện của cô ấy"
                    },
                    {
                        "en": "the opening chapter of the book",
                        "vi": "chương mở đầu của cuốn sách"
                    },
                    {
                        "en": "chapter in something the most interesting chapter in the book",
                        "vi": "chương nào đó chương thú vị nhất trong cuốn sách"
                    },
                    {
                        "en": "chapter on something Have you read the chapter on the legal system?",
                        "vi": "chương về cái gì Bạn đã đọc chương về hệ thống pháp luật chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time in a person’s life or in history",
                    "vi": "một khoảng thời gian trong cuộc đời của một người hoặc trong lịch sử"
                },
                "examples": [
                    {
                        "en": "a difficult chapter in our country’s history",
                        "vi": "một chương khó trong lịch sử nước ta"
                    },
                    {
                        "en": "Her return to Kansas ended a particularly unhappy chapter in her life.",
                        "vi": "Sự trở lại Kansas của cô ấy đã kết thúc một chương đặc biệt bất hạnh trong cuộc đời cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the priests of a cathedral or members of a religious community",
                    "vi": "tất cả các linh mục của một nhà thờ lớn hoặc các thành viên của một cộng đồng tôn giáo"
                },
                "examples": [
                    {
                        "en": "a meeting of the dean and chapter",
                        "vi": "một cuộc họp của trưởng khoa và chương"
                    }
                ]
            },
            {
                "define": {
                    "en": "a local branch of a society, club, etc.",
                    "vi": "một chi hội địa phương của một xã hội, câu lạc bộ, v.v."
                },
                "examples": [
                    {
                        "en": "the local chapter of the Rotary club",
                        "vi": "chương địa phương của câu lạc bộ Rotary"
                    }
                ]
            },
            {
                "define": {
                    "en": "the exact details of something, especially the exact place where particular information may be found",
                    "vi": "chi tiết chính xác của một cái gì đó, đặc biệt là nơi chính xác nơi thông tin cụ thể có thể được tìm thấy"
                },
                "examples": [
                    {
                        "en": "I can't give chapter and verse, but that's the rough outline of our legal position.",
                        "vi": "Tôi không thể cung cấp chương và câu, nhưng đó là phác thảo sơ bộ về vị trí pháp lý của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of unpleasant events caused by bad luck",
                    "vi": "một loạt các sự kiện khó chịu do vận rủi gây ra"
                },
                "examples": [
                    {
                        "en": "The whole affair has been a chapter of accidents from start to finish.",
                        "vi": "Toàn bộ vụ việc là một chương tai nạn từ đầu đến cuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "35d6b5e405f04bfd84b77c9d289290f5",
        "word": "cover",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkʌvə(r)/",
            "us": "/ˈkʌvər/"
        },
        "nearby": [
            {
                "word": "Coventry",
                "pos": ""
            },
            {
                "word": "cover",
                "pos": "verb"
            },
            {
                "word": "cover",
                "pos": "noun"
            },
            {
                "word": "coverage",
                "pos": "noun"
            },
            {
                "word": "coverall",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is put over or on another thing, usually to protect it or to decorate it",
                    "vi": "một thứ được phủ lên hoặc trên một thứ khác, thường là để bảo vệ nó hoặc để trang trí"
                },
                "examples": [
                    {
                        "en": "Brighten up your room with some colourful cushion covers.",
                        "vi": "Hãy làm bừng sáng căn phòng của bạn với một số tấm trải đệm đầy màu sắc."
                    },
                    {
                        "en": "cover for something a plastic waterproof cover for the pushchair",
                        "vi": "che một cái gì đó một tấm che chống thấm bằng nhựa cho xe đẩy"
                    }
                ]
            },
            {
                "define": {
                    "en": "shelter from bad weather or protection from an attack",
                    "vi": "tránh thời tiết xấu hoặc bảo vệ khỏi một cuộc tấn công"
                },
                "examples": [
                    {
                        "en": "for cover Everyone ran for cover when it started to rain.",
                        "vi": "tìm chỗ nấp Mọi người chạy đi tìm chỗ nấp khi trời bắt đầu mưa."
                    },
                    {
                        "en": "After the explosion the street was full of people running for cover.",
                        "vi": "Sau vụ nổ, đường phố chật ních người chạy tìm chỗ ẩn nấp."
                    },
                    {
                        "en": "The climbers took cover from the storm in a cave.",
                        "vi": "Những người leo núi trú ẩn khỏi cơn bão trong một hang động."
                    }
                ]
            },
            {
                "define": {
                    "en": "the outside of a book or a magazine",
                    "vi": "bên ngoài của một cuốn sách hoặc một tạp chí"
                },
                "examples": [
                    {
                        "en": "the front/back cover",
                        "vi": "bìa trước / sau"
                    },
                    {
                        "en": "His photographs grace many book and magazine covers.",
                        "vi": "Những bức ảnh của ông đã làm duyên cho nhiều trang bìa sách và tạp chí."
                    },
                    {
                        "en": "on the cover Her face was on the cover (= the front cover) of every magazine.",
                        "vi": "trên trang bìa Gương mặt của cô ấy đã xuất hiện trên trang bìa (= bìa trước) của mọi tạp chí."
                    },
                    {
                        "en": "He always reads the paper from cover to cover (= everything in it).",
                        "vi": "Anh ấy luôn đọc tờ giấy từ đầu đến cuối (= tất cả mọi thứ trong đó)."
                    },
                    {
                        "en": "Have you seen the cover of the latest issue?",
                        "vi": "Bạn đã xem trang bìa của số mới nhất chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "protection that an insurance company provides by promising to pay you money if a particular event happens",
                    "vi": "sự bảo vệ mà công ty bảo hiểm cung cấp bằng cách hứa trả tiền cho bạn nếu một sự kiện cụ thể xảy ra"
                },
                "examples": [
                    {
                        "en": "accident cover",
                        "vi": "bảo hiểm tai nạn"
                    },
                    {
                        "en": "cover against something cover against accidental damage",
                        "vi": "che phủ chống lại một cái gì đó che phủ chống lại thiệt hại ngẫu nhiên"
                    },
                    {
                        "en": "cover for something There is no cover provided by the policy for theft of property from cars or garages.",
                        "vi": "bảo hiểm cho một cái gì đó Không có sự bảo hiểm nào được cung cấp bởi chính sách đối với hành vi trộm cắp tài sản từ ô tô hoặc nhà để xe."
                    },
                    {
                        "en": "private health cover costs",
                        "vi": "chi phí bảo hiểm y tế tư nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "support and protection that is provided when somebody is attacking or in danger of being attacked",
                    "vi": "hỗ trợ và bảo vệ được cung cấp khi ai đó đang tấn công hoặc có nguy cơ bị tấn công"
                },
                "examples": [
                    {
                        "en": "The ships needed air cover (= protection by military planes) once they reached enemy waters.",
                        "vi": "Các con tàu cần có sự che chở trên không (= sự bảo vệ của máy bay quân sự) khi chúng đến vùng biển của đối phương."
                    },
                    {
                        "en": "The RAF provided air cover for the attack.",
                        "vi": "RAF đã cung cấp lực lượng phòng không cho cuộc tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "trees and plants that grow on an area of land",
                    "vi": "cây cối và thực vật mọc trên một khu đất"
                },
                "examples": [
                    {
                        "en": "The total forest cover of the earth is decreasing.",
                        "vi": "Tổng độ che phủ của trái đất đang giảm dần."
                    },
                    {
                        "en": "Zebras and other animals were standing very still in broken cover.",
                        "vi": "Ngựa vằn và các loài động vật khác đang đứng yên trong lớp vỏ bọc bị vỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of the sky being covered with cloud or the ground with snow",
                    "vi": "thực tế là bầu trời bị mây bao phủ hoặc mặt đất có tuyết"
                },
                "examples": [
                    {
                        "en": "Fog and low cloud cover are expected this afternoon.",
                        "vi": "Dự báo chiều nay có sương mù và ít mây bao phủ."
                    },
                    {
                        "en": "In this area there is snow cover for six months of the year.",
                        "vi": "Ở khu vực này có tuyết phủ trong sáu tháng trong năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sheets, blankets, etc. on a bed",
                    "vi": "khăn trải giường, chăn, v.v. trên giường"
                },
                "examples": [
                    {
                        "en": "She threw back the covers and leapt out of bed.",
                        "vi": "Cô ném lại chăn và nhảy ra khỏi giường."
                    },
                    {
                        "en": "He climbed into the cold bed and snuggled beneath the covers.",
                        "vi": "Anh leo lên chiếc giường lạnh lẽo và chui rúc bên dưới những tấm chăn."
                    },
                    {
                        "en": "He pulled the covers over his head and tried to get back to sleep.",
                        "vi": "Anh kéo chăn trùm kín đầu và cố ngủ trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a new recording of an old song by a different band or singer",
                    "vi": "bản ghi âm mới của một bài hát cũ của một ban nhạc hoặc ca sĩ khác"
                },
                "examples": [
                    {
                        "en": "They started out singing covers of country songs.",
                        "vi": "Họ bắt đầu hát cover các bài hát đồng quê."
                    },
                    {
                        "en": "a Beatles cover band (= a band that plays songs originally recorded by the Beatles)",
                        "vi": "một ban nhạc cover của The Beatles (= một ban nhạc chơi các bài hát ban đầu của Beatles)"
                    }
                ]
            },
            {
                "define": {
                    "en": "activities or behaviour that seem honest or true but that hide somebody’s real identity or feelings, or that hide something illegal",
                    "vi": "các hoạt động hoặc hành vi có vẻ trung thực hoặc đúng sự thật nhưng che giấu danh tính hoặc cảm xúc thực của ai đó hoặc che giấu điều gì đó bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "His work as a civil servant was a cover for his activities as a spy.",
                        "vi": "Công việc của anh ta như một công chức là một vỏ bọc cho các hoạt động của anh ta với tư cách là một điệp viên."
                    },
                    {
                        "en": "Her over-confident attitude was a cover for her nervousness.",
                        "vi": "Thái độ tự tin thái quá của cô ấy là vỏ bọc cho sự lo lắng của cô ấy."
                    },
                    {
                        "en": "It would only take one phone call to blow their cover (= make known their true identities and what they were really doing).",
                        "vi": "Chỉ cần một cuộc điện thoại là có thể thổi bay vỏ bọc của họ (= cho biết danh tính thực sự của họ và những gì họ thực sự đang làm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of somebody doing a job when the person who usually does it is away or when there are not enough staff",
                    "vi": "thực tế là ai đó làm một công việc khi người thường làm việc đó đi vắng hoặc khi không có đủ nhân viên"
                },
                "examples": [
                    {
                        "en": "It's the manager's job to organize cover for staff who are absent.",
                        "vi": "Nhiệm vụ của người quản lý là tổ chức trang trải cho những nhân viên vắng mặt."
                    },
                    {
                        "en": "Ambulance drivers provided only emergency cover during the dispute.",
                        "vi": "Tài xế xe cứu thương chỉ cung cấp vỏ bọc khẩn cấp trong thời gian tranh chấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a place that you have been hiding in, usually at a high speed",
                    "vi": "rời khỏi một nơi mà bạn đã ẩn nấp, thường ở tốc độ cao"
                },
                "examples": [
                    {
                        "en": "The vehicles broke cover and headed towards the enemy’s headquarters.",
                        "vi": "Các xe phá vỡ chỗ ẩn nấp và tiến về cơ quan đầu não của địch."
                    },
                    {
                        "en": "The deer broke cover as the hunters approached.",
                        "vi": "Con hươu phá vỡ chỗ ẩn nấp khi những người thợ săn đến gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not form an opinion about somebody/something from their appearance only",
                    "vi": "được sử dụng để nói rằng bạn không nên hình thành ý kiến về ai đó / điều gì đó chỉ từ vẻ ngoài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pretending to be somebody else in order to do something secretly",
                    "vi": "giả làm người khác để làm điều gì đó bí mật"
                },
                "examples": [
                    {
                        "en": "a police officer working under cover",
                        "vi": "một sĩ quan cảnh sát làm việc dưới vỏ bọc"
                    }
                ]
            },
            {
                "define": {
                    "en": "under a structure that gives protection from the weather",
                    "vi": "dưới một cấu trúc bảo vệ khỏi thời tiết"
                },
                "examples": [
                    {
                        "en": "Start growing the plants indoors or under cover.",
                        "vi": "Bắt đầu trồng cây trong nhà hoặc dưới mái che."
                    },
                    {
                        "en": "All the seats are under cover.",
                        "vi": "Tất cả các ghế đều được bọc lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "hidden or protected by something",
                    "vi": "ẩn hoặc được bảo vệ bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Later, under cover of darkness, they crept into the house.",
                        "vi": "Sau đó, dưới bóng tối bao trùm, họ len lỏi vào nhà."
                    },
                    {
                        "en": "We attacked at night, under cover of darkness.",
                        "vi": "Chúng tôi tấn công vào ban đêm, dưới bóng tối bao trùm."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a separate envelope",
                    "vi": "trong một phong bì riêng"
                },
                "examples": [
                    {
                        "en": "The information you requested is being forwarded to you under separate cover.",
                        "vi": "Thông tin bạn yêu cầu đang được chuyển tiếp đến bạn dưới trang bìa riêng."
                    }
                ]
            }
        ]
    },
    {
        "id": "19985820a3284339aa939efa93b3ec5a",
        "word": "entry",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈentri/",
            "us": "/ˈentri/"
        },
        "nearby": [
            {
                "word": "entropy",
                "pos": "noun"
            },
            {
                "word": "entrust",
                "pos": "verb"
            },
            {
                "word": "entry",
                "pos": "noun"
            },
            {
                "word": "entry-level",
                "pos": "adjective"
            },
            {
                "word": "Entryphone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of going into or getting into a place",
                    "vi": "một hành động đi vào hoặc đến một nơi"
                },
                "examples": [
                    {
                        "en": "She made her entry to the sound of thunderous applause.",
                        "vi": "Cô ấy đã nhập cuộc trong tiếng vỗ tay như sấm."
                    },
                    {
                        "en": "The children were surprised by the sudden entry of their teacher.",
                        "vi": "Bọn trẻ ngạc nhiên trước sự đột ngột của cô giáo."
                    },
                    {
                        "en": "They block the entry of the HIV virus into the cells.",
                        "vi": "Chúng ngăn chặn sự xâm nhập của vi rút HIV vào các tế bào."
                    },
                    {
                        "en": "entry into something How did the thieves gain entry into the building?",
                        "vi": "xâm nhập vào một cái gì đó Làm thế nào những tên trộm xâm nhập vào tòa nhà?"
                    },
                    {
                        "en": "entry to something Efforts to effect an entry to the flooded submarine were unsuccessful.",
                        "vi": "lối vào một cái gì đó Những nỗ lực để thực hiện một lối vào tàu ngầm ngập nước đã không thành công."
                    },
                    {
                        "en": "Drugs come into the country through five main entry points.",
                        "vi": "Ma túy vào nước này thông qua 5 cửa khẩu chính."
                    },
                    {
                        "en": "There are security checks at the point of entry.",
                        "vi": "Có kiểm tra an ninh tại điểm nhập cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to enter a place",
                    "vi": "quyền hoặc cơ hội để vào một nơi"
                },
                "examples": [
                    {
                        "en": "No Entry (= for example, on a sign)",
                        "vi": "Không có mục nhập (= ví dụ: trên một dấu hiệu)"
                    },
                    {
                        "en": "entry to something Entry to the museum is free.",
                        "vi": "vào cửa một cái gì đó Vào cửa bảo tàng là miễn phí."
                    },
                    {
                        "en": "entry into something to be granted/refused entry into the country",
                        "vi": "nhập cảnh vào một cái gì đó để được cấp / từ chối nhập cảnh vào đất nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you do, write or make to take part in a competition, for example answering a set of questions",
                    "vi": "điều gì đó bạn làm, viết hoặc làm để tham gia một cuộc thi, chẳng hạn như trả lời một bộ câu hỏi"
                },
                "examples": [
                    {
                        "en": "There have been some impressive entries in the wildlife photography section (= impressive photographs).",
                        "vi": "Đã có một số bài dự thi ấn tượng trong phần nhiếp ảnh động vật hoang dã (= những bức ảnh ấn tượng)."
                    },
                    {
                        "en": "The closing date for entries is 31 March.",
                        "vi": "Ngày đóng cửa cho các mục là 31 tháng Ba."
                    },
                    {
                        "en": "The winning entry will be published in next month's issue.",
                        "vi": "Bài dự thi chiến thắng sẽ được xuất bản trong số ra tháng tới."
                    },
                    {
                        "en": "The sender of the first correct entry drawn will win a weekend for two in Venice.",
                        "vi": "Người gửi bài viết đúng đầu tiên được rút thăm sẽ giành chiến thắng trong hai ngày cuối tuần ở Venice."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of taking part in a competition, race, etc.",
                    "vi": "hành động tham gia vào một cuộc thi, cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "Entry is open to anyone over the age of 18.",
                        "vi": "Mọi người trên 18 tuổi đều có thể vào cửa."
                    },
                    {
                        "en": "an entry form/fee",
                        "vi": "một biểu mẫu / lệ phí tham gia"
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of people who are taking part in a competition, race, etc.",
                    "vi": "tổng số người đang tham gia một cuộc thi, cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "There's a record entry for this year's marathon.",
                        "vi": "Có một mục nhập kỷ lục cho cuộc thi marathon năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item, for example a piece of information, that is written or printed in a dictionary, an account book, a diary, etc.",
                    "vi": "một mục, ví dụ một đoạn thông tin, được viết hoặc in trong từ điển, sổ tài khoản, nhật ký, v.v."
                },
                "examples": [
                    {
                        "en": "an encyclopedia entry",
                        "vi": "Một mục nhập bách khoa toàn thư"
                    },
                    {
                        "en": "a blog/diary/journal entry",
                        "vi": "một mục blog / nhật ký / tạp chí"
                    },
                    {
                        "en": "entry in something There is no entry in his diary for that day.",
                        "vi": "entry in something Không có mục nào trong nhật ký của anh ấy cho ngày hôm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of recording information in a computer, book, etc.",
                    "vi": "hành động ghi lại thông tin trong máy tính, sách, v.v."
                },
                "examples": [
                    {
                        "en": "The job involves filing and data entry.",
                        "vi": "Công việc liên quan đến việc lập hồ sơ và nhập dữ liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to take part in something or become a member of a group",
                    "vi": "quyền hoặc cơ hội tham gia vào điều gì đó hoặc trở thành thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "entry into something countries seeking entry into the European Union",
                        "vi": "nhập cảnh vào một số quốc gia đang tìm cách gia nhập Liên minh Châu Âu"
                    },
                    {
                        "en": "It is extremely difficult for new companies to gain entry into the market.",
                        "vi": "Các công ty mới gia nhập thị trường là điều vô cùng khó khăn."
                    },
                    {
                        "en": "entry to something She applied for entry to Nottingham University.",
                        "vi": "entry to something Cô ấy đã nộp đơn xin vào Đại học Nottingham."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of taking part in an activity or becoming a member of a group",
                    "vi": "hành động tham gia vào một hoạt động hoặc trở thành thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "entry into something Things changed forever with the entry of women into the workforce.",
                        "vi": "thâm nhập vào một cái gì đó Mọi thứ đã thay đổi mãi mãi với sự gia nhập của phụ nữ vào lực lượng lao động."
                    },
                    {
                        "en": "That was before the American entry into the war.",
                        "vi": "Đó là trước khi người Mỹ tham chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a door, gate or passage where you enter a building; an entrance hall",
                    "vi": "cửa, cổng hoặc lối đi mà bạn bước vào một tòa nhà; một sảnh vào"
                },
                "examples": [
                    {
                        "en": "You can leave your umbrella in the entry.",
                        "vi": "Bạn có thể để ô của bạn ở lối vào."
                    },
                    {
                        "en": "the dramatic entry to the gallery",
                        "vi": "lối vào phòng trưng bày ấn tượng"
                    }
                ]
            }
        ]
    },
    {
        "id": "add9b61f821545939cd38b6a52122603",
        "word": "glossary",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡlɒsəri/",
            "us": "/ˈɡlɑːsəri/"
        },
        "nearby": [
            {
                "word": "gloss",
                "pos": "noun"
            },
            {
                "word": "gloss",
                "pos": "verb"
            },
            {
                "word": "glossary",
                "pos": "noun"
            },
            {
                "word": "gloss over",
                "pos": "phrasal verb"
            },
            {
                "word": "glossy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list of technical or special words, especially those in a particular text, explaining their meanings",
                    "vi": "một danh sách các từ kỹ thuật hoặc đặc biệt, đặc biệt là những từ trong một văn bản cụ thể, giải thích ý nghĩa của chúng"
                },
                "examples": [
                    {
                        "en": "a glossary of financial terms",
                        "vi": "bảng chú giải thuật ngữ tài chính"
                    },
                    {
                        "en": "She has compiled a glossary of horse-riding terms.",
                        "vi": "Cô ấy đã biên soạn một bảng chú giải thuật ngữ cưỡi ngựa."
                    },
                    {
                        "en": "The book includes a useful glossary of the technical terms used.",
                        "vi": "Cuốn sách bao gồm một bảng chú giải hữu ích về các thuật ngữ kỹ thuật được sử dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a0b0a28a2ac947388e4d89199ad1397b",
        "word": "index",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɪndeks/",
            "us": "/ˈɪndeks/"
        },
        "nearby": [
            {
                "word": "indeterminacy",
                "pos": "noun"
            },
            {
                "word": "indeterminate",
                "pos": "adjective"
            },
            {
                "word": "index",
                "pos": "noun"
            },
            {
                "word": "index",
                "pos": "verb"
            },
            {
                "word": "indexation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list of names or topics that are referred to in a book, etc., usually arranged at the end of a book in alphabetical order or listed in a separate file or book",
                    "vi": "danh sách tên hoặc chủ đề được đề cập đến trong sách, v.v., thường được sắp xếp ở cuối sách theo thứ tự bảng chữ cái hoặc được liệt kê trong một tệp hoặc sách riêng biệt"
                },
                "examples": [
                    {
                        "en": "Look it up in the index.",
                        "vi": "Tra cứu nó trong chỉ mục."
                    },
                    {
                        "en": "Author and subject indexes are available on a library database.",
                        "vi": "Chỉ mục tác giả và chủ đề có sẵn trên cơ sở dữ liệu thư viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a box of cards with information on them, arranged in alphabetical order",
                    "vi": "một hộp thẻ với thông tin về chúng, sắp xếp theo thứ tự bảng chữ cái"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system that shows the level of prices and wages, etc. so that they can be compared with those of a previous date",
                    "vi": "một hệ thống hiển thị mức giá cả và tiền lương, v.v. để chúng có thể được so sánh với mức giá của một ngày trước đó"
                },
                "examples": [
                    {
                        "en": "the cost-of-living index",
                        "vi": "chỉ số giá sinh hoạt"
                    },
                    {
                        "en": "The Dow Jones index fell 15 points this morning.",
                        "vi": "Chỉ số Dow Jones sáng nay giảm 15 điểm."
                    },
                    {
                        "en": "stock-market indices",
                        "vi": "chỉ số thị trường chứng khoán"
                    },
                    {
                        "en": "house price indexes",
                        "vi": "chỉ số giá nhà"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sign or measure that something else can be judged by",
                    "vi": "một dấu hiệu hoặc thước đo mà một cái gì đó khác có thể được đánh giá bằng"
                },
                "examples": [
                    {
                        "en": "The number of new houses being built is a good index of a country's prosperity.",
                        "vi": "Số lượng nhà mới được xây dựng là một chỉ số tốt về sự thịnh vượng của một quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "the small number written above a larger number to show how many times that number must be multiplied by itself. In the equation 42 = 16, the number 2 is an index.",
                    "vi": "số nhỏ viết trên số lớn hơn để biết số đó phải nhân với chính nó bao nhiêu lần. Trong phương trình 42 = 16, số 2 là một chỉ số."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0f56411525b74fbca2107bc97c154b25",
        "word": "margin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɑːdʒɪn/",
            "us": "/ˈmɑːrdʒɪn/"
        },
        "nearby": [
            {
                "word": "Margate",
                "pos": ""
            },
            {
                "word": "Margery",
                "pos": ""
            },
            {
                "word": "margin",
                "pos": "noun"
            },
            {
                "word": "marginal",
                "pos": "adjective"
            },
            {
                "word": "marginal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the empty space at the side of a written or printed page",
                    "vi": "không gian trống ở bên cạnh của một trang viết hoặc in"
                },
                "examples": [
                    {
                        "en": "the left-hand/right-hand margin",
                        "vi": "lề bên trái / bên phải"
                    },
                    {
                        "en": "a narrow/wide margin",
                        "vi": "biên độ hẹp / rộng"
                    },
                    {
                        "en": "in the margin notes scribbled in the margin",
                        "vi": "trong lề ghi chú nguệch ngoạc trong lề"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of time, or number of votes, etc. by which somebody wins something",
                    "vi": "lượng thời gian hoặc số phiếu bầu, v.v. mà ai đó giành được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He won by a narrow margin.",
                        "vi": "Anh ấy đã thắng với tỷ số sít sao."
                    },
                    {
                        "en": "by a margin of something She beat the other runners by a margin of ten seconds.",
                        "vi": "cô ấy đánh bại các vận động viên khác với biên độ mười giây."
                    },
                    {
                        "en": "Members voted by a margin of 7–1 to become a public limited company.",
                        "vi": "Các thành viên đã bỏ phiếu với tỷ lệ chênh lệch 7–1 để trở thành công ty trách nhiệm hữu hạn đại chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the difference between the cost of buying or producing something and the price that it is sold for",
                    "vi": "sự khác biệt giữa chi phí mua hoặc sản xuất thứ gì đó và giá mà nó được bán"
                },
                "examples": [
                    {
                        "en": "What are your average operating margins?",
                        "vi": "Biên lợi nhuận hoạt động trung bình của bạn là gì?"
                    },
                    {
                        "en": "a gross margin of 45 per cent",
                        "vi": "tỷ suất lợi nhuận gộp 45%"
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra amount of something such as time, space, money, etc. that you include in order to make sure that something is successful",
                    "vi": "thêm một số thứ như thời gian, không gian, tiền bạc, v.v. mà bạn bao gồm để đảm bảo rằng điều gì đó thành công"
                },
                "examples": [
                    {
                        "en": "a safety margin",
                        "vi": "một biên độ an toàn"
                    },
                    {
                        "en": "The narrow gateway left me little margin for error as I reversed the car.",
                        "vi": "Cửa ngõ hẹp khiến tôi có chút sai sót khi lùi xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the extreme edge or limit of a place",
                    "vi": "rìa cực hạn hoặc giới hạn của một địa điểm"
                },
                "examples": [
                    {
                        "en": "the eastern margin of the Indian Ocean",
                        "vi": "rìa phía đông của Ấn Độ Dương"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that is not included in the main part of a group or situation",
                    "vi": "phần không có trong phần chính của nhóm hoặc tình huống"
                },
                "examples": [
                    {
                        "en": "on the margins of something people living on the margins of society",
                        "vi": "bên lề của một cái gì đó những người sống bên lề xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount that is added to a basic wage, paid for special skill or responsibility",
                    "vi": "một số tiền được thêm vào mức lương cơ bản, được trả cho kỹ năng hoặc trách nhiệm đặc biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ee5e31f5e4904a3aab00eb89345ff057",
        "word": "subtitle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌbtaɪtl/",
            "us": "/ˈsʌbtaɪtl/"
        },
        "nearby": [
            {
                "word": "subterranean",
                "pos": "adjective"
            },
            {
                "word": "subtext",
                "pos": "noun"
            },
            {
                "word": "subtitle",
                "pos": "noun"
            },
            {
                "word": "subtitle",
                "pos": "verb"
            },
            {
                "word": "subtle",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that translate what is said in a film into a different language and appear on the screen at the bottom. Subtitles are also used, especially on television, to help deaf people (= people who cannot hear well)",
                    "vi": "các từ dịch những gì được nói trong phim sang một ngôn ngữ khác và xuất hiện trên màn hình ở dưới cùng. Phụ đề cũng được sử dụng, đặc biệt là trên truyền hình, để giúp đỡ những người khiếm thính (= những người không thể nghe rõ)"
                },
                "examples": [
                    {
                        "en": "a Polish film with English subtitles",
                        "vi": "một bộ phim Ba Lan có phụ đề tiếng Anh"
                    },
                    {
                        "en": "Is the movie dubbed or are there subtitles?",
                        "vi": "Phim được lồng tiếng hay có phụ đề?"
                    },
                    {
                        "en": "This programme will be broadcast with subtitles for the hard of hearing.",
                        "vi": "Chương trình này sẽ được phát sóng với phụ đề dành cho người khiếm thính."
                    }
                ]
            },
            {
                "define": {
                    "en": "a second title of a book that appears after the main title and gives more information",
                    "vi": "tiêu đề thứ hai của sách xuất hiện sau tiêu đề chính và cung cấp thêm thông tin"
                },
                "examples": [
                    {
                        "en": "This book’s title is ‘Oxford Learner’s Thesaurus’. Its subtitle is ‘A dictionary of synonyms’.",
                        "vi": "Tên cuốn sách này là 'Từ đồng nghĩa của Người học Oxford'. Phụ đề của nó là 'Từ điển các từ đồng nghĩa'."
                    }
                ]
            }
        ]
    },
    {
        "id": "658a6fdc5f7b4649a3c1d674c8bec837",
        "word": "appendix",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈpendɪks/",
            "us": "/əˈpendɪks/"
        },
        "nearby": [
            {
                "word": "appendectomy",
                "pos": "noun"
            },
            {
                "word": "appendicitis",
                "pos": "noun"
            },
            {
                "word": "appendix",
                "pos": "noun"
            },
            {
                "word": "appertain",
                "pos": "verb"
            },
            {
                "word": "appertain to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small bag of tissue that is attached to the large intestine. In humans, the appendix has no clear function.",
                    "vi": "một túi mô nhỏ được gắn vào ruột già. Ở người, ruột thừa không có chức năng rõ ràng."
                },
                "examples": [
                    {
                        "en": "He had to have his appendix out (= removed).",
                        "vi": "Anh ta phải mổ ruột thừa (= bị cắt bỏ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section giving extra information at the end of a book or document",
                    "vi": "một phần cung cấp thông tin bổ sung ở cuối sách hoặc tài liệu"
                },
                "examples": [
                    {
                        "en": "Full details are given in Appendix 3.",
                        "vi": "Chi tiết đầy đủ được nêu trong Phụ lục 3."
                    }
                ]
            }
        ]
    },
    {
        "id": "eba34ea1567d4165bea902226d3131ab",
        "word": "footnote",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfʊtnəʊt/",
            "us": "/ˈfʊtnəʊt/"
        },
        "nearby": [
            {
                "word": "footloose",
                "pos": "adjective"
            },
            {
                "word": "footman",
                "pos": "noun"
            },
            {
                "word": "footnote",
                "pos": "noun"
            },
            {
                "word": "foot overbridge",
                "pos": "noun"
            },
            {
                "word": "footpath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra piece of information that is given at the bottom of a page, below the main text",
                    "vi": "một phần thông tin bổ sung được cung cấp ở cuối trang, bên dưới văn bản chính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or person that may be remembered but only as something/somebody that is not important",
                    "vi": "một sự kiện hoặc một người có thể được ghi nhớ nhưng chỉ là một cái gì đó / ai đó không quan trọng"
                },
                "examples": [
                    {
                        "en": "The incident seems destined to become a mere footnote in history.",
                        "vi": "Sự việc dường như đã được định sẵn để trở thành một chú thích đơn thuần trong lịch sử."
                    }
                ]
            }
        ]
    },
    {
        "id": "643e1c41bfb84904819fa164e4fe5c39",
        "word": "jacket",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒækɪt/",
            "us": "/ˈdʒækɪt/"
        },
        "nearby": [
            {
                "word": "jackdaw",
                "pos": "noun"
            },
            {
                "word": "jacked",
                "pos": "adjective"
            },
            {
                "word": "jacket",
                "pos": "noun"
            },
            {
                "word": "jacket potato",
                "pos": "noun"
            },
            {
                "word": "Jack Frost",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of clothing worn on the top half of the body over a shirt, etc. that has arms and fastens down the front; a short, light coat",
                    "vi": "một bộ quần áo ở nửa trên của cơ thể bên ngoài áo sơ mi, v.v ... có tay và buộc xuống phía trước; một chiếc áo khoác ngắn, nhẹ"
                },
                "examples": [
                    {
                        "en": "a leather/denim/tweed jacket",
                        "vi": "áo khoác da / denim / tweed"
                    },
                    {
                        "en": "I have to wear a jacket and tie to work.",
                        "vi": "Tôi phải mặc áo khoác và thắt cà vạt để đi làm."
                    },
                    {
                        "en": "in a jacket a man in a black jacket and grey trousers",
                        "vi": "trong một chiếc áo khoác, một người đàn ông mặc áo khoác đen và quần tây màu xám"
                    }
                ]
            },
            {
                "define": {
                    "en": "a loose paper cover for a book, usually with a design or picture on it",
                    "vi": "bìa giấy rời cho một cuốn sách, thường có thiết kế hoặc hình ảnh trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an outer cover around a hot water pipe, etc., for example to reduce loss of heat",
                    "vi": "một vỏ bọc bên ngoài xung quanh một đường ống nước nóng, v.v., chẳng hạn như để giảm sự thất thoát nhiệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the skin of a baked potato",
                    "vi": "vỏ khoai tây nướng"
                },
                "examples": [
                    {
                        "en": "potatoes baked in their jackets",
                        "vi": "khoai tây nướng trong áo khoác của họ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a stiff paper or thick card cover for a record",
                    "vi": "giấy cứng hoặc bìa thẻ dày để ghi hồ sơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1255fc0cb0bf4455ba2bd2466398cc5d",
        "word": "leaf",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/liːf/",
            "us": "/liːf/"
        },
        "nearby": [
            {
                "word": "lead up to",
                "pos": "phrasal verb"
            },
            {
                "word": "lead with",
                "pos": "phrasal verb"
            },
            {
                "word": "leaf",
                "pos": "noun"
            },
            {
                "word": "leaf",
                "pos": "verb"
            },
            {
                "word": "leafless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat green part of a plant, growing from a stem or branch or from the root",
                    "vi": "một phần xanh phẳng của cây, mọc từ thân hoặc cành hoặc từ gốc"
                },
                "examples": [
                    {
                        "en": "lettuce/cabbage/oak leaves",
                        "vi": "rau diếp / bắp cải / lá sồi"
                    },
                    {
                        "en": "the dead leaves of autumn/the fall",
                        "vi": "lá tàn của mùa thu / mùa thu"
                    },
                    {
                        "en": "The leaves on the trees were beginning to turn from green to orange.",
                        "vi": "Những chiếc lá trên cây bắt đầu chuyển từ xanh sang cam."
                    },
                    {
                        "en": "in leaf Few trees are in leaf yet.",
                        "vi": "trong lá Rất ít cây còn trong lá."
                    },
                    {
                        "en": "The trees are just coming into leaf.",
                        "vi": "Cây cối vừa ra lá."
                    }
                ]
            },
            {
                "define": {
                    "en": "having leaves of the type or number mentioned",
                    "vi": "có lá thuộc loại hoặc số được đề cập"
                },
                "examples": [
                    {
                        "en": "a four-leaf clover",
                        "vi": "một cây cỏ bốn lá"
                    },
                    {
                        "en": "a broad-leaved plant",
                        "vi": "cây lá rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sheet of paper, especially a page in a book",
                    "vi": "một tờ giấy, đặc biệt là một trang trong sách"
                },
                "examples": [
                    {
                        "en": "She carefully turned the leaves of the precious volume.",
                        "vi": "Cô cẩn thận lật những chiếc lá của tập sách quý giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "metal, especially gold or silver, in the form of very thin sheets",
                    "vi": "kim loại, đặc biệt là vàng hoặc bạc, ở dạng tấm rất mỏng"
                },
                "examples": [
                    {
                        "en": "gold leaf",
                        "vi": "lá vàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a table that can be lifted up, or an extra section that can be added into the table, in order to make the table bigger",
                    "vi": "một phần của bàn có thể được nâng lên hoặc một phần phụ có thể được thêm vào bàn, để làm cho bàn lớn hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to copy somebody’s behaviour and do things in the same way that they do, because they are successful",
                    "vi": "sao chép hành vi của ai đó và làm mọi việc theo cách giống như cách họ làm, bởi vì họ đã thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your way of life to become a better, more responsible person",
                    "vi": "thay đổi cách sống của bạn để trở thành một người tốt hơn, có trách nhiệm hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "58c53824551b45cea7cd37862284b92b",
        "word": "title page",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtaɪtl peɪdʒ/",
            "us": "/ˈtaɪtl peɪdʒ/"
        },
        "nearby": [
            {
                "word": "title deed",
                "pos": "noun"
            },
            {
                "word": "title-holder",
                "pos": "noun"
            },
            {
                "word": "title page",
                "pos": "noun"
            },
            {
                "word": "titlist",
                "pos": "noun"
            },
            {
                "word": "titmouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a page at the front of a book that has the title and the author’s name on it",
                    "vi": "một trang ở đầu sách có tiêu đề và tên tác giả trên đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eba59f99bf3a4f9696277aa2c903f7fe",
        "word": "addendum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈdendəm/",
            "us": "/əˈdendəm/"
        },
        "nearby": [
            {
                "word": "Jane Addams",
                "pos": ""
            },
            {
                "word": "the Addams Family",
                "pos": ""
            },
            {
                "word": "addendum",
                "pos": "noun"
            },
            {
                "word": "adder",
                "pos": "noun"
            },
            {
                "word": "addict",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a section of extra information that is added to something, especially to a book",
                    "vi": "một phần thông tin bổ sung được thêm vào một cái gì đó, đặc biệt là một cuốn sách"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e75bcbe0ef1248c18059939869488bb8",
        "word": "afterword",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːftəwɜːd/",
            "us": "/ˈæftərwɜːrd/"
        },
        "nearby": [
            {
                "word": "afterthought",
                "pos": "noun"
            },
            {
                "word": "afterwards",
                "pos": "adverb"
            },
            {
                "word": "afterword",
                "pos": "noun"
            },
            {
                "word": "ag",
                "pos": "exclamation"
            },
            {
                "word": "Aga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a section at the end of a book that says something about the main text, and may be written by a different author",
                    "vi": "một phần ở cuối sách nói điều gì đó về văn bản chính và có thể được viết bởi một tác giả khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "17f97dc9b6504f4fae0d21ae1acbea74",
        "word": "binding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪndɪŋ/",
            "us": "/ˈbaɪndɪŋ/"
        },
        "nearby": [
            {
                "word": "bindi",
                "pos": "noun"
            },
            {
                "word": "binding",
                "pos": "adjective"
            },
            {
                "word": "binding",
                "pos": "noun"
            },
            {
                "word": "binding theory",
                "pos": "noun"
            },
            {
                "word": "bind over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the cover that holds the pages of a book together",
                    "vi": "bìa giữ các trang sách lại với nhau"
                },
                "examples": [
                    {
                        "en": "rare books in leather bindings",
                        "vi": "sách hiếm đóng bìa da"
                    }
                ]
            },
            {
                "define": {
                    "en": "cloth that is fastened to the edge of something to protect or decorate it",
                    "vi": "vải được buộc chặt vào mép của thứ gì đó để bảo vệ hoặc trang trí nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a device on a ski that holds the heel and toe of your boot in place and releases the boot if you fall",
                    "vi": "một thiết bị trên đồ trượt tuyết giữ gót và mũi giày của bạn ở đúng vị trí và nhả giày ra nếu bạn bị ngã"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e3418d0745424592aac52f904b7ae3cc",
        "word": "blurb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/blɜːb/",
            "us": "/blɜːrb/"
        },
        "nearby": [
            {
                "word": "Blu-ray",
                "pos": "noun"
            },
            {
                "word": "Blu-ray Disc",
                "pos": "noun"
            },
            {
                "word": "blurb",
                "pos": "noun"
            },
            {
                "word": "blurred",
                "pos": "adjective"
            },
            {
                "word": "blurry",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short description of a book, a new product, etc., written by the people who have produced it, that is intended to attract your attention and make you want to buy it",
                    "vi": "một mô tả ngắn về một cuốn sách, một sản phẩm mới, v.v., được viết bởi những người đã sản xuất nó, nhằm thu hút sự chú ý của bạn và khiến bạn muốn mua nó"
                },
                "examples": [
                    {
                        "en": "publisher’s blurbs",
                        "vi": "lời giới thiệu của nhà xuất bản"
                    },
                    {
                        "en": "The blurb says that this is Tarantino’s greatest movie.",
                        "vi": "Tin đồn nói rằng đây là bộ phim hay nhất của Tarantino."
                    }
                ]
            }
        ]
    },
    {
        "id": "a757544806a94c9ca66fa65d91dfaa05",
        "word": "epigraph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈepɪɡrɑːf/",
            "us": "/ˈepɪɡræf/"
        },
        "nearby": [
            {
                "word": "epigram",
                "pos": "noun"
            },
            {
                "word": "epigrammatic",
                "pos": "adjective"
            },
            {
                "word": "epigraph",
                "pos": "noun"
            },
            {
                "word": "epilation",
                "pos": "noun"
            },
            {
                "word": "epilepsy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line of writing, short phrase, etc. on a building or statue, or as an introduction to part of a book",
                    "vi": "một dòng viết, cụm từ ngắn, v.v. trên một tòa nhà hoặc bức tượng, hoặc như một lời giới thiệu cho một phần của cuốn sách"
                },
                "examples": [
                    {
                        "en": "The epigraph to the chapter read: ‘One man’s freedom is another man’s slavery’.",
                        "vi": "Lời kết của chương viết: 'Tự do của một người là nô lệ của người khác'."
                    }
                ]
            }
        ]
    },
    {
        "id": "0736a28388f6448091a8c14a6ce5b475",
        "word": "epilogue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈepɪlɒɡ/",
            "us": "/ˈepɪlɔːɡ/"
        },
        "nearby": [
            {
                "word": "epileptic",
                "pos": "noun"
            },
            {
                "word": "epileptic",
                "pos": "adjective"
            },
            {
                "word": "epilogue",
                "pos": "noun"
            },
            {
                "word": "epinephrine",
                "pos": "noun"
            },
            {
                "word": "EpiPen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a speech, etc. at the end of a play, book, or film that comments on or acts as a conclusion to what has happened",
                    "vi": "một bài phát biểu, v.v. ở cuối vở kịch, cuốn sách hoặc bộ phim nhận xét hoặc đóng vai trò như một kết luận cho những gì đã xảy ra"
                },
                "examples": [
                    {
                        "en": "Fortinbras speaks the epilogue in Shakespeare’s ‘Hamlet’.",
                        "vi": "Fortinbras nói phần kết trong 'Hamlet' của Shakespeare."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea95d363fa784441a1a2fbca0c24a5dd",
        "word": "erratum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/eˈrɑːtəm/",
            "us": "/eˈrɑːtəm/"
        },
        "nearby": [
            {
                "word": "erratic",
                "pos": "noun"
            },
            {
                "word": "erratically",
                "pos": "adverb"
            },
            {
                "word": "erratum",
                "pos": "noun"
            },
            {
                "word": "erroneous",
                "pos": "adjective"
            },
            {
                "word": "erroneously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mistake in printing or writing (printed in a list or posted in a list on a website)",
                    "vi": "sai sót trong việc in ấn hoặc viết (in trong danh sách hoặc đăng trong danh sách trên một trang web)"
                },
                "examples": [
                    {
                        "en": "A list of errata was printed at the back of the book.",
                        "vi": "Một danh sách các errata được in ở cuối cuốn sách."
                    },
                    {
                        "en": "They are posting confirmed errata on their website.",
                        "vi": "Họ đang đăng errata đã được xác nhận trên trang web của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4823254823549f8b0b82eef173606be",
        "word": "folio",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊliəʊ/",
            "us": "/ˈfəʊliəʊ/"
        },
        "nearby": [
            {
                "word": "foliar feed",
                "pos": "noun"
            },
            {
                "word": "folic acid",
                "pos": "noun"
            },
            {
                "word": "folio",
                "pos": "noun"
            },
            {
                "word": "folk",
                "pos": "noun"
            },
            {
                "word": "folk",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book made with large sheets of paper, especially as used in early printing",
                    "vi": "một cuốn sách được làm bằng các tờ giấy lớn, đặc biệt là được sử dụng trong quá trình in sớm"
                },
                "examples": [
                    {
                        "en": "a folio edition",
                        "vi": "một phiên bản folio"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single sheet of paper from a book",
                    "vi": "một tờ giấy từ một cuốn sách"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f2abccaac164d749fe1d3c840231a1d",
        "word": "foreword",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːwɜːd/",
            "us": "/ˈfɔːrwɜːrd/"
        },
        "nearby": [
            {
                "word": "forewarning",
                "pos": "noun"
            },
            {
                "word": "forewoman",
                "pos": "noun"
            },
            {
                "word": "foreword",
                "pos": "noun"
            },
            {
                "word": "forfeit",
                "pos": "verb"
            },
            {
                "word": "forfeit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short introduction at the beginning of a book, usually by a person other than the author",
                    "vi": "phần giới thiệu ngắn ở đầu sách, thường là của một người không phải là tác giả"
                },
                "examples": [
                    {
                        "en": "He was asked if he would consider writing a foreword for her book.",
                        "vi": "Anh được hỏi liệu anh có cân nhắc viết lời tựa cho cuốn sách của cô không."
                    }
                ]
            }
        ]
    },
    {
        "id": "8757f7c5c7ce4f25acccf752726c6e97",
        "word": "frontispiece",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfrʌntɪspiːs/",
            "us": "/ˈfrʌntɪspiːs/"
        },
        "nearby": [
            {
                "word": "frontier",
                "pos": "noun"
            },
            {
                "word": "frontiersman",
                "pos": "noun"
            },
            {
                "word": "frontispiece",
                "pos": "noun"
            },
            {
                "word": "frontline",
                "pos": "adjective"
            },
            {
                "word": "the front line",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a picture at the beginning of a book, on the page opposite the page with the title on it",
                    "vi": "một bức tranh ở đầu sách, trên trang đối diện với trang có tiêu đề trên đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b5d856e2a41c4f53b59b032031708ee3",
        "word": "gatefold",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡeɪtfəʊld/",
            "us": "/ˈɡeɪtfəʊld/"
        },
        "nearby": [
            {
                "word": "gated",
                "pos": "adjective"
            },
            {
                "word": "gated community",
                "pos": "noun"
            },
            {
                "word": "gatefold",
                "pos": "noun"
            },
            {
                "word": "gatehouse",
                "pos": "noun"
            },
            {
                "word": "gatekeeper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large page folded to fit a book or magazine that can be opened out for reading",
                    "vi": "một trang lớn được gấp lại để vừa với một cuốn sách hoặc tạp chí có thể mở ra để đọc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fe52cb5c8cef440a80fc7d93d6788e4a",
        "word": "inscription",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈskrɪpʃn/",
            "us": "/ɪnˈskrɪpʃn/"
        },
        "nearby": [
            {
                "word": "inscape",
                "pos": "noun"
            },
            {
                "word": "inscribe",
                "pos": "verb"
            },
            {
                "word": "inscription",
                "pos": "noun"
            },
            {
                "word": "inscrutability",
                "pos": "noun"
            },
            {
                "word": "inscrutable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words written in the front of a book or cut in stone or metal",
                    "vi": "những dòng chữ được viết ở mặt trước của một cuốn sách hoặc được cắt bằng đá hoặc kim loại"
                },
                "examples": [
                    {
                        "en": "There was an inscription carved over the doorway.",
                        "vi": "Có một dòng chữ được khắc trên ngưỡng cửa."
                    },
                    {
                        "en": "There are no inscriptions or markings to identify the tombs.",
                        "vi": "Không có chữ khắc hoặc dấu hiệu để xác định các ngôi mộ."
                    }
                ]
            }
        ]
    },
    {
        "id": "13375219bd6e4981b075382dee8f2366",
        "word": "miscellanea",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪsəˈleɪniə/",
            "us": "/ˌmɪsəˈleɪniə/"
        },
        "nearby": [
            {
                "word": "miscast",
                "pos": "verb"
            },
            {
                "word": "miscegenation",
                "pos": "noun"
            },
            {
                "word": "miscellanea",
                "pos": "noun"
            },
            {
                "word": "miscellaneous",
                "pos": "adjective"
            },
            {
                "word": "miscellany",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "various things that have been collected together, especially pieces of literature, poems, letters, etc.",
                    "vi": "nhiều thứ khác nhau đã được thu thập cùng nhau, đặc biệt là các phần văn học, bài thơ, bức thư, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5235d4fb0531451e9539a9165e2381dc",
        "word": "plot hole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplɒt həʊl/",
            "us": "/ˈplɑːt həʊl/"
        },
        "nearby": [
            {
                "word": "plot",
                "pos": "noun"
            },
            {
                "word": "plot",
                "pos": "verb"
            },
            {
                "word": "plot hole",
                "pos": "noun"
            },
            {
                "word": "plotter",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an element in the story in a book, film, etc. that does not fit with other parts of the story",
                    "vi": "một yếu tố trong câu chuyện trong sách, phim, v.v. không phù hợp với các phần khác của câu chuyện"
                },
                "examples": [
                    {
                        "en": "The film is full of thin justifications and obvious plot holes.",
                        "vi": "Bộ phim đầy rẫy những lời biện minh mỏng manh và những lỗ hổng cốt truyện rõ ràng."
                    }
                ]
            }
        ]
    },
    {
        "id": "62bec9d870d942f6b50c433ddbec3881",
        "word": "preamble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpriːæmbl/",
            "us": "/ˈpriːæmbl/"
        },
        "nearby": [
            {
                "word": "preacher",
                "pos": "noun"
            },
            {
                "word": "preachy",
                "pos": "adjective"
            },
            {
                "word": "preamble",
                "pos": "noun"
            },
            {
                "word": "prearranged",
                "pos": "adjective"
            },
            {
                "word": "pre-book",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an introduction to a book or a written document; an introduction to something you say",
                    "vi": "phần giới thiệu về một cuốn sách hoặc một tài liệu viết; giới thiệu về điều gì đó bạn nói"
                },
                "examples": [
                    {
                        "en": "in a preamble The aims of the treaty are stated in its preamble.",
                        "vi": "trong phần mở đầu Các mục tiêu của hiệp ước được nêu trong phần mở đầu của nó."
                    },
                    {
                        "en": "preamble to something the Preamble to the US Constitution",
                        "vi": "mở đầu cho điều gì đó Lời mở đầu cho Hiến pháp Hoa Kỳ"
                    },
                    {
                        "en": "without preamble She gave him the bad news without preamble.",
                        "vi": "không có lời mở đầu Cô ấy đã cho anh ta một tin xấu mà không có lời mở đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "0dd66871ad314a588a55ff9a4534c2b4",
        "word": "preface",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprefəs/",
            "us": "/ˈprefəs/"
        },
        "nearby": [
            {
                "word": "prefabricated",
                "pos": "adjective"
            },
            {
                "word": "prefabrication",
                "pos": "noun"
            },
            {
                "word": "preface",
                "pos": "noun"
            },
            {
                "word": "preface",
                "pos": "verb"
            },
            {
                "word": "prefatory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an introduction to a book, especially one that explains the author’s aims",
                    "vi": "phần giới thiệu về một cuốn sách, đặc biệt là phần giải thích mục đích của tác giả"
                },
                "examples": [
                    {
                        "en": "preface to something I read it in the preface to her new book.",
                        "vi": "lời nói đầu cho một cái gì đó tôi đã đọc nó trong lời nói đầu cho cuốn sách mới của cô ấy."
                    },
                    {
                        "en": "in a preface In his preface he claimed that he had created a new kind of music.",
                        "vi": "trong lời nói đầu Trong lời nói đầu của mình, anh ấy tuyên bố rằng anh ấy đã tạo ra một thể loại âm nhạc mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "73b02b9b33d44d12b09ec7cd017927d9",
        "word": "spine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/spaɪn/",
            "us": "/spaɪn/"
        },
        "nearby": [
            {
                "word": "spin-dry",
                "pos": "verb"
            },
            {
                "word": "spin dryer",
                "pos": "noun"
            },
            {
                "word": "spine",
                "pos": "noun"
            },
            {
                "word": "spine-chiller",
                "pos": "noun"
            },
            {
                "word": "spine-chilling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the row of small bones that are connected together down the middle of the back",
                    "vi": "hàng xương nhỏ được kết nối với nhau ở giữa lưng"
                },
                "examples": [
                    {
                        "en": "A shiver went down my spine.",
                        "vi": "Một cơn rùng mình dọc sống lưng tôi."
                    },
                    {
                        "en": "the nerves in the spine",
                        "vi": "các dây thần kinh ở cột sống"
                    }
                ]
            },
            {
                "define": {
                    "en": "the central feature of something or the main source of its strength",
                    "vi": "đặc điểm trung tâm của thứ gì đó hoặc nguồn sức mạnh chính của nó"
                },
                "examples": [
                    {
                        "en": "These speeches form the spine of his election campaign.",
                        "vi": "Những bài phát biểu này tạo thành xương sống của chiến dịch tranh cử của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "strength of character",
                    "vi": "sức mạnh của cá tính"
                },
                "examples": [
                    {
                        "en": "Their protests stiffened the spines of party activists.",
                        "vi": "Các cuộc biểu tình của họ đã làm cứng mũi các nhà hoạt động đảng."
                    },
                    {
                        "en": "The legislature must grow a spine and demand these changes.",
                        "vi": "Cơ quan lập pháp phải mọc gai và yêu cầu những thay đổi này."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the sharp, pointed parts like needles on some plants and animals",
                    "vi": "bất kỳ bộ phận sắc nhọn nào như kim trên một số loài thực vật và động vật"
                },
                "examples": [
                    {
                        "en": "Porcupines use their spines to protect themselves.",
                        "vi": "Nhím dùng gai để bảo vệ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the narrow part of the cover of a book that the pages are joined to",
                    "vi": "phần hẹp của bìa sách mà các trang được nối với nhau"
                },
                "examples": []
            }
        ]
    }
]