[
    {
        "id": "d3af9e535c324e1b912eace81b46c460",
        "word": "computer game",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/kəmˈpjuːtə ɡeɪm/",
            "us": "/kəmˈpjuːtər ɡeɪm/"
        },
        "nearby": [
            {
                "word": "compute",
                "pos": "verb"
            },
            {
                "word": "computer",
                "pos": "noun"
            },
            {
                "word": "computer game",
                "pos": "noun"
            },
            {
                "word": "computer-generated",
                "pos": "adjective"
            },
            {
                "word": "computerization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game played on a computer",
                    "vi": "một trò chơi được chơi trên máy tính"
                },
                "examples": [
                    {
                        "en": "She hopes to get a job designing computer games.",
                        "vi": "Cô ấy hy vọng sẽ có được một công việc thiết kế trò chơi máy tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f6f05a31e624665ae0c0458fac48ba5",
        "word": "video game",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈvɪdiəʊ ɡeɪm/",
            "us": "/ˈvɪdiəʊ ɡeɪm/"
        },
        "nearby": [
            {
                "word": "video diary",
                "pos": "noun"
            },
            {
                "word": "videodisc",
                "pos": "noun"
            },
            {
                "word": "video game",
                "pos": "noun"
            },
            {
                "word": "videograph",
                "pos": "verb"
            },
            {
                "word": "video jockey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which you press buttons to control and move images on a screen",
                    "vi": "một trò chơi trong đó bạn nhấn các nút để điều khiển và di chuyển hình ảnh trên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf0e1b61f0fe44c19c52a3a2c6578835",
        "word": "level",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈlevl/",
            "us": "/ˈlevl/"
        },
        "nearby": [
            {
                "word": "leukaemia",
                "pos": "noun"
            },
            {
                "word": "levee",
                "pos": "noun"
            },
            {
                "word": "level",
                "pos": "noun"
            },
            {
                "word": "level",
                "pos": "adjective"
            },
            {
                "word": "level",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the height of something in relation to the ground or to what it used to be",
                    "vi": "chiều cao của một cái gì đó so với mặt đất hoặc so với những gì nó từng là"
                },
                "examples": [
                    {
                        "en": "The cables are buried one metre below ground level.",
                        "vi": "Các dây cáp được chôn dưới mặt đất một mét."
                    },
                    {
                        "en": "The floodwater nearly reached roof level.",
                        "vi": "Nước lũ gần ngập mái nhà."
                    },
                    {
                        "en": "The river has fallen to its lowest level since 2012.",
                        "vi": "Con sông đã giảm xuống mức thấp nhất kể từ năm 2012."
                    },
                    {
                        "en": "the level rose/dropped/decreased/increased",
                        "vi": "mức độ tăng / giảm / giảm / tăng"
                    },
                    {
                        "en": "on a level with something On the second floor you are on a level with (= at the same height as) the treetops.",
                        "vi": "trên tầng với thứ gì đó Trên tầng hai, bạn ở trên tầng với (= ở cùng độ cao với) ngọn cây."
                    },
                    {
                        "en": "on a level The tables are not on a level (= the same height).",
                        "vi": "trên một mức Các bảng không nằm trên một mức (= cùng một chiều cao)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a floor of a building; a layer of ground",
                    "vi": "một tầng của một tòa nhà; một lớp đất"
                },
                "examples": [
                    {
                        "en": "a multi-level parking lot",
                        "vi": "bãi đậu xe nhiều tầng"
                    },
                    {
                        "en": "Take the elevator to Level Four.",
                        "vi": "Đi thang máy lên Tầng 4."
                    },
                    {
                        "en": "on a level The restaurant is on the level below this one.",
                        "vi": "trên một cấp độ Nhà hàng ở cấp độ thấp hơn một cấp độ này."
                    },
                    {
                        "en": "The library is all on one level.",
                        "vi": "Thư viện là tất cả trên một cấp độ."
                    },
                    {
                        "en": "Archaeologists found pottery in the lowest level of the site.",
                        "vi": "Các nhà khảo cổ tìm thấy đồ gốm ở tầng thấp nhất của di chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of something that exists in a particular situation at a particular time",
                    "vi": "số lượng thứ gì đó tồn tại trong một tình huống cụ thể tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "a low level of support for the proposed changes",
                        "vi": "mức hỗ trợ thấp cho những thay đổi được đề xuất"
                    },
                    {
                        "en": "Increase your level of activity to burn more calories.",
                        "vi": "Tăng mức độ hoạt động của bạn để đốt cháy nhiều calo hơn."
                    },
                    {
                        "en": "to raise/reduce the level of something",
                        "vi": "để nâng cao / giảm mức độ của một cái gì đó"
                    },
                    {
                        "en": "They have achieved higher levels of efficiency.",
                        "vi": "Họ đã đạt được mức hiệu quả cao hơn."
                    },
                    {
                        "en": "A change of course may be needed if the current level of violence continues.",
                        "vi": "Tất nhiên có thể cần thay đổi nếu mức độ bạo lực hiện tại vẫn tiếp tục."
                    },
                    {
                        "en": "low/high/elevated blood cholesterol levels",
                        "vi": "mức cholesterol trong máu thấp / cao / cao"
                    },
                    {
                        "en": "a reduction/a rise/a decrease/an increase/a change in energy levels",
                        "vi": "giảm / tăng / giảm / tăng / thay đổi mức năng lượng"
                    },
                    {
                        "en": "at a/the… level Profits were at the same level as the year before.",
                        "vi": "ở mức a / mức… Lợi nhuận ở mức tương tự như năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular standard or quality",
                    "vi": "một tiêu chuẩn hoặc chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "The hotel's level of service is consistently high.",
                        "vi": "Mức độ dịch vụ của khách sạn luôn ở mức cao."
                    },
                    {
                        "en": "The participants had different levels of education.",
                        "vi": "Những người tham gia có trình độ học vấn khác nhau."
                    },
                    {
                        "en": "He studied French to degree level.",
                        "vi": "Anh ấy học tiếng Pháp để lấy bằng cấp."
                    },
                    {
                        "en": "What is the level of this course?",
                        "vi": "Cấp độ của khóa học này là gì?"
                    },
                    {
                        "en": "It is difficult to maintain this level of performance.",
                        "vi": "Rất khó để duy trì phong độ này."
                    },
                    {
                        "en": "at a… level She has played tennis at a high level.",
                        "vi": "ở cấp độ… Cô ấy đã chơi quần vợt ở trình độ cao."
                    },
                    {
                        "en": "on a level Both players are on a level (= of the same standard).",
                        "vi": "trên một cấp độ Cả hai người chơi đều ở cùng một cấp độ (= cùng tiêu chuẩn)."
                    },
                    {
                        "en": "I refuse to sink to their level (= behave as badly as them).",
                        "vi": "Tôi từ chối chìm xuống cấp độ của họ (= cư xử tồi tệ như họ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position or rank in a scale of size or importance",
                    "vi": "một vị trí hoặc thứ hạng trong thang quy mô hoặc tầm quan trọng"
                },
                "examples": [
                    {
                        "en": "the upper levels of government",
                        "vi": "các cấp trên của chính phủ"
                    },
                    {
                        "en": "at (a) … level Discussions are currently being held at national level.",
                        "vi": "ở (a)… cấp Các cuộc thảo luận hiện đang được tổ chức ở cấp quốc gia."
                    },
                    {
                        "en": "at local/international level",
                        "vi": "ở cấp địa phương / quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of looking at, reacting to or understanding something",
                    "vi": "một cách cụ thể để xem xét, phản ứng hoặc hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "on a… level On a more personal level, I would like to thank Jean for all the help she has given me.",
                        "vi": "ở mức độ… Ở mức độ cá nhân hơn, tôi muốn cảm ơn Jean vì tất cả sự giúp đỡ mà cô ấy đã dành cho tôi."
                    },
                    {
                        "en": "Fables can be understood on various levels.",
                        "vi": "Truyện ngụ ngôn có thể được hiểu theo nhiều cấp độ khác nhau."
                    },
                    {
                        "en": "at a… level At a conscious level, I was quite satisfied with my life.",
                        "vi": "ở mức độ… Ở mức độ ý thức, tôi khá hài lòng với cuộc sống của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a series of stages in a computer game. Players progress from easy to more advanced levels within the game.",
                    "vi": "một trong một loạt các giai đoạn trong trò chơi trên máy tính. Người chơi tiến bộ từ cấp độ dễ đến cấp độ cao hơn trong trò chơi."
                },
                "examples": [
                    {
                        "en": "a computer game with 15 levels",
                        "vi": "một trò chơi máy tính có 15 cấp độ"
                    },
                    {
                        "en": "Players advance to the next level by collecting all the pieces and constructing the spaceship.",
                        "vi": "Người chơi tiến tới cấp độ tiếp theo bằng cách thu thập tất cả các mảnh và xây dựng tàu vũ trụ."
                    },
                    {
                        "en": "Each level is randomly generated so each game is different.",
                        "vi": "Mỗi cấp độ được tạo ngẫu nhiên nên mỗi trận đấu là khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device used to test whether a surface is level, consisting of a glass tube partly filled with liquid with a bubble of air inside. The position of the bubble indicates whether the surface is level.",
                    "vi": "một thiết bị dùng để kiểm tra xem bề mặt có bằng phẳng hay không, bao gồm một ống thủy tinh chứa một phần chất lỏng với bọt khí bên trong. Vị trí của bong bóng cho biết bề mặt có bằng phẳng hay không."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "honest; legal",
                    "vi": "Trung thực; hợp pháp"
                },
                "examples": [
                    {
                        "en": "I'm not convinced he's on the level.",
                        "vi": "Tôi không tin anh ấy ở đẳng cấp."
                    },
                    {
                        "en": "Are you sure this deal is on the level?",
                        "vi": "Bạn có chắc chắn thỏa thuận này là ở cấp độ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "as good, bad, important, etc. as somebody/something else",
                    "vi": "tốt, xấu, quan trọng, v.v. như ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "This place is on a level with the best French restaurants.",
                        "vi": "Nơi này là một đẳng cấp với các nhà hàng Pháp tốt nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "as good, bad, important, etc. as somebody/something else",
                    "vi": "tốt, xấu, quan trọng, v.v. như ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "This place is on a par with the best French restaurants.",
                        "vi": "Nơi này được xếp ngang hàng với những nhà hàng tốt nhất của Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to further improve or develop something that is already successful",
                    "vi": "để cải thiện hơn nữa hoặc phát triển một cái gì đó đã thành công"
                },
                "examples": [
                    {
                        "en": "He decided to move to New York to take his career to the next level.",
                        "vi": "Anh quyết định chuyển đến New York để đưa sự nghiệp của mình lên một tầm cao mới."
                    },
                    {
                        "en": "We are taking web design to the next level.",
                        "vi": "Chúng tôi đang đưa thiết kế web lên một tầm cao mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "9bb0a07a43a248fabcf87b8a59ec47ea",
        "word": "adventure game",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ədˈventʃə ɡeɪm/",
            "us": "/ədˈventʃər ɡeɪm/"
        },
        "nearby": [
            {
                "word": "Advent Sunday",
                "pos": "noun"
            },
            {
                "word": "adventure",
                "pos": "noun"
            },
            {
                "word": "adventure game",
                "pos": "noun"
            },
            {
                "word": "adventure playground",
                "pos": "noun"
            },
            {
                "word": "adventurer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of computer game in which you play a part in an adventure",
                    "vi": "một loại trò chơi máy tính mà bạn tham gia vào một cuộc phiêu lưu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b9e1ef2a2fe94b5c8975d640a747cde9",
        "word": "avatar",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈævətɑː(r)/",
            "us": "/ˈævətɑːr/"
        },
        "nearby": [
            {
                "word": "avaricious",
                "pos": "adjective"
            },
            {
                "word": "avast",
                "pos": "exclamation"
            },
            {
                "word": "avatar",
                "pos": "noun"
            },
            {
                "word": "Ave.",
                "pos": "abbreviation"
            },
            {
                "word": "Avebury",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in Hinduism and Buddhism) a god appearing in a physical form",
                    "vi": "(trong Ấn Độ giáo và Phật giáo) một vị thần xuất hiện ở dạng vật chất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a picture of a person or an animal that represents a particular computer user, on a computer screen, especially in a computer game or on social media",
                    "vi": "hình ảnh của một người hoặc một con vật đại diện cho một người dùng máy tính cụ thể, trên màn hình máy tính, đặc biệt là trong trò chơi máy tính hoặc trên phương tiện truyền thông xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "826a473117734a1a9d19cf0531835662",
        "word": "console",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒnsəʊl/",
            "us": "/ˈkɑːnsəʊl/"
        },
        "nearby": [
            {
                "word": "consolatory",
                "pos": "adjective"
            },
            {
                "word": "console1",
                "pos": "verb"
            },
            {
                "word": "console2",
                "pos": "noun"
            },
            {
                "word": "consolidate",
                "pos": "verb"
            },
            {
                "word": "consolidation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat surface that contains all the controls and switches for a machine, a piece of electronic equipment, etc.",
                    "vi": "một bề mặt phẳng chứa tất cả các bộ điều khiển và công tắc cho máy móc, thiết bị điện tử, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small electronic device for playing video games",
                    "vi": "một thiết bị điện tử nhỏ để chơi trò chơi điện tử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d66a95f795cc4f3c8c891107f028a12d",
        "word": "games console",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡeɪmz kɒnsəʊl/",
            "us": "/ˈɡeɪmz kɑːnsəʊl/"
        },
        "nearby": [
            {
                "word": "gamer",
                "pos": "noun"
            },
            {
                "word": "game reserve",
                "pos": "noun"
            },
            {
                "word": "games console",
                "pos": "noun"
            },
            {
                "word": "game show",
                "pos": "noun"
            },
            {
                "word": "gamesmanship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small electronic device for playing video games",
                    "vi": "một thiết bị điện tử nhỏ để chơi trò chơi điện tử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "278807c888654b7c95a683806c895077",
        "word": "world",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/wɜːld/",
            "us": "/wɜːrld/"
        },
        "nearby": [
            {
                "word": "work up to",
                "pos": "phrasal verb"
            },
            {
                "word": "workweek",
                "pos": "noun"
            },
            {
                "word": "world",
                "pos": "noun"
            },
            {
                "word": "The World Almanac",
                "pos": ""
            },
            {
                "word": "The World at One",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the earth, with all its countries, peoples and natural features",
                    "vi": "trái đất, với tất cả các quốc gia, dân tộc và các đặc điểm tự nhiên"
                },
                "examples": [
                    {
                        "en": "a map of the world",
                        "vi": "bản đồ thế giới"
                    },
                    {
                        "en": "French is spoken in many parts of the world.",
                        "vi": "Tiếng Pháp được nói ở nhiều nơi trên thế giới."
                    },
                    {
                        "en": "in the world Which is the largest city in the world?",
                        "vi": "trên thế giới Thành phố nào là lớn nhất trên thế giới?"
                    },
                    {
                        "en": "around/round the world to sail around the world",
                        "vi": "vòng quanh / vòng quanh thế giới để đi thuyền vòng quanh thế giới"
                    },
                    {
                        "en": "all over the world She has been all over the world.",
                        "vi": "all over the world Cô ấy đã ở khắp nơi trên thế giới."
                    },
                    {
                        "en": "throughout the world Their products are sold throughout the world.",
                        "vi": "trên toàn thế giới Sản phẩm của họ được bán trên khắp thế giới."
                    },
                    {
                        "en": "They travelled the world for pleasure.",
                        "vi": "Họ đã đi khắp thế giới vì niềm vui."
                    },
                    {
                        "en": "He's the world's highest paid entertainer.",
                        "vi": "Anh ấy là nghệ sĩ giải trí được trả lương cao nhất thế giới."
                    },
                    {
                        "en": "a meeting of world leaders",
                        "vi": "một cuộc họp của các nhà lãnh đạo thế giới"
                    },
                    {
                        "en": "campaigning for world peace",
                        "vi": "vận động cho hòa bình thế giới"
                    },
                    {
                        "en": "the world economy",
                        "vi": "kinh tế thế giới"
                    },
                    {
                        "en": "world markets/trade",
                        "vi": "thị trường thế giới / thương mại"
                    },
                    {
                        "en": "the world premiere of the movie",
                        "vi": "buổi ra mắt thế giới của bộ phim"
                    }
                ]
            },
            {
                "define": {
                    "en": "used before another noun to describe one of the most important people or things of their type in the world",
                    "vi": "được sử dụng trước một danh từ khác để mô tả một trong những người hoặc những thứ quan trọng nhất thuộc loại của họ trên thế giới"
                },
                "examples": [
                    {
                        "en": "the world champion/championship/record/title",
                        "vi": "nhà vô địch thế giới / chức vô địch / kỷ lục / danh hiệu"
                    },
                    {
                        "en": "As of October, her world ranking was No.1.",
                        "vi": "Tính đến tháng 10, xếp hạng thế giới của cô ấy là No.1."
                    },
                    {
                        "en": "the major world religions",
                        "vi": "các tôn giáo lớn trên thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular part of the earth; a particular group of countries or people; a particular period of history and the people of that period",
                    "vi": "một phần cụ thể của trái đất; một nhóm quốc gia hoặc người cụ thể; một giai đoạn lịch sử cụ thể và con người của thời kỳ đó"
                },
                "examples": [
                    {
                        "en": "the Arab world",
                        "vi": "thế giới Ả Rập"
                    },
                    {
                        "en": "In the Western world, there is a different attitude to marriage.",
                        "vi": "Ở thế giới phương Tây, có một thái độ khác với hôn nhân."
                    },
                    {
                        "en": "in the … world farmers in the developing world",
                        "vi": "ở… thế giới nông dân ở thế giới đang phát triển"
                    },
                    {
                        "en": "The book has sold 12 million copies in the English-speaking world and has been translated into six languages.",
                        "vi": "Cuốn sách đã bán được 12 triệu bản ở thế giới nói tiếng Anh và đã được dịch ra sáu thứ tiếng."
                    },
                    {
                        "en": "in the modern/ancient world",
                        "vi": "trong thế giới hiện đại / cổ đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the people or things belonging to a particular group or connected with a particular interest, job, etc.",
                    "vi": "những người hoặc những thứ thuộc về một nhóm cụ thể hoặc được kết nối với một mối quan tâm, công việc cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the animal/plant/insect world",
                        "vi": "thế giới động vật / thực vật / côn trùng"
                    },
                    {
                        "en": "the business/corporate world",
                        "vi": "thế giới kinh doanh / doanh nghiệp"
                    },
                    {
                        "en": "She is a popular figure in the art world.",
                        "vi": "Cô ấy là một nhân vật nổi tiếng trong giới nghệ thuật."
                    },
                    {
                        "en": "the world of something the world of politics/business/sport",
                        "vi": "thế giới của cái gì đó thế giới của chính trị / kinh doanh / thể thao"
                    },
                    {
                        "en": "the world of music/art/fashion",
                        "vi": "thế giới âm nhạc / nghệ thuật / thời trang"
                    },
                    {
                        "en": "stars from the sporting and artistic worlds",
                        "vi": "các ngôi sao từ thế giới thể thao và nghệ thuật"
                    }
                ]
            },
            {
                "define": {
                    "en": "everything that exists of a particular kind; a particular kind of life or existence",
                    "vi": "mọi thứ tồn tại của một loại cụ thể; một loại cuộc sống hoặc sự tồn tại cụ thể"
                },
                "examples": [
                    {
                        "en": "the natural world (= animals, plants, minerals, etc.)",
                        "vi": "thế giới tự nhiên (= động vật, thực vật, khoáng chất, v.v.)"
                    },
                    {
                        "en": "the physical/material world",
                        "vi": "thế giới vật chất / vật chất"
                    },
                    {
                        "en": "They are a couple in the real world as well as in the movie.",
                        "vi": "Họ là một cặp ngoài đời cũng như trong phim."
                    },
                    {
                        "en": "The island is a world of brilliant colours and dramatic sunsets.",
                        "vi": "Hòn đảo là một thế giới của màu sắc rực rỡ và cảnh hoàng hôn ấn tượng."
                    },
                    {
                        "en": "They had little contact with the outside world (= people and places that were not part of their normal life).",
                        "vi": "Họ ít tiếp xúc với thế giới bên ngoài (= những người và những nơi không thuộc cuộc sống bình thường của họ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "our society and the way people live and behave; the people in the world",
                    "vi": "xã hội của chúng ta và cách mọi người sống và cư xử; những người trên thế giới"
                },
                "examples": [
                    {
                        "en": "We live in a rapidly changing world.",
                        "vi": "Chúng ta đang sống trong một thế giới thay đổi nhanh chóng."
                    },
                    {
                        "en": "Young people always think they are going to change the world.",
                        "vi": "Những người trẻ luôn nghĩ rằng họ sẽ thay đổi thế giới."
                    },
                    {
                        "en": "It's not your job to save the world.",
                        "vi": "Đó không phải là công việc của bạn để cứu thế giới."
                    },
                    {
                        "en": "He's too young to understand the ways of the world (= how the world works).",
                        "vi": "Anh ấy còn quá nhỏ để hiểu các cách thức của thế giới (= cách thế giới vận hành)."
                    },
                    {
                        "en": "The whole world was waiting for news of the astronauts.",
                        "vi": "Cả thế giới đang chờ đợi tin tức của các phi hành gia."
                    },
                    {
                        "en": "She felt that the world was against her.",
                        "vi": "Cô cảm thấy rằng thế giới đang chống lại cô."
                    },
                    {
                        "en": "The eyes of the world are on the President (= many people around the world are waiting to see what the President will do).",
                        "vi": "Đôi mắt của thế giới đang đổ dồn về Tổng thống (= nhiều người trên thế giới đang chờ xem Tổng thống sẽ làm gì)."
                    },
                    {
                        "en": "News of the incident was slow to reach the wider world.",
                        "vi": "Tin tức về vụ việc chậm được đưa ra thế giới rộng lớn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of life where possessions and physical pleasures are important, rather than spiritual values",
                    "vi": "một lối sống mà của cải và thú vui vật chất là quan trọng, hơn là giá trị tinh thần"
                },
                "examples": [
                    {
                        "en": "monks and nuns renouncing the world",
                        "vi": "Tỳ kheo ni từ bỏ thế gian"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s environment, experiences, friends and family, etc.",
                    "vi": "môi trường, kinh nghiệm, bạn bè và gia đình của một người, v.v."
                },
                "examples": [
                    {
                        "en": "Parents are the most important people in a child's world.",
                        "vi": "Cha mẹ là những người quan trọng nhất trong thế giới của trẻ thơ."
                    },
                    {
                        "en": "When his wife died, his entire world was turned upside down.",
                        "vi": "Khi vợ mất, toàn bộ thế giới của anh bị đảo lộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an environment that is imagined or constructed, for example in a computer game",
                    "vi": "một môi trường được tưởng tượng hoặc xây dựng, chẳng hạn như trong một trò chơi máy tính"
                },
                "examples": [
                    {
                        "en": "Computer games create whole virtual worlds.",
                        "vi": "Trò chơi máy tính tạo ra toàn bộ thế giới ảo."
                    },
                    {
                        "en": "The game comprises four separate worlds, each split into six levels.",
                        "vi": "Trò chơi bao gồm bốn thế giới riêng biệt, mỗi thế giới được chia thành sáu cấp độ."
                    },
                    {
                        "en": "You're living in a fantasy world!",
                        "vi": "Bạn đang sống trong một thế giới tưởng tượng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a planet like the earth",
                    "vi": "một hành tinh giống như trái đất"
                },
                "examples": [
                    {
                        "en": "There may be other worlds out there.",
                        "vi": "Có thể có những thế giới khác ngoài kia."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of human existence",
                    "vi": "tình trạng tồn tại của con người"
                },
                "examples": [
                    {
                        "en": "this world and the next (= life on earth and existence after death)",
                        "vi": "thế giới này và thế giới tiếp theo (= sự sống trên trái đất và sự tồn tại sau khi chết)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be loved by and very important to somebody",
                    "vi": "được yêu mến và rất quan trọng đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be giving all your attention to something so that you do not notice what is happening around you",
                    "vi": "dành tất cả sự chú ý của bạn vào một cái gì đó để bạn không nhận thấy những gì đang xảy ra xung quanh bạn"
                },
                "examples": [
                    {
                        "en": "When he’s listening to music he’s lost to the world.",
                        "vi": "Khi anh ấy nghe nhạc, anh ấy như lạc vào thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the benefits of two or more completely different situations that you can enjoy at the same time",
                    "vi": "lợi ích của hai hoặc nhiều tình huống hoàn toàn khác nhau mà bạn có thể tận hưởng cùng một lúc"
                },
                "examples": [
                    {
                        "en": "If you enjoy the coast and the country, you'll get the best of both worlds on this walk.",
                        "vi": "Nếu bạn thích bờ biển và đất nước, bạn sẽ có được những điều tuyệt vời nhất của cả hai thế giới trên chuyến đi bộ này."
                    },
                    {
                        "en": "Maybe in the best of all possible worlds things would be different.",
                        "vi": "Có thể trong những điều tốt đẹp nhất có thể, mọi thứ sẽ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be completely different in attitudes, opinions, etc.",
                    "vi": "hoàn toàn khác nhau về thái độ, quan điểm, v.v."
                },
                "examples": [
                    {
                        "en": "Although they are twins, they are worlds apart in their attitude to life.",
                        "vi": "Dù là anh em sinh đôi nhưng họ lại khác xa nhau về thái độ sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation or society that changes in a way that is meant to improve people’s lives but is often a source of extra problems",
                    "vi": "một tình huống hoặc xã hội thay đổi theo hướng nhằm cải thiện cuộc sống của con người nhưng thường là nguồn gốc của các vấn đề phụ"
                },
                "examples": [
                    {
                        "en": "the brave new world of technology",
                        "vi": "thế giới công nghệ mới dũng cảm"
                    },
                    {
                        "en": "the architects' vision of a brave new world of pristine concrete",
                        "vi": "tầm nhìn của các kiến trúc sư về một thế giới mới đầy dũng cảm của bê tông nguyên sơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become less/more important or successful in society",
                    "vi": "trở nên ít quan trọng hơn hoặc thành công hơn trong xã hội"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be born",
                    "vi": "được sinh ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a deep sleep",
                    "vi": "trong một giấc ngủ sâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel much better; to improve something",
                    "vi": "để làm cho ai đó cảm thấy tốt hơn nhiều; để cải thiện một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A change of job would do you the world of good.",
                        "vi": "Một sự thay đổi công việc sẽ mang lại cho bạn một thế giới tốt đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "exactly as if…; exactly like somebody/something",
                    "vi": "chính xác như thể…; giống hệt ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She behaved for all the world as if nothing unusual had happened.",
                        "vi": "Cô ấy cư xử với tất cả thế giới như thể không có gì bất thường xảy ra."
                    },
                    {
                        "en": "He looked for all the world like a schoolboy caught stealing apples.",
                        "vi": "Anh ta tìm kiếm tất cả thế giới như một cậu học sinh bị bắt trộm táo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very successful and admired",
                    "vi": "rất thành công và được ngưỡng mộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize something and to show that you are surprised or annoyed",
                    "vi": "được sử dụng để nhấn mạnh điều gì đó và để thể hiện rằng bạn đang ngạc nhiên hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "What in the world did they think they were doing?",
                        "vi": "Họ nghĩ họ đang làm gì trên thế giới này?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is what you would like to happen or what should happen, but you know it cannot",
                    "vi": "được sử dụng để nói rằng một cái gì đó là những gì bạn muốn xảy ra hoặc những gì sẽ xảy ra, nhưng bạn biết nó không thể"
                },
                "examples": [
                    {
                        "en": "In an ideal world we would be recycling and reusing everything.",
                        "vi": "Trong một thế giới lý tưởng, chúng ta sẽ tái chế và tái sử dụng mọi thứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "There's nothing in the world I'd like more than to visit New York.",
                        "vi": "Không có gì trên thế giới mà tôi muốn hơn là đến thăm New York."
                    },
                    {
                        "en": "Don't rush—we've got all the time in the world.",
                        "vi": "Đừng vội vàng — chúng tôi có tất cả thời gian trên thế giới."
                    },
                    {
                        "en": "You look as if you haven't got a care in the world!",
                        "vi": "Bạn trông như thể bạn không được chăm sóc trên thế giới!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you are in a world of your own, you are so concerned with your own thoughts that you do not notice what is happening around you",
                    "vi": "nếu bạn đang ở trong một thế giới của riêng mình, bạn bận tâm đến những suy nghĩ của chính mình đến mức bạn không nhận thấy những gì đang xảy ra xung quanh mình"
                },
                "examples": [
                    {
                        "en": "I tapped on the window to get her attention but she was in a world of her own.",
                        "vi": "Tôi gõ vào cửa sổ để thu hút sự chú ý của cô ấy nhưng cô ấy đang ở trong một thế giới của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express your surprise when you meet somebody you know in an unexpected place, or when you are talking to somebody and find out that you both know the same person",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên của bạn khi bạn gặp ai đó mà bạn biết ở một nơi bất ngờ, hoặc khi bạn đang nói chuyện với ai đó và phát hiện ra rằng cả hai bạn đều biết cùng một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person with a lot of experience of life, who is not easily surprised or shocked",
                    "vi": "một người có nhiều kinh nghiệm sống, không dễ bị bất ngờ hay bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not the worst thing that could happen to somebody",
                    "vi": "không phải là điều tồi tệ nhất có thể xảy ra với ai đó"
                },
                "examples": [
                    {
                        "en": "Failing one exam is not the end of the world.",
                        "vi": "Thi trượt một kỳ thi không phải là ngày tận thế."
                    },
                    {
                        "en": "It won't be the end of the world if you don't get the job.",
                        "vi": "Sẽ không phải là tận thế nếu bạn không nhận được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would never do something",
                    "vi": "từng nói rằng bạn sẽ không bao giờ làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I wouldn't hurt you for the world.",
                        "vi": "Tôi sẽ không làm tổn thương bạn cho cả thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to people of a particular type",
                    "vi": "được sử dụng để chỉ những người thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "We all envy the Bill Gateses of this world (= the people who are as rich and successful as Bill Gates).",
                        "vi": "Tất cả chúng ta đều ghen tị với Bill Gates của thế giới này (= những người giàu có và thành công như Bill Gates)."
                    }
                ]
            },
            {
                "define": {
                    "en": "very happy or proud",
                    "vi": "rất hạnh phúc hoặc tự hào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize how good, beautiful, etc. something is",
                    "vi": "được sử dụng để nhấn mạnh cái gì đó tốt, đẹp, v.v."
                },
                "examples": [
                    {
                        "en": "The meal was out of this world.",
                        "vi": "Bữa ăn đã ra khỏi thế giới này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make promises that will be impossible to keep",
                    "vi": "hứa sẽ không thể giữ được"
                },
                "examples": [
                    {
                        "en": "Politicians promise the earth before an election, but things are different afterwards.",
                        "vi": "Các chính trị gia hứa với trái đất trước một cuộc bầu cử, nhưng mọi thứ đã khác sau đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel widely and gain wide experience",
                    "vi": "đi du lịch rộng rãi và có được nhiều kinh nghiệm"
                },
                "examples": [
                    {
                        "en": "As a young man, he wanted to see the world before he settled down.",
                        "vi": "Khi còn trẻ, anh ấy muốn nhìn ra thế giới trước khi ổn định cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very successful and admired by other people",
                    "vi": "rất thành công và được người khác ngưỡng mộ"
                },
                "examples": [
                    {
                        "en": "He's never going to set the world on fire with his paintings.",
                        "vi": "Anh ấy sẽ không bao giờ đốt cháy thế giới bằng những bức tranh của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about how the world could be changed to be a better place",
                    "vi": "để nói về cách thế giới có thể được thay đổi để trở thành một nơi tốt đẹp hơn"
                },
                "examples": [
                    {
                        "en": "We stayed up all night, setting the world to rights.",
                        "vi": "Chúng tôi đã thức cả đêm, thiết lập thế giới về quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state in which things are strange, mysterious or secret; a state that exists on the dividing line between two things",
                    "vi": "một trạng thái trong đó những điều kỳ lạ, bí ẩn hoặc bí mật; một trạng thái tồn tại trên ranh giới phân chia giữa hai điều"
                },
                "examples": [
                    {
                        "en": "the twilight world of the occult",
                        "vi": "thế giới hoàng hôn của những điều huyền bí"
                    },
                    {
                        "en": "The dissidents lived in a twilight world of hushed voices and secret meetings.",
                        "vi": "Những người bất đồng chính kiến sống trong một thế giới hoàng hôn của những tiếng nói kín tiếng và những cuộc họp bí mật."
                    },
                    {
                        "en": "the twilight zone between living and merely existing",
                        "vi": "vùng chạng vạng giữa sống và chỉ hiện hữu"
                    },
                    {
                        "en": "They lived in the twilight zone on the fringes of society.",
                        "vi": "Họ sống trong vùng tranh tối tranh sáng bên lề xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to relax and watch people in a public place",
                    "vi": "thư giãn và quan sát mọi người ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "We sat outside a cafe, watching the world go by.",
                        "vi": "Chúng tôi ngồi bên ngoài một quán cà phê, nhìn thế giới trôi qua."
                    },
                    {
                        "en": "I love just watching the world go by.",
                        "vi": "Tôi thích chỉ nhìn thế giới trôi qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that most people behave; the way that things happen, which you cannot change",
                    "vi": "cách mà hầu hết mọi người cư xử; cách mà mọi thứ xảy ra, mà bạn không thể thay đổi"
                },
                "examples": [
                    {
                        "en": "The rich and powerful make the decisions—that's the way of the world.",
                        "vi": "Người giàu và quyền lực đưa ra quyết định — đó là cách của thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express dislike, surprise or shock, especially at changes in people’s attitudes or behaviour",
                    "vi": "được sử dụng để bày tỏ không thích, ngạc nhiên hoặc sốc, đặc biệt là trước những thay đổi trong thái độ hoặc hành vi của mọi người"
                },
                "examples": [
                    {
                        "en": "When I listen to the news these days, I sometimes wonder what the world is coming to.",
                        "vi": "Khi tôi nghe tin tức những ngày này, đôi khi tôi tự hỏi thế giới đang đến với điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you cannot do something, even though you really want to",
                    "vi": "được sử dụng để nói rằng bạn không thể làm điều gì đó, mặc dù bạn thực sự muốn"
                },
                "examples": [
                    {
                        "en": "With the best will in the world I could not describe him as a good father.",
                        "vi": "Với ý chí tốt nhất trên đời, tôi không thể mô tả anh ấy là một người cha tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "everyone; a large number of people",
                    "vi": "tất cả mọi người; một số lượng lớn người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize how different two things are",
                    "vi": "được sử dụng để nhấn mạnh hai điều khác nhau như thế nào"
                },
                "examples": [
                    {
                        "en": "His new luxury mansion was a world away from the tiny house where he was born.",
                        "vi": "Căn biệt thự sang trọng mới của anh cách xa ngôi nhà nhỏ bé nơi anh sinh ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is no limit to the opportunities open to you",
                    "vi": "không có giới hạn cho các cơ hội mở ra cho bạn"
                },
                "examples": [
                    {
                        "en": "With talent like that, the world is her oyster.",
                        "vi": "Với tài năng như vậy, thế giới là con sò của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize how much difference there is between two things",
                    "vi": "được sử dụng để nhấn mạnh có bao nhiêu sự khác biệt giữa hai điều"
                },
                "examples": [
                    {
                        "en": "There's a world of difference between liking someone and loving them.",
                        "vi": "Có một thế giới khác biệt giữa thích ai đó và yêu họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "everywhere in the world",
                    "vi": "ở khắp mọi nơi trên thế giới"
                },
                "examples": [
                    {
                        "en": "People are basically the same the world over.",
                        "vi": "Mọi người về cơ bản là giống nhau trên thế giới."
                    },
                    {
                        "en": "Scientists the world over have been waiting for this breakthrough.",
                        "vi": "Các nhà khoa học trên toàn thế giới đã chờ đợi sự đột phá này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you have all the possible disadvantages at the same time",
                    "vi": "một tình huống mà bạn có tất cả những bất lợi có thể xảy ra cùng một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "59f0ce84492c4caa95273d1e9c5997ce",
        "word": "game controller",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡeɪm kəntrəʊlə(r)/",
            "us": "/ˈɡeɪm kəntrəʊlər/"
        },
        "nearby": [
            {
                "word": "game changer",
                "pos": "noun"
            },
            {
                "word": "game-changing",
                "pos": "adjective"
            },
            {
                "word": "game controller",
                "pos": "noun"
            },
            {
                "word": "game face",
                "pos": "noun"
            },
            {
                "word": "game fish",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic device that is used to control video games via a computer or games console",
                    "vi": "một thiết bị điện tử được sử dụng để điều khiển trò chơi điện tử qua máy tính hoặc bảng điều khiển trò chơi"
                },
                "examples": [
                    {
                        "en": "I haven’t completed the game yet as my controller broke last week.",
                        "vi": "Tôi vẫn chưa hoàn thành trò chơi vì bộ điều khiển của tôi bị hỏng vào tuần trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "2eb3ba3a6f5a4f0a9607419c450731a4",
        "word": "gameplay",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡeɪmpleɪ/",
            "us": "/ˈɡeɪmpleɪ/"
        },
        "nearby": [
            {
                "word": "gamepad",
                "pos": "noun"
            },
            {
                "word": "game plan",
                "pos": "noun"
            },
            {
                "word": "gameplay",
                "pos": "noun"
            },
            {
                "word": "game point",
                "pos": "noun"
            },
            {
                "word": "gamer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the features of a computer game, such as its story or the way it is played, rather than the images or sounds it uses",
                    "vi": "các tính năng của một trò chơi máy tính, chẳng hạn như câu chuyện của nó hoặc cách nó được chơi, thay vì hình ảnh hoặc âm thanh mà nó sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0898bc9ca1034a26bb2988fc7526a926",
        "word": "replayability",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːˌpleɪəˈbɪləti/",
            "us": "/ˌriːˌpleɪəˈbɪləti/"
        },
        "nearby": [
            {
                "word": "replay",
                "pos": "noun"
            },
            {
                "word": "replay",
                "pos": "verb"
            },
            {
                "word": "replayability",
                "pos": "noun"
            },
            {
                "word": "replayable",
                "pos": "adjective"
            },
            {
                "word": "replay value",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality in a video game, music recording, etc. of being suitable for or worth playing more than once",
                    "vi": "chất lượng trong trò chơi điện tử, bản ghi nhạc, v.v. phù hợp hoặc đáng để chơi hơn một lần"
                },
                "examples": [
                    {
                        "en": "This game offers a lot of content and replayability for solo play or multiplayer.",
                        "vi": "Trò chơi này cung cấp nhiều nội dung và khả năng chơi lại để chơi một mình hoặc chơi nhiều người."
                    }
                ]
            }
        ]
    },
    {
        "id": "aeed8669c0634b45aa9e91b333265ab0",
        "word": "replayable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːˈpleɪəbl/",
            "us": "/ˌriːˈpleɪəbl/"
        },
        "nearby": [
            {
                "word": "replay",
                "pos": "verb"
            },
            {
                "word": "replayability",
                "pos": "noun"
            },
            {
                "word": "replayable",
                "pos": "adjective"
            },
            {
                "word": "replay value",
                "pos": "noun"
            },
            {
                "word": "replenish",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "suitable for or worth playing more than once",
                    "vi": "thích hợp hoặc đáng chơi hơn một lần"
                },
                "examples": [
                    {
                        "en": "This is a quick and highly replayable fantasy game.",
                        "vi": "Đây là một trò chơi tưởng tượng nhanh chóng và có khả năng chơi lại rất cao."
                    },
                    {
                        "en": "It's an immensely replayable new single.",
                        "vi": "Đó là một đĩa đơn mới có thể chơi lại vô cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e25a0b5a793c424fa3d8383843a1559e",
        "word": "replay value",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈriːpleɪ væljuː/",
            "us": "/ˈriːpleɪ væljuː/"
        },
        "nearby": [
            {
                "word": "replayability",
                "pos": "noun"
            },
            {
                "word": "replayable",
                "pos": "adjective"
            },
            {
                "word": "replay value",
                "pos": "noun"
            },
            {
                "word": "replenish",
                "pos": "verb"
            },
            {
                "word": "replenishment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality in a video game, music recording, etc. of being suitable for or worth playing more than once",
                    "vi": "chất lượng trong trò chơi điện tử, bản ghi nhạc, v.v. phù hợp hoặc đáng để chơi hơn một lần"
                },
                "examples": [
                    {
                        "en": "To add replay value, each level has two sets of collectibles and time challenges.",
                        "vi": "Để thêm giá trị chơi lại, mỗi cấp độ có hai bộ sưu tập và thử thách thời gian."
                    },
                    {
                        "en": "Even the lyrics are not enough to give this song replay value.",
                        "vi": "Ngay cả lời bài hát cũng không đủ để mang lại giá trị chơi lại bài hát này."
                    }
                ]
            }
        ]
    },
    {
        "id": "64346c3c5f7f48388e5bddd8638a3c3c",
        "word": "role-playing game",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrəʊl pleɪɪŋ ɡeɪm/",
            "us": "/ˈrəʊl pleɪɪŋ ɡeɪm/"
        },
        "nearby": [
            {
                "word": "role-play",
                "pos": "verb"
            },
            {
                "word": "role-play",
                "pos": "noun"
            },
            {
                "word": "role-playing game",
                "pos": "noun"
            },
            {
                "word": "Rolex",
                "pos": ""
            },
            {
                "word": "roll",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game, often an online or computer game, in which players pretend to be imaginary characters who take part in adventures, especially in situations from fantasy literature",
                    "vi": "một trò chơi, thường là trò chơi trực tuyến hoặc trò chơi trên máy tính, trong đó người chơi giả làm nhân vật tưởng tượng tham gia vào các cuộc phiêu lưu, đặc biệt là trong các tình huống từ văn học giả tưởng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0c68ab67a3ce46dcade0b32483addecc",
        "word": "achievement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈtʃiːvmənt/",
            "us": "/əˈtʃiːvmənt/"
        },
        "nearby": [
            {
                "word": "achievable",
                "pos": "adjective"
            },
            {
                "word": "achieve",
                "pos": "verb"
            },
            {
                "word": "achievement",
                "pos": "noun"
            },
            {
                "word": "achiever",
                "pos": "noun"
            },
            {
                "word": "Achilles heel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that somebody has done successfully, especially using their own effort and skill",
                    "vi": "một điều mà ai đó đã làm thành công, đặc biệt là sử dụng nỗ lực và kỹ năng của chính họ"
                },
                "examples": [
                    {
                        "en": "the greatest scientific achievement of the decade",
                        "vi": "thành tựu khoa học vĩ đại nhất của thập kỷ"
                    },
                    {
                        "en": "sporting/artistic/academic achievements",
                        "vi": "thành tích thể thao / nghệ thuật / học tập"
                    },
                    {
                        "en": "It was a remarkable achievement for such a young player.",
                        "vi": "Đó là một thành tích đáng nể với một cầu thủ trẻ như vậy."
                    },
                    {
                        "en": "an outstanding achievement",
                        "vi": "một thành tích xuất sắc"
                    },
                    {
                        "en": "This work is the crowning achievement (= the greatest achievement) of her career.",
                        "vi": "Tác phẩm này là thành tích đăng quang (= thành tựu lớn nhất) trong sự nghiệp của cô."
                    },
                    {
                        "en": "They were proud of their children's achievements.",
                        "vi": "Họ tự hào về thành tích của con mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of achieving something",
                    "vi": "hành động hoặc quá trình đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "the need to raise standards of academic/educational achievement",
                        "vi": "nhu cầu nâng cao các tiêu chuẩn về thành tích học tập / giáo dục"
                    },
                    {
                        "en": "He won a lifetime achievement award for cinematography.",
                        "vi": "Anh đã giành được giải thưởng thành tựu trọn đời cho nghệ thuật quay phim."
                    },
                    {
                        "en": "Even a small success gives you a sense of achievement (= a feeling of pride).",
                        "vi": "Ngay cả một thành công nhỏ cũng mang lại cho bạn cảm giác thành tựu (= cảm giác tự hào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a reward that you can earn in some video games by completing a challenge or level",
                    "vi": "một phần thưởng mà bạn có thể kiếm được trong một số trò chơi điện tử bằng cách hoàn thành một thử thách hoặc cấp độ"
                },
                "examples": [
                    {
                        "en": "If you complete the game in less than twelve hours, you are awarded an achievement at the end.",
                        "vi": "Nếu bạn hoàn thành trò chơi trong vòng chưa đầy mười hai giờ, bạn sẽ được trao một thành tích khi kết thúc."
                    }
                ]
            }
        ]
    },
    {
        "id": "814fb3c00c4e47cf91d22c4d57a248ca",
        "word": "camp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kæmp/",
            "us": "/kæmp/"
        },
        "nearby": [
            {
                "word": "camouflage",
                "pos": "verb"
            },
            {
                "word": "camp",
                "pos": "noun"
            },
            {
                "word": "camp",
                "pos": "verb"
            },
            {
                "word": "camp",
                "pos": "adjective"
            },
            {
                "word": "campaign",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put up a tent and live in it for a short time",
                    "vi": "dựng lều và sống trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "I camped overnight in a field.",
                        "vi": "Tôi cắm trại qua đêm trên một cánh đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay in a tent, especially while you are on holiday",
                    "vi": "ở trong lều, đặc biệt là khi bạn đang đi nghỉ"
                },
                "examples": [
                    {
                        "en": "They go camping in France every year.",
                        "vi": "Họ đi cắm trại ở Pháp hàng năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to live in somebody’s house for a short time, especially when you do not have a bed there",
                    "vi": "sống trong nhà của ai đó trong một thời gian ngắn, đặc biệt là khi bạn không có giường ở đó"
                },
                "examples": [
                    {
                        "en": "I'm camping out at a friend's apartment at the moment.",
                        "vi": "Tôi đang cắm trại tại căn hộ của một người bạn vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of a character in a video game) to stay in one place in order to keep attacking enemies and gain an advantage",
                    "vi": "(của một nhân vật trong trò chơi điện tử) ở nguyên một chỗ để tiếp tục tấn công kẻ thù và giành lợi thế"
                },
                "examples": [
                    {
                        "en": "I can’t get through to the market square as someone’s camping on top of the base.",
                        "vi": "Tôi không thể đi qua quảng trường chợ khi ai đó đang cắm trại trên đỉnh của căn cứ."
                    }
                ]
            }
        ]
    },
    {
        "id": "66c485c42f814574bc4d2ee6a572df77",
        "word": "cross-play",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒs pleɪ/",
            "us": "/ˈkrɔːs pleɪ/"
        },
        "nearby": [
            {
                "word": "crosspiece",
                "pos": "noun"
            },
            {
                "word": "cross-platform",
                "pos": "adjective"
            },
            {
                "word": "cross-play",
                "pos": "noun"
            },
            {
                "word": "cross-pollinate",
                "pos": "verb"
            },
            {
                "word": "cross-pollination",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "playing a computer game across different consoles or platforms at the same time",
                    "vi": "chơi một trò chơi máy tính trên các bảng điều khiển hoặc nền tảng khác nhau cùng một lúc"
                },
                "examples": [
                    {
                        "en": "It was one of the first games to allow cross-play between mobile and console users.",
                        "vi": "Đây là một trong những trò chơi đầu tiên cho phép chơi chéo giữa người dùng thiết bị di động và bảng điều khiển."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb7e6a04797845fdbd5e02728ccf0dce",
        "word": "cutscene",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌtsiːn/",
            "us": "/ˈkʌtsiːn/"
        },
        "nearby": [
            {
                "word": "cut-out",
                "pos": "noun"
            },
            {
                "word": "cut-price",
                "pos": "adjective"
            },
            {
                "word": "cutscene",
                "pos": "noun"
            },
            {
                "word": "cutter",
                "pos": "noun"
            },
            {
                "word": "cut-throat",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short scene in a video game that the player cannot control, and that usually develops the story",
                    "vi": "một cảnh ngắn trong trò chơi điện tử mà người chơi không thể kiểm soát và điều đó thường phát triển câu chuyện"
                },
                "examples": [
                    {
                        "en": "There’s a really good cutscene at the end of the game, where you find out that your character was actually working for the villain.",
                        "vi": "Có một đoạn cắt cảnh thực sự hay ở cuối trò chơi, nơi bạn phát hiện ra rằng nhân vật của mình thực sự đang làm việc cho nhân vật phản diện."
                    }
                ]
            }
        ]
    },
    {
        "id": "50d480f9b8464f06a1168df7e104ae1c",
        "word": "Easter egg",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːstər eɡ/",
            "us": "/ˈiːstər eɡ/"
        },
        "nearby": [
            {
                "word": "Easter",
                "pos": "noun"
            },
            {
                "word": "Easter bunny",
                "pos": "noun"
            },
            {
                "word": "Easter egg",
                "pos": "noun"
            },
            {
                "word": "Easter egg hunt",
                "pos": "noun"
            },
            {
                "word": "easterly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "chocolate in the shape of an egg that is given as a present and eaten at Easter",
                    "vi": "sô cô la hình quả trứng được tặng như một món quà và được ăn vào lễ Phục sinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an egg with a shell that is painted and decorated at Easter",
                    "vi": "một quả trứng có vỏ được sơn và trang trí tại lễ Phục sinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a hidden message or feature in a video game, film, comic book, etc. that is not necessary or related to the main content, but adds to the entertainment",
                    "vi": "một thông điệp hoặc một tính năng ẩn trong trò chơi điện tử, phim, truyện tranh, v.v. không cần thiết hoặc không liên quan đến nội dung chính nhưng lại tăng thêm tính giải trí"
                },
                "examples": [
                    {
                        "en": "Several Easter eggs are hidden on level two of the game.",
                        "vi": "Một số quả trứng Phục sinh được ẩn ở cấp độ hai của trò chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "19dbc1850c954c1ab1b0136c663d46e9",
        "word": "experience points",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪkˈspɪəriəns pɔɪnts/",
            "us": "/ɪkˈspɪriəns pɔɪnts/"
        },
        "nearby": [
            {
                "word": "experience",
                "pos": "verb"
            },
            {
                "word": "experienced",
                "pos": "adjective"
            },
            {
                "word": "experience points",
                "pos": "noun"
            },
            {
                "word": "experiential",
                "pos": "adjective"
            },
            {
                "word": "experiment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "points that you earn in a computer game for completing tasks, collecting items, etc.",
                    "vi": "điểm mà bạn kiếm được trong trò chơi máy tính để hoàn thành nhiệm vụ, thu thập vật phẩm, v.v."
                },
                "examples": [
                    {
                        "en": "You get experience points for each enemy you defeat.",
                        "vi": "Bạn nhận được điểm kinh nghiệm cho mỗi kẻ thù mà bạn đánh bại."
                    },
                    {
                        "en": "With every success your character picks up experience points and grows in strength and ability.",
                        "vi": "Với mỗi thành công, nhân vật của bạn sẽ nhận được điểm kinh nghiệm và phát triển về sức mạnh và khả năng."
                    }
                ]
            }
        ]
    },
    {
        "id": "9048bd9855bf4017a9e2be81eef52403",
        "word": "first-person shooter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɜːst pɜːsn ˈʃuːtə(r)/",
            "us": "/ˌfɜːrst pɜːrsn ˈʃuːtər/"
        },
        "nearby": [
            {
                "word": "first-past-the-post",
                "pos": "adjective"
            },
            {
                "word": "the first person",
                "pos": "noun"
            },
            {
                "word": "first-person shooter",
                "pos": "noun"
            },
            {
                "word": "first principles",
                "pos": "noun"
            },
            {
                "word": "first-rate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of video game in which the player views the action through the eyes of a character and has to attack enemies",
                    "vi": "một loại trò chơi điện tử trong đó người chơi xem hành động qua con mắt của một nhân vật và phải tấn công kẻ thù"
                },
                "examples": [
                    {
                        "en": "In my opinion, a lot of first-person shooter games are too violent for younger players.",
                        "vi": "Theo tôi, rất nhiều game bắn súng góc nhìn thứ nhất quá bạo lực đối với người chơi nhỏ tuổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "23bb877e1700425ab8ca51673991c642",
        "word": "FPS",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌef piː ˈes/",
            "us": "/ˌef piː ˈes/"
        },
        "nearby": [
            {
                "word": "FPO",
                "pos": ""
            },
            {
                "word": "fps",
                "pos": "abbreviation"
            },
            {
                "word": "FPS",
                "pos": "abbreviation"
            },
            {
                "word": "Fr",
                "pos": "abbreviation"
            },
            {
                "word": "fracas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "first-person shoorter game (= a type of video game in which the player views the action through the eyes of a character and has to attack enemies)",
                    "vi": "trò chơi bắn súng góc nhìn thứ nhất (= một loại trò chơi điện tử trong đó người chơi xem hành động qua con mắt của một nhân vật và phải tấn công kẻ thù)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1536540c4501477693f99cf633354c62",
        "word": "frag",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/fræɡ/",
            "us": "/fræɡ/"
        },
        "nearby": [
            {
                "word": "fractured",
                "pos": "adjective"
            },
            {
                "word": "fraenulum",
                "pos": "noun"
            },
            {
                "word": "frag",
                "pos": "verb"
            },
            {
                "word": "fragile",
                "pos": "adjective"
            },
            {
                "word": "fragility",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(of a soldier) to deliberately kill a senior officer who is on the same side in a war or similar conflict, usually using a hand grenade",
                    "vi": "(của một người lính) để cố ý giết một sĩ quan cấp cao cùng phe trong một cuộc chiến tranh hoặc xung đột tương tự, thường là sử dụng lựu đạn"
                },
                "examples": [
                    {
                        "en": "Some soldiers were so disillusioned that they resorted to fragging their commanders.",
                        "vi": "Một số binh sĩ đã vỡ mộng đến mức họ phải dùng đến cách đánh lừa chỉ huy của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in video games) if a player or their character is fragged, that character is killed",
                    "vi": "(trong trò chơi điện tử) nếu một người chơi hoặc nhân vật của họ bị thương, nhân vật đó sẽ bị giết"
                },
                "examples": [
                    {
                        "en": "In order to improve their scores, players must complete objectives and frag enemies.",
                        "vi": "Để cải thiện điểm số của mình, người chơi phải hoàn thành các mục tiêu và đánh bại kẻ thù."
                    },
                    {
                        "en": "I keep getting fragged every time I reach the bunker.",
                        "vi": "Tôi cứ bị sờn lòng mỗi khi đến boongke."
                    },
                    {
                        "en": "When players are fragged, any reward points that they’ve earned are lost.",
                        "vi": "Khi người chơi bị đánh bại, bất kỳ điểm thưởng nào họ kiếm được sẽ bị mất."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ec340398df041928ff91d9b1d0ac09e",
        "word": "gamepad",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡeɪmpæd/",
            "us": "/ˈɡeɪmpæd/"
        },
        "nearby": [
            {
                "word": "gamely",
                "pos": "adverb"
            },
            {
                "word": "game misconduct",
                "pos": "noun"
            },
            {
                "word": "gamepad",
                "pos": "noun"
            },
            {
                "word": "game plan",
                "pos": "noun"
            },
            {
                "word": "gameplay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic device, usually held with two hands, that is used to control video games via a computer or similar device",
                    "vi": "một thiết bị điện tử, thường được cầm bằng hai tay, được sử dụng để điều khiển trò chơi điện tử qua máy tính hoặc thiết bị tương tự"
                },
                "examples": [
                    {
                        "en": "It’s much easier to play this game using a gamepad rather than a keyboard and mouse.",
                        "vi": "Chơi trò chơi này dễ dàng hơn nhiều bằng gamepad thay vì bàn phím và chuột."
                    }
                ]
            }
        ]
    },
    {
        "id": "ebde15198b284a7a9631330ef0e046c7",
        "word": "gold farming",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡəʊld fɑːmɪŋ/",
            "us": "/ˈɡəʊld fɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "Golden Wonder",
                "pos": ""
            },
            {
                "word": "gold farmer",
                "pos": "noun"
            },
            {
                "word": "gold farming",
                "pos": "noun"
            },
            {
                "word": "goldfield",
                "pos": "noun"
            },
            {
                "word": "goldfinch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of playing an online game for long periods of time, often as a job for a gold farming company, in order to progress through the game and then sell game currency, valuable items or characters to other players for real money",
                    "vi": "thực hành chơi trò chơi trực tuyến trong thời gian dài, thường là công việc cho một công ty nuôi vàng, để tiến bộ trong trò chơi và sau đó bán tiền tệ, vật phẩm hoặc nhân vật có giá trị cho người chơi khác bằng tiền thật"
                },
                "examples": [
                    {
                        "en": "The creators of the game recently won a high-profile lawsuit against a gold farming company.",
                        "vi": "Những người tạo ra trò chơi gần đây đã thắng một vụ kiện cấp cao chống lại một công ty nuôi vàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "92f776802bac47aeab65a893be82d53a",
        "word": "joypad",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɔɪpæd/",
            "us": "/ˈdʒɔɪpæd/"
        },
        "nearby": [
            {
                "word": "joyous",
                "pos": "adjective"
            },
            {
                "word": "joyously",
                "pos": "adverb"
            },
            {
                "word": "joypad",
                "pos": "noun"
            },
            {
                "word": "joyride",
                "pos": "noun"
            },
            {
                "word": "joyrider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device used with some computer games, with buttons that you use to move images on the screen",
                    "vi": "một thiết bị được sử dụng với một số trò chơi máy tính, với các nút mà bạn sử dụng để di chuyển hình ảnh trên màn hình"
                },
                "examples": [
                    {
                        "en": "The game is entirely keyboard- or joypad-controlled.",
                        "vi": "Trò chơi hoàn toàn được điều khiển bằng bàn phím hoặc bàn phím."
                    }
                ]
            }
        ]
    },
    {
        "id": "22d2709e17604439a18e509878806f34",
        "word": "level up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "level off",
                "pos": "phrasal verb"
            },
            {
                "word": "level out",
                "pos": "phrasal verb"
            },
            {
                "word": "level up",
                "pos": "phrasal verb"
            },
            {
                "word": "level with",
                "pos": "phrasal verb"
            },
            {
                "word": "lever",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to win points and get new skills, weapons, etc. for your character",
                    "vi": "để giành điểm và nhận các kỹ năng, vũ khí mới, v.v. cho nhân vật của bạn"
                },
                "examples": [
                    {
                        "en": "Players battle with monsters, gain experience, and level up to become more powerful.",
                        "vi": "Người chơi chiến đấu với quái vật, tích lũy kinh nghiệm và lên cấp để trở nên mạnh mẽ hơn."
                    },
                    {
                        "en": "It’s all about levelling up your skills and character abilities.",
                        "vi": "Đó là tất cả về việc nâng cấp các kỹ năng và khả năng nhân vật của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make standards, amounts, etc. be of the same high or higher level",
                    "vi": "để làm cho các tiêu chuẩn, số lượng, v.v. có cùng mức cao hoặc cao hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "81f0165a35544d10862f8ec595e404b1",
        "word": "MUD",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mʌd/",
            "us": "/mʌd/"
        },
        "nearby": [
            {
                "word": "mucus",
                "pos": "noun"
            },
            {
                "word": "mud",
                "pos": "noun"
            },
            {
                "word": "MUD",
                "pos": "noun"
            },
            {
                "word": "mud bath",
                "pos": "noun"
            },
            {
                "word": "muddle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer game played over the internet by several players at the same time (the abbreviation for ‘multi-user dungeon’ or ‘multi-user dimension’)",
                    "vi": "một trò chơi trên máy tính được nhiều người chơi cùng lúc chơi qua internet (chữ viết tắt của 'hầm ngục nhiều người dùng' hoặc 'thứ nguyên đa người dùng')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eac180a7aeb249a79fc979da8ff246d9",
        "word": "non-player character",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnɒn ˌpleɪə ˈkærəktə(r)/",
            "us": "/ˌnɑːn ˌpleɪər ˈkærəktər/"
        },
        "nearby": [
            {
                "word": "non-payment",
                "pos": "noun"
            },
            {
                "word": "non-person",
                "pos": "noun"
            },
            {
                "word": "non-player character",
                "pos": "noun"
            },
            {
                "word": "nonplussed",
                "pos": "adjective"
            },
            {
                "word": "non-prescription",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a video game character that is not controlled by a player of the game",
                    "vi": "một nhân vật trò chơi điện tử không do người chơi điều khiển"
                },
                "examples": [
                    {
                        "en": "As the game progresses, more non-player characters are introduced.",
                        "vi": "Khi trò chơi tiến triển, nhiều nhân vật không phải người chơi được giới thiệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "f068dbec4bc5401abd3bcb118564607a",
        "word": "NPC",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌen piː ˈsiː/",
            "us": "/ˌen piː ˈsiː/"
        },
        "nearby": [
            {
                "word": "noxious",
                "pos": "adjective"
            },
            {
                "word": "nozzle",
                "pos": "noun"
            },
            {
                "word": "NPC",
                "pos": "noun"
            },
            {
                "word": "NPR",
                "pos": ""
            },
            {
                "word": "NQ",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a video game character that is not controlled by a player of the game (the abbreviation for non-player character)",
                    "vi": "một nhân vật trò chơi điện tử không do người chơi điều khiển (chữ viết tắt của nhân vật không phải người chơi)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8e6f3ff9777c4d25a94197874ff26132",
        "word": "platform game",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplætfɔːmə(r)/",
            "us": "/ˈplætfɔːrmər/"
        },
        "nearby": [
            {
                "word": "plate tectonics",
                "pos": "noun"
            },
            {
                "word": "platform",
                "pos": "noun"
            },
            {
                "word": "platform game",
                "pos": "noun"
            },
            {
                "word": "Sylvia Plath",
                "pos": ""
            },
            {
                "word": "plating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer game in which the player controls a character who jumps and climbs between platforms at different positions on the screen",
                    "vi": "một trò chơi máy tính trong đó người chơi điều khiển một nhân vật nhảy và leo giữa các bệ ở các vị trí khác nhau trên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "13a423fb1b864975ac4b701d4f17bdcb",
        "word": "pwn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pəʊn/",
            "us": "/pəʊn/"
        },
        "nearby": [
            {
                "word": "Pvt.",
                "pos": "abbreviation"
            },
            {
                "word": "p.w.",
                "pos": "abbreviation"
            },
            {
                "word": "pwn",
                "pos": "verb"
            },
            {
                "word": "pwnage",
                "pos": "noun"
            },
            {
                "word": "PX",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to completely defeat somebody, especially in a video game; to be completely successful against somebody/something",
                    "vi": "để đánh bại hoàn toàn ai đó, đặc biệt là trong một trò chơi điện tử; để hoàn toàn thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm going to pwn some noobs (= players who do not have much experience) in this game.",
                        "vi": "Tôi sẽ mổ một số noobs (= những người chơi chưa có nhiều kinh nghiệm) trong trò chơi này."
                    },
                    {
                        "en": "We got pwned by the other team in the final game.",
                        "vi": "Chúng tôi đã bị đối thủ khác chọc thủng lưới trong trận đấu cuối cùng."
                    },
                    {
                        "en": "The company has pwned its competitors for over two decades.",
                        "vi": "Công ty đã săn đón các đối thủ cạnh tranh của mình trong hơn hai thập kỷ."
                    }
                ]
            }
        ]
    },
    {
        "id": "138ca0b463554558992ca9d5c859dc56",
        "word": "pwnage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊnɪdʒ/",
            "us": "/ˈpəʊnɪdʒ/"
        },
        "nearby": [
            {
                "word": "p.w.",
                "pos": "abbreviation"
            },
            {
                "word": "pwn",
                "pos": "verb"
            },
            {
                "word": "pwnage",
                "pos": "noun"
            },
            {
                "word": "PX",
                "pos": "noun"
            },
            {
                "word": "pye-dog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of completely defeating somebody, especially in a video game; the fact of being completely successful against somebody/something",
                    "vi": "thực tế là đánh bại hoàn toàn ai đó, đặc biệt là trong một trò chơi điện tử; thực tế là hoàn toàn thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "In the final game it was total pwnage.",
                        "vi": "Trong trò chơi cuối cùng, đó là sự tàn sát toàn diện."
                    }
                ]
            }
        ]
    },
    {
        "id": "57c79ba0eb95492c9c92d03df9e8e401",
        "word": "respawn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈspɔːn/",
            "us": "/ˌriːˈspɔːn/"
        },
        "nearby": [
            {
                "word": "resourcefully",
                "pos": "adverb"
            },
            {
                "word": "resourcefulness",
                "pos": "noun"
            },
            {
                "word": "respawn",
                "pos": "verb"
            },
            {
                "word": "respect",
                "pos": "noun"
            },
            {
                "word": "respect",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a character that has been killed in a video game respawns or is respawned, that character appears again in the game",
                    "vi": "nếu một nhân vật đã bị giết trong trò chơi điện tử sống lại hoặc được hồi sinh, nhân vật đó sẽ xuất hiện lại trong trò chơi"
                },
                "examples": [
                    {
                        "en": "On level five of the game, enemies respawn very quickly.",
                        "vi": "Ở cấp độ năm của trò chơi, kẻ thù hồi sinh rất nhanh."
                    },
                    {
                        "en": "Characters in the game can be respawned when they are killed.",
                        "vi": "Các nhân vật trong game có thể được hồi sinh khi họ bị giết."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a2a5e6de6fa4de6b972097659fb038c",
        "word": "RPG",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɑː piː ˈdʒiː/",
            "us": "/ˌɑːr piː ˈdʒiː/"
        },
        "nearby": [
            {
                "word": "rozzer",
                "pos": "noun"
            },
            {
                "word": "RP",
                "pos": "noun"
            },
            {
                "word": "RPG",
                "pos": "noun"
            },
            {
                "word": "RPI",
                "pos": "abbreviation"
            },
            {
                "word": "RPIX",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game, often an online or computer game, in which players pretend to be imaginary characters who take part in adventures, especially in situations from fantasy literature (the abbreviation for role-playing game)",
                    "vi": "một trò chơi, thường là trò chơi trực tuyến hoặc trò chơi trên máy tính, trong đó người chơi giả làm nhân vật tưởng tượng tham gia vào các cuộc phiêu lưu, đặc biệt là trong các tình huống từ văn học giả tưởng (tên viết tắt của trò chơi nhập vai)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c203e78a18934185a4d3491498de2c80",
        "word": "shoot-’em-up",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃuːt əm ʌp/",
            "us": "/ˈʃuːt əm ʌp/"
        },
        "nearby": [
            {
                "word": "shootaround",
                "pos": "noun"
            },
            {
                "word": "shoot down",
                "pos": "phrasal verb"
            },
            {
                "word": "shoot-'em-up",
                "pos": "adjective"
            },
            {
                "word": "shooter",
                "pos": "noun"
            },
            {
                "word": "shooter game",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shoot-’em-up computer game, etc. is one involving a lot of violence with guns",
                    "vi": "trò chơi máy tính bắn súng, v.v. là trò chơi có nhiều cảnh bạo lực bằng súng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2dbd78156b3d4c88a0682e5510324e4f",
        "word": "sim",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sɪm/",
            "us": "/sɪm/"
        },
        "nearby": [
            {
                "word": "silvery",
                "pos": "adjective"
            },
            {
                "word": "Victor Silvester",
                "pos": ""
            },
            {
                "word": "sim",
                "pos": "noun"
            },
            {
                "word": "SIM card",
                "pos": "noun"
            },
            {
                "word": "simian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer or video game that simulates (= artificially creates the feeling of experiencing) an activity such as flying an aircraft or playing a sport",
                    "vi": "máy tính hoặc trò chơi điện tử mô phỏng (= tạo ra cảm giác trải nghiệm một cách giả tạo) một hoạt động như lái máy bay hoặc chơi thể thao"
                },
                "examples": []
            }
        ]
    }
]