[
    {
        "id": "ef174b9d632d4da3ab7870265a0a76e9",
        "word": "engine",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈendʒɪn/",
            "us": "/ˈendʒɪn/"
        },
        "nearby": [
            {
                "word": "engagingly",
                "pos": "adverb"
            },
            {
                "word": "engender",
                "pos": "verb"
            },
            {
                "word": "engine",
                "pos": "noun"
            },
            {
                "word": "engine driver",
                "pos": "noun"
            },
            {
                "word": "engineer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a vehicle that produces power to make the vehicle move",
                    "vi": "bộ phận của một chiếc xe tạo ra sức mạnh để làm cho chiếc xe chuyển động"
                },
                "examples": [
                    {
                        "en": "a diesel/petrol engine",
                        "vi": "một động cơ diesel / xăng"
                    },
                    {
                        "en": "I got in the car and started the engine.",
                        "vi": "Tôi lên xe và nổ máy."
                    },
                    {
                        "en": "My car had to have a new engine.",
                        "vi": "Xe của tôi phải có một động cơ mới."
                    },
                    {
                        "en": "The engine runs on diesel.",
                        "vi": "Động cơ chạy bằng dầu diesel."
                    },
                    {
                        "en": "Its engine is powered by both gasoline and electricity.",
                        "vi": "Động cơ của nó chạy bằng cả xăng và điện."
                    },
                    {
                        "en": "The plane suffered catastrophic engine failure.",
                        "vi": "Máy bay bị hỏng động cơ thảm khốc."
                    },
                    {
                        "en": "Their helicopter had developed engine trouble.",
                        "vi": "Máy bay trực thăng của họ gặp trục trặc về động cơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that has an important role in making a particular process happen",
                    "vi": "một thứ có vai trò quan trọng trong việc thực hiện một quá trình cụ thể"
                },
                "examples": [
                    {
                        "en": "engine of something Agriculture is a key engine of growth in most developing countries.",
                        "vi": "động cơ của một cái gì đó Nông nghiệp là động cơ tăng trưởng chính ở hầu hết các nước đang phát triển."
                    },
                    {
                        "en": "engine for something Great newspapers serve as an engine for positive change.",
                        "vi": "động cơ cho điều gì đó Những tờ báo vĩ đại đóng vai trò là động cơ cho sự thay đổi tích cực."
                    },
                    {
                        "en": "engine for doing something Business is the principal engine for generating wealth for society as a whole.",
                        "vi": "động cơ để làm điều gì đó Kinh doanh là động cơ chính để tạo ra của cải cho toàn xã hội."
                    },
                    {
                        "en": "He was the engine behind the victory.",
                        "vi": "Anh ấy là động cơ đằng sau chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a vehicle that pulls a train",
                    "vi": "một chiếc xe kéo một đoàn tàu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having the type or number of engines mentioned",
                    "vi": "có loại hoặc số lượng động cơ được đề cập"
                },
                "examples": [
                    {
                        "en": "a twin-engined speedboat",
                        "vi": "thuyền cao tốc hai động cơ"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f746d3228e444b39b2bedc88e50c79c",
        "word": "gas",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɡæs/",
            "us": "/ɡæs/"
        },
        "nearby": [
            {
                "word": "Marcus Garvey",
                "pos": ""
            },
            {
                "word": "Gary",
                "pos": ""
            },
            {
                "word": "gas",
                "pos": "noun"
            },
            {
                "word": "gas",
                "pos": "verb"
            },
            {
                "word": "gasbag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any substance like air that is neither a solid nor a liquid, for example hydrogen or oxygen",
                    "vi": "bất kỳ chất nào như không khí không phải là chất rắn cũng không phải là chất lỏng, ví dụ hydro hoặc oxy"
                },
                "examples": [
                    {
                        "en": "Air is a mixture of gases.",
                        "vi": "Không khí là hỗn hợp của các chất khí."
                    },
                    {
                        "en": "Carbon monoxide is a poisonous gas.",
                        "vi": "Carbon monoxide là một loại khí độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of gas or mixture of gases used as fuel for heating and cooking",
                    "vi": "một loại khí cụ thể hoặc hỗn hợp khí được sử dụng làm nhiên liệu để sưởi ấm và nấu ăn"
                },
                "examples": [
                    {
                        "en": "fossil fuels like oil and gas",
                        "vi": "nhiên liệu hóa thạch như dầu và khí đốt"
                    },
                    {
                        "en": "Can you smell gas?",
                        "vi": "Bạn có thể ngửi thấy mùi gas?"
                    },
                    {
                        "en": "a gas cooker/stove/fire",
                        "vi": "bếp ga / bếp / lửa"
                    },
                    {
                        "en": "gas central heating",
                        "vi": "khí đốt sưởi ấm trung tâm"
                    },
                    {
                        "en": "a gas leak/explosion",
                        "vi": "rò rỉ / nổ khí gas"
                    },
                    {
                        "en": "plans to build a new gas pipeline",
                        "vi": "kế hoạch xây dựng một đường ống dẫn khí đốt mới"
                    },
                    {
                        "en": "Gas prices have risen sharply.",
                        "vi": "Giá xăng đã tăng mạnh."
                    },
                    {
                        "en": "The country has huge gas reserves.",
                        "vi": "Nước này có trữ lượng khí đốt khổng lồ."
                    },
                    {
                        "en": "a gas canister/cylinder (= for storing gas)",
                        "vi": "một ống đựng / xi lanh khí (= để chứa khí)"
                    },
                    {
                        "en": "(British English) Preheat the oven to gas mark 5 (= a particular temperature of a gas oven).",
                        "vi": "(Tiếng Anh Anh) Làm nóng lò ở vạch khí 5 (= nhiệt độ cụ thể của lò gas)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of gas used during a medical operation, to make the patient unconscious or to make the pain less",
                    "vi": "một loại khí cụ thể được sử dụng trong một cuộc phẫu thuật y tế, để làm cho bệnh nhân bất tỉnh hoặc làm giảm cơn đau"
                },
                "examples": [
                    {
                        "en": "an anaesthetic gas",
                        "vi": "khí gây mê"
                    },
                    {
                        "en": "Did you have gas or an injection?",
                        "vi": "Bạn đã bị đầy hơi hoặc bị tiêm?"
                    },
                    {
                        "en": "During the birth she was given gas and air.",
                        "vi": "Trong quá trình sinh nở, cô đã được cung cấp khí và không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of gas used in war to kill or injure people, or used by the police to control people",
                    "vi": "một loại khí cụ thể được sử dụng trong chiến tranh để giết hoặc làm bị thương người, hoặc được sử dụng bởi cảnh sát để kiểm soát người dân"
                },
                "examples": [
                    {
                        "en": "a gas attack",
                        "vi": "một cuộc tấn công khí"
                    }
                ]
            },
            {
                "define": {
                    "en": "a liquid obtained from petroleum, used as fuel in car engines, etc.",
                    "vi": "chất lỏng thu được từ dầu mỏ, được sử dụng làm nhiên liệu trong động cơ ô tô, v.v."
                },
                "examples": [
                    {
                        "en": "to run out of gas",
                        "vi": "Cạn nhiên liệu"
                    },
                    {
                        "en": "I still had plenty of gas in the tank.",
                        "vi": "Tôi vẫn còn nhiều xăng trong bình."
                    },
                    {
                        "en": "He supported himself with a night job pumping gas.",
                        "vi": "Anh ấy tự nuôi mình bằng công việc bơm xăng ban đêm."
                    },
                    {
                        "en": "a gas pump",
                        "vi": "một máy bơm xăng"
                    },
                    {
                        "en": "to fill up the gas tank",
                        "vi": "đổ đầy bình xăng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the pedal in a car or other vehicle that you press with your foot to control the speed of the engine",
                    "vi": "bàn đạp trên ô tô hoặc phương tiện khác mà bạn nhấn bằng chân để điều khiển tốc độ của động cơ"
                },
                "examples": [
                    {
                        "en": "Step on the gas, we're late.",
                        "vi": "Hãy nhấn ga, chúng ta sẽ đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an event that is fun",
                    "vi": "một người hoặc một sự kiện thú vị"
                },
                "examples": [
                    {
                        "en": "The party was a real gas.",
                        "vi": "Bữa tiệc là một không khí thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "air that you swallow with food or drink; gas that is produced in your stomach or intestines that makes you feel uncomfortable",
                    "vi": "không khí mà bạn nuốt phải cùng với thức ăn hoặc đồ uống; khí sinh ra trong dạ dày hoặc ruột khiến bạn cảm thấy khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be doing something very well and successfully",
                    "vi": "làm điều gì đó rất tốt và thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4d0b44fb71a4fd092fbf47bf681f642",
        "word": "oil",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɔɪl/",
            "us": "/ɔɪl/"
        },
        "nearby": [
            {
                "word": "-oid",
                "pos": "suffix"
            },
            {
                "word": "oik",
                "pos": "noun"
            },
            {
                "word": "oil",
                "pos": "noun"
            },
            {
                "word": "oil",
                "pos": "verb"
            },
            {
                "word": "oil-bearing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick liquid that is found in rock underground",
                    "vi": "một chất lỏng đặc được tìm thấy trong đá dưới lòng đất"
                },
                "examples": [
                    {
                        "en": "Several companies are drilling for oil in the region.",
                        "vi": "Một số công ty đang khoan dầu trong khu vực."
                    },
                    {
                        "en": "The price of crude oil has more than doubled.",
                        "vi": "Giá dầu thô đã tăng hơn gấp đôi."
                    },
                    {
                        "en": "rising world oil prices",
                        "vi": "giá dầu thế giới tăng"
                    },
                    {
                        "en": "an oil spill",
                        "vi": "một sự cố tràn dầu"
                    },
                    {
                        "en": "The country is rich in oil reserves.",
                        "vi": "Đất nước này rất giàu trữ lượng dầu mỏ."
                    },
                    {
                        "en": "oil and gas drilling/exploration",
                        "vi": "khoan / thăm dò dầu khí"
                    },
                    {
                        "en": "oil refineries/pipelines",
                        "vi": "nhà máy lọc dầu / đường ống"
                    },
                    {
                        "en": "oil companies",
                        "vi": "các công ty dầu"
                    },
                    {
                        "en": "the oil industry",
                        "vi": "ngành công nghiệp dầu mỏ"
                    },
                    {
                        "en": "The well produced oil at a rate of 2 000 barrels of oil a day.",
                        "vi": "Giếng khai thác dầu với tốc độ 2.000 thùng dầu một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a form of petroleum that is used as fuel and to make parts of machines move smoothly",
                    "vi": "một dạng dầu mỏ được sử dụng làm nhiên liệu và làm cho các bộ phận của máy móc chuyển động trơn tru"
                },
                "examples": [
                    {
                        "en": "fuel oil",
                        "vi": "dầu nhiên liệu"
                    },
                    {
                        "en": "engine oil",
                        "vi": "dầu động cơ"
                    },
                    {
                        "en": "an oil lamp/heater",
                        "vi": "đèn dầu / máy sưởi"
                    },
                    {
                        "en": "Put some oil in the car.",
                        "vi": "Cho một ít dầu vào xe."
                    },
                    {
                        "en": "Most people think about energy only when gas prices increase or when heating oil is in short supply.",
                        "vi": "Hầu hết mọi người chỉ nghĩ đến năng lượng khi giá khí đốt tăng hoặc khi nguồn cung cấp dầu nóng bị thiếu hụt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a smooth thick liquid that is made from plants or animals and is used in cooking",
                    "vi": "một chất lỏng đặc mịn được làm từ thực vật hoặc động vật và được sử dụng trong nấu ăn"
                },
                "examples": [
                    {
                        "en": "Fry the potato in a little sunflower oil.",
                        "vi": "Chiên khoai tây trong một ít dầu hướng dương."
                    },
                    {
                        "en": "palm/coconut/sesame oil",
                        "vi": "dầu cọ / dừa / mè"
                    },
                    {
                        "en": "Heat the frying pan and add cooking oil.",
                        "vi": "Làm nóng chảo rồi cho dầu ăn vào."
                    },
                    {
                        "en": "Heat the oil gently and brown the mince.",
                        "vi": "Đun nóng nhẹ dầu và cho thịt băm vào chuyển màu nâu."
                    },
                    {
                        "en": "Vegetable oils are better for you than animal fats.",
                        "vi": "Dầu thực vật tốt cho bạn hơn mỡ động vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a smooth thick liquid that is made from plants, minerals, etc. and is used on the skin or hair",
                    "vi": "một chất lỏng đặc mịn được làm từ thực vật, khoáng chất, v.v. và được sử dụng trên da hoặc tóc"
                },
                "examples": [
                    {
                        "en": "lavender bath oil",
                        "vi": "dầu tắm hoa oải hương"
                    },
                    {
                        "en": "suntan oil",
                        "vi": "dầu suntan"
                    }
                ]
            },
            {
                "define": {
                    "en": "coloured paint containing oil used by artists",
                    "vi": "sơn màu có chứa dầu được sử dụng bởi các nghệ sĩ"
                },
                "examples": [
                    {
                        "en": "‘Four Women on a Bench’, oil on canvas, 1991",
                        "vi": "Bốn người phụ nữ trên ghế dài', sơn dầu trên vải, 1991"
                    },
                    {
                        "en": "in oil a painting done in oils",
                        "vi": "trong sơn dầu một bức tranh vẽ bằng dầu"
                    },
                    {
                        "en": "landscapes in oil",
                        "vi": "phong cảnh trong dầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture painted in oil paint",
                    "vi": "một bức tranh bằng sơn dầu"
                },
                "examples": [
                    {
                        "en": "Among the more important Turner oils was ‘Venus and Adonis’.",
                        "vi": "Trong số các loại dầu Turner quan trọng hơn là 'Venus và Adonis'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to study or work until late at night",
                    "vi": "học hoặc làm việc đến khuya"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to settle an argument",
                    "vi": "để cố gắng giải quyết một cuộc tranh cãi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc3782add3e54787a3074926675359cd",
        "word": "petrol",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈpetrəl/",
            "us": "/ˈpetrəl/"
        },
        "nearby": [
            {
                "word": "petrochemical",
                "pos": "noun"
            },
            {
                "word": "petrodollar",
                "pos": "noun"
            },
            {
                "word": "petrol",
                "pos": "noun"
            },
            {
                "word": "petrol blue",
                "pos": "adjective"
            },
            {
                "word": "petrol blue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a liquid obtained from petroleum, used as fuel in car engines, etc.",
                    "vi": "chất lỏng thu được từ dầu mỏ, được sử dụng làm nhiên liệu trong động cơ ô tô, v.v."
                },
                "examples": [
                    {
                        "en": "to fill a car up with petrol",
                        "vi": "đổ xăng vào ô tô"
                    },
                    {
                        "en": "to run out of petrol",
                        "vi": "hết xăng"
                    },
                    {
                        "en": "The car has a 2-litre petrol engine.",
                        "vi": "Xe có động cơ xăng 2 lít."
                    },
                    {
                        "en": "the petrol tank of a car",
                        "vi": "thùng xăng của ô tô"
                    },
                    {
                        "en": "An increase in petrol prices will lead to severe difficulties for the company.",
                        "vi": "Giá xăng dầu tăng sẽ khiến công ty gặp nhiều khó khăn."
                    },
                    {
                        "en": "leaded/unleaded petrol",
                        "vi": "xăng pha chì / không chì"
                    }
                ]
            }
        ]
    },
    {
        "id": "a5a284824e1b4db4ba44f0130353e367",
        "word": "roof",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ruːf/",
            "us": "/ruːf/"
        },
        "nearby": [
            {
                "word": "roo",
                "pos": "noun"
            },
            {
                "word": "rood screen",
                "pos": "noun"
            },
            {
                "word": "roof",
                "pos": "noun"
            },
            {
                "word": "roof",
                "pos": "verb"
            },
            {
                "word": "roofer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the structure that covers or forms the top of a building or vehicle",
                    "vi": "cấu trúc bao phủ hoặc tạo thành phần trên cùng của một tòa nhà hoặc phương tiện"
                },
                "examples": [
                    {
                        "en": "a flat/sloping/pitched roof",
                        "vi": "mái bằng / dốc / dốc"
                    },
                    {
                        "en": "Offices on the upper floors have access to a roof terrace.",
                        "vi": "Văn phòng ở các tầng trên có lối đi lên sân thượng."
                    },
                    {
                        "en": "a tin/slate/tiled/thatched roof",
                        "vi": "một mái nhà thiếc / đá phiến / lát gạch / tranh"
                    },
                    {
                        "en": "The corner of the classroom was damp where the roof had leaked.",
                        "vi": "Góc phòng học ẩm thấp nơi mái tôn dột."
                    },
                    {
                        "en": "Tim climbed on to the garage roof.",
                        "vi": "Tim trèo lên mái nhà để xe."
                    },
                    {
                        "en": "The roof of the car was not damaged in the accident.",
                        "vi": "Phần mui của chiếc ô tô không bị hư hỏng trong vụ tai nạn."
                    },
                    {
                        "en": "Offices on the upper floors have access to a roof terrace.",
                        "vi": "Văn phòng ở các tầng trên có lối đi lên sân thượng."
                    },
                    {
                        "en": "We stepped out onto the roof of the building.",
                        "vi": "Chúng tôi bước ra sân thượng của tòa nhà."
                    },
                    {
                        "en": "I have solar panels on my roof.",
                        "vi": "Tôi có các tấm pin mặt trời trên mái nhà của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of roof mentioned",
                    "vi": "có loại mái được đề cập"
                },
                "examples": [
                    {
                        "en": "flat-roofed buildings",
                        "vi": "tòa nhà mái bằng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of an underground space such as a tunnel or cave",
                    "vi": "trên cùng của một không gian ngầm như đường hầm hoặc hang động"
                },
                "examples": [
                    {
                        "en": "The roof of the tunnel was starting to collapse.",
                        "vi": "Mái của đường hầm bắt đầu sập xuống."
                    },
                    {
                        "en": "The cave had a very low roof.",
                        "vi": "Hang động có mái rất thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of the inside of your mouth",
                    "vi": "đầu bên trong miệng của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to rise or increase very quickly",
                    "vi": "tăng hoặc tăng rất nhanh"
                },
                "examples": [
                    {
                        "en": "House prices here have gone through the roof.",
                        "vi": "Giá nhà ở đây đã lên tới nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very angry",
                    "vi": "trở nên rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have somewhere to live",
                    "vi": "có một nơi nào đó để sống"
                },
                "examples": [
                    {
                        "en": "Thanks to Bob’s generosity, I still have a roof over my head.",
                        "vi": "Cảm ơn sự hào phóng của Bob, tôi vẫn có một mái nhà trên đầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce or make somebody produce a lot of noise in a building, for example by shouting or cheering",
                    "vi": "để tạo ra hoặc khiến ai đó tạo ra nhiều tiếng ồn trong một tòa nhà, chẳng hạn như bằng cách la hét hoặc cổ vũ"
                },
                "examples": [
                    {
                        "en": "Their cheers raised the roof.",
                        "vi": "Tiếng hò reo của họ đã nâng nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the same building or house",
                    "vi": "trong cùng một tòa nhà hoặc một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "There are various stores and restaurants all under one roof.",
                        "vi": "Có nhiều cửa hàng và nhà hàng khác nhau dưới một mái nhà."
                    },
                    {
                        "en": "I don't think I can live under the same roof as you any longer.",
                        "vi": "Tôi không nghĩ mình có thể sống chung dưới một mái nhà với các bạn nữa."
                    },
                    {
                        "en": "We're good friends but we could never live under the same roof.",
                        "vi": "Chúng tôi là bạn tốt của nhau nhưng chúng tôi không bao giờ có thể sống chung dưới một mái nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "in your home",
                    "vi": "ở nhà bạn"
                },
                "examples": [
                    {
                        "en": "I don't want her under my roof again.",
                        "vi": "Tôi không muốn cô ấy ở dưới mái nhà của tôi một lần nữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "12391afd9cb444c38248c1544987869e",
        "word": "wheel",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/wiːl/",
            "us": "/wiːl/"
        },
        "nearby": [
            {
                "word": "whee",
                "pos": "exclamation"
            },
            {
                "word": "wheedle",
                "pos": "verb"
            },
            {
                "word": "wheel",
                "pos": "noun"
            },
            {
                "word": "wheel",
                "pos": "verb"
            },
            {
                "word": "wheel arch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the round objects under a car, bicycle, bus, etc. that turns when it moves",
                    "vi": "một trong những vật thể tròn bên dưới ô tô, xe đạp, xe buýt, v.v. quay khi nó chuyển động"
                },
                "examples": [
                    {
                        "en": "He braked suddenly, causing the front wheels to skid.",
                        "vi": "Anh phanh gấp khiến bánh trước bị trượt."
                    },
                    {
                        "en": "the rear wheels of the car",
                        "vi": "bánh sau của ô tô"
                    },
                    {
                        "en": "She was killed when she was crushed under the wheels of a bus.",
                        "vi": "Cô đã thiệt mạng khi bị đè dưới bánh xe buýt."
                    },
                    {
                        "en": "I had lightweight wheels on my bike.",
                        "vi": "Tôi đã có bánh xe nhẹ trên chiếc xe đạp của mình."
                    },
                    {
                        "en": "tractors with powered front wheels",
                        "vi": "máy kéo có bánh trước được trợ lực"
                    },
                    {
                        "en": "on wheels One of the boys was pushing the other along in a little box on wheels.",
                        "vi": "trên bánh xe Một trong hai cậu bé đang đẩy người kia theo một chiếc hộp nhỏ trên bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the round object used for controlling the direction in which a car, etc. or ship moves",
                    "vi": "vật thể tròn được sử dụng để điều khiển hướng mà ô tô, v.v. hoặc tàu di chuyển"
                },
                "examples": [
                    {
                        "en": "Always keep both hands on the wheel.",
                        "vi": "Luôn giữ cả hai tay trên bánh xe."
                    },
                    {
                        "en": "behind the wheel Never get behind the wheel if you're too tired.",
                        "vi": "sau tay lái Không bao giờ ngồi sau tay lái nếu bạn quá mệt."
                    },
                    {
                        "en": "This is the first time I've sat behind the wheel since the accident.",
                        "vi": "Đây là lần đầu tiên tôi ngồi sau tay lái kể từ vụ tai nạn."
                    },
                    {
                        "en": "at the wheel A car swept past with Laura at the wheel.",
                        "vi": "tại bánh xe Một chiếc xe lướt qua với Laura ở phía bánh xe."
                    },
                    {
                        "en": "Do you want to take the wheel (= drive) now?",
                        "vi": "Bạn có muốn cầm lái (= lái xe) ngay bây giờ không?"
                    },
                    {
                        "en": "She fell asleep at the wheel and crashed into a tree.",
                        "vi": "Cô ấy ngủ quên ở tay lái và đâm vào một cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a car",
                    "vi": "xe hơi"
                },
                "examples": [
                    {
                        "en": "At last he had his own wheels.",
                        "vi": "Cuối cùng thì anh ấy cũng có bánh xe của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat, round part in a machine",
                    "vi": "một bộ phận tròn, phẳng trong máy"
                },
                "examples": [
                    {
                        "en": "gear wheels",
                        "vi": "bánh răng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a system that seems to work like a complicated machine that is difficult to understand",
                    "vi": "một tổ chức hoặc một hệ thống dường như hoạt động như một cỗ máy phức tạp khó hiểu"
                },
                "examples": [
                    {
                        "en": "the wheels of bureaucracy/commerce/government",
                        "vi": "bánh xe của bộ máy quan liêu / thương mại / chính phủ"
                    },
                    {
                        "en": "It was Rob's idea. I merely set the wheels in motion (= started the process).",
                        "vi": "Đó là ý tưởng của Rob. Tôi chỉ đơn thuần đặt các bánh xe chuyển động (= bắt đầu quá trình)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the number or type of wheels mentioned",
                    "vi": "có số lượng hoặc loại bánh xe được đề cập"
                },
                "examples": [
                    {
                        "en": "a sixteen-wheeled lorry",
                        "vi": "một chiếc xe tải mười sáu bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a car, bicycle, etc. with the number of wheels mentioned",
                    "vi": "một chiếc ô tô, xe đạp, v.v. với số bánh xe được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-wheeler",
                        "vi": "một chiếc xe ba bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to alow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để báo cho điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is a small part of a large organization",
                    "vi": "một người là một phần nhỏ của một tổ chức lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help something to happen easily and without problems, especially in business or politics",
                    "vi": "để giúp một điều gì đó xảy ra dễ dàng và không gặp vấn đề, đặc biệt là trong kinh doanh hoặc chính trị"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start working very hard at a particular task",
                    "vi": "bắt đầu làm việc rất chăm chỉ trong một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "Everyone is going to have to put their shoulder to the wheel.",
                        "vi": "Mọi người sẽ phải đặt vai của họ vào bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent somebody from putting their plans into operation",
                    "vi": "để ngăn chặn ai đó đưa kế hoạch của họ vào hoạt động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste time creating something that already exists and works well",
                    "vi": "lãng phí thời gian để tạo ra thứ gì đó đã tồn tại và hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "There’s no point in us reinventing the wheel.",
                        "vi": "Không có ích gì khi chúng tôi phát minh lại bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that is difficult to understand because it involves complicated or secret processes and decisions",
                    "vi": "một tình huống khó hiểu vì nó liên quan đến các quá trình và quyết định phức tạp hoặc bí mật"
                },
                "examples": [
                    {
                        "en": "There are wheels within wheels in this organization—you never really know what is going on.",
                        "vi": "Có những bánh xe trong bánh xe trong tổ chức này — bạn không bao giờ thực sự biết điều gì đang xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "ff177ec86af84a7c956ef92dd331aaf4",
        "word": "battery",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbætri/",
            "us": "/ˈbætəri/"
        },
        "nearby": [
            {
                "word": "Battersea Dogs & Cats Home",
                "pos": ""
            },
            {
                "word": "Battersea Power Station",
                "pos": ""
            },
            {
                "word": "battery",
                "pos": "noun"
            },
            {
                "word": "battery farm",
                "pos": "noun"
            },
            {
                "word": "battery farming",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that is placed inside a car engine, clock, radio, etc. and that produces the electricity that makes it work",
                    "vi": "một thiết bị được đặt bên trong động cơ ô tô, đồng hồ, radio, v.v. và tạo ra điện để làm cho nó hoạt động"
                },
                "examples": [
                    {
                        "en": "to replace the batteries",
                        "vi": "thay pin"
                    },
                    {
                        "en": "a rechargeable battery",
                        "vi": "pin có thể sạc lại"
                    },
                    {
                        "en": "battery-powered/-operated",
                        "vi": "chạy bằng pin / vận hành"
                    },
                    {
                        "en": "a car battery",
                        "vi": "ắc quy ô tô"
                    },
                    {
                        "en": "The battery is flat (= it is no longer producing electricity).",
                        "vi": "Pin bị chai (= nó không còn sản xuất điện nữa)."
                    },
                    {
                        "en": "With our product you get longer battery life.",
                        "vi": "Với sản phẩm của chúng tôi, bạn sẽ có thời lượng pin lâu hơn."
                    },
                    {
                        "en": "The bicycle even has a built-in battery charger for a mobile phone.",
                        "vi": "Chiếc xe đạp thậm chí còn được tích hợp bộ sạc pin cho điện thoại di động."
                    },
                    {
                        "en": "Isolated farms used wind turbines to charge batteries.",
                        "vi": "Các trang trại biệt lập đã sử dụng tuabin gió để sạc pin."
                    },
                    {
                        "en": "a lithium/AA battery",
                        "vi": "một pin lithium / AA"
                    }
                ]
            },
            {
                "define": {
                    "en": "electrical power that comes from a battery",
                    "vi": "năng lượng điện đến từ pin"
                },
                "examples": [
                    {
                        "en": "My phone ran out of battery, so I plugged it in to charge.",
                        "vi": "Điện thoại của tôi hết pin nên tôi cắm sạc."
                    },
                    {
                        "en": "The display tells you how much battery is left.",
                        "vi": "Màn hình cho bạn biết lượng pin còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of things or people of the same type",
                    "vi": "một số lượng lớn những thứ hoặc những người cùng loại"
                },
                "examples": [
                    {
                        "en": "He faced a battery of questions.",
                        "vi": "Anh ta phải đối mặt với một loạt câu hỏi."
                    },
                    {
                        "en": "a battery of reporters",
                        "vi": "một loạt phóng viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of large guns that are used together",
                    "vi": "một số loại súng lớn được sử dụng cùng nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large number of small cages that are joined together and are used for keeping chickens, etc. in on a farm",
                    "vi": "một số lượng lớn các lồng nhỏ được ghép lại với nhau và được sử dụng để nuôi gà, v.v. trong một trang trại"
                },
                "examples": [
                    {
                        "en": "a battery hen",
                        "vi": "một con gà mái pin"
                    },
                    {
                        "en": "battery eggs",
                        "vi": "trứng pin"
                    },
                    {
                        "en": "intensive battery farming methods",
                        "vi": "phương pháp thâm canh pin"
                    }
                ]
            },
            {
                "define": {
                    "en": "the crime of attacking somebody physically",
                    "vi": "tội tấn công ai đó về thể chất"
                },
                "examples": [
                    {
                        "en": "He was charged with battery after a fight at a night club.",
                        "vi": "Anh ta đã bị sạc pin sau khi đánh nhau tại một câu lạc bộ đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back your strength and energy by resting for a while",
                    "vi": "để lấy lại sức lực và năng lượng của bạn bằng cách nghỉ ngơi một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a677798de2474f3cb5108d2feb3c640f",
        "word": "car seat",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɑː siːt/",
            "us": "/ˈkɑːr siːt/"
        },
        "nearby": [
            {
                "word": "carry-over",
                "pos": "noun"
            },
            {
                "word": "carry through",
                "pos": "phrasal verb"
            },
            {
                "word": "car seat",
                "pos": "noun"
            },
            {
                "word": "carsick",
                "pos": "adjective"
            },
            {
                "word": "carsickness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special safety seat for a child that can be fitted into a car",
                    "vi": "ghế an toàn đặc biệt cho trẻ em có thể lắp vào ô tô"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a seat in a car",
                    "vi": "ghế trong ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8fc3e06837c04236a129b517a3bf137e",
        "word": "passenger seat",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpæsɪndʒə siːt/",
            "us": "/ˈpæsɪndʒər siːt/"
        },
        "nearby": [
            {
                "word": "passé",
                "pos": "adjective"
            },
            {
                "word": "passenger",
                "pos": "noun"
            },
            {
                "word": "passenger seat",
                "pos": "noun"
            },
            {
                "word": "passer-by",
                "pos": "noun"
            },
            {
                "word": "pass-fail",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the seat in a car which is next to the driver’s seat",
                    "vi": "ghế trong ô tô cạnh ghế lái xe"
                },
                "examples": [
                    {
                        "en": "the front passenger seat",
                        "vi": "ghế hành khách phía trước"
                    }
                ]
            }
        ]
    },
    {
        "id": "f50119d05de14cb49f9da91a5fa0b989",
        "word": "safety belt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈseɪfti belt/",
            "us": "/ˈseɪfti belt/"
        },
        "nearby": [
            {
                "word": "safe space",
                "pos": "noun"
            },
            {
                "word": "safety",
                "pos": "noun"
            },
            {
                "word": "safety belt",
                "pos": "noun"
            },
            {
                "word": "safety catch",
                "pos": "noun"
            },
            {
                "word": "safety curtain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt that is attached to the seat in a car or a plane and that you fasten around yourself so that you are not thrown out of the seat if there is an accident",
                    "vi": "dây đai được gắn vào ghế trên ô tô hoặc máy bay và bạn buộc chặt quanh mình để không bị văng ra khỏi ghế nếu có tai nạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f8742b0061d348878ecb7050fa746043",
        "word": "seat belt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːt belt/",
            "us": "/ˈsiːt belt/"
        },
        "nearby": [
            {
                "word": "seat",
                "pos": "noun"
            },
            {
                "word": "seat",
                "pos": "verb"
            },
            {
                "word": "seat belt",
                "pos": "noun"
            },
            {
                "word": "seating",
                "pos": "noun"
            },
            {
                "word": "seatmate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt that is attached to the seat in a car or plane and that you fasten around yourself so that you are not thrown out of the seat if there is an accident",
                    "vi": "dây đai được gắn vào ghế trên ô tô hoặc máy bay và bạn buộc chặt quanh mình để không bị văng ra khỏi ghế nếu có tai nạn"
                },
                "examples": [
                    {
                        "en": "Fasten your seat belts.",
                        "vi": "Buộc chặt dây an toàn của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e8596eb0bda4bb68d42f19da0f6edaf",
        "word": "tire",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtaɪə(r)/",
            "us": "/ˈtaɪər/"
        },
        "nearby": [
            {
                "word": "tiramisu",
                "pos": "noun"
            },
            {
                "word": "tire",
                "pos": "verb"
            },
            {
                "word": "tire",
                "pos": "noun"
            },
            {
                "word": "tired",
                "pos": "adjective"
            },
            {
                "word": "tiredly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick rubber ring that fits around the edge of a wheel of a car, bicycle, etc.",
                    "vi": "một vòng cao su dày vừa khít với mép bánh xe ô tô, xe đạp, v.v."
                },
                "examples": [
                    {
                        "en": "a front/rear tire",
                        "vi": "một lốp trước / sau"
                    },
                    {
                        "en": "to pump up a tire",
                        "vi": "bơm lốp xe"
                    },
                    {
                        "en": "a flat tire",
                        "vi": "một chiếc lốp xe bị xẹp"
                    },
                    {
                        "en": "a burst/punctured tire",
                        "vi": "một chiếc lốp bị nổ / thủng"
                    },
                    {
                        "en": "bald/worn tires",
                        "vi": "hói / lốp mòn"
                    },
                    {
                        "en": "Someone had slashed the tires on her car.",
                        "vi": "Ai đó đã rạch lốp xe của cô."
                    },
                    {
                        "en": "He drove off with a screech of tires.",
                        "vi": "Anh ta lái xe đi với một tiếng rít của lốp xe."
                    },
                    {
                        "en": "Remember to check your tire pressure regularly.",
                        "vi": "Nhớ kiểm tra áp suất lốp thường xuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to test the quality of something to see whether it is suitable for you before you buy it",
                    "vi": "để kiểm tra chất lượng của thứ gì đó để xem liệu nó có phù hợp với bạn hay không trước khi bạn mua nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e7c8ed2a759a4c7f9898377970b60443",
        "word": "tyre",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtaɪə(r)/",
            "us": "/ˈtaɪər/"
        },
        "nearby": [
            {
                "word": "tyranny",
                "pos": "noun"
            },
            {
                "word": "tyrant",
                "pos": "noun"
            },
            {
                "word": "tyre",
                "pos": "noun"
            },
            {
                "word": "tyro",
                "pos": "noun"
            },
            {
                "word": "tzar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick rubber ring that fits around the edge of a wheel of a car, bicycle, etc.",
                    "vi": "một vòng cao su dày vừa khít với mép bánh xe ô tô, xe đạp, v.v."
                },
                "examples": [
                    {
                        "en": "a front/rear tyre",
                        "vi": "một lốp trước / sau"
                    },
                    {
                        "en": "to pump up a tyre",
                        "vi": "bơm lốp xe"
                    },
                    {
                        "en": "a flat tyre",
                        "vi": "một lốp xe bị xì hơi"
                    },
                    {
                        "en": "Someone had slashed the tyres on her car.",
                        "vi": "Ai đó đã rạch lốp xe của cô."
                    },
                    {
                        "en": "Remember to check your tyre pressure regularly.",
                        "vi": "Nhớ kiểm tra áp suất lốp thường xuyên."
                    },
                    {
                        "en": "a burst/punctured tyre",
                        "vi": "một chiếc lốp bị nổ / thủng"
                    },
                    {
                        "en": "bald/worn tyres",
                        "vi": "hói / lốp mòn"
                    },
                    {
                        "en": "car/bicycle tyres",
                        "vi": "lốp ô tô / xe đạp"
                    },
                    {
                        "en": "He drove off with a screech of tyres.",
                        "vi": "Anh ta lái xe đi với một tiếng rít của lốp xe."
                    },
                    {
                        "en": "I need him to show me how to change a tyre.",
                        "vi": "Tôi cần anh ấy chỉ cho tôi cách thay lốp xe."
                    },
                    {
                        "en": "Keeping your tyres inflated to the proper pressure can improve mileage.",
                        "vi": "Giữ cho lốp xe của bạn được bơm căng ở áp suất thích hợp có thể cải thiện quãng đường đi được."
                    }
                ]
            },
            {
                "define": {
                    "en": "to test the quality of something to see whether it is suitable for you before you buy it",
                    "vi": "để kiểm tra chất lượng của thứ gì đó để xem liệu nó có phù hợp với bạn hay không trước khi bạn mua nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "888ecae6bf5d45c49a65fc52ae8e44c6",
        "word": "air-conditioned",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeə kəndɪʃnd/",
            "us": "/ˈer kəndɪʃnd/"
        },
        "nearby": [
            {
                "word": "air chief marshal",
                "pos": "noun"
            },
            {
                "word": "air commodore",
                "pos": "noun"
            },
            {
                "word": "air-conditioned",
                "pos": "adjective"
            },
            {
                "word": "air conditioner",
                "pos": "noun"
            },
            {
                "word": "air conditioning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a system that cools and dries the air inside it",
                    "vi": "có một hệ thống làm mát và làm khô không khí bên trong nó"
                },
                "examples": [
                    {
                        "en": "air-conditioned offices",
                        "vi": "văn phòng máy lạnh"
                    },
                    {
                        "en": "The restaurant is fully air-conditioned.",
                        "vi": "Nhà hàng được lắp máy lạnh đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "d97b4ef76c6948c3a4fcf6026669df52",
        "word": "air conditioning",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeə kəndɪʃənɪŋ/",
            "us": "/ˈer kəndɪʃənɪŋ/"
        },
        "nearby": [
            {
                "word": "air-conditioned",
                "pos": "adjective"
            },
            {
                "word": "air conditioner",
                "pos": "noun"
            },
            {
                "word": "air conditioning",
                "pos": "noun"
            },
            {
                "word": "air-cooled",
                "pos": "adjective"
            },
            {
                "word": "air cooler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that cools and dries the air in a building or car",
                    "vi": "một hệ thống làm mát và làm khô không khí trong một tòa nhà hoặc ô tô"
                },
                "examples": [
                    {
                        "en": "Is the air conditioning on?",
                        "vi": "Máy lạnh có bật không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "5de96a9042c9418296a341afb2fe4b99",
        "word": "biofuel",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbaɪəʊfjuːəl/",
            "us": "/ˈbaɪəʊfjuːəl/"
        },
        "nearby": [
            {
                "word": "bioethics",
                "pos": "noun"
            },
            {
                "word": "biofeedback",
                "pos": "noun"
            },
            {
                "word": "biofuel",
                "pos": "noun"
            },
            {
                "word": "biogas",
                "pos": "noun"
            },
            {
                "word": "biographer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fuel made from plant or animal sources and used in engines",
                    "vi": "nhiên liệu làm từ nguồn thực vật hoặc động vật và được sử dụng trong động cơ"
                },
                "examples": [
                    {
                        "en": "biofuels made from sugar cane and sugar beet",
                        "vi": "nhiên liệu sinh học làm từ mía và củ cải đường"
                    },
                    {
                        "en": "energy from biofuel sources",
                        "vi": "năng lượng từ các nguồn nhiên liệu sinh học"
                    }
                ]
            }
        ]
    },
    {
        "id": "d32549a906954153a0d9fbf672d8a8de",
        "word": "body",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɒdi/",
            "us": "/ˈbɑːdi/"
        },
        "nearby": [
            {
                "word": "the Bodleian Library",
                "pos": ""
            },
            {
                "word": "Bodmin Moor",
                "pos": ""
            },
            {
                "word": "body",
                "pos": "noun"
            },
            {
                "word": "body armour",
                "pos": "noun"
            },
            {
                "word": "body bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the whole physical structure of a human or an animal",
                    "vi": "toàn bộ cấu trúc vật chất của con người hoặc động vật"
                },
                "examples": [
                    {
                        "en": "The human body is a complex structure.",
                        "vi": "Cơ thể con người là một cấu trúc phức tạp."
                    },
                    {
                        "en": "a male/female/naked body",
                        "vi": "một cơ thể nam / nữ / khỏa thân"
                    },
                    {
                        "en": "The virus can affect all parts of the body.",
                        "vi": "Virus có thể ảnh hưởng đến tất cả các bộ phận của cơ thể."
                    },
                    {
                        "en": "The heart pumps blood around the body.",
                        "vi": "Tim bơm máu đi khắp cơ thể."
                    },
                    {
                        "en": "His whole body was trembling.",
                        "vi": "Toàn thân anh đang run rẩy."
                    },
                    {
                        "en": "body fat/weight/temperature/size",
                        "vi": "mỡ cơ thể / trọng lượng / nhiệt độ / kích thước"
                    },
                    {
                        "en": "Yoga is designed to release the body and mind from tension.",
                        "vi": "Yoga được thiết kế để giải phóng cơ thể và tâm trí khỏi căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main part of a body not including the head, or not including the head, arms and legs",
                    "vi": "phần chính của cơ thể không bao gồm đầu hoặc không bao gồm đầu, tay và chân"
                },
                "examples": [
                    {
                        "en": "She had injuries to her head and body.",
                        "vi": "Cô bị thương ở đầu và cơ thể."
                    },
                    {
                        "en": "He has a large body, but thin legs.",
                        "vi": "Anh ta có một thân hình to lớn, nhưng đôi chân mỏng."
                    },
                    {
                        "en": "These exercises help develop your upper body.",
                        "vi": "Các bài tập này giúp phát triển phần thân trên của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the body of a dead person or animal",
                    "vi": "xác của một người hoặc động vật đã chết"
                },
                "examples": [
                    {
                        "en": "a dead body",
                        "vi": "một xác chết"
                    },
                    {
                        "en": "The family of the missing girl has been called in by the police to identify the body.",
                        "vi": "Gia đình của cô gái mất tích đã được cảnh sát gọi đến để xác định danh tính."
                    },
                    {
                        "en": "A man's body was found floating in the river.",
                        "vi": "Thi thể một người đàn ông được tìm thấy trôi trên sông."
                    },
                    {
                        "en": "His body is being brought back to his home town for burial.",
                        "vi": "Thi thể anh đang được gia đình đưa về quê an táng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main part of something, especially a building, a vehicle or a book, an article, etc.",
                    "vi": "phần chính của một cái gì đó, đặc biệt là một tòa nhà, một chiếc xe hoặc một cuốn sách, một bài báo, v.v."
                },
                "examples": [
                    {
                        "en": "the body of a plane (= the central part where the seats are)",
                        "vi": "thân máy bay (= phần trung tâm nơi có ghế ngồi)"
                    },
                    {
                        "en": "the main body of the text",
                        "vi": "phần chính của văn bản"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who work or act together, often for an official purpose, or who are connected in some other way",
                    "vi": "một nhóm người làm việc hoặc hành động cùng nhau, thường vì mục đích chính thức, hoặc những người được kết nối theo một số cách khác"
                },
                "examples": [
                    {
                        "en": "a regulatory/an advisory body",
                        "vi": "một cơ quan quản lý / một cơ quan tư vấn"
                    },
                    {
                        "en": "The governing body of the school is/are concerned about discipline.",
                        "vi": "Cơ quan quản lý của trường là / quan tâm đến kỷ luật."
                    },
                    {
                        "en": "recognized professional bodies such as the Law Association",
                        "vi": "các cơ quan chuyên môn được công nhận như Hiệp hội Luật sư"
                    },
                    {
                        "en": "An independent body has been set up to investigate the affair.",
                        "vi": "Một cơ quan độc lập đã được thành lập để điều tra vụ việc."
                    },
                    {
                        "en": "body of somebody A large body of people will be affected by the tax cuts.",
                        "vi": "cơ thể của ai đó Một lượng lớn người sẽ bị ảnh hưởng bởi việc cắt giảm thuế."
                    },
                    {
                        "en": "in a body The protesters marched in a body (= all together) to the White House.",
                        "vi": "trong một cơ thể Những người biểu tình đã diễu hành trong một cơ thể (= tất cả cùng nhau) đến Nhà Trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount or collection of something",
                    "vi": "một số lượng lớn hoặc bộ sưu tập của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a vast body of evidence/information/research",
                        "vi": "một lượng lớn bằng chứng / thông tin / nghiên cứu"
                    },
                    {
                        "en": "large bodies of water (= lakes or seas)",
                        "vi": "các vùng nước lớn (= hồ hoặc biển)"
                    },
                    {
                        "en": "There is a powerful body of opinion against the ruling.",
                        "vi": "Có một cơ quan quan điểm mạnh mẽ chống lại phán quyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object",
                    "vi": "một đối tượng"
                },
                "examples": [
                    {
                        "en": "heavenly bodies (= stars, planets, etc.)",
                        "vi": "các thiên thể (= các ngôi sao, hành tinh, v.v.)"
                    },
                    {
                        "en": "an operation to remove a foreign body (= something that would not usually be there) from a wound",
                        "vi": "phẫu thuật lấy dị vật (= thứ thường không có ở đó) khỏi vết thương"
                    }
                ]
            },
            {
                "define": {
                    "en": "the full strong taste of alcoholic drinks or the thick healthy quality of somebody’s hair",
                    "vi": "hương vị mạnh mẽ đầy đủ của đồ uống có cồn hoặc chất lượng dày khỏe của mái tóc của ai đó"
                },
                "examples": [
                    {
                        "en": "a wine with plenty of body",
                        "vi": "một loại rượu với nhiều cơ thể"
                    },
                    {
                        "en": "Regular use of conditioner is supposed to give your hair more body.",
                        "vi": "Việc sử dụng dầu xả thường xuyên được cho là sẽ cung cấp cho mái tóc của bạn nhiều hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of body mentioned",
                    "vi": "có loại cơ thể được đề cập"
                },
                "examples": [
                    {
                        "en": "full-bodied red wines",
                        "vi": "rượu vang đỏ toàn thân"
                    },
                    {
                        "en": "soft-bodied insects",
                        "vi": "côn trùng thân mềm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing which fits tightly over a woman’s upper body and bottom, usually fastening between the legs",
                    "vi": "một bộ quần áo bó sát cơ thể trên và dưới của phụ nữ, thường buộc chặt giữa hai chân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with all your energy",
                    "vi": "với tất cả năng lượng của bạn"
                },
                "examples": [
                    {
                        "en": "She committed herself body and soul to fighting for the cause.",
                        "vi": "Cô ấy đã cam kết cả thể xác và linh hồn để chiến đấu vì chính nghĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay alive with just enough of the food, clothing, etc. that you need",
                    "vi": "sống sót chỉ với đủ thức ăn, quần áo, v.v. mà bạn cần"
                },
                "examples": [
                    {
                        "en": "They barely have enough money to keep body and soul together.",
                        "vi": "Họ hầu như không có đủ tiền để giữ thể xác và linh hồn bên nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have none of the quality mentioned",
                    "vi": "không có chất lượng được đề cập"
                },
                "examples": [
                    {
                        "en": "She was honest and hard-working, and didn't have an unkind bone in her body.",
                        "vi": "Cô ấy thật thà và chăm chỉ, không có một mảnh xương xẩu trong người."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are strongly opposed to something",
                    "vi": "được sử dụng để cho thấy bạn phản đối mạnh mẽ điều gì đó"
                },
                "examples": [
                    {
                        "en": "She moves into our home over my dead body.",
                        "vi": "Cô ấy chuyển đến nhà của chúng tôi trên xác chết của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have sex with somebody in exchange for money",
                    "vi": "quan hệ tình dục với ai đó để đổi lấy tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56c64475d40d49d9ba4d9b321e08f440",
        "word": "brake",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/breɪk/",
            "us": "/breɪk/"
        },
        "nearby": [
            {
                "word": "braise",
                "pos": "verb"
            },
            {
                "word": "brak",
                "pos": "adjective"
            },
            {
                "word": "brake",
                "pos": "noun"
            },
            {
                "word": "brake",
                "pos": "verb"
            },
            {
                "word": "brake fluid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device for slowing or stopping a vehicle",
                    "vi": "một thiết bị để làm chậm hoặc dừng một chiếc xe"
                },
                "examples": [
                    {
                        "en": "to put/slam on the brakes",
                        "vi": "đặt / hãm phanh"
                    },
                    {
                        "en": "the brake pedal",
                        "vi": "bàn đạp phanh"
                    },
                    {
                        "en": "She stopped with a squeal/screech of the brakes.",
                        "vi": "Cô ấy dừng lại với một tiếng kêu / tiếng rít của phanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that stops something or makes it difficult",
                    "vi": "một điều gì đó ngăn cản điều gì đó hoặc gây khó khăn"
                },
                "examples": [
                    {
                        "en": "High interest rates are a brake on the economy.",
                        "vi": "Lãi suất cao là một lực hãm nền kinh tế."
                    },
                    {
                        "en": "The need to earn some money put the brakes on my wilder ambitions.",
                        "vi": "Nhu cầu kiếm được một số tiền đã kìm hãm những tham vọng hoang dã của tôi."
                    },
                    {
                        "en": "High interest rates will act as a brake on the economy.",
                        "vi": "Lãi suất cao sẽ đóng vai trò như một cái phanh đối với nền kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate the brakes on a vehicle suddenly and with force",
                    "vi": "điều khiển phanh xe đột ngột và có lực"
                },
                "examples": [
                    {
                        "en": "The car skidded as he jammed on the brakes.",
                        "vi": "Chiếc xe trượt đi khi anh ta phanh gấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "753fcc079a1e40ca910928d57ca6457d",
        "word": "brake light",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbreɪk laɪt/",
            "us": "/ˈbreɪk laɪt/"
        },
        "nearby": [
            {
                "word": "brake",
                "pos": "verb"
            },
            {
                "word": "brake fluid",
                "pos": "noun"
            },
            {
                "word": "brake light",
                "pos": "noun"
            },
            {
                "word": "brake pad",
                "pos": "noun"
            },
            {
                "word": "bramble",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a red light on the back of a vehicle that comes on when the brakes are used",
                    "vi": "đèn đỏ ở phía sau của một chiếc xe được phanh khi sử dụng phanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d8c013cfc98446e8d49a9a0768bc598",
        "word": "GPS",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌdʒiː piː ˈes/",
            "us": "/ˌdʒiː piː ˈes/"
        },
        "nearby": [
            {
                "word": "the GPO",
                "pos": ""
            },
            {
                "word": "GPRS",
                "pos": "abbreviation"
            },
            {
                "word": "GPS",
                "pos": "noun"
            },
            {
                "word": "GPU",
                "pos": "abbreviation"
            },
            {
                "word": "GQ",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system by which signals are sent from satellites to a special device, used to show the position of a person or thing on the surface of the earth very accurately (the abbreviation for ‘global positioning system’)",
                    "vi": "một hệ thống mà tín hiệu được gửi từ vệ tinh đến một thiết bị đặc biệt, được sử dụng để hiển thị vị trí của người hoặc vật trên bề mặt trái đất rất chính xác (viết tắt của 'hệ thống định vị toàn cầu')"
                },
                "examples": [
                    {
                        "en": "The drivers all have GPS in the van.",
                        "vi": "Các tài xế đều có GPS trong xe."
                    },
                    {
                        "en": "She switched on the GPS system before she left the airport.",
                        "vi": "Cô bật hệ thống GPS trước khi rời sân bay."
                    }
                ]
            }
        ]
    },
    {
        "id": "5b9f090c21a94cb0808a392622c005bf",
        "word": "legroom",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈleɡruːm/",
            "us": "/ˈleɡruːm/"
        },
        "nearby": [
            {
                "word": "Legoland",
                "pos": ""
            },
            {
                "word": "leg-pull",
                "pos": "noun"
            },
            {
                "word": "legroom",
                "pos": "noun"
            },
            {
                "word": "legume",
                "pos": "noun"
            },
            {
                "word": "leguminous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of space available for your legs when you are sitting in a car, plane, theatre, etc.",
                    "vi": "khoảng không gian dành cho đôi chân của bạn khi bạn ngồi trên ô tô, máy bay, rạp hát, v.v."
                },
                "examples": [
                    {
                        "en": "There’s not much legroom in the front of the car.",
                        "vi": "Không có nhiều chỗ để chân ở phía trước của xe."
                    },
                    {
                        "en": "The seats are comfortable, but there’s very little legroom.",
                        "vi": "Ghế ngồi thoải mái, nhưng có rất ít chỗ để chân."
                    }
                ]
            }
        ]
    },
    {
        "id": "4f67785084f444a997daebe923c457a0",
        "word": "license number",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlaɪsns nʌmbə(r)/",
            "us": "/ˈlaɪsns nʌmbər/"
        },
        "nearby": [
            {
                "word": "licensed victualler",
                "pos": "noun"
            },
            {
                "word": "licensee",
                "pos": "noun"
            },
            {
                "word": "license number",
                "pos": "noun"
            },
            {
                "word": "license plate",
                "pos": "noun"
            },
            {
                "word": "licensing laws",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the series of letters and numbers that are shown on a license plate at the front and back of a vehicle to identify it",
                    "vi": "một loạt các chữ cái và số được hiển thị trên biển số xe ở phía trước và phía sau của một chiếc xe để xác định nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "46b60ecaa2ee4ab4a2c5d2bee2ada041",
        "word": "satnav",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsætnæv/",
            "us": "/ˈsætnæv/"
        },
        "nearby": [
            {
                "word": "satisfying",
                "pos": "adjective"
            },
            {
                "word": "satisfyingly",
                "pos": "adverb"
            },
            {
                "word": "satnav",
                "pos": "noun"
            },
            {
                "word": "satsang",
                "pos": "noun"
            },
            {
                "word": "satsuma",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer system that uses information obtained from satellites to guide the driver of a vehicle (the abbreviation for ‘satellite navigation’)",
                    "vi": "một hệ thống máy tính sử dụng thông tin thu được từ vệ tinh để hướng dẫn người điều khiển phương tiện (viết tắt của 'định vị vệ tinh')"
                },
                "examples": [
                    {
                        "en": "The drivers all have satnav in the van.",
                        "vi": "Các tài xế đều có satnav trong xe."
                    },
                    {
                        "en": "She switched on the satnav system before she left the airport.",
                        "vi": "Cô bật hệ thống satnav trước khi rời sân bay."
                    },
                    {
                        "en": "This satnav is very easy to use.",
                        "vi": "Satnav này rất dễ sử dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "58627dd64a5345b59a85539525705d91",
        "word": "tank",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/tæŋk/",
            "us": "/tæŋk/"
        },
        "nearby": [
            {
                "word": "tangram",
                "pos": "noun"
            },
            {
                "word": "tangy",
                "pos": "adjective"
            },
            {
                "word": "tank",
                "pos": "noun"
            },
            {
                "word": "tank",
                "pos": "verb"
            },
            {
                "word": "tankard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large container for holding liquid or gas",
                    "vi": "một thùng chứa lớn để chứa chất lỏng hoặc khí"
                },
                "examples": [
                    {
                        "en": "a fuel/water/storage tank",
                        "vi": "một bể chứa nhiên liệu / nước /"
                    },
                    {
                        "en": "a fish tank (= for keeping fish in)",
                        "vi": "bể cá (= để nuôi cá)"
                    },
                    {
                        "en": "I filled the petrol tank before I set off on my journey.",
                        "vi": "Tôi đổ đầy bình xăng trước khi lên đường."
                    },
                    {
                        "en": "(North American English) the gas tank",
                        "vi": "(Tiếng Anh Bắc Mỹ) cái bình xăng"
                    },
                    {
                        "en": "He uses an oxygen tank to breathe.",
                        "vi": "Anh ta sử dụng bình dưỡng khí để thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "the contents of a tank or the amount it will hold",
                    "vi": "nội dung của một bể hoặc số lượng nó sẽ chứa"
                },
                "examples": [
                    {
                        "en": "We drove there and back on one tank of fuel.",
                        "vi": "Chúng tôi lái xe đến đó và quay lại trên một thùng nhiên liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a military vehicle covered with strong metal and armed with guns. It can travel over very rough ground using wheels that move inside metal belts.",
                    "vi": "một chiếc xe quân sự được bọc bằng kim loại chắc chắn và được trang bị súng. Nó có thể di chuyển trên mặt đất rất gồ ghề bằng cách sử dụng các bánh xe di chuyển bên trong các đai kim loại."
                },
                "examples": [
                    {
                        "en": "Tanks rolled in to end the siege.",
                        "vi": "Xe tăng lăn bánh để kết thúc cuộc vây hãm."
                    },
                    {
                        "en": "He's six feet tall and built like a tank (= has a solid, strong body).",
                        "vi": "Anh ấy cao 6 mét và xây như một chiếc xe tăng (= có một cơ thể rắn chắc và mạnh mẽ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial pool, lake or reservoir",
                    "vi": "một hồ bơi nhân tạo, hồ hoặc hồ chứa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a8a47f1bc98147e5abbf28555068d38d",
        "word": "turn signal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtɜːn sɪɡnəl/",
            "us": "/ˈtɜːrn sɪɡnəl/"
        },
        "nearby": [
            {
                "word": "turn round",
                "pos": "phrasal verb"
            },
            {
                "word": "turnround",
                "pos": "noun"
            },
            {
                "word": "turn signal",
                "pos": "noun"
            },
            {
                "word": "turnstile",
                "pos": "noun"
            },
            {
                "word": "turntable",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a light on a vehicle that flashes to show that the vehicle is going to turn left or right",
                    "vi": "đèn trên xe nhấp nháy để cho biết xe sắp rẽ trái hoặc phải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "63f4216f7e2a474999845d0748514dc5",
        "word": "accelerator",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əkˈseləreɪtə(r)/",
            "us": "/əkˈseləreɪtər/"
        },
        "nearby": [
            {
                "word": "accelerate",
                "pos": "verb"
            },
            {
                "word": "acceleration",
                "pos": "noun"
            },
            {
                "word": "accelerator",
                "pos": "noun"
            },
            {
                "word": "accelerator board",
                "pos": "noun"
            },
            {
                "word": "accelerometer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pedal in a car or other vehicle that you press with your foot to control the speed of the engine",
                    "vi": "bàn đạp trên ô tô hoặc phương tiện khác mà bạn nhấn bằng chân để điều khiển tốc độ của động cơ"
                },
                "examples": [
                    {
                        "en": "She put her foot on the accelerator and we sped through the traffic lights.",
                        "vi": "Cô ấy đặt chân lên ga và chúng tôi phóng nhanh qua đèn giao thông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine for making elementary particles move at high speeds",
                    "vi": "một máy làm cho các hạt cơ bản chuyển động với tốc độ cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "301c3dea2d58491298101b9aac67c40d",
        "word": "axle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈæksl/",
            "us": "/ˈæksl/"
        },
        "nearby": [
            {
                "word": "axion",
                "pos": "noun"
            },
            {
                "word": "axis",
                "pos": "noun"
            },
            {
                "word": "axle",
                "pos": "noun"
            },
            {
                "word": "axman",
                "pos": "noun"
            },
            {
                "word": "Axminster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long straight piece of metal that connects a pair of wheels on a vehicle",
                    "vi": "một mảnh kim loại dài thẳng kết nối một cặp bánh xe trên xe"
                },
                "examples": [
                    {
                        "en": "the front/rear axle",
                        "vi": "trục trước / sau"
                    }
                ]
            }
        ]
    },
    {
        "id": "236521f4bd1a41ad8db1d43fed5f351f",
        "word": "dial",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdaɪəl/",
            "us": "/ˈdaɪəl/"
        },
        "nearby": [
            {
                "word": "diagrammatic",
                "pos": "adjective"
            },
            {
                "word": "diagrammatically",
                "pos": "adverb"
            },
            {
                "word": "dial",
                "pos": "noun"
            },
            {
                "word": "dial",
                "pos": "verb"
            },
            {
                "word": "dial down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the face of a clock or watch, or a similar control on a machine, piece of equipment or vehicle that shows a measurement of time, amount, speed, temperature, etc.",
                    "vi": "mặt đồng hồ hoặc đồng hồ đeo tay hoặc một điều khiển tương tự trên máy móc, thiết bị hoặc phương tiện hiển thị phép đo thời gian, lượng, tốc độ, nhiệt độ, v.v."
                },
                "examples": [
                    {
                        "en": "an alarm clock with a luminous dial",
                        "vi": "đồng hồ báo thức có mặt số dạ quang"
                    },
                    {
                        "en": "Check the tyre pressure on the dial.",
                        "vi": "Kiểm tra áp suất lốp trên mặt đồng hồ."
                    },
                    {
                        "en": "Set the dial for the number of copies required.",
                        "vi": "Đặt quay số cho số lượng bản sao cần thiết."
                    },
                    {
                        "en": "You can tune into our station at 1460 on the radio dial.",
                        "vi": "Bạn có thể dò đài của chúng tôi lúc 14 giờ 60 trên sóng radio."
                    }
                ]
            },
            {
                "define": {
                    "en": "the round control on a radio, cooker, etc. that you turn in order to change something, for example to choose a particular station or to choose a particular temperature",
                    "vi": "điều khiển vòng trên radio, nồi cơm điện, v.v. mà bạn xoay để thay đổi thứ gì đó, chẳng hạn như để chọn một đài cụ thể hoặc để chọn một nhiệt độ cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the round part on some older phones, with holes for the fingers, that you move around to call a particular number",
                    "vi": "phần tròn trên một số điện thoại cũ hơn, có lỗ cho ngón tay để bạn di chuyển xung quanh để gọi một số cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "88d5b296052e41cea254298799ebe1ea",
        "word": "diesel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdiːzl/",
            "us": "/ˈdiːzl/"
        },
        "nearby": [
            {
                "word": "die off",
                "pos": "phrasal verb"
            },
            {
                "word": "die out",
                "pos": "phrasal verb"
            },
            {
                "word": "diesel",
                "pos": "noun"
            },
            {
                "word": "diet",
                "pos": "noun"
            },
            {
                "word": "diet",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of heavy oil used as a fuel instead of petrol",
                    "vi": "một loại dầu nặng được sử dụng làm nhiên liệu thay vì xăng"
                },
                "examples": [
                    {
                        "en": "a diesel engine (= one that burns diesel)",
                        "vi": "một động cơ diesel (= một động cơ đốt cháy dầu diesel)"
                    },
                    {
                        "en": "diesel cars/locomotives/trains",
                        "vi": "ô tô / đầu máy / xe lửa diesel"
                    }
                ]
            },
            {
                "define": {
                    "en": "a vehicle that uses diesel fuel",
                    "vi": "một chiếc xe sử dụng nhiên liệu diesel"
                },
                "examples": [
                    {
                        "en": "Our new car is a diesel.",
                        "vi": "Chiếc xe mới của chúng tôi là động cơ diesel."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae767e0ce8cd4613ababb7825ce2bebc",
        "word": "electric",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈlektrɪk/",
            "us": "/ɪˈlektrɪk/"
        },
        "nearby": [
            {
                "word": "Electra complex",
                "pos": "noun"
            },
            {
                "word": "electric",
                "pos": "adjective"
            },
            {
                "word": "electric",
                "pos": "noun"
            },
            {
                "word": "electrical",
                "pos": "adjective"
            },
            {
                "word": "electrical engineer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of electrical wires in a house, car or machine",
                    "vi": "hệ thống dây điện trong nhà, xe hơi hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "There's a problem with the electrics.",
                        "vi": "Có vấn đề với điện."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to the supply of electricity to a building",
                    "vi": "được sử dụng để chỉ việc cung cấp điện cho một tòa nhà"
                },
                "examples": [
                    {
                        "en": "The electric will be off tomorrow.",
                        "vi": "Điện sẽ tắt vào ngày mai."
                    },
                    {
                        "en": "I've paid the electric (= the bill for the supply of electricity).",
                        "vi": "Tôi đã trả tiền điện (= hóa đơn cung cấp điện)."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e7e108a1e3247039d0bca3168c6b725",
        "word": "front end",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌfrʌnt ˈend/",
            "us": "/ˌfrʌnt ˈend/"
        },
        "nearby": [
            {
                "word": "front desk",
                "pos": "noun"
            },
            {
                "word": "front door",
                "pos": "noun"
            },
            {
                "word": "front end",
                "pos": "noun"
            },
            {
                "word": "front-end",
                "pos": "adjective"
            },
            {
                "word": "front-end loader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a car or other vehicle that faces forward",
                    "vi": "phần của ô tô hoặc phương tiện khác hướng về phía trước"
                },
                "examples": [
                    {
                        "en": "I could hear a crunching noise coming from the front end of the car.",
                        "vi": "Tôi có thể nghe thấy một tiếng động lạo xạo phát ra từ đầu xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a computer system that the user sees and uses directly",
                    "vi": "phần của hệ thống máy tính mà người dùng nhìn thấy và sử dụng trực tiếp"
                },
                "examples": [
                    {
                        "en": "One of our designers created the graphics for the front end of the website.",
                        "vi": "Một trong những nhà thiết kế của chúng tôi đã tạo ra đồ họa cho giao diện người dùng của trang web."
                    }
                ]
            },
            {
                "define": {
                    "en": "the first part of a process, period of time, etc.",
                    "vi": "phần đầu tiên của quy trình, khoảng thời gian, v.v."
                },
                "examples": [
                    {
                        "en": "We need to focus on the front end of the process.",
                        "vi": "Chúng ta cần tập trung vào phần trước của quy trình."
                    },
                    {
                        "en": "I’m spending two nights in Kyoto at the front end of the trip.",
                        "vi": "Tôi sẽ dành hai đêm ở Kyoto vào cuối chuyến đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "d340695211264e43b0e499f7526e1292",
        "word": "gas pedal",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡæs pedl/",
            "us": "/ˈɡæs pedl/"
        },
        "nearby": [
            {
                "word": "gasp",
                "pos": "verb"
            },
            {
                "word": "gasp",
                "pos": "noun"
            },
            {
                "word": "gas pedal",
                "pos": "noun"
            },
            {
                "word": "gas-permeable",
                "pos": "adjective"
            },
            {
                "word": "gas ring",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pedal in a car or other vehicle that you press with your foot to control the speed of the engine",
                    "vi": "bàn đạp trên ô tô hoặc phương tiện khác mà bạn nhấn bằng chân để điều khiển tốc độ của động cơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a5aa1bdc8dfb4e8dba43cc1b191f7588",
        "word": "gear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡɪə(r)/",
            "us": "/ɡɪr/"
        },
        "nearby": [
            {
                "word": "GDR",
                "pos": "abbreviation"
            },
            {
                "word": "GE",
                "pos": ""
            },
            {
                "word": "gear",
                "pos": "noun"
            },
            {
                "word": "gear",
                "pos": "verb"
            },
            {
                "word": "gearbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "equipment in a vehicle that changes the relation between engine speed (or pedal speed on a bicycle) and the speed of the wheels moving forwards or backwards",
                    "vi": "thiết bị trên xe làm thay đổi mối quan hệ giữa tốc độ động cơ (hoặc tốc độ bàn đạp trên xe đạp) và tốc độ của các bánh xe chuyển động tiến hoặc lùi"
                },
                "examples": [
                    {
                        "en": "Careless use of the clutch may damage the gears.",
                        "vi": "Việc sử dụng ly hợp bất cẩn có thể làm hỏng các bánh răng."
                    },
                    {
                        "en": "The car pulled up with a screech of brakes and a grinding of gears.",
                        "vi": "Chiếc xe kéo lên với tiếng phanh rít và bánh răng nghiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular position of the gears in a vehicle that gives a particular range of speed and power",
                    "vi": "một vị trí cụ thể của các bánh răng trong một chiếc xe cung cấp một phạm vi tốc độ và công suất cụ thể"
                },
                "examples": [
                    {
                        "en": "first/second, etc. gear",
                        "vi": "bánh răng thứ nhất / thứ hai, v.v."
                    },
                    {
                        "en": "reverse gear",
                        "vi": "số lùi"
                    },
                    {
                        "en": "low/high gear",
                        "vi": "bánh răng thấp / cao"
                    },
                    {
                        "en": "(British English) bottom/top gear",
                        "vi": "(Tiếng Anh Anh) bánh răng dưới cùng / trên cùng"
                    },
                    {
                        "en": "(British English) to change gear",
                        "vi": "(Tiếng Anh Anh) để thay đổi thiết bị"
                    },
                    {
                        "en": "(North American English) to shift gear",
                        "vi": "(Tiếng Anh Bắc Mỹ) để sang số"
                    },
                    {
                        "en": "in gear When parking on a hill, leave the car in gear.",
                        "vi": "vào số Khi đỗ xe trên đồi, hãy để xe ở số."
                    },
                    {
                        "en": "What gear are you in?",
                        "vi": "Bạn đang sử dụng thiết bị nào?"
                    },
                    {
                        "en": "He drove wildly, crashing through the gears like a maniac.",
                        "vi": "Anh ta lái xe một cách điên cuồng, đâm qua các bánh răng như một kẻ điên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the equipment or clothing needed for a particular activity",
                    "vi": "thiết bị hoặc quần áo cần thiết cho một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "climbing/fishing/sports gear",
                        "vi": "dụng cụ leo núi / câu cá / thể thao"
                    }
                ]
            },
            {
                "define": {
                    "en": "clothes",
                    "vi": "quần áo"
                },
                "examples": [
                    {
                        "en": "Her friends were all wearing the latest gear.",
                        "vi": "Bạn bè của cô ấy đều mặc đồ mới nhất."
                    },
                    {
                        "en": "She was the only one wearing expensive designer gear.",
                        "vi": "Cô ấy là người duy nhất mặc đồ hàng hiệu đắt tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the things that a person owns",
                    "vi": "những thứ mà một người sở hữu"
                },
                "examples": [
                    {
                        "en": "I've left all my gear at Dave's house.",
                        "vi": "Tôi đã để lại tất cả các thiết bị của mình ở nhà Dave."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine used for a particular purpose",
                    "vi": "một máy được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "lifting/towing/winding gear",
                        "vi": "bánh răng nâng / kéo / cuộn dây"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about the speed or effort involved in doing something",
                    "vi": "được sử dụng để nói về tốc độ hoặc nỗ lực liên quan đến việc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "(British English) The party organization is moving into top gear as the election approaches.",
                        "vi": "(Tiếng Anh Anh) Tổ chức đảng đang chuyển sang giai đoạn hàng đầu khi cuộc bầu cử đến gần."
                    },
                    {
                        "en": "(North American English) to move into high gear",
                        "vi": "(Tiếng Anh Bắc Mỹ) để chuyển sang thiết bị cao cấp"
                    },
                    {
                        "en": "Coming out of the final bend, the runner stepped up a gear to overtake the rest of the pack.",
                        "vi": "Ra khỏi khúc cua cuối cùng, người chạy tăng ga để vượt qua những người còn lại trong đoàn."
                    },
                    {
                        "en": "He found it hard to switch gears when he retired.",
                        "vi": "Anh ấy cảm thấy rất khó để chuyển số khi đã nghỉ hưu."
                    }
                ]
            },
            {
                "define": {
                    "en": "illegal drugs",
                    "vi": "ma túy bất hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to hurry",
                    "vi": "một cách thô lỗ để bảo ai đó hãy nhanh lên"
                },
                "examples": [
                    {
                        "en": "If you get your ass in gear, we can make it out of here tonight.",
                        "vi": "Nếu bạn chuẩn bị kỹ càng, chúng ta có thể ra khỏi đây tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start working, or to start something working, in an efficient way",
                    "vi": "để bắt đầu làm việc hoặc để bắt đầu một cái gì đó hoạt động, một cách hiệu quả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to become) out of control",
                    "vi": "(trở nên) mất kiểm soát"
                },
                "examples": [
                    {
                        "en": "She said nothing in case her temper slipped out of gear.",
                        "vi": "Cô ấy không nói gì trong trường hợp tính khí của cô ấy tuột dốc không phanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "08bb8705edf14a2c9bd8bb7460a6909f",
        "word": "handbrake",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhændbreɪk/",
            "us": "/ˈhændbreɪk/"
        },
        "nearby": [
            {
                "word": "handbill",
                "pos": "noun"
            },
            {
                "word": "handbook",
                "pos": "noun"
            },
            {
                "word": "handbrake",
                "pos": "noun"
            },
            {
                "word": "handbrake turn",
                "pos": "noun"
            },
            {
                "word": "handcart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a brake in a vehicle that is operated by hand, designed to be used when the vehicle has already stopped",
                    "vi": "phanh trên xe được vận hành bằng tay, được thiết kế để sử dụng khi xe đã dừng"
                },
                "examples": [
                    {
                        "en": "to put the handbrake on",
                        "vi": "để đặt phanh tay"
                    },
                    {
                        "en": "to take the handbrake off",
                        "vi": "tháo phanh tay"
                    },
                    {
                        "en": "Is the handbrake on?",
                        "vi": "Phanh tay có được bật không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "11e40aa4aae0448699053377196053d8",
        "word": "headlamp",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhedlæmp/",
            "us": "/ˈhedlæmp/"
        },
        "nearby": [
            {
                "word": "heading",
                "pos": "noun"
            },
            {
                "word": "Headingley",
                "pos": ""
            },
            {
                "word": "headlamp",
                "pos": "noun"
            },
            {
                "word": "headland",
                "pos": "noun"
            },
            {
                "word": "headless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large light, usually one of two, at the front of a vehicle; the beam from this light",
                    "vi": "một đèn lớn, thường là một trong hai, ở phía trước xe; chùm sáng từ ánh sáng này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "425d0a3938cb44b1900ab2e4bb24663b",
        "word": "headlight",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhedlaɪt/",
            "us": "/ˈhedlaɪt/"
        },
        "nearby": [
            {
                "word": "headland",
                "pos": "noun"
            },
            {
                "word": "headless",
                "pos": "adjective"
            },
            {
                "word": "headlight",
                "pos": "noun"
            },
            {
                "word": "headline",
                "pos": "noun"
            },
            {
                "word": "headline",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large light, usually one of two, at the front of a vehicle; the beam from this light",
                    "vi": "một đèn lớn, thường là một trong hai, ở phía trước xe; chùm sáng từ ánh sáng này"
                },
                "examples": [
                    {
                        "en": "He dipped his headlights (= directed the light downwards) for the oncoming traffic.",
                        "vi": "Anh ấy đã nhúng đèn pha của mình (= hướng ánh sáng xuống phía dưới) cho dòng xe cộ đang chạy tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "55a32c05b77d4347982ca9851bd1a50a",
        "word": "horn",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/hɔːn/",
            "us": "/hɔːrn/"
        },
        "nearby": [
            {
                "word": "hormone",
                "pos": "noun"
            },
            {
                "word": "hormone replacement therapy",
                "pos": "noun"
            },
            {
                "word": "horn",
                "pos": "noun"
            },
            {
                "word": "horn",
                "pos": "verb"
            },
            {
                "word": "hornbeam",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hard pointed part that grows, usually in pairs, on the heads of some animals, such as sheep and cows. Horns are often curved.",
                    "vi": "một phần cứng nhọn mọc trên đầu của một số động vật, chẳng hạn như cừu và bò, thường mọc thành từng cặp. Sừng thường cong."
                },
                "examples": [
                    {
                        "en": "a large bull with curved horns",
                        "vi": "một con bò đực lớn có sừng cong"
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard substance of which animal horns are made",
                    "vi": "chất cứng mà sừng động vật được tạo ra"
                },
                "examples": [
                    {
                        "en": "ornaments made of rhino horn",
                        "vi": "đồ trang trí bằng sừng tê giác"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device in a vehicle for making a loud sound as a warning or signal",
                    "vi": "một thiết bị trên xe để tạo ra âm thanh lớn như một cảnh báo hoặc tín hiệu"
                },
                "examples": [
                    {
                        "en": "to honk your car horn",
                        "vi": "bấm còi xe của bạn"
                    },
                    {
                        "en": "(British English) to sound/toot your horn",
                        "vi": "(Tiếng Anh Anh) để phát ra âm thanh / thổi còi của bạn"
                    },
                    {
                        "en": "Behind him, a horn blared.",
                        "vi": "Sau lưng anh ta, một chiếc sừng vang lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a simple musical instrument that consists of a curved metal tube that you blow into",
                    "vi": "một nhạc cụ đơn giản bao gồm một ống kim loại cong mà bạn thổi vào"
                },
                "examples": [
                    {
                        "en": "a hunting horn",
                        "vi": "một cái sừng săn bắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a brass musical instrument that consists of a long tube curled around in a circle with a wide opening at the end",
                    "vi": "một nhạc cụ bằng đồng bao gồm một ống dài cuộn tròn quanh một vòng tròn với một lỗ mở rộng ở cuối"
                },
                "examples": [
                    {
                        "en": "a horn concerto",
                        "vi": "một bản concerto sừng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to praise your own abilities and achievements",
                    "vi": "khen ngợi khả năng và thành tích của chính bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start being more careful in your behaviour, especially by spending less money than before",
                    "vi": "để bắt đầu cẩn thận hơn trong hành vi của bạn, đặc biệt là bằng cách tiêu ít tiền hơn trước đây"
                },
                "examples": [
                    {
                        "en": "Small businesses have had to pull their horns in during the recession.",
                        "vi": "Các doanh nghiệp nhỏ đã phải kéo sừng của họ trong thời kỳ suy thoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get involved in an argument with somebody",
                    "vi": "tham gia vào một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "The company has locked horns with the unions over proposed pay cuts.",
                        "vi": "Công ty đã khóa sừng với các công đoàn về đề xuất cắt giảm lương."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation in which you have to make a choice between things that are equally unpleasant",
                    "vi": "trong một tình huống mà bạn phải lựa chọn giữa những điều khó chịu như nhau"
                },
                "examples": [
                    {
                        "en": "The medical profession’s eagerness for scientific advance had impaled it on the horns of a dilemma, forcing an unnatural choice between science and morality.",
                        "vi": "Sự háo hức của ngành y đối với tiến bộ khoa học đã đặt nó vào tình thế tiến thoái lưỡng nan, buộc phải lựa chọn không tự nhiên giữa khoa học và đạo đức."
                    },
                    {
                        "en": "The dire economic situation had placed the prime minister on the horns of a dilemma.",
                        "vi": "Tình hình kinh tế tồi tệ đã đặt thủ tướng vào tình thế khó xử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to face a difficult or dangerous situation directly and with courage",
                    "vi": "đối mặt với một tình huống khó khăn hoặc nguy hiểm một cách trực tiếp và can đảm"
                },
                "examples": [
                    {
                        "en": "Nora decided to take the bull by the horns and organize things for herself.",
                        "vi": "Nora quyết định lấy sừng con bò và sắp xếp mọi thứ cho chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "19e339643c964cbd86d7190c243fdc7f",
        "word": "indicator",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪndɪkeɪtə(r)/",
            "us": "/ˈɪndɪkeɪtər/"
        },
        "nearby": [
            {
                "word": "indicative",
                "pos": "adjective"
            },
            {
                "word": "indicative",
                "pos": "noun"
            },
            {
                "word": "indicator",
                "pos": "noun"
            },
            {
                "word": "indices",
                "pos": "noun"
            },
            {
                "word": "indict",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sign that shows you what something is like or how a situation is changing",
                    "vi": "một dấu hiệu cho bạn biết điều gì đó là như thế nào hoặc tình hình đang thay đổi như thế nào"
                },
                "examples": [
                    {
                        "en": "The economic indicators are better than expected.",
                        "vi": "Các chỉ số kinh tế tốt hơn mong đợi."
                    },
                    {
                        "en": "These atmospheric waves are a reliable indicator of weather changes.",
                        "vi": "Các sóng khí quyển này là một chỉ báo đáng tin cậy về sự thay đổi thời tiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device on a machine that shows speed, pressure, etc.",
                    "vi": "một thiết bị trên máy hiển thị tốc độ, áp suất, v.v."
                },
                "examples": [
                    {
                        "en": "a depth indicator",
                        "vi": "một chỉ báo độ sâu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a light on a vehicle that flashes to show that the vehicle is going to turn left or right",
                    "vi": "đèn trên xe nhấp nháy để cho biết xe sắp rẽ trái hoặc phải"
                },
                "examples": [
                    {
                        "en": "Her right-hand indicator was flashing.",
                        "vi": "Chỉ báo bên tay phải của cô ấy đang nhấp nháy."
                    },
                    {
                        "en": "She flicked on her indicator light and passed the lorry.",
                        "vi": "Cô bật đèn báo và đi qua xe tải."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb9261c972504159a214df656e3ed7ff",
        "word": "license plate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪsns pleɪt/",
            "us": "/ˈlaɪsns pleɪt/"
        },
        "nearby": [
            {
                "word": "licensee",
                "pos": "noun"
            },
            {
                "word": "license number",
                "pos": "noun"
            },
            {
                "word": "license plate",
                "pos": "noun"
            },
            {
                "word": "licensing laws",
                "pos": "noun"
            },
            {
                "word": "licentiate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal or plastic plate on the front and back of a vehicle that shows its license number",
                    "vi": "một tấm kim loại hoặc nhựa ở mặt trước và mặt sau của một chiếc xe có ghi số giấy phép của nó"
                },
                "examples": [
                    {
                        "en": "The driver was arrested for having false license plates on his car.",
                        "vi": "Người lái xe đã bị bắt vì có biển số sai trên xe của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b53dfb82733e4ac5b4008554ee6f1e60",
        "word": "number plate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnʌmbə pleɪt/",
            "us": "/ˈnʌmbər pleɪt/"
        },
        "nearby": [
            {
                "word": "numberless",
                "pos": "adjective"
            },
            {
                "word": "number one",
                "pos": "noun"
            },
            {
                "word": "number plate",
                "pos": "noun"
            },
            {
                "word": "Number Ten",
                "pos": "noun"
            },
            {
                "word": "number two",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal or plastic plate on the front and back of a vehicle that shows its registration number",
                    "vi": "một tấm kim loại hoặc nhựa ở mặt trước và mặt sau của một chiếc xe có ghi số đăng ký của nó"
                },
                "examples": [
                    {
                        "en": "She could just about read the number plate of the car speeding away from the accident.",
                        "vi": "Cô ấy chỉ có thể đọc được biển số của chiếc xe đang chạy nhanh khỏi vụ tai nạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "062fe70fa1a04ecda7165529348206af",
        "word": "parking brake",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpɑːkɪŋ breɪk/",
            "us": "/ˈpɑːrkɪŋ breɪk/"
        },
        "nearby": [
            {
                "word": "parkin",
                "pos": "noun"
            },
            {
                "word": "parking",
                "pos": "noun"
            },
            {
                "word": "parking brake",
                "pos": "noun"
            },
            {
                "word": "parking garage",
                "pos": "noun"
            },
            {
                "word": "parking lot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a brake in a vehicle that is operated by hand, designed to be used when the vehicle has already stopped",
                    "vi": "phanh trên xe được vận hành bằng tay, được thiết kế để sử dụng khi xe đã dừng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "335bc97649904f5ba184a73b4830eb9a",
        "word": "pedal",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpedl/",
            "us": "/ˈpedl/"
        },
        "nearby": [
            {
                "word": "pedagogue",
                "pos": "noun"
            },
            {
                "word": "pedagogy",
                "pos": "noun"
            },
            {
                "word": "pedal",
                "pos": "noun"
            },
            {
                "word": "pedal",
                "pos": "verb"
            },
            {
                "word": "pedal bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat bar on a machine such as a bicycle, car, etc. that you push down with your foot in order to make parts of the machine move or work",
                    "vi": "một thanh phẳng trên máy móc như xe đạp, ô tô, v.v. mà bạn dùng chân đẩy xuống để làm cho các bộ phận của máy chuyển động hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "I couldn't reach the pedals on her bike.",
                        "vi": "Tôi không thể với bàn đạp trên chiếc xe đạp của cô ấy."
                    },
                    {
                        "en": "She pressed her foot down sharply on the brake pedal.",
                        "vi": "Cô nhấn mạnh chân xuống bàn đạp phanh."
                    },
                    {
                        "en": "a pedal boat (= one driven by pedals)",
                        "vi": "một chiếc thuyền đạp (= một chiếc được điều khiển bằng bàn đạp)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bar on a musical instrument such as a piano or an organ that you push with your foot in order to control the sound",
                    "vi": "một thanh trên một nhạc cụ như piano hoặc organ mà bạn đẩy bằng chân để điều khiển âm thanh"
                },
                "examples": [
                    {
                        "en": "The soft pedal is placed leftmost in the row of pedals.",
                        "vi": "Bàn đạp mềm được đặt ngoài cùng bên trái của hàng bàn đạp."
                    },
                    {
                        "en": "Some guitar players tend to overuse the wah-wah pedal.",
                        "vi": "Một số người chơi guitar có xu hướng lạm dụng bàn đạp wah-wah."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to go) at full speed; (to drive) with the accelerator of the car pressed to the floor",
                    "vi": "(đi) ở tốc độ tối đa; (để lái xe) với chân ga của ô tô được nhấn xuống sàn"
                },
                "examples": [
                    {
                        "en": "We drove through the night flat-out, with the pedal to the metal.",
                        "vi": "Chúng tôi lái xe xuyên đêm, với bàn đạp bằng kim loại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use as much effort as possible; with as much effort as possible",
                    "vi": "sử dụng nhiều nỗ lực nhất có thể; với nhiều nỗ lực nhất có thể"
                },
                "examples": [
                    {
                        "en": "I'm still putting the pedal to the metal here at work.",
                        "vi": "Tôi vẫn đang đặt bàn đạp cho kim loại ở đây tại nơi làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "54c7ab0f808a4623b13a808f409cd2eb",
        "word": "rear end",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌrɪər ˈend/",
            "us": "/ˌrɪr ˈend/"
        },
        "nearby": [
            {
                "word": "rear",
                "pos": "verb"
            },
            {
                "word": "rear admiral",
                "pos": "noun"
            },
            {
                "word": "rear end",
                "pos": "noun"
            },
            {
                "word": "rear-end",
                "pos": "verb"
            },
            {
                "word": "rearguard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the back part of a vehicle",
                    "vi": "phần sau của một chiếc xe"
                },
                "examples": [
                    {
                        "en": "The rear end has been completely redesigned in order to offer rear passengers more comfort.",
                        "vi": "Phần đuôi xe được thiết kế lại hoàn toàn nhằm mang đến cho hành khách sự thoải mái hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the body that you sit on",
                    "vi": "phần cơ thể mà bạn ngồi"
                },
                "examples": [
                    {
                        "en": "He spends all day sitting on his rear end in front of a computer.",
                        "vi": "Anh ấy dành cả ngày để ngồi trước máy tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "8101c843462a42c2a9986505680c1de1",
        "word": "spare part",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌspeə ˈpɑːt/",
            "us": "/ˌsper ˈpɑːrt/"
        },
        "nearby": [
            {
                "word": "spare",
                "pos": "verb"
            },
            {
                "word": "spare",
                "pos": "noun"
            },
            {
                "word": "spare part",
                "pos": "noun"
            },
            {
                "word": "spare rib",
                "pos": "noun"
            },
            {
                "word": "spare tyre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a new part that you buy to replace an old or broken part of a car, machine, etc.",
                    "vi": "một bộ phận mới mà bạn mua để thay thế một bộ phận cũ hoặc bị hỏng của xe, máy, v.v."
                },
                "examples": [
                    {
                        "en": "We have to get our spare parts from abroad.",
                        "vi": "Chúng tôi phải lấy phụ tùng thay thế từ nước ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "2e8a5fe23dcb40c6ab29aa4b54e81179",
        "word": "spare tyre",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌspeə ˈtaɪə(r)/",
            "us": "/ˌsper ˈtaɪər/"
        },
        "nearby": [
            {
                "word": "spare part",
                "pos": "noun"
            },
            {
                "word": "spare rib",
                "pos": "noun"
            },
            {
                "word": "spare tyre",
                "pos": "noun"
            },
            {
                "word": "sparing",
                "pos": "adjective"
            },
            {
                "word": "sparingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra wheel for a car",
                    "vi": "một bánh xe phụ cho một chiếc xe hơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large area of too much fat around the middle part of somebody’s body",
                    "vi": "một vùng lớn có quá nhiều mỡ xung quanh phần giữa của cơ thể ai đó"
                },
                "examples": [
                    {
                        "en": "Vigorous exercise will help to get rid of your spare tyre.",
                        "vi": "Vận động mạnh sẽ giúp tháo lốp dự phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "7f9000c436224d4f9c29b6b15fcc6ab4",
        "word": "steering wheel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈstɪərɪŋ wiːl/",
            "us": "/ˈstɪrɪŋ wiːl/"
        },
        "nearby": [
            {
                "word": "steering column",
                "pos": "noun"
            },
            {
                "word": "steering committee",
                "pos": "noun"
            },
            {
                "word": "steering wheel",
                "pos": "noun"
            },
            {
                "word": "stegosaur",
                "pos": "noun"
            },
            {
                "word": "William Steig",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the wheel that the driver turns to control the direction that a vehicle goes in",
                    "vi": "bánh xe mà người lái xe quay để điều khiển hướng xe đi tới"
                },
                "examples": [
                    {
                        "en": "He grabbed the steering wheel from her to prevent the car going off the road.",
                        "vi": "Anh nắm lấy tay lái từ cô để ngăn chiếc xe lao sang đường."
                    },
                    {
                        "en": "Turn the steering wheel hard to the right.",
                        "vi": "Xoay mạnh tay lái sang phải."
                    },
                    {
                        "en": "He drummed his fingers on the steering wheel and waited.",
                        "vi": "Anh gõ ngón tay vào vô lăng và chờ đợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d7a5761e01848af8c76168180fd8a82",
        "word": "windshield",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɪndʃiːld/",
            "us": "/ˈwɪndʃiːld/"
        },
        "nearby": [
            {
                "word": "windscreen",
                "pos": "noun"
            },
            {
                "word": "windscreen wiper",
                "pos": "noun"
            },
            {
                "word": "windshield",
                "pos": "noun"
            },
            {
                "word": "windsock",
                "pos": "noun"
            },
            {
                "word": "Windsor",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the window across the front of a vehicle",
                    "vi": "cửa sổ phía trước xe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a glass or plastic screen that provides protection from the wind, for example at the front of a motorcycle",
                    "vi": "một tấm chắn bằng thủy tinh hoặc nhựa để bảo vệ khỏi gió, ví dụ như ở phía trước của một chiếc xe máy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5cdadecd4d5b4ac38cda38e370ee78c1",
        "word": "airbag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeəbæɡ/",
            "us": "/ˈerbæɡ/"
        },
        "nearby": [
            {
                "word": "air ambulance",
                "pos": "noun"
            },
            {
                "word": "Air America Radio",
                "pos": ""
            },
            {
                "word": "airbag",
                "pos": "noun"
            },
            {
                "word": "air ball",
                "pos": "noun"
            },
            {
                "word": "airbase",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a safety device in a car that fills with air if there is an accident, to protect the people in the car",
                    "vi": "một thiết bị an toàn trong ô tô nạp đầy không khí nếu có tai nạn, để bảo vệ những người trong ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "214d7a9d9264445c96dfcb45188e9a0a",
        "word": "anti-roll bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌænti ˈrəʊl bɑː(r)/",
            "us": "/ˌænti ˈrəʊl bɑːr/"
        },
        "nearby": [
            {
                "word": "antiquity",
                "pos": "noun"
            },
            {
                "word": "antiretroviral",
                "pos": "adjective"
            },
            {
                "word": "anti-roll bar",
                "pos": "noun"
            },
            {
                "word": "antirrhinum",
                "pos": "noun"
            },
            {
                "word": "anti-Semite",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal bar that is part of a car’s suspension, which stops the car from leaning too much when it goes around corners",
                    "vi": "thanh kim loại là một phần của hệ thống treo của ô tô, giúp ô tô không bị nghiêng quá nhiều khi đi quanh các góc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5307071a1b1241f69708d759e6fd9699",
        "word": "armrest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːmrest/",
            "us": "/ˈɑːrmrest/"
        },
        "nearby": [
            {
                "word": "armoury",
                "pos": "noun"
            },
            {
                "word": "armpit",
                "pos": "noun"
            },
            {
                "word": "armrest",
                "pos": "noun"
            },
            {
                "word": "arms",
                "pos": "noun"
            },
            {
                "word": "arms control",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of some types of seat, especially in planes or cars, that supports your arm",
                    "vi": "phần của một số loại ghế, đặc biệt là trên máy bay hoặc ô tô, hỗ trợ cánh tay của bạn"
                },
                "examples": [
                    {
                        "en": "reclining seats with headrests and armrests",
                        "vi": "ghế ngả lưng có tựa đầu và tay vịn"
                    },
                    {
                        "en": "a large centre armrest that folds down",
                        "vi": "một tay vịn lớn ở giữa có thể gập xuống"
                    }
                ]
            }
        ]
    },
    {
        "id": "3897af52f0bb48809de74b3642a946b5",
        "word": "automatic transmission",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɔːtəmætɪk trænzˈmɪʃn/",
            "us": "/ˌɔːtəmætɪk trænzˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "automatic number plate recognition",
                "pos": "noun"
            },
            {
                "word": "automatic pilot",
                "pos": "noun"
            },
            {
                "word": "automatic transmission",
                "pos": "noun"
            },
            {
                "word": "automatic writing",
                "pos": "noun"
            },
            {
                "word": "automation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system in a vehicle that changes the gears itself so that the driver does not have to",
                    "vi": "một hệ thống trong xe tự thay đổi các bánh răng để người lái xe không phải"
                },
                "examples": [
                    {
                        "en": "a car with automatic transmission",
                        "vi": "một chiếc ô tô với hộp số tự động"
                    }
                ]
            }
        ]
    },
    {
        "id": "8ae14e5f3edc47ebbbe8891c4f58a0c6",
        "word": "blinker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblɪŋkə(r)/",
            "us": "/ˈblɪŋkər/"
        },
        "nearby": [
            {
                "word": "blink away",
                "pos": "phrasal verb"
            },
            {
                "word": "blink back",
                "pos": "phrasal verb"
            },
            {
                "word": "blinker",
                "pos": "noun"
            },
            {
                "word": "blinkered",
                "pos": "adjective"
            },
            {
                "word": "blinking",
                "pos": "adjective, adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a light on a vehicle that flashes to show that the vehicle is going to turn left or right",
                    "vi": "đèn trên xe nhấp nháy để cho biết xe sắp rẽ trái hoặc phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pieces of leather that are placed at the side of a horse’s eyes to stop it from looking to the side",
                    "vi": "miếng da được đặt ở cạnh mắt ngựa để ngăn nó nhìn sang bên"
                },
                "examples": [
                    {
                        "en": "(figurative) We need to have a fresh look at the plan, without blinkers (= we need to consider every aspect of it).",
                        "vi": "(nghĩa bóng) Chúng ta cần có một cái nhìn mới mẻ về kế hoạch, không chớp mắt (= chúng ta cần xem xét mọi khía cạnh của nó)."
                    }
                ]
            }
        ]
    },
    {
        "id": "89fbdfb9f30743de97dc797dfd8c649c",
        "word": "bodywork",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒdiwɜːk/",
            "us": "/ˈbɑːdiwɜːrk/"
        },
        "nearby": [
            {
                "word": "body swerve",
                "pos": "noun"
            },
            {
                "word": "body warmer",
                "pos": "noun"
            },
            {
                "word": "bodywork",
                "pos": "noun"
            },
            {
                "word": "Boeing",
                "pos": ""
            },
            {
                "word": "Boer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main outside structure of a vehicle, usually made of painted metal",
                    "vi": "cấu trúc bên ngoài chính của một chiếc xe, thường được làm bằng kim loại sơn"
                },
                "examples": [
                    {
                        "en": "The car had damaged bodywork but a very good engine.",
                        "vi": "Chiếc xe bị hư hỏng thân xe nhưng động cơ rất tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "baf446c9a9bd456a9a56314f74869634",
        "word": "bonnet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒnɪt/",
            "us": "/ˈbɑːnɪt/"
        },
        "nearby": [
            {
                "word": "bon mot",
                "pos": "noun"
            },
            {
                "word": "bonne femme",
                "pos": "adjective"
            },
            {
                "word": "bonnet",
                "pos": "noun"
            },
            {
                "word": "Bonnie and Clyde",
                "pos": ""
            },
            {
                "word": "bonny",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hat tied with strings under the chin, worn by babies and, especially in the past, by women",
                    "vi": "một chiếc mũ buộc dây dưới cằm, được đội bởi trẻ sơ sinh và, đặc biệt là phụ nữ trong quá khứ"
                },
                "examples": [
                    {
                        "en": "a baby's bonnet",
                        "vi": "nắp ca-pô của em bé"
                    }
                ]
            },
            {
                "define": {
                    "en": "the metal part over the front of a vehicle, usually covering the engine",
                    "vi": "phần kim loại phía trước xe, thường bao phủ động cơ"
                },
                "examples": [
                    {
                        "en": "The child hit the bonnet and was flung through the air.",
                        "vi": "Đứa trẻ va vào nắp ca-pô và văng qua không trung."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think or talk about something all the time and to think that it is very important",
                    "vi": "nghĩ hoặc nói về điều gì đó mọi lúc và nghĩ rằng điều đó rất quan trọng"
                },
                "examples": [
                    {
                        "en": "Our teacher has a bee in his bonnet about punctuation.",
                        "vi": "Giáo viên của chúng tôi có một con ong trong nắp ca-pô của mình về dấu câu."
                    }
                ]
            }
        ]
    },
    {
        "id": "54c627967f5945b7a4d34674f738dff2",
        "word": "booster seat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbuːstə siːt/",
            "us": "/ˈbuːstər siːt/"
        },
        "nearby": [
            {
                "word": "boost",
                "pos": "noun"
            },
            {
                "word": "booster",
                "pos": "noun"
            },
            {
                "word": "booster seat",
                "pos": "noun"
            },
            {
                "word": "boot",
                "pos": "noun"
            },
            {
                "word": "boot",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a seat that you put on a car seat, or on a chair at a table, so that a small child can sit higher",
                    "vi": "ghế mà bạn đặt trên ghế ô tô hoặc trên ghế trên bàn để trẻ nhỏ có thể ngồi cao hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ec883c647c02410587e5ad59e6a6c4cb",
        "word": "brake pad",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbreɪk pæd/",
            "us": "/ˈbreɪk pæd/"
        },
        "nearby": [
            {
                "word": "brake fluid",
                "pos": "noun"
            },
            {
                "word": "brake light",
                "pos": "noun"
            },
            {
                "word": "brake pad",
                "pos": "noun"
            },
            {
                "word": "bramble",
                "pos": "noun"
            },
            {
                "word": "Bramley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin block that presses onto the disc in a disc brake in a vehicle, in order to stop the vehicle",
                    "vi": "một khối mỏng ép vào đĩa trong phanh đĩa trên xe để dừng xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6c368695e6e4fdfa6de2a26a1e5deaf",
        "word": "bucket seat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌkɪt siːt/",
            "us": "/ˈbʌkɪt siːt/"
        },
        "nearby": [
            {
                "word": "bucket down",
                "pos": "phrasal verb"
            },
            {
                "word": "bucket list",
                "pos": "noun"
            },
            {
                "word": "bucket seat",
                "pos": "noun"
            },
            {
                "word": "bucket shop",
                "pos": "noun"
            },
            {
                "word": "buckeye",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a seat with a curved back for one person, especially in a car",
                    "vi": "ghế cong cho một người, đặc biệt là trên ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "430351a69a854947b49158f5bae8b9e4",
        "word": "bumper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌmpə(r)/",
            "us": "/ˈbʌmpər/"
        },
        "nearby": [
            {
                "word": "bump",
                "pos": "verb"
            },
            {
                "word": "bump",
                "pos": "noun"
            },
            {
                "word": "bumper",
                "pos": "noun"
            },
            {
                "word": "bumper",
                "pos": "adjective"
            },
            {
                "word": "bumper car",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bar fixed to the front and back of a car, etc. to reduce the effect if it hits anything",
                    "vi": "một thanh cố định ở phía trước và phía sau của ô tô, v.v. để giảm hiệu ứng nếu nó va vào bất cứ thứ gì"
                },
                "examples": [
                    {
                        "en": "a bumper sticker (= a sign that people stick on the bumper of their cars with a message on it)",
                        "vi": "miếng dán cản (= dấu hiệu cho thấy mọi người dán trên cản xe của họ với thông điệp trên đó)"
                    },
                    {
                        "en": "The cars were bumper to bumper on the road to the coast (= so close that their bumpers were nearly touching).",
                        "vi": "Những chiếc xe ô tô đã vượt chướng ngại vật trên con đường đến bờ biển (= gần đến mức các phần cản xe của chúng gần như chạm vào nhau)."
                    },
                    {
                        "en": "The cars crawled along bumper to bumper.",
                        "vi": "Những chiếc xe bò theo cản này đến cản khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "b2c0fd9627f54e96ad704697b99c2476",
        "word": "carburettor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɑːbəˈretə(r)/",
            "us": "/ˈkɑːrbəreɪtər/"
        },
        "nearby": [
            {
                "word": "car bra",
                "pos": "noun"
            },
            {
                "word": "carbuncle",
                "pos": "noun"
            },
            {
                "word": "carburettor",
                "pos": "noun"
            },
            {
                "word": "carburize",
                "pos": "verb"
            },
            {
                "word": "carcass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of an engine, for example in a car, where petrol and air are mixed together",
                    "vi": "bộ phận của động cơ, ví dụ như trong ô tô, nơi xăng và không khí được trộn lẫn với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1592002deecc4135bf985e82a14830a8",
        "word": "catalytic converter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkætəˌlɪtɪk kənˈvɜːtə(r)/",
            "us": "/ˌkætəˌlɪtɪk kənˈvɜːrtər/"
        },
        "nearby": [
            {
                "word": "catalyst",
                "pos": "noun"
            },
            {
                "word": "catalytic",
                "pos": "adjective"
            },
            {
                "word": "catalytic converter",
                "pos": "noun"
            },
            {
                "word": "catamaran",
                "pos": "noun"
            },
            {
                "word": "catamite",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device used in the exhaust system of vehicles to reduce the damage caused to the environment",
                    "vi": "một thiết bị được sử dụng trong hệ thống xả của phương tiện giao thông để giảm thiệt hại gây ra cho môi trường"
                },
                "examples": [
                    {
                        "en": "a car fitted with a catalytic converter",
                        "vi": "một chiếc ô tô được trang bị một bộ chuyển đổi xúc tác"
                    }
                ]
            }
        ]
    },
    {
        "id": "0b1f31ac2d094fc68d7dbc531f4f62c4",
        "word": "central locking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsentrəl ˈlɒkɪŋ/",
            "us": "/ˌsentrəl ˈlɑːkɪŋ/"
        },
        "nearby": [
            {
                "word": "centralization",
                "pos": "noun"
            },
            {
                "word": "centralize",
                "pos": "verb"
            },
            {
                "word": "central locking",
                "pos": "noun"
            },
            {
                "word": "centrally",
                "pos": "adverb"
            },
            {
                "word": "central nervous system",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for locking a car in which all the doors can be locked or opened at the same time",
                    "vi": "một hệ thống để khóa một chiếc xe, trong đó tất cả các cửa có thể được khóa hoặc mở cùng một lúc"
                },
                "examples": [
                    {
                        "en": "The car has power steering and a central locking system.",
                        "vi": "Xe có trợ lực lái và hệ thống khóa trung tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8fd2e4e79b44a63893054499cd43aac",
        "word": "chassis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃæsi/",
            "us": "/ˈʃæsi/"
        },
        "nearby": [
            {
                "word": "chassé",
                "pos": "noun"
            },
            {
                "word": "chasseur",
                "pos": "adjective"
            },
            {
                "word": "chassis",
                "pos": "noun"
            },
            {
                "word": "chaste",
                "pos": "adjective"
            },
            {
                "word": "chastely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the frame that a vehicle is built on",
                    "vi": "khung mà một chiếc xe được xây dựng trên"
                },
                "examples": [
                    {
                        "en": "The company makes chassis for motorhomes, ambulances and other large vehicles.",
                        "vi": "Công ty sản xuất khung gầm cho xe máy, xe cứu thương và các loại xe lớn khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer frame of a piece of computer, radio or audio equipment",
                    "vi": "khung bên ngoài của một phần máy tính, radio hoặc thiết bị âm thanh"
                },
                "examples": [
                    {
                        "en": "a computer/printer chassis",
                        "vi": "khung máy tính / máy in"
                    }
                ]
            }
        ]
    },
    {
        "id": "77d071e1e9ec4be690cd5e4a6469261d",
        "word": "child restraint",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃaɪld rɪstreɪnt/",
            "us": "/ˈtʃaɪld rɪstreɪnt/"
        },
        "nearby": [
            {
                "word": "Children's Hour",
                "pos": ""
            },
            {
                "word": "childrenswear",
                "pos": "noun"
            },
            {
                "word": "child restraint",
                "pos": "noun"
            },
            {
                "word": "child seat",
                "pos": "noun"
            },
            {
                "word": "child support",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt, or small seat with a belt, that is used in a car to control and protect a child",
                    "vi": "dây đai, hoặc ghế nhỏ có dây đai, được sử dụng trên ô tô để điều khiển và bảo vệ trẻ em"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b4a63748b2546fc973351dab22fbcd0",
        "word": "choke",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃəʊk/",
            "us": "/tʃəʊk/"
        },
        "nearby": [
            {
                "word": "choirmaster",
                "pos": "noun"
            },
            {
                "word": "choke",
                "pos": "verb"
            },
            {
                "word": "choke",
                "pos": "noun"
            },
            {
                "word": "choke back",
                "pos": "phrasal verb"
            },
            {
                "word": "choke chain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that controls the amount of air flowing into the engine of a vehicle",
                    "vi": "một thiết bị kiểm soát lượng không khí chảy vào động cơ của một chiếc xe"
                },
                "examples": [
                    {
                        "en": "an automatic choke",
                        "vi": "một cuộn cảm tự động"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act or the sound of choking",
                    "vi": "một hành động hoặc âm thanh của sự nghẹn ngào"
                },
                "examples": [
                    {
                        "en": "She gave a little choke of laughter.",
                        "vi": "Cô bật cười một chút."
                    }
                ]
            }
        ]
    },
    {
        "id": "440c4677dfd14d4cad32be8608fe812a",
        "word": "clock",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/klɒk/",
            "us": "/klɑːk/"
        },
        "nearby": [
            {
                "word": "clobber",
                "pos": "noun"
            },
            {
                "word": "cloche",
                "pos": "noun"
            },
            {
                "word": "clock",
                "pos": "noun"
            },
            {
                "word": "clock",
                "pos": "verb"
            },
            {
                "word": "clocker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an instrument for measuring and showing time, in a room, on the wall of a building or on a computer screen (not worn or carried like a watch)",
                    "vi": "một công cụ để đo và hiển thị thời gian, trong phòng, trên tường của tòa nhà hoặc trên màn hình máy tính (không đeo hoặc mang theo như đồng hồ)"
                },
                "examples": [
                    {
                        "en": "The clock struck twelve/midnight.",
                        "vi": "Đồng hồ điểm 12 giờ đêm."
                    },
                    {
                        "en": "The clock is fast/slow (= showing a time later/earlier than the true time).",
                        "vi": "Đồng hồ nhanh / chậm (= hiển thị thời gian muộn hơn / sớm hơn thời gian thực)."
                    },
                    {
                        "en": "The clock has stopped.",
                        "vi": "Đồng hồ đã dừng."
                    },
                    {
                        "en": "The clock is right/wrong.",
                        "vi": "Đồng hồ đúng / sai."
                    },
                    {
                        "en": "My clock said 9.02.",
                        "vi": "Đồng hồ của tôi báo 9.02."
                    },
                    {
                        "en": "by a clock It was ten past six by the kitchen clock.",
                        "vi": "bởi một chiếc đồng hồ. Bây giờ là sáu giờ mười lăm bởi chiếc đồng hồ trong bếp."
                    },
                    {
                        "en": "the clock face (= the front part of a clock with the numbers on)",
                        "vi": "mặt đồng hồ (= phần trước của đồng hồ có các số trên)"
                    },
                    {
                        "en": "The hands of the clock crept slowly around.",
                        "vi": "Các kim đồng hồ chậm rãi len lỏi xung quanh."
                    },
                    {
                        "en": "The sound of a clock ticking somewhere in the house kept him awake.",
                        "vi": "Tiếng đồng hồ tích tắc đâu đó trong nhà khiến anh tỉnh giấc."
                    },
                    {
                        "en": "Ellen heard the loud ticking of the clock in the hall.",
                        "vi": "Ellen nghe thấy tiếng đồng hồ tích tắc lớn trong sảnh."
                    },
                    {
                        "en": "on a clock She checked the time on the clock.",
                        "vi": "trên đồng hồ Cô ấy kiểm tra thời gian trên đồng hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the milometer in a vehicle (= an instrument that measures the number of miles the vehicle has travelled)",
                    "vi": "milometer trên xe (= một công cụ đo lường số dặm xe đã đi)"
                },
                "examples": [
                    {
                        "en": "on the clock a used car with 20 000 miles on the clock",
                        "vi": "trên đồng hồ một chiếc xe đã qua sử dụng với 20.000 dặm trên đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something against the clock, you do it fast in order to finish before a particular time",
                    "vi": "nếu bạn làm điều gì đó trái với đồng hồ, bạn làm điều đó nhanh chóng để hoàn thành trước một thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "It was a race against the clock to get the building work finished in time.",
                        "vi": "Đó là một cuộc chạy đua với đồng hồ để hoàn thành công trình xây dựng đúng thời gian."
                    },
                    {
                        "en": "to work against the clock",
                        "vi": "làm việc với đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "all day and all night without stopping",
                    "vi": "cả ngày và cả đêm không ngừng nghỉ"
                },
                "examples": [
                    {
                        "en": "Staff have been working around the clock to resolve the problems.",
                        "vi": "Nhân viên đã làm việc suốt ngày đêm để giải quyết các vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish a task, race, etc. before a particular time",
                    "vi": "để hoàn thành nhiệm vụ, cuộc đua, v.v. trước một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "The player beat the clock and set a new record.",
                        "vi": "Người chơi đã đánh bại đồng hồ và thiết lập một kỷ lục mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to beat somebody at something",
                    "vi": "để đánh bại ai đó ở một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She really cleaned his clock in that debate.",
                        "vi": "Cô ấy thực sự đã làm sạch đồng hồ của anh ấy trong cuộc tranh luận đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to physically attack someone",
                    "vi": "tấn công vật lý ai đó"
                },
                "examples": [
                    {
                        "en": "Rosario delivered a blow that cleaned his clock, leaving him disabled.",
                        "vi": "Rosario tung ra một cú đánh làm sạch đồng hồ của anh ta, khiến anh ta bị tàn tật."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there's not much time left before something happens",
                    "vi": "thường nói rằng không còn nhiều thời gian nữa trước khi điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "The clock is ticking down to midnight on New Year’s Eve.",
                        "vi": "Đồng hồ điểm đến nửa đêm của đêm giao thừa."
                    },
                    {
                        "en": "The clock is ticking for one mystery lottery winner who has less than 24 hours to claim a £64 million prize.",
                        "vi": "Đồng hồ đang tích tắc cho một người trúng xổ số bí ẩn chỉ có chưa đầy 24 giờ để nhận giải thưởng 64 triệu bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time changes officially, for example at the beginning and end of summer",
                    "vi": "thời gian thay đổi chính thức, ví dụ như vào đầu và cuối mùa hè"
                },
                "examples": [
                    {
                        "en": "The clocks go back tonight.",
                        "vi": "Đồng hồ quay trở lại tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to a situation that existed in the past; to remember a past age",
                    "vi": "để trở lại một tình huống đã tồn tại trong quá khứ; để nhớ về một thời đã qua"
                },
                "examples": [
                    {
                        "en": "I wish we could turn the clock back two years and give the marriage another chance.",
                        "vi": "Tôi ước chúng tôi có thể quay ngược đồng hồ hai năm và cho cuộc hôn nhân một cơ hội khác."
                    },
                    {
                        "en": "Let's turn back the clock to the last decade.",
                        "vi": "Hãy quay ngược đồng hồ về thập kỷ trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to old-fashioned methods or ideas",
                    "vi": "để quay lại các phương pháp hoặc ý tưởng lỗi thời"
                },
                "examples": [
                    {
                        "en": "The new censorship law will turn the clock back 50 years.",
                        "vi": "Luật kiểm duyệt mới sẽ đưa đồng hồ quay ngược lại 50 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the time shown by clocks, usually by one hour, when the time changes officially, for example at the beginning and end of summer",
                    "vi": "để thay đổi thời gian được hiển thị bởi đồng hồ, thường là một giờ, khi thời gian chính thức thay đổi, ví dụ: vào đầu và cuối mùa hè"
                },
                "examples": [
                    {
                        "en": "Remember to put your clocks back tonight.",
                        "vi": "Hãy nhớ đặt lại đồng hồ của bạn tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you have to do something or finish something very fast before it is too late",
                    "vi": "một tình huống mà bạn phải làm một cái gì đó hoặc hoàn thành một cái gì đó rất nhanh trước khi quá muộn"
                },
                "examples": [
                    {
                        "en": "Getting food to the starving refugees is now a race against time.",
                        "vi": "Kiếm thức ăn cho những người tị nạn chết đói giờ đây là một cuộc chạy đua với thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sports team tries to run down/out the clock at the end of a game, it stops trying to score and just tries to keep hold of the ball to stop the other team from scoring",
                    "vi": "nếu một đội thể thao cố gắng chạy xuống / hết giờ vào cuối trận đấu, thì đội đó sẽ ngừng cố gắng ghi bàn và chỉ cố gắng giữ bóng để ngăn đội kia ghi bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop measuring time in a game or an activity that has a time limit",
                    "vi": "ngừng đo thời gian trong một trò chơi hoặc một hoạt động có giới hạn thời gian"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be careful not to work longer than the required time; to think more about when your work will finish than about the work itself",
                    "vi": "cẩn thận không làm việc lâu hơn thời gian yêu cầu; suy nghĩ nhiều hơn về việc khi nào công việc của bạn sẽ hoàn thành hơn là về bản thân công việc"
                },
                "examples": [
                    {
                        "en": "employees who are always watching the clock",
                        "vi": "nhân viên luôn xem đồng hồ"
                    }
                ]
            }
        ]
    },
    {
        "id": "8210f5a4b83b43ff9c2e9e7b7d1453b0",
        "word": "clutch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/klʌtʃ/",
            "us": "/klʌtʃ/"
        },
        "nearby": [
            {
                "word": "cluster bomb",
                "pos": "noun"
            },
            {
                "word": "clutch",
                "pos": "verb"
            },
            {
                "word": "clutch",
                "pos": "noun"
            },
            {
                "word": "clutch",
                "pos": "adjective"
            },
            {
                "word": "clutch at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pedal in a car or other vehicle that you press with your foot so that you can change gear",
                    "vi": "bàn đạp trên ô tô hoặc phương tiện khác mà bạn nhấn bằng chân để có thể chuyển số"
                },
                "examples": [
                    {
                        "en": "Put your foot on the clutch.",
                        "vi": "Đặt chân lên ly hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device in a machine that connects and disconnects working parts, especially the engine and the gears",
                    "vi": "một thiết bị trong máy kết nối và ngắt kết nối các bộ phận làm việc, đặc biệt là động cơ và bánh răng"
                },
                "examples": [
                    {
                        "en": "The car needs a new clutch.",
                        "vi": "Xe cần một ly hợp mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people, animals or things",
                    "vi": "một nhóm người, động vật hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "He's won a whole clutch of awards.",
                        "vi": "Anh ấy đã giành được rất nhiều giải thưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "power or control",
                    "vi": "quyền lực hoặc kiểm soát"
                },
                "examples": [
                    {
                        "en": "He managed to escape from their clutches.",
                        "vi": "Anh cố gắng thoát khỏi nanh vuốt của chúng."
                    },
                    {
                        "en": "in your clutches Now that she had him in her clutches, she wasn't going to let go.",
                        "vi": "trong vòng tay của bạn Bây giờ cô ấy đã có anh ấy trong vòng tay của mình, cô ấy sẽ không buông ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tight hold on somebody/something",
                    "vi": "giữ chặt ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She felt the sudden clutch of fear.",
                        "vi": "Cô cảm thấy sợ hãi đột ngột."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of eggs that a bird lays at one time; the young birds that come out of a group of eggs at the same time",
                    "vi": "một nhóm trứng mà một con chim đẻ cùng một lúc; những con chim non cùng lúc ra khỏi một nhóm trứng"
                },
                "examples": [
                    {
                        "en": "The female lays a clutch of about seven eggs, laying one egg each day.",
                        "vi": "Con cái đẻ một lứa khoảng bảy trứng, mỗi ngày đẻ một trứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small, flat bag that women carry in their hands, especially on formal occasions",
                    "vi": "một chiếc túi nhỏ, phẳng mà phụ nữ mang trên tay, đặc biệt là trong những dịp trang trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at a critical moment",
                    "vi": "vào một thời điểm quan trọng"
                },
                "examples": [
                    {
                        "en": "Why are some athletes able to perform in the clutch while others fail?",
                        "vi": "Tại sao một số vận động viên có thể thực hiện ly hợp trong khi những người khác không thành công?"
                    },
                    {
                        "en": "Bryan came through in the clutch when it was needed.",
                        "vi": "Bryan đến trong bộ ly hợp khi nó cần thiết."
                    }
                ]
            }
        ]
    },
    {
        "id": "95acd9d4cbce490a99f37c61a253baaa",
        "word": "coachwork",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkəʊtʃwɜːk/",
            "us": "/ˈkəʊtʃwɜːrk/"
        },
        "nearby": [
            {
                "word": "coachload",
                "pos": "noun"
            },
            {
                "word": "coachman",
                "pos": "noun"
            },
            {
                "word": "coachwork",
                "pos": "noun"
            },
            {
                "word": "coagulate",
                "pos": "verb"
            },
            {
                "word": "coagulation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the metal outer part of a road or railway vehicle",
                    "vi": "phần bên ngoài bằng kim loại của phương tiện giao thông đường bộ hoặc đường sắt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "32d1d955d97843d987d5e6bf8a20db06",
        "word": "combustion chamber",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəmˈbʌstʃən tʃeɪmbə(r)/",
            "us": "/kəmˈbʌstʃən tʃeɪmbər/"
        },
        "nearby": [
            {
                "word": "combustible",
                "pos": "adjective"
            },
            {
                "word": "combustion",
                "pos": "noun"
            },
            {
                "word": "combustion chamber",
                "pos": "noun"
            },
            {
                "word": "come",
                "pos": "verb"
            },
            {
                "word": "come",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a space in which combustion takes place, for example in an engine",
                    "vi": "không gian mà quá trình đốt cháy diễn ra, ví dụ như trong động cơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "294305597c0a45b6810be03cfe621c8f",
        "word": "crankshaft",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkræŋkʃɑːft/",
            "us": "/ˈkræŋkʃæft/"
        },
        "nearby": [
            {
                "word": "crank",
                "pos": "verb"
            },
            {
                "word": "crank out",
                "pos": "phrasal verb"
            },
            {
                "word": "crankshaft",
                "pos": "noun"
            },
            {
                "word": "crank up",
                "pos": "phrasal verb"
            },
            {
                "word": "cranky",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long piece of metal in a vehicle that connects the engine to the wheels and helps turn the engine’s power into movement",
                    "vi": "một đoạn kim loại dài trong xe nối động cơ với các bánh xe và giúp biến công suất của động cơ thành chuyển động"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8beb8ad93d7f4ddbb3421b795886a78b",
        "word": "cruise control",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkruːz kəntrəʊl/",
            "us": "/ˈkruːz kəntrəʊl/"
        },
        "nearby": [
            {
                "word": "cruise",
                "pos": "noun"
            },
            {
                "word": "cruise",
                "pos": "verb"
            },
            {
                "word": "cruise control",
                "pos": "noun"
            },
            {
                "word": "cruise missile",
                "pos": "noun"
            },
            {
                "word": "cruiser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in a vehicle that allows it to stay at the speed that the driver has chosen",
                    "vi": "một thiết bị trên xe cho phép nó duy trì ở tốc độ mà người lái xe đã chọn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5b17e71496ed41959c24e81be23b1f98",
        "word": "crumple zone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrʌmpl zəʊn/",
            "us": "/ˈkrʌmpl zəʊn/"
        },
        "nearby": [
            {
                "word": "crumple",
                "pos": "verb"
            },
            {
                "word": "crumpled",
                "pos": "adjective"
            },
            {
                "word": "crumple zone",
                "pos": "noun"
            },
            {
                "word": "crunch",
                "pos": "noun"
            },
            {
                "word": "crunch",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a car that is designed to crumple easily if there is an accident, to protect the people in the car",
                    "vi": "phần thành xe được thiết kế dễ vỡ vụn nếu có tai nạn xảy ra nhằm bảo vệ an toàn cho người ngồi trên xe."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a617c57cfeb4f79a5a5e0eb0d744664",
        "word": "cubbyhole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌbihəʊl/",
            "us": "/ˈkʌbihəʊl/"
        },
        "nearby": [
            {
                "word": "Cuban heel",
                "pos": "noun"
            },
            {
                "word": "the Cuban missile crisis",
                "pos": ""
            },
            {
                "word": "cubbyhole",
                "pos": "noun"
            },
            {
                "word": "cube",
                "pos": "noun"
            },
            {
                "word": "cube",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small room or a small space",
                    "vi": "một căn phòng nhỏ hoặc một không gian nhỏ"
                },
                "examples": [
                    {
                        "en": "My office is a cubbyhole in the basement.",
                        "vi": "Văn phòng của tôi là một cái lỗ nhỏ dưới tầng hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small space or shelf facing the front seats of a car where you can keep papers, maps, etc.",
                    "vi": "một không gian nhỏ hoặc kệ đối diện với hàng ghế trước của ô tô, nơi bạn có thể giữ giấy tờ, bản đồ, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f9f8c5b63ff14b7d8c5dcd15ef969041",
        "word": "dashboard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdæʃbɔːd/",
            "us": "/ˈdæʃbɔːrd/"
        },
        "nearby": [
            {
                "word": "dash",
                "pos": "noun"
            },
            {
                "word": "dash",
                "pos": "verb"
            },
            {
                "word": "dashboard",
                "pos": "noun"
            },
            {
                "word": "dashcam",
                "pos": "noun"
            },
            {
                "word": "dashed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a car in front of the driver that has instruments and controls in it",
                    "vi": "phần của một chiếc ô tô phía trước người lái xe có các thiết bị và điều khiển trong đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a diagram that shows important information, typically one that gives an outline of a business",
                    "vi": "sơ đồ hiển thị thông tin quan trọng, thường là sơ đồ đưa ra phác thảo về doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "an executive dashboard showing key performance indicators",
                        "vi": "một bảng điều hành hiển thị các chỉ số hiệu suất chính"
                    }
                ]
            },
            {
                "define": {
                    "en": "a page on a website where you can access information about its various functions",
                    "vi": "một trang trên trang web nơi bạn có thể truy cập thông tin về các chức năng khác nhau của nó"
                },
                "examples": [
                    {
                        "en": "I like all of my blogs under one dashboard.",
                        "vi": "Tôi thích tất cả các blog của mình dưới một bảng điều khiển."
                    }
                ]
            }
        ]
    },
    {
        "id": "658604ff5d7441718367202ac01f14ab",
        "word": "decompressor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiːkəmˈpresə(r)/",
            "us": "/ˌdiːkəmˈpresər/"
        },
        "nearby": [
            {
                "word": "decompression chamber",
                "pos": "noun"
            },
            {
                "word": "decompression sickness",
                "pos": "noun"
            },
            {
                "word": "decompressor",
                "pos": "noun"
            },
            {
                "word": "decongest",
                "pos": "verb"
            },
            {
                "word": "decongestant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device for reducing pressure in a vehicle’s engine",
                    "vi": "một thiết bị để giảm áp suất trong động cơ xe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a computer program that returns files, etc. to their original size after they have been compressed",
                    "vi": "một chương trình máy tính trả lại các tệp, v.v. về kích thước ban đầu sau khi chúng đã được nén"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "92390b1dcec14c97b6110e284c7d0d11",
        "word": "dipstick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɪpstɪk/",
            "us": "/ˈdɪpstɪk/"
        },
        "nearby": [
            {
                "word": "dippy",
                "pos": "adjective"
            },
            {
                "word": "dipsomaniac",
                "pos": "noun"
            },
            {
                "word": "dipstick",
                "pos": "noun"
            },
            {
                "word": "dip switch",
                "pos": "noun"
            },
            {
                "word": "diptych",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long straight piece of metal used for measuring the amount of liquid in a container, especially the amount of oil in an engine",
                    "vi": "một miếng kim loại dài thẳng dùng để đo lượng chất lỏng trong bình chứa, đặc biệt là lượng dầu trong động cơ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a stupid person",
                    "vi": "một người ngu ngốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f76820ce2024a4f80b36e2a1b8474dc",
        "word": "dual controls",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuːəl kənˈtrəʊlz/",
            "us": "/ˌduːəl kənˈtrəʊlz/"
        },
        "nearby": [
            {
                "word": "dual carriageway",
                "pos": "noun"
            },
            {
                "word": "dual control",
                "pos": "adjective"
            },
            {
                "word": "dual controls",
                "pos": "noun"
            },
            {
                "word": "dualism",
                "pos": "noun"
            },
            {
                "word": "dualist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "two sets of instruments for controlling a vehicle or aircraft, so that a teacher, for example, can take control from the driver",
                    "vi": "hai bộ công cụ để điều khiển phương tiện hoặc máy bay, để giáo viên, chẳng hạn, có thể nắm quyền điều khiển từ người lái xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3549291e493e404c977cdfd3b83fa459",
        "word": "fan belt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfæn belt/",
            "us": "/ˈfæn belt/"
        },
        "nearby": [
            {
                "word": "fanaticism",
                "pos": "noun"
            },
            {
                "word": "fan base",
                "pos": "noun"
            },
            {
                "word": "fan belt",
                "pos": "noun"
            },
            {
                "word": "fanboy",
                "pos": "noun"
            },
            {
                "word": "fanciable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt that operates the machines that cool a car engine",
                    "vi": "dây đai vận hành máy móc làm mát động cơ ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f826edee87f4d398b1d3410a43b3433",
        "word": "fender",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfendə(r)/",
            "us": "/ˈfendər/"
        },
        "nearby": [
            {
                "word": "fencing",
                "pos": "noun"
            },
            {
                "word": "fend",
                "pos": "verb"
            },
            {
                "word": "fender",
                "pos": "noun"
            },
            {
                "word": "fender bender",
                "pos": "noun"
            },
            {
                "word": "fend for yourself",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a car that is above a wheel",
                    "vi": "một bộ phận của ô tô ở phía trên bánh xe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a curved cover over a wheel of a bicycle or motorcycle",
                    "vi": "một tấm bìa cong trên bánh xe đạp hoặc xe máy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a frame around a fireplace to prevent burning coal or wood from falling out",
                    "vi": "khung bao quanh lò sưởi để ngăn than cháy hoặc gỗ rơi ra ngoài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a soft solid object such as an old tyre or a piece of rope that is hung over the side of a boat so the boat is not damaged if it touches another boat, a wall, etc.",
                    "vi": "Một vật rắn mềm như lốp xe cũ hoặc một đoạn dây được treo qua mạn thuyền để thuyền không bị hư hại nếu chạm vào thuyền khác, tường, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "97f62ad9353e47568bc698c99c4e4653",
        "word": "filler cap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪlə kæp/",
            "us": "/ˈfɪlər kæp/"
        },
        "nearby": [
            {
                "word": "fill",
                "pos": "noun"
            },
            {
                "word": "filler",
                "pos": "noun"
            },
            {
                "word": "filler cap",
                "pos": "noun"
            },
            {
                "word": "fillet",
                "pos": "noun"
            },
            {
                "word": "fillet",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cover for the end of the pipe through which fuel is put into a vehicle",
                    "vi": "một nắp đậy cho phần cuối của đường ống mà qua đó nhiên liệu được đưa vào xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b58e3362c2804d2ba62186b446f867a9",
        "word": "fin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɪn/",
            "us": "/fɪn/"
        },
        "nearby": [
            {
                "word": "filtrate",
                "pos": "noun"
            },
            {
                "word": "filtration",
                "pos": "noun"
            },
            {
                "word": "fin",
                "pos": "noun"
            },
            {
                "word": "finagle",
                "pos": "verb"
            },
            {
                "word": "final",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a fish, used for swimming and keeping balance",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi cơ thể cá, dùng để bơi và giữ thăng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a vehicle, an aircraft, etc., used for improving its balance and movement",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi thân xe, máy bay, v.v., được sử dụng để cải thiện khả năng giữ thăng bằng và chuyển động của nó"
                },
                "examples": [
                    {
                        "en": "tail fins",
                        "vi": "Vây đuôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "f0293bd465bd44ed9fa12a8ae6efae42",
        "word": "flasher",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæʃə(r)/",
            "us": "/ˈflæʃər/"
        },
        "nearby": [
            {
                "word": "flash card",
                "pos": "noun"
            },
            {
                "word": "flash drive",
                "pos": "noun"
            },
            {
                "word": "flasher",
                "pos": "noun"
            },
            {
                "word": "flash flood",
                "pos": "noun"
            },
            {
                "word": "flash-forward",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man who shows his sexual organs in public, especially in order to shock or frighten women",
                    "vi": "một người đàn ông để lộ bộ phận sinh dục của mình ở nơi công cộng, đặc biệt là để gây sốc hoặc sợ hãi cho phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a device that turns a light on and off quickly",
                    "vi": "một thiết bị bật và tắt đèn nhanh chóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a light on a vehicle that you can turn on and off quickly as a signal",
                    "vi": "đèn trên xe mà bạn có thể bật và tắt nhanh chóng như một tín hiệu"
                },
                "examples": [
                    {
                        "en": "four-way flashers (= four lights that flash together to warn other drivers of possible danger)",
                        "vi": "đèn nháy bốn chiều (= bốn đèn cùng nhấp nháy để cảnh báo những người lái xe khác về nguy hiểm có thể xảy ra)"
                    }
                ]
            }
        ]
    },
    {
        "id": "58db0902636d46b8954e2a61cadabef2",
        "word": "fog lamp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɒɡ læmp/",
            "us": "/ˈfɑːɡ læmp/"
        },
        "nearby": [
            {
                "word": "Foggy Bottom",
                "pos": ""
            },
            {
                "word": "foghorn",
                "pos": "noun"
            },
            {
                "word": "fog lamp",
                "pos": "noun"
            },
            {
                "word": "fogy",
                "pos": "noun"
            },
            {
                "word": "föhn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very bright light on the front or back of a car to help the driver to see or be seen in fog",
                    "vi": "một đèn rất sáng ở phía trước hoặc phía sau của một chiếc xe hơi để giúp người lái xe có thể nhìn thấy hoặc bị nhìn thấy trong sương mù"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0b7568bdc679441294f827f379acf67d",
        "word": "footbrake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊtbreɪk/",
            "us": "/ˈfʊtbreɪk/"
        },
        "nearby": [
            {
                "word": "the Football League",
                "pos": ""
            },
            {
                "word": "football pools",
                "pos": "noun"
            },
            {
                "word": "footbrake",
                "pos": "noun"
            },
            {
                "word": "footbridge",
                "pos": "noun"
            },
            {
                "word": "foot-dragging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a brake in a vehicle that is operated using your foot",
                    "vi": "phanh trong một chiếc xe được vận hành bằng chân của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a517b54009f419caccabb2d9c5f4e0a",
        "word": "four-stroke",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔː strəʊk/",
            "us": "/ˈfɔːr strəʊk/"
        },
        "nearby": [
            {
                "word": "four-square",
                "pos": "adverb"
            },
            {
                "word": "four-star",
                "pos": "adjective"
            },
            {
                "word": "four-stroke",
                "pos": "adjective"
            },
            {
                "word": "fourteen",
                "pos": "number"
            },
            {
                "word": "the Fourteen Points",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with a piston that makes four up and down movements in each power cycle",
                    "vi": "với một pít-tông tạo ra bốn chuyển động lên và xuống trong mỗi chu kỳ công suất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5dec837fa78a441db0084a129e9f803a",
        "word": "front-wheel drive",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfrʌnt wiːl ˈdraɪv/",
            "us": "/ˌfrʌnt wiːl ˈdraɪv/"
        },
        "nearby": [
            {
                "word": "front-running",
                "pos": "adjective"
            },
            {
                "word": "front up",
                "pos": "phrasal verb"
            },
            {
                "word": "front-wheel drive",
                "pos": "noun"
            },
            {
                "word": "frontwoman",
                "pos": "noun"
            },
            {
                "word": "frost",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system in which power from the engine is sent to the front wheels of a vehicle",
                    "vi": "một hệ thống trong đó sức mạnh từ động cơ được gửi đến bánh trước của một chiếc xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "feefcaa29dca408c996c4d7c508abecc",
        "word": "fuel injection",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfjuːəl ɪndʒekʃn/",
            "us": "/ˈfjuːəl ɪndʒekʃn/"
        },
        "nearby": [
            {
                "word": "fuel",
                "pos": "verb"
            },
            {
                "word": "fuel cell",
                "pos": "noun"
            },
            {
                "word": "fuel injection",
                "pos": "noun"
            },
            {
                "word": "fuel poverty",
                "pos": "noun"
            },
            {
                "word": "fuel rod",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of putting fuel into the engine of a car under pressure as a way of improving its performance",
                    "vi": "một hệ thống đưa nhiên liệu vào động cơ của ô tô dưới áp suất như một cách để cải thiện hiệu suất của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aa9f068a696b46aa8ea1cedad479a2ab",
        "word": "gearbox",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɪəbɒks/",
            "us": "/ˈɡɪrbɑːks/"
        },
        "nearby": [
            {
                "word": "gear",
                "pos": "noun"
            },
            {
                "word": "gear",
                "pos": "verb"
            },
            {
                "word": "gearbox",
                "pos": "noun"
            },
            {
                "word": "gear down",
                "pos": "phrasal verb"
            },
            {
                "word": "geared",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part containing the gears of a vehicle",
                    "vi": "bộ phận chứa các bánh răng của một chiếc xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "03a6a82d64534c8e90bcb3c319b7bb07",
        "word": "gear lever",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɪə liːvə(r)/",
            "us": "/ˈɡɪr levər/"
        },
        "nearby": [
            {
                "word": "gearhead",
                "pos": "noun"
            },
            {
                "word": "gearing",
                "pos": "noun"
            },
            {
                "word": "gear lever",
                "pos": "noun"
            },
            {
                "word": "gearshift",
                "pos": "noun"
            },
            {
                "word": "gear to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a handle used to change the gears of a vehicle",
                    "vi": "một tay cầm được sử dụng để thay đổi các bánh răng của một chiếc xe"
                },
                "examples": [
                    {
                        "en": "Push the gear lever into first.",
                        "vi": "Đẩy cần số vào trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ed008eaab6c4e76880140bf254ef36a",
        "word": "gearshift",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɪəʃɪft/",
            "us": "/ˈɡɪrʃɪft/"
        },
        "nearby": [
            {
                "word": "gearing",
                "pos": "noun"
            },
            {
                "word": "gear lever",
                "pos": "noun"
            },
            {
                "word": "gearshift",
                "pos": "noun"
            },
            {
                "word": "gear to",
                "pos": "phrasal verb"
            },
            {
                "word": "gear towards",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a handle used to change the gears of a vehicle",
                    "vi": "một tay cầm được sử dụng để thay đổi các bánh răng của một chiếc xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6e0a8a59a124c63a866674b3d35d7e4",
        "word": "glove compartment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡlʌv kəmpɑːtmənt/",
            "us": "/ˈɡlʌv kəmpɑːrtmənt/"
        },
        "nearby": [
            {
                "word": "glove",
                "pos": "noun"
            },
            {
                "word": "glovebox",
                "pos": "noun"
            },
            {
                "word": "glove compartment",
                "pos": "noun"
            },
            {
                "word": "gloved",
                "pos": "adjective"
            },
            {
                "word": "glove puppet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small space or shelf facing the front seats of a car, used for keeping small things in",
                    "vi": "một không gian nhỏ hoặc kệ đối diện với ghế trước của ô tô, được sử dụng để giữ những thứ nhỏ trong"
                },
                "examples": [
                    {
                        "en": "Your sunglasses are in the glove compartment.",
                        "vi": "Kính râm của bạn ở trong ngăn đựng găng tay."
                    },
                    {
                        "en": "Don't keep important documents in the glove compartment of your car.",
                        "vi": "Đừng giữ các tài liệu quan trọng trong ngăn đựng găng tay của xe hơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "dbfe83d32fcd4d17bdf681855d652728",
        "word": "go-faster stripes",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡəʊ ˌfɑːstə ˈstraɪps/",
            "us": "/ˌɡəʊ ˌfæstər ˈstraɪps/"
        },
        "nearby": [
            {
                "word": "the God squad",
                "pos": "noun"
            },
            {
                "word": "goer",
                "pos": "noun"
            },
            {
                "word": "go-faster stripes",
                "pos": "noun"
            },
            {
                "word": "gofer",
                "pos": "noun"
            },
            {
                "word": "go for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "coloured lines that can be stuck on the sides of cars",
                    "vi": "các vạch màu có thể bị dính trên thành xe ô tô"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "features that are added to a product to attract attention but that actually have no practical use",
                    "vi": "các tính năng được thêm vào sản phẩm để thu hút sự chú ý nhưng thực tế không có giá trị sử dụng"
                },
                "examples": [
                    {
                        "en": "The expensive new version of the software is the same as the last one with go-faster stripes.",
                        "vi": "Phiên bản mới đắt tiền của phần mềm cũng giống như phiên bản cuối cùng bị sọc nhanh hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "24e4d4060e1f4c8884a0dfc7ad839296",
        "word": "hazard lights",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæzəd laɪts/",
            "us": "/ˈhæzərd laɪts/"
        },
        "nearby": [
            {
                "word": "hazard",
                "pos": "noun"
            },
            {
                "word": "hazard",
                "pos": "verb"
            },
            {
                "word": "hazard lights",
                "pos": "noun"
            },
            {
                "word": "hazardous",
                "pos": "adjective"
            },
            {
                "word": "hazard pay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "lights on a car or other vehicle that flash and warn other drivers of a dangerous situation",
                    "vi": "đèn trên ô tô hoặc phương tiện khác nhấp nháy và cảnh báo những người lái xe khác về tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "I stopped and put on the hazard lights and the handbrake.",
                        "vi": "Tôi dừng lại và bật đèn báo nguy hiểm và phanh tay."
                    }
                ]
            }
        ]
    },
    {
        "id": "382a8367268e4812850cacb797b143c9",
        "word": "headrest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhedrest/",
            "us": "/ˈhedrest/"
        },
        "nearby": [
            {
                "word": "headquartered",
                "pos": "adjective"
            },
            {
                "word": "headquarters",
                "pos": "noun"
            },
            {
                "word": "headrest",
                "pos": "noun"
            },
            {
                "word": "headroom",
                "pos": "noun"
            },
            {
                "word": "head rush",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a support for the head, especially one attached to the back of a chair or seat, for example in a car",
                    "vi": "một giá đỡ cho đầu, đặc biệt là một giá đỡ được gắn vào lưng ghế hoặc ghế ngồi, ví dụ như trong ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41d6294d149d4286b8503ab5f27b5fee",
        "word": "hood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hʊd/",
            "us": "/hʊd/"
        },
        "nearby": [
            {
                "word": "Hons",
                "pos": "abbreviation"
            },
            {
                "word": "hooch",
                "pos": "noun"
            },
            {
                "word": "hood",
                "pos": "noun"
            },
            {
                "word": "-hood",
                "pos": "suffix"
            },
            {
                "word": "hooded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a coat, etc. that you can pull up to cover the back and top of your head",
                    "vi": "một phần của áo khoác, v.v. mà bạn có thể kéo lên để che phía sau và đỉnh đầu của mình"
                },
                "examples": [
                    {
                        "en": "a jacket with a detachable hood",
                        "vi": "áo khoác có mũ trùm đầu có thể tháo rời"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of cloth put over somebody’s face and head so that they cannot be recognized or so that they cannot see",
                    "vi": "một mảnh vải trùm lên mặt và đầu của ai đó để không thể nhận ra họ hoặc để họ không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The victim was sitting tied to a chair with a black hood over her head.",
                        "vi": "Nạn nhân đang ngồi bị trói vào một chiếc ghế với chiếc mũ trùm đầu màu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of coloured silk or fur worn over an academic gown to show the kind of degree held by the person wearing it",
                    "vi": "một mảnh lụa màu hoặc lông thú khoác trên áo choàng học thuật để thể hiện loại bằng cấp của người mặc nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a folding cover over a car, child's buggy, etc.",
                    "vi": "một tấm bìa gấp trên ô tô, xe đẩy của trẻ em, v.v."
                },
                "examples": [
                    {
                        "en": "We drove all the way with the hood down.",
                        "vi": "Chúng tôi đã lái xe suốt chặng đường với mui xe được hạ xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the metal part over the front of a vehicle, usually covering the engine",
                    "vi": "phần kim loại phía trước xe, thường bao phủ động cơ"
                },
                "examples": [
                    {
                        "en": "the sound of a bird hitting the hood of the car",
                        "vi": "tiếng chim va vào mui xe"
                    }
                ]
            },
            {
                "define": {
                    "en": "a cover placed over a device or machine, for example, to protect it",
                    "vi": "ví dụ như một tấm che được đặt trên một thiết bị hoặc máy móc để bảo vệ nó"
                },
                "examples": [
                    {
                        "en": "a lens hood",
                        "vi": "một loa che nắng"
                    },
                    {
                        "en": "an extractor hood (= one that removes cooking smells from a kitchen)",
                        "vi": "máy hút mùi (= máy hút mùi loại bỏ mùi nấu ăn trong nhà bếp)"
                    }
                ]
            },
            {
                "define": {
                    "en": "hoodlum (= a violent criminal, especially one who is part of a gang)",
                    "vi": "lưu manh (= một tên tội phạm bạo lực, đặc biệt là một phần của băng đảng)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a neighbourhood, especially a person’s own neighbourhood",
                    "vi": "một vùng lân cận, đặc biệt là vùng lân cận của một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at the fundamental level of how something works rather than at the obvious surface level",
                    "vi": "ở cấp độ cơ bản về cách một thứ hoạt động hơn là ở cấp độ bề mặt rõ ràng"
                },
                "examples": [
                    {
                        "en": "They are urging potential job seekers to take a look under the hood of industry.",
                        "vi": "Họ đang kêu gọi những người tìm việc tiềm năng xem xét kỹ năng của ngành."
                    },
                    {
                        "en": "If you look under the hood of these these technological wonders, you'll find carbon fibre components in many places.",
                        "vi": "Nếu bạn nhìn dưới mui xe của những kỳ quan công nghệ này, bạn sẽ tìm thấy các thành phần sợi carbon ở nhiều nơi."
                    },
                    {
                        "en": "The latest version includes numerous under-the-hood improvements.",
                        "vi": "Phiên bản mới nhất bao gồm nhiều cải tiến dưới mui xe."
                    }
                ]
            }
        ]
    },
    {
        "id": "2deab1fcfd91423388c227c85f91fef9",
        "word": "hooter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhuːtə(r)/",
            "us": "/ˈhuːtər/"
        },
        "nearby": [
            {
                "word": "hoot",
                "pos": "noun"
            },
            {
                "word": "hootenanny",
                "pos": "noun"
            },
            {
                "word": "hooter",
                "pos": "noun"
            },
            {
                "word": "hoover",
                "pos": "verb"
            },
            {
                "word": "Hoover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the device in a vehicle, or a factory, that makes a loud noise as a signal",
                    "vi": "thiết bị trong xe hoặc nhà máy phát ra tiếng ồn lớn như một tín hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person’s nose, especially a large one",
                    "vi": "mũi của một người, đặc biệt là mũi lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a woman’s breast",
                    "vi": "vú của phụ nữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6b325c6b4c684209a85788a5a9673052",
        "word": "hubcap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌbkæp/",
            "us": "/ˈhʌbkæp/"
        },
        "nearby": [
            {
                "word": "hubbub",
                "pos": "noun"
            },
            {
                "word": "hubby",
                "pos": "noun"
            },
            {
                "word": "hubcap",
                "pos": "noun"
            },
            {
                "word": "Hubert",
                "pos": ""
            },
            {
                "word": "hubris",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a round metal cover that fits over the hub of a vehicle’s wheel",
                    "vi": "một vỏ kim loại tròn vừa với tâm của bánh xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b040af6251c14a48a027648a8e8fcdc6",
        "word": "ignition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪɡˈnɪʃn/",
            "us": "/ɪɡˈnɪʃn/"
        },
        "nearby": [
            {
                "word": "igneous",
                "pos": "adjective"
            },
            {
                "word": "ignite",
                "pos": "verb"
            },
            {
                "word": "ignition",
                "pos": "noun"
            },
            {
                "word": "ignition key",
                "pos": "noun"
            },
            {
                "word": "ignoble",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the electrical system of a vehicle that makes the fuel begin to burn to start the engine; the place in a vehicle where you start this system",
                    "vi": "hệ thống điện của xe làm cho nhiên liệu bắt đầu cháy để khởi động động cơ; vị trí trên xe nơi bạn khởi động hệ thống này"
                },
                "examples": [
                    {
                        "en": "to turn the ignition on/off",
                        "vi": "để bật / tắt đánh lửa"
                    },
                    {
                        "en": "to put the key in the ignition",
                        "vi": "đặt chìa khóa vào ổ điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of starting to burn or of making something burn",
                    "vi": "hành động bắt đầu cháy hoặc làm cho thứ gì đó bốc cháy"
                },
                "examples": [
                    {
                        "en": "The flames spread to all parts of the house within minutes of ignition.",
                        "vi": "Ngọn lửa lan sang tất cả các bộ phận của ngôi nhà trong vòng vài phút sau khi bốc cháy."
                    }
                ]
            }
        ]
    },
    {
        "id": "bfdc886c908342c38bc559d85fc33ab5",
        "word": "internal combustion engine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˌtɜːnl kəmˈbʌstʃən endʒɪn/",
            "us": "/ɪnˌtɜːrnl kəmˈbʌstʃən endʒɪn/"
        },
        "nearby": [
            {
                "word": "intern",
                "pos": "noun"
            },
            {
                "word": "internal",
                "pos": "adjective"
            },
            {
                "word": "internal combustion engine",
                "pos": "noun"
            },
            {
                "word": "internalization",
                "pos": "noun"
            },
            {
                "word": "internalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of engine used in most cars that produces power by burning petrol or other fuel inside",
                    "vi": "một loại động cơ được sử dụng trong hầu hết các loại ô tô tạo ra năng lượng bằng cách đốt cháy xăng hoặc nhiên liệu khác bên trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bf5e074b19b24c3482e3ed928df4da9f",
        "word": "manifold",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmænɪfəʊld/",
            "us": "/ˈmænɪfəʊld/"
        },
        "nearby": [
            {
                "word": "manifesto",
                "pos": "noun"
            },
            {
                "word": "manifold",
                "pos": "adjective"
            },
            {
                "word": "manifold",
                "pos": "noun"
            },
            {
                "word": "manikin",
                "pos": "noun"
            },
            {
                "word": "Manila",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe or chamber with several openings, especially one for taking gases in and out of a car engine",
                    "vi": "một ống hoặc buồng có nhiều lỗ, đặc biệt là lỗ để lấy khí vào và ra khỏi động cơ ô tô"
                },
                "examples": [
                    {
                        "en": "the exhaust manifold",
                        "vi": "ống xả"
                    }
                ]
            }
        ]
    },
    {
        "id": "2a10b513fcb0491aa8de060d4e066673",
        "word": "mileometer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/maɪˈlɒmɪtə(r)/",
            "us": "/maɪˈlɑːmɪtər/"
        },
        "nearby": [
            {
                "word": "mile",
                "pos": "noun"
            },
            {
                "word": "mileage",
                "pos": "noun"
            },
            {
                "word": "mileometer",
                "pos": "noun"
            },
            {
                "word": "milepost",
                "pos": "noun"
            },
            {
                "word": "miles",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an instrument in a vehicle that measures the number of miles it has travelled",
                    "vi": "một công cụ trong một chiếc xe để đo số km nó đã đi được"
                },
                "examples": []
            }
        ]
    }
]