[
    {
        "id": "d7c079a67ba345609c1f4ddd9ed69ef6",
        "word": "drink",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/drɪŋk/",
            "us": "/drɪŋk/"
        },
        "nearby": [
            {
                "word": "drily",
                "pos": "adverb"
            },
            {
                "word": "drink",
                "pos": "noun"
            },
            {
                "word": "drink",
                "pos": "verb"
            },
            {
                "word": "drinkable",
                "pos": "adjective"
            },
            {
                "word": "drink-driver",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take liquid into your mouth and then down your throat into your stomach",
                    "vi": "đưa chất lỏng vào miệng và sau đó xuống cổ họng vào dạ dày"
                },
                "examples": [
                    {
                        "en": "drink something I don't drink coffee.",
                        "vi": "uống thứ gì đó Tôi không uống cà phê."
                    },
                    {
                        "en": "What would you like to drink?",
                        "vi": "Bạn muốn uống gì?"
                    },
                    {
                        "en": "In hot weather, drink plenty of water.",
                        "vi": "Trong thời tiết nắng nóng, hãy uống nhiều nước."
                    },
                    {
                        "en": "drink (from something) She drank from a tall glass.",
                        "vi": "uống (từ thứ gì đó) Cô ấy uống từ một chiếc ly cao."
                    },
                    {
                        "en": "He was drinking straight from the bottle.",
                        "vi": "Anh ta đang uống thẳng từ trong chai."
                    },
                    {
                        "en": "She opened the can and drank thirstily.",
                        "vi": "Cô mở lon và uống một cách khát khao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drink alcohol, especially when it is done regularly",
                    "vi": "uống rượu, đặc biệt là khi uống rượu thường xuyên"
                },
                "examples": [
                    {
                        "en": "He doesn't drink.",
                        "vi": "Anh ấy không uống rượu."
                    },
                    {
                        "en": "She's been drinking heavily since she lost her job.",
                        "vi": "Cô ấy đã uống rất nhiều rượu kể từ khi mất việc."
                    },
                    {
                        "en": "to drink excessively",
                        "vi": "uống quá nhiều"
                    },
                    {
                        "en": "to drink responsibly/sensibly/moderately",
                        "vi": "uống có trách nhiệm / hợp lý / vừa phải"
                    },
                    {
                        "en": "Don't drink and drive (= drive a car after drinking alcohol).",
                        "vi": "Đừng uống rượu và lái xe (= lái xe sau khi uống rượu)."
                    },
                    {
                        "en": "drink something I drank far too much last night.",
                        "vi": "uống thứ mà tôi đã uống quá nhiều vào đêm qua."
                    },
                    {
                        "en": "drink yourself + adj. He had drunk himself unconscious on vodka.",
                        "vi": "tự uống + adj. Anh ta đã say rượu vodka đến bất tỉnh."
                    },
                    {
                        "en": "drink yourself to something His father drank himself to death",
                        "vi": "tự mình uống một thứ gì đó Cha anh ta đã tự mình uống rượu cho đến chết"
                    },
                    {
                        "en": "drink yourself into something She was drinking herself into a stupor.",
                        "vi": "uống chính mình vào một thứ gì đó Cô ấy đang uống mình thành một người sững sờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wish somebody good health as you lift your glass, and then drink from it",
                    "vi": "để chúc sức khỏe ai đó khi bạn nâng ly của mình, và sau đó uống từ đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to drink a lot of alcohol regularly",
                    "vi": "uống nhiều rượu thường xuyên"
                },
                "examples": [
                    {
                        "en": "Simon was drinking like a fish that evening.",
                        "vi": "Simon đã uống như một con cá vào buổi tối hôm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wish somebody good luck, health or success as you lift your glass and then drink from it",
                    "vi": "để chúc ai đó may mắn, sức khỏe hoặc thành công khi bạn nâng ly của mình và sau đó uống cạn"
                },
                "examples": [
                    {
                        "en": "Let's all drink a toast to the bride and groom.",
                        "vi": "Tất cả chúng ta hãy nâng ly chúc mừng cô dâu và chú rể."
                    },
                    {
                        "en": "We drank a toast to the company and its future success.",
                        "vi": "Chúng tôi đã nâng ly chúc mừng công ty và sự thành công trong tương lai của công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drink more alcohol than somebody else without becoming as drunk as they are",
                    "vi": "uống nhiều rượu hơn người khác mà không say như họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "said to encourage somebody to enjoy life now, while they can, and not to think of the future",
                    "vi": "nói để khuyến khích ai đó tận hưởng cuộc sống ngay bây giờ, trong khi họ có thể, và không nghĩ về tương lai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you like or agree with an idea, or would like it to happen",
                    "vi": "được sử dụng để nói rằng bạn thích hoặc đồng ý với một ý tưởng, hoặc muốn nó xảy ra"
                },
                "examples": [
                    {
                        "en": "‘I hope you have a peaceful New Year.’ ‘I'll drink to that!’",
                        "vi": "Tôi hy vọng bạn có một năm mới an lành.' 'Tôi sẽ uống đến đó!'"
                    },
                    {
                        "en": "New technology can mean more free time, and I think we'd all drink to that.",
                        "vi": "Công nghệ mới có thể đồng nghĩa với việc có nhiều thời gian rảnh hơn, và tôi nghĩ tất cả chúng ta đều sẽ tận dụng điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "you can give somebody the opportunity to do something, but you cannot force them to do it if they do not want to",
                    "vi": "bạn có thể cho ai đó cơ hội để làm điều gì đó, nhưng bạn không thể bắt họ làm điều đó nếu họ không muốn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a8e77390f1cf48f49935df13fe9557d5",
        "word": "thirsty",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈθɜːsti/",
            "us": "/ˈθɜːrsti/"
        },
        "nearby": [
            {
                "word": "thirst for",
                "pos": "phrasal verb"
            },
            {
                "word": "thirstily",
                "pos": "adverb"
            },
            {
                "word": "thirsty",
                "pos": "adjective"
            },
            {
                "word": "thirteen",
                "pos": "number"
            },
            {
                "word": "the thirteen colonies",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "needing or wanting to drink",
                    "vi": "cần hoặc muốn uống"
                },
                "examples": [
                    {
                        "en": "We were hungry and thirsty.",
                        "vi": "Chúng tôi đói và khát."
                    },
                    {
                        "en": "Digging is thirsty work (= makes you thirsty).",
                        "vi": "Đào là công việc khát (= làm cho bạn khát)."
                    },
                    {
                        "en": "She felt suddenly very thirsty.",
                        "vi": "Cô đột nhiên cảm thấy rất khát."
                    },
                    {
                        "en": "I was starting to get quite thirsty.",
                        "vi": "Tôi đã bắt đầu khá khát."
                    },
                    {
                        "en": "I'm really thirsty.",
                        "vi": "Tôi thực sự khát."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a strong desire for something",
                    "vi": "có một mong muốn mạnh mẽ cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He is thirsty for power.",
                        "vi": "Anh ta khát quyền lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "dry; in need of water",
                    "vi": "khô; cần nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9fd0f8aec6644bcbb54bfa8b36f641d6",
        "word": "bar",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bɑː(r)/",
            "us": "/bɑːr/"
        },
        "nearby": [
            {
                "word": "baptize",
                "pos": "verb"
            },
            {
                "word": "Bapu",
                "pos": "noun"
            },
            {
                "word": "bar",
                "pos": "noun"
            },
            {
                "word": "bar",
                "pos": "verb"
            },
            {
                "word": "bar",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can buy and drink alcoholic and other drinks",
                    "vi": "nơi bạn có thể mua và uống đồ uống có cồn và các loại đồ uống khác"
                },
                "examples": [
                    {
                        "en": "We arranged to meet in a bar called the Flamingo.",
                        "vi": "Chúng tôi hẹn gặp nhau tại một quán bar tên là Flamingo."
                    },
                    {
                        "en": "The area is full of restaurants and bars.",
                        "vi": "Khu vực này có rất nhiều nhà hàng và quán bar."
                    },
                    {
                        "en": "The bar staff are very friendly.",
                        "vi": "Nhân viên quán rất thân thiện."
                    },
                    {
                        "en": "It's the island’s only licensed bar (= one that is allowed to sell alcoholic drinks).",
                        "vi": "Đây là quán bar được cấp phép duy nhất của hòn đảo (= một quán được phép bán đồ uống có cồn)."
                    },
                    {
                        "en": "(British English) I found David in the bar of the Red Lion (= a room in a pub where drinks are served).",
                        "vi": "(Tiếng Anh Anh) Tôi tìm thấy David trong quán bar của Red Lion (= một căn phòng trong quán rượu nơi phục vụ đồ uống)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place in which a particular kind of food or drink is the main thing that is served",
                    "vi": "một nơi trong đó một loại thức ăn hoặc đồ uống cụ thể là thứ chính được phục vụ"
                },
                "examples": [
                    {
                        "en": "a sushi bar",
                        "vi": "một quán sushi"
                    },
                    {
                        "en": "The hotel has a cocktail bar on the top floor.",
                        "vi": "Khách sạn có quầy bar phục vụ cocktail trên tầng cao nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long wide wooden surface where drinks, etc. are served",
                    "vi": "một bề mặt gỗ dài rộng, nơi phục vụ đồ uống, v.v."
                },
                "examples": [
                    {
                        "en": "at the bar She was sitting at the bar.",
                        "vi": "ở quán bar Cô ấy đang ngồi ở quán bar."
                    },
                    {
                        "en": "behind the bar He spent the summer working behind the bar at the local pub.",
                        "vi": "sau quầy bar Anh ấy đã dành cả mùa hè để làm việc sau quầy bar tại quán rượu địa phương."
                    },
                    {
                        "en": "It was so crowded I couldn't get to the bar.",
                        "vi": "Nó quá đông nên tôi không thể đến được quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of something with straight sides",
                    "vi": "một cái gì đó có các cạnh thẳng"
                },
                "examples": [
                    {
                        "en": "a bar of chocolate/soap",
                        "vi": "một thanh sô cô la / xà phòng"
                    },
                    {
                        "en": "a chocolate bar",
                        "vi": "một thanh sô cô la"
                    },
                    {
                        "en": "(North American English) a candy bar",
                        "vi": "(Tiếng Anh Bắc Mỹ) một thanh kẹo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long straight piece of metal or wood. Bars are often used to stop somebody from getting through a space.",
                    "vi": "một miếng kim loại hoặc gỗ dài thẳng. Thanh thường được sử dụng để ngăn không cho ai đó đi qua một khoảng trống."
                },
                "examples": [
                    {
                        "en": "He smashed the window with an iron bar.",
                        "vi": "Anh ta đập cửa sổ bằng một thanh sắt."
                    },
                    {
                        "en": "The room was small, with bars on the windows.",
                        "vi": "Căn phòng nhỏ, có song sắt trên cửa sổ."
                    },
                    {
                        "en": "The windows at street level were fitted with bars.",
                        "vi": "Các cửa sổ ở mức đường phố được lắp song sắt."
                    },
                    {
                        "en": "a five-bar gate (= one made with five horizontal bars of wood)",
                        "vi": "một cổng năm thanh (= một cổng được làm bằng năm thanh gỗ ngang)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long narrow area, usually at the top or side of a computer screen, that contains links or pull-down menus or displays information about the website or program that you are using",
                    "vi": "một khu vực dài hẹp, thường ở đầu hoặc bên cạnh màn hình máy tính, có chứa các liên kết hoặc menu kéo xuống hoặc hiển thị thông tin về trang web hoặc chương trình mà bạn đang sử dụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the crossbar of a goal",
                    "vi": "xà ngang của mục tiêu"
                },
                "examples": [
                    {
                        "en": "His shot hit the bar.",
                        "vi": "Cú sút của anh ấy đi vọt xà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a band of colour or light",
                    "vi": "dải màu hoặc ánh sáng"
                },
                "examples": [
                    {
                        "en": "Bars of sunlight slanted down from the tall narrow windows.",
                        "vi": "Những tia nắng chiếu xuống từ những ô cửa sổ hẹp cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that stops somebody from doing something",
                    "vi": "một thứ ngăn cản ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "At that time being a woman was a bar to promotion in most professions.",
                        "vi": "Vào thời điểm đó, phụ nữ là một thanh để thăng tiến trong hầu hết các ngành nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the short sections of equal length that a piece of music is divided into, and the notes that are in it",
                    "vi": "một trong những đoạn ngắn có độ dài bằng nhau mà một bản nhạc được chia thành và các nốt trong đó"
                },
                "examples": [
                    {
                        "en": "four beats to the bar",
                        "vi": "bốn nhịp cho thanh"
                    },
                    {
                        "en": "the opening bars of a piece of music",
                        "vi": "thanh mở đầu của một bản nhạc"
                    },
                    {
                        "en": "She played a few bars on the piano.",
                        "vi": "Cô ấy đã chơi một vài thanh trên piano."
                    }
                ]
            },
            {
                "define": {
                    "en": "the profession of barrister (= a lawyer in a higher court)",
                    "vi": "nghề luật sư (= luật sư ở tòa án cấp cao hơn)"
                },
                "examples": [
                    {
                        "en": "to be called to the Bar (= allowed to work as a qualified barrister)",
                        "vi": "được gọi đến Bar (= được phép làm việc như một luật sư đủ điều kiện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the profession of any kind of lawyer",
                    "vi": "nghề của bất kỳ loại luật sư nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit for measuring the pressure of the atmosphere, equal to a hundred thousand newtons per square metre",
                    "vi": "một đơn vị đo áp suất của khí quyển, bằng một trăm nghìn niutơn trên mét vuông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of metal with wire wrapped around it that becomes red and hot when electricity is passed through it",
                    "vi": "một miếng kim loại có dây quấn quanh nó trở nên nóng đỏ khi có dòng điện chạy qua."
                },
                "examples": [
                    {
                        "en": "Switch another bar on if you’re cold.",
                        "vi": "Bật một thanh khác nếu bạn lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "in prison",
                    "vi": "trong nhà tù"
                },
                "examples": [
                    {
                        "en": "The murderer is now safely behind bars.",
                        "vi": "Kẻ sát nhân hiện đã an toàn sau song sắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, lower standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, thấp hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "In the current economic climate we may need to lower the bar on quotas.",
                        "vi": "Trong bối cảnh kinh tế hiện tại, chúng ta có thể cần phải hạ thấp hạn ngạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have nothing to do with something",
                    "vi": "không có gì để làm với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "If he tries to sell you his car, don't have a bar of it.",
                        "vi": "Nếu anh ta cố gắng bán cho bạn chiếc xe của anh ta, đừng có quan tâm đến nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, higher standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, cao hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The factory has raised the bar on productivity, food safety and quality.",
                        "vi": "Nhà máy đã nâng cao năng suất, chất lượng vệ sinh an toàn thực phẩm."
                    },
                    {
                        "en": "This latest computer game raises the bar for interface design.",
                        "vi": "Trò chơi máy tính mới nhất này nâng cao tiêu chuẩn cho thiết kế giao diện."
                    },
                    {
                        "en": "The awards go to people who have truly raised the bar.",
                        "vi": "Giải thưởng sẽ được trao cho những người đã thực sự nâng tầm."
                    },
                    {
                        "en": "Perhaps the new admission requirements raised the bar too high.",
                        "vi": "Có lẽ các yêu cầu nhập học mới đã nâng mức quá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The show really sets the bar for artistic invention.",
                        "vi": "Buổi biểu diễn thực sự đặt ra tiêu chuẩn cho sự phát minh nghệ thuật."
                    },
                    {
                        "en": "Sofia sets the bar very high for what she expects of herself.",
                        "vi": "Sofia đặt tiêu chuẩn rất cao cho những gì cô ấy mong đợi ở bản thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "3de75f4943e44ac1a84d971987470ed1",
        "word": "pub",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pʌb/",
            "us": "/pʌb/"
        },
        "nearby": [
            {
                "word": "PTSD",
                "pos": "abbreviation"
            },
            {
                "word": "Pty",
                "pos": "abbreviation"
            },
            {
                "word": "pub",
                "pos": "noun"
            },
            {
                "word": "pub crawl",
                "pos": "noun"
            },
            {
                "word": "pube",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where people go to drink and meet their friends. Pubs serve alcoholic and other drinks, and often also food.",
                    "vi": "một tòa nhà nơi mọi người đi uống rượu và gặp gỡ bạn bè của họ. Các quán rượu phục vụ đồ uống có cồn và khác, và thường có cả đồ ăn."
                },
                "examples": [
                    {
                        "en": "We're all going to the pub after work.",
                        "vi": "Tất cả chúng ta sẽ đến quán rượu sau giờ làm việc."
                    },
                    {
                        "en": "(informal) They've gone down the pub for a drink.",
                        "vi": "(thân mật) Họ đã đi xuống quán rượu để uống."
                    },
                    {
                        "en": "in a pub They spent the whole evening in the pub.",
                        "vi": "trong một quán rượu Họ đã dành cả buổi tối trong quán rượu."
                    },
                    {
                        "en": "at a pub He is one of the regulars at the pub.",
                        "vi": "tại một quán rượu Anh ấy là một trong những người thường trực tại quán rượu."
                    },
                    {
                        "en": "I got home from the pub just after 11.",
                        "vi": "Tôi trở về nhà từ quán rượu sau 11 giờ."
                    },
                    {
                        "en": "a pub lunch",
                        "vi": "bữa trưa ở quán rượu"
                    },
                    {
                        "en": "the landlord of the local pub",
                        "vi": "chủ nhà của quán rượu địa phương"
                    },
                    {
                        "en": "The Elm Tree will remain a traditional village pub.",
                        "vi": "The Elm Tree sẽ vẫn là một quán rượu truyền thống của làng."
                    },
                    {
                        "en": "We are holding a pub quiz in the bar on Tuesday night.",
                        "vi": "Chúng tôi sẽ tổ chức một cuộc thi đố vui về quán rượu trong quán bar vào tối thứ Ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "10979898c7d34f39a7f663c13b6f7061",
        "word": "thirst",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/θɜːst/",
            "us": "/θɜːrst/"
        },
        "nearby": [
            {
                "word": "third way",
                "pos": "noun"
            },
            {
                "word": "the Third World",
                "pos": "noun"
            },
            {
                "word": "thirst",
                "pos": "noun"
            },
            {
                "word": "thirst",
                "pos": "verb"
            },
            {
                "word": "thirst for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of needing or wanting a drink",
                    "vi": "cảm giác cần hoặc muốn uống một ly"
                },
                "examples": [
                    {
                        "en": "He quenched his thirst with a long drink of cold water.",
                        "vi": "Anh làm dịu cơn khát của mình bằng một ngụm nước lạnh dài."
                    },
                    {
                        "en": "She woke up with a raging thirst and a headache.",
                        "vi": "Cô thức dậy với cơn khát dữ dội và đau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not having enough water to drink",
                    "vi": "tình trạng không có đủ nước để uống"
                },
                "examples": [
                    {
                        "en": "Thousands are dying of thirst.",
                        "vi": "Hàng ngàn người đang chết khát."
                    },
                    {
                        "en": "Many of the refugees were suffering badly from thirst.",
                        "vi": "Nhiều người trong số những người tị nạn đã phải chịu đựng một cách tồi tệ vì khát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong desire for something",
                    "vi": "một mong muốn mạnh mẽ cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a thirst for knowledge",
                        "vi": "khát khao kiến thức"
                    }
                ]
            }
        ]
    },
    {
        "id": "0349c705c8154df6ad137db37d44719b",
        "word": "sip",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/sɪp/",
            "us": "/sɪp/"
        },
        "nearby": [
            {
                "word": "Sioux",
                "pos": "noun"
            },
            {
                "word": "Sioux Falls",
                "pos": ""
            },
            {
                "word": "sip",
                "pos": "verb"
            },
            {
                "word": "sip",
                "pos": "noun"
            },
            {
                "word": "siphon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to drink something, taking a very small amount each time",
                    "vi": "để uống thứ gì đó, uống một lượng rất nhỏ mỗi lần"
                },
                "examples": [
                    {
                        "en": "sip (at something) She sat there, sipping at her tea.",
                        "vi": "nhấm nháp (tại cái gì đó) Cô ấy ngồi đó, nhấm nháp ly trà của mình."
                    },
                    {
                        "en": "sip something He slowly sipped his wine.",
                        "vi": "nhâm nhi thứ gì đó Anh từ từ nhấp từng ngụm rượu của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "778be521255a4be999e23acc8b3c1182",
        "word": "gulp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡʌlp/",
            "us": "/ɡʌlp/"
        },
        "nearby": [
            {
                "word": "gully1",
                "pos": "noun"
            },
            {
                "word": "gully2",
                "pos": "noun"
            },
            {
                "word": "gulp",
                "pos": "verb"
            },
            {
                "word": "gulp",
                "pos": "noun"
            },
            {
                "word": "gulp back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to swallow large amounts of food or drink quickly",
                    "vi": "nuốt một lượng lớn thức ăn hoặc đồ uống một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "He gulped down the rest of his tea and went out.",
                        "vi": "Anh uống cạn phần trà còn lại và đi ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to swallow, but without eating or drinking something, especially because of a strong emotion such as fear or surprise",
                    "vi": "nuốt, nhưng không ăn hoặc uống thứ gì đó, đặc biệt là vì một cảm xúc mạnh như sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "She gulped nervously before trying to answer.",
                        "vi": "Cô lo lắng nuốt nước bọt trước khi cố gắng trả lời."
                    },
                    {
                        "en": "‘Do you know where she is?’ asked Chris. The man gulped nervously and nodded.",
                        "vi": "Bạn có biết cô ấy ở đâu không?' Chris hỏi. Người đàn ông lo lắng nuốt nước bọt và gật đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe quickly and deeply, because you need more air",
                    "vi": "thở nhanh và sâu vì bạn cần nhiều không khí hơn"
                },
                "examples": [
                    {
                        "en": "gulp (for something) She came up gulping for air.",
                        "vi": "ực ực (vì cái gì đó) Cô ấy đến nuốt lấy không khí."
                    },
                    {
                        "en": "Keith swam to the surface and gulped for air.",
                        "vi": "Keith bơi lên mặt nước và nuốt lấy không khí."
                    },
                    {
                        "en": "gulp something (in) He leant against the car, gulping in the cold air.",
                        "vi": "nuốt một cái gì đó (vào) Anh ta dựa vào xe, hít vào một hơi lạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fbdbced878d547f19b241734fef74d4b",
        "word": "gulp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡʌlp/",
            "us": "/ɡʌlp/"
        },
        "nearby": [
            {
                "word": "gully2",
                "pos": "noun"
            },
            {
                "word": "gulp",
                "pos": "verb"
            },
            {
                "word": "gulp",
                "pos": "noun"
            },
            {
                "word": "gulp back",
                "pos": "phrasal verb"
            },
            {
                "word": "gum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of something that you swallow or drink quickly",
                    "vi": "một lượng thứ gì đó mà bạn nuốt hoặc uống một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "He took a gulp of coffee.",
                        "vi": "Anh uống một ngụm cà phê."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of breathing in or of swallowing something",
                    "vi": "một hành động hít vào hoặc nuốt một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "‘Can you start on Monday?’ Amy gave a gulp. ‘Of course,’ she said.",
                        "vi": "Bạn có thể bắt đầu vào thứ Hai không?' Amy nuốt một ngụm nước bọt. \"Tất nhiên,\" cô ấy nói."
                    },
                    {
                        "en": "He drank the glass of whisky in one gulp.",
                        "vi": "Anh ta uống cạn ly rượu whisky một hớp."
                    }
                ]
            }
        ]
    },
    {
        "id": "7b00b7b03b324b489e928b5e964b0253",
        "word": "guzzle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌzl/",
            "us": "/ˈɡʌzl/"
        },
        "nearby": [
            {
                "word": "Guys and Dolls",
                "pos": ""
            },
            {
                "word": "Guy's Hospital",
                "pos": ""
            },
            {
                "word": "guzzle",
                "pos": "verb"
            },
            {
                "word": "guzzler",
                "pos": "noun"
            },
            {
                "word": "gweilo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to drink something quickly and in large amounts. In British English it also means to eat food quickly and in large amounts.",
                    "vi": "để uống một thứ gì đó nhanh chóng và với số lượng lớn. Trong tiếng Anh, nó cũng có nghĩa là ăn nhanh và nhiều."
                },
                "examples": [
                    {
                        "en": "The kids seem to be guzzling soft drinks all day.",
                        "vi": "Những đứa trẻ dường như ngốn nước ngọt cả ngày."
                    },
                    {
                        "en": "(figurative) My car guzzles fuel.",
                        "vi": "(nghĩa bóng) Xe của tôi ngốn nhiên liệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "335c960361ea4794806a64368d1e1df7",
        "word": "public house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpʌblɪk ˈhaʊs/",
            "us": "/ˌpʌblɪk ˈhaʊs/"
        },
        "nearby": [
            {
                "word": "public footpath",
                "pos": "noun"
            },
            {
                "word": "public holiday",
                "pos": "noun"
            },
            {
                "word": "public house",
                "pos": "noun"
            },
            {
                "word": "public housing",
                "pos": "noun"
            },
            {
                "word": "publicist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pub",
                    "vi": "một quán rượu"
                },
                "examples": [
                    {
                        "en": "The company owns over 300 public houses.",
                        "vi": "Công ty sở hữu hơn 300 căn nhà công cộng."
                    },
                    {
                        "en": "The new law applies to public houses and hotel premises.",
                        "vi": "Luật mới áp dụng cho nhà công cộng và cơ sở khách sạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f323d0906a40441ea45641eaba8f68e0",
        "word": "quench",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kwentʃ/",
            "us": "/kwentʃ/"
        },
        "nearby": [
            {
                "word": "queerness",
                "pos": "noun"
            },
            {
                "word": "quell",
                "pos": "verb"
            },
            {
                "word": "quench",
                "pos": "verb"
            },
            {
                "word": "quern",
                "pos": "noun"
            },
            {
                "word": "querulous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to drink so that you no longer feel thirsty",
                    "vi": "uống để không còn cảm thấy khát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop a fire from burning",
                    "vi": "ngăn ngọn lửa bùng cháy"
                },
                "examples": [
                    {
                        "en": "Firemen tried to quench the flames raging through the building.",
                        "vi": "Các nhân viên cứu hỏa đã cố gắng dập tắt ngọn lửa đang bùng phát trong tòa nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "87779c3bdcc6481c8bc470019c2dd5e1",
        "word": "slurp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/slɜːp/",
            "us": "/slɜːrp/"
        },
        "nearby": [
            {
                "word": "slur",
                "pos": "verb"
            },
            {
                "word": "slur",
                "pos": "noun"
            },
            {
                "word": "slurp",
                "pos": "verb"
            },
            {
                "word": "slurp",
                "pos": "noun"
            },
            {
                "word": "slurry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a loud noise while you are drinking something; to make a noise like this",
                    "vi": "để tạo ra một tiếng ồn lớn trong khi bạn đang uống một cái gì đó; gây ồn ào như thế này"
                },
                "examples": [
                    {
                        "en": "slurp something He was slurping his tea.",
                        "vi": "húp cái gì đó Anh đang húp trà."
                    },
                    {
                        "en": "slurp (from something) She slurped noisily from her cup.",
                        "vi": "slurp (từ cái gì đó) Cô ấy nói một cách ồn ào từ chiếc cốc của mình."
                    },
                    {
                        "en": "The water slurped in the tank.",
                        "vi": "Nước đục ngầu trong bể."
                    }
                ]
            }
        ]
    }
]