[
    {
        "id": "dcf999aa174840b78cacad9812e245b0",
        "word": "fat",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/fæt/",
            "us": "/fæt/"
        },
        "nearby": [
            {
                "word": "fast-track",
                "pos": "adjective"
            },
            {
                "word": "fast-track",
                "pos": "verb"
            },
            {
                "word": "fat",
                "pos": "adjective"
            },
            {
                "word": "fat",
                "pos": "noun"
            },
            {
                "word": "fatal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having too much flesh on it and weighing too much",
                    "vi": "có quá nhiều thịt trên đó và nặng quá"
                },
                "examples": [
                    {
                        "en": "a big fat man/woman",
                        "vi": "một người đàn ông / phụ nữ to béo"
                    },
                    {
                        "en": "You'll get fat if you eat so much chocolate.",
                        "vi": "Bạn sẽ béo lên nếu ăn quá nhiều sô cô la."
                    },
                    {
                        "en": "He grew fatter and fatter.",
                        "vi": "Anh càng ngày càng béo."
                    },
                    {
                        "en": "I was ashamed of my fat flabby legs.",
                        "vi": "Tôi xấu hổ vì đôi chân khẳng khiu ngấn mỡ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of fat",
                    "vi": "chứa nhiều chất béo"
                },
                "examples": [
                    {
                        "en": "fat bacon/sausages",
                        "vi": "thịt xông khói / xúc xích béo"
                    }
                ]
            },
            {
                "define": {
                    "en": "thick or wide",
                    "vi": "dày hoặc rộng"
                },
                "examples": [
                    {
                        "en": "a fat volume on American history",
                        "vi": "một khối lượng lớn về lịch sử nước Mỹ"
                    },
                    {
                        "en": "a big fat envelope stuffed with banknotes",
                        "vi": "một phong bì to béo nhét đầy tiền giấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "large in quantity; worth a lot of money",
                    "vi": "số lượng lớn; trị giá rất nhiều tiền"
                },
                "examples": [
                    {
                        "en": "a fat sum/profit",
                        "vi": "một khoản tiền / lợi nhuận béo"
                    },
                    {
                        "en": "He gave me a nice fat cheque.",
                        "vi": "Anh ấy đã cho tôi một tấm séc béo tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that you do not believe something is likely to happen",
                    "vi": "được sử dụng để nói rằng bạn không tin rằng điều gì đó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "‘They might let us in without tickets.’ ‘Fat chance of that!’",
                        "vi": "Họ có thể cho chúng tôi vào mà không cần vé.' 'Cơ hội béo bở của điều đó!'"
                    },
                    {
                        "en": "Fat chance of him helping you!",
                        "vi": "Cơ hội béo bở để anh ấy giúp bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "not at all good or useful",
                    "vi": "hoàn toàn không tốt hay hữu ích"
                },
                "examples": [
                    {
                        "en": "Paul can't drive so he was a fat lot of use when I broke my arm.",
                        "vi": "Paul không thể lái xe nên anh ấy rất béo khi tôi bị gãy tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that a situation may still change, for example that a contest, election, etc. is not finished yet, and somebody still has a chance to win it",
                    "vi": "được sử dụng để nói rằng một tình huống vẫn có thể thay đổi, chẳng hạn như một cuộc thi, cuộc bầu cử, v.v. vẫn chưa kết thúc và ai đó vẫn có cơ hội giành chiến thắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "14436b0eb44b4aafb05c44cb376adda0",
        "word": "short",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ʃɔːt/",
            "us": "/ʃɔːrt/"
        },
        "nearby": [
            {
                "word": "shore up",
                "pos": "phrasal verb"
            },
            {
                "word": "shorn",
                "pos": "verb"
            },
            {
                "word": "short",
                "pos": "adjective"
            },
            {
                "word": "short",
                "pos": "adverb"
            },
            {
                "word": "short",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "measuring or covering a small length or distance, or a smaller length or distance than usual",
                    "vi": "đo hoặc bao phủ một chiều dài hoặc khoảng cách nhỏ, hoặc chiều dài hoặc khoảng cách nhỏ hơn bình thường"
                },
                "examples": [
                    {
                        "en": "He had short curly hair.",
                        "vi": "Anh ta có mái tóc ngắn xoăn."
                    },
                    {
                        "en": "a short walk/distance",
                        "vi": "đi bộ / quãng đường ngắn"
                    },
                    {
                        "en": "a short skirt",
                        "vi": "một chiếc váy ngắn"
                    },
                    {
                        "en": "She decided to cut her hair short.",
                        "vi": "Cô quyết định cắt tóc ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "small in height",
                    "vi": "chiều cao nhỏ"
                },
                "examples": [
                    {
                        "en": "He was a short, fat little man.",
                        "vi": "Anh ta là một người đàn ông thấp bé, mập mạp."
                    },
                    {
                        "en": "She was short and dumpy.",
                        "vi": "Cô ấy thấp và lùn."
                    },
                    {
                        "en": "What did he look like? Was he dark or fair? Tall or short?",
                        "vi": "anh ấy trông như thế nào? Anh ta đen tối hay công bằng? Cao hoac thap?"
                    }
                ]
            },
            {
                "define": {
                    "en": "lasting or taking a small amount of time or less time than usual",
                    "vi": "kéo dài hoặc mất một khoảng thời gian nhỏ hoặc ít thời gian hơn bình thường"
                },
                "examples": [
                    {
                        "en": "a short time/period/while",
                        "vi": "một thời gian ngắn / khoảng thời gian / trong khi"
                    },
                    {
                        "en": "The government is suggesting a relatively short consultation period.",
                        "vi": "Chính phủ đang đề xuất một thời gian tham vấn tương đối ngắn."
                    },
                    {
                        "en": "a programme of short films",
                        "vi": "một chương trình phim ngắn"
                    },
                    {
                        "en": "The short answer to your query is that he has acted completely illegally.",
                        "vi": "Câu trả lời ngắn gọn cho truy vấn của bạn là anh ta đã hành động hoàn toàn bất hợp pháp."
                    },
                    {
                        "en": "a short book (= that does not have many pages and so does not take long to read)",
                        "vi": "một cuốn sách ngắn (= không có nhiều trang và vì vậy không mất nhiều thời gian để đọc)"
                    },
                    {
                        "en": "She has a very short memory (= remembers only things that have happened recently).",
                        "vi": "Cô ấy có trí nhớ rất ngắn (= chỉ nhớ những điều đã xảy ra gần đây)."
                    },
                    {
                        "en": "It was all over in a relatively short space of time.",
                        "vi": "Tất cả đã kết thúc trong một khoảng thời gian tương đối ngắn."
                    },
                    {
                        "en": "They have achieved spectacular results in a remarkably short span of time.",
                        "vi": "Họ đã đạt được những kết quả ngoạn mục trong một khoảng thời gian ngắn đáng kể."
                    },
                    {
                        "en": "I'm going to France for a short break.",
                        "vi": "Tôi sẽ đến Pháp để nghỉ ngơi một thời gian ngắn."
                    },
                    {
                        "en": "She made a short trip to Chicago last July.",
                        "vi": "Cô ấy đã thực hiện một chuyến đi ngắn hạn đến Chicago vào tháng 7 năm ngoái."
                    },
                    {
                        "en": "Which is the shortest day of the year?",
                        "vi": "Ngày nào là ngắn nhất trong năm?"
                    },
                    {
                        "en": "When it comes to your presentation, keep it short and simple.",
                        "vi": "Khi nói đến bản trình bày của bạn, hãy giữ nó ngắn gọn và đơn giản."
                    },
                    {
                        "en": "I'm sorry it's such short notice—we didn't know ourselves until today.",
                        "vi": "Tôi xin lỗi vì đó là thông báo ngắn - chúng tôi không biết chính chúng tôi cho đến ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming to have passed very quickly",
                    "vi": "dường như đã trôi qua rất nhanh"
                },
                "examples": [
                    {
                        "en": "Just two short years ago he was the best player in the country.",
                        "vi": "Chỉ hai năm trước, anh ấy là cầu thủ xuất sắc nhất đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having enough of something; being without something",
                    "vi": "không có đủ thứ gì đó; không có một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm afraid I'm a little short (= of money) this month.",
                        "vi": "Tôi e rằng tôi hơi thiếu (= tiền) trong tháng này."
                    },
                    {
                        "en": "short of something She is not short of excuses when things go wrong.",
                        "vi": "thiếu một cái gì đó Cô ấy không thiếu những lời bào chữa khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having enough of a particular quality",
                    "vi": "không có đủ chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He was a big, strong guy but short on brains.",
                        "vi": "Anh ta là một chàng trai to lớn, mạnh mẽ nhưng não ngắn."
                    },
                    {
                        "en": "If you're short on time, skip these steps and go straight to step five.",
                        "vi": "Nếu bạn thiếu thời gian, hãy bỏ qua các bước này và chuyển thẳng sang bước năm."
                    },
                    {
                        "en": "The article is pretty short on details.",
                        "vi": "Bài báo khá ngắn gọn về chi tiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily available; not supplying as much as you need",
                    "vi": "không dễ dàng có sẵn; không cung cấp nhiều như bạn cần"
                },
                "examples": [
                    {
                        "en": "Money was short at that time.",
                        "vi": "Vào thời điểm đó, tiền rất ngắn."
                    },
                    {
                        "en": "There's still hope a buyer for the company can be found, but time is short.",
                        "vi": "Vẫn còn hy vọng có thể tìm được người mua cho công ty, nhưng thời gian không còn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "less than the number, amount or distance mentioned or needed",
                    "vi": "ít hơn số lượng, số lượng hoặc khoảng cách được đề cập hoặc cần thiết"
                },
                "examples": [
                    {
                        "en": "Her last throw was only three centimetres short of the world record.",
                        "vi": "Cú ném cuối cùng của cô chỉ kém kỷ lục thế giới ba cm."
                    },
                    {
                        "en": "The team was five players short.",
                        "vi": "Đội thiếu năm cầu thủ."
                    },
                    {
                        "en": "She was just short of her 90th birthday when she died.",
                        "vi": "Bà vừa tròn 90 tuổi thì bà qua đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "having difficulty breathing, for example because of illness",
                    "vi": "khó thở, chẳng hạn như vì bệnh tật"
                },
                "examples": [
                    {
                        "en": "a fat man, always short of breath",
                        "vi": "một người đàn ông béo, luôn luôn thở dốc"
                    }
                ]
            },
            {
                "define": {
                    "en": "being a shorter form of a name or word",
                    "vi": "là một dạng ngắn hơn của tên hoặc từ"
                },
                "examples": [
                    {
                        "en": "short for something Call me Jo—it's short for Joanna.",
                        "vi": "viết tắt của cái gì đó Gọi tôi là Jo — nó là viết tắt của Joanna."
                    },
                    {
                        "en": "for short file transfer protocol or FTP for short",
                        "vi": "cho giao thức truyền tệp ngắn hoặc FTP cho ngắn gọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "speaking to somebody using few words in a way that seems rude",
                    "vi": "nói với ai đó bằng vài từ theo cách có vẻ thô lỗ"
                },
                "examples": [
                    {
                        "en": "I'm sorry I was short with you earlier—I had other things on my mind.",
                        "vi": "Tôi xin lỗi vì tôi đã không gặp bạn trước đó — tôi có những việc khác trong đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short vowel is pronounced for a shorter time than other vowels",
                    "vi": "một nguyên âm ngắn được phát âm trong thời gian ngắn hơn các nguyên âm khác"
                },
                "examples": [
                    {
                        "en": "Compare the short vowel in ‘full’ and the long vowel in ‘fool’.",
                        "vi": "So sánh nguyên âm ngắn trong 'đầy đủ' và nguyên âm dài trong 'ngốc'."
                    }
                ]
            },
            {
                "define": {
                    "en": "not long in advance; without warning or time for preparation",
                    "vi": "không lâu trước; không có cảnh báo hoặc thời gian chuẩn bị"
                },
                "examples": [
                    {
                        "en": "This was the best room we could get at such short notice.",
                        "vi": "Đây là căn phòng tốt nhất mà chúng tôi có thể nhận được trong thời gian ngắn như vậy."
                    },
                    {
                        "en": "You must be ready to leave at a moment's notice.",
                        "vi": "Bạn phải sẵn sàng rời đi ngay khi có thông báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "stupid; not very intelligent",
                    "vi": "ngốc nghếch; không thông minh lắm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the whole of something or less of something than you expect or should have",
                    "vi": "toàn bộ của một cái gì đó hoặc ít hơn một cái gì đó hơn bạn mong đợi hoặc nên có"
                },
                "examples": [
                    {
                        "en": "We experienced the full measure of their hospitality.",
                        "vi": "Chúng tôi đã trải nghiệm toàn bộ sự hiếu khách của họ."
                    },
                    {
                        "en": "The concert only lasted an hour, so we felt we were getting short measure.",
                        "vi": "Buổi biểu diễn chỉ kéo dài một giờ, vì vậy chúng tôi cảm thấy mình đang bị hụt hẫng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person in a group who is chosen or forced to perform an unpleasant duty or task",
                    "vi": "trở thành người trong nhóm được chọn hoặc buộc phải thực hiện một nhiệm vụ hoặc nhiệm vụ khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody little attention or sympathy; to get little attention or sympathy",
                    "vi": "để dành cho ai đó sự chú ý hoặc thông cảm nhỏ; để nhận được ít sự chú ý hoặc thông cảm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tend to get angry quickly and easily",
                    "vi": "có xu hướng tức giận nhanh chóng và dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become angry easily",
                    "vi": "dễ trở nên tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe what will happen a long, short, etc. time in the future",
                    "vi": "được sử dụng để mô tả những gì sẽ xảy ra trong thời gian dài, ngắn, v.v. trong tương lai"
                },
                "examples": [
                    {
                        "en": "Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).",
                        "vi": "Một sự phát triển như vậy có vẻ khó xảy ra, ít nhất là trong ngắn hạn (= nó sẽ không xảy ra trong một thời gian khá dài)."
                    },
                    {
                        "en": "In the longer term, children of depressed mothers are more likely to suffer from childhood depression.",
                        "vi": "Về lâu dài, con của những bà mẹ trầm cảm dễ bị trầm cảm ở tuổi thơ."
                    },
                    {
                        "en": "In the long term, our efforts will pay off.",
                        "vi": "Về lâu dài, nỗ lực của chúng tôi sẽ được đền đáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "quickly and without trouble",
                    "vi": "nhanh chóng và không gặp khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "relating to the immediate future",
                    "vi": "liên quan đến tương lai trước mắt"
                },
                "examples": [
                    {
                        "en": "In the short run, unemployment may fall.",
                        "vi": "Trong ngắn hạn, tỷ lệ thất nghiệp có thể giảm xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "not existing in large enough quantities to satisfy demand",
                    "vi": "không tồn tại với số lượng đủ lớn để đáp ứng nhu cầu"
                },
                "examples": [
                    {
                        "en": "Basic foodstuffs were in short supply.",
                        "vi": "Thực phẩm cơ bản bị thiếu hụt."
                    },
                    {
                        "en": "Sunshine will be in short supply for the west coast.",
                        "vi": "Nguồn cung ánh nắng mặt trời sẽ thiếu hụt cho khu vực bờ biển phía Tây."
                    },
                    {
                        "en": "Safe drinking water is in desperately short supply.",
                        "vi": "Nguồn cung cấp nước uống an toàn đang rất thiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "(still) only a boy",
                    "vi": "(vẫn) chỉ có một cậu bé"
                },
                "examples": [
                    {
                        "en": "I was still in short trousers at the time.",
                        "vi": "Lúc đó tôi vẫn đang mặc một chiếc quần ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is not worth wasting time doing something that you dislike or that is not important",
                    "vi": "từng nói rằng không đáng để lãng phí thời gian làm điều gì đó mà bạn không thích hoặc điều đó không quan trọng"
                },
                "examples": [
                    {
                        "en": "Life's too short to sit around moping.",
                        "vi": "Cuộc sống quá ngắn ngủi để ngồi xung quanh việc lau nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is almost true, or is equal to something",
                    "vi": "được sử dụng khi bạn đang nói rằng điều gì đó gần như đúng, hoặc tương đương với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Last year's figures were little short of disastrous.",
                        "vi": "Các con số của năm ngoái không đáng kể đến mức thảm hại."
                    },
                    {
                        "en": "The transformation has been nothing short of a miracle.",
                        "vi": "Sự biến đổi không có gì là ngắn ngủi của một phép lạ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that you will get to the point of what you are saying quickly, without including all the details",
                    "vi": "được sử dụng khi bạn đang nói rằng bạn sẽ đi đến điểm bạn đang nói một cách nhanh chóng, mà không bao gồm tất cả các chi tiết"
                },
                "examples": [
                    {
                        "en": "To cut a long story short, we didn’t get home until 3 in the morning!",
                        "vi": "Để cắt ngắn một câu chuyện dài, chúng tôi đã không về nhà cho đến tận 3 giờ sáng!"
                    },
                    {
                        "en": "Anyway, long story short: we had this argument and I haven't seen him since.",
                        "vi": "Dù sao, câu chuyện dài ngắn: chúng tôi đã có cuộc tranh cãi này và tôi đã không gặp anh ta kể từ đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat, deal with something/somebody quickly",
                    "vi": "để đánh bại, đối phó với một cái gì đó / ai đó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Liverpool made short work of the opposition (= in a football match).",
                        "vi": "Liverpool đã làm được điều đó với phe đối lập (= trong một trận đấu bóng đá)."
                    },
                    {
                        "en": "He made short work of his lunch (= ate it quickly).",
                        "vi": "Anh ấy đã làm xong bữa trưa của mình (= ăn nhanh)."
                    },
                    {
                        "en": "Mike made short work of fixing the engine.",
                        "vi": "Mike thực hiện công việc sửa chữa động cơ trong thời gian ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not lasting a long time but pleasant while it lasts",
                    "vi": "không kéo dài trong một thời gian dài nhưng dễ chịu trong khi kéo dài"
                },
                "examples": [
                    {
                        "en": "We haven't much time so I'll keep it short and sweet.",
                        "vi": "Chúng ta không có nhiều thời gian nên tôi sẽ nói ngắn gọn và thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "very stupid",
                    "vi": "rất ngốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f137c93e9147400f82d76aa42ea13b70",
        "word": "tall",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/tɔːl/",
            "us": "/tɔːl/"
        },
        "nearby": [
            {
                "word": "talk up",
                "pos": "phrasal verb"
            },
            {
                "word": "talky",
                "pos": "adjective"
            },
            {
                "word": "tall",
                "pos": "adjective"
            },
            {
                "word": "Tallahassee",
                "pos": ""
            },
            {
                "word": "tallboy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a greater than average height",
                    "vi": "có chiều cao lớn hơn trung bình"
                },
                "examples": [
                    {
                        "en": "She's tall and thin.",
                        "vi": "Cô ấy cao và ốm."
                    },
                    {
                        "en": "the tallest building in the world",
                        "vi": "tòa nhà cao nhất thế giới"
                    },
                    {
                        "en": "tall trees/chimneys",
                        "vi": "cây cao / ống khói"
                    },
                    {
                        "en": "a tall glass of iced tea",
                        "vi": "một ly trà đá"
                    },
                    {
                        "en": "He's grown taller since I last saw him.",
                        "vi": "Anh ấy đã cao hơn kể từ lần cuối tôi nhìn thấy anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe or ask about the height of somebody/something",
                    "vi": "được sử dụng để mô tả hoặc hỏi về chiều cao của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "How tall are you?",
                        "vi": "Bạn cao bao nhiêu?"
                    },
                    {
                        "en": "He's six feet tall and weighs 200 pounds.",
                        "vi": "Anh ấy cao 6 mét và nặng 200 pound."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very difficult to do",
                    "vi": "rất khó để làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something large and successful often begins in a very small way",
                    "vi": "một cái gì đó lớn và thành công thường bắt đầu từ một cách rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show that you are proud and able to deal with anything",
                    "vi": "để thể hiện rằng bạn tự hào và có thể đối phó với bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "Suddenly he seemed to stand taller.",
                        "vi": "Đột nhiên anh như đứng cao hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel proud and confident",
                    "vi": "cảm thấy tự hào và tự tin"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e94b9f1cf4b940af90156916c8538cb6",
        "word": "heavy",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhevi/",
            "us": "/ˈhevi/"
        },
        "nearby": [
            {
                "word": "heaviness",
                "pos": "noun"
            },
            {
                "word": "heaving",
                "pos": "adjective"
            },
            {
                "word": "heavy",
                "pos": "adjective"
            },
            {
                "word": "heavy",
                "pos": "noun"
            },
            {
                "word": "heavy",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "weighing a lot; difficult to lift or move",
                    "vi": "cân nhiều; khó nâng hoặc di chuyển"
                },
                "examples": [
                    {
                        "en": "a heavy weight/load",
                        "vi": "một trọng lượng nặng / tải trọng"
                    },
                    {
                        "en": "She was struggling with a heavy suitcase.",
                        "vi": "Cô đang loay hoay với một chiếc vali nặng."
                    },
                    {
                        "en": "My brother is much heavier than me.",
                        "vi": "Anh trai tôi nặng hơn tôi rất nhiều."
                    },
                    {
                        "en": "He tried to push the heavy door open.",
                        "vi": "Anh cố gắng đẩy cánh cửa nặng nề ra."
                    },
                    {
                        "en": "How heavy is it (= how much does it weigh)?",
                        "vi": "Nó nặng bao nhiêu (= nó nặng bao nhiêu)?"
                    },
                    {
                        "en": "(especially North American English) Many young people today are too heavy (= fat).",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) Nhiều người trẻ ngày nay quá nặng (= béo)."
                    },
                    {
                        "en": "(figurative) Her father carried a heavy burden of responsibility.",
                        "vi": "(nghĩa bóng) Cha cô mang nặng trách nhiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "more or worse than usual in amount, degree, etc.",
                    "vi": "nhiều hơn hoặc tệ hơn bình thường về số lượng, mức độ, v.v."
                },
                "examples": [
                    {
                        "en": "the noise of heavy traffic",
                        "vi": "tiếng ồn của xe cộ đông đúc"
                    },
                    {
                        "en": "heavy rain/rainfall/snow",
                        "vi": "mưa lớn / lượng mưa / tuyết"
                    },
                    {
                        "en": "the effects of heavy drinking",
                        "vi": "ảnh hưởng của việc uống nhiều rượu"
                    },
                    {
                        "en": "There was heavy fighting in the capital last night.",
                        "vi": "Đêm qua đã xảy ra giao tranh ác liệt ở thủ đô."
                    },
                    {
                        "en": "The British suffered heavy losses in the battle.",
                        "vi": "Người Anh bị tổn thất nặng nề trong trận chiến."
                    },
                    {
                        "en": "His unit came under heavy fire from insurgents.",
                        "vi": "Đơn vị của anh ta phải hứng chịu hỏa lực dày đặc của quân nổi dậy."
                    },
                    {
                        "en": "The penalty for speeding can be a heavy fine.",
                        "vi": "Hình phạt cho việc chạy quá tốc độ có thể là một khoản phạt nặng."
                    },
                    {
                        "en": "She spoke with heavy irony.",
                        "vi": "Cô ấy nói với vẻ mỉa mai nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing the thing mentioned more, or more deeply, than usual",
                    "vi": "làm những việc được đề cập nhiều hơn hoặc sâu hơn bình thường"
                },
                "examples": [
                    {
                        "en": "a heavy drinker/smoker",
                        "vi": "một người nghiện rượu nặng / hút thuốc"
                    },
                    {
                        "en": "a heavy sleeper",
                        "vi": "một người ngủ nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "large and solid",
                    "vi": "lớn và rắn"
                },
                "examples": [
                    {
                        "en": "big, dark rooms full of heavy furniture",
                        "vi": "những căn phòng lớn, tối om đầy đồ đạc nặng"
                    },
                    {
                        "en": "He was tall and strong, with heavy features.",
                        "vi": "Anh ta cao và mạnh mẽ, với những đường nét nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "thick",
                    "vi": "đặc"
                },
                "examples": [
                    {
                        "en": "heavy curtains",
                        "vi": "rèm cửa nặng"
                    },
                    {
                        "en": "a heavy coat",
                        "vi": "một chiếc áo khoác nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of or loaded with something",
                    "vi": "đầy hoặc chất đầy thứ gì đó"
                },
                "examples": [
                    {
                        "en": "trees heavy with apples",
                        "vi": "cây nặng trĩu quả"
                    },
                    {
                        "en": "The air was heavy with the scent of flowers.",
                        "vi": "Không khí nặng mùi hương hoa."
                    },
                    {
                        "en": "His voice was heavy with sarcasm.",
                        "vi": "Giọng anh nặng trĩu với vẻ mỉa mai."
                    },
                    {
                        "en": "She was heavy with child (= pregnant).",
                        "vi": "She was heavy with child (= mang thai)."
                    }
                ]
            },
            {
                "define": {
                    "en": "large and powerful",
                    "vi": "lớn và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a wide range of engines and heavy machinery/equipment",
                        "vi": "nhiều loại động cơ và máy móc / thiết bị hạng nặng"
                    },
                    {
                        "en": "heavy lorries/trucks",
                        "vi": "xe tải / xe tải hạng nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a lot of work or activity; very busy",
                    "vi": "liên quan đến nhiều công việc hoặc hoạt động; rất bận"
                },
                "examples": [
                    {
                        "en": "a heavy schedule",
                        "vi": "một lịch trình dày đặc"
                    },
                    {
                        "en": "She'd had a heavy day.",
                        "vi": "Cô ấy đã có một ngày nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "hard, especially because it requires a lot of physical strength",
                    "vi": "khó, đặc biệt vì nó đòi hỏi rất nhiều thể lực"
                },
                "examples": [
                    {
                        "en": "heavy lifting",
                        "vi": "nâng nặng"
                    },
                    {
                        "en": "A gardener comes in to do the heavy work for me.",
                        "vi": "Một người làm vườn đến làm công việc nặng nhọc cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "falling or hitting something with a lot of force",
                    "vi": "rơi hoặc va vào một cái gì đó với rất nhiều lực"
                },
                "examples": [
                    {
                        "en": "a heavy fall/blow",
                        "vi": "một cú ngã / đòn nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "large in amount or very solid",
                    "vi": "số lượng lớn hoặc rất rắn"
                },
                "examples": [
                    {
                        "en": "a heavy lunch/dinner/meal",
                        "vi": "một bữa trưa / bữa tối / bữa ăn nặng"
                    },
                    {
                        "en": "Avoid heavy foods that are difficult to digest.",
                        "vi": "Tránh thức ăn nặng khó tiêu hóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "carrying heavy weapons",
                    "vi": "mang vũ khí hạng nặng"
                },
                "examples": [
                    {
                        "en": "the heavy infantry/cavalry",
                        "vi": "bộ binh / kỵ binh hạng nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "loud and deep",
                    "vi": "to và sâu"
                },
                "examples": [
                    {
                        "en": "heavy breathing",
                        "vi": "thở nặng nhọc"
                    },
                    {
                        "en": "a heavy groan/sigh",
                        "vi": "một tiếng rên rỉ nặng nề / thở dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "using a lot of something",
                    "vi": "sử dụng rất nhiều thứ"
                },
                "examples": [
                    {
                        "en": "Older cars are heavy on gas.",
                        "vi": "Xe cũ thì xăng nhiều."
                    },
                    {
                        "en": "Don't go so heavy on the garlic.",
                        "vi": "Đừng nặng lời với củ tỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "serious; difficult to understand or enjoy",
                    "vi": "nghiêm túc; khó hiểu hoặc thích thú"
                },
                "examples": [
                    {
                        "en": "We found the play very heavy.",
                        "vi": "Chúng tôi thấy vở kịch rất nặng nề."
                    },
                    {
                        "en": "The discussion got a little heavy.",
                        "vi": "Cuộc thảo luận trở nên hơi nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "dangerous because of big waves, etc.",
                    "vi": "nguy hiểm vì sóng lớn, v.v."
                },
                "examples": [
                    {
                        "en": "strong winds and heavy seas",
                        "vi": "gió mạnh và biển lớn"
                    },
                    {
                        "en": "The heavy Atlantic swells pounded the beach.",
                        "vi": "Biển Đại Tây Dương nặng nề đập mạnh vào bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "hot and without enough fresh air, in a way that feels unpleasant",
                    "vi": "nóng và không có đủ không khí trong lành, theo cách cảm thấy khó chịu"
                },
                "examples": [
                    {
                        "en": "It's very heavy—I think there'll be a storm.",
                        "vi": "Trời rất nặng - tôi nghĩ sẽ có bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "wet, sticky and difficult to dig or to move over",
                    "vi": "ẩm ướt, dính và khó đào hoặc khó di chuyển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very strict and severe",
                    "vi": "rất nghiêm ngặt và nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "Don't be so heavy on her—it wasn't her fault.",
                        "vi": "Đừng nặng lời với cô ấy - đó không phải là lỗi của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very serious, because strong feelings are involved",
                    "vi": "trở nên rất nghiêm trọng, bởi vì cảm giác mạnh có liên quan"
                },
                "examples": [
                    {
                        "en": "They started shouting at me. It got very heavy.",
                        "vi": "Họ bắt đầu hét vào mặt tôi. Nó rất nặng."
                    },
                    {
                        "en": "Then he got heavy and tried to kiss me.",
                        "vi": "Sau đó, anh ấy nặng nề và cố gắng hôn tôi."
                    },
                    {
                        "en": "Things were starting to get a bit heavy so I decided to leave.",
                        "vi": "Mọi thứ bắt đầu trở nên hơi nặng nề nên tôi quyết định rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a difficult problem that makes you worried or unhappy but that you have to deal with",
                    "vi": "gặp một vấn đề khó khăn khiến bạn lo lắng hoặc không vui nhưng bạn phải giải quyết"
                },
                "examples": [
                    {
                        "en": "We all have our crosses to bear.",
                        "vi": "Tất cả chúng ta đều có những thập giá của mình phải chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe somebody/something that is difficult to deal with or understand",
                    "vi": "được sử dụng để mô tả ai đó / điều gì đó khó đối phó hoặc khó hiểu"
                },
                "examples": [
                    {
                        "en": "She's a bit heavy going.",
                        "vi": "Cô ấy đi hơi nặng."
                    },
                    {
                        "en": "I found the course rather heavy going.",
                        "vi": "Tôi thấy khóa học đi khá nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of doing something or of treating people that is much stronger and less sensitive than it needs to be",
                    "vi": "một cách làm điều gì đó hoặc đối xử với những người mạnh mẽ hơn và ít nhạy cảm hơn mức cần thiết"
                },
                "examples": [
                    {
                        "en": "the heavy hand of management",
                        "vi": "bàn tay nặng nề của quản lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very sad feeling",
                    "vi": "một cảm giác rất buồn"
                },
                "examples": [
                    {
                        "en": "She left her children behind with a heavy heart.",
                        "vi": "Mẹ đã bỏ lại những đứa con của mình mà lòng nặng trĩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of strong, often violent people employed to do something such as protect somebody",
                    "vi": "một nhóm những người mạnh mẽ, thường bạo lực được tuyển dụng để làm điều gì đó chẳng hạn như bảo vệ ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation when people do not say anything, but feel embarrassed or uncomfortable",
                    "vi": "một tình huống khi mọi người không nói bất cứ điều gì, nhưng cảm thấy xấu hổ hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to seem to find something more difficult or complicated than it needs to be",
                    "vi": "dường như tìm thấy một cái gì đó khó hơn hoặc phức tạp hơn nó cần"
                },
                "examples": [
                    {
                        "en": "People in this country make such heavy weather of learning languages.",
                        "vi": "Người dân ở đất nước này khiến thời tiết học ngôn ngữ trở nên khắc nghiệt như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a bad effect on somebody/something; to cause a lot of damage, deaths, pain, etc.",
                    "vi": "có ảnh hưởng xấu đến ai đó / cái gì đó; để gây ra rất nhiều thiệt hại, chết chóc, đau đớn, v.v."
                },
                "examples": [
                    {
                        "en": "Illness had taken a heavy toll on her.",
                        "vi": "Bệnh tật đã khiến cô ấy bị ảnh hưởng nặng nề."
                    },
                    {
                        "en": "The recession is taking its toll on the housing markets.",
                        "vi": "Suy thoái đang ảnh hưởng đến thị trường nhà ở."
                    },
                    {
                        "en": "The pressure of fame can take a terrible toll.",
                        "vi": "Áp lực của sự nổi tiếng có thể phải trả một cái giá khủng khiếp."
                    }
                ]
            }
        ]
    },
    {
        "id": "0da609b906604fac9291740b1877210e",
        "word": "height",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/haɪt/",
            "us": "/haɪt/"
        },
        "nearby": [
            {
                "word": "Heidi",
                "pos": ""
            },
            {
                "word": "heifer",
                "pos": "noun"
            },
            {
                "word": "height",
                "pos": "noun"
            },
            {
                "word": "heighten",
                "pos": "verb"
            },
            {
                "word": "Heimlich manoeuvre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the measurement of how tall a person or thing is",
                    "vi": "phép đo chiều cao của một người hoặc một vật"
                },
                "examples": [
                    {
                        "en": "Height: 210 mm. Width: 57 mm. Length: 170 mm.",
                        "vi": "Chiều cao: 210 mm. Chiều rộng: 57 mm. Chiều dài: 170 mm."
                    },
                    {
                        "en": "Please state your height and weight.",
                        "vi": "Vui lòng cho biết chiều cao và cân nặng của bạn."
                    },
                    {
                        "en": "She is the same height as her sister.",
                        "vi": "Cô ấy có cùng chiều cao với chị gái của mình."
                    },
                    {
                        "en": "to be of medium/average height",
                        "vi": "có chiều cao trung bình / trung bình"
                    },
                    {
                        "en": "in height It is almost two metres in height.",
                        "vi": "chiều cao Nó có chiều cao gần hai mét."
                    },
                    {
                        "en": "height of somebody/something You can adjust the height of the chair.",
                        "vi": "chiều cao của ai đó / cái gì đó Bạn có thể điều chỉnh chiều cao của ghế."
                    },
                    {
                        "en": "The plant can reach a height of over six feet.",
                        "vi": "Cây có thể đạt đến chiều cao hơn sáu feet."
                    },
                    {
                        "en": "The table is available in several different heights.",
                        "vi": "Bàn có sẵn với một số chiều cao khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being tall or high",
                    "vi": "chất lượng cao hay cao"
                },
                "examples": [
                    {
                        "en": "The height of the mountain did not discourage them.",
                        "vi": "Độ cao của ngọn núi không làm họ nản lòng."
                    },
                    {
                        "en": "His great height was rather a handicap.",
                        "vi": "Chiều cao tuyệt vời của anh ấy là một khuyết tật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular distance above the ground",
                    "vi": "một khoảng cách cụ thể so với mặt đất"
                },
                "examples": [
                    {
                        "en": "The aircraft was gaining height.",
                        "vi": "Máy bay đang tăng độ cao."
                    },
                    {
                        "en": "at a height of something The plane flew at a height of 3 000 metres.",
                        "vi": "ở độ cao của vật gì Máy bay đã bay ở độ cao 3 000 mét."
                    },
                    {
                        "en": "at… height to be at shoulder/chest/waist height",
                        "vi": "ở… chiều cao ngang vai / ngực / eo"
                    },
                    {
                        "en": "from a… height The stone was dropped from a great height.",
                        "vi": "từ độ cao… Hòn đá được thả từ một độ cao lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a high place or position",
                    "vi": "một nơi cao hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "Brooklyn Heights",
                        "vi": "Brooklyn Heights"
                    },
                    {
                        "en": "He doesn't have a head for heights (= is afraid of high places).",
                        "vi": "Anh ta không có cái đầu cho độ cao (= sợ nơi cao)."
                    },
                    {
                        "en": "a fear of heights",
                        "vi": "sợ độ cao"
                    },
                    {
                        "en": "from a height The pattern of the ancient fields is clearly visible from a height.",
                        "vi": "từ độ cao Mô hình của các cánh đồng cổ có thể nhìn thấy rõ ràng từ độ cao."
                    },
                    {
                        "en": "from the heights of something We looked out over the city from the heights of Edinburgh Castle.",
                        "vi": "từ đỉnh cao của cái gì đó Chúng tôi nhìn ra thành phố từ độ cao của Lâu đài Edinburgh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the point when something is at its strongest or best",
                    "vi": "thời điểm khi thứ gì đó ở mức mạnh nhất hoặc tốt nhất của nó"
                },
                "examples": [
                    {
                        "en": "The fire reached its height around 2 a.m.",
                        "vi": "Ngọn lửa bốc cao vào khoảng 2 giờ sáng"
                    },
                    {
                        "en": "at its height The crisis was at its height in May.",
                        "vi": "ở đỉnh cao Cuộc khủng hoảng lên đến đỉnh điểm vào tháng Năm."
                    },
                    {
                        "en": "at the height of something She is still at the height of her powers.",
                        "vi": "ở đỉnh cao của cái gì đó Cô ấy vẫn ở đỉnh cao của quyền hạn của mình."
                    },
                    {
                        "en": "He is at the height of his career.",
                        "vi": "Anh ấy đang ở đỉnh cao của sự nghiệp."
                    },
                    {
                        "en": "in the height of something I wouldn't go there in the height of summer.",
                        "vi": "ở đỉnh cao của một cái gì đó mà tôi sẽ không đến đó vào thời điểm cao điểm của mùa hè."
                    },
                    {
                        "en": "during the height of something during the height of the Cold War",
                        "vi": "trong thời kỳ đỉnh cao của một cái gì đó trong thời kỳ đỉnh cao của Chiến tranh Lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a better or greater level of something; a situation where something is very good",
                    "vi": "một mức độ tốt hơn hoặc cao hơn của một cái gì đó; một tình huống mà một cái gì đó rất tốt"
                },
                "examples": [
                    {
                        "en": "Their success had reached new heights.",
                        "vi": "Thành công của họ đã lên một tầm cao mới."
                    },
                    {
                        "en": "He didn’t know it was possible to reach such heights of happiness.",
                        "vi": "Anh không biết có thể đạt đến đỉnh cao của hạnh phúc như vậy."
                    },
                    {
                        "en": "She rose to undreamed-of heights of power and fame.",
                        "vi": "Cô đã vươn tới đỉnh cao quyền lực và danh vọng không thể tưởng tượng được."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extreme example of a particular quality",
                    "vi": "một ví dụ điển hình về một chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "It would be the height of folly (= very stupid) to change course now.",
                        "vi": "Bây giờ sẽ là đỉnh cao của sự điên rồ (= rất ngu ngốc)."
                    },
                    {
                        "en": "She was dressed in the height of fashion.",
                        "vi": "Cô ấy đã ăn mặc với chiều cao của thời trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important or impressive position",
                    "vi": "một vị trí quan trọng hoặc ấn tượng"
                },
                "examples": [
                    {
                        "en": "She dreamed of reaching the dizzy heights of stardom.",
                        "vi": "Cô mơ ước đạt đến đỉnh cao chóng mặt của ngôi sao."
                    },
                    {
                        "en": "They reached the dizzy heights of Number 11 in the charts.",
                        "vi": "Họ đã đạt đến đỉnh cao chóng mặt của Vị trí thứ 11 trong bảng xếp hạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stand straight and tall in order to show that you are determined, powerful or important",
                    "vi": "đứng thẳng và cao để thể hiện rằng bạn là người quyết tâm, mạnh mẽ hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "He drew himself up to his full height and glared at us.",
                        "vi": "Anh ta dựng người lên hết cỡ và nhìn chằm chằm vào chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "d65afa3121704d85b13c73aa01f7a67a",
        "word": "thin",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/θɪn/",
            "us": "/θɪn/"
        },
        "nearby": [
            {
                "word": "thimble",
                "pos": "noun"
            },
            {
                "word": "thimbleful",
                "pos": "noun"
            },
            {
                "word": "thin",
                "pos": "adjective"
            },
            {
                "word": "thin",
                "pos": "adverb"
            },
            {
                "word": "thin",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a smaller distance between opposite sides or surfaces than other similar objects or than normal",
                    "vi": "có khoảng cách nhỏ hơn giữa các mặt hoặc bề mặt đối diện so với các vật thể tương tự khác hoặc hơn bình thường"
                },
                "examples": [
                    {
                        "en": "Cut the vegetables into thin strips.",
                        "vi": "Cắt rau thành các dải mỏng."
                    },
                    {
                        "en": "A number of thin cracks appeared in the wall.",
                        "vi": "Trên tường xuất hiện một số vết nứt mỏng."
                    },
                    {
                        "en": "The body was hidden beneath a thin layer of soil.",
                        "vi": "Cơ thể được giấu dưới một lớp đất mỏng."
                    },
                    {
                        "en": "Palm trees cast long, thin shadows on the lawn.",
                        "vi": "Những cây cọ đổ bóng dài và mỏng trên bãi cỏ."
                    },
                    {
                        "en": "He knew that the ice was too thin to risk crossing the river.",
                        "vi": "Anh biết rằng lớp băng quá mỏng để có thể mạo hiểm băng qua sông."
                    },
                    {
                        "en": "a thin blouse (= of light cloth)",
                        "vi": "một chiếc áo cánh mỏng (= vải nhẹ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "not covered with much fat or muscle",
                    "vi": "không có nhiều mỡ hoặc cơ"
                },
                "examples": [
                    {
                        "en": "He was tall and thin, with dark hair.",
                        "vi": "Anh ta cao và gầy, với mái tóc đen."
                    },
                    {
                        "en": "She was looking pale and thin.",
                        "vi": "Cô ấy trông xanh xao và gầy yếu."
                    },
                    {
                        "en": "How do you stay so thin?",
                        "vi": "Làm thế nào để bạn luôn gầy như vậy?"
                    },
                    {
                        "en": "He is as thin as a rake (= very thin).",
                        "vi": "Anh ta gầy như cái cào (= rất gầy)."
                    },
                    {
                        "en": "thin legs",
                        "vi": "chân thon"
                    }
                ]
            },
            {
                "define": {
                    "en": "not growing closely together or in large amounts",
                    "vi": "không phát triển gần nhau hoặc với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "thin grey hair",
                        "vi": "tóc bạc mỏng"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing more liquid than is normal or expected",
                    "vi": "chứa nhiều chất lỏng hơn bình thường hoặc dự kiến"
                },
                "examples": [
                    {
                        "en": "The sauce was thin and tasteless.",
                        "vi": "Nước sốt loãng và không có vị."
                    },
                    {
                        "en": "The paint looks a bit thin.",
                        "vi": "Lớp sơn trông hơi mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "fairly easy to see through",
                    "vi": "khá dễ dàng để xem qua"
                },
                "examples": [
                    {
                        "en": "They fought their way through where the smoke was thinner.",
                        "vi": "Họ cố gắng vượt qua nơi khói mỏng hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing less oxygen than normal",
                    "vi": "chứa ít oxy hơn bình thường"
                },
                "examples": [
                    {
                        "en": "Humans would not be able to survive in the thin atmosphere of the planet.",
                        "vi": "Con người sẽ không thể tồn tại trong bầu khí quyển mỏng của hành tinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "high and weak",
                    "vi": "cao và yếu"
                },
                "examples": [
                    {
                        "en": "Her thin voice trailed off into silence.",
                        "vi": "Giọng nói mỏng của cô ấy chìm vào im lặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not sincere or enthusiastic",
                    "vi": "không chân thành hoặc nhiệt tình"
                },
                "examples": [
                    {
                        "en": "He gave a thin smile.",
                        "vi": "Anh nở một nụ cười mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not very bright",
                    "vi": "không sáng lắm"
                },
                "examples": [
                    {
                        "en": "the thin grey light of dawn",
                        "vi": "ánh sáng xám mỏng của bình minh"
                    }
                ]
            },
            {
                "define": {
                    "en": "of poor quality; without an important quality",
                    "vi": "chất lượng kém; không có chất lượng quan trọng"
                },
                "examples": [
                    {
                        "en": "a thin excuse (= one that people are not likely to believe)",
                        "vi": "một lời bào chữa mỏng manh (= một cái cớ mà mọi người có thể không tin)"
                    },
                    {
                        "en": "Their arguments all sound a little thin to me.",
                        "vi": "Tất cả các lập luận của họ nghe có vẻ hơi mỏng đối với tôi."
                    },
                    {
                        "en": "The general standard of applicants is pretty thin this year.",
                        "vi": "Tiêu chuẩn chung của các ứng viên năm nay khá mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be taking a risk",
                    "vi": "mạo hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear suddenly in a mysterious way",
                    "vi": "biến mất đột ngột một cách bí ẩn"
                },
                "examples": [
                    {
                        "en": "She can’t just have vanished into thin air.",
                        "vi": "Cô ấy không thể biến mất trong không khí mỏng manh."
                    },
                    {
                        "en": "At a stroke she could make things vanish into thin air.",
                        "vi": "Chỉ cần một cú đột quỵ, cô ấy có thể khiến mọi thứ tan biến thành không khí loãng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have many problems or difficulties to deal with; to not be successful",
                    "vi": "có nhiều vấn đề hoặc khó khăn để giải quyết; không thành công"
                },
                "examples": [
                    {
                        "en": "He’s had a thin time of it since losing his job.",
                        "vi": "Anh ấy đã có một khoảng thời gian mỏng manh kể từ khi mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "from nowhere or nothing, as if by magic",
                    "vi": "từ hư không hoặc không có gì, như thể bằng phép thuật"
                },
                "examples": [
                    {
                        "en": "Unfortunately, I can’t just conjure up the money out of thin air!",
                        "vi": "Thật không may, tôi không thể chỉ kiếm tiền một cách dễ dàng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do so many different things at the same time that you do not do any of them well",
                    "vi": "cố gắng làm nhiều việc khác nhau cùng lúc mà bạn không làm tốt việc nào trong số đó"
                },
                "examples": [
                    {
                        "en": "With four markets to manage, there's a danger that's she's spreading herself too thin.",
                        "vi": "Với bốn thị trường cần quản lý, có một mối nguy hiểm là cô ấy đang tự dàn trải quá mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if people or things are thick/thin on the ground, there are a lot/not many of them in a place",
                    "vi": "nếu người hoặc vật dày / mỏng trên mặt đất, thì có rất nhiều / không nhiều trong số họ ở một nơi"
                },
                "examples": [
                    {
                        "en": "Customers are thin on the ground at this time of year.",
                        "vi": "Khách hàng ngày càng thưa thớt vào thời điểm này trong năm."
                    },
                    {
                        "en": "Security officers were thick on the ground during the King’s visit.",
                        "vi": "Các nhân viên an ninh dày đặc trên mặt đất trong chuyến thăm của Nhà vua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or action that is the beginning of something more serious and/or unpleasant",
                    "vi": "một sự kiện hoặc hành động là sự khởi đầu của một điều gì đó nghiêm trọng hơn và / hoặc khó chịu hơn"
                },
                "examples": [
                    {
                        "en": "The introduction of a tax on workplace parking is seen by many as the thin end of the wedge.",
                        "vi": "Việc áp dụng thuế đối với bãi đậu xe tại nơi làm việc được nhiều người coi là cái kết mỏng manh."
                    }
                ]
            },
            {
                "define": {
                    "en": "with little or no hair on the head",
                    "vi": "có ít hoặc không có tóc trên đầu"
                },
                "examples": [
                    {
                        "en": "He's starting to get a little thin on top (= he's losing his hair).",
                        "vi": "Trên đầu anh ấy bắt đầu hơi mỏng (= anh ấy đang rụng tóc)."
                    },
                    {
                        "en": "He's going bald on top.",
                        "vi": "Anh ấy sẽ hói đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lack of ability to accept criticism, offensive remarks, etc. without becoming upset",
                    "vi": "thiếu khả năng chấp nhận những lời chỉ trích, nhận xét xúc phạm, v.v. mà không trở nên khó chịu"
                },
                "examples": [
                    {
                        "en": "You shouldn’t be in politics if you have such a thin skin.",
                        "vi": "Bạn không nên tham gia chính trị nếu bạn có một làn da mỏng như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "even when there are problems or difficulties",
                    "vi": "ngay cả khi có vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "He's supported the team for over ten years through thick and thin.",
                        "vi": "Anh ấy đã hỗ trợ đội bóng trong hơn mười năm."
                    },
                    {
                        "en": "In marriage, you have to stick together through thick and thin.",
                        "vi": "Trong hôn nhân, hai bạn phải gắn bó với nhau từ dày đến mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult or dangerous situation where you could easily make a mistake",
                    "vi": "ở trong một tình huống khó khăn hoặc nguy hiểm mà bạn có thể dễ dàng mắc sai lầm"
                },
                "examples": [
                    {
                        "en": "He was walking a fine line between being funny and being rude.",
                        "vi": "Anh ấy đang đi đúng ranh giới giữa hài hước và thô lỗ."
                    },
                    {
                        "en": "She often seems to tread a thin line between success and failure.",
                        "vi": "Cô ấy dường như luôn vạch ra một ranh giới mỏng manh giữa thành công và thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to become weaker or less acceptable",
                    "vi": "bắt đầu trở nên yếu hơn hoặc ít có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "These excuses are wearing a little thin (= because we've heard them so many times before).",
                        "vi": "Những lời bào chữa này hơi mỏng (= bởi vì chúng tôi đã nghe chúng rất nhiều lần trước đây)."
                    },
                    {
                        "en": "My patience is beginning to wear very thin.",
                        "vi": "Sự kiên nhẫn của tôi bắt đầu hao mòn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0cf201ea6a494d9d9056ac33630a271e",
        "word": "weight",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/weɪt/",
            "us": "/weɪt/"
        },
        "nearby": [
            {
                "word": "weigh on",
                "pos": "phrasal verb"
            },
            {
                "word": "weigh out",
                "pos": "phrasal verb"
            },
            {
                "word": "weight",
                "pos": "noun"
            },
            {
                "word": "weight",
                "pos": "verb"
            },
            {
                "word": "weight belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "how heavy somebody/something is, which can be measured in, for example, kilograms or pounds",
                    "vi": "ai đó / cái gì đó nặng bao nhiêu, có thể được đo bằng đơn vị, ví dụ: kilôgam hoặc pound"
                },
                "examples": [
                    {
                        "en": "in weight It is about 76 kilos in weight.",
                        "vi": "về trọng lượng Nó có trọng lượng khoảng 76 kg."
                    },
                    {
                        "en": "by weight Bananas are sold by weight.",
                        "vi": "theo trọng lượng Chuối được bán theo trọng lượng."
                    },
                    {
                        "en": "weight of… In the wild, this fish can reach a weight of 5lbs.",
                        "vi": "trọng lượng của… Trong tự nhiên, loài cá này có thể đạt trọng lượng 5lbs."
                    },
                    {
                        "en": "She is trying to lose weight (= become less heavy and less fat).",
                        "vi": "Cô ấy đang cố gắng giảm cân (= bớt nặng hơn và bớt béo hơn)."
                    },
                    {
                        "en": "He’s put on/gained weight (= become heavier and fatter) since he gave up smoking.",
                        "vi": "Anh ấy đã gầy đi / tăng cân (= trở nên nặng hơn và béo hơn) kể từ khi anh ấy từ bỏ hút thuốc."
                    },
                    {
                        "en": "No more for me. I have to watch my weight.",
                        "vi": "Không còn cho tôi nữa. Tôi phải xem cân nặng của mình."
                    },
                    {
                        "en": "He has now shed the extra weight.",
                        "vi": "Bây giờ anh ấy đã giảm cân."
                    },
                    {
                        "en": "Body fat increases rapidly as body weight increases.",
                        "vi": "Lượng mỡ trong cơ thể tăng nhanh khi trọng lượng cơ thể tăng lên."
                    },
                    {
                        "en": "The point is to achieve permanent weight loss.",
                        "vi": "Mục đích là để giảm cân vĩnh viễn."
                    },
                    {
                        "en": "Stress can cause weight gain.",
                        "vi": "Căng thẳng có thể gây tăng cân."
                    },
                    {
                        "en": "Sam has a weight problem (= is too fat).",
                        "vi": "Sam có vấn đề về cân nặng (= quá béo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being heavy",
                    "vi": "thực tế là nặng nề"
                },
                "examples": [
                    {
                        "en": "weight of somebody/something The pillars have to support the weight of the roof.",
                        "vi": "trọng lượng của ai đó / cái gì đó Các cột trụ phải hỗ trợ trọng lượng của mái nhà."
                    },
                    {
                        "en": "I just hoped the branch would take my weight.",
                        "vi": "Tôi chỉ hy vọng cành sẽ giảm cân cho tôi."
                    },
                    {
                        "en": "under the weight He staggered a little under the weight of his backpack.",
                        "vi": "dưới sức nặng Anh loạng choạng một chút dưới sức nặng của ba lô."
                    },
                    {
                        "en": "The table collapsed under their weight.",
                        "vi": "Bàn bị sụp xuống dưới sức nặng của họ."
                    },
                    {
                        "en": "Don't put any weight on that ankle for at least a week.",
                        "vi": "Không đặt bất kỳ trọng lượng nào lên mắt cá chân đó trong ít nhất một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is heavy",
                    "vi": "một vật nặng"
                },
                "examples": [
                    {
                        "en": "The doctor said he should not lift heavy weights.",
                        "vi": "Bác sĩ nói không nên nâng tạ nặng."
                    },
                    {
                        "en": "Heavy weights should be lifted with a straight back.",
                        "vi": "- Nên nâng tạ nặng với tư thế thẳng lưng."
                    },
                    {
                        "en": "Consider adding weight training and aerobic exercises to your routine.",
                        "vi": "Cân nhắc thêm các bài tập tạ và bài tập aerobic vào thói quen của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object used to keep something in position or as part of a machine",
                    "vi": "một đối tượng được sử dụng để giữ một cái gì đó ở vị trí hoặc như một bộ phận của máy móc"
                },
                "examples": [
                    {
                        "en": "weights on a fishing line",
                        "vi": "trọng lượng trên một dây câu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a great responsibility or worry",
                    "vi": "một trách nhiệm lớn hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "The full weight of responsibility falls on her.",
                        "vi": "Toàn bộ trách nhiệm đổ lên đầu cô ấy."
                    },
                    {
                        "en": "The news was certainly a weight off my mind (= I did not have to worry about it any more).",
                        "vi": "Tin tức đó chắc chắn là một trọng lượng lớn đối với tâm trí của tôi (= Tôi không phải lo lắng về nó nữa)."
                    },
                    {
                        "en": "Finally telling the truth was a great weight off my shoulders.",
                        "vi": "Cuối cùng thì việc nói ra sự thật là một sức nặng đè nặng lên vai tôi."
                    },
                    {
                        "en": "He was buckling under the weight of his responsibilities.",
                        "vi": "Anh ấy đang oằn mình dưới sức nặng của những trách nhiệm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "importance, influence or strength",
                    "vi": "tầm quan trọng, ảnh hưởng hoặc sức mạnh"
                },
                "examples": [
                    {
                        "en": "The many letters of support added weight to the campaign.",
                        "vi": "Nhiều lá thư ủng hộ đã tăng thêm sức nặng cho chiến dịch."
                    },
                    {
                        "en": "The President has now offered to lend his weight to the project.",
                        "vi": "Tổng thống hiện đã đề nghị cho vay nặng lãi của mình đối với dự án."
                    },
                    {
                        "en": "Your opinion carries weight with the boss.",
                        "vi": "Ý kiến của bạn có sức nặng với sếp."
                    },
                    {
                        "en": "How can you ignore the sheer weight of medical opinion?",
                        "vi": "Làm thế nào bạn có thể bỏ qua trọng lượng tuyệt đối của ý kiến y tế?"
                    },
                    {
                        "en": "The weight of evidence against her is overwhelming.",
                        "vi": "Sức nặng của bằng chứng chống lại cô ấy là quá lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit or system of units by which weight is measured",
                    "vi": "một đơn vị hoặc hệ thống các đơn vị đo trọng lượng"
                },
                "examples": [
                    {
                        "en": "tables of weights and measures",
                        "vi": "bảng trọng lượng và thước đo"
                    },
                    {
                        "en": "imperial/metric weight",
                        "vi": "trọng lượng theo hệ đo lường Anh / hệ mét"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of metal that is known to weigh a particular amount and is used to measure the weight of something, or lifted by people to improve their strength and as a sport",
                    "vi": "một mảnh kim loại được biết là có trọng lượng cụ thể và được sử dụng để đo trọng lượng của vật gì đó hoặc được người ta nâng lên để cải thiện sức mạnh của họ và như một môn thể thao"
                },
                "examples": [
                    {
                        "en": "a set of weights",
                        "vi": "một bộ trọng lượng"
                    },
                    {
                        "en": "a light/heavy weight",
                        "vi": "trọng lượng nhẹ / nặng"
                    },
                    {
                        "en": "She lifts weights as part of her training.",
                        "vi": "Cô ấy nâng tạ như một phần của quá trình tập luyện của mình."
                    },
                    {
                        "en": "He does a lot of weight training.",
                        "vi": "Anh ấy tập tạ rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have influence with somebody",
                    "vi": "có ảnh hưởng với ai đó"
                },
                "examples": [
                    {
                        "en": "My views don't carry much weight with the boss.",
                        "vi": "Quan điểm của tôi không có nhiều sức nặng với ông chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is too much of something",
                    "vi": "từng nói rằng có quá nhiều thứ"
                },
                "examples": [
                    {
                        "en": "The table groaned under the weight of the biggest buffet they had ever seen.",
                        "vi": "Chiếc bàn rên rỉ dưới sức nặng của bữa tiệc buffet lớn nhất mà họ từng thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work as hard as everyone else in a job, an activity, etc.",
                    "vi": "làm việc chăm chỉ như mọi người trong một công việc, một hoạt động, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be or try to be more successful than others in doing something that normally requires more skill, experience, money, etc. than you have",
                    "vi": "để trở thành hoặc cố gắng thành công hơn những người khác khi làm một điều gì đó thường đòi hỏi nhiều kỹ năng, kinh nghiệm, tiền bạc, v.v. hơn bạn có"
                },
                "examples": [
                    {
                        "en": "This player seems to be able to constantly punch above his weight.",
                        "vi": "Cầu thủ này dường như có thể liên tục đấm vượt quá trọng lượng của mình."
                    },
                    {
                        "en": "He punched above his weight as the party’s foreign affairs spokesman.",
                        "vi": "Anh ta đã đấm trên trọng lượng của mình với tư cách là phát ngôn viên đối ngoại của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit down and rest, especially when you are tired",
                    "vi": "ngồi xuống và nghỉ ngơi, đặc biệt là khi bạn mệt mỏi"
                },
                "examples": [
                    {
                        "en": "Come and sit down and take the weight off your feet for a while.",
                        "vi": "Hãy đến và ngồi xuống và lấy tạ ra khỏi chân của bạn một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use your position of authority or power in an aggressive way in order to achieve what you want",
                    "vi": "sử dụng vị trí quyền lực hoặc quyền lực của bạn một cách tích cực để đạt được những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "She was a good manager, who didn’t find it necessary to throw her weight around.",
                        "vi": "Cô ấy là một người quản lý tốt, người không thấy cần thiết phải xoay xở cân nặng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use all your influence and power to support something",
                    "vi": "sử dụng tất cả ảnh hưởng và sức mạnh của bạn để hỗ trợ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The government has thrown its weight behind the anti-pollution campaign.",
                        "vi": "Chính phủ đã bỏ trọng lượng của mình đằng sau chiến dịch chống ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the combined power, strength or influence of a group",
                    "vi": "sức mạnh tổng hợp, sức mạnh hoặc ảnh hưởng của một nhóm"
                },
                "examples": [
                    {
                        "en": "They won the argument by sheer weight of numbers.",
                        "vi": "Họ đã thắng trong cuộc tranh luận bởi trọng lượng tuyệt đối của các con số."
                    }
                ]
            },
            {
                "define": {
                    "en": "very useful or valuable",
                    "vi": "rất hữu ích hoặc có giá trị"
                },
                "examples": [
                    {
                        "en": "A good mechanic is worth his weight in gold.",
                        "vi": "Một người thợ giỏi đáng giá bằng vàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "fe914a4c95de4c70b402abf6caef57d5",
        "word": "figure",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfɪɡə(r)/",
            "us": "/ˈfɪɡjər/"
        },
        "nearby": [
            {
                "word": "figurative",
                "pos": "adjective"
            },
            {
                "word": "figuratively",
                "pos": "adverb"
            },
            {
                "word": "figure",
                "pos": "noun"
            },
            {
                "word": "figure",
                "pos": "verb"
            },
            {
                "word": "figured",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a number representing a particular amount, especially one given in official information",
                    "vi": "một số đại diện cho một số tiền cụ thể, đặc biệt là một số được đưa ra trong thông tin chính thức"
                },
                "examples": [
                    {
                        "en": "the latest sales/crime/unemployment figures",
                        "vi": "số liệu bán hàng / tội phạm / thất nghiệp mới nhất"
                    },
                    {
                        "en": "Official figures indicate that crime is falling.",
                        "vi": "Các số liệu chính thức cho thấy tội phạm đang giảm."
                    },
                    {
                        "en": "Figures for April show a slight improvement on previous months.",
                        "vi": "Số liệu của tháng 4 cho thấy sự cải thiện nhẹ so với các tháng trước."
                    },
                    {
                        "en": "By 2017, this figure had risen to 14 million.",
                        "vi": "Đến năm 2017, con số này đã tăng lên 14 triệu."
                    },
                    {
                        "en": "Viewing figures for the series have dropped dramatically.",
                        "vi": "Số lượt xem của bộ truyện đã giảm đáng kể."
                    },
                    {
                        "en": "Figures released by the hospital reveal a rise in the number of admissions.",
                        "vi": "Các số liệu do bệnh viện công bố cho thấy sự gia tăng số lượng bệnh nhân nhập viện."
                    },
                    {
                        "en": "Experts put the real figure at closer to 75%.",
                        "vi": "Các chuyên gia đưa ra con số thực gần 75%."
                    },
                    {
                        "en": "according to… figures According to government figures, 3.6 million children are living in poverty.",
                        "vi": "theo… số liệu Theo số liệu của chính phủ, 3,6 triệu trẻ em đang sống trong cảnh nghèo đói."
                    },
                    {
                        "en": "Her argument is backed up with plenty of facts and figures.",
                        "vi": "Lập luận của cô ấy được chứng minh với rất nhiều dữ kiện và số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a symbol rather than a word representing one of the numbers between 0 and 9",
                    "vi": "một biểu tượng thay vì một từ đại diện cho một trong các số từ 0 đến 9"
                },
                "examples": [
                    {
                        "en": "Write the figure ‘7’ on the board.",
                        "vi": "Viết hình '7' lên bảng."
                    },
                    {
                        "en": "paths built in the shape of a figure 8",
                        "vi": "đường dẫn được xây dựng theo hình số 8"
                    },
                    {
                        "en": "a six-figure salary (= over 100 000 pounds or dollars)",
                        "vi": "mức lương sáu con số (= hơn 100 000 bảng Anh hoặc đô la)"
                    },
                    {
                        "en": "in… figures Her salary is now in six figures.",
                        "vi": "bằng… con số Mức lương của cô ấy bây giờ là sáu con số."
                    },
                    {
                        "en": "My unread email was in triple figures (= more than 100).",
                        "vi": "Email chưa đọc của tôi có gấp ba con số (= hơn 100)."
                    },
                    {
                        "en": "Ticket prices for the show are likely to be into three figures (= at least 100 pounds or dollars).",
                        "vi": "Giá vé cho buổi biểu diễn có thể là ba con số (= ít nhất 100 bảng Anh hoặc đô la)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area of mathematics that deals with adding, multiplying, etc. numbers",
                    "vi": "lĩnh vực toán học liên quan đến các số cộng, nhân, v.v."
                },
                "examples": [
                    {
                        "en": "Are you any good at figures?",
                        "vi": "Bạn có giỏi về số liệu không?"
                    },
                    {
                        "en": "I'm afraid I don't have a head for figures (= I am not good at adding, etc.).",
                        "vi": "Tôi e rằng tôi không có đầu cho các số liệu (= Tôi không giỏi trong việc bổ sung, v.v.)."
                    },
                    {
                        "en": "I was never very good at figures.",
                        "vi": "Tôi không bao giờ giỏi về số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of the type mentioned",
                    "vi": "một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "a leading figure in the music industry",
                        "vi": "một nhân vật hàng đầu trong ngành công nghiệp âm nhạc"
                    },
                    {
                        "en": "a senior figure in the organization",
                        "vi": "một nhân vật cấp cao trong tổ chức"
                    },
                    {
                        "en": "a key/prominent/central figure",
                        "vi": "một nhân vật chính / nổi bật / trung tâm"
                    },
                    {
                        "en": "King's widow, Coretta Scott King, later became a public figure in her own right.",
                        "vi": "Bà góa của King, Coretta Scott King, sau đó đã trở thành người của công chúng theo cách riêng của bà."
                    },
                    {
                        "en": "teachers and other authority figures",
                        "vi": "giáo viên và các nhân vật chính quyền khác"
                    },
                    {
                        "en": "figure of something a figure of authority/ridicule",
                        "vi": "hình ảnh của một cái gì đó một hình ảnh của quyền lực / chế nhạo"
                    },
                    {
                        "en": "He was a well-known figure in London at that time.",
                        "vi": "Ông là một nhân vật nổi tiếng ở London vào thời điểm đó."
                    },
                    {
                        "en": "one of the most popular figures in athletics",
                        "vi": "một trong những nhân vật phổ biến nhất trong môn điền kinh"
                    },
                    {
                        "en": "When she last saw him, he was a sad figure—old and tired.",
                        "vi": "Khi cô nhìn thấy anh lần cuối, anh là một hình bóng buồn bã - già nua và mệt mỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of a person seen from a distance or not clearly",
                    "vi": "hình dạng của một người nhìn từ xa hoặc không rõ ràng"
                },
                "examples": [
                    {
                        "en": "There before him stood a tall figure in black.",
                        "vi": "Trước mặt anh là một bóng người cao lớn mặc đồ đen."
                    },
                    {
                        "en": "A shadowy figure can be seen through the window.",
                        "vi": "Một bóng người có thể được nhìn thấy qua cửa sổ."
                    },
                    {
                        "en": "The seated figure in the corner beckoned me over.",
                        "vi": "Người ngồi trong góc ra hiệu cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of the human body, especially a woman’s body that is attractive",
                    "vi": "hình dạng của cơ thể con người, đặc biệt là cơ thể phụ nữ hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She's always had a good figure.",
                        "vi": "Cô ấy luôn có một thân hình đẹp."
                    },
                    {
                        "en": "I'm watching my figure (= trying not to get fat).",
                        "vi": "Tôi đang xem hình dáng của mình (= cố gắng không béo lên)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an animal in a drawing, painting, etc., or in a story",
                    "vi": "một người hoặc một con vật trong bức vẽ, bức tranh, v.v., hoặc trong một câu chuyện"
                },
                "examples": [
                    {
                        "en": "The central figure in the painting is the artist's daughter.",
                        "vi": "Nhân vật trung tâm trong bức tranh là con gái của họa sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statue of a person or an animal",
                    "vi": "một bức tượng của một người hoặc một con vật"
                },
                "examples": [
                    {
                        "en": "a bronze figure of a horse",
                        "vi": "một con ngựa bằng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture, diagram, etc. in a book, that is referred to by a number or letter",
                    "vi": "một bức tranh, sơ đồ, v.v. trong sách, được đề cập đến bằng một số hoặc chữ cái"
                },
                "examples": [
                    {
                        "en": "The results are illustrated in figure 3 opposite.",
                        "vi": "Kết quả được minh họa trong hình 3 ngược lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular shape formed by lines or surfaces",
                    "vi": "một hình dạng cụ thể được tạo thành bởi các đường hoặc bề mặt"
                },
                "examples": [
                    {
                        "en": "a five-sided figure",
                        "vi": "một hình năm cạnh"
                    },
                    {
                        "en": "a solid figure",
                        "vi": "một con số rắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a pattern or series of movements performed on ice",
                    "vi": "một mô hình hoặc một loạt các chuyển động được thực hiện trên băng"
                },
                "examples": [
                    {
                        "en": "The skater executed a perfect set of figures.",
                        "vi": "Vận động viên trượt băng đã thực hiện một bộ số liệu hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become somebody that other people laugh at",
                    "vi": "trở thành / trở thành người mà người khác cười nhạo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a particular appearance",
                    "vi": "để có một ngoại hình cụ thể"
                },
                "examples": [
                    {
                        "en": "He cut a striking figure in his white dinner jacket.",
                        "vi": "Anh ấy tạo ra một thân hình nổi bật trong chiếc áo khoác dạ màu trắng của mình."
                    },
                    {
                        "en": "He cut a dashing figure in his uniform.",
                        "vi": "Anh ấy tạo ra một hình thể bảnh bao trong bộ đồng phục của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "accurate and detailed information",
                    "vi": "thông tin chính xác và chi tiết"
                },
                "examples": [
                    {
                        "en": "I've asked to see all the facts and figures before I make a decision.",
                        "vi": "Tôi đã yêu cầu xem tất cả các dữ kiện và số liệu trước khi đưa ra quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say the exact price or number of something",
                    "vi": "để nói giá hoặc số lượng chính xác của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It’s impossible to put a figure on the number of homeless people in London.",
                        "vi": "Không thể đặt một con số về số lượng người vô gia cư ở London."
                    },
                    {
                        "en": "You can't put a dollar figure on the lives ruined by the hurricane.",
                        "vi": "Bạn không thể đặt một con số đô la cho những cuộc đời bị hủy hoại bởi cơn bão."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab86f570c133443c8eec1b65d0799999",
        "word": "obese",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/əʊˈbiːs/",
            "us": "/əʊˈbiːs/"
        },
        "nearby": [
            {
                "word": "obelisk",
                "pos": "noun"
            },
            {
                "word": "Oberon",
                "pos": ""
            },
            {
                "word": "obese",
                "pos": "adjective"
            },
            {
                "word": "obesity",
                "pos": "noun"
            },
            {
                "word": "obey",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very fat, in a way that is not healthy",
                    "vi": "rất béo, theo cách không lành mạnh"
                },
                "examples": [
                    {
                        "en": "Obese patients are given dietary advice.",
                        "vi": "Bệnh nhân béo phì được tư vấn về chế độ ăn uống."
                    },
                    {
                        "en": "She is grossly obese.",
                        "vi": "Cô ấy quá béo phì."
                    }
                ]
            }
        ]
    },
    {
        "id": "d39117e31eca4c97ab603cbeda9ba990",
        "word": "obesity",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əʊˈbiːsəti/",
            "us": "/əʊˈbiːsəti/"
        },
        "nearby": [
            {
                "word": "Oberon",
                "pos": ""
            },
            {
                "word": "obese",
                "pos": "adjective"
            },
            {
                "word": "obesity",
                "pos": "noun"
            },
            {
                "word": "obey",
                "pos": "verb"
            },
            {
                "word": "obfuscate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality or fact of being very fat, in a way that is not healthy",
                    "vi": "chất lượng hoặc thực tế là rất béo, theo cách không lành mạnh"
                },
                "examples": [
                    {
                        "en": "Obesity can increase the risk of heart disease.",
                        "vi": "Béo phì có thể làm tăng nguy cơ mắc bệnh tim."
                    }
                ]
            }
        ]
    },
    {
        "id": "032438a102c840319f408e726f3d026f",
        "word": "overweight",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌəʊvəˈweɪt/",
            "us": "/ˌəʊvərˈweɪt/"
        },
        "nearby": [
            {
                "word": "overview",
                "pos": "noun"
            },
            {
                "word": "overweening",
                "pos": "adjective"
            },
            {
                "word": "overweight",
                "pos": "adjective"
            },
            {
                "word": "overwhelm",
                "pos": "verb"
            },
            {
                "word": "overwhelming",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too heavy, in a way that may be unhealthy",
                    "vi": "quá nặng, theo cách có thể không tốt cho sức khỏe"
                },
                "examples": [
                    {
                        "en": "She was only a few pounds overweight.",
                        "vi": "Cô chỉ thừa cân vài kg."
                    },
                    {
                        "en": "A number of medical conditions are due to being overweight.",
                        "vi": "Một số tình trạng bệnh lý là do thừa cân."
                    },
                    {
                        "en": "You don’t look overweight.",
                        "vi": "Trông bạn không bị thừa cân."
                    }
                ]
            },
            {
                "define": {
                    "en": "above an allowed weight",
                    "vi": "trên trọng lượng cho phép"
                },
                "examples": [
                    {
                        "en": "overweight baggage",
                        "vi": "hành lý quá cân"
                    }
                ]
            }
        ]
    },
    {
        "id": "3e236765603e4d41aea51152512cdbaa",
        "word": "skinny",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈskɪni/",
            "us": "/ˈskɪni/"
        },
        "nearby": [
            {
                "word": "B F Skinner",
                "pos": ""
            },
            {
                "word": "skinner",
                "pos": "verb"
            },
            {
                "word": "skinny",
                "pos": "adjective"
            },
            {
                "word": "skinny",
                "pos": "noun"
            },
            {
                "word": "skinny-dipping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very thin, especially in a way that you find unpleasant or ugly",
                    "vi": "rất mỏng, đặc biệt là theo cách mà bạn thấy khó chịu hoặc xấu xí"
                },
                "examples": [
                    {
                        "en": "skinny legs",
                        "vi": "Đôi chân gầy"
                    },
                    {
                        "en": "He was such a skinny kid.",
                        "vi": "Anh ấy là một đứa trẻ gầy gò."
                    },
                    {
                        "en": "She had wild hair and long skinny arms.",
                        "vi": "Cô có mái tóc hoang dại và cánh tay dài gầy guộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "designed to fit closely to the body",
                    "vi": "được thiết kế ôm sát vào cơ thể"
                },
                "examples": [
                    {
                        "en": "skinny jeans",
                        "vi": "skinny jeans"
                    }
                ]
            },
            {
                "define": {
                    "en": "low in fat",
                    "vi": "IT chât beo"
                },
                "examples": [
                    {
                        "en": "a skinny latte",
                        "vi": "một ly latte gầy"
                    }
                ]
            }
        ]
    },
    {
        "id": "b5c234321c2c4befbf16d4c194d3e226",
        "word": "underweight",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌʌndəˈweɪt/",
            "us": "/ˌʌndərˈweɪt/"
        },
        "nearby": [
            {
                "word": "underway",
                "pos": "adjective"
            },
            {
                "word": "underwear",
                "pos": "noun"
            },
            {
                "word": "underweight",
                "pos": "adjective"
            },
            {
                "word": "underwent",
                "pos": "verb"
            },
            {
                "word": "underwhelmed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "weighing less than the normal or expected weight",
                    "vi": "cân nặng ít hơn trọng lượng bình thường hoặc trọng lượng dự kiến"
                },
                "examples": [
                    {
                        "en": "The baby was dangerously underweight at birth.",
                        "vi": "Em bé nhẹ cân một cách nguy hiểm khi sinh ra."
                    },
                    {
                        "en": "She is a few pounds underweight for (= in relation to) her height.",
                        "vi": "Cô ấy nhẹ cân vài pound so với (= so với) chiều cao của cô ấy."
                    },
                    {
                        "en": "Her daughter was seriously underweight.",
                        "vi": "Con gái cô bị nhẹ cân trầm trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "34cc15469d534c7a948149261a72a42e",
        "word": "muscular",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmʌskjələ(r)/",
            "us": "/ˈmʌskjələr/"
        },
        "nearby": [
            {
                "word": "muscle memory",
                "pos": "noun"
            },
            {
                "word": "muscovado",
                "pos": "noun"
            },
            {
                "word": "muscular",
                "pos": "adjective"
            },
            {
                "word": "muscular dystrophy",
                "pos": "noun"
            },
            {
                "word": "musculature",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to the muscles",
                    "vi": "liên quan đến cơ bắp"
                },
                "examples": [
                    {
                        "en": "muscular tension/power/tissue",
                        "vi": "căng cơ / sức mạnh / mô"
                    }
                ]
            },
            {
                "define": {
                    "en": "having large strong muscles",
                    "vi": "có cơ bắp to khỏe"
                },
                "examples": [
                    {
                        "en": "a muscular body/build/chest",
                        "vi": "một cơ thể vạm vỡ / xây dựng / ngực"
                    },
                    {
                        "en": "He was tall, lean and muscular.",
                        "vi": "Anh ta cao, gầy và vạm vỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9dbb161d70f4eb198e0555e6e1fa257",
        "word": "slender",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈslendə(r)/",
            "us": "/ˈslendər/"
        },
        "nearby": [
            {
                "word": "sleigh",
                "pos": "noun"
            },
            {
                "word": "sleight of hand",
                "pos": "noun"
            },
            {
                "word": "slender",
                "pos": "adjective"
            },
            {
                "word": "slenderness",
                "pos": "noun"
            },
            {
                "word": "slept",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thin in an attractive way",
                    "vi": "gầy một cách hấp dẫn"
                },
                "examples": [
                    {
                        "en": "her slender figure",
                        "vi": "dáng người mảnh mai của cô ấy"
                    },
                    {
                        "en": "long, slender fingers",
                        "vi": "ngón tay thon dài"
                    },
                    {
                        "en": "a slender young woman",
                        "vi": "một phụ nữ trẻ mảnh mai"
                    }
                ]
            },
            {
                "define": {
                    "en": "thin or narrow",
                    "vi": "mỏng hoặc hẹp"
                },
                "examples": [
                    {
                        "en": "a glass with a slender stem",
                        "vi": "một chiếc ly có thân mảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "small in amount or size and hardly enough",
                    "vi": "số lượng hoặc kích thước nhỏ và hầu như không đủ"
                },
                "examples": [
                    {
                        "en": "to win by a slender margin/majority",
                        "vi": "để giành chiến thắng với tỷ lệ chênh lệch / đa số"
                    },
                    {
                        "en": "people of slender means (= with little money)",
                        "vi": "những người mảnh khảnh (= ít tiền)"
                    },
                    {
                        "en": "Australia held a slender 1–0 lead at half-time.",
                        "vi": "Úc đã dẫn trước 1–0 sau hiệp một."
                    },
                    {
                        "en": "These claims are based on slender evidence.",
                        "vi": "Những tuyên bố này dựa trên bằng chứng mảnh mai."
                    }
                ]
            }
        ]
    },
    {
        "id": "568e01250e1c4dd090bc759e15627e95",
        "word": "beanpole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbiːnpəʊl/",
            "us": "/ˈbiːnpəʊl/"
        },
        "nearby": [
            {
                "word": "beano",
                "pos": "noun"
            },
            {
                "word": "the Beano",
                "pos": ""
            },
            {
                "word": "beanpole",
                "pos": "noun"
            },
            {
                "word": "bean sprouts",
                "pos": "noun"
            },
            {
                "word": "beanstalk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall thin person",
                    "vi": "một người cao gầy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "155886c2bad24d3796befe1e47c51e04",
        "word": "beefy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbiːfi/",
            "us": "/ˈbiːfi/"
        },
        "nearby": [
            {
                "word": "beef tomato",
                "pos": "noun"
            },
            {
                "word": "beef up",
                "pos": "phrasal verb"
            },
            {
                "word": "beefy",
                "pos": "adjective"
            },
            {
                "word": "the Bee Gees",
                "pos": ""
            },
            {
                "word": "beehive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "big or fat",
                    "vi": "to hay béo"
                },
                "examples": [
                    {
                        "en": "beefy men/arms/thighs",
                        "vi": "đàn ông / cánh tay / đùi lực lưỡng"
                    },
                    {
                        "en": "The doctor was summoned to his bedside.",
                        "vi": "Bác sĩ được triệu tập đến bên giường bệnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "f6eb20cec36e45d68d6b63adad14501c",
        "word": "beer belly",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪə beli/",
            "us": "/ˈbɪr beli/"
        },
        "nearby": [
            {
                "word": "beeper",
                "pos": "noun"
            },
            {
                "word": "beer",
                "pos": "noun"
            },
            {
                "word": "beer belly",
                "pos": "noun"
            },
            {
                "word": "Max Beerbohm",
                "pos": ""
            },
            {
                "word": "beer cellar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very fat stomach, especially one caused by drinking a lot of beer over a long period",
                    "vi": "bụng rất béo, đặc biệt là do uống nhiều bia trong thời gian dài"
                },
                "examples": [
                    {
                        "en": "He's only twenty but he already has a beer belly.",
                        "vi": "Anh ấy mới đôi mươi nhưng đã có một cái bụng bia rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c09abbeadb346e1917d6e637c923d81",
        "word": "bingo wings",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪŋɡəʊ wɪŋz/",
            "us": "/ˈbɪŋɡəʊ wɪŋz/"
        },
        "nearby": [
            {
                "word": "bingo",
                "pos": "noun"
            },
            {
                "word": "bingo",
                "pos": "exclamation"
            },
            {
                "word": "bingo wings",
                "pos": "noun"
            },
            {
                "word": "binky",
                "pos": "noun"
            },
            {
                "word": "bin liner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "long folds of loose skin and fat that hang down from the upper arms, especially of older people",
                    "vi": "những nếp gấp dài của da chùng và mỡ thòng xuống từ bắp tay, đặc biệt là ở những người lớn tuổi"
                },
                "examples": [
                    {
                        "en": "The exercises will tone your arm muscles and banish bingo wings.",
                        "vi": "Các bài tập sẽ làm săn chắc cơ tay của bạn và trục xuất cánh cờ lô tô."
                    },
                    {
                        "en": "Wave goodbye to bingo wings.",
                        "vi": "Vẫy chào tạm biệt những cánh lô tô."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2eccfbc19e84e8a9806a4fe616bf546",
        "word": "bony",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbəʊni/",
            "us": "/ˈbəʊni/"
        },
        "nearby": [
            {
                "word": "bon vivant",
                "pos": "noun"
            },
            {
                "word": "bon voyage",
                "pos": "exclamation"
            },
            {
                "word": "bony",
                "pos": "adjective"
            },
            {
                "word": "bonze",
                "pos": "noun"
            },
            {
                "word": "bonzer",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very thin so that the bones can be seen under the skin",
                    "vi": "rất mỏng để có thể nhìn thấy xương dưới da"
                },
                "examples": [
                    {
                        "en": "a bony hand",
                        "vi": "bàn tay xương xẩu"
                    },
                    {
                        "en": "a tall bony man",
                        "vi": "một người đàn ông cao xương"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of small bones",
                    "vi": "đầy xương nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "consisting of or like bone",
                    "vi": "bao gồm hoặc giống như xương"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "170fb4dae2bd4b9e841a6811f4409ca0",
        "word": "brawny",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbrɔːni/",
            "us": "/ˈbrɔːni/"
        },
        "nearby": [
            {
                "word": "brawler",
                "pos": "noun"
            },
            {
                "word": "brawn",
                "pos": "noun"
            },
            {
                "word": "brawny",
                "pos": "adjective"
            },
            {
                "word": "bray",
                "pos": "noun"
            },
            {
                "word": "bray",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strong muscles",
                    "vi": "có cơ bắp khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "He was a great brawny brute of a man.",
                        "vi": "Anh ta là một kẻ vũ phu cơ bắp tuyệt vời của một người đàn ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "6dbaaed1066d42edae48f1f2944419ec",
        "word": "cadaverous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈdævərəs/",
            "us": "/kəˈdævərəs/"
        },
        "nearby": [
            {
                "word": "CAD",
                "pos": "noun"
            },
            {
                "word": "cadaver",
                "pos": "noun"
            },
            {
                "word": "cadaverous",
                "pos": "adjective"
            },
            {
                "word": "Cadbury",
                "pos": ""
            },
            {
                "word": "CADCAM",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely pale, thin and looking ill",
                    "vi": "cực kỳ xanh xao, gầy và trông ốm yếu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0e5acb09b754a3a9bec585fb20e14f2",
        "word": "chubbiness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃʌbinəs/",
            "us": "/ˈtʃʌbinəs/"
        },
        "nearby": [
            {
                "word": "chub",
                "pos": "noun"
            },
            {
                "word": "Chubb",
                "pos": "noun"
            },
            {
                "word": "chubbiness",
                "pos": "noun"
            },
            {
                "word": "chubby",
                "pos": "adjective"
            },
            {
                "word": "chuck",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being slightly fat in a way that people usually find attractive",
                    "vi": "chất lượng hơi béo theo cách mà mọi người thường thấy hấp dẫn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f34a96aeb76490383668e123bf2de22",
        "word": "chubby",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃʌbi/",
            "us": "/ˈtʃʌbi/"
        },
        "nearby": [
            {
                "word": "Chubb",
                "pos": "noun"
            },
            {
                "word": "chubbiness",
                "pos": "noun"
            },
            {
                "word": "chubby",
                "pos": "adjective"
            },
            {
                "word": "chuck",
                "pos": "verb"
            },
            {
                "word": "chuck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slightly fat in a way that people usually find attractive",
                    "vi": "hơi béo theo cách mà mọi người thường thấy hấp dẫn"
                },
                "examples": [
                    {
                        "en": "chubby cheeks/fingers/hands",
                        "vi": "má / ngón tay / bàn tay mũm mĩm"
                    },
                    {
                        "en": "She was eleven years old and pretty in a chubby sort of way.",
                        "vi": "Cô ấy mười một tuổi và xinh xắn theo kiểu mũm mĩm."
                    },
                    {
                        "en": "worried that he was getting rather chubby",
                        "vi": "lo lắng rằng anh ấy trở nên khá mập mạp"
                    },
                    {
                        "en": "Aah, look at his chubby little hands!",
                        "vi": "Aah, hãy nhìn đôi bàn tay nhỏ nhắn mũm mĩm của anh ấy!"
                    }
                ]
            }
        ]
    },
    {
        "id": "c0388667c8404887b51da1f8ad279ca7",
        "word": "corpulence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːpjələns/",
            "us": "/ˈkɔːrpjələns/"
        },
        "nearby": [
            {
                "word": "corpse",
                "pos": "noun"
            },
            {
                "word": "corpsman",
                "pos": "noun"
            },
            {
                "word": "corpulence",
                "pos": "noun"
            },
            {
                "word": "corpulent",
                "pos": "adjective"
            },
            {
                "word": "corpus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being fat. People say ‘corpulence’ to avoid saying ‘ fatness ’.",
                    "vi": "thực tế là béo. Người ta nói \"béo\" để tránh nói \"béo\"."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba8cd642430a41d3a48838b2dce3a92d",
        "word": "corpulent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːpjələnt/",
            "us": "/ˈkɔːrpjələnt/"
        },
        "nearby": [
            {
                "word": "corpsman",
                "pos": "noun"
            },
            {
                "word": "corpulence",
                "pos": "noun"
            },
            {
                "word": "corpulent",
                "pos": "adjective"
            },
            {
                "word": "corpus",
                "pos": "noun"
            },
            {
                "word": "Corpus Christi",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fat. People say ‘corpulent’ to avoid saying ‘fat’.",
                    "vi": "mập mạp. Người ta nói \"béo\" để tránh nói \"béo\"."
                },
                "examples": [
                    {
                        "en": "He is a short, somewhat corpulent, man.",
                        "vi": "Anh ta là một người đàn ông thấp bé, hơi hào hoa."
                    }
                ]
            }
        ]
    },
    {
        "id": "c97f4ae0d6974b0c96ee03edb7ba19ac",
        "word": "ectomorph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈektəʊmɔːf/",
            "us": "/ˈektəʊmɔːrf/"
        },
        "nearby": [
            {
                "word": "ecstatically",
                "pos": "adverb"
            },
            {
                "word": "ECT",
                "pos": "abbreviation"
            },
            {
                "word": "ectomorph",
                "pos": "noun"
            },
            {
                "word": "-ectomy",
                "pos": "combining form"
            },
            {
                "word": "ectopic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose natural body shape is thin",
                    "vi": "một người có hình dạng cơ thể tự nhiên là gầy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f54484eccaad491a8f55d0a954045931",
        "word": "endomorph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈendəʊmɔːf/",
            "us": "/ˈendəʊmɔːrf/"
        },
        "nearby": [
            {
                "word": "endogenous",
                "pos": "adjective"
            },
            {
                "word": "endoglossic",
                "pos": "adjective"
            },
            {
                "word": "endomorph",
                "pos": "noun"
            },
            {
                "word": "endonormative",
                "pos": "adjective"
            },
            {
                "word": "endoplasm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose natural body shape is round, with a lot of fat",
                    "vi": "một người có hình dạng cơ thể tự nhiên là tròn, nhiều mỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "27a7e78ee83b4d678aebddcb96d76ee0",
        "word": "flabby",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæbi/",
            "us": "/ˈflæbi/"
        },
        "nearby": [
            {
                "word": "flab",
                "pos": "noun"
            },
            {
                "word": "flabbergasted",
                "pos": "adjective"
            },
            {
                "word": "flabby",
                "pos": "adjective"
            },
            {
                "word": "flaccid",
                "pos": "adjective"
            },
            {
                "word": "flack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "covered with soft, loose fat; fat",
                    "vi": "bao phủ bởi lớp mỡ mềm, lỏng lẻo; mập mạp"
                },
                "examples": [
                    {
                        "en": "flabby thighs",
                        "vi": "đùi nhão"
                    },
                    {
                        "en": "He’s got soft and flabby since he gave up running.",
                        "vi": "Anh ấy trở nên mềm và mềm hơn kể từ khi anh ấy từ bỏ việc chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "weak; with no strength or force",
                    "vi": "Yếu; không có sức mạnh hoặc lực lượng"
                },
                "examples": [
                    {
                        "en": "a flabby grip",
                        "vi": "một tay cầm mềm mại"
                    },
                    {
                        "en": "a flabby argument",
                        "vi": "một lập luận lung tung"
                    }
                ]
            }
        ]
    },
    {
        "id": "7bd6c42571ba44ff858fd0d831212903",
        "word": "gangling",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋɡlɪŋ/",
            "us": "/ˈɡæŋɡlɪŋ/"
        },
        "nearby": [
            {
                "word": "gangbusters",
                "pos": "noun"
            },
            {
                "word": "gangland",
                "pos": "noun"
            },
            {
                "word": "gangling",
                "pos": "adjective"
            },
            {
                "word": "ganglion",
                "pos": "noun"
            },
            {
                "word": "gangmaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tall, thin and not moving in an easy way",
                    "vi": "cao, gầy và di chuyển không dễ dàng"
                },
                "examples": [
                    {
                        "en": "a gangling youth/adolescent",
                        "vi": "một thanh niên / vị thành niên gangling"
                    }
                ]
            }
        ]
    },
    {
        "id": "cdeb0bd8f2c54783bb0e11876e6dbb4d",
        "word": "gaunt",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɔːnt/",
            "us": "/ɡɔːnt/"
        },
        "nearby": [
            {
                "word": "gauge",
                "pos": "verb"
            },
            {
                "word": "Gaulish",
                "pos": "noun"
            },
            {
                "word": "gaunt",
                "pos": "adjective"
            },
            {
                "word": "gauntlet",
                "pos": "noun"
            },
            {
                "word": "gauntness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very thin, usually because of illness, not having enough food, or worry",
                    "vi": "rất gầy, thường là do bệnh tật, không đủ ăn, hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "a gaunt face",
                        "vi": "một khuôn mặt hốc hác"
                    },
                    {
                        "en": "She looked gaunt and exhausted.",
                        "vi": "Cô ấy trông gầy gò và kiệt sức."
                    },
                    {
                        "en": "The lean face had grown gaunt, the cheeks hollowed.",
                        "vi": "Khuôn mặt gầy gò đã trở nên hốc hác, hai má hóp lại."
                    },
                    {
                        "en": "her rather gaunt features",
                        "vi": "các tính năng khá gầy của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "not attractive and without any decoration",
                    "vi": "không hấp dẫn và không có bất kỳ trang trí"
                },
                "examples": [
                    {
                        "en": "the gaunt ruin of Pendragon Castle",
                        "vi": "đống đổ nát của lâu đài Pendragon"
                    }
                ]
            }
        ]
    },
    {
        "id": "29c81c9615374edea2a83b077006d1fc",
        "word": "lean",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/liːn/",
            "us": "/liːn/"
        },
        "nearby": [
            {
                "word": "lean",
                "pos": "verb"
            },
            {
                "word": "David Lean",
                "pos": ""
            },
            {
                "word": "lean",
                "pos": "adjective"
            },
            {
                "word": "lean",
                "pos": "noun"
            },
            {
                "word": "leaning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without much fat; thin and fit",
                    "vi": "không có nhiều chất béo; mỏng và vừa vặn"
                },
                "examples": [
                    {
                        "en": "He had a lean, muscular body.",
                        "vi": "Anh ta có một thân hình săn chắc, vạm vỡ."
                    },
                    {
                        "en": "He was tall, lean and handsome.",
                        "vi": "Anh ấy cao, gầy và đẹp trai."
                    },
                    {
                        "en": "The Frenchman's body looked lean and hard.",
                        "vi": "Cơ thể của cầu thủ người Pháp trông gầy và cứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing little or no fat",
                    "vi": "chứa ít hoặc không chứa chất béo"
                },
                "examples": [
                    {
                        "en": "a lean, tender piece of beef",
                        "vi": "một miếng thịt bò nạc, mềm"
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult and not producing much money, food, etc.",
                    "vi": "khó khăn và không sản xuất được nhiều tiền, lương thực, v.v."
                },
                "examples": [
                    {
                        "en": "a lean period/spell",
                        "vi": "một giai đoạn / chính tả gầy"
                    },
                    {
                        "en": "The company recovered well after going through several lean years.",
                        "vi": "Công ty đã phục hồi tốt sau khi trải qua vài năm gầy gò."
                    },
                    {
                        "en": "This is the leanest time of the year for the tourist industry.",
                        "vi": "Đây là thời điểm thuận lợi nhất trong năm của ngành du lịch."
                    },
                    {
                        "en": "Many animals have a lean time of it in winter.",
                        "vi": "Nhiều loài động vật có thời gian gầy gò vào mùa đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong and efficient because they avoid waste in their processes and do not have more employees than is necessary",
                    "vi": "mạnh mẽ và hiệu quả vì họ tránh lãng phí trong các quy trình của mình và không có nhiều nhân viên hơn mức cần thiết"
                },
                "examples": [
                    {
                        "en": "The changes made the company leaner and more competitive.",
                        "vi": "Những thay đổi đã làm cho công ty trở nên gọn gàng hơn và cạnh tranh hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "71f7ac269271461284cbdc0553086bdc",
        "word": "lissom",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪsəm/",
            "us": "/ˈlɪsəm/"
        },
        "nearby": [
            {
                "word": "lisp",
                "pos": "noun"
            },
            {
                "word": "lisp",
                "pos": "verb"
            },
            {
                "word": "lissom",
                "pos": "adjective"
            },
            {
                "word": "list",
                "pos": "noun"
            },
            {
                "word": "list",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thin and attractive",
                    "vi": "mỏng và hấp dẫn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2adb0b2ff62c433f82c673403eb156f6",
        "word": "love handles",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlʌv hændlz/",
            "us": "/ˈlʌv hændlz/"
        },
        "nearby": [
            {
                "word": "love child",
                "pos": "noun"
            },
            {
                "word": "loved-up",
                "pos": "adjective"
            },
            {
                "word": "love handles",
                "pos": "noun"
            },
            {
                "word": "love-hate relationship",
                "pos": "noun"
            },
            {
                "word": "love-in",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extra fat at the sides of a person’s waist (= middle part of the body)",
                    "vi": "mỡ thừa ở hai bên eo của một người (= phần giữa của cơ thể)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "39ff90842b454610b66de36b8dbe10f5",
        "word": "mesomorph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmezəmɔːf/",
            "us": "/ˈmezəmɔːrf/"
        },
        "nearby": [
            {
                "word": "mesmerize",
                "pos": "verb"
            },
            {
                "word": "mesmerizing",
                "pos": "adjective"
            },
            {
                "word": "mesomorph",
                "pos": "noun"
            },
            {
                "word": "mesophyll",
                "pos": "noun"
            },
            {
                "word": "the mesosphere",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose natural body shape is neither thin nor fat, with quite a lot of muscle",
                    "vi": "một người có hình dạng cơ thể tự nhiên không gầy cũng không béo, với khá nhiều cơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "294c1ea9fd0347c99796586d0b3a6a1a",
        "word": "petite",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/pəˈtiːt/",
            "us": "/pəˈtiːt/"
        },
        "nearby": [
            {
                "word": "petit bourgeois",
                "pos": "adjective"
            },
            {
                "word": "petit bourgeois",
                "pos": "noun"
            },
            {
                "word": "petite",
                "pos": "adjective"
            },
            {
                "word": "the petite bourgeoisie",
                "pos": "noun"
            },
            {
                "word": "petit four",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small and thin",
                    "vi": "nhỏ và mỏng"
                },
                "examples": [
                    {
                        "en": "a petite blonde",
                        "vi": "một cô gái tóc vàng nhỏ nhắn"
                    },
                    {
                        "en": "She was fair-haired and petite.",
                        "vi": "Cô ấy có mái tóc đẹp và nhỏ nhắn."
                    },
                    {
                        "en": "With her slim, petite figure, she could have been any age from 13 to 30.",
                        "vi": "Với dáng người mảnh mai, nhỏ nhắn, cô có thể ở bất kỳ độ tuổi nào từ 13 đến 30."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d05bd6ebb874454b85aff057e517cdc",
        "word": "plump",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/plʌmp/",
            "us": "/plʌmp/"
        },
        "nearby": [
            {
                "word": "plummet",
                "pos": "verb"
            },
            {
                "word": "plummy",
                "pos": "adjective"
            },
            {
                "word": "plump",
                "pos": "adjective"
            },
            {
                "word": "plump",
                "pos": "verb"
            },
            {
                "word": "plump for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a soft, round body; slightly fat",
                    "vi": "có thân hình tròn, mềm; hơi mập"
                },
                "examples": [
                    {
                        "en": "a short, plump woman",
                        "vi": "một người phụ nữ thấp, đầy đặn"
                    },
                    {
                        "en": "His plump face was pink with embarrassment.",
                        "vi": "Khuôn mặt bầu bĩnh ửng hồng vì xấu hổ."
                    },
                    {
                        "en": "That dress makes you look rather plump.",
                        "vi": "Chiếc váy đó khiến bạn trông khá đầy đặn."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking soft, full and attractive to use or eat",
                    "vi": "nhìn mềm, đầy đặn và hấp dẫn để dùng hoặc ăn"
                },
                "examples": [
                    {
                        "en": "plump cushions",
                        "vi": "đệm đầy đặn"
                    },
                    {
                        "en": "plump tomatoes",
                        "vi": "cà chua đầy đặn"
                    }
                ]
            }
        ]
    },
    {
        "id": "e9fa454955ee485cbd1b2e5b4c390dc1",
        "word": "podgy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒdʒi/",
            "us": "/ˈpɑːdʒi/"
        },
        "nearby": [
            {
                "word": "podcaster",
                "pos": "noun"
            },
            {
                "word": "podcasting",
                "pos": "noun"
            },
            {
                "word": "podgy",
                "pos": "adjective"
            },
            {
                "word": "podiatrist",
                "pos": "noun"
            },
            {
                "word": "podiatry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slightly fat",
                    "vi": "hơi mập"
                },
                "examples": [
                    {
                        "en": "podgy arms",
                        "vi": "cánh tay mập mạp"
                    }
                ]
            }
        ]
    },
    {
        "id": "2b2a475e380f4be3a9d58b0b109b9622",
        "word": "porky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔːki/",
            "us": "/ˈpɔːrki/"
        },
        "nearby": [
            {
                "word": "pork scratchings",
                "pos": "noun"
            },
            {
                "word": "porky",
                "pos": "noun"
            },
            {
                "word": "porky",
                "pos": "adjective"
            },
            {
                "word": "Porky Pig",
                "pos": ""
            },
            {
                "word": "porn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fat",
                    "vi": "mập mạp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5c61d4c1fba6445b9fdc4834939a54c1",
        "word": "portly",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔːtli/",
            "us": "/ˈpɔːrtli/"
        },
        "nearby": [
            {
                "word": "Portland",
                "pos": ""
            },
            {
                "word": "Portland cement",
                "pos": "noun"
            },
            {
                "word": "portly",
                "pos": "adjective"
            },
            {
                "word": "portmanteau",
                "pos": "noun"
            },
            {
                "word": "portmanteau",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "rather fat",
                    "vi": "khá béo"
                },
                "examples": [
                    {
                        "en": "The waiter was a portly middle-aged man.",
                        "vi": "Người phục vụ là một người đàn ông trung niên đẫy đà."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9ee628207fe4bbc849c66cbdada660c",
        "word": "pot-bellied",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɒt ˈbelid/",
            "us": "/ˌpɑːt ˈbelid/"
        },
        "nearby": [
            {
                "word": "the potato famine",
                "pos": ""
            },
            {
                "word": "potato masher",
                "pos": "noun"
            },
            {
                "word": "pot-bellied",
                "pos": "adjective"
            },
            {
                "word": "pot belly",
                "pos": "noun"
            },
            {
                "word": "potbelly stove",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a large stomach that sticks out",
                    "vi": "có một cái bụng lớn lòi ra ngoài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "99e0fdc0e9a14b32b0fd57fcf3a45543",
        "word": "rangy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪndʒi/",
            "us": "/ˈreɪndʒi/"
        },
        "nearby": [
            {
                "word": "range with",
                "pos": "phrasal verb"
            },
            {
                "word": "rangoli",
                "pos": "noun"
            },
            {
                "word": "rangy",
                "pos": "adjective"
            },
            {
                "word": "rani",
                "pos": "noun"
            },
            {
                "word": "rank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having long thin arms and/or legs",
                    "vi": "có cánh tay và / hoặc chân dài gầy"
                },
                "examples": [
                    {
                        "en": "a tall rangy boy with dark hair",
                        "vi": "một cậu bé tóc đen cao lớn"
                    },
                    {
                        "en": "a rangy breed of cattle",
                        "vi": "một giống gia súc rang"
                    }
                ]
            }
        ]
    },
    {
        "id": "8656031c310a440e91d6e4aff3299adf",
        "word": "roly-poly",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrəʊli ˈpəʊli/",
            "us": "/ˌrəʊli ˈpəʊli/"
        },
        "nearby": [
            {
                "word": "roll-up",
                "pos": "noun"
            },
            {
                "word": "roly-poly",
                "pos": "noun"
            },
            {
                "word": "roly-poly",
                "pos": "adjective"
            },
            {
                "word": "ROM",
                "pos": "noun"
            },
            {
                "word": "the Roma",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short, round and fat",
                    "vi": "ngắn, tròn và béo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5912cb7061fc4445b7c807cf3c76be0e",
        "word": "rotund",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rəʊˈtʌnd/",
            "us": "/rəʊˈtʌnd/"
        },
        "nearby": [
            {
                "word": "rotter",
                "pos": "noun"
            },
            {
                "word": "Rottweiler",
                "pos": "noun"
            },
            {
                "word": "rotund",
                "pos": "adjective"
            },
            {
                "word": "rotunda",
                "pos": "noun"
            },
            {
                "word": "rotundity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a fat round body",
                    "vi": "có một thân hình béo tròn"
                },
                "examples": [
                    {
                        "en": "the rotund figure of Mr Stevens",
                        "vi": "nhân vật thối rữa của Mr Stevens"
                    }
                ]
            }
        ]
    },
    {
        "id": "6ea2c657415f45569758b28497149125",
        "word": "rotundity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rəʊˈtʌndəti/",
            "us": "/rəʊˈtʌndəti/"
        },
        "nearby": [
            {
                "word": "rotund",
                "pos": "adjective"
            },
            {
                "word": "rotunda",
                "pos": "noun"
            },
            {
                "word": "rotundity",
                "pos": "noun"
            },
            {
                "word": "rouble",
                "pos": "noun"
            },
            {
                "word": "roué",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of having a fat round body",
                    "vi": "thực tế là có một thân hình béo tròn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8694825cbe944fdf847601f660c5a3b7",
        "word": "scrawny",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskrɔːni/",
            "us": "/ˈskrɔːni/"
        },
        "nearby": [
            {
                "word": "scrawl",
                "pos": "verb"
            },
            {
                "word": "scrawl",
                "pos": "noun"
            },
            {
                "word": "scrawny",
                "pos": "adjective"
            },
            {
                "word": "scream",
                "pos": "verb"
            },
            {
                "word": "scream",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very thin in a way that is not attractive",
                    "vi": "rất mỏng theo cách không hấp dẫn"
                },
                "examples": [
                    {
                        "en": "He had long scrawny fingers.",
                        "vi": "Anh ta có những ngón tay dài gầy guộc."
                    },
                    {
                        "en": "There were a few scrawny chickens in the yard.",
                        "vi": "Trong sân có vài con gà gầy còm."
                    }
                ]
            }
        ]
    },
    {
        "id": "f56a3017b5854e9fb282f4f18321ede2",
        "word": "sinewy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪnjuːi/",
            "us": "/ˈsɪnjuːi/"
        },
        "nearby": [
            {
                "word": "sine qua non",
                "pos": "noun"
            },
            {
                "word": "sinew",
                "pos": "noun"
            },
            {
                "word": "sinewy",
                "pos": "adjective"
            },
            {
                "word": "sinfonietta",
                "pos": "noun"
            },
            {
                "word": "sinful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a thin body and strong muscles",
                    "vi": "có một cơ thể gầy và cơ bắp khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "The runner was tall and sinewy.",
                        "vi": "Người chạy cao và gân guốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "f69aede5352241c28d6700dbd6357499",
        "word": "slight",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/slaɪt/",
            "us": "/slaɪt/"
        },
        "nearby": [
            {
                "word": "sliding door",
                "pos": "noun"
            },
            {
                "word": "sliding scale",
                "pos": "noun"
            },
            {
                "word": "slight",
                "pos": "adjective"
            },
            {
                "word": "slight",
                "pos": "noun"
            },
            {
                "word": "slight",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very small in degree",
                    "vi": "mức độ rất nhỏ"
                },
                "examples": [
                    {
                        "en": "a slight increase/change/difference",
                        "vi": "tăng nhẹ / thay đổi / khác biệt"
                    },
                    {
                        "en": "a slight variation/improvement/advantage",
                        "vi": "một biến thể nhỏ / cải tiến / lợi thế"
                    },
                    {
                        "en": "It won't make the slightest bit of difference",
                        "vi": "Nó sẽ không tạo ra một chút khác biệt nào"
                    },
                    {
                        "en": "There's been a slight delay, but we'll be landing in just a few minutes.",
                        "vi": "Có một chút chậm trễ, nhưng chúng tôi sẽ hạ cánh chỉ trong vài phút nữa."
                    },
                    {
                        "en": "Mexican producers may gain a slight edge in competitiveness.",
                        "vi": "Các nhà sản xuất Mexico có thể đạt được một chút lợi thế trong khả năng cạnh tranh."
                    },
                    {
                        "en": "A slight smile appeared on her lips.",
                        "vi": "Một nụ cười nhẹ nở trên môi cô."
                    },
                    {
                        "en": "I woke up with a slight headache.",
                        "vi": "Tôi thức dậy với một cơn đau đầu nhẹ."
                    },
                    {
                        "en": "The damage was slight.",
                        "vi": "Thiệt hại nhẹ."
                    },
                    {
                        "en": "She takes offence at the slightest thing (= is very easily offended).",
                        "vi": "Cô ấy xúc phạm ở điều nhỏ nhất (= rất dễ bị xúc phạm)."
                    },
                    {
                        "en": "There was not the slightest hint of trouble.",
                        "vi": "Không có một chút rắc rối nào."
                    },
                    {
                        "en": "He is, without the slightest doubt, the greatest living novelist.",
                        "vi": "Không nghi ngờ gì nữa, ông là tiểu thuyết gia vĩ đại nhất còn sống."
                    },
                    {
                        "en": "He never had the slightest intention of agreeing to it.",
                        "vi": "Anh chưa bao giờ có ý định đồng ý dù chỉ một chút."
                    },
                    {
                        "en": "The picture was at a slight angle.",
                        "vi": "Hình ảnh ở một góc nhỏ."
                    },
                    {
                        "en": "A slight breeze was blowing.",
                        "vi": "Một cơn gió nhẹ thổi qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "small and thin in size",
                    "vi": "kích thước nhỏ và mỏng"
                },
                "examples": [
                    {
                        "en": "a slight woman",
                        "vi": "một người phụ nữ nhẹ nhàng"
                    },
                    {
                        "en": "He was of slight build.",
                        "vi": "Anh ấy hơi gầy."
                    },
                    {
                        "en": "She was smaller and slighter than I had imagined.",
                        "vi": "Cô ấy nhỏ hơn và nhẹ hơn tôi tưởng tượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not deserving serious attention",
                    "vi": "không đáng được quan tâm nghiêm túc"
                },
                "examples": [
                    {
                        "en": "This is a very slight novel.",
                        "vi": "Đây là một cuốn tiểu thuyết rất nhẹ nhàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not at all",
                    "vi": "không có gì"
                },
                "examples": [
                    {
                        "en": "He didn't seem to mind in the slightest.",
                        "vi": "Anh ta dường như không bận tâm chút nào."
                    },
                    {
                        "en": "I’m not in the slightest bit interested.",
                        "vi": "Tôi không quan tâm một chút nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1fe960741c44d4881c4f2a329701ec6",
        "word": "spare tyre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌspeə ˈtaɪə(r)/",
            "us": "/ˌsper ˈtaɪər/"
        },
        "nearby": [
            {
                "word": "spare part",
                "pos": "noun"
            },
            {
                "word": "spare rib",
                "pos": "noun"
            },
            {
                "word": "spare tyre",
                "pos": "noun"
            },
            {
                "word": "sparing",
                "pos": "adjective"
            },
            {
                "word": "sparingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra wheel for a car",
                    "vi": "một bánh xe phụ cho một chiếc xe hơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large area of too much fat around the middle part of somebody’s body",
                    "vi": "một vùng lớn có quá nhiều mỡ xung quanh phần giữa của cơ thể ai đó"
                },
                "examples": [
                    {
                        "en": "Vigorous exercise will help to get rid of your spare tyre.",
                        "vi": "Vận động mạnh sẽ giúp tháo lốp dự phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "08efcc83f5e54a24b64781d5d3741cdd",
        "word": "squat",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/skwɒt/",
            "us": "/skwɑːt/"
        },
        "nearby": [
            {
                "word": "squat",
                "pos": "verb"
            },
            {
                "word": "squat",
                "pos": "noun"
            },
            {
                "word": "squat",
                "pos": "adjective"
            },
            {
                "word": "squatter",
                "pos": "noun"
            },
            {
                "word": "squatter camp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short and wide or fat, in a way that is not attractive",
                    "vi": "ngắn và rộng hoặc béo, theo cách không hấp dẫn"
                },
                "examples": [
                    {
                        "en": "a squat tower",
                        "vi": "tháp ngồi xổm"
                    },
                    {
                        "en": "a squat muscular man with a shaven head",
                        "vi": "một người đàn ông cơ bắp ngồi xổm với cái đầu cạo trọc"
                    },
                    {
                        "en": "The man had a broad face and a squat neck.",
                        "vi": "Người đàn ông có khuôn mặt rộng và cổ ngồi xổm."
                    }
                ]
            }
        ]
    },
    {
        "id": "1005cbc8e44b4055a8852a44789ee29a",
        "word": "stockily",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɒkəli/",
            "us": "/ˈstɑːkəli/"
        },
        "nearby": [
            {
                "word": "stockfish",
                "pos": "noun"
            },
            {
                "word": "stockholder",
                "pos": "noun"
            },
            {
                "word": "stockily",
                "pos": "adverb"
            },
            {
                "word": "stock index",
                "pos": "noun"
            },
            {
                "word": "stockinet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short, with a strong, solid body",
                    "vi": "ngắn, với một cơ thể mạnh mẽ, rắn chắc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "084d5e53782f4b159bee1b05e31c2630",
        "word": "stocky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɒki/",
            "us": "/ˈstɑːki/"
        },
        "nearby": [
            {
                "word": "the Stockton and Darlington Railway",
                "pos": ""
            },
            {
                "word": "stock up",
                "pos": "phrasal verb"
            },
            {
                "word": "stocky",
                "pos": "adjective"
            },
            {
                "word": "stockyard",
                "pos": "noun"
            },
            {
                "word": "stodge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short, with a strong, solid body",
                    "vi": "ngắn, với một cơ thể mạnh mẽ, rắn chắc"
                },
                "examples": [
                    {
                        "en": "a stocky figure/build",
                        "vi": "một con số / xây dựng chắc nịch"
                    }
                ]
            }
        ]
    },
    {
        "id": "2053bb3a989b43baad6c24256d886db4",
        "word": "stout",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/staʊt/",
            "us": "/staʊt/"
        },
        "nearby": [
            {
                "word": "stoup",
                "pos": "noun"
            },
            {
                "word": "Stourhead",
                "pos": ""
            },
            {
                "word": "stout",
                "pos": "adjective"
            },
            {
                "word": "Rex Stout",
                "pos": ""
            },
            {
                "word": "stout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "rather fat",
                    "vi": "khá béo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "strong and thick",
                    "vi": "mạnh và dày"
                },
                "examples": [
                    {
                        "en": "a stout pair of shoes",
                        "vi": "một đôi giày mập mạp"
                    },
                    {
                        "en": "a stout stick",
                        "vi": "một cây gậy mập mạp"
                    }
                ]
            },
            {
                "define": {
                    "en": "brave and determined",
                    "vi": "dũng cảm và quyết tâm"
                },
                "examples": [
                    {
                        "en": "He put up a stout defence in court.",
                        "vi": "Anh ta đưa ra một biện pháp bảo vệ cứng rắn trước tòa."
                    },
                    {
                        "en": "This requires a stout heart.",
                        "vi": "Điều này đòi hỏi một trái tim kiên cường."
                    }
                ]
            }
        ]
    },
    {
        "id": "a62d4880b1944f7385302edcac5906d8",
        "word": "tubby",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʌbi/",
            "us": "/ˈtʌbi/"
        },
        "nearby": [
            {
                "word": "tuba",
                "pos": "noun"
            },
            {
                "word": "tubal",
                "pos": "adjective"
            },
            {
                "word": "tubby",
                "pos": "adjective"
            },
            {
                "word": "tube",
                "pos": "noun"
            },
            {
                "word": "tube light",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short and slightly fat",
                    "vi": "lùn và hơi mập"
                },
                "examples": []
            }
        ]
    }
]