[
    {
        "id": "278de14745e1415dac47365dd01ec9c4",
        "word": "background",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbækɡraʊnd/",
            "us": "/ˈbækɡraʊnd/"
        },
        "nearby": [
            {
                "word": "back-formation",
                "pos": "noun"
            },
            {
                "word": "backgammon",
                "pos": "noun"
            },
            {
                "word": "background",
                "pos": "noun"
            },
            {
                "word": "backhand",
                "pos": "noun"
            },
            {
                "word": "backhanded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the details of a person’s family, education, experience, etc.",
                    "vi": "thông tin chi tiết về gia đình, học vấn, kinh nghiệm của một người, v.v."
                },
                "examples": [
                    {
                        "en": "somebody's ethnic/genetic/cultural background",
                        "vi": "nền tảng dân tộc / di truyền / văn hóa của ai đó"
                    },
                    {
                        "en": "somebody's family/educational background",
                        "vi": "gia đình / nền tảng giáo dục của ai đó"
                    },
                    {
                        "en": "The job would suit someone with a business background.",
                        "vi": "Công việc sẽ phù hợp với những người có nền tảng kinh doanh."
                    },
                    {
                        "en": "We come from very different backgrounds but we get on well.",
                        "vi": "Chúng tôi đến từ những hoàn cảnh rất khác nhau nhưng chúng tôi hòa hợp với nhau."
                    },
                    {
                        "en": "background in something She has a background in journalism.",
                        "vi": "background in something Cô ấy có kiến thức về báo chí."
                    },
                    {
                        "en": "In the future, we will require background checks on airport employees.",
                        "vi": "Trong tương lai, chúng tôi sẽ yêu cầu kiểm tra lý lịch đối với nhân viên sân bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the circumstances or past events that help explain why something is how it is; information about these",
                    "vi": "hoàn cảnh hoặc sự kiện trong quá khứ giúp giải thích tại sao một cái gì đó lại như thế nào; thông tin về những"
                },
                "examples": [
                    {
                        "en": "I'm including a little background information on the situation.",
                        "vi": "Tôi đang cung cấp một chút thông tin cơ bản về tình hình."
                    },
                    {
                        "en": "background to something The book explains the complex historical background to the war.",
                        "vi": "background to something Cuốn sách giải thích bối cảnh lịch sử phức tạp của cuộc chiến."
                    },
                    {
                        "en": "against a background of something The elections are taking place against a background of violence.",
                        "vi": "chống lại bối cảnh của một cái gì đó Các cuộc bầu cử đang diễn ra trên nền của bạo lực."
                    },
                    {
                        "en": "background on something Our reporter can now provide more background on this story.",
                        "vi": "thông tin cơ bản về điều gì đó Phóng viên của chúng tôi hiện có thể cung cấp thêm thông tin cơ bản về câu chuyện này."
                    },
                    {
                        "en": "Can you give me more background on the company?",
                        "vi": "Bạn có thể cho tôi biết thêm thông tin về công ty được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a picture, photograph or view behind the main objects, people, etc.",
                    "vi": "phần của một bức tranh, ảnh chụp hoặc khung cảnh phía sau các đối tượng chính, con người, v.v."
                },
                "examples": [
                    {
                        "en": "in the background a photograph with trees in the background",
                        "vi": "trong nền một bức ảnh với cây trong nền"
                    },
                    {
                        "en": "A shadowy figure is visible in the background of the scene.",
                        "vi": "Một hình bóng mờ có thể nhìn thấy trong nền của cảnh."
                    },
                    {
                        "en": "against the… background The areas of water stood out against the dark background.",
                        "vi": "chống lại nền… Các vùng nước nổi bật trên nền tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in which people are not paying attention to somebody/something or not as much attention as they are paying to somebody/something else",
                    "vi": "một vị trí trong đó mọi người không chú ý đến ai đó / điều gì đó hoặc không chú ý nhiều như họ đang chú ý đến ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "The camerawork, the background music and the locations all contribute to the mood of the film.",
                        "vi": "Cảnh quay, nhạc nền và địa điểm đều góp phần tạo nên tâm trạng của bộ phim."
                    },
                    {
                        "en": "There was a lot of background noise (= that you could hear, but were not listening to).",
                        "vi": "Có rất nhiều tiếng ồn xung quanh (= bạn có thể nghe thấy nhưng không nghe thấy)."
                    },
                    {
                        "en": "background radiation",
                        "vi": "bức xạ nền"
                    },
                    {
                        "en": "in the background He prefers to remain in the background and let his assistant talk to the press.",
                        "vi": "trong nền Anh ấy muốn ở trong nền và để trợ lý của mình nói chuyện với báo chí."
                    },
                    {
                        "en": "A piano was playing gently in the background.",
                        "vi": "Một cây đàn piano đang nhẹ nhàng chơi trong nền."
                    },
                    {
                        "en": "Danger was always lurking in the background.",
                        "vi": "Nguy hiểm luôn rình rập ở hậu cảnh."
                    },
                    {
                        "en": "The issue has recently faded into the background.",
                        "vi": "Vấn đề gần đây đã trở nên mờ nhạt."
                    },
                    {
                        "en": "After the first scene, his character is relegated to the background.",
                        "vi": "Sau cảnh đầu tiên, nhân vật của anh ấy được đưa xuống nền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a colour or design on which something is painted, drawn, etc.",
                    "vi": "một màu sắc hoặc thiết kế mà trên đó một cái gì đó được vẽ, vẽ, v.v."
                },
                "examples": [
                    {
                        "en": "on a… background The name of the company is written in red on a white background.",
                        "vi": "trên nền… Tên công ty được viết bằng màu đỏ trên nền trắng."
                    },
                    {
                        "en": "against a… background Most paintings look good against a neutral background colour.",
                        "vi": "chống lại nền… Hầu hết các bức tranh trông đẹp khi có màu nền trung tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to tasks or processes that the user is not actively working on at the present time",
                    "vi": "được sử dụng để chỉ các nhiệm vụ hoặc quy trình mà người dùng không tích cực làm việc tại thời điểm hiện tại"
                },
                "examples": [
                    {
                        "en": "in the background Programs can be left running in the background.",
                        "vi": "trong nền Các chương trình có thể được để chạy trong nền."
                    },
                    {
                        "en": "Find and kill unwanted background processes like viruses and trojans.",
                        "vi": "Tìm và diệt các tiến trình nền không mong muốn như vi rút và trojan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave quietly when you are with a group of people so that they do not notice you",
                    "vi": "cư xử nhẹ nhàng khi bạn ở với một nhóm người để họ không chú ý đến bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d681db71cea44df487b05aaf2e583d90",
        "word": "home",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/həʊm/",
            "us": "/həʊm/"
        },
        "nearby": [
            {
                "word": "homburg",
                "pos": "noun"
            },
            {
                "word": "Home, Sweet Home",
                "pos": ""
            },
            {
                "word": "home",
                "pos": "noun"
            },
            {
                "word": "home",
                "pos": "adverb"
            },
            {
                "word": "home",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the house or flat that you live in, especially with your family",
                    "vi": "ngôi nhà hoặc căn hộ mà bạn đang ở, đặc biệt là với gia đình của bạn"
                },
                "examples": [
                    {
                        "en": "Old people prefer to stay in their own homes.",
                        "vi": "Người già thích ở nhà riêng."
                    },
                    {
                        "en": "His children were upset when he sold the family home.",
                        "vi": "Các con của ông đã rất buồn khi ông bán ngôi nhà của gia đình."
                    },
                    {
                        "en": "While travelling she missed the comforts of home.",
                        "vi": "Trong khi đi du lịch, cô ấy nhớ những tiện nghi như ở nhà."
                    },
                    {
                        "en": "She leaves home at 7 every day.",
                        "vi": "Cô ấy rời nhà lúc 7 giờ mỗi ngày."
                    },
                    {
                        "en": "He left home (= left his parents and began an independent life) at sixteen.",
                        "vi": "Anh rời nhà (= rời bỏ cha mẹ và bắt đầu cuộc sống tự lập) năm mười sáu tuổi."
                    },
                    {
                        "en": "The floods forced many people to flee their homes.",
                        "vi": "Lũ lụt khiến nhiều người phải rời bỏ nhà cửa."
                    },
                    {
                        "en": "from home I'll call you from home later.",
                        "vi": "từ nhà, tôi sẽ gọi cho bạn từ nhà sau."
                    },
                    {
                        "en": "stray dogs needing new homes",
                        "vi": "chó hoang cần nhà mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a house or flat, etc., when you think of it as property that can be bought and sold",
                    "vi": "một ngôi nhà hoặc căn hộ, v.v., khi bạn coi đó là tài sản có thể mua và bán"
                },
                "examples": [
                    {
                        "en": "a holiday/summer home",
                        "vi": "một kỳ nghỉ / nhà mùa hè"
                    },
                    {
                        "en": "A lot of new homes are being built on the edge of town.",
                        "vi": "Rất nhiều ngôi nhà mới đang được xây dựng ở ven thị trấn."
                    },
                    {
                        "en": "He'd always dreamed of owning his own home.",
                        "vi": "Anh luôn mơ ước được sở hữu ngôi nhà của riêng mình."
                    },
                    {
                        "en": "Buying a home can be a complicated business.",
                        "vi": "Mua nhà có thể là một công việc kinh doanh phức tạp."
                    },
                    {
                        "en": "The number of homes sold in January fell by 13% on the previous month.",
                        "vi": "Số lượng nhà bán được trong tháng 1 đã giảm 13% so với tháng trước."
                    },
                    {
                        "en": "Private home ownership is increasing faster than ever.",
                        "vi": "Sở hữu nhà riêng đang tăng nhanh hơn bao giờ hết."
                    },
                    {
                        "en": "They applied for a home improvement loan.",
                        "vi": "Họ đã đăng ký một khoản vay để cải thiện nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the town, district, country, etc. that you come from, or where you are living and that you feel you belong to",
                    "vi": "thị trấn, huyện, quốc gia, v.v. mà bạn đến hoặc nơi bạn đang sống và bạn cảm thấy mình thuộc về"
                },
                "examples": [
                    {
                        "en": "I often think about my friends back home.",
                        "vi": "Tôi thường nghĩ về những người bạn của tôi ở quê nhà."
                    },
                    {
                        "en": "Jane left England and made Greece her home.",
                        "vi": "Jane rời Anh và biến Hy Lạp trở thành quê hương của mình."
                    },
                    {
                        "en": "be home to somebody Jamaica is home to over two million people.",
                        "vi": "là quê hương của ai đó Jamaica là quê hương của hơn hai triệu người."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a family living together, and the way it behaves",
                    "vi": "được sử dụng để chỉ một gia đình sống cùng nhau và cách nó cư xử"
                },
                "examples": [
                    {
                        "en": "She came from a violent home.",
                        "vi": "Cô ấy đến từ một ngôi nhà bạo lực."
                    },
                    {
                        "en": "They wanted to give the boy a secure and loving home.",
                        "vi": "Họ muốn cho cậu bé một ngôi nhà an toàn và yêu thương."
                    },
                    {
                        "en": "He had always wanted a real home with a wife and children.",
                        "vi": "Anh luôn muốn có một mái ấm thực sự với vợ con."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people who cannot care for themselves live and are cared for by others",
                    "vi": "nơi mà những người không thể tự chăm sóc mình sống và được người khác chăm sóc"
                },
                "examples": [
                    {
                        "en": "a children’s home",
                        "vi": "nhà trẻ em"
                    },
                    {
                        "en": "an old people’s home",
                        "vi": "nhà của một người già"
                    },
                    {
                        "en": "a retirement home",
                        "vi": "một ngôi nhà hưu trí"
                    },
                    {
                        "en": "a home for the mentally ill",
                        "vi": "nhà cho người bệnh tâm thần"
                    },
                    {
                        "en": "in a home She has lived in a home since she was six.",
                        "vi": "trong một ngôi nhà Cô ấy đã sống trong một ngôi nhà từ khi cô ấy lên sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where pets with no owner are taken care of",
                    "vi": "một nơi mà thú cưng không có chủ được chăm sóc"
                },
                "examples": [
                    {
                        "en": "a dogs’/cats’ home",
                        "vi": "nhà của chó / mèo"
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where a plant or animal usually lives; the place where somebody/something can be found",
                    "vi": "nơi mà thực vật hoặc động vật thường sinh sống; nơi mà ai đó / thứ gì đó có thể được tìm thấy"
                },
                "examples": [
                    {
                        "en": "This region is the home of many species of wild flower.",
                        "vi": "Vùng này là quê hương của nhiều loài hoa dại."
                    },
                    {
                        "en": "The tiger's home is in the jungle.",
                        "vi": "Nhà của hổ là trong rừng rậm."
                    },
                    {
                        "en": "Beverly Hills is the home of the stars.",
                        "vi": "Beverly Hills là ngôi nhà của các ngôi sao."
                    },
                    {
                        "en": "home to somebody/something The Rockies are home to bears and mountain lions.",
                        "vi": "nhà của ai đó / cái gì đó The Rockies là nhà của gấu và sư tử núi."
                    },
                    {
                        "en": "Arizona is home to the Grand Canyon and the Petrified Forest.",
                        "vi": "Arizona là quê hương của Grand Canyon và Rừng hóa đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where an object is kept",
                    "vi": "nơi lưu giữ một đồ vật"
                },
                "examples": [
                    {
                        "en": "We haven't found a home for all our books yet.",
                        "vi": "Chúng tôi vẫn chưa tìm thấy nhà cho tất cả các cuốn sách của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where something was first discovered, made or invented",
                    "vi": "nơi mà cái gì đó lần đầu tiên được khám phá, chế tạo hoặc phát minh ra"
                },
                "examples": [
                    {
                        "en": "New Orleans, the home of jazz",
                        "vi": "New Orleans, quê hương của nhạc jazz"
                    },
                    {
                        "en": "Greece, the home of democracy",
                        "vi": "Hy Lạp, quê hương của nền dân chủ"
                    },
                    {
                        "en": "Andalusia, the home of flamenco",
                        "vi": "Andalusia, quê hương của flamenco"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a person’s own house, flat, etc.",
                    "vi": "trong nhà riêng của một người, căn hộ, v.v."
                },
                "examples": [
                    {
                        "en": "I called round last night, but you weren't at home.",
                        "vi": "Tôi đã gọi điện thoại vào đêm qua, nhưng bạn không có ở nhà."
                    },
                    {
                        "en": "Oh no, I left my purse at home.",
                        "vi": "Ồ không, tôi để quên ví ở nhà."
                    },
                    {
                        "en": "He lived at home (= with his parents) until he was thirty.",
                        "vi": "Anh ấy sống ở nhà (= với cha mẹ) cho đến khi anh ấy ba mươi tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "comfortable and relaxed",
                    "vi": "thoải mái và thư giãn"
                },
                "examples": [
                    {
                        "en": "Sit down and make yourself at home.",
                        "vi": "Ngồi xuống và tự làm như ở nhà."
                    },
                    {
                        "en": "Simon feels very at home on a horse.",
                        "vi": "Simon cảm thấy như đang ở nhà trên một con ngựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "in somebody’s own country, not in a foreign country",
                    "vi": "ở đất nước của ai đó, không phải ở nước ngoài"
                },
                "examples": [
                    {
                        "en": "The president is not as popular at home as he is abroad.",
                        "vi": "Tổng thống không nổi tiếng ở trong nước như ở nước ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sports team plays at home, it plays in the town, etc. that it comes from",
                    "vi": "nếu một đội thể thao chơi ở nhà, thì đội đó chơi ở thị trấn, v.v. mà đội đó đến từ"
                },
                "examples": [
                    {
                        "en": "Leeds are playing at home this weekend.",
                        "vi": "Leeds được chơi trên sân nhà vào cuối tuần này."
                    },
                    {
                        "en": "Is the match on Saturday at home or away?",
                        "vi": "Trận đấu vào thứ Bảy trên sân nhà hay sân khách?"
                    }
                ]
            },
            {
                "define": {
                    "en": "away from a person’s own house, flat, etc.",
                    "vi": "xa nhà riêng của một người, căn hộ, v.v."
                },
                "examples": [
                    {
                        "en": "He works away from home during the week.",
                        "vi": "Anh ấy đi làm ăn xa trong tuần."
                    },
                    {
                        "en": "I don't want to be away from home for too long.",
                        "vi": "Tôi không muốn xa nhà quá lâu."
                    },
                    {
                        "en": "Her job means she's away from home for weeks at a time.",
                        "vi": "Công việc của cô ấy có nghĩa là cô ấy phải vắng nhà hàng tuần liền."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sports team plays away from home, it plays in the town, etc. that its opponent comes from",
                    "vi": "nếu một đội thể thao thi đấu trên sân khách, đội đó chơi trong thị trấn, v.v. mà đối thủ của họ đến từ"
                },
                "examples": [
                    {
                        "en": "The side has scored 24 goals away from home this season.",
                        "vi": "Đội đã ghi được 24 bàn thắng trên sân khách mùa này."
                    },
                    {
                        "en": "The team are playing away from home.",
                        "vi": "Đội đang thi đấu trên sân khách."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should help and care for your own family, etc. before you start helping other people",
                    "vi": "bạn nên giúp đỡ và quan tâm đến gia đình của mình, v.v. trước khi bắt đầu giúp đỡ người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a remark or topic of discussion is close to home, it is accurate or connected with you in a way that makes you uncomfortable or embarrassed",
                    "vi": "nếu một nhận xét hoặc chủ đề thảo luận gần nhà, nó là chính xác hoặc có liên quan đến bạn theo cách khiến bạn không thoải mái hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "Her remarks about me were embarrassingly close to home.",
                        "vi": "Những lời nhận xét của cô ấy về tôi thật đáng xấu hổ khi ở gần nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "that involves somebody directly",
                    "vi": "liên quan trực tiếp đến ai đó"
                },
                "examples": [
                    {
                        "en": "The next year tragedy struck much closer to home.",
                        "vi": "Thảm kịch năm sau ập đến gần nhà hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat a lot of somebody else’s food",
                    "vi": "ăn nhiều thức ăn của người khác"
                },
                "examples": [
                    {
                        "en": "How much longer is he staying? He’s eating us out of house and home.",
                        "vi": "Anh ta sẽ ở lại bao lâu nữa? Anh ta đang ăn thịt chúng tôi ra khỏi nhà và nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you feel relaxed and comfortable as if you were in your own home",
                    "vi": "một nơi mà bạn cảm thấy thư giãn và thoải mái như thể bạn đang ở trong chính ngôi nhà của mình"
                },
                "examples": [
                    {
                        "en": "The guests are made to feel that the hotel is a home from home.",
                        "vi": "Du khách sẽ cảm thấy rằng khách sạn là một ngôi nhà như ở nhà."
                    },
                    {
                        "en": "The hotel's friendly atmosphere makes it a real home (away) from home.",
                        "vi": "Bầu không khí thân thiện của khách sạn làm cho nó trở thành một ngôi nhà thực sự (xa nhà)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a home is where the people you love are",
                    "vi": "nhà là nơi có những người bạn yêu thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say how pleasant your home is (especially when you really mean that it is not pleasant at all)",
                    "vi": "được sử dụng để nói ngôi nhà của bạn dễ chịu như thế nào (đặc biệt là khi bạn thực sự muốn nói rằng nó không dễ chịu chút nào)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person’s home is a place where they can be private and safe and do as they like",
                    "vi": "nhà của một người là nơi mà họ có thể riêng tư và an toàn và làm theo ý thích của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(used especially about a couple) to start living in a new place",
                    "vi": "(được sử dụng đặc biệt là về một cặp vợ chồng) để bắt đầu sống ở một nơi mới"
                },
                "examples": [
                    {
                        "en": "They got married and set up home together in Hull.",
                        "vi": "Họ kết hôn và cùng nhau lập gia đình ở Hull."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where you are happiest, especially a country where you feel you belong more than in your own country because you share the ideas and attitudes of the people who live there",
                    "vi": "nơi mà bạn hạnh phúc nhất, đặc biệt là một đất nước mà bạn cảm thấy mình thuộc về hơn đất nước của mình vì bạn chia sẻ ý tưởng và thái độ của những người sống ở đó"
                },
                "examples": [
                    {
                        "en": "When she moved to Italy, she knew she'd found her true spiritual home.",
                        "vi": "Khi chuyển đến Ý, cô biết mình đã tìm thấy ngôi nhà tinh thần thực sự của mình."
                    },
                    {
                        "en": "The first time he visited New Orleans he knew he had found his spiritual home.",
                        "vi": "Lần đầu tiên đến thăm New Orleans, anh biết mình đã tìm thấy ngôi nhà thiêng liêng của mình."
                    },
                    {
                        "en": "I had always thought of India as my spiritual home.",
                        "vi": "Tôi đã luôn nghĩ về Ấn Độ là quê hương tinh thần của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize a question about somebody/something",
                    "vi": "được sử dụng để nhấn mạnh một câu hỏi về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Who's she when she's at home? (= I don't know her)",
                        "vi": "Cô ấy là ai khi cô ấy ở nhà? (= Tôi không biết cô ấy)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do your job in your own home, especially a job that is usually done in an office",
                    "vi": "để làm công việc của bạn tại nhà riêng của bạn, đặc biệt là một công việc thường được thực hiện trong văn phòng"
                },
                "examples": [
                    {
                        "en": "I usually work from home on Fridays.",
                        "vi": "Tôi thường làm việc tại nhà vào các ngày thứ Sáu."
                    }
                ]
            }
        ]
    },
    {
        "id": "d684aea1cc404992af4981fe98750a93",
        "word": "family tree",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfæməli ˈtriː/",
            "us": "/ˌfæməli ˈtriː/"
        },
        "nearby": [
            {
                "word": "family style",
                "pos": "adverb"
            },
            {
                "word": "family-style",
                "pos": "adjective"
            },
            {
                "word": "family tree",
                "pos": "noun"
            },
            {
                "word": "family values",
                "pos": "noun"
            },
            {
                "word": "famine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a diagram that shows the relationship between members of a family over a long period of time",
                    "vi": "một biểu đồ thể hiện mối quan hệ giữa các thành viên trong một gia đình trong một khoảng thời gian dài"
                },
                "examples": [
                    {
                        "en": "How far back can you trace your family tree?",
                        "vi": "Bạn có thể theo dõi cây gia đình của mình bao xa?"
                    }
                ]
            }
        ]
    },
    {
        "id": "d837179c71e84eaf824b17b49817389f",
        "word": "generation",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌdʒenəˈreɪʃn/",
            "us": "/ˌdʒenəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "the General Synod",
                "pos": ""
            },
            {
                "word": "generate",
                "pos": "verb"
            },
            {
                "word": "generation",
                "pos": "noun"
            },
            {
                "word": "generational",
                "pos": "adjective"
            },
            {
                "word": "the generation gap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the people who were born at about the same time",
                    "vi": "tất cả những người được sinh ra vào cùng một thời điểm"
                },
                "examples": [
                    {
                        "en": "the younger/older generation",
                        "vi": "thế hệ trẻ / già"
                    },
                    {
                        "en": "My generation have grown up with the internet.",
                        "vi": "Thế hệ của tôi đã lớn lên cùng với internet."
                    },
                    {
                        "en": "I often wonder what future generations will make of our efforts.",
                        "vi": "Tôi thường tự hỏi thế hệ tương lai sẽ làm được gì cho những nỗ lực của chúng ta."
                    },
                    {
                        "en": "The hopes and dreams of youth today are different from those of previous generations.",
                        "vi": "Những hy vọng và ước mơ của tuổi trẻ hôm nay khác với những thế hệ trước."
                    },
                    {
                        "en": "generation of somebody Her books have delighted generations of children.",
                        "vi": "thế hệ của ai đó Những cuốn sách của cô đã làm hài lòng nhiều thế hệ trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "the average time in which children grow up, become adults and have children of their own, (usually considered to be about 30 years)",
                    "vi": "thời gian trung bình mà trẻ em lớn lên, trở thành người lớn và có con riêng, (thường được coi là khoảng 30 tuổi)"
                },
                "examples": [
                    {
                        "en": "Many more people go to university now than a generation ago.",
                        "vi": "Nhiều người đã vào đại học bây giờ hơn một thế hệ trước."
                    },
                    {
                        "en": "for a generation My family have lived in this house for generations",
                        "vi": "trong một thế hệ Gia đình tôi đã sống trong ngôi nhà này qua nhiều thế hệ"
                    },
                    {
                        "en": "These decisions will affect our children for generations to come.",
                        "vi": "Những quyết định này sẽ ảnh hưởng đến con cái của chúng ta cho các thế hệ sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a single stage in the history of a family",
                    "vi": "một giai đoạn duy nhất trong lịch sử của một gia đình"
                },
                "examples": [
                    {
                        "en": "stories passed down from generation to generation",
                        "vi": "những câu chuyện được truyền từ thế hệ này sang thế hệ khác"
                    },
                    {
                        "en": "Five generations of his family had been farmers.",
                        "vi": "Năm thế hệ trong gia đình ông đều là nông dân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people of similar age involved in a particular activity",
                    "vi": "một nhóm người ở độ tuổi tương tự tham gia vào một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "He influenced my generation more than any other actor.",
                        "vi": "Anh ấy ảnh hưởng đến thế hệ của tôi nhiều hơn bất kỳ diễn viên nào khác."
                    },
                    {
                        "en": "of your generation He was by far the most talented player of his generation.",
                        "vi": "của thế hệ của bạn cho đến nay Anh ấy là cầu thủ tài năng nhất trong thế hệ của anh ấy."
                    },
                    {
                        "en": "generation of somebody the current generation of writers",
                        "vi": "thế hệ của ai đó thế hệ nhà văn hiện tại"
                    },
                    {
                        "en": "She has inspired a whole generation of fashion school graduates.",
                        "vi": "Cô đã truyền cảm hứng cho cả một thế hệ sinh viên tốt nghiệp trường thời trang."
                    },
                    {
                        "en": "The system is failing an entire generation of students.",
                        "vi": "Hệ thống đang làm hỏng cả một thế hệ học sinh."
                    },
                    {
                        "en": "It is a book that has captivated generation after generation of readers.",
                        "vi": "Đó là cuốn sách đã làm say đắm biết bao thế hệ độc giả."
                    },
                    {
                        "en": "a transfer of power to a new generation of leaders",
                        "vi": "sự chuyển giao quyền lực cho một thế hệ lãnh đạo mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a stage in the development of a product, usually a technical one",
                    "vi": "một giai đoạn phát triển sản phẩm, thường là một giai đoạn kỹ thuật"
                },
                "examples": [
                    {
                        "en": "fifth-generation computing",
                        "vi": "máy tính thế hệ thứ năm"
                    },
                    {
                        "en": "a new generation of vehicle",
                        "vi": "một thế hệ xe mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "the production of something, especially electricity, heat, etc.",
                    "vi": "sản xuất một thứ gì đó, đặc biệt là điện, nhiệt, v.v."
                },
                "examples": [
                    {
                        "en": "the generation of electricity",
                        "vi": "sản xuất điện"
                    },
                    {
                        "en": "methods of income generation",
                        "vi": "các phương pháp tạo thu nhập"
                    },
                    {
                        "en": "different methods of power generation",
                        "vi": "các phương pháp sản xuất điện khác nhau"
                    }
                ]
            }
        ]
    },
    {
        "id": "c62f829496fd466caaa55ff41acb3ba1",
        "word": "only child",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌəʊnli ˈtʃaɪld/",
            "us": "/ˌəʊnli ˈtʃaɪld/"
        },
        "nearby": [
            {
                "word": "only",
                "pos": "adverb"
            },
            {
                "word": "only",
                "pos": "conjunction"
            },
            {
                "word": "only child",
                "pos": "noun"
            },
            {
                "word": "Only Fools and Horses",
                "pos": ""
            },
            {
                "word": "o.n.o.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child who has no brothers or sisters",
                    "vi": "một đứa trẻ không có anh chị em"
                },
                "examples": [
                    {
                        "en": "I'm an only child.",
                        "vi": "Tôi chỉ là một đứa trẻ."
                    },
                    {
                        "en": "Only children often relate well to adults.",
                        "vi": "Chỉ trẻ em thường có quan hệ tốt với người lớn."
                    },
                    {
                        "en": "It was a bit lonely being an only child.",
                        "vi": "Nó hơi cô đơn khi là con một."
                    }
                ]
            }
        ]
    },
    {
        "id": "19f6a59541e14928b353f7ca7007719c",
        "word": "related",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈleɪtɪd/",
            "us": "/rɪˈleɪtɪd/"
        },
        "nearby": [
            {
                "word": "relate",
                "pos": "verb"
            },
            {
                "word": "Relate",
                "pos": ""
            },
            {
                "word": "related",
                "pos": "adjective"
            },
            {
                "word": "relatedness",
                "pos": "noun"
            },
            {
                "word": "relate to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with something/somebody in some way",
                    "vi": "kết nối với một cái gì đó / ai đó theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "related to something/somebody The amount of protein you need is directly related to your lifestyle.",
                        "vi": "liên quan đến cái gì đó / ai đó Lượng protein bạn cần có liên quan trực tiếp đến lối sống của bạn."
                    },
                    {
                        "en": "Much of the crime in this area is related to drug abuse.",
                        "vi": "Phần lớn tội phạm trong lĩnh vực này liên quan đến lạm dụng ma túy."
                    },
                    {
                        "en": "Parental unemployment was not significantly related to youth unemployment for the total sample.",
                        "vi": "Tỷ lệ thất nghiệp của cha mẹ không liên quan đáng kể đến tỷ lệ thất nghiệp của thanh niên trong tổng số mẫu."
                    },
                    {
                        "en": "These problems are closely related.",
                        "vi": "Những vấn đề này có quan hệ mật thiết với nhau."
                    },
                    {
                        "en": "a related issue",
                        "vi": "một vấn đề liên quan"
                    },
                    {
                        "en": "a related question/subject/matter",
                        "vi": "một câu hỏi / chủ đề / vấn đề liên quan"
                    },
                    {
                        "en": "links on the website to related articles",
                        "vi": "liên kết trên trang web đến các bài viết liên quan"
                    },
                    {
                        "en": "institutions engaged in similar or related activities",
                        "vi": "các tổ chức tham gia vào các hoạt động tương tự hoặc liên quan"
                    },
                    {
                        "en": "education and training and other related topics",
                        "vi": "giáo dục và đào tạo và các chủ đề liên quan khác"
                    },
                    {
                        "en": "In related news, the star was rushed to a Los Angeles hospital on Wednesday night.",
                        "vi": "Trong một tin tức liên quan, ngôi sao đã được đưa đến bệnh viện Los Angeles vào đêm thứ Tư."
                    },
                    {
                        "en": "He was suffering from a stress-related illness.",
                        "vi": "Anh ấy đang bị một căn bệnh liên quan đến căng thẳng."
                    },
                    {
                        "en": "These two incidents are closely related to each other.",
                        "vi": "Hai sự cố này có liên quan mật thiết với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the same family",
                    "vi": "trong cùng một gia đình"
                },
                "examples": [
                    {
                        "en": "We're distantly related.",
                        "vi": "Chúng tôi có quan hệ họ hàng xa."
                    },
                    {
                        "en": "related to somebody Are you related to Margaret?",
                        "vi": "liên quan đến ai đó Bạn có liên quan đến Margaret?"
                    },
                    {
                        "en": "He claims to be distantly related to the British royal family.",
                        "vi": "Anh ta tuyên bố có quan hệ họ hàng xa với hoàng gia Anh."
                    },
                    {
                        "en": "related by something The Logans and the Fishers were related by marriage.",
                        "vi": "liên quan bởi một cái gì đó Logans và Fishers có quan hệ hôn nhân."
                    },
                    {
                        "en": "We were closely related by blood.",
                        "vi": "Chúng tôi có quan hệ huyết thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to the same group",
                    "vi": "thuộc cùng một nhóm"
                },
                "examples": [
                    {
                        "en": "related species",
                        "vi": "các loài liên quan"
                    },
                    {
                        "en": "related languages",
                        "vi": "ngôn ngữ liên quan"
                    },
                    {
                        "en": "related to something The llama is related to the camel.",
                        "vi": "liên quan đến cái gì Llama có liên quan đến lạc đà."
                    },
                    {
                        "en": "All the bees in the colony are genetically related.",
                        "vi": "Tất cả những con ong trong đàn đều có quan hệ di truyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d04d469b00d45a69402dce9a3aeb418",
        "word": "single-parent family",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌsɪŋɡl ˌpeərənt ˈfæməli/",
            "us": "/ˌsɪŋɡl ˌperənt ˈfæməli/"
        },
        "nearby": [
            {
                "word": "single out",
                "pos": "phrasal verb"
            },
            {
                "word": "single parent",
                "pos": "noun"
            },
            {
                "word": "single-parent family",
                "pos": "noun"
            },
            {
                "word": "singlet",
                "pos": "noun"
            },
            {
                "word": "singleton",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family in which the children live with one parent rather than two",
                    "vi": "một gia đình trong đó con cái sống với một cha mẹ thay vì hai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3d54ce7ba2b94d6ab42fddb1994fd267",
        "word": "adopt",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈdɒpt/",
            "us": "/əˈdɑːpt/"
        },
        "nearby": [
            {
                "word": "adolescent",
                "pos": "adjective"
            },
            {
                "word": "Adonis",
                "pos": "noun"
            },
            {
                "word": "adopt",
                "pos": "verb"
            },
            {
                "word": "adopted",
                "pos": "adjective"
            },
            {
                "word": "adoptee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take somebody else’s child into your family and become its legal parent(s)",
                    "vi": "nhận con của người khác vào gia đình bạn và trở thành cha mẹ hợp pháp của nó"
                },
                "examples": [
                    {
                        "en": "a campaign to encourage childless couples to adopt",
                        "vi": "một chiến dịch khuyến khích các cặp vợ chồng không con nhận con nuôi"
                    },
                    {
                        "en": "adopt somebody to adopt a child",
                        "vi": "nhận ai đó làm con nuôi"
                    },
                    {
                        "en": "She was forced to have her baby adopted.",
                        "vi": "Cô buộc phải nhận đứa con của mình làm con nuôi."
                    },
                    {
                        "en": "She adopted three children from the orphanage.",
                        "vi": "Cô nhận nuôi ba đứa trẻ từ trại trẻ mồ côi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to use a particular method or to show a particular attitude towards somebody/something",
                    "vi": "để bắt đầu sử dụng một phương pháp cụ thể hoặc thể hiện một thái độ cụ thể đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "All three teams adopted different approaches to the problem.",
                        "vi": "Cả ba đội đã áp dụng các cách tiếp cận khác nhau đối với vấn đề."
                    },
                    {
                        "en": "Our study examined the strategies adopted by patients for seeking information.",
                        "vi": "Nghiên cứu của chúng tôi đã xem xét các chiến lược được bệnh nhân áp dụng để tìm kiếm thông tin."
                    },
                    {
                        "en": "The police adopted tighter security measures.",
                        "vi": "Cảnh sát đã áp dụng các biện pháp an ninh chặt chẽ hơn."
                    },
                    {
                        "en": "to adopt an attitude/stance/position",
                        "vi": "để áp dụng một thái độ / lập trường / vị trí"
                    }
                ]
            },
            {
                "define": {
                    "en": "to formally accept a suggestion or policy by voting",
                    "vi": "để chính thức chấp nhận một đề xuất hoặc chính sách bằng cách bỏ phiếu"
                },
                "examples": [
                    {
                        "en": "The government adopted a resolution on disarmament.",
                        "vi": "Chính phủ đã thông qua một nghị quyết về giải trừ quân bị."
                    },
                    {
                        "en": "The council is expected to adopt the new policy at its next meeting.",
                        "vi": "Hội đồng dự kiến sẽ thông qua chính sách mới trong cuộc họp tiếp theo."
                    },
                    {
                        "en": "The U.N. Security Council unanimously adopted the resolution.",
                        "vi": "Hội đồng Bảo an Liên hợp quốc nhất trí thông qua nghị quyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a new name, a country, a custom, etc. and begin to use it as your own",
                    "vi": "để chọn một tên mới, một quốc gia, một phong tục, v.v. và bắt đầu sử dụng tên đó như của riêng bạn"
                },
                "examples": [
                    {
                        "en": "to adopt a name/title/language",
                        "vi": "sử dụng tên / chức danh / ngôn ngữ"
                    },
                    {
                        "en": "Early Christians in Europe adopted many of the practices of the older, pagan religions.",
                        "vi": "Những người theo đạo Thiên chúa ban đầu ở châu Âu đã áp dụng nhiều thực hành của các tôn giáo ngoại giáo, lâu đời hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a particular manner, way of speaking, expression, etc.",
                    "vi": "sử dụng một cách cụ thể, cách nói, cách diễn đạt, v.v."
                },
                "examples": [
                    {
                        "en": "He adopted an air of indifference.",
                        "vi": "Anh ta chấp nhận một bầu không khí thờ ơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose somebody as a candidate in an election; to choose somebody as your representative",
                    "vi": "để chọn ai đó làm ứng cử viên trong một cuộc bầu cử; để chọn ai đó làm đại diện của bạn"
                },
                "examples": [
                    {
                        "en": "She was adopted as parliamentary candidate for Wood Green.",
                        "vi": "Cô đã được nhận làm ứng cử viên quốc hội cho Wood Green."
                    },
                    {
                        "en": "The people adopted him as their patron saint.",
                        "vi": "Người dân đã nhận anh ta làm thần hộ mệnh của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "868ae65c2cff46a3811721db3a0d8054",
        "word": "ancestor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈænsestə(r)/",
            "us": "/ˈænsestər/"
        },
        "nearby": [
            {
                "word": "ANC",
                "pos": "abbreviation"
            },
            {
                "word": "-ance",
                "pos": "suffix"
            },
            {
                "word": "ancestor",
                "pos": "noun"
            },
            {
                "word": "ancestral",
                "pos": "adjective"
            },
            {
                "word": "ancestry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person in your family who lived a long time ago",
                    "vi": "một người trong gia đình bạn sống cách đây rất lâu"
                },
                "examples": [
                    {
                        "en": "His ancestors had come to America from Ireland.",
                        "vi": "Tổ tiên của ông đã đến Mỹ từ Ireland."
                    }
                ]
            },
            {
                "define": {
                    "en": "an animal that lived in the past that a modern animal has developed from",
                    "vi": "một động vật sống trong quá khứ mà một động vật hiện đại đã phát triển từ"
                },
                "examples": [
                    {
                        "en": "a reptile that was the common ancestor of lizards and turtles",
                        "vi": "một loài bò sát là tổ tiên chung của thằn lằn và rùa"
                    }
                ]
            },
            {
                "define": {
                    "en": "an early form of a machine that later became more developed",
                    "vi": "một dạng máy ban đầu, sau này được phát triển hơn"
                },
                "examples": [
                    {
                        "en": "The ancestor of the modern bicycle was called a penny-farthing.",
                        "vi": "Tổ tiên của xe đạp hiện đại được gọi là xe đạp xu."
                    }
                ]
            }
        ]
    },
    {
        "id": "46122fb9c144463db5806d43011f58dc",
        "word": "inherit",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪnˈherɪt/",
            "us": "/ɪnˈherɪt/"
        },
        "nearby": [
            {
                "word": "inherent",
                "pos": "adjective"
            },
            {
                "word": "inherently",
                "pos": "adverb"
            },
            {
                "word": "inherit",
                "pos": "verb"
            },
            {
                "word": "inheritable",
                "pos": "adjective"
            },
            {
                "word": "inheritance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to receive money, property, etc. from somebody when they die",
                    "vi": "nhận tiền, tài sản, v.v. từ ai đó khi họ chết"
                },
                "examples": [
                    {
                        "en": "inherit something from somebody She inherited a fortune from her father.",
                        "vi": "thừa hưởng một cái gì đó từ ai đó Cô ấy thừa hưởng một gia tài từ cha cô ấy."
                    },
                    {
                        "en": "inherit (something) He will inherit the title on the death of his uncle.",
                        "vi": "thừa kế (cái gì đó) Anh ấy sẽ thừa kế tước vị khi người chú qua đời."
                    },
                    {
                        "en": "Does he know that she stands to inherit?",
                        "vi": "Anh ta có biết rằng cô ấy đứng để thừa kế không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have qualities, physical features, etc. that are similar to those of your parents, grandparents, etc.",
                    "vi": "có phẩm chất, đặc điểm ngoại hình, v.v. giống với cha mẹ, ông bà, v.v."
                },
                "examples": [
                    {
                        "en": "inherit something He has inherited his mother's patience.",
                        "vi": "thừa hưởng một cái gì đó Anh ấy đã thừa hưởng sự kiên nhẫn của mẹ mình."
                    },
                    {
                        "en": "Is this an inherited disease?",
                        "vi": "Đây có phải là bệnh di truyền không?"
                    },
                    {
                        "en": "How many of these traits are genetically inherited?",
                        "vi": "Có bao nhiêu tính trạng được di truyền về mặt di truyền?"
                    },
                    {
                        "en": "inherit something from somebody She inherited a passion for music from her grandfather.",
                        "vi": "thừa hưởng một cái gì đó từ ai đó Cô thừa hưởng niềm đam mê âm nhạc từ ông của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you inherit a particular situation from somebody, you are now responsible for dealing with it, especially because you have replaced that person in their job",
                    "vi": "nếu bạn thừa hưởng một tình huống cụ thể từ ai đó, thì bây giờ bạn có trách nhiệm giải quyết nó, đặc biệt là vì bạn đã thay thế người đó trong công việc của họ"
                },
                "examples": [
                    {
                        "en": "policies inherited from the previous administration",
                        "vi": "các chính sách kế thừa từ chính quyền trước đó"
                    },
                    {
                        "en": "I inherited a number of problems from my predecessor.",
                        "vi": "Tôi thừa hưởng một số vấn đề từ người tiền nhiệm của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac668b278b3145b5a068969d4a9c73da",
        "word": "mixed",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/mɪkst/",
            "us": "/mɪkst/"
        },
        "nearby": [
            {
                "word": "Tom Mix",
                "pos": ""
            },
            {
                "word": "mix",
                "pos": "noun"
            },
            {
                "word": "mixed",
                "pos": "adjective"
            },
            {
                "word": "mixed-ability",
                "pos": "adjective"
            },
            {
                "word": "mixed bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "consisting of different qualities or elements",
                    "vi": "bao gồm các phẩm chất hoặc yếu tố khác nhau"
                },
                "examples": [
                    {
                        "en": "a mixed diet",
                        "vi": "một chế độ ăn uống hỗn hợp"
                    },
                    {
                        "en": "beaches with mixed sand and shingle",
                        "vi": "bãi biển với cát hỗn hợp và đá vôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "having both good and bad qualities or feelings",
                    "vi": "có cả những phẩm chất hoặc cảm xúc tốt và xấu"
                },
                "examples": [
                    {
                        "en": "I still have mixed feelings about going to Brazil (= I am not sure what to think).",
                        "vi": "Tôi vẫn có cảm xúc lẫn lộn về việc đến Brazil (= Tôi không biết phải nghĩ gì)."
                    },
                    {
                        "en": "I listened to her story with mixed emotions.",
                        "vi": "Tôi lắng nghe câu chuyện của cô ấy với nhiều cảm xúc lẫn lộn."
                    },
                    {
                        "en": "These studies have produced mixed results.",
                        "vi": "Những nghiên cứu này đã tạo ra nhiều kết quả khác nhau."
                    },
                    {
                        "en": "The results were decidedly mixed.",
                        "vi": "Các kết quả đã được quyết định trộn lẫn."
                    },
                    {
                        "en": "The weather has been very mixed recently.",
                        "vi": "Thời tiết gần đây rất hỗn hợp."
                    },
                    {
                        "en": "Having a famous father can be a mixed blessing.",
                        "vi": "Có một người cha nổi tiếng có thể là một may mắn hỗn hợp."
                    },
                    {
                        "en": "The play was given a mixed reception by the critics (= some liked it, some did not).",
                        "vi": "Vở kịch đã được các nhà phê bình đón nhận trái chiều (= một số thích nó, một số thì không)."
                    },
                    {
                        "en": "The film met with a mixed reaction from viewers and critics.",
                        "vi": "Bộ phim vấp phải phản ứng trái chiều từ người xem và giới phê bình."
                    },
                    {
                        "en": "British athletes had mixed fortunes in yesterday's competition.",
                        "vi": "Các vận động viên người Anh đã có những vận may trái ngược nhau trong cuộc thi ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of different kinds of people, for example, people from different races and cultures",
                    "vi": "bao gồm các loại người khác nhau, ví dụ, những người từ các chủng tộc và nền văn hóa khác nhau"
                },
                "examples": [
                    {
                        "en": "an ethnically mixed community",
                        "vi": "một cộng đồng dân tộc hỗn hợp"
                    },
                    {
                        "en": "people of mixed race",
                        "vi": "người thuộc chủng tộc hỗn hợp"
                    },
                    {
                        "en": "a mixed marriage (= between two people of different races or religions)",
                        "vi": "một cuộc hôn nhân hỗn hợp (= giữa hai người thuộc các chủng tộc hoặc tôn giáo khác nhau)"
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of different types of the same thing",
                    "vi": "bao gồm các loại khác nhau của cùng một thứ"
                },
                "examples": [
                    {
                        "en": "a mixed salad",
                        "vi": "một món salad trộn"
                    },
                    {
                        "en": "I served chicken with mixed vegetables.",
                        "vi": "Tôi phục vụ gà với rau trộn."
                    },
                    {
                        "en": "a mixed woodland of ash, oak and birch",
                        "vi": "một vùng rừng hỗn hợp của tro, sồi và bạch dương"
                    },
                    {
                        "en": "(British English) The students in the class are of mixed ability (= different levels of ability).",
                        "vi": "(Tiếng Anh Anh) Các học sinh trong lớp có khả năng khác nhau (= các mức độ khác nhau của khả năng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "of or for both males and females",
                    "vi": "của hoặc cho cả nam và nữ"
                },
                "examples": [
                    {
                        "en": "a mixed school",
                        "vi": "một trường hỗn hợp"
                    },
                    {
                        "en": "I'd rather not talk about it in mixed company.",
                        "vi": "Tôi không muốn nói về nó trong một công ty hỗn hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "1242ac77dac6497b9e8f515e0d266eeb",
        "word": "near",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/nɪə(r)/",
            "us": "/nɪr/"
        },
        "nearby": [
            {
                "word": "neap tide",
                "pos": "noun"
            },
            {
                "word": "near",
                "pos": "preposition"
            },
            {
                "word": "near",
                "pos": "adjective"
            },
            {
                "word": "near",
                "pos": "adverb"
            },
            {
                "word": "near",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short distance away",
                    "vi": "một khoảng cách ngắn"
                },
                "examples": [
                    {
                        "en": "His house is very near.",
                        "vi": "Nhà anh ấy rất gần."
                    },
                    {
                        "en": "Where's the nearest bank?",
                        "vi": "Ngân hàng gần nhất ở đâu?"
                    },
                    {
                        "en": "Wales may be a near neighbour but its history is quite distinct.",
                        "vi": "Wales có thể là một nước láng giềng gần nhưng lịch sử của nó khá rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short time away in the future",
                    "vi": "một thời gian ngắn trong tương lai"
                },
                "examples": [
                    {
                        "en": "The conflict is unlikely to be resolved in the near future (= very soon).",
                        "vi": "Xung đột khó có thể được giải quyết trong tương lai gần (= rất sớm)."
                    },
                    {
                        "en": "Working memory refers to the brain's ability to remember things in the short or near term.",
                        "vi": "Trí nhớ làm việc đề cập đến khả năng của não bộ để ghi nhớ mọi thứ trong thời gian ngắn hoặc gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "coming next after somebody/something",
                    "vi": "đến tiếp theo sau ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She has a 12-point lead over her nearest rival.",
                        "vi": "Cô ấy đang dẫn đầu 12 điểm so với đối thủ gần nhất của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar; most similar",
                    "vi": "giống; giống nhất"
                },
                "examples": [
                    {
                        "en": "He was the nearest thing to (= the person most like) a father she had ever had.",
                        "vi": "Anh ấy là người gần gũi nhất với (= người giống nhất) với một người cha mà cô từng có."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to being somebody/something",
                    "vi": "gần trở thành ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The election proved to be a near disaster for the party.",
                        "vi": "Cuộc bầu cử gần như là một thảm họa đối với đảng."
                    },
                    {
                        "en": "a near impossibility",
                        "vi": "một điều gần như không thể"
                    },
                    {
                        "en": "She spoke in a near whisper.",
                        "vi": "Cô ấy nói với giọng gần như thì thầm."
                    },
                    {
                        "en": "The climbers had already had one near miss on the summit.",
                        "vi": "Các nhà leo núi đã suýt trượt trên đỉnh núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a close family connection",
                    "vi": "được sử dụng để mô tả một kết nối gia đình chặt chẽ"
                },
                "examples": [
                    {
                        "en": "Only the nearest relatives were present at the funeral.",
                        "vi": "Chỉ những người thân gần nhất có mặt trong đám tang."
                    }
                ]
            },
            {
                "define": {
                    "en": "your close family and friends",
                    "vi": "gia đình và bạn bè thân thiết của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which you are successful, but which could also have ended badly",
                    "vi": "một tình huống mà bạn thành công, nhưng cũng có thể kết thúc tồi tệ"
                },
                "examples": [
                    {
                        "en": "Phew! That was a near thing! It could have been a disaster.",
                        "vi": "Phù! Đó là một điều gần! Nó có thể là một thảm họa."
                    },
                    {
                        "en": "We won in the end but it was a near thing.",
                        "vi": "Cuối cùng thì chúng tôi cũng giành chiến thắng nhưng đó là điều gần như xa vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "followed by a number when counting or measuring approximately",
                    "vi": "theo sau là một số khi đếm hoặc đo gần đúng"
                },
                "examples": [
                    {
                        "en": "We calculated the cost to the nearest 50 dollars.",
                        "vi": "Chúng tôi đã tính toán chi phí chính xác đến 50 đô la."
                    }
                ]
            }
        ]
    },
    {
        "id": "450cd0327f3142b8ac49afd864448c81",
        "word": "one-parent family",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌwʌn peərənt ˈfæməli/",
            "us": "/ˌwʌn perənt ˈfæməli/"
        },
        "nearby": [
            {
                "word": "one-on-one",
                "pos": "adjective"
            },
            {
                "word": "101",
                "pos": "adjective"
            },
            {
                "word": "one-parent family",
                "pos": "noun"
            },
            {
                "word": "one-piece",
                "pos": "adjective"
            },
            {
                "word": "onerous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family in which the children live with one parent rather than two",
                    "vi": "một gia đình trong đó con cái sống với một cha mẹ thay vì hai"
                },
                "examples": [
                    {
                        "en": "the difficulties faced by one-parent families",
                        "vi": "những khó khăn mà các gia đình một bên là cha mẹ phải đối mặt"
                    }
                ]
            }
        ]
    },
    {
        "id": "b91eb71b962743d9aa989a29f431a0ea",
        "word": "trace",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/treɪs/",
            "us": "/treɪs/"
        },
        "nearby": [
            {
                "word": "TPS",
                "pos": "abbreviation"
            },
            {
                "word": "TQM",
                "pos": "abbreviation"
            },
            {
                "word": "trace",
                "pos": "verb"
            },
            {
                "word": "trace",
                "pos": "noun"
            },
            {
                "word": "traceable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find or discover somebody/something by looking carefully for them/it",
                    "vi": "để tìm hoặc khám phá ai đó / điều gì đó bằng cách tìm kiếm cẩn thận cho họ / nó"
                },
                "examples": [
                    {
                        "en": "We finally traced him to an address in Chicago.",
                        "vi": "Cuối cùng chúng tôi cũng lần ra được anh ta đến một địa chỉ ở Chicago."
                    },
                    {
                        "en": "I have been unable to trace the letter you mentioned.",
                        "vi": "Tôi đã không thể theo dõi bức thư mà bạn đã đề cập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the origin or cause of something",
                    "vi": "để tìm nguồn gốc hoặc nguyên nhân của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She could trace her family tree back to the 16th century.",
                        "vi": "Cô có thể truy tìm cây gia đình của mình từ thế kỷ 16."
                    },
                    {
                        "en": "The leak was eventually traced to a broken seal.",
                        "vi": "Rò rỉ cuối cùng được bắt nguồn từ một con dấu bị hỏng."
                    },
                    {
                        "en": "The police traced the call (= used special electronic equipment to find out who made the phone call) to her ex-husband's number.",
                        "vi": "Cảnh sát đã lần theo dấu vết cuộc gọi (= sử dụng thiết bị điện tử đặc biệt để tìm ra ai đã gọi điện) đến số của chồng cũ của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe a process or the development of something",
                    "vi": "để mô tả một quá trình hoặc sự phát triển của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her book traces the town's history from Saxon times to the present day.",
                        "vi": "Cuốn sách của cô ghi lại lịch sử của thị trấn từ thời Saxon cho đến ngày nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to draw a line or lines on a surface",
                    "vi": "để vẽ một đường hoặc các đường trên bề mặt"
                },
                "examples": [
                    {
                        "en": "She traced a line in the sand.",
                        "vi": "Cô vạch một đường trên cát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to follow the shape or outline of something",
                    "vi": "để làm theo hình dạng hoặc đường viền của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He traced the route on the map.",
                        "vi": "Anh ta lần theo lộ trình trên bản đồ."
                    },
                    {
                        "en": "A tear traced a path down her cheek.",
                        "vi": "Một giọt nước mắt chảy dài trên má cô."
                    },
                    {
                        "en": "She lightly traced the outline of his face with her finger.",
                        "vi": "Cô dùng ngón tay vạch nhẹ từng đường nét trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy a map, drawing, etc. by drawing on tracing paper (= paper that you can see through) placed over it",
                    "vi": "để sao chép bản đồ, bản vẽ, v.v. bằng cách vẽ trên giấy có dấu vết (= giấy mà bạn có thể nhìn qua) đặt trên đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9650cc41e30f43d0bd00ed912934cd61",
        "word": "adoptive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈdɒptɪv/",
            "us": "/əˈdɑːptɪv/"
        },
        "nearby": [
            {
                "word": "adopter",
                "pos": "noun"
            },
            {
                "word": "adoption",
                "pos": "noun"
            },
            {
                "word": "adoptive",
                "pos": "adjective"
            },
            {
                "word": "adorable",
                "pos": "adjective"
            },
            {
                "word": "adorably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in that relationship as a result of the parent legally adopting the child",
                    "vi": "trong mối quan hệ đó do cha mẹ nhận con nuôi hợp pháp"
                },
                "examples": [
                    {
                        "en": "his adoptive father",
                        "vi": "cha nuôi của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "aecded1655854dbdba13b411aba3dcc5",
        "word": "ancestry",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈænsestri/",
            "us": "/ˈænsestri/"
        },
        "nearby": [
            {
                "word": "ancestor",
                "pos": "noun"
            },
            {
                "word": "ancestral",
                "pos": "adjective"
            },
            {
                "word": "ancestry",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the family or the group of people that you come from",
                    "vi": "gia đình hoặc nhóm người mà bạn đến từ"
                },
                "examples": [
                    {
                        "en": "to have Scottish ancestry",
                        "vi": "có tổ tiên là người Scotland"
                    },
                    {
                        "en": "He was able to trace his ancestry back over 1 000 years.",
                        "vi": "Ông đã có thể truy tìm nguồn gốc của mình từ hơn 1000 năm trước."
                    },
                    {
                        "en": "people of Japanese ancestry",
                        "vi": "người gốc Nhật Bản"
                    }
                ]
            }
        ]
    },
    {
        "id": "6e383c47bbdc4211847e5ee52a39b83f",
        "word": "biracial",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbaɪˈreɪʃl/",
            "us": "/ˌbaɪˈreɪʃl/"
        },
        "nearby": [
            {
                "word": "bipolar",
                "pos": "adjective"
            },
            {
                "word": "bipolar disorder",
                "pos": "noun"
            },
            {
                "word": "biracial",
                "pos": "adjective"
            },
            {
                "word": "birch",
                "pos": "noun"
            },
            {
                "word": "bird",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving people of two different races; having parents from two different races",
                    "vi": "liên quan đến những người thuộc hai chủng tộc khác nhau; có cha mẹ từ hai chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "His biracial identity and history are important to him.",
                        "vi": "Danh tính và lịch sử hai chủng tộc của anh ấy rất quan trọng đối với anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "ccd6ebe16d674bf09e0c230b6db0a71d",
        "word": "branch",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/brɑːntʃ/",
            "us": "/bræntʃ/"
        },
        "nearby": [
            {
                "word": "Bramley",
                "pos": "noun"
            },
            {
                "word": "bran",
                "pos": "noun"
            },
            {
                "word": "branch",
                "pos": "noun"
            },
            {
                "word": "branch",
                "pos": "verb"
            },
            {
                "word": "Branch Davidians",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a tree that grows out from the main stem and on which leaves, flowers and fruit grow",
                    "vi": "một bộ phận của cây mọc ra từ thân chính và trên đó lá, hoa và quả mọc lên"
                },
                "examples": [
                    {
                        "en": "She climbed the tree and hid in the branches.",
                        "vi": "Cô trèo lên cây và trốn trong cành."
                    },
                    {
                        "en": "the bare branches of a tree in winter",
                        "vi": "mùa đông cành cây trơ trụi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a local office or shop belonging to a large company or organization",
                    "vi": "một văn phòng địa phương hoặc cửa hàng thuộc một công ty hoặc tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "The bank has branches all over the country.",
                        "vi": "Ngân hàng có các chi nhánh trên khắp cả nước."
                    },
                    {
                        "en": "Our New York branch is dealing with the matter.",
                        "vi": "Chi nhánh New York của chúng tôi đang giải quyết vấn đề này."
                    },
                    {
                        "en": "The store is opening more local branches.",
                        "vi": "Cửa hàng đang mở thêm các chi nhánh tại địa phương."
                    },
                    {
                        "en": "He has been named assistant branch manager at a new branch of the bank.",
                        "vi": "Ông được bổ nhiệm làm trợ lý giám đốc chi nhánh tại một chi nhánh mới của ngân hàng."
                    },
                    {
                        "en": "the Post Office announced plans to close another branch.",
                        "vi": "Bưu điện thông báo kế hoạch đóng cửa một chi nhánh khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a government or other large organization that deals with one particular aspect of its work",
                    "vi": "một bộ phận của chính phủ hoặc tổ chức lớn khác giải quyết một khía cạnh cụ thể của công việc"
                },
                "examples": [
                    {
                        "en": "Scotland Yard's anti-terrorist branch swung into action.",
                        "vi": "Chi nhánh chống khủng bố của Scotland Yard bắt đầu hoạt động."
                    },
                    {
                        "en": "The idea was so popular, other branches of government copied it.",
                        "vi": "Ý tưởng này rất phổ biến, các cơ quan chính phủ khác đã sao chép nó."
                    },
                    {
                        "en": "She was national branch secretary of the union.",
                        "vi": "Cô ấy là bí thư chi nhánh quốc gia của công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a division of an area of knowledge or a group of languages",
                    "vi": "sự phân chia một lĩnh vực kiến thức hoặc một nhóm ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "the branch of computer science known as ‘artificial intelligence’",
                        "vi": "ngành khoa học máy tính được gọi là 'trí tuệ nhân tạo'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a smaller or less important part of a river, road, railway, etc. that leads away from the main part",
                    "vi": "một phần nhỏ hơn hoặc ít quan trọng hơn của sông, đường bộ, đường sắt, v.v. dẫn ra khỏi phần chính"
                },
                "examples": [
                    {
                        "en": "a branch of the Rhine",
                        "vi": "một nhánh của sông Rhine"
                    },
                    {
                        "en": "a branch line (= a small line off a main railway line, often in country areas)",
                        "vi": "một tuyến nhánh (= một tuyến nhỏ ngoài tuyến đường sắt chính, thường ở các vùng nông thôn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of members of a family who all have the same ancestors",
                    "vi": "một nhóm các thành viên trong một gia đình có cùng tổ tiên"
                },
                "examples": [
                    {
                        "en": "My uncle's branch of the family emigrated to Canada.",
                        "vi": "Chi nhánh của gia đình chú tôi di cư sang Canada."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely and in a way that affects every part of something",
                    "vi": "hoàn toàn và theo cách ảnh hưởng đến mọi phần của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The government set out to destroy the organization root and branch.",
                        "vi": "Chính phủ đặt ra mục tiêu tiêu diệt tận gốc tổ chức và chi nhánh."
                    },
                    {
                        "en": "root-and-branch reforms",
                        "vi": "cải cách gốc và nhánh"
                    }
                ]
            }
        ]
    },
    {
        "id": "058a36b56dee48beb216835202f95165",
        "word": "clan",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/klæn/",
            "us": "/klæn/"
        },
        "nearby": [
            {
                "word": "clamshell",
                "pos": "noun"
            },
            {
                "word": "clam up",
                "pos": "phrasal verb"
            },
            {
                "word": "clan",
                "pos": "noun"
            },
            {
                "word": "Tom Clancy",
                "pos": ""
            },
            {
                "word": "clandestine",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of families who are related to each other, especially in Scotland",
                    "vi": "một nhóm các gia đình có quan hệ họ hàng với nhau, đặc biệt là ở Scotland"
                },
                "examples": [
                    {
                        "en": "the Macleod clan",
                        "vi": "gia tộc Macleod"
                    },
                    {
                        "en": "clan warfare",
                        "vi": "chiến tranh gia tộc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large family, or a group of people who are connected because of a particular thing",
                    "vi": "một gia đình rất lớn hoặc một nhóm người được kết nối vì một điều cụ thể"
                },
                "examples": [
                    {
                        "en": "She's one of a growing clan of stars who have left Hollywood.",
                        "vi": "Cô ấy là một trong những ngôi sao ngày càng tăng đã rời khỏi Hollywood."
                    },
                    {
                        "en": "There's a photo of the whole Kennedy clan on the bookshelf.",
                        "vi": "Có một bức ảnh của cả gia tộc Kennedy trên giá sách."
                    }
                ]
            }
        ]
    },
    {
        "id": "f15aebaf53164e0f9ca3c62ba994db90",
        "word": "close-knit",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkləʊs ˈnɪt/",
            "us": "/ˌkləʊs ˈnɪt/"
        },
        "nearby": [
            {
                "word": "close harmony",
                "pos": "noun"
            },
            {
                "word": "close in",
                "pos": "phrasal verb"
            },
            {
                "word": "close-knit",
                "pos": "adjective"
            },
            {
                "word": "closely",
                "pos": "adverb"
            },
            {
                "word": "close-mouthed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strong relationships with each other and taking a close, friendly interest in each other’s activities and problems",
                    "vi": "có mối quan hệ bền chặt với nhau và quan tâm gần gũi, thân thiện đến các hoạt động và vấn đề của nhau"
                },
                "examples": [
                    {
                        "en": "the close-knit community of a small village",
                        "vi": "cộng đồng gắn bó thân thiết của một ngôi làng nhỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "4dd10d190a514cac830be54c5c098b99",
        "word": "descendant",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈsendənt/",
            "us": "/dɪˈsendənt/"
        },
        "nearby": [
            {
                "word": "descant recorder",
                "pos": "noun"
            },
            {
                "word": "descend",
                "pos": "verb"
            },
            {
                "word": "descendant",
                "pos": "noun"
            },
            {
                "word": "descend into",
                "pos": "phrasal verb"
            },
            {
                "word": "descend on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person’s descendants are their children, their children’s children, and all the people who live after them who are related to them",
                    "vi": "con cháu của một người là con của họ, con của con họ, và tất cả những người sống sau họ có quan hệ họ hàng với họ"
                },
                "examples": [
                    {
                        "en": "He was an O'Conor and a direct descendant of the last High King of Ireland.",
                        "vi": "Ông là một O'Conor và là hậu duệ trực tiếp của vị Vua cuối cùng của Ireland."
                    },
                    {
                        "en": "Many of them are descendants of the original settlers.",
                        "vi": "Nhiều người trong số họ là con cháu của những người định cư ban đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that has developed from something similar in the past",
                    "vi": "một cái gì đó đã phát triển từ một cái gì đó tương tự trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Quechua, the lineal descendant of the Inca language",
                        "vi": "Quechua, hậu duệ dòng dõi của ngôn ngữ Inca"
                    }
                ]
            }
        ]
    },
    {
        "id": "b4722868ccb746e6941dd99b438b0c85",
        "word": "dynasty",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdɪnəsti/",
            "us": "/ˈdaɪnəsti/"
        },
        "nearby": [
            {
                "word": "dynamo",
                "pos": "noun"
            },
            {
                "word": "dynastic",
                "pos": "adjective"
            },
            {
                "word": "dynasty",
                "pos": "noun"
            },
            {
                "word": "Dynasty",
                "pos": ""
            },
            {
                "word": "dyne",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of leaders of a country who all belong to the same family",
                    "vi": "một loạt các nhà lãnh đạo của một đất nước tất cả đều thuộc cùng một gia đình"
                },
                "examples": [
                    {
                        "en": "the Nehru-Gandhi dynasty",
                        "vi": "triều đại Nehru-Gandhi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of years during which members of a particular family rule a country",
                    "vi": "khoảng thời gian nhiều năm mà các thành viên của một gia đình cụ thể cai trị một quốc gia"
                },
                "examples": [
                    {
                        "en": "a Ming dynasty vase",
                        "vi": "một chiếc bình triều đại nhà Minh"
                    }
                ]
            }
        ]
    },
    {
        "id": "5586f85ce3dd44c88262b4d9dec9ed19",
        "word": "foster",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɒstə(r)/",
            "us": "/ˈfɑːstər/"
        },
        "nearby": [
            {
                "word": "fossilize",
                "pos": "verb"
            },
            {
                "word": "fossilized",
                "pos": "adjective"
            },
            {
                "word": "foster",
                "pos": "verb"
            },
            {
                "word": "Stephen Foster",
                "pos": ""
            },
            {
                "word": "foster",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to encourage something to develop",
                    "vi": "để khuyến khích một cái gì đó phát triển"
                },
                "examples": [
                    {
                        "en": "The club's aim is to foster better relations within the community.",
                        "vi": "Mục đích của câu lạc bộ là thúc đẩy các mối quan hệ tốt hơn trong cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take another person’s child into your home for a period of time, without becoming his or her legal parents",
                    "vi": "đưa con của người khác vào nhà bạn trong một khoảng thời gian, mà không trở thành cha mẹ hợp pháp của nó"
                },
                "examples": [
                    {
                        "en": "They have fostered over 60 children during the past ten years.",
                        "vi": "Họ đã nuôi dưỡng hơn 60 đứa trẻ trong suốt mười năm qua."
                    },
                    {
                        "en": "We couldn't adopt a child, so we decided to foster.",
                        "vi": "Chúng tôi không thể nhận một đứa trẻ, vì vậy chúng tôi quyết định nuôi dưỡng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f10f12d4297246459aaec85e06b7778c",
        "word": "heir",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/eə(r)/",
            "us": "/er/"
        },
        "nearby": [
            {
                "word": "heinousness",
                "pos": "noun"
            },
            {
                "word": "Heinz",
                "pos": ""
            },
            {
                "word": "heir",
                "pos": "noun"
            },
            {
                "word": "heir apparent",
                "pos": "noun"
            },
            {
                "word": "heiress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has the legal right to receive somebody’s property, money or title when that person dies",
                    "vi": "một người có quyền hợp pháp nhận tài sản, tiền bạc hoặc quyền sở hữu của ai đó khi người đó chết"
                },
                "examples": [
                    {
                        "en": "to be heir to a large fortune",
                        "vi": "trở thành người thừa kế một khối tài sản lớn"
                    },
                    {
                        "en": "the heir to the throne (= the person who will be the next king or queen)",
                        "vi": "người thừa kế ngai vàng (= người sẽ là vua hoặc nữ hoàng tiếp theo)"
                    },
                    {
                        "en": "the son and heir of the Earl of Lancaster",
                        "vi": "con trai và người thừa kế của Bá tước Lancaster"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is thought to continue the work or a tradition started by somebody else",
                    "vi": "một người được cho là tiếp tục công việc hoặc một truyền thống do người khác bắt đầu"
                },
                "examples": [
                    {
                        "en": "the president’s political heirs",
                        "vi": "những người thừa kế chính trị của tổng thống"
                    }
                ]
            }
        ]
    },
    {
        "id": "f09699911b2b420eb705dee9223c92de",
        "word": "heiress",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/eəˈres/",
            "us": "/ˈerəs/"
        },
        "nearby": [
            {
                "word": "heir",
                "pos": "noun"
            },
            {
                "word": "heir apparent",
                "pos": "noun"
            },
            {
                "word": "heiress",
                "pos": "noun"
            },
            {
                "word": "heirloom",
                "pos": "noun"
            },
            {
                "word": "heirloom",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a female heir, especially one who has received or will receive a large amount of money",
                    "vi": "người thừa kế là nữ, đặc biệt là người đã hoặc sẽ nhận một số tiền lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0b5c88f5d31543d9849cdf2b7be06dcf",
        "word": "heritage",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈherɪtɪdʒ/",
            "us": "/ˈherɪtɪdʒ/"
        },
        "nearby": [
            {
                "word": "Heriot-Watt University",
                "pos": ""
            },
            {
                "word": "heritable",
                "pos": "adjective"
            },
            {
                "word": "heritage",
                "pos": "noun"
            },
            {
                "word": "heritage centre",
                "pos": "noun"
            },
            {
                "word": "heritage coast",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the history, traditions, buildings and objects that a country or society has had for many years and that are considered an important part of its character",
                    "vi": "lịch sử, truyền thống, các tòa nhà và các đối tượng mà một quốc gia hoặc xã hội đã có trong nhiều năm và được coi là một phần quan trọng của đặc tính của quốc gia đó"
                },
                "examples": [
                    {
                        "en": "Spain’s rich cultural heritage",
                        "vi": "Di sản văn hóa phong phú của Tây Ban Nha"
                    },
                    {
                        "en": "The building is part of our national heritage.",
                        "vi": "Tòa nhà là một phần di sản quốc gia của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person's ethnic or religious background; the countries, cultures, religious groups, etc. that a person's parents or ancestors come from",
                    "vi": "nền tảng dân tộc hoặc tôn giáo của một người; quốc gia, nền văn hóa, nhóm tôn giáo, v.v. mà cha mẹ hoặc tổ tiên của một người đến từ"
                },
                "examples": [
                    {
                        "en": "What's your heritage?",
                        "vi": "Di sản của bạn là gì?"
                    },
                    {
                        "en": "Her heritage is Chinese and Vietnamese.",
                        "vi": "Di sản của cô là tiếng Trung và tiếng Việt."
                    },
                    {
                        "en": "She made a conscious attempt to explore her Jewish heritage.",
                        "vi": "Cô đã cố gắng có ý thức để khám phá di sản Do Thái của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a traditional product, brand, type of animal or plant variety, especially one that is old-fashioned, rare and of high quality",
                    "vi": "được sử dụng để mô tả một sản phẩm truyền thống, nhãn hiệu, loại giống động vật hoặc thực vật, đặc biệt là một loại giống cũ, quý hiếm và chất lượng cao"
                },
                "examples": [
                    {
                        "en": "Cotswold sheep are considered a heritage breed in Canada.",
                        "vi": "Cừu Cotswold được coi là một giống di sản ở Canada."
                    },
                    {
                        "en": "Heritage carrots are not always orange in colour.",
                        "vi": "Cà rốt di sản không phải lúc nào cũng có màu cam."
                    },
                    {
                        "en": "They work with some of Britain's oldest heritage brands, including Jaguar, Harrods and the BBC.",
                        "vi": "Họ làm việc với một số thương hiệu di sản lâu đời nhất của Anh, bao gồm Jaguar, Harrods và BBC."
                    }
                ]
            }
        ]
    },
    {
        "id": "990b1c7d484d4c33b5ea7e06f872b2c2",
        "word": "inheritance",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈherɪtəns/",
            "us": "/ɪnˈherɪtəns/"
        },
        "nearby": [
            {
                "word": "inherit",
                "pos": "verb"
            },
            {
                "word": "inheritable",
                "pos": "adjective"
            },
            {
                "word": "inheritance",
                "pos": "noun"
            },
            {
                "word": "inheritance tax",
                "pos": "noun"
            },
            {
                "word": "inheritor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the money, property, etc. that you receive from somebody when they die; the fact of receiving something when somebody dies",
                    "vi": "tiền, tài sản, v.v. mà bạn nhận được từ ai đó khi họ chết; thực tế là nhận được một cái gì đó khi ai đó chết"
                },
                "examples": [
                    {
                        "en": "She spent all her inheritance in a year.",
                        "vi": "Cô ấy đã tiêu hết tài sản thừa kế của mình trong một năm."
                    },
                    {
                        "en": "The title passes by inheritance to the eldest son.",
                        "vi": "Tước hiệu được thừa kế cho con trai cả."
                    },
                    {
                        "en": "She came into (= received) her inheritance at eighteen.",
                        "vi": "Cô ấy nhận (= nhận) quyền thừa kế của mình năm mười tám tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "something from the past or from your family that affects the way you behave, look, etc.",
                    "vi": "điều gì đó trong quá khứ hoặc từ gia đình của bạn ảnh hưởng đến cách bạn cư xử, nhìn, v.v."
                },
                "examples": [
                    {
                        "en": "We are proud of our cultural inheritance.",
                        "vi": "Chúng tôi tự hào về sự kế thừa văn hóa của chúng tôi."
                    },
                    {
                        "en": "Physical characteristics are determined by genetic inheritance.",
                        "vi": "Các đặc điểm thể chất được xác định bởi sự di truyền gen."
                    }
                ]
            }
        ]
    },
    {
        "id": "45728d7e4afe48b5935565956f02f0a7",
        "word": "mixed-race",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmɪkst ˈreɪs/",
            "us": "/ˌmɪkst ˈreɪs/"
        },
        "nearby": [
            {
                "word": "mixed metaphor",
                "pos": "noun"
            },
            {
                "word": "mixed number",
                "pos": "noun"
            },
            {
                "word": "mixed-race",
                "pos": "adjective"
            },
            {
                "word": "mixed up",
                "pos": "adjective"
            },
            {
                "word": "mixer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving people of different races, or having parents from different races",
                    "vi": "liên quan đến những người thuộc các chủng tộc khác nhau hoặc có cha mẹ từ các chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "a mixed-race child",
                        "vi": "một đứa trẻ thuộc chủng tộc hỗn hợp"
                    }
                ]
            }
        ]
    },
    {
        "id": "22a18a74f8964f6bb6c8a5a5457d5729",
        "word": "nuclear family",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌnjuːkliə ˈfæməli/",
            "us": "/ˌnuːkliər ˈfæməli/"
        },
        "nearby": [
            {
                "word": "nuclear deterrent",
                "pos": "noun"
            },
            {
                "word": "nuclear energy",
                "pos": "noun"
            },
            {
                "word": "nuclear family",
                "pos": "noun"
            },
            {
                "word": "nuclear fission",
                "pos": "noun"
            },
            {
                "word": "nuclear-free",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family that consists of father, mother and children, when it is thought of as a unit in society",
                    "vi": "một gia đình bao gồm cha, mẹ và con cái, khi nó được coi là một đơn vị trong xã hội"
                },
                "examples": [
                    {
                        "en": "Not everybody nowadays lives in the conventional nuclear family.",
                        "vi": "Ngày nay không phải ai cũng sống trong gia đình hạt nhân thông thường."
                    },
                    {
                        "en": "the nuclear family of parents and children",
                        "vi": "gia đình hạt nhân của cha mẹ và con cái"
                    }
                ]
            }
        ]
    },
    {
        "id": "5fb53bfc6da14a089502fba372f3af1c",
        "word": "orphan",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɔːfn/",
            "us": "/ˈɔːrfn/"
        },
        "nearby": [
            {
                "word": "orotund",
                "pos": "adjective"
            },
            {
                "word": "orotundity",
                "pos": "noun"
            },
            {
                "word": "orphan",
                "pos": "noun"
            },
            {
                "word": "orphan",
                "pos": "verb"
            },
            {
                "word": "orphanage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child whose parents are dead",
                    "vi": "một đứa trẻ có cha mẹ đã chết"
                },
                "examples": [
                    {
                        "en": "He was an orphan and lived with his uncle.",
                        "vi": "Anh ấy là một đứa trẻ mồ côi và sống với chú của mình."
                    },
                    {
                        "en": "orphan boys/girls",
                        "vi": "trai / gái mồ côi"
                    },
                    {
                        "en": "a poor little orphan",
                        "vi": "một đứa trẻ mồ côi tội nghiệp"
                    }
                ]
            }
        ]
    },
    {
        "id": "55773716395241e6bc3f2250d33be52a",
        "word": "orphanage",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɔːfənɪdʒ/",
            "us": "/ˈɔːrfənɪdʒ/"
        },
        "nearby": [
            {
                "word": "orphan",
                "pos": "noun"
            },
            {
                "word": "orphan",
                "pos": "verb"
            },
            {
                "word": "orphanage",
                "pos": "noun"
            },
            {
                "word": "ortho-",
                "pos": "combining form"
            },
            {
                "word": "orthodontic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a home for children whose parents are dead",
                    "vi": "một ngôi nhà cho những đứa trẻ có cha mẹ đã chết"
                },
                "examples": [
                    {
                        "en": "She was brought up in an orphanage.",
                        "vi": "Cô được nuôi dưỡng trong một trại trẻ mồ côi."
                    },
                    {
                        "en": "He spent most of his childhood in an orphanage.",
                        "vi": "Anh ấy đã dành phần lớn thời thơ ấu của mình trong trại trẻ mồ côi."
                    },
                    {
                        "en": "My sister and I were adopted from an orphanage.",
                        "vi": "Em gái tôi và tôi được nhận nuôi từ một trại trẻ mồ côi."
                    }
                ]
            }
        ]
    },
    {
        "id": "036ed6d27d5b4477b18e819b647fc1cf",
        "word": "tight-knit",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌtaɪt ˈnɪt/",
            "us": "/ˌtaɪt ˈnɪt/"
        },
        "nearby": [
            {
                "word": "tight-fitting",
                "pos": "adjective"
            },
            {
                "word": "tight head",
                "pos": "noun"
            },
            {
                "word": "tight-knit",
                "pos": "adjective"
            },
            {
                "word": "tight-lipped",
                "pos": "adjective"
            },
            {
                "word": "tightly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with all the members having strong, friendly relationships with one another",
                    "vi": "với tất cả các thành viên có mối quan hệ bền chặt, thân thiện với nhau"
                },
                "examples": [
                    {
                        "en": "a tight-knit mining community",
                        "vi": "một cộng đồng khai thác chặt chẽ"
                    }
                ]
            }
        ]
    },
    {
        "id": "35b96fa30e2c47b293b9822b306eada9",
        "word": "antecedent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæntɪˈsiːdnt/",
            "us": "/ˌæntɪˈsiːdnt/"
        },
        "nearby": [
            {
                "word": "anteater",
                "pos": "noun"
            },
            {
                "word": "antebellum",
                "pos": "adjective"
            },
            {
                "word": "antecedent",
                "pos": "noun"
            },
            {
                "word": "antecedent",
                "pos": "adjective"
            },
            {
                "word": "antechamber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or an event that exists or comes before another, and may have influenced it",
                    "vi": "một sự vật hoặc một sự kiện tồn tại hoặc đến trước một sự vật khác và có thể đã ảnh hưởng đến nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the people in somebody’s family who lived a long time ago",
                    "vi": "những người trong gia đình ai đó đã sống cách đây rất lâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a word or phrase to which the following word, especially a pronoun, refers",
                    "vi": "một từ hoặc cụm từ mà từ sau, đặc biệt là một đại từ, dùng để chỉ"
                },
                "examples": [
                    {
                        "en": "In ‘He grabbed the ball and threw it in the air’, ‘ball’ is the antecedent of ‘it’.",
                        "vi": "Trong 'Anh ta nắm lấy quả bóng và ném nó lên không trung', 'quả bóng' là tiền thân của 'nó'."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac76421440c64d2d9e5b311cd9407e77",
        "word": "birthright",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɜːθraɪt/",
            "us": "/ˈbɜːrθraɪt/"
        },
        "nearby": [
            {
                "word": "birthplace",
                "pos": "noun"
            },
            {
                "word": "birth rate",
                "pos": "noun"
            },
            {
                "word": "birthright",
                "pos": "noun"
            },
            {
                "word": "birthstone",
                "pos": "noun"
            },
            {
                "word": "birthweight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that somebody has a right to because of the family or country they were born in, or because it is a basic right of all humans",
                    "vi": "một thứ mà ai đó có quyền vì gia đình hoặc đất nước họ sinh ra, hoặc vì đó là quyền cơ bản của tất cả con người"
                },
                "examples": [
                    {
                        "en": "The property is the birthright of the eldest child.",
                        "vi": "Tài sản là quyền khai sinh của con cả."
                    },
                    {
                        "en": "Education is every child's birthright.",
                        "vi": "Giáo dục là quyền bẩm sinh của mọi đứa trẻ."
                    },
                    {
                        "en": "They believe that success is their birthright.",
                        "vi": "Họ tin rằng thành công là do họ sinh ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "1af8d88a9bf14334b2d1ed7c016b3748",
        "word": "blended family",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌblendɪd ˈfæməli/",
            "us": "/ˌblendɪd ˈfæməli/"
        },
        "nearby": [
            {
                "word": "blend",
                "pos": "verb"
            },
            {
                "word": "blend",
                "pos": "noun"
            },
            {
                "word": "blended family",
                "pos": "noun"
            },
            {
                "word": "blended learning",
                "pos": "noun"
            },
            {
                "word": "blender",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family that consists of two people and their children from their own relationship and from previous ones",
                    "vi": "một gia đình bao gồm hai người và con cái của họ từ mối quan hệ của chính họ và từ những mối quan hệ trước đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cd28d5207fd948ca8787b5456526cd47",
        "word": "blood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/blʌd/",
            "us": "/blʌd/"
        },
        "nearby": [
            {
                "word": "blonde",
                "pos": "noun"
            },
            {
                "word": "Blondie",
                "pos": ""
            },
            {
                "word": "blood",
                "pos": "noun"
            },
            {
                "word": "blood",
                "pos": "verb"
            },
            {
                "word": "blood bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red liquid that flows through the bodies of humans and animals",
                    "vi": "chất lỏng màu đỏ chảy qua cơ thể người và động vật"
                },
                "examples": [
                    {
                        "en": "He lost a lot of blood in the accident.",
                        "vi": "Anh ấy mất rất nhiều máu trong vụ tai nạn."
                    },
                    {
                        "en": "Blood was pouring out of a cut on her head.",
                        "vi": "Máu tuôn ra từ vết cắt trên đầu cô."
                    },
                    {
                        "en": "His hands were covered in blood.",
                        "vi": "Tay anh bê bết máu."
                    },
                    {
                        "en": "to give blood (= to have blood taken from you so that it can be used in the medical treatment of other people)",
                        "vi": "cho máu (= lấy máu từ bạn để nó có thể được sử dụng trong việc điều trị y tế cho người khác)"
                    },
                    {
                        "en": "After the attacks, people donated blood in record numbers.",
                        "vi": "Sau các vụ tấn công, người dân đã hiến máu với số lượng kỷ lục."
                    },
                    {
                        "en": "He was a hot-headed warrior, always too quick to shed blood (= attack and injure or kill somebody).",
                        "vi": "Anh ta là một chiến binh nóng nảy, luôn đổ máu quá nhanh (= tấn công và làm bị thương hoặc giết ai đó)."
                    },
                    {
                        "en": "to draw blood (= to wound a person so that they lose blood)",
                        "vi": "để lấy máu (= làm vết thương một người để họ mất máu)"
                    },
                    {
                        "en": "a drop/pool of blood",
                        "vi": "một giọt / vũng máu"
                    },
                    {
                        "en": "There was dried blood on her cheek.",
                        "vi": "Có vết máu khô trên má cô."
                    },
                    {
                        "en": "a blood cell/sample",
                        "vi": "một tế bào máu / mẫu"
                    },
                    {
                        "en": "to improve blood flow to the heart",
                        "vi": "cải thiện lưu lượng máu đến tim"
                    },
                    {
                        "en": "the blood supply to the brain",
                        "vi": "cung cấp máu cho não"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of blood mentioned",
                    "vi": "có nhóm máu được đề cập"
                },
                "examples": [
                    {
                        "en": "cold-blooded reptiles",
                        "vi": "loài bò sát máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "family origins",
                    "vi": "nguồn gốc gia đình"
                },
                "examples": [
                    {
                        "en": "She is of noble blood.",
                        "vi": "Cô ấy thuộc dòng máu quý tộc."
                    },
                    {
                        "en": "There is some Polish blood on his father's side.",
                        "vi": "Có chút dòng máu Ba Lan bên cha anh."
                    },
                    {
                        "en": "I doubt if I have a single drop of aristocratic blood in my veins.",
                        "vi": "Tôi nghi ngờ liệu mình có một giọt máu quý tộc trong huyết quản hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and fashionable man",
                    "vi": "một người đàn ông giàu có và thời trang"
                },
                "examples": [
                    {
                        "en": "a young blood",
                        "vi": "một dòng máu trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of hate or strong dislike",
                    "vi": "cảm giác ghét hoặc không thích mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody and want to hurt or punish them",
                    "vi": "tức giận với ai đó và muốn làm tổn thương hoặc trừng phạt họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a natural part of your character and of the character of other members of your family",
                    "vi": "trở thành một phần tự nhiên trong tính cách của bạn và tính cách của các thành viên khác trong gia đình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "family relationships are stronger than any others",
                    "vi": "mối quan hệ gia đình bền chặt hơn bất kỳ mối quan hệ nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody is very angry and ready to argue or fight",
                    "vi": "ai đó rất tức giận và sẵn sàng tranh luận hoặc chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hard work; a lot of effort",
                    "vi": "làm việc rất chăm chỉ; nhiều sự cố gắng"
                },
                "examples": [
                    {
                        "en": "The only way to succeed is through old-fashioned blood, sweat and tears.",
                        "vi": "Cách duy nhất để thành công là thông qua máu, mồ hôi và nước mắt của người già."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "almost impossible to obtain",
                    "vi": "hầu như không thể có được"
                },
                "examples": [
                    {
                        "en": "Getting an apology from him was like getting blood from a stone.",
                        "vi": "Nhận được một lời xin lỗi từ anh ấy giống như nhận được một hòn đá hộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody extremely angry",
                    "vi": "làm cho ai đó cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "The way he treats his employees really makes my blood boil.",
                        "vi": "Cách anh ấy đối xử với nhân viên thực sự khiến tôi sôi máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "new members or employees, especially young ones, with new ideas or ways of doing things",
                    "vi": "các thành viên hoặc nhân viên mới, đặc biệt là những người trẻ tuổi, với những ý tưởng hoặc cách làm mới"
                },
                "examples": [
                    {
                        "en": "This company badly needs to bring in some new blood.",
                        "vi": "Công ty này rất cần phải mang thêm một lượng máu mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill or wound somebody",
                    "vi": "giết hoặc làm bị thương ai đó"
                },
                "examples": [
                    {
                        "en": "Nothing can justify spilling innocent blood.",
                        "vi": "Không gì có thể biện minh cho việc đổ máu vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody excited",
                    "vi": "để làm cho ai đó phấn khích"
                },
                "examples": [
                    {
                        "en": "The atmosphere in a theatre never failed to stir her blood.",
                        "vi": "Bầu không khí trong rạp chiếu phim không bao giờ không khuấy động được máu của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": [
                    {
                        "en": "I sweated blood to get everything ready in time.",
                        "vi": "Tôi đổ mồ hôi máu để chuẩn bị mọi thứ kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "0001c29a4f1c4fa3b5ca24707eea46ec",
        "word": "blue blood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbluː ˈblʌd/",
            "us": "/ˌbluː ˈblʌd/"
        },
        "nearby": [
            {
                "word": "bluebird",
                "pos": "noun"
            },
            {
                "word": "Bluebird",
                "pos": ""
            },
            {
                "word": "blue blood",
                "pos": "noun"
            },
            {
                "word": "blue-blooded",
                "pos": "adjective"
            },
            {
                "word": "blue book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being from a royal or noble family",
                    "vi": "thực tế là xuất thân từ một gia đình hoàng gia hoặc quý tộc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "793085bc7ab84358bb3bb562efd59ba7",
        "word": "blue-blooded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbluː ˈblʌdɪd/",
            "us": "/ˌbluː ˈblʌdɪd/"
        },
        "nearby": [
            {
                "word": "Bluebird",
                "pos": ""
            },
            {
                "word": "blue blood",
                "pos": "noun"
            },
            {
                "word": "blue-blooded",
                "pos": "adjective"
            },
            {
                "word": "blue book",
                "pos": "noun"
            },
            {
                "word": "bluebottle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "from a royal or noble family",
                    "vi": "từ một gia đình hoàng gia hoặc quý tộc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d425cfbd71024ba9add8d15010bd3185",
        "word": "breeding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbriːdɪŋ/",
            "us": "/ˈbriːdɪŋ/"
        },
        "nearby": [
            {
                "word": "breed",
                "pos": "noun"
            },
            {
                "word": "breeder",
                "pos": "noun"
            },
            {
                "word": "breeding",
                "pos": "noun"
            },
            {
                "word": "breeding ground",
                "pos": "noun"
            },
            {
                "word": "breeze",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the keeping of animals in order to breed (= produce young) from them",
                    "vi": "việc nuôi nhốt động vật để sinh sản (= sinh ra con non) từ chúng"
                },
                "examples": [
                    {
                        "en": "the breeding of horses",
                        "vi": "chăn nuôi ngựa"
                    },
                    {
                        "en": "a breeding programme",
                        "vi": "một chương trình nhân giống"
                    }
                ]
            },
            {
                "define": {
                    "en": "the producing of young animals, plants, etc.",
                    "vi": "sản xuất động vật, thực vật non, v.v."
                },
                "examples": [
                    {
                        "en": "the breeding season",
                        "vi": "mùa sinh sản"
                    }
                ]
            },
            {
                "define": {
                    "en": "the family or social background that is thought to result in good manners",
                    "vi": "nền tảng gia đình hoặc xã hội được cho là dẫn đến cách cư xử tốt"
                },
                "examples": [
                    {
                        "en": "a sign of good breeding",
                        "vi": "một dấu hiệu của chăn nuôi tốt"
                    }
                ]
            }
        ]
    },
    {
        "id": "fe26ea9f84d24d199a3c8cfee06d92ad",
        "word": "broken home",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbrəʊkən ˈhəʊm/",
            "us": "/ˌbrəʊkən ˈhəʊm/"
        },
        "nearby": [
            {
                "word": "broken heart",
                "pos": "noun"
            },
            {
                "word": "broken-hearted",
                "pos": "adjective"
            },
            {
                "word": "broken home",
                "pos": "noun"
            },
            {
                "word": "brokenly",
                "pos": "adverb"
            },
            {
                "word": "broker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family in which the parents are divorced or separated",
                    "vi": "một gia đình mà cha mẹ ly hôn hoặc ly thân"
                },
                "examples": [
                    {
                        "en": "She comes from a broken home.",
                        "vi": "Cô ấy đến từ một ngôi nhà tan vỡ."
                    },
                    {
                        "en": "children from a broken home",
                        "vi": "những đứa trẻ từ một ngôi nhà tan vỡ"
                    }
                ]
            }
        ]
    },
    {
        "id": "cef7177ba13f470196d87852b59fa986",
        "word": "consanguinity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnsæŋˈɡwɪnəti/",
            "us": "/ˌkɑːnsæŋˈɡwɪnəti/"
        },
        "nearby": [
            {
                "word": "conquistador",
                "pos": "noun"
            },
            {
                "word": "Joseph Conrad",
                "pos": ""
            },
            {
                "word": "consanguinity",
                "pos": "noun"
            },
            {
                "word": "conscience",
                "pos": "noun"
            },
            {
                "word": "conscience-stricken",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relationship by birth in the same family",
                    "vi": "mối quan hệ sinh ra trong cùng một gia đình"
                },
                "examples": [
                    {
                        "en": "different degrees of consanguinity",
                        "vi": "các mức độ liên quan khác nhau"
                    }
                ]
            }
        ]
    },
    {
        "id": "fb6b79edbcd24b0ca734040e8ff790b6",
        "word": "descent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈsent/",
            "us": "/dɪˈsent/"
        },
        "nearby": [
            {
                "word": "descend to",
                "pos": "phrasal verb"
            },
            {
                "word": "descend upon",
                "pos": "phrasal verb"
            },
            {
                "word": "descent",
                "pos": "noun"
            },
            {
                "word": "describable",
                "pos": "adjective"
            },
            {
                "word": "describe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action of coming or going down",
                    "vi": "một hành động đến hoặc đi xuống"
                },
                "examples": [
                    {
                        "en": "The plane began its descent to Heathrow.",
                        "vi": "Máy bay bắt đầu hạ cánh xuống Heathrow."
                    },
                    {
                        "en": "(figurative) the country’s swift descent into anarchy",
                        "vi": "(nghĩa bóng) đất nước nhanh chóng rơi vào tình trạng vô chính phủ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a slope going downwards",
                    "vi": "một con dốc đi xuống"
                },
                "examples": [
                    {
                        "en": "There is a gradual descent to the sea.",
                        "vi": "Có một cuộc xuống biển dần dần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s family origins",
                    "vi": "nguồn gốc gia đình của một người"
                },
                "examples": [
                    {
                        "en": "to be of Scottish descent",
                        "vi": "là người gốc Scotland"
                    },
                    {
                        "en": "descent from somebody He traces his line of descent from the Stuart kings.",
                        "vi": "dòng dõi từ ai đó Anh ta theo dõi dòng dõi của mình từ các vị vua Stuart."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c505c3d834f47c4bbc40a5f05d988e3",
        "word": "extraction",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪkˈstrækʃn/",
            "us": "/ɪkˈstrækʃn/"
        },
        "nearby": [
            {
                "word": "extract",
                "pos": "noun"
            },
            {
                "word": "extract",
                "pos": "verb"
            },
            {
                "word": "extraction",
                "pos": "noun"
            },
            {
                "word": "extractive",
                "pos": "adjective"
            },
            {
                "word": "extractor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of removing or obtaining something from something else",
                    "vi": "hành động hoặc quá trình loại bỏ hoặc lấy thứ gì đó từ thứ khác"
                },
                "examples": [
                    {
                        "en": "oil/mineral/coal, etc. extraction",
                        "vi": "khai thác dầu / khoáng sản / than, v.v."
                    },
                    {
                        "en": "the extraction of salt from the sea",
                        "vi": "khai thác muối từ biển"
                    },
                    {
                        "en": "Commercial peat extraction is destroying many threatened habitats.",
                        "vi": "Khai thác than bùn thương mại đang phá hủy nhiều môi trường sống bị đe dọa."
                    },
                    {
                        "en": "Methods of extraction vary from mine to mine.",
                        "vi": "Phương pháp khai thác khác nhau giữa các mỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a particular family origin",
                    "vi": "có nguồn gốc gia đình cụ thể"
                },
                "examples": [
                    {
                        "en": "an American of Hungarian extraction",
                        "vi": "một người Mỹ gốc Hungary khai thác"
                    },
                    {
                        "en": "a young American lawyer of Irish extraction",
                        "vi": "một luật sư trẻ người Mỹ gốc Ailen"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of removing a tooth",
                    "vi": "quá trình loại bỏ một chiếc răng"
                },
                "examples": [
                    {
                        "en": "I didn’t like having my teeth drilled but extractions were infinitely worse.",
                        "vi": "Tôi không thích bị khoan răng nhưng nhổ răng thì tệ hơn vô cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "97a325b397ee43c0824eac0088bc5bc4",
        "word": "forebear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːbeə(r)/",
            "us": "/ˈfɔːrber/"
        },
        "nearby": [
            {
                "word": "forearm1",
                "pos": "noun"
            },
            {
                "word": "forearm2",
                "pos": "verb"
            },
            {
                "word": "forebear",
                "pos": "noun"
            },
            {
                "word": "foreboding",
                "pos": "noun"
            },
            {
                "word": "foreboding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person in your family who lived a long time ago",
                    "vi": "một người trong gia đình bạn sống cách đây rất lâu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "71e8334fe07f46b7a1f7797a7a1f3d18",
        "word": "forefather",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːfɑːðə(r)/",
            "us": "/ˈfɔːrfɑːðər/"
        },
        "nearby": [
            {
                "word": "forecourt",
                "pos": "noun"
            },
            {
                "word": "foredoomed",
                "pos": "adjective"
            },
            {
                "word": "forefather",
                "pos": "noun"
            },
            {
                "word": "forefinger",
                "pos": "noun"
            },
            {
                "word": "forefoot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person (especially a man) in your family who lived a long time ago",
                    "vi": "một người (đặc biệt là một người đàn ông) trong gia đình bạn sống cách đây rất lâu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f2a68181cad4f60a5d777efe066558a",
        "word": "genealogical",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒiːniəˈlɒdʒɪkl/",
            "us": "/ˌdʒiːniəˈlɑːdʒɪkl/"
        },
        "nearby": [
            {
                "word": "gene",
                "pos": "noun"
            },
            {
                "word": "Gene",
                "pos": ""
            },
            {
                "word": "genealogical",
                "pos": "adjective"
            },
            {
                "word": "genealogist",
                "pos": "noun"
            },
            {
                "word": "genealogy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the study of family history, including the study of who the ancestors of a particular person were",
                    "vi": "kết nối với nghiên cứu lịch sử gia đình, bao gồm nghiên cứu tổ tiên của một người cụ thể là ai"
                },
                "examples": [
                    {
                        "en": "genealogical research",
                        "vi": "nghiên cứu phả hệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with a particular person's line of ancestors",
                    "vi": "kết nối với dòng họ tổ tiên của một người cụ thể"
                },
                "examples": [
                    {
                        "en": "a genealogical chart/table/tree (= a chart with branches that shows a person’s ancestors)",
                        "vi": "một biểu đồ / bảng / cây phả hệ (= một biểu đồ có các nhánh thể hiện tổ tiên của một người)"
                    }
                ]
            }
        ]
    },
    {
        "id": "a626ee09131f433dad77e788934c717d",
        "word": "genealogy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒiːniˈælədʒi/",
            "us": "/ˌdʒiːniˈælədʒi/"
        },
        "nearby": [
            {
                "word": "genealogical",
                "pos": "adjective"
            },
            {
                "word": "genealogist",
                "pos": "noun"
            },
            {
                "word": "genealogy",
                "pos": "noun"
            },
            {
                "word": "gene editing",
                "pos": "noun"
            },
            {
                "word": "gene pool",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of family history, including the study of who the ancestors of a particular person were",
                    "vi": "nghiên cứu lịch sử gia đình, bao gồm nghiên cứu tổ tiên của một người cụ thể là ai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular person’s line of ancestors; a diagram that shows this",
                    "vi": "dòng tổ tiên của một người cụ thể; một sơ đồ cho thấy điều này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "af45a46b76f44d0ca1be5cc42a5e5762",
        "word": "heirloom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeəluːm/",
            "us": "/ˈerluːm/"
        },
        "nearby": [
            {
                "word": "heir apparent",
                "pos": "noun"
            },
            {
                "word": "heiress",
                "pos": "noun"
            },
            {
                "word": "heirloom",
                "pos": "noun"
            },
            {
                "word": "heirloom",
                "pos": "adjective"
            },
            {
                "word": "heir presumptive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a valuable object that has belonged to the same family for many years",
                    "vi": "một vật có giá trị đã thuộc về cùng một gia đình trong nhiều năm"
                },
                "examples": [
                    {
                        "en": "a family heirloom",
                        "vi": "gia truyền"
                    }
                ]
            }
        ]
    },
    {
        "id": "b1b11a1b544547b5a5c63dd461bf1b5a",
        "word": "illegitimate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪləˈdʒɪtəmət/",
            "us": "/ˌɪləˈdʒɪtəmət/"
        },
        "nearby": [
            {
                "word": "illegibly",
                "pos": "adverb"
            },
            {
                "word": "illegitimacy",
                "pos": "noun"
            },
            {
                "word": "illegitimate",
                "pos": "adjective"
            },
            {
                "word": "illegitimately",
                "pos": "adverb"
            },
            {
                "word": "ill-equipped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "born to parents who are not married to each other",
                    "vi": "sinh ra bởi cha mẹ không kết hôn với nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not allowed by a particular set of rules or by law",
                    "vi": "không được phép bởi một bộ quy tắc cụ thể hoặc luật pháp"
                },
                "examples": [
                    {
                        "en": "illegitimate use of company property",
                        "vi": "sử dụng bất hợp pháp tài sản của công ty"
                    }
                ]
            }
        ]
    },
    {
        "id": "3d4573bd2d224f54a3a88969c11d8be3",
        "word": "joint family",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɔɪnt fæməli/",
            "us": "/ˈdʒɔɪnt fæməli/"
        },
        "nearby": [
            {
                "word": "joint degree",
                "pos": "noun"
            },
            {
                "word": "jointed",
                "pos": "adjective"
            },
            {
                "word": "joint family",
                "pos": "noun"
            },
            {
                "word": "jointly",
                "pos": "adverb"
            },
            {
                "word": "joint resolution",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family structure in which grandparents, uncles, aunts and cousins are considered as a single unit living in one house",
                    "vi": "một cấu trúc gia đình trong đó ông bà, chú, bác, cô và anh chị em họ được coi là một đơn vị sống trong một ngôi nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aeef6631faf6432fa457fb4bd5ef2f6e",
        "word": "kin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɪn/",
            "us": "/kɪn/"
        },
        "nearby": [
            {
                "word": "kimchi",
                "pos": "noun"
            },
            {
                "word": "kimono",
                "pos": "noun"
            },
            {
                "word": "kin",
                "pos": "noun"
            },
            {
                "word": "kinaesthesia",
                "pos": "noun"
            },
            {
                "word": "kind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "your family or your relatives",
                    "vi": "gia đình bạn hoặc người thân của bạn"
                },
                "examples": [
                    {
                        "en": "Marriage between close kin is prohibited.",
                        "vi": "Hôn nhân giữa họ hàng gần bị cấm."
                    }
                ]
            },
            {
                "define": {
                    "en": "friends and relatives",
                    "vi": "bạn bè và người thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "519f5d565e20481a91e40ed6306c3c3b",
        "word": "kinship",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɪnʃɪp/",
            "us": "/ˈkɪnʃɪp/"
        },
        "nearby": [
            {
                "word": "Alfred Kinsey",
                "pos": ""
            },
            {
                "word": "kinsfolk",
                "pos": "noun"
            },
            {
                "word": "kinship",
                "pos": "noun"
            },
            {
                "word": "kinsman",
                "pos": "noun"
            },
            {
                "word": "kinswoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being related in a family",
                    "vi": "thực tế là có quan hệ họ hàng trong một gia đình"
                },
                "examples": [
                    {
                        "en": "the ties of kinship",
                        "vi": "mối quan hệ họ hàng"
                    },
                    {
                        "en": "It is a traditional society in which the kinship group is very important.",
                        "vi": "Đó là một xã hội truyền thống, trong đó nhóm thân tộc là rất quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of being close to somebody because you have similar origins or attitudes",
                    "vi": "cảm giác gần gũi với ai đó bởi vì bạn có cùng nguồn gốc hoặc thái độ"
                },
                "examples": [
                    {
                        "en": "We tend to feel kinship with those who share the same values.",
                        "vi": "Chúng ta có xu hướng cảm thấy họ hàng với những người có cùng giá trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "1481ad529583498db85d348893714c75",
        "word": "kith and kin",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kɪn/",
            "us": "/kɪn/"
        },
        "nearby": [
            {
                "word": "kimchi",
                "pos": "noun"
            },
            {
                "word": "kimono",
                "pos": "noun"
            },
            {
                "word": "kin",
                "pos": "noun"
            },
            {
                "word": "kinaesthesia",
                "pos": "noun"
            },
            {
                "word": "kind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "your family or your relatives",
                    "vi": "gia đình bạn hoặc người thân của bạn"
                },
                "examples": [
                    {
                        "en": "Marriage between close kin is prohibited.",
                        "vi": "Hôn nhân giữa họ hàng gần bị cấm."
                    }
                ]
            },
            {
                "define": {
                    "en": "friends and relatives",
                    "vi": "bạn bè và người thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cc585f26079c4e00970da621989f094c",
        "word": "legitimate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪˈdʒɪtɪmət/",
            "us": "/lɪˈdʒɪtɪmət/"
        },
        "nearby": [
            {
                "word": "legit",
                "pos": "adjective"
            },
            {
                "word": "legitimacy",
                "pos": "noun"
            },
            {
                "word": "legitimate",
                "pos": "adjective"
            },
            {
                "word": "legitimately",
                "pos": "adverb"
            },
            {
                "word": "legitimize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "for which there is a fair and acceptable reason",
                    "vi": "mà có một lý do công bằng và có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "a legitimate grievance",
                        "vi": "một lời than phiền chính đáng"
                    },
                    {
                        "en": "It seemed a perfectly legitimate question.",
                        "vi": "Đó dường như là một câu hỏi hoàn toàn chính đáng."
                    },
                    {
                        "en": "Politicians are legitimate targets for satire.",
                        "vi": "Các chính trị gia là mục tiêu hợp pháp để châm biếm."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowed and acceptable according to the law",
                    "vi": "được phép và chấp nhận được theo luật"
                },
                "examples": [
                    {
                        "en": "the legitimate government of the country",
                        "vi": "chính phủ hợp pháp của đất nước"
                    },
                    {
                        "en": "Is his business strictly legitimate?",
                        "vi": "Công việc kinh doanh của anh ấy có hợp pháp không?"
                    },
                    {
                        "en": "The legitimate government was reinstated after the uprising.",
                        "vi": "Chính phủ hợp pháp đã được phục hồi sau cuộc nổi dậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "born when its parents are legally married to each other",
                    "vi": "được sinh ra khi cha mẹ của nó kết hôn hợp pháp với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fd579fbc5406408ab484e5900d41bdfa",
        "word": "lineal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪniəl/",
            "us": "/ˈlɪniəl/"
        },
        "nearby": [
            {
                "word": "line",
                "pos": "verb"
            },
            {
                "word": "lineage",
                "pos": "noun"
            },
            {
                "word": "lineal",
                "pos": "adjective"
            },
            {
                "word": "lineaments",
                "pos": "noun"
            },
            {
                "word": "linear",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "coming in a direct line from an earlier or later generation of the same family as somebody",
                    "vi": "đến trực tiếp từ một thế hệ sớm hơn hoặc muộn hơn của cùng một gia đình với một người nào đó"
                },
                "examples": [
                    {
                        "en": "a lineal descendant of the company’s founder",
                        "vi": "hậu duệ dòng dõi của người sáng lập công ty"
                    }
                ]
            }
        ]
    },
    {
        "id": "a0d59e55de9542a1979acff5868f3d41",
        "word": "lone-parent family",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌləʊn peərənt ˈfæməli/",
            "us": "/ˌləʊn perənt ˈfæməli/"
        },
        "nearby": [
            {
                "word": "lonely heart",
                "pos": "noun"
            },
            {
                "word": "lone parent",
                "pos": "noun"
            },
            {
                "word": "lone-parent family",
                "pos": "noun"
            },
            {
                "word": "loner",
                "pos": "noun"
            },
            {
                "word": "the Lone Ranger",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a family in which the children live with one parent rather than two",
                    "vi": "một gia đình trong đó con cái sống với một cha mẹ thay vì hai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "76057eacff9744ff894180ee6e95e381",
        "word": "matriarch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeɪtriɑːk/",
            "us": "/ˈmeɪtriɑːrk/"
        },
        "nearby": [
            {
                "word": "matins",
                "pos": "noun"
            },
            {
                "word": "matoke",
                "pos": "noun"
            },
            {
                "word": "matriarch",
                "pos": "noun"
            },
            {
                "word": "matriarchal",
                "pos": "adjective"
            },
            {
                "word": "matriarchy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who is the head of a family or social group",
                    "vi": "một phụ nữ là chủ gia đình hoặc nhóm xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d4fee74450f54b81a97540fc7e11f93e",
        "word": "matrilineal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmætrɪˈlɪniəl/",
            "us": "/ˌmætrɪˈlɪniəl/"
        },
        "nearby": [
            {
                "word": "matriculate",
                "pos": "verb"
            },
            {
                "word": "matriculation",
                "pos": "noun"
            },
            {
                "word": "matrilineal",
                "pos": "adjective"
            },
            {
                "word": "matrimonial",
                "pos": "adjective"
            },
            {
                "word": "matrimony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe the relationship between mother and children that continues in a family with each generation, or something that is based on this relationship",
                    "vi": "được sử dụng để mô tả mối quan hệ giữa mẹ và con cái tiếp tục trong một gia đình với mỗi thế hệ hoặc một cái gì đó dựa trên mối quan hệ này"
                },
                "examples": [
                    {
                        "en": "She traced her family history by matrilineal descent (= starting with her mother, her mother's mother, etc.).",
                        "vi": "Cô ấy truy tìm lịch sử gia đình của mình theo dòng dõi theo mẫu hệ (= bắt đầu từ mẹ cô ấy, mẹ cô ấy, v.v.)."
                    }
                ]
            }
        ]
    },
    {
        "id": "757245c32e564e0a96c9184a6243af95",
        "word": "multiracial",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmʌltiˈreɪʃl/",
            "us": "/ˌmʌltiˈreɪʃl/"
        },
        "nearby": [
            {
                "word": "multiprocessor",
                "pos": "noun"
            },
            {
                "word": "multipurpose",
                "pos": "adjective"
            },
            {
                "word": "multiracial",
                "pos": "adjective"
            },
            {
                "word": "multi-skilling",
                "pos": "noun"
            },
            {
                "word": "multi-storey car park",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "including or involving people of several different races",
                    "vi": "bao gồm hoặc liên quan đến những người thuộc một số chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "a multiracial society",
                        "vi": "một xã hội đa chủng tộc"
                    },
                    {
                        "en": "The proposals were aimed at bringing a peaceful transition to multiracial democracy.",
                        "vi": "Các đề xuất nhằm mang lại một quá trình chuyển đổi hòa bình sang nền dân chủ đa chủng tộc."
                    },
                    {
                        "en": "The island has relatively high rates of multiracial folk.",
                        "vi": "Đảo có tỷ lệ dân gian đa chủng tộc tương đối cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "123a6b12105447f4af8e5c080094112c",
        "word": "paterfamilias",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpeɪtəfəˈmɪliæs/",
            "us": "/ˌpætərfəˈmɪliæs/"
        },
        "nearby": [
            {
                "word": "patently",
                "pos": "adverb"
            },
            {
                "word": "pater",
                "pos": "noun"
            },
            {
                "word": "paterfamilias",
                "pos": "noun"
            },
            {
                "word": "paternal",
                "pos": "adjective"
            },
            {
                "word": "paternalism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the man who is the head of a family",
                    "vi": "người đàn ông là chủ gia đình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d8ccfb477674271b96809927ce2ce58",
        "word": "patriarch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪtriɑːk/",
            "us": "/ˈpeɪtriɑːrk/"
        },
        "nearby": [
            {
                "word": "Pat Malone",
                "pos": "noun"
            },
            {
                "word": "patois",
                "pos": "noun"
            },
            {
                "word": "patriarch",
                "pos": "noun"
            },
            {
                "word": "patriarchal",
                "pos": "adjective"
            },
            {
                "word": "patriarchate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the male head of a family or community",
                    "vi": "trưởng nam của một gia đình hoặc cộng đồng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an old man that people have a lot of respect for",
                    "vi": "một ông già mà mọi người rất kính trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the title of a most senior bishop (= a senior priest) in the Orthodox or Roman Catholic Church",
                    "vi": "chức danh của một giám mục cao cấp nhất (= một linh mục cao cấp) trong Nhà thờ Chính thống giáo hoặc Công giáo La mã"
                },
                "examples": [
                    {
                        "en": "the Patriarch of Constantinople",
                        "vi": "Giáo chủ của Constantinople"
                    },
                    {
                        "en": "the Orthodox Patriarch",
                        "vi": "Giáo chủ Chính thống giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "56138e81c5d8421d89a877505867fb97",
        "word": "patrilineal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpætrɪˈlɪniəl/",
            "us": "/ˌpætrɪˈlɪniəl/"
        },
        "nearby": [
            {
                "word": "Patrick",
                "pos": ""
            },
            {
                "word": "St Patrick",
                "pos": ""
            },
            {
                "word": "patrilineal",
                "pos": "adjective"
            },
            {
                "word": "patrimony",
                "pos": "noun"
            },
            {
                "word": "patriot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe the relationship between father and child that continues in a family with each generation, or something that is based on this relationship",
                    "vi": "được sử dụng để mô tả mối quan hệ giữa cha và con tiếp tục trong một gia đình với mỗi thế hệ hoặc một cái gì đó dựa trên mối quan hệ này"
                },
                "examples": [
                    {
                        "en": "In that society, inheritance of land is patrilineal (= the children get the land that their father owned).",
                        "vi": "Trong xã hội đó, thừa kế ruộng đất là theo dòng dõi (= con cái được hưởng ruộng đất mà cha chúng sở hữu)."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c0152e2ceb34420b2ef753ef19e890e",
        "word": "pedigree",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpedɪɡriː/",
            "us": "/ˈpedɪɡriː/"
        },
        "nearby": [
            {
                "word": "pedicab",
                "pos": "noun"
            },
            {
                "word": "pedicure",
                "pos": "noun"
            },
            {
                "word": "pedigree",
                "pos": "noun"
            },
            {
                "word": "pedigree",
                "pos": "adjective"
            },
            {
                "word": "pediment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the parents, grandparents, etc. of an animal that are all of the same breed (= type); an official record showing this",
                    "vi": "cha mẹ, ông bà, v.v. của một con vật đều thuộc cùng một giống (= loại); một hồ sơ chính thức cho thấy điều này"
                },
                "examples": [
                    {
                        "en": "dogs with good pedigrees (= their ancestors are known and of the same breed)",
                        "vi": "những con chó có phả hệ tốt (= tổ tiên của chúng được biết đến và thuộc cùng một giống)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s family history or the background of something, especially when this is impressive",
                    "vi": "lịch sử gia đình của một người hoặc nền tảng của một cái gì đó, đặc biệt là khi điều này thật ấn tượng"
                },
                "examples": [
                    {
                        "en": "She was proud of her long pedigree.",
                        "vi": "Cô tự hào về phả hệ lâu đời của mình."
                    },
                    {
                        "en": "The product has a pedigree going back to the last century.",
                        "vi": "Sản phẩm có gia phả từ thế kỷ trước."
                    }
                ]
            }
        ]
    }
]