[
    {
        "id": "cee4726cdec24e50a784b764f8f268a3",
        "word": "perpetration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɜːpəˈtreɪʃn/",
            "us": "/ˌpɜːrpəˈtreɪʃn/"
        },
        "nearby": [
            {
                "word": "perpendicular",
                "pos": "noun"
            },
            {
                "word": "perpetrate",
                "pos": "verb"
            },
            {
                "word": "perpetration",
                "pos": "noun"
            },
            {
                "word": "perpetrator",
                "pos": "noun"
            },
            {
                "word": "perpetual",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of committing a crime or doing something wrong or evil",
                    "vi": "hành động phạm tội hoặc làm điều gì đó sai trái hoặc xấu xa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "822749fdaa59411cb112aead3b3e15ef",
        "word": "pervert the course of justice",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pəˈvɜːt/",
            "us": "/pərˈvɜːrt/"
        },
        "nearby": [
            {
                "word": "perversion",
                "pos": "noun"
            },
            {
                "word": "perversity",
                "pos": "noun"
            },
            {
                "word": "pervert",
                "pos": "verb"
            },
            {
                "word": "pervert",
                "pos": "noun"
            },
            {
                "word": "perverted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change a system, process, etc. in a bad way so that it is not what it used to be or what it should be",
                    "vi": "để thay đổi hệ thống, quy trình, v.v. theo hướng xấu để nó không phải như trước đây hoặc nó phải như thế nào"
                },
                "examples": [
                    {
                        "en": "Some scientific discoveries have been perverted to create weapons of destruction.",
                        "vi": "Một số khám phá khoa học đã bị biến thái để tạo ra vũ khí hủy diệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect somebody in a way that makes them act or think in an unacceptable or immoral way",
                    "vi": "ảnh hưởng đến ai đó theo cách khiến họ hành động hoặc suy nghĩ theo cách không thể chấp nhận được hoặc vô đạo đức"
                },
                "examples": [
                    {
                        "en": "Some people believe that television can pervert the minds of children.",
                        "vi": "Một số người tin rằng tivi có thể làm suy nghĩ của trẻ em bị suy sụp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a lie or to do something in order to prevent the police, etc. from finding out the truth about a crime",
                    "vi": "nói dối hoặc làm điều gì đó để ngăn cảnh sát, v.v. tìm ra sự thật về tội phạm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b2e4e16e8e34480ca6bfc2c93fc67f75",
        "word": "pick somebody’s pocket",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪk/",
            "us": "/pɪk/"
        },
        "nearby": [
            {
                "word": "piccaninny",
                "pos": "noun"
            },
            {
                "word": "piccolo",
                "pos": "noun"
            },
            {
                "word": "pick",
                "pos": "verb"
            },
            {
                "word": "pick",
                "pos": "noun"
            },
            {
                "word": "pick-and-mix",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody/something from a group of people or things",
                    "vi": "để chọn ai đó / điều gì đó từ một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "pick somebody/something Pick a number from one to twenty.",
                        "vi": "chọn ai đó / cái gì đó Chọn một số từ một đến hai mươi."
                    },
                    {
                        "en": "They are picking the final team this weekend.",
                        "vi": "Họ sẽ chọn đội cuối cùng vào cuối tuần này."
                    },
                    {
                        "en": "It's time to pick a side (= decide who you support).",
                        "vi": "Đã đến lúc chọn một bên (= quyết định xem bạn ủng hộ ai)."
                    },
                    {
                        "en": "He picked his words carefully.",
                        "vi": "Anh cẩn thận lựa lời."
                    },
                    {
                        "en": "At the beach we picked a spot to sit down.",
                        "vi": "Tại bãi biển, chúng tôi chọn một chỗ để ngồi xuống."
                    },
                    {
                        "en": "pick somebody/something to do something He has been picked to play in this week's game.",
                        "vi": "pick somebody / something to do something Anh ấy đã được chọn để chơi trong trò chơi tuần này."
                    },
                    {
                        "en": "pick somebody/something for something Have you been picked for the team?",
                        "vi": "pick somebody / something for something Bạn đã được chọn vào đội chưa?"
                    },
                    {
                        "en": "pick somebody/something as something It was picked as the best film in the competition.",
                        "vi": "pick somebody / something as something Phim được chọn là phim hay nhất trong cuộc thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take flowers, fruit, etc. from the plant or the tree where they are growing",
                    "vi": "lấy hoa, quả, v.v. từ cây hoặc cây nơi chúng đang phát triển"
                },
                "examples": [
                    {
                        "en": "to pick grapes/strawberries/cotton",
                        "vi": "hái nho / dâu tây / bông"
                    },
                    {
                        "en": "flowers freshly picked from the garden",
                        "vi": "hoa mới hái từ vườn"
                    },
                    {
                        "en": "The common was a great place to go blackberry picking.",
                        "vi": "Điểm chung là một nơi tuyệt vời để đi hái dâu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pull or remove something or small pieces of something from something else, especially with your fingers",
                    "vi": "để kéo hoặc loại bỏ một thứ gì đó hoặc những mảnh nhỏ của thứ gì đó từ thứ khác, đặc biệt là bằng các ngón tay của bạn"
                },
                "examples": [
                    {
                        "en": "pick something + adv./prep. She picked bits of fluff from his sweater.",
                        "vi": "chọn cái gì đó + adv./prep. Cô nhặt những sợi lông tơ từ chiếc áo len của anh."
                    },
                    {
                        "en": "He picked the nuts off the top of the cake.",
                        "vi": "Anh ta nhặt những quả hạch ở trên cùng của chiếc bánh."
                    },
                    {
                        "en": "Names were picked at random out of a hat.",
                        "vi": "Những cái tên được chọn ngẫu nhiên từ một chiếc mũ."
                    },
                    {
                        "en": "pick something to pick your nose (= put your finger inside your nose to remove dried mucus)",
                        "vi": "lấy thứ gì đó để ngoáy mũi (= đưa ngón tay vào trong mũi để loại bỏ chất nhầy khô)"
                    },
                    {
                        "en": "to pick your teeth (= use a small sharp piece of wood or plastice to remove pieces of food from your teeth)",
                        "vi": "ngoáy răng (= dùng một mảnh gỗ nhỏ sắc nhọn hoặc miếng nhựa để loại bỏ các mảnh thức ăn trên răng của bạn)"
                    },
                    {
                        "en": "pick something + adj. The dogs picked the bones clean (= ate all the meat from the bones).",
                        "vi": "chọn cái gì đó + adj. Những con chó nhặt sạch xương (= ăn hết thịt từ xương)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a musical instrument, especially a guitar, by pulling the strings with your fingers",
                    "vi": "để chơi một nhạc cụ, đặc biệt là guitar, bằng cách dùng ngón tay kéo dây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody about something and want to discuss it with them",
                    "vi": "tức giận với ai đó về điều gì đó và muốn thảo luận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose only those things that you like or want very much",
                    "vi": "chỉ chọn những thứ mà bạn thích hoặc rất muốn"
                },
                "examples": [
                    {
                        "en": "You have to take any job you can get—you can't pick and choose.",
                        "vi": "Bạn phải nhận bất kỳ công việc nào mà bạn có thể nhận được — bạn không thể chọn và chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about something because they know more about the subject than you do",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về điều gì đó bởi vì họ biết nhiều hơn về chủ đề này hơn bạn"
                },
                "examples": [
                    {
                        "en": "I need to pick your brains: what can you tell me about credit unions?",
                        "vi": "Tôi cần phải chọn bộ não của bạn: bạn có thể cho tôi biết điều gì về các công đoàn tín dụng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deliberately start a fight or an argument with somebody",
                    "vi": "cố tình bắt đầu một cuộc chiến hoặc một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "He had drunk too much and was ready to pick a fight with anyone who crossed his path.",
                        "vi": "Anh ta đã uống quá nhiều và sẵn sàng gây gổ với bất cứ ai băng qua đường của mình."
                    },
                    {
                        "en": "She tried to pick a quarrel with me.",
                        "vi": "Cô ấy cố cãi nhau với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the weak points in something such as a plan, suggestion, etc.",
                    "vi": "để tìm ra những điểm yếu trong một cái gì đó chẳng hạn như một kế hoạch, gợi ý, v.v."
                },
                "examples": [
                    {
                        "en": "It was easy to pick holes in his arguments.",
                        "vi": "Thật dễ dàng để tìm ra lỗ hổng trong các lập luận của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somebody’s pocket without them noticing",
                    "vi": "ăn trộm thứ gì đó từ túi của ai đó mà họ không nhận ra"
                },
                "examples": [
                    {
                        "en": "The back pocket on a pair of jeans is the easiest one to pick.",
                        "vi": "Túi sau của quần jean là túi dễ chọn nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Their case was torn to shreds by the defence lawyer.",
                        "vi": "Vụ án của họ đã bị luật sư bào chữa xé thành từng mảnh nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay for something",
                    "vi": "để trả tiền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company picked up the tab for his hotel room.",
                        "vi": "Công ty đã chọn tab cho phòng khách sạn của anh ấy."
                    },
                    {
                        "en": "The government will continue to pick up college fees for some students.",
                        "vi": "Chính phủ sẽ tiếp tục thu học phí đại học đối với một số sinh viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return or to help somebody return to a normal situation, particularly after a shock or a disaster",
                    "vi": "để trở lại hoặc để giúp ai đó trở lại tình trạng bình thường, đặc biệt là sau một cú sốc hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "You cannot live your children's lives for them; you can only be there to pick up the pieces when things go wrong.",
                        "vi": "Bạn không thể sống cuộc sống của con cái bạn cho chúng; bạn chỉ có thể ở đó để nhặt từng mảnh khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go faster",
                    "vi": "đi nhanh hơn"
                },
                "examples": [
                    {
                        "en": "The train began to pick up speed.",
                        "vi": "Tàu bắt đầu tăng tốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to an earlier situation or way of life after a period doing something else",
                    "vi": "trở lại hoàn cảnh hoặc lối sống trước đó sau một thời gian làm việc khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to walk carefully, choosing the safest, driest, etc. place to put your feet",
                    "vi": "bước đi cẩn thận, chọn nơi an toàn nhất, khô ráo nhất, v.v. để đặt chân"
                },
                "examples": [
                    {
                        "en": "She picked her way delicately over the rough ground.",
                        "vi": "Cô ấy chọn đường một cách tế nhị trên mặt đất gồ ghề."
                    },
                    {
                        "en": "We picked our way carefully over the jagged rocks.",
                        "vi": "Chúng tôi chọn đường cẩn thận qua những tảng đá lởm chởm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a horse, etc. that you think is most likely to win a race",
                    "vi": "để chọn một con ngựa, v.v. mà bạn cho rằng có nhiều khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "He's very good at picking winners.",
                        "vi": "Anh ấy rất giỏi trong việc chọn người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a very good choice",
                    "vi": "để đưa ra một lựa chọn rất tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "offering somebody an ideal opportunity to gain an advantage",
                    "vi": "cung cấp cho ai đó một cơ hội lý tưởng để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "This is an opportunity ripe for the picking.",
                        "vi": "Đây là thời cơ chín muồi để hái."
                    },
                    {
                        "en": "The Raiders' defense is ripe for the picking.",
                        "vi": "Hàng phòng thủ của Raiders đã chín muồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "d992dc942b7b459f9af50aeee6b2e0e4",
        "word": "pilfer",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪlfə(r)/",
            "us": "/ˈpɪlfər/"
        },
        "nearby": [
            {
                "word": "pile up",
                "pos": "phrasal verb"
            },
            {
                "word": "pile-up",
                "pos": "noun"
            },
            {
                "word": "pilfer",
                "pos": "verb"
            },
            {
                "word": "pilferage",
                "pos": "noun"
            },
            {
                "word": "pilferer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to steal things of little value or in small quantities, especially from the place where you work",
                    "vi": "để ăn cắp những thứ có giá trị nhỏ hoặc với số lượng nhỏ, đặc biệt là từ nơi bạn làm việc"
                },
                "examples": [
                    {
                        "en": "pilfer (from somebody/something) He was caught pilfering.",
                        "vi": "ăn cắp vặt (từ ai đó / cái gì đó) Anh ta bị bắt ăn cắp vặt."
                    },
                    {
                        "en": "pilfer something (from somebody/something) She regularly pilfered stamps from work.",
                        "vi": "ăn cắp một cái gì đó (từ ai đó / cái gì đó) Cô ấy thường xuyên ăn cắp tem từ nơi làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "81eac71b004849e39b16287b47015035",
        "word": "pilfering",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪlfərɪŋ/",
            "us": "/ˈpɪlfərɪŋ/"
        },
        "nearby": [
            {
                "word": "pilferage",
                "pos": "noun"
            },
            {
                "word": "pilferer",
                "pos": "noun"
            },
            {
                "word": "pilfering",
                "pos": "noun"
            },
            {
                "word": "pilgrim",
                "pos": "noun"
            },
            {
                "word": "pilgrimage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of stealing things of little value or in small quantities, especially from the place where you work",
                    "vi": "hành vi ăn cắp những thứ có giá trị nhỏ hoặc với số lượng nhỏ, đặc biệt là từ nơi bạn làm việc"
                },
                "examples": [
                    {
                        "en": "We know that pilfering goes on.",
                        "vi": "Chúng tôi biết rằng ăn cắp vặt vẫn tiếp diễn."
                    }
                ]
            }
        ]
    },
    {
        "id": "1a6cc94416e7415fb5ca97617e7ed024",
        "word": "pimp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪmp/",
            "us": "/pɪmp/"
        },
        "nearby": [
            {
                "word": "Pimm's",
                "pos": "noun"
            },
            {
                "word": "pimp",
                "pos": "noun"
            },
            {
                "word": "pimp",
                "pos": "verb"
            },
            {
                "word": "pimpernel",
                "pos": "noun"
            },
            {
                "word": "pimple",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get customers for somebody working as a prostitute",
                    "vi": "để kiếm khách hàng cho ai đó làm gái mại dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to provide somebody who will have sex with another person in exchange for money",
                    "vi": "cung cấp cho một người nào đó sẽ quan hệ tình dục với người khác để đổi lấy tiền"
                },
                "examples": [
                    {
                        "en": "Joe pimped her to his customers.",
                        "vi": "Joe đã đưa cô đến với khách hàng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add things to something to make it look or sound better, especially by making it more individual",
                    "vi": "để thêm mọi thứ vào một cái gì đó để làm cho nó trông hay hơn, đặc biệt là bằng cách làm cho nó trở nên riêng biệt hơn"
                },
                "examples": [
                    {
                        "en": "pimp something Pimp your car with stylish custom wheels!",
                        "vi": "dắt xe một cái gì đó Hãy trang bị cho chiếc xe của bạn những bánh xe tùy chỉnh đầy phong cách!"
                    },
                    {
                        "en": "pimp something up I would love to pimp the songs up.",
                        "vi": "pimp cái gì đó Tôi rất thích tập hợp các bài hát lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c4c44a05963493cb2f7776a6a1068b5",
        "word": "purloin",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pɜːˈlɔɪn/",
            "us": "/ˈpɜːrlɔɪn/"
        },
        "nearby": [
            {
                "word": "purl",
                "pos": "noun"
            },
            {
                "word": "purlieus",
                "pos": "noun"
            },
            {
                "word": "purloin",
                "pos": "verb"
            },
            {
                "word": "purple",
                "pos": "adjective"
            },
            {
                "word": "purple",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to steal something or use it without permission",
                    "vi": "ăn cắp một cái gì đó hoặc sử dụng nó mà không được phép"
                },
                "examples": [
                    {
                        "en": "We purloined a couple of old computers from work.",
                        "vi": "Chúng tôi đã trang bị một vài máy tính cũ từ nơi làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "62760e04a13b4170a0b0f0755b7d1a3e",
        "word": "push",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pʊʃ/",
            "us": "/pʊʃ/"
        },
        "nearby": [
            {
                "word": "pus",
                "pos": "noun"
            },
            {
                "word": "Edward Pusey",
                "pos": ""
            },
            {
                "word": "push",
                "pos": "verb"
            },
            {
                "word": "push",
                "pos": "noun"
            },
            {
                "word": "push about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to use your hands, arms or body in order to make somebody/something move forward or away from you; to move part of your body into a particular position",
                    "vi": "sử dụng bàn tay, cánh tay hoặc cơ thể của bạn để làm cho ai đó / cái gì đó tiến về phía trước hoặc ra xa bạn; để di chuyển một phần cơ thể của bạn vào một vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "We pushed and pushed but the piano wouldn't move.",
                        "vi": "Chúng tôi đẩy và đẩy nhưng cây đàn piano không di chuyển."
                    },
                    {
                        "en": "Push hard when I tell you to.",
                        "vi": "Đẩy mạnh khi tôi nói với bạn."
                    },
                    {
                        "en": "You push and I'll pull.",
                        "vi": "Bạn đẩy và tôi sẽ kéo."
                    },
                    {
                        "en": "push at something She pushed at the door but it wouldn't budge.",
                        "vi": "đẩy vào thứ gì đó Cô ấy đã đẩy vào cửa nhưng nó sẽ không nhúc nhích."
                    },
                    {
                        "en": "push somebody/something He walked slowly up the hill pushing his bike.",
                        "vi": "đẩy ai đó / cái gì đó Anh ấy đi chậm lên đồi đẩy chiếc xe đạp của mình."
                    },
                    {
                        "en": "Somebody pushed me and I fell over.",
                        "vi": "Ai đó đã đẩy tôi và tôi ngã nhào."
                    },
                    {
                        "en": "When you push the gate, it doesn't open.",
                        "vi": "Khi bạn đẩy cổng, nó không mở."
                    },
                    {
                        "en": "push somebody/something + adv./prep. She pushed the cup towards me.",
                        "vi": "đẩy ai đó / cái gì đó + adv./prep. Cô ấy đẩy chiếc cốc về phía tôi."
                    },
                    {
                        "en": "He pushed his chair back and stood up.",
                        "vi": "Anh đẩy ghế ra sau và đứng dậy."
                    },
                    {
                        "en": "He tried to kiss her but she pushed him away.",
                        "vi": "Anh cố gắng hôn cô nhưng cô đã đẩy anh ra."
                    },
                    {
                        "en": "She pushed her face towards him.",
                        "vi": "Cô đẩy mặt mình về phía anh."
                    },
                    {
                        "en": "push something + adj. I pushed the door open.",
                        "vi": "đẩy cái gì đó + adj. Tôi đẩy cửa vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use force to move past somebody/something using your hands, arms, etc.",
                    "vi": "sử dụng lực để di chuyển qua ai đó / vật gì đó bằng tay, cánh tay của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "People were pushing and shoving to get to the front.",
                        "vi": "Mọi người đã xô đẩy và xô đẩy để có được phía trước."
                    },
                    {
                        "en": "push + adv./prep. The fans pushed against the barrier.",
                        "vi": "đẩy + adv./prep. Các cổ động viên đã chống lại hàng rào."
                    },
                    {
                        "en": "push your way + adv./prep. Try and push your way through the crowd.",
                        "vi": "đẩy theo cách của bạn + adv./prep. Cố gắng vượt qua đám đông theo cách của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to press a switch, button, etc., for example in order to make a machine start working",
                    "vi": "để nhấn một công tắc, nút, v.v., chẳng hạn như để làm cho máy bắt đầu hoạt động"
                },
                "examples": [
                    {
                        "en": "I pushed the button for the top floor.",
                        "vi": "Tôi nhấn nút cho tầng trên cùng."
                    },
                    {
                        "en": "The operator must have accidentally pushed the switch on the joystick.",
                        "vi": "Người điều khiển hẳn đã vô tình đẩy công tắc trên cần điều khiển."
                    },
                    {
                        "en": "She pushed a lever and the machine responded.",
                        "vi": "Cô nhấn một đòn bẩy và máy phản hồi."
                    },
                    {
                        "en": "Push the red button to open the doors.",
                        "vi": "Nhấn nút màu đỏ để mở cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect something so that it reaches a particular level or state",
                    "vi": "ảnh hưởng đến một cái gì đó để nó đạt đến một cấp độ hoặc trạng thái cụ thể"
                },
                "examples": [
                    {
                        "en": "This development could push the country into recession.",
                        "vi": "Diễn biến này có thể đẩy đất nước vào suy thoái."
                    },
                    {
                        "en": "The rise in interest rates will push prices up.",
                        "vi": "Lãi suất tăng sẽ đẩy giá cả lên."
                    },
                    {
                        "en": "Little pent-up demand exists to push the economy forward this year.",
                        "vi": "Nhu cầu bị dồn nén ít tồn tại để thúc đẩy nền kinh tế phát triển trong năm nay."
                    },
                    {
                        "en": "The surplus has helped push world prices to as little as 55 euros per tonne.",
                        "vi": "Thặng dư đã giúp đẩy giá thế giới xuống chỉ còn 55 euro / tấn."
                    },
                    {
                        "en": "Such a huge population increase will continue to push food prices higher.",
                        "vi": "Sự gia tăng dân số khổng lồ như vậy sẽ tiếp tục đẩy giá lương thực lên cao hơn."
                    },
                    {
                        "en": "Rising inflation pushes down real interest rates.",
                        "vi": "Lạm phát gia tăng đẩy lãi suất thực giảm xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade or encourage somebody to do something that they may not want to do",
                    "vi": "thuyết phục hoặc khuyến khích ai đó làm điều gì đó mà họ có thể không muốn làm"
                },
                "examples": [
                    {
                        "en": "push somebody into something He made it clear that he would resist any attempt to push him into early retirement.",
                        "vi": "đẩy ai đó vào một điều gì đó."
                    },
                    {
                        "en": "push somebody into doing something My teacher pushed me into entering the competition.",
                        "vi": "đẩy ai đó làm điều gì đó Giáo viên của tôi đã thúc đẩy tôi tham gia cuộc thi."
                    },
                    {
                        "en": "push somebody to do something No one pushed you to take the job, did they?",
                        "vi": "thúc đẩy ai đó làm điều gì đó Không ai thúc đẩy bạn nhận công việc phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody work hard",
                    "vi": "để làm cho ai đó làm việc chăm chỉ"
                },
                "examples": [
                    {
                        "en": "The music teacher really pushes her pupils.",
                        "vi": "Cô giáo dạy nhạc thực sự thúc ép học sinh của mình."
                    },
                    {
                        "en": "Lucy should push herself a little harder.",
                        "vi": "Lucy nên cố gắng hơn một chút."
                    },
                    {
                        "en": "He keeps pushing himself to get better.",
                        "vi": "Anh ấy không ngừng thúc đẩy bản thân để trở nên tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put pressure on somebody and make them angry or upset",
                    "vi": "gây áp lực lên ai đó và khiến họ tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Her parents are very tolerant, but sometimes she pushes them too far.",
                        "vi": "Cha mẹ cô ấy rất bao dung, nhưng đôi khi cô ấy đã đẩy họ đi quá xa."
                    },
                    {
                        "en": "He felt he was being pushed to the limit of his self-control.",
                        "vi": "Anh cảm thấy mình bị đẩy đến giới hạn tự chủ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try hard to persuade people to accept or agree with a new idea, buy a new product, etc.",
                    "vi": "cố gắng thuyết phục mọi người chấp nhận hoặc đồng ý với một ý tưởng mới, mua một sản phẩm mới, v.v."
                },
                "examples": [
                    {
                        "en": "The interview gave him a chance to push his latest movie.",
                        "vi": "Cuộc phỏng vấn đã cho anh ấy một cơ hội để thúc đẩy bộ phim mới nhất của mình."
                    },
                    {
                        "en": "She didn't want to push the point any further at that moment.",
                        "vi": "Cô ấy không muốn đẩy vấn đề thêm nữa vào lúc đó."
                    },
                    {
                        "en": "He continues to push his own political agenda.",
                        "vi": "Ông tiếp tục thúc đẩy chương trình nghị sự chính trị của riêng mình."
                    },
                    {
                        "en": "Sales promotion is designed to push certain products.",
                        "vi": "Khuyến mại được thiết kế để đẩy một số sản phẩm nhất định."
                    },
                    {
                        "en": "The two governments are pushing for economic reform in the region.",
                        "vi": "Chính phủ hai nước đang thúc đẩy cải cách kinh tế trong khu vực."
                    },
                    {
                        "en": "They're pushing hard for a ban on GM foods.",
                        "vi": "Họ đang thúc đẩy một lệnh cấm thực phẩm biến đổi gen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sell illegal drugs",
                    "vi": "bán ma túy bất hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move forward quickly through an area",
                    "vi": "để di chuyển nhanh chóng về phía trước qua một khu vực"
                },
                "examples": [
                    {
                        "en": "The army pushed (on) towards the capital.",
                        "vi": "Quân đội đã đẩy (trên) về phía thủ đô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be nearly 40, 50, etc. years old",
                    "vi": "gần 40, 50, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be dead and buried in the ground",
                    "vi": "chết và chôn trong đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to react in a sudden or extreme way to something unexpected that has frightened you",
                    "vi": "phản ứng một cách đột ngột hoặc quá khích trước một điều gì đó bất ngờ khiến bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "The prime minister pressed the panic button yesterday as Britain’s economy plunged deeper into crisis.",
                        "vi": "Thủ tướng nhấn nút hoảng loạn ngày hôm qua khi nền kinh tế Anh chìm sâu hơn vào khủng hoảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do exactly the right things to please somebody",
                    "vi": "làm chính xác những điều đúng đắn để làm hài lòng ai đó"
                },
                "examples": [
                    {
                        "en": "a new satirical comedy show that pushes all the right buttons",
                        "vi": "một chương trình hài châm biếm mới nhấn tất cả các nút bên phải"
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend a lot of money on enjoying yourself or celebrating something",
                    "vi": "chi nhiều tiền để tận hưởng bản thân hoặc kỷ niệm một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to attempt to go beyond what is allowed or thought to be possible",
                    "vi": "cố gắng vượt ra ngoài những gì được phép hoặc được cho là có thể"
                },
                "examples": [
                    {
                        "en": "We aim to push the boundaries of what we can achieve.",
                        "vi": "Chúng tôi đặt mục tiêu thúc đẩy ranh giới của những gì chúng tôi có thể đạt được."
                    },
                    {
                        "en": "She pushes her physical limits through various endurance challenges.",
                        "vi": "Cô ấy vượt qua giới hạn thể chất của mình thông qua các thử thách sức bền khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go beyond the limits of what is allowed or thought to be possible",
                    "vi": "vượt qua giới hạn của những gì được phép hoặc được cho là có thể"
                },
                "examples": [
                    {
                        "en": "He is a performer who consistently pushes the envelope of TV comedy.",
                        "vi": "Anh ấy là một nghệ sĩ thường xuyên đẩy mạnh phong cách hài truyền hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk because you have successfully avoided problems in the past",
                    "vi": "chấp nhận rủi ro vì bạn đã thành công trong việc tránh các vấn đề trong quá khứ"
                },
                "examples": [
                    {
                        "en": "You didn't get caught last time, but don't push your luck!",
                        "vi": "Bạn đã không bị bắt lần trước, nhưng đừng đẩy vận may của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to lose control of their behaviour, usually after a particular event or series of events",
                    "vi": "buộc ai đó mất kiểm soát hành vi của họ, thường là sau một sự kiện cụ thể hoặc một chuỗi sự kiện"
                },
                "examples": [
                    {
                        "en": "No one knows exactly what caused his breakdown, but losing his job may have pushed him over the edge.",
                        "vi": "Không ai biết chính xác điều gì đã gây ra sự suy sụp của anh ấy, nhưng việc mất việc có thể đã đẩy anh ấy đến bờ vực thẳm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react in a sudden or extreme way to something unexpected that has frightened you",
                    "vi": "phản ứng một cách đột ngột hoặc quá khích trước một điều gì đó bất ngờ khiến bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "The prime minister pushed the panic button yesterday as Britain's economy plunged deeper into crisis.",
                        "vi": "Thủ tướng đã nhấn nút hoảng sợ vào ngày hôm qua khi nền kinh tế Anh chìm sâu hơn vào khủng hoảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to forget about something unpleasant",
                    "vi": "cố gắng quên đi điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "I tried to push the thought to the back of my mind.",
                        "vi": "Tôi cố gắng đẩy ý nghĩ về phía sau tâm trí của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "06ffcbc012e040f1a0b0a1398a3e2995",
        "word": "ransom",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrænsəm/",
            "us": "/ˈrænsəm/"
        },
        "nearby": [
            {
                "word": "ransack",
                "pos": "verb"
            },
            {
                "word": "ransom",
                "pos": "noun"
            },
            {
                "word": "ransom",
                "pos": "verb"
            },
            {
                "word": "Arthur Ransome",
                "pos": ""
            },
            {
                "word": "ransomware",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay money to somebody so that they will set free the person that they are keeping as a prisoner",
                    "vi": "trả tiền cho ai đó để họ sẽ trả tự do cho người mà họ đang giam giữ như một tù nhân"
                },
                "examples": [
                    {
                        "en": "The kidnapped children were all ransomed and returned home unharmed.",
                        "vi": "Những đứa trẻ bị bắt cóc đều đã được đòi tiền chuộc và trở về nhà bình an vô sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "d64bf6ebe6b84f4cb1b67596cf71c126",
        "word": "rifle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈraɪfl/",
            "us": "/ˈraɪfl/"
        },
        "nearby": [
            {
                "word": "riff-raff",
                "pos": "noun"
            },
            {
                "word": "rifle",
                "pos": "noun"
            },
            {
                "word": "rifle",
                "pos": "verb"
            },
            {
                "word": "rifleman",
                "pos": "noun"
            },
            {
                "word": "rifle range",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to search quickly through something in order to find or steal something",
                    "vi": "tìm kiếm một cách nhanh chóng thông qua một cái gì đó để tìm hoặc lấy cắp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She rifled through her clothes for something suitable to wear.",
                        "vi": "Cô lục tung quần áo của mình để tìm thứ gì đó phù hợp để mặc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somewhere",
                    "vi": "ăn cắp một cái gì đó từ một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "His wallet had been rifled.",
                        "vi": "Ví của anh ta đã bị xé toạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kick a ball very hard and straight in a game of football (soccer)",
                    "vi": "đá bóng rất mạnh và thẳng trong một trò chơi bóng đá (bóng đá)"
                },
                "examples": [
                    {
                        "en": "She rifled the ball into the roof of the net.",
                        "vi": "Cô ấy sút bóng vào nóc lưới."
                    }
                ]
            }
        ]
    },
    {
        "id": "79bab27fb31b4a06be375b2a4d9624c6",
        "word": "riotous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈraɪətəs/",
            "us": "/ˈraɪətəs/"
        },
        "nearby": [
            {
                "word": "riot gear",
                "pos": "noun"
            },
            {
                "word": "rioting",
                "pos": "noun"
            },
            {
                "word": "riotous",
                "pos": "adjective"
            },
            {
                "word": "riotously",
                "pos": "adverb"
            },
            {
                "word": "riot police",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "noisy and/or violent, especially in a public place",
                    "vi": "ồn ào và / hoặc bạo lực, đặc biệt là ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "riotous behaviour",
                        "vi": "hành vi bạo loạn"
                    },
                    {
                        "en": "The organizers of the march were charged with assault and riotous assembly.",
                        "vi": "Những người tổ chức cuộc tuần hành đã bị buộc tội tấn công và tụ tập bạo loạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "noisy, exciting and fun",
                    "vi": "ồn ào, thú vị và vui vẻ"
                },
                "examples": [
                    {
                        "en": "a riotous party",
                        "vi": "một bữa tiệc náo loạn"
                    },
                    {
                        "en": "riotous laughter",
                        "vi": "tiếng cười náo loạn"
                    },
                    {
                        "en": "The evening was quite riotous.",
                        "vi": "Buổi tối khá náo loạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "a36aa06d2dd94853ab18fed88153c8f8",
        "word": "run",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌn/",
            "us": "/rʌn/"
        },
        "nearby": [
            {
                "word": "rumpus room",
                "pos": "noun"
            },
            {
                "word": "rumpy pumpy",
                "pos": "noun"
            },
            {
                "word": "run",
                "pos": "verb"
            },
            {
                "word": "run",
                "pos": "noun"
            },
            {
                "word": "runabout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move using your legs, going faster than when you walk",
                    "vi": "di chuyển bằng chân của bạn, đi nhanh hơn khi bạn đi bộ"
                },
                "examples": [
                    {
                        "en": "Can you run as fast as Mike?",
                        "vi": "Bạn có thể chạy nhanh như Mike?"
                    },
                    {
                        "en": "They turned and ran when they saw us coming.",
                        "vi": "Họ quay đầu bỏ chạy khi thấy chúng tôi đến."
                    },
                    {
                        "en": "She came running to meet us.",
                        "vi": "Cô ấy chạy đến gặp chúng tôi."
                    },
                    {
                        "en": "I had to run to catch the bus.",
                        "vi": "Tôi phải chạy để bắt xe buýt."
                    },
                    {
                        "en": "+ adv./prep. The dogs ran off as soon as we appeared.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "He ran home in tears to his mother.",
                        "vi": "Anh chạy về nhà trong nước mắt với mẹ."
                    },
                    {
                        "en": "The children spent the morning running around in the park.",
                        "vi": "Bọn trẻ đã dành cả buổi sáng để chạy quanh công viên."
                    },
                    {
                        "en": "She can run really fast.",
                        "vi": "Cô ấy có thể chạy rất nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel a particular distance by running",
                    "vi": "để di chuyển một khoảng cách cụ thể bằng cách chạy"
                },
                "examples": [
                    {
                        "en": "Who was the first person to run a mile in under four minutes?",
                        "vi": "Ai là người đầu tiên chạy một dặm trong vòng dưới bốn phút?"
                    },
                    {
                        "en": "I ran four miles today.",
                        "vi": "Tôi đã chạy bốn dặm hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run as a sport",
                    "vi": "chạy như một môn thể thao"
                },
                "examples": [
                    {
                        "en": "She used to run when she was at college.",
                        "vi": "Cô ấy đã từng chạy khi còn học đại học."
                    },
                    {
                        "en": "I often go running before work.",
                        "vi": "Tôi thường chạy trước khi làm việc."
                    },
                    {
                        "en": "Try to run round the block a few times every morning.",
                        "vi": "Cố gắng chạy vòng quanh khu nhà vài lần vào mỗi buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take part in a race",
                    "vi": "tham gia một cuộc đua"
                },
                "examples": [
                    {
                        "en": "run in something He will be running in the 100 metres tonight.",
                        "vi": "chạy trong một cái gì đó Anh ấy sẽ chạy trong 100 mét tối nay."
                    },
                    {
                        "en": "There are only five horses running in the first race.",
                        "vi": "Chỉ có năm con ngựa chạy trong cuộc đua đầu tiên."
                    },
                    {
                        "en": "run something to run a marathon",
                        "vi": "chạy cái gì đó để chạy marathon"
                    },
                    {
                        "en": "Farah ran a fine race to take the gold medal.",
                        "vi": "Farah đã chạy một cuộc đua tốt để giành lấy huy chương vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a race take place",
                    "vi": "để làm cho một cuộc đua diễn ra"
                },
                "examples": [
                    {
                        "en": "The Derby will be run in spite of the bad weather.",
                        "vi": "Trận Derby sẽ diễn ra bất chấp thời tiết xấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurry from one place to another",
                    "vi": "nhanh chóng từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "I've spent the whole day running around after the kids.",
                        "vi": "Tôi đã dành cả ngày để chạy theo lũ trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of a business, campaign, etc.",
                    "vi": "phụ trách kinh doanh, chiến dịch, v.v."
                },
                "examples": [
                    {
                        "en": "to run a hotel/store/language school",
                        "vi": "để điều hành một khách sạn / cửa hàng / trường ngoại ngữ"
                    },
                    {
                        "en": "He has no idea how to run a business.",
                        "vi": "Anh ta không biết làm thế nào để điều hành một doanh nghiệp."
                    },
                    {
                        "en": "Stop trying to run my life (= organize it) for me.",
                        "vi": "Ngừng cố gắng điều hành cuộc sống của tôi (= sắp xếp nó) cho tôi."
                    },
                    {
                        "en": "The shareholders want more say in how the company is run.",
                        "vi": "Các cổ đông muốn nói nhiều hơn về cách công ty được điều hành."
                    },
                    {
                        "en": "a badly run company",
                        "vi": "một công ty hoạt động tồi tệ"
                    },
                    {
                        "en": "Both candidates have run a good campaign.",
                        "vi": "Cả hai ứng cử viên đều đã chạy một chiến dịch tốt."
                    },
                    {
                        "en": "state-run industries",
                        "vi": "các ngành công nghiệp quốc doanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a service, course of study, etc. available to people",
                    "vi": "để cung cấp một dịch vụ, khóa học, v.v. cho mọi người"
                },
                "examples": [
                    {
                        "en": "The college runs summer courses for foreign students.",
                        "vi": "Trường tổ chức các khóa học mùa hè cho sinh viên nước ngoài."
                    },
                    {
                        "en": "The programme will be jointly run with NASA in the US.",
                        "vi": "Chương trình sẽ được phối hợp thực hiện với NASA tại Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel on a particular route",
                    "vi": "đi du lịch trên một tuyến đường cụ thể"
                },
                "examples": [
                    {
                        "en": "Buses to Oxford run every half hour.",
                        "vi": "Xe buýt đến Oxford chạy cứ nửa giờ một lần."
                    },
                    {
                        "en": "+ adv./prep. All the trains are running late (= are leaving later than planned).",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Trains between London and Brighton run throughout the day.",
                        "vi": "Các chuyến tàu giữa London và Brighton chạy suốt cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make buses, trains, etc. travel on a particular route",
                    "vi": "để làm cho xe buýt, xe lửa, v.v. đi trên một tuyến đường cụ thể"
                },
                "examples": [
                    {
                        "en": "run something + adv./prep. They run extra trains during the rush hour.",
                        "vi": "chạy cái gì đó + adv./prep. Họ chạy thêm tàu trong giờ cao điểm."
                    },
                    {
                        "en": "The transport company is concerned about the cost of running more buses.",
                        "vi": "Công ty vận tải lo ngại về chi phí chạy thêm xe buýt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate or function; to make something do this",
                    "vi": "để vận hành hoặc hoạt động; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Stan had the chainsaw running.",
                        "vi": "Stan đã chạy cưa máy."
                    },
                    {
                        "en": "run on something Our van runs on (= uses) diesel.",
                        "vi": "chạy bằng thứ gì đó Xe van của chúng tôi chạy bằng (= sử dụng) dầu diesel."
                    },
                    {
                        "en": "run something Could you run the engine for a moment?",
                        "vi": "chạy cái gì đó Bạn có thể chạy động cơ trong giây lát được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "when a computer program or system runs or somebody runs it, it operates",
                    "vi": "khi một chương trình hoặc hệ thống máy tính chạy hoặc ai đó chạy nó, nó sẽ hoạt động"
                },
                "examples": [
                    {
                        "en": "You may find that some apps are running slowly.",
                        "vi": "Bạn có thể thấy rằng một số ứng dụng đang chạy chậm."
                    },
                    {
                        "en": "There are too many programs running on your computer.",
                        "vi": "Có quá nhiều chương trình đang chạy trên máy tính của bạn."
                    },
                    {
                        "en": "You need to have antivirus software running on your PC.",
                        "vi": "Bạn cần có phần mềm chống vi-rút chạy trên PC của mình."
                    },
                    {
                        "en": "The app runs on all Android devices.",
                        "vi": "Ứng dụng này chạy trên tất cả các thiết bị Android."
                    },
                    {
                        "en": "run something You can run the program overnight.",
                        "vi": "chạy một cái gì đó Bạn có thể chạy chương trình qua đêm."
                    },
                    {
                        "en": "My PC runs Windows 10.",
                        "vi": "PC của tôi chạy Windows 10."
                    },
                    {
                        "en": "Don't forget to run a final spellcheck.",
                        "vi": "Đừng quên kiểm tra chính tả lần cuối."
                    },
                    {
                        "en": "What applications were you running when the problem occurred?",
                        "vi": "Bạn đã chạy những ứng dụng nào khi sự cố xảy ra?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a recording on a tape runs or somebody runs it, it plays",
                    "vi": "nếu bản ghi trên băng chạy hoặc ai đó chạy nó, nó sẽ phát"
                },
                "examples": [
                    {
                        "en": "He didn't know the tape was still running.",
                        "vi": "Anh ta không biết cuốn băng vẫn đang chạy."
                    },
                    {
                        "en": "run something Run the tape, please.",
                        "vi": "chạy cái gì đó Chạy băng, làm ơn."
                    },
                    {
                        "en": "run something + adv./prep. Can you run the tape back a few minutes?",
                        "vi": "chạy cái gì đó + adv./prep. Bạn có thể chạy đoạn băng trở lại vài phút không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to own and use a vehicle or machine",
                    "vi": "sở hữu và sử dụng một phương tiện hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "I can't afford to run a car on my salary.",
                        "vi": "Tôi không có khả năng chạy xe hơi bằng tiền lương của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drive somebody to a place in a car",
                    "vi": "để chở ai đó đến một nơi trong ô tô"
                },
                "examples": [
                    {
                        "en": "Shall I run you home?",
                        "vi": "Tôi sẽ đưa bạn về nhà?"
                    },
                    {
                        "en": "Would you mind running me to the shops?",
                        "vi": "Bạn có phiền đưa tôi đến các cửa hàng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, especially quickly, in a particular direction",
                    "vi": "để di chuyển, đặc biệt là nhanh chóng, theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "The car ran off the road into a ditch.",
                        "vi": "Chiếc xe ô tô lao khỏi đường vào một con mương."
                    },
                    {
                        "en": "A shiver ran down my spine.",
                        "vi": "Một cơn rùng mình chạy dọc sống lưng."
                    },
                    {
                        "en": "The sledge ran smoothly over the frozen snow.",
                        "vi": "Chiếc xe trượt tuyết chạy êm ru trên lớp tuyết đóng băng."
                    },
                    {
                        "en": "The old tramlines are still there but now no trams run on them.",
                        "vi": "Các tuyến xe điện cũ vẫn còn đó nhưng bây giờ không có xe điện nào chạy trên chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move something in a particular direction",
                    "vi": "để di chuyển một cái gì đó theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "She ran her fingers nervously through her hair.",
                        "vi": "Cô lo lắng lướt những ngón tay qua mái tóc của mình."
                    },
                    {
                        "en": "I ran my eyes over the page.",
                        "vi": "Tôi lướt mắt qua trang giấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or stretch from one place to another; to make something do this",
                    "vi": "để dẫn dắt hoặc kéo dài từ nơi này sang nơi khác; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. He had a scar running down his left cheek.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The road runs parallel to the river.",
                        "vi": "Con đường chạy song song với dòng sông."
                    },
                    {
                        "en": "The railway line runs right past the house.",
                        "vi": "Tuyến đường sắt chạy ngang qua nhà."
                    },
                    {
                        "en": "run something The bookcase runs the length of the room.",
                        "vi": "run something Tủ sách chạy theo chiều dài của căn phòng."
                    },
                    {
                        "en": "run something + adv./prep. We ran a cable from the lights to the stage.",
                        "vi": "chạy cái gì đó + adv./prep. Chúng tôi đã chạy một dây cáp từ đèn đến sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to flow",
                    "vi": "chảy"
                },
                "examples": [
                    {
                        "en": "The tears ran down her cheeks.",
                        "vi": "Những giọt nước mắt chảy dài trên má."
                    },
                    {
                        "en": "Water was running all over the bathroom floor.",
                        "vi": "Nước chảy khắp sàn phòng tắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make liquid flow",
                    "vi": "để làm cho chất lỏng chảy"
                },
                "examples": [
                    {
                        "en": "run something (into something) She ran hot water into the bucket.",
                        "vi": "chạy cái gì đó (vào một cái gì đó) Cô ấy chạy nước nóng vào xô."
                    },
                    {
                        "en": "to run the hot tap (= to turn it so that water flows from it)",
                        "vi": "để chạy vòi nước nóng (= vặn vòi để nước chảy từ vòi)"
                    },
                    {
                        "en": "run something for somebody I'll run a bath for you.",
                        "vi": "chạy cái gì đó cho ai đó Tôi sẽ chạy cái tắm cho bạn."
                    },
                    {
                        "en": "run somebody something I'll run you a bath.",
                        "vi": "chạy ai đó cái gì đó tôi sẽ tắm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send out a liquid",
                    "vi": "gửi ra chất lỏng"
                },
                "examples": [
                    {
                        "en": "Who left the tap running?",
                        "vi": "Ai để vòi chạy?"
                    },
                    {
                        "en": "Your nose is running (= mucus is flowing from it).",
                        "vi": "Mũi của bạn đang chảy (= chất nhầy chảy ra từ nó)."
                    },
                    {
                        "en": "The smoke makes my eyes run.",
                        "vi": "Khói làm tôi chảy nước mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be covered with a liquid",
                    "vi": "được bao phủ bởi một chất lỏng"
                },
                "examples": [
                    {
                        "en": "His face was running with sweat.",
                        "vi": "Mặt anh lấm tấm mồ hôi."
                    },
                    {
                        "en": "The bathroom floor was running with water.",
                        "vi": "Sàn phòng tắm chảy đầy nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the colour runs in a piece of clothing, etc. when it gets wet, the colour comes out of the material and spreads into other pieces of clothing, etc. in the same water",
                    "vi": "nếu màu chảy trong quần áo, v.v. khi bị ướt, màu sẽ ra khỏi vật liệu và lan sang các mảnh quần áo khác, v.v. trong cùng một nước"
                },
                "examples": [
                    {
                        "en": "The colour ran and made all my underwear pink.",
                        "vi": "Màu sắc chạy và làm cho tất cả đồ lót của tôi màu hồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to melt",
                    "vi": "tan chảy"
                },
                "examples": [
                    {
                        "en": "The wax began to run.",
                        "vi": "Sáp bắt đầu chảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become different in a particular way, especially a bad way",
                    "vi": "trở nên khác biệt theo một cách cụ thể, đặc biệt là một cách xấu"
                },
                "examples": [
                    {
                        "en": "The river ran dry (= stopped flowing) during the drought.",
                        "vi": "Sông cạn (= ngừng chảy) trong thời gian hạn hán."
                    },
                    {
                        "en": "Supplies are running low.",
                        "vi": "Nguồn cung cấp sắp hết."
                    },
                    {
                        "en": "We understand that feelings are running high on this issue",
                        "vi": "Chúng tôi hiểu rằng cảm giác đang dâng cao về vấn đề này"
                    },
                    {
                        "en": "We've run short of milk.",
                        "vi": "Chúng tôi đã thiếu sữa."
                    },
                    {
                        "en": "You've got your rivals running scared.",
                        "vi": "Bạn đã khiến các đối thủ của bạn sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be at or near a particular level",
                    "vi": "ở hoặc gần một cấp độ cụ thể"
                },
                "examples": [
                    {
                        "en": "Inflation was running at 26 per cent.",
                        "vi": "Lạm phát đang ở mức 26%."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue for a particular period of time without stopping",
                    "vi": "tiếp tục trong một khoảng thời gian cụ thể mà không dừng lại"
                },
                "examples": [
                    {
                        "en": "run for something Her last musical ran for six months on Broadway.",
                        "vi": "chạy cho một cái gì đó vở nhạc kịch cuối cùng của cô ấy đã diễn ra trong sáu tháng trên sân khấu Broadway."
                    },
                    {
                        "en": "run from A to B The course runs from June 25th to August 27th.",
                        "vi": "chạy từ A đến B Khóa học kéo dài từ ngày 25 tháng 6 đến ngày 27 tháng 8."
                    },
                    {
                        "en": "This debate will run and run!",
                        "vi": "Cuộc tranh luận này sẽ chạy và chạy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate or be legally acceptable for a particular period of time",
                    "vi": "để hoạt động hoặc được chấp nhận về mặt pháp lý trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "The permit runs for three months.",
                        "vi": "Giấy phép có hiệu lực trong ba tháng."
                    },
                    {
                        "en": "The lease on my house only has a year left to run.",
                        "vi": "Hợp đồng thuê nhà của tôi chỉ còn một năm nữa là hết hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen or progress at the time or in the way mentioned",
                    "vi": "xảy ra hoặc tiến triển tại thời điểm hoặc theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. Programmes are running a few minutes behind schedule this evening.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Everything is running according to plan.",
                        "vi": "Mọi thứ đang chạy theo đúng kế hoạch."
                    },
                    {
                        "en": "Her life had always run smoothly before.",
                        "vi": "Trước đây cuộc sống của cô luôn suôn sẻ."
                    },
                    {
                        "en": "The murderer was given three life sentences, to run concurrently.",
                        "vi": "Kẻ sát nhân bị tuyên ba bản án chung thân, để xử cùng một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a candidate in an election for a political position, especially in the US",
                    "vi": "trở thành một ứng cử viên trong một cuộc bầu cử cho một vị trí chính trị, đặc biệt là ở Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Obama ran a second time in 2012.",
                        "vi": "Obama tranh cử lần thứ hai vào năm 2012."
                    },
                    {
                        "en": "run for somebody/something Hilary Clinton ran for president in 2016.",
                        "vi": "tranh cử ai đó / điều gì đó Hilary Clinton tranh cử tổng thống vào năm 2016."
                    },
                    {
                        "en": "He ran unsuccessfully for the Senate in New York.",
                        "vi": "Ông đã tranh cử vào Thượng viện ở New York không thành công."
                    },
                    {
                        "en": "run in something She is planning to run in the parliamentary election.",
                        "vi": "chạy trong một cái gì đó Cô ấy đang có kế hoạch tranh cử trong cuộc bầu cử quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring or take something into a country illegally and secretly",
                    "vi": "mang hoặc mang một thứ gì đó vào một quốc gia bất hợp pháp và bí mật"
                },
                "examples": [
                    {
                        "en": "run something + adv./prep. He used to run guns across the border.",
                        "vi": "chạy cái gì đó + adv./prep. Anh đã từng cầm súng chạy qua biên giới."
                    },
                    {
                        "en": "She made money by running drugs.",
                        "vi": "Cô kiếm tiền bằng cách điều hành ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have particular words, contents, etc.",
                    "vi": "để có các từ, nội dung cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Their argument ran something like this…",
                        "vi": "Cuộc tranh cãi của họ diễn ra như thế này…"
                    },
                    {
                        "en": "+ speech ‘Ten shot dead by gunmen,’ ran the newspaper headline.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to print and publish an item or a story",
                    "vi": "để in và xuất bản một mục hoặc một câu chuyện"
                },
                "examples": [
                    {
                        "en": "On advice from their lawyers they decided not to run the story.",
                        "vi": "Theo lời khuyên từ luật sư của họ, họ quyết định không chạy câu chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do a test, an experiment, etc.",
                    "vi": "để làm một bài kiểm tra, một thử nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "run something on something The doctors decided to run some more tests on the blood samples.",
                        "vi": "chạy một cái gì đó trên một cái gì đó Các bác sĩ quyết định chạy thêm một số xét nghiệm trên các mẫu máu."
                    },
                    {
                        "en": "run something The two experiments are run in parallel.",
                        "vi": "chạy một cái gì đó Hai thử nghiệm được chạy song song."
                    },
                    {
                        "en": "The company is running clinical trials of the new drug.",
                        "vi": "Công ty đang chạy thử nghiệm lâm sàng loại thuốc mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "if tights or stockings run, a long thin hole appears in them",
                    "vi": "nếu quần tất hoặc tất dài chạy, một lỗ mỏng dài sẽ xuất hiện trên chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be pleased to do what somebody wants",
                    "vi": "được vui lòng làm những gì ai đó muốn"
                },
                "examples": [
                    {
                        "en": "She knew she had only to call and he would come running.",
                        "vi": "Cô biết cô chỉ cần gọi và anh sẽ chạy đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run in order to escape from somebody/something",
                    "vi": "chạy để thoát khỏi ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to treat somebody badly and not worry about their feelings",
                    "vi": "đối xử tệ với ai đó và không lo lắng về cảm xúc của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "working fully and correctly",
                    "vi": "hoạt động đầy đủ và chính xác"
                },
                "examples": [
                    {
                        "en": "It will be a lot easier when we have the database up and running.",
                        "vi": "Nó sẽ dễ dàng hơn rất nhiều khi chúng ta đã thiết lập và chạy cơ sở dữ liệu."
                    },
                    {
                        "en": "We soon had the sound system up and running.",
                        "vi": "Chúng tôi đã sớm lắp đặt và chạy hệ thống âm thanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6e65573a46e42e18d5b97b062c40625",
        "word": "running",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌnɪŋ/",
            "us": "/ˈrʌnɪŋ/"
        },
        "nearby": [
            {
                "word": "runner bean",
                "pos": "noun"
            },
            {
                "word": "runner-up",
                "pos": "noun"
            },
            {
                "word": "running",
                "pos": "noun"
            },
            {
                "word": "running",
                "pos": "adjective"
            },
            {
                "word": "running back",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action or sport of running",
                    "vi": "hành động hoặc môn thể thao chạy"
                },
                "examples": [
                    {
                        "en": "to go running",
                        "vi": "chạy"
                    },
                    {
                        "en": "long-distance/cross-country running",
                        "vi": "chạy đường dài / xuyên quốc gia"
                    },
                    {
                        "en": "running shoes",
                        "vi": "giày chạy bộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of managing or operating something",
                    "vi": "hoạt động quản lý hoặc điều hành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the day-to-day running of a business",
                        "vi": "hoạt động hàng ngày của một doanh nghiệp"
                    },
                    {
                        "en": "the running costs of a car (= for example of fuel, repairs, insurance)",
                        "vi": "chi phí vận hành của một chiếc ô tô (= ví dụ: nhiên liệu, sửa chữa, bảo hiểm)"
                    },
                    {
                        "en": "Mr Matengu was overseeing the smooth running of the exhibition.",
                        "vi": "Ông Matengu đang giám sát việc triển lãm diễn ra suôn sẻ."
                    },
                    {
                        "en": "She took over the running of the organization.",
                        "vi": "Cô tiếp quản việc điều hành tổ chức."
                    },
                    {
                        "en": "They are there to ensure the safe running of the event.",
                        "vi": "Họ ở đó để đảm bảo sự kiện diễn ra an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of bringing something such as drugs, guns, etc. into a country secretly and illegally",
                    "vi": "hoạt động mang một thứ gì đó như ma túy, súng, v.v. vào một quốc gia một cách bí mật và bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "drug-running",
                        "vi": "chạy ma túy"
                    }
                ]
            },
            {
                "define": {
                    "en": "having some/no chance of succeeding or achieving something",
                    "vi": "có một số / không có cơ hội thành công hoặc đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to set the speed at which something is done; to take the lead in doing something",
                    "vi": "để đặt tốc độ hoàn thành việc gì đó; đi đầu trong việc làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be1da4c76d794c54b027a3163f964616",
        "word": "rustle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌsl/",
            "us": "/ˈrʌsl/"
        },
        "nearby": [
            {
                "word": "rusticity",
                "pos": "noun"
            },
            {
                "word": "rustiness",
                "pos": "noun"
            },
            {
                "word": "rustle",
                "pos": "verb"
            },
            {
                "word": "rustle",
                "pos": "noun"
            },
            {
                "word": "rustler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something dry and light rustles or you rustle it, it makes a sound like paper, leaves, etc. moving or rubbing together",
                    "vi": "nếu một cái gì đó khô và nhẹ sột soạt hoặc bạn sột soạt nó, nó sẽ tạo ra âm thanh như tiếng giấy, lá cây, v.v. di chuyển hoặc cọ xát với nhau"
                },
                "examples": [
                    {
                        "en": "the sound of the trees rustling in the breeze",
                        "vi": "tiếng cây xào xạc trong gió"
                    },
                    {
                        "en": "Her silk dress rustled as she moved.",
                        "vi": "Chiếc váy lụa của cô ấy sột soạt khi cô ấy di chuyển."
                    },
                    {
                        "en": "rustle something The light wind rustled the leaves.",
                        "vi": "xào xạc cái gì Gió nhẹ xào xạc lá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal farm animals",
                    "vi": "ăn trộm động vật trang trại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34a43e2f21da462085e4929e15782998",
        "word": "scalp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/skælp/",
            "us": "/skælp/"
        },
        "nearby": [
            {
                "word": "scallywag",
                "pos": "noun"
            },
            {
                "word": "scalp",
                "pos": "noun"
            },
            {
                "word": "scalp",
                "pos": "verb"
            },
            {
                "word": "scalpel",
                "pos": "noun"
            },
            {
                "word": "scalper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove the skin and hair from the top of an enemy’s head as a sign of victory",
                    "vi": "lột da và tóc trên đỉnh đầu kẻ thù như một dấu hiệu chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to sell tickets for a popular event illegally, at a price that is higher than the official price, especially outside a theatre, stadium, etc.",
                    "vi": "Bán vé cho một sự kiện nổi tiếng một cách bất hợp pháp, với giá cao hơn giá chính thức, đặc biệt là bên ngoài nhà hát, sân vận động, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c5544c84a7145eebe0971c5fa07fc34",
        "word": "skim",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/skɪm/",
            "us": "/skɪm/"
        },
        "nearby": [
            {
                "word": "skillful",
                "pos": "adjective"
            },
            {
                "word": "skill set",
                "pos": "noun"
            },
            {
                "word": "skim",
                "pos": "verb"
            },
            {
                "word": "skimmed milk",
                "pos": "noun"
            },
            {
                "word": "skimobile",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove fat, cream, etc. from the surface of a liquid",
                    "vi": "để loại bỏ chất béo, kem, v.v. khỏi bề mặt của chất lỏng"
                },
                "examples": [
                    {
                        "en": "skim something off/from something Skim the scum off the jam and let it cool.",
                        "vi": "hớt bỏ một thứ gì đó / khỏi một thứ gì đó Hớt váng ra khỏi mứt và để nguội."
                    },
                    {
                        "en": "skim something Skim the jam and let it cool.",
                        "vi": "hớt cái gì đó Bỏ qua mứt và để nguội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move quickly and lightly over a surface, not touching it or only touching it occasionally; to make something do this",
                    "vi": "di chuyển nhanh và nhẹ trên bề mặt, không chạm vào bề mặt hoặc chỉ thỉnh thoảng chạm vào bề mặt; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "skim along/over, etc. something We watched the birds skimming over the lake.",
                        "vi": "lướt qua / lướt qua, v.v. Chúng tôi đã xem những con chim lướt trên hồ."
                    },
                    {
                        "en": "We skimmed across the water in a small sailing boat.",
                        "vi": "Chúng tôi lướt trên mặt nước trên một chiếc thuyền buồm nhỏ."
                    },
                    {
                        "en": "(figurative) His eyes skimmed over her face.",
                        "vi": "(nghĩa bóng) Đôi mắt anh lướt qua khuôn mặt cô."
                    },
                    {
                        "en": "skim something The speedboat took off, skimming the waves.",
                        "vi": "lướt qua cái gì đó Con tàu cao tốc cất cánh, lướt qua những con sóng."
                    },
                    {
                        "en": "(figurative) This report has barely skimmed the surface of the subject.",
                        "vi": "(nghĩa bóng) Báo cáo này hầu như không lướt qua bề mặt của chủ đề."
                    },
                    {
                        "en": "skim something across, over, etc. something (British English) Small boys were skimming stones across the water.",
                        "vi": "lướt qua thứ gì đó qua, qua, v.v. thứ gì đó (tiếng Anh Anh) Các cậu bé đang lướt những viên đá trên mặt nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to read something quickly in order to find a particular point or the main points",
                    "vi": "để đọc nhanh một cái gì đó nhằm tìm ra một điểm cụ thể hoặc những điểm chính"
                },
                "examples": [
                    {
                        "en": "skim through/over something He skimmed through the article trying to find his name.",
                        "vi": "lướt qua / lướt qua một cái gì đó Anh ta lướt qua bài báo cố gắng tìm tên của mình."
                    },
                    {
                        "en": "skim something I always skim the financial section of the newspaper.",
                        "vi": "đọc lướt một cái gì đó Tôi luôn đọc lướt phần tài chính của tờ báo."
                    },
                    {
                        "en": "I skimmed the list until I found my name.",
                        "vi": "Tôi lướt qua danh sách cho đến khi tôi tìm thấy tên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal small amounts of money frequently over a period of time",
                    "vi": "thường xuyên ăn cắp số tiền nhỏ trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "She’d been skimming money from the store’s accounts for years.",
                        "vi": "Cô ấy đã tiêu tiền từ tài khoản của cửa hàng trong nhiều năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to illegally copy electronic information from a credit card in order to use it without the owner’s permission",
                    "vi": "sao chép bất hợp pháp thông tin điện tử từ thẻ tín dụng để sử dụng mà không được phép của chủ sở hữu"
                },
                "examples": [
                    {
                        "en": "It is estimated that skimming now accounts for almost 50% of credit card fraud.",
                        "vi": "Người ta ước tính rằng việc đọc lướt hiện nay chiếm gần 50% các vụ gian lận thẻ tín dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "18677e5aed824290bbb43c273a5b2981",
        "word": "slander",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɑːndə(r)/",
            "us": "/ˈslændər/"
        },
        "nearby": [
            {
                "word": "slammer",
                "pos": "noun"
            },
            {
                "word": "slander",
                "pos": "noun"
            },
            {
                "word": "slander",
                "pos": "verb"
            },
            {
                "word": "slanderous",
                "pos": "adjective"
            },
            {
                "word": "slang",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a false spoken statement about somebody that is intended to damage the good opinion that people have of them",
                    "vi": "đưa ra một tuyên bố sai sự thật về một người nào đó nhằm làm tổn hại đến quan điểm tốt mà mọi người có về họ"
                },
                "examples": [
                    {
                        "en": "He angrily accused the investigators of slandering both him and his family.",
                        "vi": "Anh tức giận buộc tội các nhà điều tra đã vu khống cả anh và gia đình anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "2678ca647e3b4113a0a58285c19fd7b3",
        "word": "slanderous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɑːndərəs/",
            "us": "/ˈslændərəs/"
        },
        "nearby": [
            {
                "word": "slander",
                "pos": "noun"
            },
            {
                "word": "slander",
                "pos": "verb"
            },
            {
                "word": "slanderous",
                "pos": "adjective"
            },
            {
                "word": "slang",
                "pos": "noun"
            },
            {
                "word": "slanging match",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "false, and intended to damage the good opinion people have of somebody",
                    "vi": "sai, và có ý định làm hỏng ý kiến tốt mà mọi người có về ai đó"
                },
                "examples": [
                    {
                        "en": "a slanderous remark",
                        "vi": "một nhận xét vu khống"
                    }
                ]
            }
        ]
    },
    {
        "id": "46d78d3415e2422a88415bc38d8ed82f",
        "word": "stalk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/stɔːk/",
            "us": "/stɔːk/"
        },
        "nearby": [
            {
                "word": "Stalinist",
                "pos": "noun"
            },
            {
                "word": "stalk",
                "pos": "noun"
            },
            {
                "word": "stalk",
                "pos": "verb"
            },
            {
                "word": "stalker",
                "pos": "noun"
            },
            {
                "word": "stalking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move slowly and quietly towards an animal or a person, in order to kill, catch or harm it or them",
                    "vi": "di chuyển chậm và lặng lẽ về phía một con vật hoặc một con người, để giết, bắt hoặc làm hại nó hoặc chúng"
                },
                "examples": [
                    {
                        "en": "The lion was stalking a zebra.",
                        "vi": "Con sư tử đang rình rập một con ngựa vằn."
                    },
                    {
                        "en": "He stalked his victim as she walked home, before attacking and robbing her.",
                        "vi": "Anh ta rình rập nạn nhân của mình khi cô đi bộ về nhà, trước khi tấn công và cướp đi sinh mạng của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to illegally follow and watch somebody over a long period of time, in a way that is annoying or frightening",
                    "vi": "theo dõi bất hợp pháp và theo dõi ai đó trong một thời gian dài, theo cách gây khó chịu hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "She claimed that he had been stalking her over a period of three years.",
                        "vi": "Cô tuyên bố rằng anh ta đã theo dõi cô trong khoảng thời gian ba năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to walk in an angry or proud way",
                    "vi": "bước đi một cách giận dữ hoặc tự hào"
                },
                "examples": [
                    {
                        "en": "He stalked off without a word.",
                        "vi": "Anh ta lững thững bỏ đi không nói một lời."
                    },
                    {
                        "en": "The actress stalked out of a press conference when asked if she had a weight problem.",
                        "vi": "Nữ diễn viên lém lỉnh rời khỏi một buổi họp báo khi được hỏi liệu cô có gặp vấn đề về cân nặng hay không."
                    },
                    {
                        "en": "Snatching up her bag, she stalked out of the room.",
                        "vi": "Giật lấy túi xách, cô lững thững bước ra khỏi phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move through a place in an unpleasant or threatening way",
                    "vi": "để di chuyển qua một nơi theo cách khó chịu hoặc đe dọa"
                },
                "examples": [
                    {
                        "en": "The gunmen stalked the building, looking for victims.",
                        "vi": "Các tay súng rình rập tòa nhà, tìm kiếm nạn nhân."
                    },
                    {
                        "en": "(figurative) Fear stalks the streets of the city at night.",
                        "vi": "(nghĩa bóng) Nỗi sợ hãi rình rập đường phố vào ban đêm."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce772205fa694f2ebccd82abc1c964ef",
        "word": "swindle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈswɪndl/",
            "us": "/ˈswɪndl/"
        },
        "nearby": [
            {
                "word": "swimwear",
                "pos": "noun"
            },
            {
                "word": "Algernon Swinburne",
                "pos": ""
            },
            {
                "word": "swindle",
                "pos": "verb"
            },
            {
                "word": "swindle",
                "pos": "noun"
            },
            {
                "word": "swindler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cheat somebody in order to get something, especially money, from them",
                    "vi": "lừa ai đó để lấy thứ gì đó, đặc biệt là tiền, từ họ"
                },
                "examples": [
                    {
                        "en": "swindle somebody (out of something) They swindled him out of hundreds of dollars.",
                        "vi": "lừa ai đó (vì điều gì đó) Họ đã lừa anh ta hàng trăm đô la."
                    },
                    {
                        "en": "swindle something (out of somebody) They swindled hundreds of dollars out of him.",
                        "vi": "lừa một cái gì đó (từ ai đó) Họ đã lừa hàng trăm đô la từ anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec382d48a499493e9fe9d25750beab21",
        "word": "swipe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/swaɪp/",
            "us": "/swaɪp/"
        },
        "nearby": [
            {
                "word": "swing voter",
                "pos": "noun"
            },
            {
                "word": "swing-wing",
                "pos": "adjective"
            },
            {
                "word": "swipe",
                "pos": "verb"
            },
            {
                "word": "swipe",
                "pos": "noun"
            },
            {
                "word": "swipe card",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit or try to hit somebody/something with your hand or an object by moving your arm with a wide, curved movement",
                    "vi": "để đánh hoặc cố gắng đánh ai đó / cái gì đó bằng tay của bạn hoặc một vật bằng cách di chuyển cánh tay của bạn với một chuyển động cong và rộng"
                },
                "examples": [
                    {
                        "en": "He swiped at the ball and missed.",
                        "vi": "Anh ta vuốt bóng và trượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something",
                    "vi": "ăn cắp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They’re always swiping other kids’ sweets.",
                        "vi": "Họ luôn quẹt kẹo của những đứa trẻ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass a plastic card, such as a credit card, through a special machine that is able to read the information that is stored on it",
                    "vi": "để chuyển thẻ nhựa, chẳng hạn như thẻ tín dụng, thông qua một máy đặc biệt có thể đọc thông tin được lưu trữ trên đó"
                },
                "examples": [
                    {
                        "en": "The cash register only opens once the card has been swiped.",
                        "vi": "Máy tính tiền chỉ mở khi thẻ đã được quẹt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move your finger quickly across the screen of an electronic device such as a mobile phone or small computer in order to move text, pictures, etc. or give commands",
                    "vi": "để di chuyển nhanh ngón tay của bạn trên màn hình của thiết bị điện tử như điện thoại di động hoặc máy tính nhỏ để di chuyển văn bản, hình ảnh, v.v. hoặc đưa ra lệnh"
                },
                "examples": [
                    {
                        "en": "Switch on the phone and swipe your finger across the screen to unlock it.",
                        "vi": "Bật điện thoại và vuốt ngón tay của bạn trên màn hình để mở khóa."
                    }
                ]
            }
        ]
    },
    {
        "id": "853c19062d2d4bd68450e3a275547022",
        "word": "tout",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/taʊt/",
            "us": "/taʊt/"
        },
        "nearby": [
            {
                "word": "tousle",
                "pos": "verb"
            },
            {
                "word": "tousled",
                "pos": "adjective"
            },
            {
                "word": "tout",
                "pos": "verb"
            },
            {
                "word": "tout",
                "pos": "noun"
            },
            {
                "word": "tout court",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to persuade people that somebody/something is important or valuable by praising them/it",
                    "vi": "cố gắng thuyết phục mọi người rằng ai đó / điều gì đó quan trọng hoặc có giá trị bằng cách khen ngợi họ / điều đó"
                },
                "examples": [
                    {
                        "en": "be touted (as something) She's being touted as the next leader of the party.",
                        "vi": "được chào mời (như một cái gì đó) Cô ấy đang được chào mời là lãnh đạo tiếp theo của bữa tiệc."
                    },
                    {
                        "en": "Their much-touted expansion plans have come to nothing.",
                        "vi": "Các kế hoạch mở rộng được mời chào nhiều của họ đã không đi đến đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to persuade people to buy your goods or services, especially by going to them and asking them directly",
                    "vi": "để cố gắng thuyết phục mọi người mua hàng hóa hoặc dịch vụ của bạn, đặc biệt bằng cách đến gặp họ và hỏi họ trực tiếp"
                },
                "examples": [
                    {
                        "en": "tout (for something) the problem of unlicensed taxi drivers touting for business at airports",
                        "vi": "tout (vì điều gì đó) về vấn đề tài xế taxi không có giấy phép chào hàng để kinh doanh tại sân bay"
                    },
                    {
                        "en": "tout something He's busy touting his client's latest book around London publishers.",
                        "vi": "chào hàng điều gì đó Anh ấy đang bận chào hàng cuốn sách mới nhất của khách hàng của mình quanh các nhà xuất bản ở Luân Đôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sell tickets for a popular event illegally, at a price that is higher than the official price, especially outside a theatre, stadium, etc.",
                    "vi": "Bán vé cho một sự kiện nổi tiếng một cách bất hợp pháp, với giá cao hơn giá chính thức, đặc biệt là bên ngoài nhà hát, sân vận động, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a35889b735fe4393b43cf26afe01ed79",
        "word": "trespass",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrespəs/",
            "us": "/ˈtrespæs/"
        },
        "nearby": [
            {
                "word": "trepan",
                "pos": "verb"
            },
            {
                "word": "trepidation",
                "pos": "noun"
            },
            {
                "word": "trespass",
                "pos": "verb"
            },
            {
                "word": "trespass",
                "pos": "noun"
            },
            {
                "word": "trespasser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to enter land or a building that you do not have permission or the right to enter",
                    "vi": "vào đất hoặc tòa nhà mà bạn không được phép hoặc không có quyền vào"
                },
                "examples": [
                    {
                        "en": "He told me I was trespassing on private land.",
                        "vi": "Anh ta nói với tôi rằng tôi đã xâm phạm đất tư nhân."
                    },
                    {
                        "en": "The sign on the fence said ‘No trespassing’.",
                        "vi": "Biển báo trên hàng rào ghi 'Không xâm phạm'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something wrong",
                    "vi": "làm sai điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d4bf6f0d55db456bba8cd4453d0d20a2",
        "word": "underground",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌndəˈɡraʊnd/",
            "us": "/ˌʌndərˈɡraʊnd/"
        },
        "nearby": [
            {
                "word": "undergo",
                "pos": "verb"
            },
            {
                "word": "undergraduate",
                "pos": "noun"
            },
            {
                "word": "underground",
                "pos": "adjective"
            },
            {
                "word": "underground",
                "pos": "adverb"
            },
            {
                "word": "underground",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "under the surface of the ground",
                    "vi": "dưới bề mặt của mặt đất"
                },
                "examples": [
                    {
                        "en": "an underground bunker/tunnel",
                        "vi": "một boongke / đường hầm dưới lòng đất"
                    },
                    {
                        "en": "underground parking",
                        "vi": "bãi đậu xe ngầm"
                    },
                    {
                        "en": "an underground car park",
                        "vi": "một bãi đậu xe ngầm"
                    },
                    {
                        "en": "underground passages/caves/streams",
                        "vi": "lối đi / hang động / suối ngầm"
                    },
                    {
                        "en": "underground cables",
                        "vi": "cáp ngầm"
                    },
                    {
                        "en": "They carried out a series of underground nuclear tests.",
                        "vi": "Họ đã thực hiện hàng loạt vụ thử hạt nhân dưới lòng đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "operating secretly and often illegally, especially against a government",
                    "vi": "hoạt động bí mật và thường bất hợp pháp, đặc biệt là chống lại chính phủ"
                },
                "examples": [
                    {
                        "en": "an underground resistance movement",
                        "vi": "một phong trào phản kháng ngầm"
                    },
                    {
                        "en": "The changes will affect all workers, whether underground or legal.",
                        "vi": "Những thay đổi sẽ ảnh hưởng đến tất cả người lao động, dù là hoạt động ngầm hay hợp pháp."
                    },
                    {
                        "en": "The party was originally formed as an underground organization in 1987.",
                        "vi": "Ban đầu đảng được thành lập như một tổ chức ngầm vào năm 1987."
                    }
                ]
            }
        ]
    },
    {
        "id": "b901bbcbb8a14a2b8339e9017750b36b",
        "word": "under the counter",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊntə(r)/",
            "us": "/ˈkaʊntər/"
        },
        "nearby": [
            {
                "word": "countenance",
                "pos": "verb"
            },
            {
                "word": "counter-attack",
                "pos": "verb"
            },
            {
                "word": "counter",
                "pos": "noun"
            },
            {
                "word": "counter",
                "pos": "verb"
            },
            {
                "word": "counter",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long flat surface over which goods are sold or business is done in a shop, bank, etc.",
                    "vi": "một bề mặt phẳng dài, trên đó hàng hóa được bán hoặc kinh doanh được thực hiện trong một cửa hàng, ngân hàng, v.v."
                },
                "examples": [
                    {
                        "en": "behind the counter I asked the woman behind the counter if they had any postcards.",
                        "vi": "phía sau quầy, tôi hỏi người phụ nữ đứng sau quầy xem họ có tấm bưu thiếp nào không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat surface in a kitchen for preparing food on",
                    "vi": "một bề mặt phẳng trong nhà bếp để chuẩn bị thức ăn"
                },
                "examples": [
                    {
                        "en": "She put her bags down on the kitchen counter.",
                        "vi": "Cô đặt túi xách của mình xuống quầy bếp."
                    },
                    {
                        "en": "The kitchen had black marble counter tops.",
                        "vi": "Nhà bếp có mặt bàn bằng đá cẩm thạch đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small disc used for playing or scoring in some board games",
                    "vi": "một đĩa nhỏ được sử dụng để chơi hoặc ghi điểm trong một số trò chơi trên bàn cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an electronic device for counting something",
                    "vi": "một thiết bị điện tử để đếm thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The needle on the rev counter soared.",
                        "vi": "Kim trên đồng hồ đo vòng tua máy tăng vọt."
                    },
                    {
                        "en": "You need to reset the counter.",
                        "vi": "Bạn cần đặt lại bộ đếm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who counts something, for example votes in an election",
                    "vi": "một người đếm cái gì đó, ví dụ như bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "You can get computers to help the counters to count the votes.",
                        "vi": "Bạn có thể nhờ máy tính để giúp quầy kiểm phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a response to somebody/something that opposes their ideas, position, etc.",
                    "vi": "phản hồi với ai đó / điều gì đó phản đối ý tưởng, vị trí của họ, v.v."
                },
                "examples": [
                    {
                        "en": "The employers' association was seen as a counter to union power.",
                        "vi": "Hiệp hội người sử dụng lao động được coi là một đối trọng với quyền lực của công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "goods, especially medicines, for sale over the counter can be bought without a prescription (= written permission from a doctor to buy a medicine) or special licence",
                    "vi": "hàng hóa, đặc biệt là thuốc, bán không cần đơn có thể được mua mà không cần đơn (= văn bản cho phép mua thuốc của bác sĩ) hoặc giấy phép đặc biệt"
                },
                "examples": [
                    {
                        "en": "These tablets are available over the counter.",
                        "vi": "Những máy tính bảng này có sẵn trên quầy."
                    },
                    {
                        "en": "This kind of medication cannot be bought over the counter.",
                        "vi": "Loại thuốc này không thể được mua qua quầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "goods that are bought or sold under the counter are sold secretly and sometimes illegally",
                    "vi": "hàng hóa được mua hoặc bán dưới quầy được bán một cách bí mật và đôi khi bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Pornography may be legally banned but it is still available under the counter.",
                        "vi": "Nội dung khiêu dâm có thể bị cấm hợp pháp nhưng nó vẫn có sẵn dưới quầy."
                    }
                ]
            }
        ]
    },
    {
        "id": "347f93501fe040879f77eb90e1a6de81",
        "word": "under-the-counter",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌndə ðə ˈkaʊntə(r)/",
            "us": "/ˌʌndər ðə ˈkaʊntər/"
        },
        "nearby": [
            {
                "word": "undertaker",
                "pos": "noun"
            },
            {
                "word": "undertaking",
                "pos": "noun"
            },
            {
                "word": "under-the-counter",
                "pos": "adjective"
            },
            {
                "word": "undertone",
                "pos": "noun"
            },
            {
                "word": "undertook",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "bought or made secretly and sometimes illegally",
                    "vi": "được mua hoặc thực hiện bí mật và đôi khi bất hợp pháp"
                },
                "examples": []
            }
        ]
    }
]