[
    {
        "id": "993cc811d5af41a2baf44f2e257849af",
        "word": "market",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmɑːkɪt/",
            "us": "/ˈmɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "markedly",
                "pos": "adverb"
            },
            {
                "word": "marker",
                "pos": "noun"
            },
            {
                "word": "market",
                "pos": "noun"
            },
            {
                "word": "market",
                "pos": "verb"
            },
            {
                "word": "marketability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people buy and sell goods; the open area or building where they meet to do this",
                    "vi": "một dịp mà mọi người mua và bán hàng hóa; khu vực mở hoặc tòa nhà nơi họ gặp nhau để làm điều này"
                },
                "examples": [
                    {
                        "en": "a fruit/flower/fish market",
                        "vi": "chợ trái cây / hoa / cá"
                    },
                    {
                        "en": "an antiques market",
                        "vi": "chợ đồ cổ"
                    },
                    {
                        "en": "an indoor/a street market",
                        "vi": "chợ trong nhà / chợ đường phố"
                    },
                    {
                        "en": "market stalls/traders",
                        "vi": "quầy hàng / thương nhân trong chợ"
                    },
                    {
                        "en": "at the market We buy our fruit and vegetables at the market.",
                        "vi": "ở chợ Chúng tôi mua trái cây và rau của chúng tôi ở chợ."
                    },
                    {
                        "en": "Thursday is market day.",
                        "vi": "Thứ năm là ngày họp chợ."
                    }
                ]
            },
            {
                "define": {
                    "en": "business or trade, or the amount of trade in a particular type of goods",
                    "vi": "kinh doanh hoặc buôn bán, hoặc số lượng buôn bán một loại hàng hóa cụ thể"
                },
                "examples": [
                    {
                        "en": "the world market in coffee",
                        "vi": "thị trường cà phê thế giới"
                    },
                    {
                        "en": "They have increased their share of the market by 10 per cent.",
                        "vi": "Họ đã tăng thị phần của mình lên 10%."
                    },
                    {
                        "en": "The firm will expand its size to claim more market share.",
                        "vi": "Công ty sẽ mở rộng quy mô để giành thêm thị phần."
                    },
                    {
                        "en": "the property/housing/job market (= the number and type of houses, jobs, etc. that are available)",
                        "vi": "thị trường bất động sản / nhà ở / việc làm (= số lượng và loại nhà, công việc, v.v. có sẵn)"
                    },
                    {
                        "en": "They have cornered the market in sportswear (= sell the most).",
                        "vi": "Họ đã lũng đoạn thị trường quần áo thể thao (= bán được nhiều nhất)."
                    },
                    {
                        "en": "New companies have entered the market.",
                        "vi": "Các công ty mới đã tham gia vào thị trường."
                    },
                    {
                        "en": "The big players still dominate the market.",
                        "vi": "Các công ty lớn vẫn chiếm ưu thế trên thị trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area, country or section of the population that might buy goods",
                    "vi": "một khu vực, quốc gia hoặc bộ phận dân cư cụ thể có thể mua hàng hóa"
                },
                "examples": [
                    {
                        "en": "The Chinese market has opened up recently.",
                        "vi": "Thị trường Trung Quốc đã mở cửa gần đây."
                    },
                    {
                        "en": "Expansion into the global market brings more risk.",
                        "vi": "Mở rộng ra thị trường toàn cầu mang lại nhiều rủi ro hơn."
                    },
                    {
                        "en": "They supply beef to the domestic market.",
                        "vi": "Họ cung cấp thịt bò cho thị trường nội địa."
                    },
                    {
                        "en": "The young, health-conscious female consumer is our target market.",
                        "vi": "Khách hàng nữ trẻ tuổi, quan tâm đến sức khỏe là thị trường mục tiêu của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of people who want to buy something",
                    "vi": "số lượng người muốn mua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a growing/declining market for second-hand cars",
                        "vi": "thị trường ô tô cũ đang phát triển / suy giảm"
                    },
                    {
                        "en": "There's not much of a market for tourist art on the island.",
                        "vi": "Không có nhiều thị trường cho nghệ thuật du lịch trên đảo."
                    },
                    {
                        "en": "New Zealand is competing in an international market for medical graduates.",
                        "vi": "New Zealand đang cạnh tranh trên thị trường quốc tế dành cho sinh viên tốt nghiệp y khoa."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who buy and sell goods in competition with each other",
                    "vi": "những người mua và bán hàng hóa cạnh tranh với nhau"
                },
                "examples": [
                    {
                        "en": "The market will decide if the TV station has any future.",
                        "vi": "Thị trường sẽ quyết định xem đài truyền hình có tương lai hay không."
                    },
                    {
                        "en": "a market-based/market-led/market-driven economy",
                        "vi": "một nền kinh tế dựa trên thị trường / dẫn dắt thị trường / định hướng thị trường"
                    },
                    {
                        "en": "innovative products at the forefront of market trends",
                        "vi": "sản phẩm sáng tạo đi đầu xu hướng thị trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the business of buying and selling shares in companies and the place where this happens; a stock exchange",
                    "vi": "việc kinh doanh mua và bán cổ phần trong các công ty và nơi xảy ra việc này; một sàn giao dịch chứng khoán"
                },
                "examples": [
                    {
                        "en": "the futures market",
                        "vi": "thị trường tương lai"
                    },
                    {
                        "en": "a market crash",
                        "vi": "một sự sụp đổ của thị trường"
                    },
                    {
                        "en": "The market closed weaker.",
                        "vi": "Thị trường đóng cửa yếu hơn."
                    },
                    {
                        "en": "The markets reacted quickly to the negative publicity.",
                        "vi": "Các thị trường đã phản ứng nhanh chóng với những dư luận tiêu cực."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which there is a lot of a particular item for sale, so that prices are low and people buying have a choice",
                    "vi": "một tình huống trong đó có rất nhiều một mặt hàng cụ thể để bán, do đó giá thấp và người mua có quyền lựa chọn"
                },
                "examples": [
                    {
                        "en": "In a buyer's market, the commodity is plentiful and so its price is not high.",
                        "vi": "Trong thị trường của người mua, hàng hóa rất phong phú và do đó giá của nó không cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "interested in buying something",
                    "vi": "quan tâm đến việc mua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm not in the market for a new car at the moment.",
                        "vi": "Tôi không muốn mua xe mới vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "available for people to buy",
                    "vi": "có sẵn để mọi người mua"
                },
                "examples": [
                    {
                        "en": "to put your house on the market",
                        "vi": "đưa ngôi nhà của bạn ra thị trường"
                    },
                    {
                        "en": "The house came on the market last year.",
                        "vi": "Ngôi nhà được tung ra thị trường vào năm ngoái."
                    },
                    {
                        "en": "There are hundreds of different brands on the market.",
                        "vi": "Trên thị trường có hàng trăm nhãn hiệu khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "available to buy without any limits",
                    "vi": "có sẵn để mua mà không có bất kỳ giới hạn nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to buy and sell stocks and shares in order to make a profit",
                    "vi": "mua và bán cổ phiếu và cổ phiếu để kiếm lợi nhuận"
                },
                "examples": [
                    {
                        "en": "He is a skilled investor who knows how to play the market—and win.",
                        "vi": "Anh ấy là một nhà đầu tư lành nghề, người biết cách chơi thị trường và giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to charge such a high price for your goods, services, etc. that nobody wants to buy them",
                    "vi": "tính giá hàng hóa, dịch vụ của bạn, v.v. cao đến mức không ai muốn mua chúng"
                },
                "examples": [
                    {
                        "en": "Some leading UK firms are pricing themselves out of the market.",
                        "vi": "Một số công ty hàng đầu của Vương quốc Anh đang định giá mình ngoài thị trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people selling something have an advantage, because there is not a lot of a particular item for sale, and prices can be kept high",
                    "vi": "tình huống trong đó những người bán thứ gì đó có lợi thế hơn, vì không có nhiều mặt hàng cụ thể để bán và giá có thể được giữ ở mức cao"
                },
                "examples": [
                    {
                        "en": "In a seller’s market, demand exceeds supply, and prices are high.",
                        "vi": "Trong thị trường của người bán, cầu vượt quá cung và giá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop something from being sold",
                    "vi": "để ngăn một cái gì đó được bán"
                },
                "examples": [
                    {
                        "en": "The slimming pills were taken off the market.",
                        "vi": "Thuốc giảm béo đã được bán trên thị trường."
                    },
                    {
                        "en": "Thousands of egg products were taken off the shelves following the health scare.",
                        "vi": "Hàng nghìn sản phẩm trứng đã được đưa ra khỏi kệ hàng sau sự lo ngại về sức khỏe."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a84e26d408849ffbfa985b5e907fff9",
        "word": "shop",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ʃɒp/",
            "us": "/ʃɑːp/"
        },
        "nearby": [
            {
                "word": "shoot through",
                "pos": "phrasal verb"
            },
            {
                "word": "shoot up",
                "pos": "phrasal verb"
            },
            {
                "word": "shop",
                "pos": "noun"
            },
            {
                "word": "shop",
                "pos": "verb"
            },
            {
                "word": "shopaholic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or part of a building where you can buy goods or services",
                    "vi": "một tòa nhà hoặc một phần của tòa nhà nơi bạn có thể mua hàng hóa hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "to open/close/run a shop",
                        "vi": "để mở / đóng / điều hành một cửa hàng"
                    },
                    {
                        "en": "There's a good selection of local shops.",
                        "vi": "Có rất nhiều cửa hàng địa phương."
                    },
                    {
                        "en": "a record/pet shop",
                        "vi": "một cửa hàng vật nuôi / hồ sơ"
                    },
                    {
                        "en": "a shoe shop",
                        "vi": "một cửa hàng giày"
                    },
                    {
                        "en": "(British English) a butcher’s shop",
                        "vi": "(Tiếng Anh Anh) một cửa hàng thịt"
                    },
                    {
                        "en": "(North American English) a butcher shop",
                        "vi": "(Tiếng Anh Bắc Mỹ) một cửa hàng thịt"
                    },
                    {
                        "en": "(British English) I'm just going to the shops. Can I get you anything?",
                        "vi": "(Anh Anh) Tôi chỉ đi đến các cửa hàng. Tôi có thể lấy gì cho bạn?"
                    },
                    {
                        "en": "in a shop She works in a shop in the town centre.",
                        "vi": "trong một cửa hàng Cô ấy làm việc trong một cửa hàng ở trung tâm thị trấn."
                    },
                    {
                        "en": "He was alone in the shop when the robber came in.",
                        "vi": "Anh ta đang ở một mình trong cửa hàng khi tên cướp bước vào."
                    },
                    {
                        "en": "shop owners in the area",
                        "vi": "chủ cửa hàng trong khu vực"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where things are made or repaired, especially part of a factory where a particular type of work is done",
                    "vi": "nơi sản xuất hoặc sửa chữa mọi thứ, đặc biệt là một phần của nhà máy, nơi thực hiện một loại công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "a repair shop",
                        "vi": "một cửa hàng sửa chữa"
                    },
                    {
                        "en": "a paint shop (= where cars or other items are painted)",
                        "vi": "một cửa hàng sơn (= nơi sơn ô tô hoặc các vật dụng khác)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of going shopping, especially for food and other items needed in the house",
                    "vi": "một hành động đi mua sắm, đặc biệt là đối với thực phẩm và các vật dụng khác cần thiết trong nhà"
                },
                "examples": [
                    {
                        "en": "I do a weekly shop at the supermarket.",
                        "vi": "Tôi mua sắm hàng tuần ở siêu thị."
                    }
                ]
            },
            {
                "define": {
                    "en": "a school subject in which students learn to make things from wood and metal using tools and machines",
                    "vi": "một chủ đề học đường trong đó học sinh học làm mọi thứ từ gỗ và kim loại bằng cách sử dụng các công cụ và máy móc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a room in a house where tools are kept for making repairs to the house, building things out of wood, etc.",
                    "vi": "một căn phòng trong một ngôi nhà, nơi cất giữ các công cụ để sửa chữa nhà, đóng các vật dụng bằng gỗ, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everywhere",
                    "vi": "mọi nơi"
                },
                "examples": [
                    {
                        "en": "New restaurants are appearing all over the shop.",
                        "vi": "Các nhà hàng mới đang xuất hiện khắp quán."
                    }
                ]
            },
            {
                "define": {
                    "en": "not neat or tidy; not well organized",
                    "vi": "không gọn gàng, ngăn nắp; không được tổ chức tốt"
                },
                "examples": [
                    {
                        "en": "Your calculations are all over the shop (= completely wrong).",
                        "vi": "Tính toán của bạn là hết shop (= sai hoàn toàn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is careless, or who moves or acts in a rough way, in a place or situation where skill and care are needed",
                    "vi": "một người bất cẩn, di chuyển hoặc hành động thô bạo, ở một nơi hoặc tình huống cần kỹ năng và sự cẩn thận"
                },
                "examples": [
                    {
                        "en": "You’re not going to go storming in there like a bull in a china shop, are you?",
                        "vi": "Bạn sẽ không xông vào đó như một con bò đực trong cửa hàng đồ sứ, phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop trading",
                    "vi": "ngừng giao dịch"
                },
                "examples": [
                    {
                        "en": "The factory closed its doors for the last time in 2009.",
                        "vi": "Nhà máy đóng cửa lần cuối vào năm 2009."
                    },
                    {
                        "en": "The company closed shop and left the US last year.",
                        "vi": "Công ty đã đóng cửa hàng và rời Mỹ vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of something for a short time while somebody is away",
                    "vi": "phụ trách một việc gì đó trong một thời gian ngắn khi ai đó đi vắng"
                },
                "examples": [
                    {
                        "en": "Who's minding the shop while the boss is abroad?",
                        "vi": "Ai đang trông coi cửa hàng trong khi ông chủ đang ở nước ngoài?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to start a business",
                    "vi": "bắt đầu kinh doanh"
                },
                "examples": [
                    {
                        "en": "an area where many artists have set up shop",
                        "vi": "một khu vực mà nhiều nghệ sĩ đã thiết lập cửa hàng"
                    },
                    {
                        "en": "Some buskers had set up shop outside the station.",
                        "vi": "Một số người hát rong đã dựng cửa hàng bên ngoài nhà ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "to close a business permanently or to stop working for the day",
                    "vi": "đóng cửa một doanh nghiệp vĩnh viễn hoặc ngừng hoạt động trong ngày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk about your work with the people you work with, especially when you are also with other people who are not connected with or interested in it",
                    "vi": "để nói về công việc của bạn với những người bạn làm việc cùng, đặc biệt là khi bạn cũng ở với những người khác không có liên hệ hoặc không quan tâm đến nó"
                },
                "examples": [
                    {
                        "en": "Whenever we meet up with Clive and Sue they always end up talking shop.",
                        "vi": "Bất cứ khi nào chúng tôi gặp Clive và Sue, họ luôn nói chuyện với nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "f45eafe465954b6c856595cd6c860bd8",
        "word": "supermarket",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsuːpəmɑːkɪt/",
            "us": "/ˈsuːpərmɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "superman",
                "pos": "noun"
            },
            {
                "word": "Superman",
                "pos": ""
            },
            {
                "word": "supermarket",
                "pos": "noun"
            },
            {
                "word": "supermax",
                "pos": "noun"
            },
            {
                "word": "supermodel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large shop that sells food, drinks and goods used in the home. People choose what they want from the shelves and pay for it as they leave.",
                    "vi": "một cửa hàng lớn bán đồ ăn, thức uống và đồ dùng trong nhà. Mọi người chọn những gì họ muốn từ các kệ và trả tiền cho nó khi họ rời đi."
                },
                "examples": [
                    {
                        "en": "I only shop at this supermarket.",
                        "vi": "Tôi chỉ mua sắm tại siêu thị này."
                    },
                    {
                        "en": "It is the fifth largest supermarket chain in the UK.",
                        "vi": "Đây là chuỗi siêu thị lớn thứ năm ở Anh."
                    },
                    {
                        "en": "An increasing amount of organic produce is to be found on supermarket shelves.",
                        "vi": "Ngày càng có nhiều sản phẩm hữu cơ được bày bán trên các kệ hàng siêu thị."
                    },
                    {
                        "en": "a supermarket checkout/aisle",
                        "vi": "thanh toán / lối đi trong siêu thị"
                    },
                    {
                        "en": "(British English) a supermarket trolley",
                        "vi": "(Tiếng Anh Anh) một chiếc xe đẩy siêu thị"
                    }
                ]
            }
        ]
    },
    {
        "id": "def92fa9aed8475db22e037f25600a71",
        "word": "bookshop",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbʊkʃɒp/",
            "us": "/ˈbʊkʃɑːp/"
        },
        "nearby": [
            {
                "word": "bookseller",
                "pos": "noun"
            },
            {
                "word": "bookshelf",
                "pos": "noun"
            },
            {
                "word": "bookshop",
                "pos": "noun"
            },
            {
                "word": "book-smart",
                "pos": "adjective"
            },
            {
                "word": "bookstall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells books",
                    "vi": "một cửa hàng bán sách"
                },
                "examples": [
                    {
                        "en": "I asked the bookshop to order several titles which were not in stock.",
                        "vi": "Tôi đã yêu cầu cửa hàng sách đặt một số đầu sách không có trong kho."
                    },
                    {
                        "en": "The new edition is on sale now at any good bookshop.",
                        "vi": "Ấn bản mới hiện đang được bán tại bất kỳ hiệu sách tốt nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "41d0890313694846b5c94ebd4741bf3d",
        "word": "chemist",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkemɪst/",
            "us": "/ˈkemɪst/"
        },
        "nearby": [
            {
                "word": "chemin de fer",
                "pos": "noun"
            },
            {
                "word": "chemise",
                "pos": "noun"
            },
            {
                "word": "chemist",
                "pos": "noun"
            },
            {
                "word": "chemistry",
                "pos": "noun"
            },
            {
                "word": "chemistry set",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to prepare and sell medicines, and who works in a shop",
                    "vi": "một người có công việc là pha chế và bán thuốc, và người làm việc trong một cửa hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells medicines and usually also soap, make-up, etc.",
                    "vi": "cửa hàng bán thuốc và thường có cả xà phòng, đồ trang điểm, v.v."
                },
                "examples": [
                    {
                        "en": "You can obtain the product from all good chemists.",
                        "vi": "Bạn có thể lấy sản phẩm từ tất cả các nhà hóa học giỏi."
                    },
                    {
                        "en": "Take this prescription to the chemist's.",
                        "vi": "Mang đơn thuốc này đến nhà hóa học."
                    },
                    {
                        "en": "I'll get it at the chemist's.",
                        "vi": "Tôi sẽ lấy nó ở nhà hóa học."
                    },
                    {
                        "en": "a chemist’s/chemist shop",
                        "vi": "một nhà hóa học / cửa hàng hóa chất"
                    }
                ]
            },
            {
                "define": {
                    "en": "a scientist who studies chemistry",
                    "vi": "một nhà khoa học nghiên cứu hóa học"
                },
                "examples": [
                    {
                        "en": "a research chemist",
                        "vi": "một nhà hóa học nghiên cứu"
                    }
                ]
            }
        ]
    },
    {
        "id": "dbe9f83ddcd1438689ac9c0e4d2d37d5",
        "word": "hairdresser",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈheədresə(r)/",
            "us": "/ˈherdresər/"
        },
        "nearby": [
            {
                "word": "haircut",
                "pos": "noun"
            },
            {
                "word": "hairdo",
                "pos": "noun"
            },
            {
                "word": "hairdresser",
                "pos": "noun"
            },
            {
                "word": "hairdressing",
                "pos": "noun"
            },
            {
                "word": "hairdryer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to cut, wash and shape hair",
                    "vi": "một người có công việc là cắt, gội và tạo kiểu tóc"
                },
                "examples": [
                    {
                        "en": "He's a very good hairdresser.",
                        "vi": "Anh ấy là một thợ làm tóc rất giỏi."
                    },
                    {
                        "en": "one of the country's top hairdressers",
                        "vi": "một trong những thợ làm tóc hàng đầu của đất nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you can get your hair cut, washed and shaped",
                    "vi": "nơi bạn có thể cắt tóc, gội đầu và tạo hình"
                },
                "examples": [
                    {
                        "en": "I spent the morning in the hairdresser's.",
                        "vi": "Tôi đã dành cả buổi sáng trong tiệm làm tóc."
                    },
                    {
                        "en": "I only go to the hairdresser's when I really need to.",
                        "vi": "Tôi chỉ đến tiệm làm tóc khi thực sự cần thiết."
                    }
                ]
            }
        ]
    },
    {
        "id": "6fa77ce4209f42e6970c05c3f28f47a7",
        "word": "shopping centre",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈʃɒpɪŋ sentə(r)/",
            "us": "/ˈʃɑːpɪŋ sentər/"
        },
        "nearby": [
            {
                "word": "shopping bag",
                "pos": "noun"
            },
            {
                "word": "shopping cart",
                "pos": "noun"
            },
            {
                "word": "shopping centre",
                "pos": "noun"
            },
            {
                "word": "shopping days to Christmas",
                "pos": ""
            },
            {
                "word": "shopping list",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of shops built together, sometimes under one roof",
                    "vi": "một nhóm các cửa hàng được xây dựng cùng nhau, đôi khi dưới một mái nhà"
                },
                "examples": [
                    {
                        "en": "Kendal boasts a modern shopping centre and a museum.",
                        "vi": "Kendal tự hào có một trung tâm mua sắm hiện đại và một viện bảo tàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "093ac78ebb984c579cb7dd20148a3c2b",
        "word": "store",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/stɔː(r)/",
            "us": "/stɔːr/"
        },
        "nearby": [
            {
                "word": "storage battery",
                "pos": "noun"
            },
            {
                "word": "storage heater",
                "pos": "noun"
            },
            {
                "word": "store",
                "pos": "noun"
            },
            {
                "word": "store",
                "pos": "verb"
            },
            {
                "word": "store-bought",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large shop that sells many different types of goods",
                    "vi": "một cửa hàng lớn bán nhiều loại hàng hóa khác nhau"
                },
                "examples": [
                    {
                        "en": "It's available at London's three biggest stores.",
                        "vi": "Nó có sẵn tại ba cửa hàng lớn nhất của London."
                    }
                ]
            },
            {
                "define": {
                    "en": "a shop, large or small",
                    "vi": "một cửa hàng, lớn hay nhỏ"
                },
                "examples": [
                    {
                        "en": "I'm going to the store.",
                        "vi": "Tôi đang đến cửa hàng."
                    },
                    {
                        "en": "His father opened a small grocery store.",
                        "vi": "Cha anh mở một cửa hàng tạp hóa nhỏ."
                    },
                    {
                        "en": "Retail stores across Europe were reporting no stock left of the game.",
                        "vi": "Các cửa hàng bán lẻ trên khắp châu Âu đã báo cáo không còn hàng trong trò chơi."
                    },
                    {
                        "en": "You should be able to get it in any good health food store.",
                        "vi": "Bạn có thể mua nó ở bất kỳ cửa hàng thực phẩm tốt cho sức khỏe nào."
                    },
                    {
                        "en": "He looked around for a liquor store.",
                        "vi": "Anh ta nhìn xung quanh để tìm một cửa hàng rượu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a website that sells things",
                    "vi": "một trang web bán những thứ"
                },
                "examples": [
                    {
                        "en": "an online store",
                        "vi": "một cửa hàng trực tuyến"
                    },
                    {
                        "en": "You can get it on the app store.",
                        "vi": "Bạn có thể lấy nó trên cửa hàng ứng dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quantity or supply of something that you have and use",
                    "vi": "số lượng hoặc nguồn cung cấp thứ gì đó mà bạn có và sử dụng"
                },
                "examples": [
                    {
                        "en": "her secret store of chocolate",
                        "vi": "cửa hàng sô cô la bí mật của cô ấy"
                    },
                    {
                        "en": "a vast store of knowledge",
                        "vi": "một kho kiến thức rộng lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "goods of a particular kind or for a particular purpose",
                    "vi": "hàng hóa của một loại cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "medical stores",
                        "vi": "cửa hàng y tế"
                    },
                    {
                        "en": "They had trouble keeping rats out of the food stores.",
                        "vi": "Họ gặp khó khăn trong việc ngăn lũ chuột ra khỏi cửa hàng thực phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where goods of a particular kind are kept",
                    "vi": "nơi lưu giữ hàng hóa của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The grain store holds several thousand tonnes.",
                        "vi": "Kho ngũ cốc chứa vài nghìn tấn."
                    },
                    {
                        "en": "The soldiers were charged with guarding the weapons stores.",
                        "vi": "Những người lính được giao nhiệm vụ canh gác các kho vũ khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "waiting to happen to somebody",
                    "vi": "chờ đợi điều gì đó xảy ra với ai đó"
                },
                "examples": [
                    {
                        "en": "We don't know what life holds in store for us.",
                        "vi": "Chúng ta không biết cuộc sống đang lưu giữ những gì cho chúng ta."
                    },
                    {
                        "en": "If she had known what lay in store for her, she would never have agreed to go.",
                        "vi": "Nếu cô ấy biết những gì nằm trong cửa hàng cho cô ấy, cô ấy sẽ không bao giờ đồng ý đi."
                    },
                    {
                        "en": "They think it'll be easy but they have a surprise in store.",
                        "vi": "Họ nghĩ rằng nó sẽ dễ dàng nhưng họ có một điều bất ngờ trong cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of something for a short time while somebody is away",
                    "vi": "phụ trách một việc gì đó trong một thời gian ngắn khi ai đó đi vắng"
                },
                "examples": [
                    {
                        "en": "Who's minding the store while the boss is abroad?",
                        "vi": "Ai đang để ý đến cửa hàng khi ông chủ đang ở nước ngoài?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider something to be important",
                    "vi": "coi một cái gì đó là quan trọng"
                },
                "examples": [
                    {
                        "en": "She sets great store by her appearance.",
                        "vi": "Cô ấy thiết lập một cửa hàng tuyệt vời bởi vẻ ngoài của mình."
                    },
                    {
                        "en": "It is unwise to put too much store by these statistics.",
                        "vi": "Không khôn ngoan nếu đặt quá nhiều cửa hàng theo những số liệu thống kê này."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4db705f5f36485fabcd5fd9f2159c07",
        "word": "baker",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbeɪkə(r)/",
            "us": "/ˈbeɪkər/"
        },
        "nearby": [
            {
                "word": "bakehouse",
                "pos": "noun"
            },
            {
                "word": "Bakelite",
                "pos": "noun"
            },
            {
                "word": "baker",
                "pos": "noun"
            },
            {
                "word": "Baker's Chocolate",
                "pos": "noun"
            },
            {
                "word": "baker's dozen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is baking and selling bread and cakes",
                    "vi": "một người có công việc là nướng và bán bánh mì và bánh ngọt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells bread and cakes",
                    "vi": "một cửa hàng bán bánh mì và bánh ngọt"
                },
                "examples": [
                    {
                        "en": "I'm just going to the baker's.",
                        "vi": "Tôi chỉ đi đến tiệm làm bánh."
                    }
                ]
            }
        ]
    },
    {
        "id": "f28ecf83f16f44dcaf58a61a589b4623",
        "word": "chain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃeɪn/",
            "us": "/tʃeɪn/"
        },
        "nearby": [
            {
                "word": "chagrined",
                "pos": "adjective"
            },
            {
                "word": "chai",
                "pos": "noun"
            },
            {
                "word": "chain",
                "pos": "noun"
            },
            {
                "word": "chain",
                "pos": "verb"
            },
            {
                "word": "chain gang",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of connected metal rings, used for pulling or fastening things; a length of chain used for a particular purpose",
                    "vi": "một loạt các vòng kim loại được kết nối với nhau, được sử dụng để kéo hoặc buộc chặt mọi thứ; chiều dài của chuỗi được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "She wore a heavy gold chain around her neck.",
                        "vi": "Cô đeo một sợi dây chuyền vàng nặng quanh cổ."
                    },
                    {
                        "en": "The mayor wore his chain of office.",
                        "vi": "Thị trưởng đeo chuỗi văn phòng của mình."
                    },
                    {
                        "en": "a bicycle chain",
                        "vi": "xích xe đạp"
                    },
                    {
                        "en": "in chains The prisoners were kept in chains (= with chains around their arms and legs, to prevent them from escaping).",
                        "vi": "trong xiềng xích Các tù nhân bị giam trong xiềng xích (= với xiềng xích quanh tay và chân để ngăn họ trốn thoát)."
                    },
                    {
                        "en": "on a chain They kept the dog on a chain all day long.",
                        "vi": "trên dây xích Họ giữ con chó trên dây xích suốt cả ngày."
                    },
                    {
                        "en": "a short length of chain",
                        "vi": "chiều dài của chuỗi ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of connected things or people",
                    "vi": "một loạt những thứ hoặc những người được kết nối"
                },
                "examples": [
                    {
                        "en": "mountain/island chains",
                        "vi": "chuỗi núi / đảo"
                    },
                    {
                        "en": "Volunteers formed a human chain (= line of people) to rescue precious items from the burning house.",
                        "vi": "Các tình nguyện viên đã thành lập một chuỗi người (= dòng người) để giải cứu các vật phẩm quý giá khỏi ngôi nhà đang cháy."
                    },
                    {
                        "en": "chain of somebody/something to set in motion a chain of events",
                        "vi": "chuỗi sự kiện của ai đó / cái gì đó để thiết lập một chuỗi sự kiện"
                    },
                    {
                        "en": "a chain of command (= a system in an organization by which instructions are passed from one person to another)",
                        "vi": "một chuỗi lệnh (= một hệ thống trong một tổ chức theo đó các lệnh được chuyển từ người này sang người khác)"
                    },
                    {
                        "en": "Our suppliers are the weakest link in the chain.",
                        "vi": "Các nhà cung cấp của chúng tôi là mắt xích yếu nhất trong chuỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of shops or hotels owned by the same company",
                    "vi": "một nhóm các cửa hàng hoặc khách sạn thuộc sở hữu của cùng một công ty"
                },
                "examples": [
                    {
                        "en": "a supermarket/hotel/retail chain",
                        "vi": "siêu thị / khách sạn / chuỗi bán lẻ"
                    },
                    {
                        "en": "chain of something a chain of stores/shops/restaurants",
                        "vi": "chuỗi cửa hàng / chuỗi cửa hàng / nhà hàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that limits somebody’s freedom or ability to do something",
                    "vi": "một thứ hạn chế sự tự do hoặc khả năng làm việc gì đó của ai đó"
                },
                "examples": [
                    {
                        "en": "the chains of fear/misery",
                        "vi": "chuỗi sợ hãi / đau khổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a number of people selling and buying houses must each complete the sale of their house before buying from the next person",
                    "vi": "tình huống một số người bán và mua nhà phải hoàn thành việc bán nhà của mình trước khi mua của người tiếp theo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a problem that prevents you from doing what you would like to do",
                    "vi": "một vấn đề ngăn cản bạn làm những gì bạn muốn làm"
                },
                "examples": [
                    {
                        "en": "The responsibility was a ball and chain around my ankle.",
                        "vi": "Trách nhiệm là một quả bóng và dây xích quanh mắt cá chân của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the stages in a process or a line of argument",
                    "vi": "một trong các giai đoạn của một quy trình hoặc một dòng đối số"
                },
                "examples": [
                    {
                        "en": "Food production, processing and marketing are different links in the chain from farmer to consumer.",
                        "vi": "Sản xuất, chế biến và tiếp thị thực phẩm là những mắt xích khác nhau trong chuỗi từ người nông dân đến người tiêu dùng."
                    },
                    {
                        "en": "Death is the last link in the chain.",
                        "vi": "Cái chết là mắt xích cuối cùng trong dây chuyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the point at which a system or an organization is most likely to fail",
                    "vi": "thời điểm mà một hệ thống hoặc một tổ chức có nhiều khả năng bị thất bại nhất"
                },
                "examples": [
                    {
                        "en": "She went straight for the one weak link in the chain of his argument.",
                        "vi": "Cô đã đi thẳng đến một mắt xích yếu trong chuỗi tranh luận của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "e784776f48ad41daae169fe9903c8dbd",
        "word": "department store",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪˈpɑːtmənt stɔː(r)/",
            "us": "/dɪˈpɑːrtmənt stɔːr/"
        },
        "nearby": [
            {
                "word": "the Department of Transportation",
                "pos": ""
            },
            {
                "word": "the Department of Veterans Affairs",
                "pos": ""
            },
            {
                "word": "department store",
                "pos": "noun"
            },
            {
                "word": "departure",
                "pos": "noun"
            },
            {
                "word": "depend",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large shop that is divided into several parts, each part selling a different type of goods",
                    "vi": "một cửa hàng lớn được chia thành nhiều bộ phận, mỗi bộ phận bán một loại hàng hoá khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "50020a4782984e66a7227b37f5fd2936",
        "word": "antique",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ænˈtiːk/",
            "us": "/ænˈtiːk/"
        },
        "nearby": [
            {
                "word": "antiquated",
                "pos": "adjective"
            },
            {
                "word": "antique",
                "pos": "adjective"
            },
            {
                "word": "antique",
                "pos": "noun"
            },
            {
                "word": "The Antiques Roadshow",
                "pos": ""
            },
            {
                "word": "antiquity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object such as a piece of furniture that is old and often valuable",
                    "vi": "một đồ vật chẳng hạn như một món đồ nội thất cũ và thường có giá trị"
                },
                "examples": [
                    {
                        "en": "Priceless antiques were destroyed in the fire.",
                        "vi": "Những món đồ cổ vô giá đã bị thiêu rụi trong đám cháy."
                    },
                    {
                        "en": "an antique shop (= one that sells antiques)",
                        "vi": "cửa hàng đồ cổ (= cửa hàng bán đồ cổ)"
                    },
                    {
                        "en": "an antique dealer/antiques dealer (= a person who sells antiques)",
                        "vi": "đại lý đồ cổ / đại lý đồ cổ (= người bán đồ cổ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "bf57ec346f0844fdb2aee8e03896189a",
        "word": "bakery",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbeɪkəri/",
            "us": "/ˈbeɪkəri/"
        },
        "nearby": [
            {
                "word": "Bakersfield",
                "pos": ""
            },
            {
                "word": "Baker Street",
                "pos": ""
            },
            {
                "word": "bakery",
                "pos": "noun"
            },
            {
                "word": "bake sale",
                "pos": "noun"
            },
            {
                "word": "bakeshop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where bread and cakes are made and/or sold",
                    "vi": "một nơi bánh mì và bánh ngọt được làm và / hoặc bán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "95ddb0b84b7d4fe884bc56a540c271e1",
        "word": "bakeshop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbeɪkʃɒp/",
            "us": "/ˈbeɪkʃɑːp/"
        },
        "nearby": [
            {
                "word": "bakery",
                "pos": "noun"
            },
            {
                "word": "bake sale",
                "pos": "noun"
            },
            {
                "word": "bakeshop",
                "pos": "noun"
            },
            {
                "word": "bakeware",
                "pos": "noun"
            },
            {
                "word": "Bakewell tart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where bread and cakes are made and/or sold",
                    "vi": "một nơi bánh mì và bánh ngọt được làm và / hoặc bán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f446147bce8f4026a1ada96cfa177326",
        "word": "barber",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɑːbə(r)/",
            "us": "/ˈbɑːrbər/"
        },
        "nearby": [
            {
                "word": "barbed wire",
                "pos": "noun"
            },
            {
                "word": "barbell",
                "pos": "noun"
            },
            {
                "word": "barber",
                "pos": "noun"
            },
            {
                "word": "Samuel Barber",
                "pos": ""
            },
            {
                "word": "the Barber Institute of Fine Arts",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to cut men’s hair and sometimes to shave them",
                    "vi": "một người có công việc là cắt tóc nam giới và đôi khi cạo râu cho họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop where men can have their hair cut",
                    "vi": "một cửa hàng nơi đàn ông có thể cắt tóc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca186fee1dff499a9dfef7eae285f81b",
        "word": "butcher",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbʊtʃə(r)/",
            "us": "/ˈbʊtʃər/"
        },
        "nearby": [
            {
                "word": "butane",
                "pos": "noun"
            },
            {
                "word": "butch",
                "pos": "adjective"
            },
            {
                "word": "butcher",
                "pos": "noun"
            },
            {
                "word": "butcher",
                "pos": "verb"
            },
            {
                "word": "butcher block",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is cutting up and selling meat in a shop or killing animals for this purpose",
                    "vi": "một người có công việc là xẻ thịt và bán thịt trong cửa hàng hoặc giết động vật vì mục đích này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells meat",
                    "vi": "một cửa hàng bán thịt"
                },
                "examples": [
                    {
                        "en": "He owns the butcher's in the main street.",
                        "vi": "Anh ta sở hữu tiệm thịt trên đường phố chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who kills people in a cruel and violent way",
                    "vi": "một kẻ giết người một cách tàn nhẫn và bạo lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a look at something",
                    "vi": "để có một cái nhìn vào một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d70871d9d8ab43bb95db8fe417d8657c",
        "word": "cleaner",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkliːnə(r)/",
            "us": "/ˈkliːnər/"
        },
        "nearby": [
            {
                "word": "clean down",
                "pos": "phrasal verb"
            },
            {
                "word": "clean eating",
                "pos": "noun"
            },
            {
                "word": "cleaner",
                "pos": "noun"
            },
            {
                "word": "clean from",
                "pos": "phrasal verb"
            },
            {
                "word": "cleaning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to clean other people’s houses or offices, etc.",
                    "vi": "một người có công việc là dọn dẹp nhà cửa hoặc văn phòng của người khác, v.v."
                },
                "examples": [
                    {
                        "en": "an office cleaner",
                        "vi": "người dọn dẹp văn phòng"
                    },
                    {
                        "en": "I met him while I was working as a cleaner in a hospital.",
                        "vi": "Tôi gặp anh ấy khi tôi đang làm công việc quét dọn trong một bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine or substance that is used for cleaning",
                    "vi": "một máy hoặc chất được sử dụng để làm sạch"
                },
                "examples": [
                    {
                        "en": "a vacuum cleaner",
                        "vi": "máy hút bụi"
                    },
                    {
                        "en": "a bottle of kitchen cleaner",
                        "vi": "một chai nước lau bếp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a shop where clothes, curtains, etc. are cleaned, especially with chemicals",
                    "vi": "một cửa hàng nơi quần áo, rèm cửa, vv được làm sạch, đặc biệt là bằng hóa chất"
                },
                "examples": [
                    {
                        "en": "Can you pick up my suit from the cleaner's?",
                        "vi": "Bạn có thể lấy bộ đồ của tôi từ người dọn dẹp không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal all of somebody’s money, etc., or to get it using a trick",
                    "vi": "để ăn cắp tất cả tiền của ai đó, v.v. hoặc lấy nó bằng cách sử dụng mánh khóe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to defeat somebody completely",
                    "vi": "để đánh bại ai đó hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Our team got taken to the cleaners.",
                        "vi": "Nhóm của chúng tôi đã được đưa đến các nhà vệ sinh."
                    }
                ]
            }
        ]
    },
    {
        "id": "232657e8ee6b4949a81f6f511ac6c4cd",
        "word": "convenience store",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈviːniəns stɔː(r)/",
            "us": "/kənˈviːniəns stɔːr/"
        },
        "nearby": [
            {
                "word": "convenience",
                "pos": "noun"
            },
            {
                "word": "convenience food",
                "pos": "noun"
            },
            {
                "word": "convenience store",
                "pos": "noun"
            },
            {
                "word": "convenient",
                "pos": "adjective"
            },
            {
                "word": "conveniently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small local shop that sells food, newspapers, etc. and has long opening hours",
                    "vi": "một cửa hàng địa phương nhỏ bán đồ ăn, báo, v.v. và có giờ mở cửa kéo dài"
                },
                "examples": [
                    {
                        "en": "We bought some snacks at the convenience store.",
                        "vi": "Chúng tôi đã mua một số đồ ăn nhẹ ở cửa hàng tiện lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "a799b37e54fb4a749aae5acba92daa0e",
        "word": "corner shop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɔːnə ʃɒp/",
            "us": "/ˈkɔːrnər ʃɑːp/"
        },
        "nearby": [
            {
                "word": "cornerback",
                "pos": "noun"
            },
            {
                "word": "corner kick",
                "pos": "noun"
            },
            {
                "word": "corner shop",
                "pos": "noun"
            },
            {
                "word": "cornerstone",
                "pos": "noun"
            },
            {
                "word": "cornet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small shop that sells food, newspapers, etc., especially one near people’s houses",
                    "vi": "một cửa hàng nhỏ bán đồ ăn, báo, v.v., đặc biệt là một cửa hàng gần nhà dân"
                },
                "examples": [
                    {
                        "en": "I got some milk from the corner shop.",
                        "vi": "Tôi có một ít sữa từ cửa hàng góc."
                    },
                    {
                        "en": "the local corner shop/store",
                        "vi": "cửa hàng / cửa hàng ở góc địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "56856e876b73433f8b900085f3309e4e",
        "word": "drugstore",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdrʌɡstɔː(r)/",
            "us": "/ˈdrʌɡstɔːr/"
        },
        "nearby": [
            {
                "word": "drug lord",
                "pos": "noun"
            },
            {
                "word": "drug peddler",
                "pos": "noun"
            },
            {
                "word": "drugstore",
                "pos": "noun"
            },
            {
                "word": "Druid",
                "pos": "noun"
            },
            {
                "word": "drum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells medicines and also other types of goods, for example cosmetics",
                    "vi": "cửa hàng bán thuốc và các loại hàng hóa khác, ví dụ như mỹ phẩm"
                },
                "examples": [
                    {
                        "en": "I bought these sunglasses at the drugstore.",
                        "vi": "Tôi đã mua những chiếc kính râm này ở hiệu thuốc."
                    },
                    {
                        "en": "The toothpaste is available at supermarkets and drugstores.",
                        "vi": "Kem đánh răng có bán tại các siêu thị và hiệu thuốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "22c20b03651e46a98e26cc2ce65b8b82",
        "word": "estate agent",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈsteɪt eɪdʒənt/",
            "us": "/ɪˈsteɪt eɪdʒənt/"
        },
        "nearby": [
            {
                "word": "the Establishment Clause",
                "pos": ""
            },
            {
                "word": "estate",
                "pos": "noun"
            },
            {
                "word": "estate agent",
                "pos": "noun"
            },
            {
                "word": "estate car",
                "pos": "noun"
            },
            {
                "word": "estate sale",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to sell houses and land for people",
                    "vi": "một người có công việc là bán nhà đất cho người ta."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bd03b33eed6a4daf830f710ac567469c",
        "word": "farmers’ market",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɑːməz mɑːkɪt/",
            "us": "/ˈfɑːrmərz mɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "Fannie Farmer",
                "pos": ""
            },
            {
                "word": "Farmer George",
                "pos": ""
            },
            {
                "word": "farmers' market",
                "pos": "noun"
            },
            {
                "word": "farmhand",
                "pos": "noun"
            },
            {
                "word": "farmhouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where farmers and growers sell food directly to the public",
                    "vi": "nơi mà nông dân và người trồng trọt bán thực phẩm trực tiếp cho công chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b3c4f1e6d97408ab9027d8de272fd49",
        "word": "farm shop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɑːm ʃɒp/",
            "us": "/ˈfɑːrm ʃɑːp/"
        },
        "nearby": [
            {
                "word": "farm out",
                "pos": "phrasal verb"
            },
            {
                "word": "farm out to",
                "pos": "phrasal verb"
            },
            {
                "word": "farm shop",
                "pos": "noun"
            },
            {
                "word": "farmstead",
                "pos": "noun"
            },
            {
                "word": "farm team",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells food and other items from a farm directly to the public",
                    "vi": "cửa hàng bán thực phẩm và các mặt hàng khác từ trang trại trực tiếp cho công chúng"
                },
                "examples": [
                    {
                        "en": "The family sell fresh eggs, meat and cheese in their on-site farm shop.",
                        "vi": "Gia đình này bán trứng tươi, thịt và pho mát tại cửa hàng trang trại trong khuôn viên của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "60eac2579af548eb924af92d32782439",
        "word": "greengrocer",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡriːnɡrəʊsə(r)/",
            "us": "/ˈɡriːnɡrəʊsər/"
        },
        "nearby": [
            {
                "word": "Green Giant",
                "pos": ""
            },
            {
                "word": "green goddess",
                "pos": "noun"
            },
            {
                "word": "greengrocer",
                "pos": "noun"
            },
            {
                "word": "Green Grow the Rushes O",
                "pos": ""
            },
            {
                "word": "Greenham Common",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns, manages or works in a shop selling fruit and vegetables",
                    "vi": "một người sở hữu, quản lý hoặc làm việc trong một cửa hàng bán trái cây và rau quả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells fruit and vegetables",
                    "vi": "một cửa hàng bán trái cây và rau quả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a03687ddf96d46e0a76c5f2f4a878bc0",
        "word": "health food",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhelθ fuːd/",
            "us": "/ˈhelθ fuːd/"
        },
        "nearby": [
            {
                "word": "health club",
                "pos": "noun"
            },
            {
                "word": "health farm",
                "pos": "noun"
            },
            {
                "word": "health food",
                "pos": "noun"
            },
            {
                "word": "healthful",
                "pos": "adjective"
            },
            {
                "word": "healthfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "food that does not contain any artificial substances and is therefore thought to be good for your health",
                    "vi": "thực phẩm không chứa bất kỳ chất nhân tạo nào và do đó được cho là tốt cho sức khỏe của bạn"
                },
                "examples": [
                    {
                        "en": "a health food store/shop",
                        "vi": "cửa hàng / cửa hàng thực phẩm tốt cho sức khỏe"
                    }
                ]
            }
        ]
    },
    {
        "id": "55247ea71dcf4f33bd95fcb853abb079",
        "word": "jeweller",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒuːələ(r)/",
            "us": "/ˈdʒuːələr/"
        },
        "nearby": [
            {
                "word": "The Jewel in the Crown",
                "pos": ""
            },
            {
                "word": "jewelled",
                "pos": "adjective"
            },
            {
                "word": "jeweller",
                "pos": "noun"
            },
            {
                "word": "jewellery",
                "pos": "noun"
            },
            {
                "word": "Jewess",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who makes, repairs or sells jewellery and watches",
                    "vi": "một người sản xuất, sửa chữa hoặc bán đồ trang sức và đồng hồ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells jewellery and watches",
                    "vi": "một cửa hàng bán đồ trang sức và đồng hồ"
                },
                "examples": [
                    {
                        "en": "I bought it at the jeweller's near my office.",
                        "vi": "Tôi đã mua nó ở tiệm kim hoàn gần văn phòng của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5f06b44f7114660bde8932c34fa9b04",
        "word": "newsagent",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈnjuːzeɪdʒənt/",
            "us": "/ˈnuːzeɪdʒənt/"
        },
        "nearby": [
            {
                "word": "news",
                "pos": "noun"
            },
            {
                "word": "news agency",
                "pos": "noun"
            },
            {
                "word": "newsagent",
                "pos": "noun"
            },
            {
                "word": "newscast",
                "pos": "noun"
            },
            {
                "word": "newscaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns or works in a shop selling newspapers and magazines, and often sweets and cigarettes",
                    "vi": "một người sở hữu hoặc làm việc trong một cửa hàng bán báo và tạp chí, và thường là đồ ngọt và thuốc lá"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells newspapers, magazines, sweets, etc.",
                    "vi": "cửa hàng bán báo, tạp chí, đồ ngọt, v.v."
                },
                "examples": [
                    {
                        "en": "I'll go to the newsagent's on my way home.",
                        "vi": "Tôi sẽ đến quầy bán báo trên đường về nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "26cb491242184adea4953f6bcd59146d",
        "word": "pharmacy",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɑːməsi/",
            "us": "/ˈfɑːrməsi/"
        },
        "nearby": [
            {
                "word": "pharmacology",
                "pos": "noun"
            },
            {
                "word": "pharmacopoeia",
                "pos": "noun"
            },
            {
                "word": "pharmacy",
                "pos": "noun"
            },
            {
                "word": "pharming",
                "pos": "noun"
            },
            {
                "word": "pharyngeal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop, or part of one, that sells medicines and drugs",
                    "vi": "một cửa hàng hoặc một phần của một cửa hàng bán thuốc và thuốc"
                },
                "examples": [
                    {
                        "en": "The cream is available at/from/in pharmacies without a prescription.",
                        "vi": "Kem có sẵn tại / từ / tại các hiệu thuốc mà không cần toa bác sĩ."
                    },
                    {
                        "en": "Research is bringing more effective new drugs to pharmacy shelves.",
                        "vi": "Nghiên cứu đang đưa các loại thuốc mới hiệu quả hơn lên kệ thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place in a hospital where medicines are prepared",
                    "vi": "một nơi trong bệnh viện, nơi điều chế thuốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the study of how to prepare medicines and drugs",
                    "vi": "nghiên cứu về cách điều chế thuốc và thuốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41a2df14b1bf43f6a3d6a6d4ecc0624f",
        "word": "salon",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsælɒn/",
            "us": "/səˈlɑːn/"
        },
        "nearby": [
            {
                "word": "salmon pink",
                "pos": "adjective"
            },
            {
                "word": "salmon pink",
                "pos": "noun"
            },
            {
                "word": "salon",
                "pos": "noun"
            },
            {
                "word": "saloon",
                "pos": "noun"
            },
            {
                "word": "Salop",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that gives customers hair or beauty treatment or that sells expensive clothes",
                    "vi": "cửa hàng cung cấp cho khách hàng liệu pháp chăm sóc sắc đẹp hoặc tóc hoặc bán quần áo đắt tiền"
                },
                "examples": [
                    {
                        "en": "a beauty salon",
                        "vi": "một thẩm mỹ viện"
                    },
                    {
                        "en": "a hairdressing salon",
                        "vi": "một tiệm làm tóc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a large house used for entertaining guests",
                    "vi": "một căn phòng trong một ngôi nhà lớn dùng để tiếp đãi khách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the past) a regular meeting of writers, artists and other guests at the house of a famous or important person",
                    "vi": "(trước đây) một cuộc họp thường xuyên của các nhà văn, nghệ sĩ và các khách mời khác tại nhà của một người nổi tiếng hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "a literary salon",
                        "vi": "một tiệm văn học"
                    }
                ]
            }
        ]
    },
    {
        "id": "142b74c86e274973b82b8cc06b8f2612",
        "word": "stall",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/stɔːl/",
            "us": "/stɔːl/"
        },
        "nearby": [
            {
                "word": "stalking",
                "pos": "noun"
            },
            {
                "word": "stalking horse",
                "pos": "noun"
            },
            {
                "word": "stall",
                "pos": "noun"
            },
            {
                "word": "stall",
                "pos": "verb"
            },
            {
                "word": "stallholder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a table or small shop with an open front that people sell things from, especially at a market",
                    "vi": "một cái bàn hoặc một cửa hàng nhỏ có mặt tiền thoáng để mọi người bán đồ, đặc biệt là ở chợ"
                },
                "examples": [
                    {
                        "en": "He works on a market stall in the Square.",
                        "vi": "Anh ta làm việc trên một quầy hàng trong chợ ở Quảng trường."
                    },
                    {
                        "en": "They have a fish stall on the market.",
                        "vi": "Họ có một quầy bán cá trên thị trường."
                    },
                    {
                        "en": "Drinks were being sold from makeshift stalls at the side of the road.",
                        "vi": "Đồ uống được bán từ các quầy hàng tạm bợ bên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section inside a farm building that is large enough for one animal to be kept in",
                    "vi": "một phần bên trong một tòa nhà trang trại đủ lớn cho một con vật được nuôi trong"
                },
                "examples": [
                    {
                        "en": "We had to muck out stalls and groom the horses.",
                        "vi": "Chúng tôi phải dọn chuồng và chải lông cho ngựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area in a room, surrounded by glass, walls, etc., that contains a shower or toilet",
                    "vi": "một khu vực nhỏ trong phòng, được bao quanh bởi kính, tường, v.v., có vòi hoa sen hoặc nhà vệ sinh"
                },
                "examples": [
                    {
                        "en": "a bathroom stall",
                        "vi": "quầy hàng trong phòng tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats that are nearest to the stage in a theatre",
                    "vi": "những chỗ ngồi gần sân khấu nhất trong rạp hát"
                },
                "examples": [
                    {
                        "en": "the front row of the stalls",
                        "vi": "hàng trước của quầy hàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats at the front of a church where the choir (= singers) and priests sit",
                    "vi": "ghế ở phía trước của một nhà thờ, nơi ca đoàn (= ca sĩ) và các linh mục ngồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which a vehicle’s engine suddenly stops because it is not getting enough power",
                    "vi": "tình huống trong đó động cơ của xe đột ngột dừng lại do không nhận đủ công suất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which an aircraft loses speed and goes steeply downwards",
                    "vi": "một tình huống trong đó một máy bay mất tốc độ và đi xuống dốc"
                },
                "examples": [
                    {
                        "en": "The plane went into a stall.",
                        "vi": "Máy bay bị chết máy."
                    }
                ]
            }
        ]
    },
    {
        "id": "80d92b6597884fbd9ae7bf07c850216c",
        "word": "stand",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/stænd/",
            "us": "/stænd/"
        },
        "nearby": [
            {
                "word": "stand-up",
                "pos": "noun"
            },
            {
                "word": "stand",
                "pos": "verb"
            },
            {
                "word": "stand",
                "pos": "noun"
            },
            {
                "word": "stand-alone",
                "pos": "adjective"
            },
            {
                "word": "stand apart from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attitude towards something or an opinion that you make clear to people",
                    "vi": "thái độ đối với điều gì đó hoặc ý kiến mà bạn nói rõ với mọi người"
                },
                "examples": [
                    {
                        "en": "He has avoided taking a firm stand.",
                        "vi": "Anh ấy đã tránh lập trường vững vàng."
                    },
                    {
                        "en": "stand on something The judge takes a tough stand on corruption.",
                        "vi": "đứng về một cái gì đó Thẩm phán có quan điểm cứng rắn về tham nhũng."
                    },
                    {
                        "en": "stand against something I admire their principled stand against the war.",
                        "vi": "chống lại một cái gì đó mà tôi ngưỡng mộ lập trường nguyên tắc của họ chống lại chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong effort to defend yourself or your opinion about something",
                    "vi": "nỗ lực mạnh mẽ để bảo vệ bản thân hoặc ý kiến của bạn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "They are willing to take a stand and defend what they believe in.",
                        "vi": "Họ sẵn sàng giữ vững lập trường và bảo vệ những gì họ tin tưởng."
                    },
                    {
                        "en": "stand against something We must make a stand against job losses.",
                        "vi": "chống lại điều gì đó Chúng ta phải có lập trường chống lại tình trạng mất việc làm."
                    },
                    {
                        "en": "the rebels’ desperate last stand",
                        "vi": "chỗ đứng cuối cùng tuyệt vọng của phiến quân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a table or structure that goods are sold from, especially in the street or at a market",
                    "vi": "một bảng hoặc cấu trúc mà hàng hóa được bán, đặc biệt là trên đường phố hoặc ở chợ"
                },
                "examples": [
                    {
                        "en": "a lemonade/hot dog/newspaper stand",
                        "vi": "quầy nước chanh / xúc xích / báo"
                    },
                    {
                        "en": "She sells fruit from a roadside stand.",
                        "vi": "Cô bán trái cây ở một quán ven đường."
                    },
                    {
                        "en": "The magazine sold out as soon as it hit the stands (= went on sale).",
                        "vi": "Tạp chí đã bán hết sạch ngay khi xuất hiện trên khán đài (= đã được bán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a table or a vertical structure where things are displayed or advertised, for example at an exhibition",
                    "vi": "một cái bàn hoặc một cấu trúc thẳng đứng nơi mọi thứ được trưng bày hoặc quảng cáo, chẳng hạn như tại một cuộc triển lãm"
                },
                "examples": [
                    {
                        "en": "a display/an exhibition stand",
                        "vi": "một gian trưng bày / một triển lãm"
                    },
                    {
                        "en": "Oxford University Press’s stand at the book fair",
                        "vi": "Gian hàng của Nhà xuất bản Đại học Oxford tại hội chợ sách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment or furniture that you use for holding a particular type of thing",
                    "vi": "một phần của thiết bị hoặc đồ nội thất mà bạn sử dụng để giữ một loại vật cụ thể"
                },
                "examples": [
                    {
                        "en": "a bicycle/microphone/cake stand",
                        "vi": "một chiếc xe đạp / micrô / giá bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large sloping structure at a stadium with rows where people sit or stand to watch the game",
                    "vi": "một cấu trúc dốc lớn ở sân vận động với các hàng nơi mọi người ngồi hoặc đứng để xem trận đấu"
                },
                "examples": [
                    {
                        "en": "We had seats in the east stand.",
                        "vi": "Chúng tôi đã có chỗ ngồi ở khán đài phía đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in court where people stand to give evidence",
                    "vi": "nơi tòa án nơi mọi người đứng để đưa ra bằng chứng"
                },
                "examples": [
                    {
                        "en": "He took the stand as the first witness.",
                        "vi": "Anh đứng ra làm nhân chứng đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period of time in which two people who are batting (= hitting the ball) play together and score points",
                    "vi": "Khoảng thời gian mà hai người đánh bóng (= đánh bóng) chơi với nhau và ghi điểm"
                },
                "examples": [
                    {
                        "en": "Clinch and Harris shared an opening stand of 69.",
                        "vi": "Clinch và Harris chia sẻ điểm mở màn là 69."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where taxis, buses, etc. park while they are waiting for passengers",
                    "vi": "nơi mà taxi, xe buýt, v.v. đậu trong khi họ đang đợi hành khách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of plants or trees of one kind",
                    "vi": "một nhóm cây hoặc một loại cây"
                },
                "examples": [
                    {
                        "en": "a stand of pines",
                        "vi": "một giá đỡ của cây thông"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of land that you can buy and use for building a house, etc. on",
                    "vi": "một mảnh đất mà bạn có thể mua và sử dụng để xây nhà, v.v."
                },
                "examples": [
                    {
                        "en": "A developer bought the land and divided it into stands.",
                        "vi": "Một nhà phát triển đã mua khu đất và chia nó thành các gian hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1778631c2a94710ad120307d28367cb",
        "word": "travel agency",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrævl eɪdʒənsi/",
            "us": "/ˈtrævl eɪdʒənsi/"
        },
        "nearby": [
            {
                "word": "travel",
                "pos": "verb"
            },
            {
                "word": "travel",
                "pos": "noun"
            },
            {
                "word": "travel agency",
                "pos": "noun"
            },
            {
                "word": "travel agent",
                "pos": "noun"
            },
            {
                "word": "travelator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a company that arranges travel and/or accommodation for people going on a holiday or journey",
                    "vi": "một công ty sắp xếp việc đi lại và / hoặc chỗ ở cho những người đi nghỉ hoặc đi du lịch"
                },
                "examples": [
                    {
                        "en": "You can book at your local travel agency.",
                        "vi": "Bạn có thể đặt tại đại lý du lịch địa phương của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "2638e1edd77d489eabe200b5ed2825f0",
        "word": "bookstall",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊkstɔːl/",
            "us": "/ˈbʊkstɔːl/"
        },
        "nearby": [
            {
                "word": "bookshop",
                "pos": "noun"
            },
            {
                "word": "book-smart",
                "pos": "adjective"
            },
            {
                "word": "bookstall",
                "pos": "noun"
            },
            {
                "word": "book token",
                "pos": "noun"
            },
            {
                "word": "bookworm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small shop that is open at the front, where you can buy books, newspapers or magazines, for example at a station or an airport",
                    "vi": "một cửa hàng nhỏ mở ở phía trước, nơi bạn có thể mua sách, báo hoặc tạp chí, chẳng hạn như ở nhà ga hoặc sân bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "445ec6373704431795b349964fa98f48",
        "word": "boutique",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/buːˈtiːk/",
            "us": "/buːˈtiːk/"
        },
        "nearby": [
            {
                "word": "bourse",
                "pos": "noun"
            },
            {
                "word": "bout",
                "pos": "noun"
            },
            {
                "word": "boutique",
                "pos": "noun"
            },
            {
                "word": "boutique",
                "pos": "adjective"
            },
            {
                "word": "boutonnière",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small shop that sells fashionable clothes or expensive gifts",
                    "vi": "một cửa hàng nhỏ bán quần áo thời trang hoặc quà tặng đắt tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f1e3a0113914f328d452a0c36629110",
        "word": "chain store",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃeɪn stɔː(r)/",
            "us": "/ˈtʃeɪn stɔːr/"
        },
        "nearby": [
            {
                "word": "chain-smoke",
                "pos": "verb"
            },
            {
                "word": "chain-smoker",
                "pos": "noun"
            },
            {
                "word": "chain store",
                "pos": "noun"
            },
            {
                "word": "chair",
                "pos": "noun"
            },
            {
                "word": "chair",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that is one of a series of similar shops owned by the same company",
                    "vi": "một cửa hàng là một trong một loạt các cửa hàng tương tự do cùng một công ty sở hữu"
                },
                "examples": [
                    {
                        "en": "These small towns are dominated by chain stores.",
                        "vi": "Các thị trấn nhỏ này bị chi phối bởi các chuỗi cửa hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "21a4955ce5a449b79d65e31d07dfb27f",
        "word": "deli",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdeli/",
            "us": "/ˈdeli/"
        },
        "nearby": [
            {
                "word": "deleterious",
                "pos": "adjective"
            },
            {
                "word": "deletion",
                "pos": "noun"
            },
            {
                "word": "deli",
                "pos": "noun"
            },
            {
                "word": "Delia",
                "pos": ""
            },
            {
                "word": "deliberate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop or part of one that sells cooked meats and cheeses, and special or unusual foods that come from other countries",
                    "vi": "một cửa hàng hoặc một phần của một cửa hàng bán thịt nấu chín và pho mát cũng như các loại thực phẩm đặc biệt hoặc bất thường đến từ các quốc gia khác"
                },
                "examples": [
                    {
                        "en": "There was a wide selection of Italian meats at the deli counter.",
                        "vi": "Có rất nhiều lựa chọn các loại thịt Ý tại quầy bán đồ ăn nhanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd29cd49e57b4124911271850f6d4509",
        "word": "delicatessen",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdelɪkəˈtesn/",
            "us": "/ˌdelɪkəˈtesn/"
        },
        "nearby": [
            {
                "word": "delicate",
                "pos": "adjective"
            },
            {
                "word": "delicately",
                "pos": "adverb"
            },
            {
                "word": "delicatessen",
                "pos": "noun"
            },
            {
                "word": "delicious",
                "pos": "adjective"
            },
            {
                "word": "deliciously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop or part of one that sells cooked meats and cheeses, and special or unusual foods that come from other countries",
                    "vi": "một cửa hàng hoặc một phần của một cửa hàng bán thịt nấu chín và pho mát cũng như các loại thực phẩm đặc biệt hoặc bất thường đến từ các quốc gia khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "26aac84f4e004e6389916d359f604aa1",
        "word": "factory shop",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfæktri ʃɒp/",
            "us": "/ˈfæktri ʃɑːp/"
        },
        "nearby": [
            {
                "word": "factory floor",
                "pos": "noun"
            },
            {
                "word": "factory ship",
                "pos": "noun"
            },
            {
                "word": "factory shop",
                "pos": "noun"
            },
            {
                "word": "factotum",
                "pos": "noun"
            },
            {
                "word": "fact sheet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop in which goods are sold directly by the company that produces them at a cheaper price than normal",
                    "vi": "cửa hàng bán hàng do công ty trực tiếp sản xuất với giá rẻ hơn bình thường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "acee6fc8c6084bfba0dc8a9640afaf89",
        "word": "florist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈflɒrɪst/",
            "us": "/ˈflɔːrɪst/"
        },
        "nearby": [
            {
                "word": "floridly",
                "pos": "adverb"
            },
            {
                "word": "florin",
                "pos": "noun"
            },
            {
                "word": "florist",
                "pos": "noun"
            },
            {
                "word": "floss",
                "pos": "noun"
            },
            {
                "word": "floss",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns or works in a shop that sells flowers and plants",
                    "vi": "một người sở hữu hoặc làm việc trong một cửa hàng bán hoa và cây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells flowers and plants",
                    "vi": "cửa hàng bán hoa và cây"
                },
                "examples": [
                    {
                        "en": "I've ordered some flowers from the florist's.",
                        "vi": "Tôi đã đặt một số hoa từ người bán hoa."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbb4b3ed89464754bf207266ae2a0efc",
        "word": "garden centre",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡɑːdn sentə(r)/",
            "us": "/ˈɡɑːrdn sentər/"
        },
        "nearby": [
            {
                "word": "garden",
                "pos": "noun"
            },
            {
                "word": "garden",
                "pos": "verb"
            },
            {
                "word": "garden centre",
                "pos": "noun"
            },
            {
                "word": "garden city",
                "pos": "noun"
            },
            {
                "word": "garden egg",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place that sells plants, seeds, garden equipment, etc.",
                    "vi": "nơi bán cây trồng, hạt giống, thiết bị làm vườn, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3239e778cc6e4845970cc3059781d265",
        "word": "grocer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡrəʊsə(r)/",
            "us": "/ˈɡrəʊsər/"
        },
        "nearby": [
            {
                "word": "groan with",
                "pos": "phrasal verb"
            },
            {
                "word": "groat",
                "pos": "noun"
            },
            {
                "word": "grocer",
                "pos": "noun"
            },
            {
                "word": "grocery",
                "pos": "noun"
            },
            {
                "word": "grocery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns, manages or works in a shop selling food and other things used in the home",
                    "vi": "một người sở hữu, quản lý hoặc làm việc trong một cửa hàng bán thực phẩm và những thứ khác được sử dụng trong gia đình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells these things",
                    "vi": "một cửa hàng bán những thứ này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4779e671c2504ac192ec55493d994ebe",
        "word": "hardware",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːdweə(r)/",
            "us": "/ˈhɑːrdwer/"
        },
        "nearby": [
            {
                "word": "hardtop",
                "pos": "noun"
            },
            {
                "word": "hard up",
                "pos": "adjective"
            },
            {
                "word": "hardware",
                "pos": "noun"
            },
            {
                "word": "hardware dealer",
                "pos": "noun"
            },
            {
                "word": "hardware store",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the machines and electronic parts in a computer or other electronic system",
                    "vi": "máy móc và các bộ phận điện tử trong máy tính hoặc hệ thống điện tử khác"
                },
                "examples": [
                    {
                        "en": "We supply computer hardware to businesses.",
                        "vi": "Chúng tôi cung cấp phần cứng máy tính cho các doanh nghiệp."
                    },
                    {
                        "en": "The laptop drawing tablet is a very useful piece of hardware.",
                        "vi": "Máy tính bảng vẽ máy tính xách tay là một phần cứng rất hữu ích."
                    },
                    {
                        "en": "This application runs on a wide variety of hardware platforms.",
                        "vi": "Ứng dụng này chạy trên nhiều nền tảng phần cứng."
                    },
                    {
                        "en": "It seems you've got a hardware problem; the disk drive is stuck.",
                        "vi": "Có vẻ như bạn đã gặp sự cố phần cứng; ổ đĩa bị kẹt."
                    }
                ]
            },
            {
                "define": {
                    "en": "tools and equipment that are used in the house and garden",
                    "vi": "dụng cụ và thiết bị được sử dụng trong nhà và vườn"
                },
                "examples": [
                    {
                        "en": "a hardware shop/store",
                        "vi": "một cửa hàng / cửa hàng kim khí"
                    }
                ]
            },
            {
                "define": {
                    "en": "the equipment, machines and vehicles used to do something",
                    "vi": "thiết bị, máy móc và phương tiện được sử dụng để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tanks and other military hardware",
                        "vi": "xe tăng và các khí tài quân sự khác"
                    }
                ]
            }
        ]
    },
    {
        "id": "7091c44ed4b649b9be6252df8a7c9113",
        "word": "kiosk",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkiːɒsk/",
            "us": "/ˈkiːɑːsk/"
        },
        "nearby": [
            {
                "word": "kinswoman",
                "pos": "noun"
            },
            {
                "word": "kiondo",
                "pos": "noun"
            },
            {
                "word": "kiosk",
                "pos": "noun"
            },
            {
                "word": "kip",
                "pos": "noun"
            },
            {
                "word": "kip",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small shop, open at the front, where newspapers, drinks, etc. are sold. In some countries kiosks also sell food and things used in the home.",
                    "vi": "một cửa hàng nhỏ, mở ở mặt tiền, nơi bán báo, đồ uống, v.v. Ở một số quốc gia, các ki-ốt cũng bán thực phẩm và những thứ được sử dụng trong gia đình."
                },
                "examples": [
                    {
                        "en": "I bought a paper from the kiosk across the road.",
                        "vi": "Tôi mua một tờ giấy ở ki-ốt bên kia đường."
                    },
                    {
                        "en": "She stopped at a newspaper kiosk to pick up a copy of ‘Private Eye’.",
                        "vi": "Cô dừng lại ở một ki-ốt bán báo để chọn một cuốn sách 'Private Eye'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small structure in a public area used for providing information, showing advertisements or providing a service, typically via a computer screen",
                    "vi": "một cấu trúc nhỏ trong khu vực công cộng được sử dụng để cung cấp thông tin, hiển thị quảng cáo hoặc cung cấp dịch vụ, thường thông qua màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "a digital information kiosk",
                        "vi": "một kiosk thông tin kỹ thuật số"
                    },
                    {
                        "en": "Passengers can use the touch-screen kiosks to receive a boarding pass.",
                        "vi": "Hành khách có thể sử dụng ki-ốt màn hình cảm ứng để nhận thẻ lên máy bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public phone box",
                    "vi": "hộp điện thoại công cộng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "51ecd7c916364f5db4ac91d928a76619",
        "word": "optician",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɒpˈtɪʃn/",
            "us": "/ɑːpˈtɪʃn/"
        },
        "nearby": [
            {
                "word": "optically",
                "pos": "adverb"
            },
            {
                "word": "opticals",
                "pos": "noun"
            },
            {
                "word": "optician",
                "pos": "noun"
            },
            {
                "word": "optics",
                "pos": "noun"
            },
            {
                "word": "optimal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to examine people’s eyes and to recommend and sell glasses",
                    "vi": "một người có công việc là khám mắt cho mọi người và giới thiệu và bán kính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose job is to make and supply glasses, but who does not test people's eyes",
                    "vi": "một người có công việc là sản xuất và cung cấp kính, nhưng lại không kiểm tra mắt của mọi người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the shop where an optician works",
                    "vi": "cửa hàng nơi một bác sĩ nhãn khoa làm việc"
                },
                "examples": [
                    {
                        "en": "to go to the optician’s",
                        "vi": "đi đến bác sĩ nhãn khoa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who makes lenses, glasses, etc.",
                    "vi": "một người chế tạo thấu kính, mắt kính, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b1067ddf82364a449a2d47f1f7c9e921",
        "word": "outlet",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈaʊtlet/",
            "us": "/ˈaʊtlet/"
        },
        "nearby": [
            {
                "word": "outlaw",
                "pos": "noun"
            },
            {
                "word": "outlay",
                "pos": "noun"
            },
            {
                "word": "outlet",
                "pos": "noun"
            },
            {
                "word": "outlier",
                "pos": "noun"
            },
            {
                "word": "outline",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop or an organization that sells goods made by a particular company or of a particular type",
                    "vi": "một cửa hàng hoặc một tổ chức bán hàng hóa của một công ty cụ thể hoặc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The business has 34 retail outlets in this state alone.",
                        "vi": "Doanh nghiệp có 34 cửa hàng bán lẻ chỉ riêng ở bang này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a shop that sells goods of a particular make at reduced prices",
                    "vi": "một cửa hàng bán hàng hóa của một sản phẩm cụ thể với giá giảm"
                },
                "examples": [
                    {
                        "en": "the Nike outlet in the outlet mall",
                        "vi": "cửa hàng Nike trong trung tâm mua sắm"
                    },
                    {
                        "en": "Here you'll find factory outlets that sell to the public directly.",
                        "vi": "Tại đây, bạn sẽ tìm thấy các cửa hàng của nhà máy bán trực tiếp cho công chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of expressing or making good use of strong feelings, ideas or energy",
                    "vi": "một cách thể hiện hoặc tận dụng tốt những cảm xúc, ý tưởng hoặc năng lượng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "She needed to find an outlet for her many talents and interests.",
                        "vi": "Cô cần tìm ra lối thoát cho nhiều tài năng và sở thích của mình."
                    },
                    {
                        "en": "Sport became the perfect outlet for his aggression.",
                        "vi": "Thể thao trở thành lối thoát hoàn hảo cho sự hiếu chiến của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a pipe or hole through which liquid or gas can flow out",
                    "vi": "một đường ống hoặc lỗ thông qua đó chất lỏng hoặc khí có thể chảy ra"
                },
                "examples": [
                    {
                        "en": "a sewage outlet",
                        "vi": "một đường thoát nước thải"
                    },
                    {
                        "en": "an outlet pipe",
                        "vi": "một đường ống thoát"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device in a wall that you put a plug into (= a small plastic object with two or three metal pins) in order to connect electrical equipment to the power supply of a building",
                    "vi": "một thiết bị trong tường mà bạn cắm phích cắm vào (= một vật nhỏ bằng nhựa có hai hoặc ba chân kim loại) để kết nối thiết bị điện với nguồn điện của tòa nhà"
                },
                "examples": [
                    {
                        "en": "The appliance can be connected to any standard outlet.",
                        "vi": "Thiết bị có thể được kết nối với bất kỳ ổ cắm tiêu chuẩn nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "44f7ecb5adec4b6a9d72408fdf9d6ee6",
        "word": "pharmacist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɑːməsɪst/",
            "us": "/ˈfɑːrməsɪst/"
        },
        "nearby": [
            {
                "word": "pharmaceutical",
                "pos": "adjective"
            },
            {
                "word": "pharmaceutical",
                "pos": "noun"
            },
            {
                "word": "pharmacist",
                "pos": "noun"
            },
            {
                "word": "pharmacological",
                "pos": "adjective"
            },
            {
                "word": "pharmacologist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to prepare medicines and sell or give them to the public in a shop or in a hospital",
                    "vi": "một người có công việc chuẩn bị thuốc và bán hoặc cung cấp cho công chúng trong cửa hàng hoặc trong bệnh viện"
                },
                "examples": [
                    {
                        "en": "We had to wait for the pharmacist to make up her prescription.",
                        "vi": "Chúng tôi phải đợi dược sĩ kê đơn cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a shop that sells medicines",
                    "vi": "cửa hàng bán thuốc"
                },
                "examples": [
                    {
                        "en": "They sell vitamin supplements at the pharmacist's.",
                        "vi": "Họ bán thuốc bổ sung vitamin tại hiệu thuốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "014656d382f5403693d9917838283416",
        "word": "stationer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsteɪʃənə(r)/",
            "us": "/ˈsteɪʃənər/"
        },
        "nearby": [
            {
                "word": "station agent",
                "pos": "noun"
            },
            {
                "word": "stationary",
                "pos": "adjective"
            },
            {
                "word": "stationer",
                "pos": "noun"
            },
            {
                "word": "stationery",
                "pos": "noun"
            },
            {
                "word": "the Stationery Office",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns or manages a shop selling stationery",
                    "vi": "một người sở hữu hoặc quản lý một cửa hàng bán văn phòng phẩm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells stationery",
                    "vi": "cửa hàng bán văn phòng phẩm"
                },
                "examples": [
                    {
                        "en": "Is there a stationer's near here?",
                        "vi": "Có nhà ga nào gần đây không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "80a35e2bfb7540f08e49b8f80d17cb8b",
        "word": "superstore",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsuːpəstɔː(r)/",
            "us": "/ˈsuːpərstɔːr/"
        },
        "nearby": [
            {
                "word": "superstitious",
                "pos": "adjective"
            },
            {
                "word": "superstitiously",
                "pos": "adverb"
            },
            {
                "word": "superstore",
                "pos": "noun"
            },
            {
                "word": "superstructure",
                "pos": "noun"
            },
            {
                "word": "supertanker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large supermarket or a large shop that sells a wide variety of one type of goods",
                    "vi": "một siêu thị rất lớn hoặc một cửa hàng lớn bán nhiều loại hàng hóa khác nhau"
                },
                "examples": [
                    {
                        "en": "a computer superstore",
                        "vi": "một siêu thị máy tính"
                    }
                ]
            }
        ]
    },
    {
        "id": "258412dab2524e44b248d651e2591dd5",
        "word": "betting shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbetɪŋ ʃɒp/",
            "us": "/ˈbetɪŋ ʃɑːp/"
        },
        "nearby": [
            {
                "word": "betterment",
                "pos": "noun"
            },
            {
                "word": "betting",
                "pos": "noun"
            },
            {
                "word": "betting shop",
                "pos": "noun"
            },
            {
                "word": "bettor",
                "pos": "noun"
            },
            {
                "word": "Betty",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop where you can bet on horse races and other competitions",
                    "vi": "một cửa hàng nơi bạn có thể đặt cược vào các cuộc đua ngựa và các cuộc thi khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2edccfc5ce9948ae959c2aa5cfc5a5fa",
        "word": "bookie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʊki/",
            "us": "/ˈbʊki/"
        },
        "nearby": [
            {
                "word": "the Booker Prize",
                "pos": ""
            },
            {
                "word": "book group",
                "pos": "noun"
            },
            {
                "word": "bookie",
                "pos": "noun"
            },
            {
                "word": "book in",
                "pos": "phrasal verb"
            },
            {
                "word": "booking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bookmaker (= a person whose job is to take bets on the result of horse races, etc. and pay out money to people who win)",
                    "vi": "một nhà cái cá cược (= một người có công việc là đặt cược vào kết quả của các cuộc đua ngựa, v.v. và trả tiền cho những người thắng cuộc)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e36d827cef640a0b78b9b9832433734",
        "word": "bookmaking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʊkmeɪkɪŋ/",
            "us": "/ˈbʊkmeɪkɪŋ/"
        },
        "nearby": [
            {
                "word": "booklet",
                "pos": "noun"
            },
            {
                "word": "bookmaker",
                "pos": "noun"
            },
            {
                "word": "bookmaking",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the job or activity of taking bets on the result of horse races, etc. and paying out money to people who win",
                    "vi": "công việc hoặc hoạt động đặt cược vào kết quả của các cuộc đua ngựa, v.v. và trả tiền cho người thắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a84126d295645eb9752922277a2b741",
        "word": "confectioner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈfekʃənə(r)/",
            "us": "/kənˈfekʃənər/"
        },
        "nearby": [
            {
                "word": "confabulation",
                "pos": "noun"
            },
            {
                "word": "confection",
                "pos": "noun"
            },
            {
                "word": "confectioner",
                "pos": "noun"
            },
            {
                "word": "confectioner's custard",
                "pos": "noun"
            },
            {
                "word": "confectioner's sugar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or a business that makes or sells cakes and sweets",
                    "vi": "một người hoặc một doanh nghiệp làm hoặc bán bánh ngọt và đồ ngọt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd742aba2ea34d29ad051af2c6866f00",
        "word": "draper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdreɪpə(r)/",
            "us": "/ˈdreɪpər/"
        },
        "nearby": [
            {
                "word": "drape",
                "pos": "verb"
            },
            {
                "word": "drape",
                "pos": "noun"
            },
            {
                "word": "draper",
                "pos": "noun"
            },
            {
                "word": "drapery",
                "pos": "noun"
            },
            {
                "word": "drastic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns or manages a shop that sells cloth, curtains, etc.",
                    "vi": "một người sở hữu hoặc quản lý một cửa hàng bán vải, rèm cửa, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells cloth, curtains, etc.",
                    "vi": "một cửa hàng bán vải, rèm cửa, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3d98af68c0a74bd699b234c295e8c7de",
        "word": "dry-cleaner’s",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdraɪ ˈkliːnəz/",
            "us": "/ˌdraɪ ˈkliːnərz/"
        },
        "nearby": [
            {
                "word": "dry cell",
                "pos": "noun"
            },
            {
                "word": "dry-clean",
                "pos": "verb"
            },
            {
                "word": "dry-cleaner's",
                "pos": "noun"
            },
            {
                "word": "dry-cleaning",
                "pos": "noun"
            },
            {
                "word": "dry-cure",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop where clothes, curtains, etc. are cleaned, especially with chemicals",
                    "vi": "một cửa hàng nơi quần áo, rèm cửa, vv được làm sạch, đặc biệt là bằng hóa chất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6a2e3809a0b64a31b801bf4a03b02b42",
        "word": "fishmonger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪʃmʌŋɡə(r)/",
            "us": "/ˈfɪʃmɑːŋɡər/"
        },
        "nearby": [
            {
                "word": "fish knife",
                "pos": "noun"
            },
            {
                "word": "fishmeal",
                "pos": "noun"
            },
            {
                "word": "fishmonger",
                "pos": "noun"
            },
            {
                "word": "fishnet",
                "pos": "noun"
            },
            {
                "word": "fish out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to sell fish in a shop",
                    "vi": "một người có công việc là bán cá trong cửa hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells fish",
                    "vi": "một cửa hàng bán cá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "81a0391bd387439dbab639619c54769f",
        "word": "hypermarket",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaɪpəmɑːkɪt/",
            "us": "/ˈhaɪpərmɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "hyperlink",
                "pos": "noun"
            },
            {
                "word": "hyperlocal",
                "pos": "adjective"
            },
            {
                "word": "hypermarket",
                "pos": "noun"
            },
            {
                "word": "hypermetropia",
                "pos": "noun"
            },
            {
                "word": "hypernym",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large shop located outside a town, that sells a wide range of goods",
                    "vi": "một cửa hàng rất lớn nằm bên ngoài thị trấn, bán nhiều loại hàng hóa"
                },
                "examples": [
                    {
                        "en": "The company opened a £15 million hypermarket at Stockton.",
                        "vi": "Công ty đã mở một đại siêu thị trị giá 15 triệu bảng Anh tại Stockton."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab71e4aac9ad403a9caaf91ed11ed837",
        "word": "ironmonger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaɪənmʌŋɡə(r)/",
            "us": "/ˈaɪərnmɑːŋɡər/"
        },
        "nearby": [
            {
                "word": "ironing board",
                "pos": "noun"
            },
            {
                "word": "Ironman",
                "pos": "noun"
            },
            {
                "word": "ironmonger",
                "pos": "noun"
            },
            {
                "word": "ironmongery",
                "pos": "noun"
            },
            {
                "word": "iron out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns or works in a shop selling tools and equipment for the house and garden",
                    "vi": "một người sở hữu hoặc làm việc trong một cửa hàng bán dụng cụ và thiết bị cho nhà và vườn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells tools and equipment for the house and garden",
                    "vi": "cửa hàng bán dụng cụ và thiết bị cho ngôi nhà và khu vườn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ec1c8ce31e66442cb346ae1f97f430fe",
        "word": "launderette",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlɔːndəˈret/",
            "us": "/ˌlɔːndəˈret/"
        },
        "nearby": [
            {
                "word": "launder",
                "pos": "verb"
            },
            {
                "word": "launderer",
                "pos": "noun"
            },
            {
                "word": "launderette",
                "pos": "noun"
            },
            {
                "word": "laundry",
                "pos": "noun"
            },
            {
                "word": "laundry list",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can wash and dry your clothes in machines that you pay to use",
                    "vi": "một nơi mà bạn có thể giặt và làm khô quần áo của mình bằng những chiếc máy mà bạn phải trả tiền để sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "28bbbb3ea43d4139a4531004c4e7358a",
        "word": "liquor store",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪkə stɔː(r)/",
            "us": "/ˈlɪkər stɔːr/"
        },
        "nearby": [
            {
                "word": "liquorice",
                "pos": "noun"
            },
            {
                "word": "liquorice allsorts",
                "pos": "noun"
            },
            {
                "word": "liquor store",
                "pos": "noun"
            },
            {
                "word": "lira",
                "pos": "noun"
            },
            {
                "word": "Lisa",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells alcoholic drinks in bottles and cans to take away",
                    "vi": "cửa hàng bán đồ uống có cồn trong chai và lon mang đi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba0fed03ed1949e6b4e8d169a37fd1c5",
        "word": "megastore",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeɡəstɔː(r)/",
            "us": "/ˈmeɡəstɔːr/"
        },
        "nearby": [
            {
                "word": "megapixel",
                "pos": "noun"
            },
            {
                "word": "megastar",
                "pos": "noun"
            },
            {
                "word": "megastore",
                "pos": "noun"
            },
            {
                "word": "megathermal",
                "pos": "adjective"
            },
            {
                "word": "megaton",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large shop, especially one that sells one type of product, for example computers or furniture",
                    "vi": "một cửa hàng rất lớn, đặc biệt là một cửa hàng bán một loại sản phẩm, ví dụ như máy tính hoặc đồ nội thất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0ce706a79d6471d90693b1fe34b5b6f",
        "word": "off-licence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒf laɪsns/",
            "us": "/ˈɔːf laɪsns/"
        },
        "nearby": [
            {
                "word": "off-label",
                "pos": "adjective"
            },
            {
                "word": "off-label",
                "pos": "adverb"
            },
            {
                "word": "off-licence",
                "pos": "noun"
            },
            {
                "word": "off-limits",
                "pos": "adjective"
            },
            {
                "word": "offline",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells alcoholic drinks in bottles and cans to take away",
                    "vi": "cửa hàng bán đồ uống có cồn trong chai và lon mang đi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "97b2a9e5563645b3b41ec867156021a3",
        "word": "package store",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpækɪdʒ stɔː(r)/",
            "us": "/ˈpækɪdʒ stɔːr/"
        },
        "nearby": [
            {
                "word": "package",
                "pos": "verb"
            },
            {
                "word": "package holiday",
                "pos": "noun"
            },
            {
                "word": "package store",
                "pos": "noun"
            },
            {
                "word": "package tour",
                "pos": "noun"
            },
            {
                "word": "packaging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells alcoholic drinks in bottles and cans to take away",
                    "vi": "cửa hàng bán đồ uống có cồn trong chai và lon mang đi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d45444d1a5474bad92981594bd9c796b",
        "word": "paper shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪpə ʃɒp/",
            "us": "/ˈpeɪpər ʃɑːp/"
        },
        "nearby": [
            {
                "word": "paper-pusher",
                "pos": "noun"
            },
            {
                "word": "paper round",
                "pos": "noun"
            },
            {
                "word": "paper shop",
                "pos": "noun"
            },
            {
                "word": "paper-thin",
                "pos": "adjective"
            },
            {
                "word": "paper tiger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells newspapers, magazines, sweets, etc.",
                    "vi": "cửa hàng bán báo, tạp chí, đồ ngọt, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fc7d26855e994890ad2223ca40616b71",
        "word": "showroom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃəʊruːm/",
            "us": "/ˈʃəʊruːm/"
        },
        "nearby": [
            {
                "word": "showpiece",
                "pos": "noun"
            },
            {
                "word": "showplace",
                "pos": "noun"
            },
            {
                "word": "showroom",
                "pos": "noun"
            },
            {
                "word": "showrooming",
                "pos": "noun"
            },
            {
                "word": "show round",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large shop in which goods for sale, especially cars and electrical goods, are displayed",
                    "vi": "một cửa hàng lớn trưng bày hàng hóa để bán, đặc biệt là ô tô và đồ điện"
                },
                "examples": [
                    {
                        "en": "a car showroom",
                        "vi": "một phòng trưng bày xe hơi"
                    }
                ]
            }
        ]
    },
    {
        "id": "7a135923d7864f8b8a9cd83d04c9623a",
        "word": "stockist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɒkɪst/",
            "us": "/ˈstɑːkɪst/"
        },
        "nearby": [
            {
                "word": "stocking filler",
                "pos": "noun"
            },
            {
                "word": "stock-in-trade",
                "pos": "noun"
            },
            {
                "word": "stockist",
                "pos": "noun"
            },
            {
                "word": "stockjobber",
                "pos": "noun"
            },
            {
                "word": "stockman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop or company that sells a particular product or type of goods",
                    "vi": "một cửa hàng hoặc công ty bán một sản phẩm hoặc loại hàng hóa cụ thể"
                },
                "examples": [
                    {
                        "en": "The paints are available from stockists throughout the UK.",
                        "vi": "Các loại sơn có sẵn từ các kho dự trữ trên khắp Vương quốc Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "877d3779bcb5498b8c568bd80024bcd7",
        "word": "thrift shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθrɪft ʃɒp/",
            "us": "/ˈθrɪft ʃɑːp/"
        },
        "nearby": [
            {
                "word": "thrice",
                "pos": "adverb"
            },
            {
                "word": "thrift",
                "pos": "noun"
            },
            {
                "word": "thrift shop",
                "pos": "noun"
            },
            {
                "word": "thrifty",
                "pos": "adjective"
            },
            {
                "word": "thrill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells clothes and other goods given by people to raise money for a charity",
                    "vi": "cửa hàng bán quần áo và các mặt hàng khác do mọi người quyên góp để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "760a99ca84d8457a89b8b5a9c057570d",
        "word": "tobacconist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/təˈbækənɪst/",
            "us": "/təˈbækənɪst/"
        },
        "nearby": [
            {
                "word": "To Autumn",
                "pos": ""
            },
            {
                "word": "tobacco",
                "pos": "noun"
            },
            {
                "word": "tobacconist",
                "pos": "noun"
            },
            {
                "word": "Tobagan",
                "pos": "noun, adjective"
            },
            {
                "word": "Tobagonian",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns, manages or works in a shop selling cigarettes, tobacco for pipes, etc.",
                    "vi": "một người sở hữu, quản lý hoặc kinh doanh cửa hàng bán thuốc lá điếu, thuốc lào, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop that sells cigarettes, tobacco, etc.",
                    "vi": "một cửa hàng bán thuốc lá điếu, thuốc lào, v.v."
                },
                "examples": [
                    {
                        "en": "There's a tobacconist's on the corner.",
                        "vi": "Có một người bán thuốc lá ở góc phố."
                    }
                ]
            }
        ]
    },
    {
        "id": "b802d519162049f0951f6d84651e9673",
        "word": "wet market",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwet mɑːkɪt/",
            "us": "/ˈwet mɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "wet-look",
                "pos": "adjective"
            },
            {
                "word": "wetly",
                "pos": "adverb"
            },
            {
                "word": "wet market",
                "pos": "noun"
            },
            {
                "word": "wetness",
                "pos": "noun"
            },
            {
                "word": "wet nurse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a market selling fresh meat, fish, vegetables, etc.",
                    "vi": "chợ bán thịt, cá, rau tươi, v.v."
                },
                "examples": [
                    {
                        "en": "Traditional wet markets sell meat that is freshly slaughtered.",
                        "vi": "Các chợ ẩm thực truyền thống bán thịt mới giết mổ."
                    }
                ]
            }
        ]
    }
]