[
    {
        "id": "dadb3f604a76404abdee9406d0684716",
        "word": "book",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/bʊk/",
            "us": "/bʊk/"
        },
        "nearby": [
            {
                "word": "boogie board",
                "pos": "noun"
            },
            {
                "word": "boohoo",
                "pos": "exclamation"
            },
            {
                "word": "book",
                "pos": "noun"
            },
            {
                "word": "book",
                "pos": "verb"
            },
            {
                "word": "bookable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of printed pages that are fastened inside a cover so that you can turn them and read them",
                    "vi": "một tập hợp các trang in được gắn chặt bên trong bìa để bạn có thể lật chúng ra và đọc"
                },
                "examples": [
                    {
                        "en": "His desk was covered with piles of books.",
                        "vi": "Bàn làm việc của anh ta chất đầy sách."
                    },
                    {
                        "en": "hardback/paperback books",
                        "vi": "sách bìa cứng / bìa mềm"
                    },
                    {
                        "en": "a book of short stories",
                        "vi": "một cuốn sách truyện ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written work published in printed or electronic form",
                    "vi": "một tác phẩm viết được xuất bản dưới dạng in hoặc điện tử"
                },
                "examples": [
                    {
                        "en": "to read/write/publish a book",
                        "vi": "để đọc / viết / xuất bản một cuốn sách"
                    },
                    {
                        "en": "reference/children's/library books",
                        "vi": "sách tham khảo / dành cho trẻ em / thư viện"
                    },
                    {
                        "en": "book by somebody a new book by J. K. Rowling",
                        "vi": "sách của ai đó một cuốn sách mới của JK Rowling"
                    },
                    {
                        "en": "book about something a book about wildlife",
                        "vi": "sách về điều gì đó sách về động vật hoang dã"
                    },
                    {
                        "en": "book on something He has written a book on local architecture.",
                        "vi": "cuốn sách về điều gì đó Anh ấy đã viết một cuốn sách về kiến trúc địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of sheets of paper that are fastened together inside a cover and used for writing in",
                    "vi": "một tập hợp các tờ giấy được gắn chặt với nhau bên trong bìa và dùng để viết"
                },
                "examples": [
                    {
                        "en": "an exercise book",
                        "vi": "một cuốn sách bài tập"
                    },
                    {
                        "en": "a notebook",
                        "vi": "quyển sổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of things that are fastened together like a book",
                    "vi": "một tập hợp những thứ được gắn chặt với nhau như một cuốn sách"
                },
                "examples": [
                    {
                        "en": "a book of stamps/tickets/matches",
                        "vi": "một cuốn tem / vé / trận đấu"
                    },
                    {
                        "en": "a chequebook",
                        "vi": "Sổ kiểm tra"
                    }
                ]
            },
            {
                "define": {
                    "en": "the written records of the financial affairs of a business",
                    "vi": "hồ sơ bằng văn bản về các vấn đề tài chính của một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "to do the books (= to check the accounts)",
                        "vi": "để làm sổ sách (= để kiểm tra tài khoản)"
                    },
                    {
                        "en": "You need to go over the books again; there’s a mistake somewhere.",
                        "vi": "Bạn cần phải xem lại các cuốn sách; có sự nhầm lẫn ở đâu đó."
                    },
                    {
                        "en": "She does the books for us.",
                        "vi": "Cô ấy làm những cuốn sách cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of a large written work",
                    "vi": "một phần của một tác phẩm lớn bằng văn bản"
                },
                "examples": [
                    {
                        "en": "the books of the Bible",
                        "vi": "sách kinh thánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of bets made on whether something will happen, somebody will win a race, etc.",
                    "vi": "kỷ lục đặt cược về việc liệu điều gì đó sẽ xảy ra, ai đó sẽ thắng trong cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "They’ve opened a book on who’ll win the Championship.",
                        "vi": "Họ đã mở một cuốn sách về ai sẽ giành chức vô địch."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is pleased/annoyed with you",
                    "vi": "từng nói rằng ai đó hài lòng / khó chịu với bạn"
                },
                "examples": [
                    {
                        "en": "I'm in her good books at the moment because I cleared up the kitchen.",
                        "vi": "Tôi đang ở trong những cuốn sách hay của cô ấy vào lúc này vì tôi đã dọn dẹp nhà bếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to punish somebody for doing something wrong and make them explain their behaviour",
                    "vi": "trừng phạt ai đó vì đã làm điều gì đó sai và bắt họ giải thích hành vi của mình"
                },
                "examples": [
                    {
                        "en": "We will ensure that people who commit fraud are brought to book through the courts.",
                        "vi": "Chúng tôi sẽ đảm bảo rằng những người có hành vi gian lận sẽ bị đưa ra tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "following rules and instructions in a very strict way",
                    "vi": "tuân theo các quy tắc và hướng dẫn một cách rất nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "She always does everything by the book.",
                        "vi": "Cô ấy luôn làm mọi thứ theo cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something because you no longer believe you will be successful or will find a solution",
                    "vi": "ngừng làm điều gì đó bởi vì bạn không còn tin rằng mình sẽ thành công hoặc sẽ tìm ra giải pháp"
                },
                "examples": [
                    {
                        "en": "The police have closed the book on the case (= they have stopped trying to solve it).",
                        "vi": "Cảnh sát đã đóng sổ về vụ án (= họ đã ngừng cố gắng giải quyết nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject or person that you know nothing about",
                    "vi": "một chủ đề hoặc một người mà bạn không biết gì về nó"
                },
                "examples": [
                    {
                        "en": "Nuclear physics is a closed book to most of us.",
                        "vi": "Vật lý hạt nhân là một cuốn sách gần gũi với hầu hết chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change facts or figures dishonestly or illegally",
                    "vi": "thay đổi sự kiện hoặc số liệu một cách không trung thực hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "His accountant had been cooking the books for years.",
                        "vi": "Kế toán của ông đã nấu những cuốn sách trong nhiều năm."
                    },
                    {
                        "en": "Someone was cooking the books.",
                        "vi": "Ai đó đang nấu những cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not form an opinion about somebody/something from their appearance only",
                    "vi": "được sử dụng để nói rằng bạn không nên hình thành ý kiến về ai đó / điều gì đó chỉ từ vẻ ngoài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "every available method, whether it is honest or not",
                    "vi": "mọi phương pháp có sẵn, cho dù nó có trung thực hay không"
                },
                "examples": [
                    {
                        "en": "He'll try every trick in the book to stop you from winning.",
                        "vi": "Anh ấy sẽ thử mọi thủ thuật trong sách để ngăn bạn chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are giving your opinion",
                    "vi": "được sử dụng khi bạn đưa ra ý kiến của mình"
                },
                "examples": [
                    {
                        "en": "That's cheating in my book.",
                        "vi": "Đó là gian lận trong cuốn sách của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to be) on an organization’s list, for example of people who are available for a particular type of work",
                    "vi": "(được) trong danh sách của một tổ chức, ví dụ như những người sẵn sàng cho một loại công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "We have very few nurses on our books at the moment.",
                        "vi": "Chúng tôi có rất ít y tá trên sổ sách của chúng tôi vào lúc này."
                    },
                    {
                        "en": "Most of the houses on our books are in the north of the city.",
                        "vi": "Hầu hết các ngôi nhà trên sách của chúng tôi đều ở phía bắc thành phố."
                    },
                    {
                        "en": "We have fifty people on the books.",
                        "vi": "Chúng tôi có năm mươi người trên các cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you describe somebody or their life as an open book, you mean that you can easily understand them and know everything about them",
                    "vi": "nếu bạn mô tả ai đó hoặc cuộc sống của họ như một cuốn sách mở, bạn có nghĩa là bạn có thể dễ dàng hiểu họ và biết mọi thứ về họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand easily what somebody is thinking or feeling",
                    "vi": "để hiểu một cách dễ dàng những gì ai đó đang nghĩ hoặc cảm thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be convenient or useful for you/somebody",
                    "vi": "để thuận tiện hoặc hữu ích cho bạn / ai đó"
                },
                "examples": [
                    {
                        "en": "Well, if you’re honest and hard-working, that suits our book.",
                        "vi": "Chà, nếu bạn trung thực và chăm chỉ, điều đó phù hợp với cuốn sách của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy somebody’s behaviour and do things in the same way that they do, because they are successful",
                    "vi": "sao chép hành vi của ai đó và làm mọi việc theo cách giống như cách họ làm, bởi vì họ đã thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to punish somebody who has committed an offence as severely as possible",
                    "vi": "trừng phạt ai đó đã phạm tội càng nghiêm khắc càng tốt"
                },
                "examples": [
                    {
                        "en": "‘Get this man down to the station and throw the book at him!’ yelled Curtis.",
                        "vi": "Đưa người đàn ông này xuống ga và ném cuốn sách vào anh ta!' Curtis hét lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "e47289a4a64646af9f1849f40544016a",
        "word": "description",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dɪˈskrɪpʃn/",
            "us": "/dɪˈskrɪpʃn/"
        },
        "nearby": [
            {
                "word": "describable",
                "pos": "adjective"
            },
            {
                "word": "describe",
                "pos": "verb"
            },
            {
                "word": "description",
                "pos": "noun"
            },
            {
                "word": "descriptive",
                "pos": "adjective"
            },
            {
                "word": "descriptor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing or speech that says what somebody/something is like; the act of writing or saying in words what somebody/something is like",
                    "vi": "một đoạn văn bản hoặc bài phát biểu nói về ai đó / điều gì đó như thế nào; hành động viết hoặc nói bằng lời rằng ai đó / cái gì đó giống như thế nào"
                },
                "examples": [
                    {
                        "en": "Follow the link below for a more detailed description.",
                        "vi": "Theo liên kết bên dưới để có mô tả chi tiết hơn."
                    },
                    {
                        "en": "description of somebody/something a brief description of the software",
                        "vi": "mô tả của ai đó / cái gì đó mô tả ngắn gọn về phần mềm"
                    },
                    {
                        "en": "The name means ‘no trees’ and it is an accurate description of the island.",
                        "vi": "Tên có nghĩa là 'không có cây' và nó là một mô tả chính xác về hòn đảo."
                    },
                    {
                        "en": "Police have issued a description of the gunman.",
                        "vi": "Cảnh sát đã đưa ra mô tả về tay súng."
                    },
                    {
                        "en": "This is a film that defies description (= is difficult or impossible to describe).",
                        "vi": "Đây là một bộ phim bất chấp miêu tả (= khó hoặc không thể miêu tả)."
                    },
                    {
                        "en": "the novelist’s powers of description",
                        "vi": "quyền năng miêu tả của tiểu thuyết gia"
                    },
                    {
                        "en": "beyond description a personal pain that goes beyond description (= is too great to express in words)",
                        "vi": "vượt ra ngoài mô tả một nỗi đau cá nhân vượt ra ngoài mô tả (= quá tuyệt để diễn tả bằng lời)"
                    }
                ]
            },
            {
                "define": {
                    "en": "of some, etc. type",
                    "vi": "của một số loại, v.v."
                },
                "examples": [
                    {
                        "en": "In the bay were boats of every description.",
                        "vi": "Trong vịnh là những chiếc thuyền của mọi mô tả."
                    },
                    {
                        "en": "There were flying machines of all descriptions whizzing about.",
                        "vi": "Có những cỗ máy bay của tất cả các mô tả đang quay cuồng."
                    },
                    {
                        "en": "Their money came from trade of some description.",
                        "vi": "Tiền của họ đến từ buôn bán một số mô tả."
                    },
                    {
                        "en": "The trunk was full of medals, coins and things of that description.",
                        "vi": "Chiếc hòm chứa đầy huy chương, tiền xu và những thứ mô tả như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be like a particular person or thing",
                    "vi": "giống một người hoặc một vật cụ thể"
                },
                "examples": [
                    {
                        "en": "A child answering the description of the missing boy was found safe and well in London yesterday.",
                        "vi": "Một đứa trẻ trả lời mô tả về cậu bé mất tích đã được tìm thấy an toàn và khỏe mạnh ở London ngày hôm qua."
                    },
                    {
                        "en": "We're all looking for quick, healthy meals, and pasta fits this description.",
                        "vi": "Tất cả chúng ta đều đang tìm kiếm những bữa ăn nhanh chóng, lành mạnh và mì ống phù hợp với mô tả này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be too extreme, horrible, etc. to believe/describe",
                    "vi": "quá cực đoan, khủng khiếp, v.v. để tin / mô tả"
                },
                "examples": [
                    {
                        "en": "It beggars belief how things could have got this bad.",
                        "vi": "Những người ăn xin tin rằng làm thế nào mọi thứ có thể trở nên tồi tệ như thế này."
                    }
                ]
            }
        ]
    },
    {
        "id": "e58bddbe6ca44de2a639a0ec08f49872",
        "word": "letter",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈletə(r)/",
            "us": "/ˈletər/"
        },
        "nearby": [
            {
                "word": "let-out",
                "pos": "noun"
            },
            {
                "word": "let's",
                "pos": "short form"
            },
            {
                "word": "letter",
                "pos": "noun"
            },
            {
                "word": "letter",
                "pos": "verb"
            },
            {
                "word": "letter bomb",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written, typed or printed message that is put in an envelope or attached to an email and sent to somebody",
                    "vi": "một tin nhắn bằng văn bản, đánh máy hoặc in được để trong phong bì hoặc đính kèm vào email và gửi cho ai đó"
                },
                "examples": [
                    {
                        "en": "to write/send (somebody) a letter",
                        "vi": "để viết / gửi (ai đó) một bức thư"
                    },
                    {
                        "en": "to receive/get a letter",
                        "vi": "để nhận / nhận một lá thư"
                    },
                    {
                        "en": "(British English) to post a letter",
                        "vi": "(Anh Anh) để đăng một bức thư"
                    },
                    {
                        "en": "(North American English) to mail a letter",
                        "vi": "(Tiếng Anh Bắc Mỹ) để gửi một lá thư"
                    },
                    {
                        "en": "a thank-you/resignation/rejection letter",
                        "vi": "một lá thư cảm ơn / từ chức / từ chối"
                    },
                    {
                        "en": "letter to somebody In a letter to members, the Chairman explained the changes.",
                        "vi": "thư cho ai đó Trong thư gửi các thành viên, Chủ tịch giải thích những thay đổi."
                    },
                    {
                        "en": "I wrote a letter to the editor of our local paper.",
                        "vi": "Tôi đã viết một lá thư cho người biên tập tờ báo địa phương của chúng tôi."
                    },
                    {
                        "en": "letter from somebody You may need a letter from your doctor.",
                        "vi": "thư từ ai đó Bạn có thể cần thư từ bác sĩ của bạn."
                    },
                    {
                        "en": "a letter of something a letter of recommendation/complaint/apology",
                        "vi": "thư giới thiệu / khiếu nại / xin lỗi"
                    },
                    {
                        "en": "by letter You will be notified by letter.",
                        "vi": "bằng thư Bạn sẽ được thông báo bằng thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or printed sign representing a sound used in speech",
                    "vi": "một ký hiệu viết hoặc in đại diện cho một âm thanh được sử dụng trong lời nói"
                },
                "examples": [
                    {
                        "en": "‘B’ is the second letter of the alphabet.",
                        "vi": "B' là chữ cái thứ hai của bảng chữ cái."
                    },
                    {
                        "en": "How many letters are in the Greek alphabet?",
                        "vi": "Có bao nhiêu chữ cái trong bảng chữ cái Hy Lạp?"
                    },
                    {
                        "en": "the letter A/B/C",
                        "vi": "chữ cái A / B / C"
                    },
                    {
                        "en": "I'm thinking of a word that begins with the letter M.",
                        "vi": "Tôi đang nghĩ về một từ bắt đầu bằng chữ M."
                    },
                    {
                        "en": "in… letters She typed the word ‘HISTORY’ in capital letters.",
                        "vi": "bằng… chữ cái Cô gõ chữ 'HISTORY' bằng chữ in hoa."
                    },
                    {
                        "en": "The slogan is printed in bold letters across the top.",
                        "vi": "Khẩu hiệu được in đậm chữ ngang trên cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sign in the shape of a letter that is sewn onto clothes to show that a person plays in a school or college sports team",
                    "vi": "một dấu hiệu dưới dạng một chữ cái được may trên quần áo để cho thấy một người chơi trong đội thể thao của trường hoặc đại học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the exact words of a law or rule rather than its general meaning",
                    "vi": "những từ chính xác của một luật hoặc quy tắc hơn là ý nghĩa chung của nó"
                },
                "examples": [
                    {
                        "en": "They insist on sticking to the letter of the law.",
                        "vi": "Họ nhất quyết bám sát luật lệ."
                    },
                    {
                        "en": "We might be guilty of slightly bending the letter of the law.",
                        "vi": "Chúng tôi có thể phạm tội khi hơi bẻ cong văn bản của luật pháp."
                    },
                    {
                        "en": "In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her.",
                        "vi": "Bất chấp những khó khăn mà nó sẽ gây ra cho gia đình cô, thẩm phán vẫn tuân theo luật lệ và bỏ tù cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing/following exactly what somebody/something says, paying attention to every detail",
                    "vi": "làm / làm theo chính xác những gì ai đó / điều gì đó nói, chú ý đến từng chi tiết"
                },
                "examples": [
                    {
                        "en": "I followed your instructions to the letter.",
                        "vi": "Tôi đã làm theo hướng dẫn của bạn đến bức thư."
                    }
                ]
            }
        ]
    },
    {
        "id": "5aeb060e82064159ba25e12064a7a832",
        "word": "line",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/laɪn/",
            "us": "/laɪn/"
        },
        "nearby": [
            {
                "word": "Lindow Man",
                "pos": ""
            },
            {
                "word": "Lindsey",
                "pos": ""
            },
            {
                "word": "line",
                "pos": "noun"
            },
            {
                "word": "line",
                "pos": "verb"
            },
            {
                "word": "lineage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, thin mark on a surface",
                    "vi": "một vết dài, mỏng trên bề mặt"
                },
                "examples": [
                    {
                        "en": "a straight/solid/dotted/dashed line",
                        "vi": "một đường thẳng / liền nét / chấm / đứt nét"
                    },
                    {
                        "en": "a wavy/diagonal line",
                        "vi": "một đường lượn sóng / đường chéo"
                    },
                    {
                        "en": "a vertical/horizontal line",
                        "vi": "một đường dọc / ngang"
                    },
                    {
                        "en": "parallel lines",
                        "vi": "những đường thẳng song song"
                    },
                    {
                        "en": "Draw a thick black line across the page.",
                        "vi": "Vẽ một đường đen dày trên trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, thin mark on the ground to show the limit or border of something, especially of a playing area in some sports",
                    "vi": "một dấu dài và mảnh trên mặt đất để hiển thị giới hạn hoặc đường viền của một thứ gì đó, đặc biệt là khu vực chơi trong một số môn thể thao"
                },
                "examples": [
                    {
                        "en": "The first to cross the line wins the race.",
                        "vi": "Người đầu tiên vượt qua vạch chiến thắng cuộc đua."
                    },
                    {
                        "en": "They were all waiting on the starting line.",
                        "vi": "Tất cả đều đang đợi ở vạch xuất phát."
                    },
                    {
                        "en": "She crossed the centre line and hit an oncoming truck.",
                        "vi": "Cô ấy băng qua vạch giữa và tông vào một chiếc xe tải đang chạy tới."
                    },
                    {
                        "en": "over/across the line The ball was over the line.",
                        "vi": "over / ngang đường Bóng đã qua đường biên ngang."
                    },
                    {
                        "en": "behind the line Your feet must be behind the line when you serve (= in tennis).",
                        "vi": "phía sau dây Chân của bạn phải ở phía sau vạch khi bạn giao bóng (= trong quần vợt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark like a line on somebody’s skin that people usually get as they get older",
                    "vi": "một vết giống như một đường trên da của ai đó mà mọi người thường nhận được khi họ già đi"
                },
                "examples": [
                    {
                        "en": "He has fine lines around his eyes.",
                        "vi": "Anh ấy có nếp nhăn quanh mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row of people or things next to each other or behind each other",
                    "vi": "một hàng người hoặc vật ở cạnh nhau hoặc phía sau nhau"
                },
                "examples": [
                    {
                        "en": "They formed a line and marched forward.",
                        "vi": "Họ xếp thành một đội hình và tiến về phía trước."
                    },
                    {
                        "en": "in a line The children all stood in a line.",
                        "vi": "in a line Tất cả trẻ em đứng thành một hàng."
                    },
                    {
                        "en": "line of something They were stuck in a line of traffic.",
                        "vi": "dòng thứ gì đó Họ đã bị mắc kẹt trong một dòng xe cộ."
                    },
                    {
                        "en": "a straight/long line of trees",
                        "vi": "một hàng cây dài / thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a queue of people",
                    "vi": "một hàng người"
                },
                "examples": [
                    {
                        "en": "A line formed at each teller window.",
                        "vi": "Một dòng được hình thành tại mỗi cửa sổ giao dịch viên."
                    },
                    {
                        "en": "in line to stand/wait in line",
                        "vi": "xếp hàng để đứng / xếp hàng chờ"
                    },
                    {
                        "en": "If you want a ticket, get in line.",
                        "vi": "Nếu bạn muốn có vé, hãy xếp hàng."
                    },
                    {
                        "en": "line for something There's a line for the women's bathroom.",
                        "vi": "dòng cho một cái gì đó Có một dòng cho phòng tắm dành cho phụ nữ."
                    },
                    {
                        "en": "They have to stand in line for groceries.",
                        "vi": "Họ phải đứng xếp hàng mua hàng tạp hóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a phone connection; a particular phone number",
                    "vi": "kết nối điện thoại; một số điện thoại cụ thể"
                },
                "examples": [
                    {
                        "en": "The phone lines were jammed (= very busy) with people calling to complain.",
                        "vi": "Đường dây điện thoại bị kẹt (= rất bận) với những người gọi đến để phàn nàn."
                    },
                    {
                        "en": "I tried to call but the line was busy.",
                        "vi": "Tôi cố gọi nhưng đường dây bận."
                    },
                    {
                        "en": "I was talking to John when the line suddenly went dead.",
                        "vi": "Tôi đang nói chuyện với John thì đường dây đột ngột tắt."
                    },
                    {
                        "en": "Lines are open from 7.30 am until midnight seven days a week.",
                        "vi": "Đường dây mở cửa từ 7:30 sáng đến nửa đêm bảy ngày trong tuần."
                    },
                    {
                        "en": "If you hold the line (= stay on the phone and wait), I'll see if she is available.",
                        "vi": "Nếu bạn giữ máy (= ở lại điện thoại và đợi), tôi sẽ xem cô ấy có rảnh không."
                    },
                    {
                        "en": "on the line It's your mother on the line.",
                        "vi": "trên đường dây Đó là mẹ của bạn trên đường dây."
                    },
                    {
                        "en": "Your bill includes line rental.",
                        "vi": "Hóa đơn của bạn bao gồm tiền thuê đường truyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a railway track or other transport route; a section of a transport system or route",
                    "vi": "đường ray xe lửa hoặc các tuyến đường vận tải khác; một phần của hệ thống giao thông hoặc tuyến đường"
                },
                "examples": [
                    {
                        "en": "The train was delayed because a tree had fallen across the line.",
                        "vi": "Chuyến tàu bị hoãn vì một cây đổ chắn ngang đường."
                    },
                    {
                        "en": "a rail line",
                        "vi": "một tuyến đường sắt"
                    },
                    {
                        "en": "(British English also) a railway line",
                        "vi": "(Anh cũng có tiếng Anh) một tuyến đường sắt"
                    },
                    {
                        "en": "the East Coast line",
                        "vi": "đường bờ biển phía đông"
                    },
                    {
                        "en": "We got off the bus near the end of the line at San Gerardo.",
                        "vi": "Chúng tôi xuống xe buýt gần cuối hàng ở San Gerardo."
                    },
                    {
                        "en": "Streetcar lines carried passengers to ever more distant areas of the city.",
                        "vi": "Các tuyến xe điện đã đưa hành khách đến những khu vực xa xôi hơn bao giờ hết của thành phố."
                    },
                    {
                        "en": "on a line We live on the Northern Line.",
                        "vi": "trên một dòng Chúng tôi sống trên Dòng phía Bắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the direction that somebody/something is moving or located in",
                    "vi": "hướng mà ai đó / cái gì đó đang di chuyển hoặc đang ở"
                },
                "examples": [
                    {
                        "en": "in a line Just keep going in a straight line.",
                        "vi": "trên một đường thẳng Chỉ cần tiếp tục đi trên một đường thẳng."
                    },
                    {
                        "en": "The town is in a direct line between London and the coast.",
                        "vi": "Thị trấn nằm trên một đường thẳng giữa Luân Đôn và bờ biển."
                    },
                    {
                        "en": "line of something Be careful to stay out of the line of fire (= the direction somebody is shooting in).",
                        "vi": "dòng gì đó Hãy cẩn thận tránh xa vùng lửa (= hướng ai đó đang bắn vào)."
                    },
                    {
                        "en": "They followed the line of the river for three miles.",
                        "vi": "Họ đi theo dòng sông trong ba dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a route from one place to another especially when it is used for a particular purpose",
                    "vi": "một tuyến đường từ nơi này đến nơi khác, đặc biệt là khi nó được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Their aim was to block guerrilla supply lines.",
                        "vi": "Mục đích của họ là chặn đường tiếp tế của quân du kích."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row of words on a page or the empty space where they can be written; the words of a song or poem or other piece of writing",
                    "vi": "một hàng từ trên một trang hoặc khoảng trống nơi chúng có thể được viết; lời của một bài hát hoặc bài thơ hoặc đoạn văn khác"
                },
                "examples": [
                    {
                        "en": "Look at line 5 of the text.",
                        "vi": "Nhìn vào dòng 5 của văn bản."
                    },
                    {
                        "en": "Write the title of your essay on the top line.",
                        "vi": "Viết tiêu đề bài luận của bạn ở dòng trên cùng."
                    },
                    {
                        "en": "I can only remember the first two lines of that song.",
                        "vi": "Tôi chỉ có thể nhớ hai dòng đầu tiên của bài hát đó."
                    },
                    {
                        "en": "She quoted a few lines of Shakespeare.",
                        "vi": "Cô ấy đã trích dẫn một vài dòng của Shakespeare."
                    },
                    {
                        "en": "A team of programmers wrote 200 000 lines of code (= computer programming language).",
                        "vi": "Một nhóm lập trình viên đã viết 200 000 dòng mã (= ngôn ngữ lập trình máy tính)."
                    },
                    {
                        "en": "Avoid a line break (= starting a new line) in the middle of a word.",
                        "vi": "Tránh ngắt dòng (= bắt đầu một dòng mới) ở giữa một từ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the words spoken by an actor in a play or film",
                    "vi": "những lời diễn viên nói trong một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "to learn your lines",
                        "vi": "để học lời thoại của bạn"
                    },
                    {
                        "en": "I keep forgetting my lines.",
                        "vi": "Tôi tiếp tục quên lời thoại của mình."
                    },
                    {
                        "en": "The way she delivers the line is hilarious.",
                        "vi": "Cách cô ấy giao hàng thật vui nhộn."
                    },
                    {
                        "en": "line from something He quoted a line from the film ‘Casablanca’.",
                        "vi": "dòng từ cái gì đó Anh ấy đã trích dẫn một dòng trong bộ phim 'Casablanca'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a punishment in which a child has to write out a particular sentence a number of times",
                    "vi": "một hình phạt trong đó một đứa trẻ phải viết ra một câu cụ thể nhiều lần"
                },
                "examples": [
                    {
                        "en": "The teacher gave me 100 lines.",
                        "vi": "Cô giáo cho tôi 100 dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a remark, especially when somebody says it to achieve a particular purpose",
                    "vi": "một nhận xét, đặc biệt là khi ai đó nói rằng nó để đạt được một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Don't give me that line about having to work late again.",
                        "vi": "Đừng đưa cho tôi dòng đó về việc phải làm việc muộn một lần nữa."
                    },
                    {
                        "en": "(British English) That's the worst chat-up line I've ever heard.",
                        "vi": "(Anh Anh) Đó là dòng trò chuyện tồi tệ nhất mà tôi từng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long piece of rope, string, etc., especially when it is used for a particular purpose",
                    "vi": "một đoạn dây dài, dây, v.v., đặc biệt khi nó được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "They dropped the sails and threw a line to a man on the dock.",
                        "vi": "Họ thả buồm xuống và ném dây chuyền cho một người đàn ông trên bến tàu."
                    },
                    {
                        "en": "on the line Towels were hanging on the line (= clothes line).",
                        "vi": "on the line Khăn được treo trên dây (= dây phơi quần áo)."
                    },
                    {
                        "en": "He had a fish on his line.",
                        "vi": "Anh ta có một con cá trên dây của mình."
                    },
                    {
                        "en": "150 feet of nylon line",
                        "vi": "150 feet dây nylon"
                    }
                ]
            },
            {
                "define": {
                    "en": "a pipe or thick wire that carries water, gas or electricity from one place to another",
                    "vi": "một đường ống hoặc dây dày dẫn nước, khí đốt hoặc điện từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "water/gas/sewage lines",
                        "vi": "đường nước / khí đốt / nước thải"
                    },
                    {
                        "en": "Telephone lines were brought down in the storm.",
                        "vi": "Đường dây điện thoại bị đứt trong cơn bão."
                    },
                    {
                        "en": "There were two fuel lines coming into the engine.",
                        "vi": "Có hai đường nhiên liệu đi vào động cơ."
                    },
                    {
                        "en": "The telegraph lines connecting the two cities had been cut.",
                        "vi": "Các đường dây điện báo nối hai thành phố đã bị cắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "an imaginary limit or border between one place or thing and another",
                    "vi": "một giới hạn tưởng tượng hoặc biên giới giữa địa điểm hoặc sự vật này với nơi khác"
                },
                "examples": [
                    {
                        "en": "a district/county line",
                        "vi": "một tuyến quận / huyện"
                    },
                    {
                        "en": "lines of longitude and latitude",
                        "vi": "đường kinh độ và vĩ độ"
                    },
                    {
                        "en": "across a line He was convicted of illegally importing weapons across state lines.",
                        "vi": "qua đường dây Anh ta bị kết tội nhập khẩu trái phép vũ khí qua các đường dây của bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "the division between one area of thought or behaviour and another or between one group of people and another",
                    "vi": "sự phân chia giữa lĩnh vực suy nghĩ hoặc hành vi này với lĩnh vực khác hoặc giữa nhóm người này với nhóm người khác"
                },
                "examples": [
                    {
                        "en": "Mass consumption blurred the lines of class distinction.",
                        "vi": "Tiêu dùng hàng loạt đã làm mờ ranh giới của sự phân biệt giai cấp."
                    },
                    {
                        "en": "We want to cut across lines of race, sex and religion.",
                        "vi": "Chúng tôi muốn vượt qua ranh giới chủng tộc, giới tính và tôn giáo."
                    },
                    {
                        "en": "Music offers a way to cross cultural lines.",
                        "vi": "Âm nhạc cung cấp một cách để vượt qua các dòng văn hóa."
                    },
                    {
                        "en": "line between A and B There is a fine line between informing the public and alarming them.",
                        "vi": "ranh giới giữa A và B Có một ranh giới nhỏ giữa việc thông báo cho công chúng và báo động cho họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attitude or a belief, especially one that somebody states publicly",
                    "vi": "một thái độ hoặc một niềm tin, đặc biệt là một thái độ mà ai đó tuyên bố công khai"
                },
                "examples": [
                    {
                        "en": "The company line is that discrimination in any form is not tolerated.",
                        "vi": "Đường lối của công ty là không dung thứ cho sự phân biệt đối xử dưới mọi hình thức."
                    },
                    {
                        "en": "line on something He supported the official line on education.",
                        "vi": "dòng về điều gì đó Anh ấy ủng hộ dòng chính thức về giáo dục."
                    },
                    {
                        "en": "The government is taking a firm line on terrorism.",
                        "vi": "Chính phủ đang có quan điểm kiên quyết đối với chủ nghĩa khủng bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a method or way of doing or thinking about something",
                    "vi": "một phương pháp hoặc cách làm hoặc suy nghĩ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "His research follows quite different lines.",
                        "vi": "Nghiên cứu của ông đi theo các dòng khá khác nhau."
                    },
                    {
                        "en": "line of something I don't follow your line of reasoning.",
                        "vi": "dòng gì đó tôi không theo dòng lý luận của bạn."
                    },
                    {
                        "en": "a line of thought/thinking",
                        "vi": "một dòng suy nghĩ / suy nghĩ"
                    },
                    {
                        "en": "She decided to try a different line of argument (= way of persuading somebody of something).",
                        "vi": "Cô ấy quyết định thử một cách lập luận khác (= cách thuyết phục ai đó về điều gì đó)."
                    },
                    {
                        "en": "somebody’s first line of attack/defence",
                        "vi": "tuyến tấn công / phòng thủ đầu tiên của ai đó"
                    },
                    {
                        "en": "The police are pursuing a new line of inquiry (= way of finding out information).",
                        "vi": "Cảnh sát đang theo đuổi một đường điều tra mới (= cách tìm hiểu thông tin)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of people, things or events that follow one another in time",
                    "vi": "một loạt người, sự vật hoặc sự kiện nối tiếp nhau trong thời gian"
                },
                "examples": [
                    {
                        "en": "to pass something down through the male/female line",
                        "vi": "để chuyển một cái gì đó xuống qua ranh giới nam / nữ"
                    },
                    {
                        "en": "line of something She came from a long line of doctors.",
                        "vi": "dòng thứ gì đó Cô ấy đến từ một hàng dài bác sĩ."
                    },
                    {
                        "en": "This novel is the latest in a long line of thrillers that he has written.",
                        "vi": "Cuốn tiểu thuyết này là cuốn tiểu thuyết mới nhất trong một bộ dài tập kinh dị mà ông đã viết."
                    },
                    {
                        "en": "That was the first in a whole line of mistakes and bad decisions.",
                        "vi": "Đó là lần đầu tiên trong toàn bộ hàng loạt sai lầm và quyết định tồi tệ."
                    },
                    {
                        "en": "line (from somebody/something) (to somebody/something) The book traces a historical line from Beethoven to the present day.",
                        "vi": "dòng (from somebody / something) (to somebody / something) Cuốn sách vạch một dòng lịch sử từ Beethoven cho đến ngày nay."
                    },
                    {
                        "en": "down the line The muddle seems to have happened further down the line.",
                        "vi": "xuống dòng Sự lộn xộn dường như đã xảy ra ở phía dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of people in order of importance",
                    "vi": "một loạt người theo thứ tự quan trọng"
                },
                "examples": [
                    {
                        "en": "line of something a line of command",
                        "vi": "dòng gì đó một dòng lệnh"
                    },
                    {
                        "en": "There is some benefit to having a clear line of authority.",
                        "vi": "Có một số lợi ích khi có một đường quyền rõ ràng."
                    },
                    {
                        "en": "down the line (from somebody/something) Orders came down the line from the very top.",
                        "vi": "xuống dòng (từ ai đó / cái gì đó) Các đơn đặt hàng xuống dòng từ trên cùng."
                    },
                    {
                        "en": "in line (to somebody/something) He is second in line to the chairman.",
                        "vi": "trong hàng (với ai đó / cái gì đó) Anh ấy đứng hàng thứ hai sau chủ tịch."
                    },
                    {
                        "en": "to be next in line to the throne",
                        "vi": "xếp hàng tiếp theo để lên ngôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the edge, outline or shape of somebody/something",
                    "vi": "góc cạnh, đường viền hoặc hình dạng của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He traced the line of her jaw with his finger.",
                        "vi": "Anh dùng ngón tay lần theo đường viền hàm của cô."
                    },
                    {
                        "en": "a beautiful sports car with sleek lines",
                        "vi": "một chiếc xe thể thao đẹp với những đường nét bóng bẩy"
                    },
                    {
                        "en": "I prefer simple lines in skirts and trousers.",
                        "vi": "Tôi thích những đường đơn giản trong váy và quần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of making something, in which the product moves from one worker to the next until it is finished",
                    "vi": "một hệ thống chế tạo thứ gì đó, trong đó sản phẩm chuyển từ công nhân này sang công nhân khác cho đến khi hoàn thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type or area of business, activity or interest",
                    "vi": "một loại hoặc lĩnh vực kinh doanh, hoạt động hoặc sở thích"
                },
                "examples": [
                    {
                        "en": "line of something My line of work pays pretty well.",
                        "vi": "dòng thứ gì đó Dòng công việc của tôi trả lương khá cao."
                    },
                    {
                        "en": "What line of business are they in?",
                        "vi": "Ngành nghề kinh doanh của họ là gì?"
                    },
                    {
                        "en": "in the… line You can't do much in the art line without training.",
                        "vi": "trong dòng… Bạn không thể làm gì nhiều trong lĩnh vực nghệ thuật nếu không được đào tạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of product",
                    "vi": "một loại sản phẩm"
                },
                "examples": [
                    {
                        "en": "Some lines sell better than others.",
                        "vi": "Một số dòng bán chạy hơn những dòng khác."
                    },
                    {
                        "en": "new product lines",
                        "vi": "dòng sản phẩm mới"
                    },
                    {
                        "en": "line in something We are starting a new line in casual clothes.",
                        "vi": "hàng trong một cái gì đó Chúng tôi đang bắt đầu một dòng mới trong quần áo bình thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company that provides transport for people or goods",
                    "vi": "một công ty cung cấp dịch vụ vận chuyển cho người hoặc hàng hóa"
                },
                "examples": [
                    {
                        "en": "a shipping/bus line",
                        "vi": "một tuyến vận chuyển / xe buýt"
                    },
                    {
                        "en": "the White Star Line",
                        "vi": "đường ngôi sao trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a row or series of military defences where the soldiers are fighting during a war",
                    "vi": "một hàng hoặc một loạt các tuyến phòng thủ quân sự nơi những người lính đang chiến đấu trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "They were trapped behind enemy lines (= in the area controlled by the enemy).",
                        "vi": "Họ bị mắc kẹt sau phòng tuyến của kẻ thù (= trong khu vực do kẻ thù kiểm soát)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of cocaine that is spread out in a thin line, ready to take",
                    "vi": "một lượng cocaine được dàn thành một đường mỏng, sẵn sàng để lấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "connected with the income that a company receives and the costs it has to pay in its daily business, which affect the profit it makes",
                    "vi": "liên quan đến thu nhập mà một công ty nhận được và chi phí mà công ty phải trả trong hoạt động kinh doanh hàng ngày của mình, điều này ảnh hưởng đến lợi nhuận mà công ty tạo ra"
                },
                "examples": [
                    {
                        "en": "All these costs are above the line and directly hit profits.",
                        "vi": "Tất cả những chi phí này đều vượt quá giới hạn và đánh trực tiếp vào lợi nhuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with advertising in the mass media",
                    "vi": "kết nối với quảng cáo trên các phương tiện thông tin đại chúng"
                },
                "examples": [
                    {
                        "en": "They planned an advertising campaign with both above-the-line and social media components.",
                        "vi": "Họ đã lên kế hoạch cho một chiến dịch quảng cáo với cả các thành phần trên mạng và mạng xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "at some point during an activity or a process",
                    "vi": "tại một số thời điểm trong một hoạt động hoặc một quá trình"
                },
                "examples": [
                    {
                        "en": "Somewhere along the line a large amount of money went missing.",
                        "vi": "Ở đâu đó dọc theo đường dây, một số tiền lớn đã bị mất tích."
                    },
                    {
                        "en": "We'll make a decision on that further down the line.",
                        "vi": "Chúng tôi sẽ đưa ra quyết định về vấn đề đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the way that is mentioned",
                    "vi": "theo cách được đề cập"
                },
                "examples": [
                    {
                        "en": "The new system will operate along the same lines as the old one.",
                        "vi": "Hệ thống mới sẽ hoạt động cùng dòng với hệ thống cũ."
                    },
                    {
                        "en": "They voted along class lines.",
                        "vi": "Họ đã bỏ phiếu dọc theo các hàng trong lớp."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar to the way or thing that is mentioned",
                    "vi": "tương tự như cách hoặc điều được đề cập"
                },
                "examples": [
                    {
                        "en": "Those aren't his exact words, but he said something along those lines.",
                        "vi": "Đó không phải là những lời chính xác của anh ấy, nhưng anh ấy đã nói điều gì đó dọc theo những dòng đó."
                    },
                    {
                        "en": "The hotel was built along the lines of a French chateau.",
                        "vi": "Khách sạn được xây dựng dọc theo các đường nét của một lâu đài Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin",
                    "vi": "được sử dụng để nói rằng mọi người hoặc nhóm đã chỉ ra rằng họ dự định ủng hộ phe nào trong một cuộc tranh cãi hoặc cuộc cạnh tranh sắp bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be working or functioning",
                    "vi": "đang làm việc hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "The new working methods will come on line in June.",
                        "vi": "Các phương pháp làm việc mới sẽ được áp dụng vào tháng 6."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a position where you can be shot at",
                    "vi": "ở một vị trí mà bạn có thể bị bắn vào"
                },
                "examples": [
                    {
                        "en": "attempts to prevent civilians from being in the firing line",
                        "vi": "nỗ lực ngăn cản dân thường ở trong tầm bắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a position where people can criticize or blame you",
                    "vi": "ở vị trí mà mọi người có thể chỉ trích hoặc đổ lỗi cho bạn"
                },
                "examples": [
                    {
                        "en": "The employment secretary found himself in the firing line over recent job cuts.",
                        "vi": "Thư ký việc làm nhận thấy mình đang trong tình trạng sa thải vì những đợt cắt giảm việc làm gần đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with unusual costs or income that a company pays or receives, that are not part of its daily business and are taken away or added after calculating profits",
                    "vi": "liên quan đến chi phí hoặc thu nhập bất thường mà một công ty trả hoặc nhận, không phải là một phần hoạt động kinh doanh hàng ngày của công ty và được lấy đi hoặc thêm vào sau khi tính toán lợi nhuận"
                },
                "examples": [
                    {
                        "en": "There was a £4 million extraordinary charge below the line.",
                        "vi": "Có một khoản phí bất thường trị giá 4 triệu bảng Anh bên dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with advertising by means of direct mail, email, social media, events, etc.",
                    "vi": "được kết nối với quảng cáo bằng thư trực tiếp, email, phương tiện truyền thông xã hội, sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "We are planning social networking, digital marketing and below-the-line activities across the country.",
                        "vi": "Chúng tôi đang lên kế hoạch cho mạng xã hội, tiếp thị kỹ thuật số và các hoạt động dưới dây trên toàn quốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with a section at the end of an online article or blog post where readers can put comments",
                    "vi": "được kết nối với một phần ở cuối bài viết trực tuyến hoặc bài đăng trên blog, nơi người đọc có thể đưa ra nhận xét"
                },
                "examples": [
                    {
                        "en": "There were numerous comments below the line.",
                        "vi": "Có rất nhiều bình luận bên dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave or make somebody/something behave in the same way as other people or how they should behave",
                    "vi": "để cư xử hoặc làm cho ai đó / cái gì đó cư xử theo cách giống như những người khác hoặc cách họ nên cư xử"
                },
                "examples": [
                    {
                        "en": "The other members of the board must be brought into line.",
                        "vi": "Các thành viên khác của hội đồng quản trị phải được đưa vào hàng."
                    },
                    {
                        "en": "The actions of investors do not always fall into line with financial theory.",
                        "vi": "Các hành động của các nhà đầu tư không phải lúc nào cũng phù hợp với lý thuyết tài chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is not considered to be acceptable behaviour",
                    "vi": "làm điều gì đó không được coi là hành vi có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "He crossed the line by making details of their very private conversation public.",
                        "vi": "Anh ta vượt qua ranh giới bằng cách công khai chi tiết cuộc trò chuyện rất riêng tư của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to the front of a line of people without waiting for your turn",
                    "vi": "đi đến trước một dòng người mà không cần đợi đến lượt của bạn"
                },
                "examples": [
                    {
                        "en": "Somebody cut in line in front of me.",
                        "vi": "Ai đó đã xếp hàng trước mặt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that something is finished and not worth discussing any more",
                    "vi": "để nói rằng một cái gì đó đã kết thúc và không đáng thảo luận nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to reach) the point at which something can no longer continue in the same way",
                    "vi": "(đạt đến) điểm mà tại đó điều gì đó không còn có thể tiếp tục theo cách cũ"
                },
                "examples": [
                    {
                        "en": "A defeat in the second round marked the end of the line for last year's champion.",
                        "vi": "Một thất bại ở vòng thứ hai đánh dấu dấu chấm hết cho nhà vô địch năm ngoái."
                    },
                    {
                        "en": "The loss of this contract could signal the end of the line for the shipyard.",
                        "vi": "Việc mất hợp đồng này có thể báo hiệu sự kết thúc của dây chuyền cho nhà máy đóng tàu."
                    },
                    {
                        "en": "This latest disagreement could mean the end of the road for the band.",
                        "vi": "Sự bất đồng mới nhất này có thể có nghĩa là con đường kết thúc của ban nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong control or discipline",
                    "vi": "kiểm soát hoặc kỷ luật mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Those children need a firm hand to make them behave.",
                        "vi": "Những đứa trẻ đó cần một bàn tay cứng rắn để bắt chúng cư xử."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "What I said was not true, but he fell for it (= believed it) hook, line and sinker.",
                        "vi": "Những gì tôi nói là không đúng, nhưng anh ấy đã mắc phải (= tin vào điều đó) cái móc, đường dây và kẻ đánh chìm."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that forms a straight line with something",
                    "vi": "ở một vị trí tạo thành một đường thẳng với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "An eclipse happens when the earth and moon are in line with the sun.",
                        "vi": "Nhật thực xảy ra khi trái đất và mặt trăng nằm thẳng hàng với mặt trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to get something",
                    "vi": "có khả năng nhận được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She is in line for promotion.",
                        "vi": "Cô ấy đang trong hàng để thăng chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a job",
                    "vi": "trong khi làm một công việc"
                },
                "examples": [
                    {
                        "en": "A policeman was injured in the line of duty yesterday.",
                        "vi": "Một cảnh sát đã bị thương trong khi làm nhiệm vụ ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar to something or so that one thing is closely connected with another",
                    "vi": "tương tự như một cái gì đó hoặc sao cho cái này được kết nối chặt chẽ với cái khác"
                },
                "examples": [
                    {
                        "en": "Annual pay increases will be in line with inflation.",
                        "vi": "Tăng lương hàng năm sẽ phù hợp với lạm phát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody clearly what you think, especially when they will not like what you say",
                    "vi": "để nói với ai đó rõ ràng những gì bạn nghĩ, đặc biệt là khi họ sẽ không thích những gì bạn nói"
                },
                "examples": [
                    {
                        "en": "The manager laid it on the line—some people would have to lose their jobs.",
                        "vi": "Người quản lý đã đặt nó vào tình trạng khó khăn - một số người sẽ phải mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to establish) a clear limit to what you will do or accept",
                    "vi": "(để thiết lập) một giới hạn rõ ràng cho những gì bạn sẽ làm hoặc chấp nhận"
                },
                "examples": [
                    {
                        "en": "It’s time to draw a line in the sand and stop allowing workplace bullying to continue.",
                        "vi": "Đã đến lúc vẽ một ranh giới trên cát và ngừng cho phép tiếp tục bắt nạt nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to choose, etc.) the easiest way of doing something",
                    "vi": "(để lựa chọn, v.v.) cách dễ nhất để làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at risk",
                    "vi": "gặp rủi ro"
                },
                "examples": [
                    {
                        "en": "If we don't make a profit, my job is on the line.",
                        "vi": "Nếu chúng tôi không tạo ra lợi nhuận, công việc của tôi là trên đường dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "not forming a straight line",
                    "vi": "không tạo thành một đường thẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "different from something",
                    "vi": "khác với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "London prices are way out of line with the rest of the country.",
                        "vi": "Giá London đang chênh lệch với phần còn lại của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving in a way that is not acceptable or right",
                    "vi": "hành xử theo cách không thể chấp nhận được hoặc đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a way that people think is not acceptable",
                    "vi": "cư xử theo cách mà mọi người nghĩ là không thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "She realized she had overstepped the mark and quickly apologized.",
                        "vi": "Cô nhận ra mình đã vượt quá mức cho phép và nhanh chóng xin lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody a story or make an excuse that is not true",
                    "vi": "kể cho ai đó một câu chuyện hoặc viện cớ không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look for or discover a meaning in something that is not openly stated",
                    "vi": "để tìm kiếm hoặc khám phá ý nghĩa của điều gì đó không được công khai"
                },
                "examples": [
                    {
                        "en": "Reading between the lines, I think Clare needs money.",
                        "vi": "Đọc giữa dòng, tôi nghĩ Clare cần tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sign a document to show that you have agreed to buy something or do something",
                    "vi": "ký một tài liệu để chứng tỏ rằng bạn đã đồng ý mua một cái gì đó hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Just sign on the dotted line and the car is yours.",
                        "vi": "Chỉ cần ký vào đường chấm và chiếc xe là của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave badly or break the rules",
                    "vi": "cư xử tồi tệ hoặc vi phạm các quy tắc"
                },
                "examples": [
                    {
                        "en": "His boss warned him that if he stepped out of line once more he would be fired.",
                        "vi": "Sếp của anh ta đã cảnh báo anh ta rằng nếu anh ta bước ra khỏi giới hạn một lần nữa, anh ta sẽ bị sa thải."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do what somebody in authority tells you to say or do, even if you do not share the same opinions, etc.",
                    "vi": "để nói hoặc làm những gì ai đó có thẩm quyền yêu cầu bạn nói hoặc làm, ngay cả khi bạn không có cùng quan điểm, v.v."
                },
                "examples": [
                    {
                        "en": "One or two of them refused to toe the line.",
                        "vi": "Một hoặc hai người trong số họ từ chối dây."
                    },
                    {
                        "en": "MPs rarely fail to toe the party line.",
                        "vi": "Các nghị sĩ hiếm khi không tuân theo đường lối của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult or dangerous situation where you could easily make a mistake",
                    "vi": "ở trong một tình huống khó khăn hoặc nguy hiểm mà bạn có thể dễ dàng mắc sai lầm"
                },
                "examples": [
                    {
                        "en": "He was walking a fine line between being funny and being rude.",
                        "vi": "Anh ấy đang đi đúng ranh giới giữa hài hước và thô lỗ."
                    },
                    {
                        "en": "She often seems to tread a thin line between success and failure.",
                        "vi": "Cô ấy dường như luôn vạch ra một ranh giới mỏng manh giữa thành công và thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "02c74797b9bd4dd9b2e9d90e8223340b",
        "word": "magazine",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌmæɡəˈziːn/",
            "us": "/ˈmæɡəziːn/"
        },
        "nearby": [
            {
                "word": "Mafia",
                "pos": "noun"
            },
            {
                "word": "Mafioso",
                "pos": "noun"
            },
            {
                "word": "magazine",
                "pos": "noun"
            },
            {
                "word": "magenta",
                "pos": "adjective"
            },
            {
                "word": "magenta",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of large thin book with a paper cover that you can buy every week or month, containing articles, photographs, etc., often on a particular topic; a similar collection of articles, etc. that appears regularly online",
                    "vi": "một loại sách mỏng khổ lớn có bìa giấy mà bạn có thể mua hàng tuần hoặc hàng tháng, chứa các bài báo, hình ảnh, v.v., thường về một chủ đề cụ thể; một bộ sưu tập các bài báo tương tự, v.v. xuất hiện thường xuyên trên mạng"
                },
                "examples": [
                    {
                        "en": "a weekly/monthly magazine",
                        "vi": "một tạp chí hàng tuần / hàng tháng"
                    },
                    {
                        "en": "a magazine article/interview/story/feature/piece",
                        "vi": "một bài báo tạp chí / phỏng vấn / câu chuyện / tính năng / mảnh"
                    },
                    {
                        "en": "an online magazine",
                        "vi": "một tạp chí trực tuyến"
                    },
                    {
                        "en": "a literary/news magazine",
                        "vi": "một tạp chí văn học / tin tức"
                    },
                    {
                        "en": "to read/edit/publish a magazine",
                        "vi": "để đọc / chỉnh sửa / xuất bản một tạp chí"
                    },
                    {
                        "en": "a magazine editor/publisher/journalist/reporter",
                        "vi": "một biên tập viên tạp chí / nhà xuất bản / nhà báo / phóng viên"
                    },
                    {
                        "en": "Her designer clothes were from the pages of a glossy fashion magazine.",
                        "vi": "Những bộ quần áo thiết kế của cô là từ các trang của một tạp chí thời trang bóng bẩy."
                    },
                    {
                        "en": "She told the magazine she was making a new album.",
                        "vi": "Cô ấy nói với tạp chí rằng cô ấy đang thực hiện một album mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a radio or television programme that is about a particular topic",
                    "vi": "một chương trình phát thanh hoặc truyền hình về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "a regional news magazine on TV",
                        "vi": "một tạp chí tin tức khu vực trên TV"
                    },
                    {
                        "en": "a magazine programme/program",
                        "vi": "một chương trình / chương trình tạp chí"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a gun that holds the bullets before they are fired",
                    "vi": "phần giữ đạn trước khi bắn"
                },
                "examples": [
                    {
                        "en": "He took the machine gun and a spare magazine.",
                        "vi": "Anh ta lấy khẩu súng máy và một băng đạn dự phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room or building where weapons, explosives and bullets are stored",
                    "vi": "một căn phòng hoặc tòa nhà nơi lưu trữ vũ khí, chất nổ và đạn"
                },
                "examples": [
                    {
                        "en": "Those buildings are ammunition magazines.",
                        "vi": "Những tòa nhà đó là các tạp chí đạn dược."
                    }
                ]
            }
        ]
    },
    {
        "id": "e13f9fae5f354c1bb16cb0d2c6cd4701",
        "word": "report",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/rɪˈpɔːt/",
            "us": "/rɪˈpɔːrt/"
        },
        "nearby": [
            {
                "word": "reply",
                "pos": "noun"
            },
            {
                "word": "repo man",
                "pos": "noun"
            },
            {
                "word": "report",
                "pos": "noun"
            },
            {
                "word": "report",
                "pos": "verb"
            },
            {
                "word": "reportage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written or spoken account of an event, especially one that is published or broadcast",
                    "vi": "một tài khoản bằng văn bản hoặc bằng giọng nói về một sự kiện, đặc biệt là một sự kiện đã được xuất bản hoặc phát sóng"
                },
                "examples": [
                    {
                        "en": "Are these news reports true?",
                        "vi": "Những bản tin này có đúng sự thật không?"
                    },
                    {
                        "en": "media/press/newspaper reports",
                        "vi": "báo chí / báo chí / báo chí"
                    },
                    {
                        "en": "report on something And now over to Jim Muir, for a report on the South African election.",
                        "vi": "báo cáo về điều gì đó Và bây giờ chuyển cho Jim Muir, để báo cáo về cuộc bầu cử ở Nam Phi."
                    },
                    {
                        "en": "A local news station aired a special report on the controversy.",
                        "vi": "Một đài tin tức địa phương đã phát sóng một phóng sự đặc biệt về cuộc tranh cãi."
                    },
                    {
                        "en": "according to a report According to this evening's weather report, there will be snow tomorrow.",
                        "vi": "Theo báo cáo Theo bản tin thời tiết chiều tối nay sẽ có tuyết vào ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a spoken or written description of something containing information that somebody needs to have",
                    "vi": "một mô tả bằng lời nói hoặc bằng văn bản về thứ gì đó có chứa thông tin mà ai đó cần phải có"
                },
                "examples": [
                    {
                        "en": "a police report",
                        "vi": "một báo cáo của cảnh sát"
                    },
                    {
                        "en": "The company has just released its annual report.",
                        "vi": "Công ty vừa công bố báo cáo thường niên."
                    },
                    {
                        "en": "Can you give us a progress report?",
                        "vi": "Bạn có thể cung cấp cho chúng tôi một báo cáo tiến độ?"
                    },
                    {
                        "en": "report on something You need to compile a report on your findings.",
                        "vi": "báo cáo về điều gì đó Bạn cần soạn báo cáo về những phát hiện của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official document written by a group of people who have examined a particular situation or problem",
                    "vi": "một tài liệu chính thức được viết bởi một nhóm người đã xem xét một tình huống hoặc vấn đề cụ thể"
                },
                "examples": [
                    {
                        "en": "to release/issue a report",
                        "vi": "để phát hành / phát hành một báo cáo"
                    },
                    {
                        "en": "report on something The committee will publish its report on the health service next week.",
                        "vi": "báo cáo về điều gì đó Ủy ban sẽ công bố báo cáo của mình về dịch vụ y tế vào tuần tới."
                    },
                    {
                        "en": "according to a report According to the report, we are facing an obesity crisis.",
                        "vi": "Theo một báo cáo Theo báo cáo, chúng ta đang phải đối mặt với một cuộc khủng hoảng béo phì."
                    }
                ]
            },
            {
                "define": {
                    "en": "a story or piece of information that may or may not be true",
                    "vi": "một câu chuyện hoặc một phần thông tin có thể đúng hoặc có thể không đúng"
                },
                "examples": [
                    {
                        "en": "reports of something There are unconfirmed reports of a shooting in the capital.",
                        "vi": "báo cáo về điều gì đó Có những báo cáo chưa được xác nhận về một vụ nổ súng ở thủ đô."
                    },
                    {
                        "en": "I don't believe these reports of UFO sightings.",
                        "vi": "Tôi không tin những báo cáo này về việc nhìn thấy UFO."
                    },
                    {
                        "en": "reports that… We are hearing reports that she has quit.",
                        "vi": "báo cáo rằng… Chúng tôi đang nghe báo cáo rằng cô ấy đã nghỉ việc."
                    },
                    {
                        "en": "despite reports Despite reports claiming the market is heading for a crash, he predicts that prices will rise.",
                        "vi": "Bất chấp các báo cáo Bất chấp các báo cáo cho rằng thị trường đang hướng tới sự sụp đổ, ông dự đoán rằng giá sẽ tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written statement about a student’s work at school, college, etc.",
                    "vi": "một bản tường trình về công việc của một học sinh ở trường, đại học, v.v."
                },
                "examples": [
                    {
                        "en": "a school report",
                        "vi": "một báo cáo của trường"
                    },
                    {
                        "en": "to get a good/bad report",
                        "vi": "để có được một báo cáo tốt / xấu"
                    },
                    {
                        "en": "She got a better report card this time.",
                        "vi": "Lần này cô ấy có một phiếu điểm tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an employee whose work is the responsibility of a particular manager",
                    "vi": "một nhân viên mà công việc là trách nhiệm của một người quản lý cụ thể"
                },
                "examples": [
                    {
                        "en": "a weekly meeting with my direct reports",
                        "vi": "một cuộc họp hàng tuần với các báo cáo trực tiếp của tôi"
                    },
                    {
                        "en": "He was finding one of his reports very difficult to manage.",
                        "vi": "Anh ấy thấy một trong những báo cáo của mình rất khó quản lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sound of an explosion or of a gun being fired",
                    "vi": "âm thanh của một vụ nổ hoặc súng được bắn"
                },
                "examples": [
                    {
                        "en": "a loud report",
                        "vi": "một báo cáo ồn ào"
                    }
                ]
            },
            {
                "define": {
                    "en": "talked about by people in a bad/good way",
                    "vi": "được mọi người nói về một cách xấu / tốt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "284d2c99bcdc40e3a2eddfc9b11cb9a8",
        "word": "column",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkɒləm/",
            "us": "/ˈkɑːləm/"
        },
        "nearby": [
            {
                "word": "Christopher Columbus",
                "pos": ""
            },
            {
                "word": "Columbus Day",
                "pos": "noun"
            },
            {
                "word": "column",
                "pos": "noun"
            },
            {
                "word": "column inch",
                "pos": "noun"
            },
            {
                "word": "columnist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the straight sections from top to bottom into which text on a page or screen is divided",
                    "vi": "một trong các phần thẳng từ trên xuống dưới mà văn bản trên trang hoặc màn hình được chia"
                },
                "examples": [
                    {
                        "en": "a dictionary with two columns per page",
                        "vi": "một từ điển có hai cột trên mỗi trang"
                    },
                    {
                        "en": "column of something a column of text",
                        "vi": "cột cái gì đó một cột văn bản"
                    },
                    {
                        "en": "at the bottom of the right-hand column of this page",
                        "vi": "ở cuối cột bên phải của trang này"
                    },
                    {
                        "en": "The website has an attractive two-column format.",
                        "vi": "Trang web có định dạng hai cột hấp dẫn."
                    },
                    {
                        "en": "in a column Click on the name of your account in the left-hand column.",
                        "vi": "trong một cột Nhấp vào tên tài khoản của bạn ở cột bên trái."
                    },
                    {
                        "en": "Put a mark in the appropriate column.",
                        "vi": "Đánh dấu vào cột thích hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of numbers or words arranged one under the other down a page",
                    "vi": "một loạt các số hoặc từ được sắp xếp một bên dưới cái kia trên một trang"
                },
                "examples": [
                    {
                        "en": "column of something to add up a column of figures",
                        "vi": "cột cái gì đó để thêm một cột số liệu"
                    },
                    {
                        "en": "the fifth column of Table 4",
                        "vi": "cột thứ năm của Bảng 4"
                    },
                    {
                        "en": "in a column The numbers in the left-hand column are not relevant here.",
                        "vi": "trong một cột Các con số ở cột bên trái không có liên quan ở đây."
                    },
                    {
                        "en": "The last column contains the probability of each of those outcomes occurring.",
                        "vi": "Cột cuối cùng chứa xác suất xảy ra của mỗi kết quả đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a newspaper, magazine or website that appears regularly and deals with a particular subject or is written by a particular writer",
                    "vi": "một phần của một tờ báo, tạp chí hoặc trang web xuất hiện thường xuyên và liên quan đến một chủ đề cụ thể hoặc được viết bởi một nhà văn cụ thể"
                },
                "examples": [
                    {
                        "en": "She writes a monthly column for a leading national newspaper.",
                        "vi": "Cô viết một chuyên mục hàng tháng cho một tờ báo quốc gia hàng đầu."
                    },
                    {
                        "en": "a newspaper/weekly column",
                        "vi": "một tờ báo / chuyên mục hàng tuần"
                    },
                    {
                        "en": "the financial column",
                        "vi": "cột tài chính"
                    },
                    {
                        "en": "in a column I disagree with a lot of what he writes in his column.",
                        "vi": "trong một chuyên mục, tôi không đồng ý với rất nhiều điều anh ấy viết trong chuyên mục của mình."
                    },
                    {
                        "en": "I always read her column in the local paper.",
                        "vi": "Tôi luôn đọc chuyên mục của cô ấy trên báo địa phương."
                    },
                    {
                        "en": "column on/about something The website features a regular column on parenting.",
                        "vi": "chuyên mục về / về điều gì đó Trang web có một cột thông thường về nuôi dạy con cái."
                    },
                    {
                        "en": "column by somebody She always read the column by the local vicar in the parish magazine.",
                        "vi": "chuyên mục của ai đó Cô luôn đọc chuyên mục của cha sở địa phương trên tạp chí giáo xứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall, solid post, usually round and made of stone, that supports or decorates a building or stands alone as a monument",
                    "vi": "một cột cao, vững chắc, thường tròn và làm bằng đá, nâng đỡ hoặc trang trí một tòa nhà hoặc đứng một mình như một đài kỷ niệm"
                },
                "examples": [
                    {
                        "en": "The temple is supported by marble columns.",
                        "vi": "Ngôi đền được hỗ trợ bởi các cột bằng đá cẩm thạch."
                    },
                    {
                        "en": "Nelson's Column in Trafalgar Square is one of London's best-known landmarks.",
                        "vi": "Cột Nelson ở Quảng trường Trafalgar là một trong những địa danh nổi tiếng nhất của London."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a column in shape",
                    "vi": "một thứ giống như một cái cột trong hình dạng"
                },
                "examples": [
                    {
                        "en": "a column of smoke (= smoke rising straight up)",
                        "vi": "một cột khói (= khói bốc thẳng lên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, moving line of people or vehicles",
                    "vi": "một dòng người hoặc phương tiện di chuyển dài"
                },
                "examples": [
                    {
                        "en": "a long column of troops and tanks",
                        "vi": "một cột dài của quân đội và xe tăng"
                    },
                    {
                        "en": "to march in columns",
                        "vi": "diễu hành trong các cột"
                    }
                ]
            }
        ]
    },
    {
        "id": "f6839f2906de4d7e9eefea3f1df5d928",
        "word": "fiction",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfɪkʃn/",
            "us": "/ˈfɪkʃn/"
        },
        "nearby": [
            {
                "word": "fickle",
                "pos": "adjective"
            },
            {
                "word": "fickleness",
                "pos": "noun"
            },
            {
                "word": "fiction",
                "pos": "noun"
            },
            {
                "word": "fictional",
                "pos": "adjective"
            },
            {
                "word": "fictionalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of literature that describes imaginary people and events, not real ones",
                    "vi": "một loại văn học mô tả những con người và sự kiện tưởng tượng, không phải những sự kiện có thật"
                },
                "examples": [
                    {
                        "en": "a work of popular fiction",
                        "vi": "một tác phẩm tiểu thuyết nổi tiếng"
                    },
                    {
                        "en": "historical/romantic/crime fiction",
                        "vi": "tiểu thuyết lịch sử / lãng mạn / tội phạm"
                    },
                    {
                        "en": "to write/read fiction",
                        "vi": "viết / đọc tiểu thuyết"
                    },
                    {
                        "en": "a crime fiction writer",
                        "vi": "một nhà văn tiểu thuyết tội phạm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is invented or imagined and is not true",
                    "vi": "một thứ được phát minh hoặc tưởng tượng và không có thật"
                },
                "examples": [
                    {
                        "en": "Don't believe what she says—it's pure fiction!",
                        "vi": "Đừng tin những gì cô ấy nói — đó hoàn toàn là hư cấu!"
                    },
                    {
                        "en": "fiction that… For years he managed to keep up the fiction that he was not married.",
                        "vi": "hư cấu rằng… Trong nhiều năm, anh ta đã cố gắng duy trì sự hư cấu rằng anh ta chưa kết hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things that actually happen are often more surprising than stories that are invented",
                    "vi": "thường nói rằng những điều thực sự xảy ra thường gây ngạc nhiên hơn những câu chuyện được phát minh ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "83cdf2af92874f0eab68feca9bcb6f1d",
        "word": "novel",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈnɒvl/",
            "us": "/ˈnɑːvl/"
        },
        "nearby": [
            {
                "word": "nova",
                "pos": "noun"
            },
            {
                "word": "Nova Scotia",
                "pos": ""
            },
            {
                "word": "novel",
                "pos": "noun"
            },
            {
                "word": "novel",
                "pos": "adjective"
            },
            {
                "word": "novelette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a story long enough to fill a complete book, in which the characters and events are usually imaginary",
                    "vi": "một câu chuyện đủ dài để lấp đầy một cuốn sách hoàn chỉnh, trong đó các nhân vật và sự kiện thường là tưởng tượng"
                },
                "examples": [
                    {
                        "en": "to write/publish/read a novel",
                        "vi": "để viết / xuất bản / đọc một cuốn tiểu thuyết"
                    },
                    {
                        "en": "detective/historical/romantic novels",
                        "vi": "tiểu thuyết trinh thám / lịch sử / lãng mạn"
                    },
                    {
                        "en": "the novels of Jane Austen",
                        "vi": "tiểu thuyết của Jane Austen"
                    },
                    {
                        "en": "Her latest novel is set in Cornwall.",
                        "vi": "Cuốn tiểu thuyết mới nhất của cô lấy bối cảnh ở Cornwall."
                    },
                    {
                        "en": "a best-selling novel",
                        "vi": "một cuốn tiểu thuyết bán chạy nhất"
                    },
                    {
                        "en": "Highsmith's debut novel was a bestseller in 1949.",
                        "vi": "Cuốn tiểu thuyết đầu tay của Highsmith là một cuốn sách bán chạy nhất vào năm 1949."
                    }
                ]
            },
            {
                "define": {
                    "en": "the type of literature that novels represent",
                    "vi": "loại văn học mà tiểu thuyết đại diện"
                },
                "examples": [
                    {
                        "en": "The novel is the most adaptable of all literary forms.",
                        "vi": "Tiểu thuyết là tác phẩm dễ chuyển thể nhất trong tất cả các thể loại văn học."
                    }
                ]
            }
        ]
    },
    {
        "id": "314fcd358de4434ab94c02e72542062b",
        "word": "paper",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈpeɪpə(r)/",
            "us": "/ˈpeɪpər/"
        },
        "nearby": [
            {
                "word": "paparazzo",
                "pos": "noun"
            },
            {
                "word": "papaya",
                "pos": "noun"
            },
            {
                "word": "paper",
                "pos": "noun"
            },
            {
                "word": "paper",
                "pos": "verb"
            },
            {
                "word": "paperback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the thin material that you write and draw on and that is also used for wrapping and packing things",
                    "vi": "vật liệu mỏng mà bạn viết và vẽ trên đó cũng được sử dụng để gói và đóng gói mọi thứ"
                },
                "examples": [
                    {
                        "en": "a piece/sheet of paper",
                        "vi": "một mảnh / tờ giấy"
                    },
                    {
                        "en": "She wrote her name and address on a slip (= a small piece) of paper.",
                        "vi": "Cô ấy viết tên và địa chỉ của mình vào một tờ giấy (= một mảnh giấy nhỏ)."
                    },
                    {
                        "en": "He scribbled the number on a scrap of paper.",
                        "vi": "Anh viết nguệch ngoạc con số trên một tờ giấy nháp."
                    },
                    {
                        "en": "a package wrapped in brown paper",
                        "vi": "gói giấy nâu"
                    },
                    {
                        "en": "recycled paper",
                        "vi": "giấy tái chế"
                    },
                    {
                        "en": "Make sure you have pen and paper handy.",
                        "vi": "Hãy chắc chắn rằng bạn có bút và giấy tiện dụng."
                    },
                    {
                        "en": "on/onto paper The image is copied onto paper.",
                        "vi": "trên / lên giấy Hình ảnh được sao chép lên giấy."
                    },
                    {
                        "en": "He brought his lunch in a brown paper bag.",
                        "vi": "Anh ấy mang theo bữa trưa của mình trong một túi giấy màu nâu."
                    },
                    {
                        "en": "a paper cup/plate/napkin",
                        "vi": "cốc / đĩa / khăn ăn bằng giấy"
                    },
                    {
                        "en": "This journal is available in paper and electronic form.",
                        "vi": "Tạp chí này có sẵn dưới dạng giấy và điện tử."
                    },
                    {
                        "en": "Experience is more important for this job than paper qualifications (= that exist as official documents but may not have any real value).",
                        "vi": "Kinh nghiệm quan trọng hơn đối với công việc này hơn là bằng cấp trên giấy tờ (= tồn tại dưới dạng tài liệu chính thức nhưng có thể không có bất kỳ giá trị thực nào)."
                    },
                    {
                        "en": "paper losses/profits (= that are shown in accounts but which may not exist in reality)",
                        "vi": "lỗ / lãi trên giấy (= được hiển thị trong tài khoản nhưng có thể không tồn tại trong thực tế)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a newspaper",
                    "vi": "một tờ báo"
                },
                "examples": [
                    {
                        "en": "the daily/morning paper",
                        "vi": "tờ báo hàng ngày / buổi sáng"
                    },
                    {
                        "en": "the local paper",
                        "vi": "tờ báo địa phương"
                    },
                    {
                        "en": "Have you seen today's paper?",
                        "vi": "Bạn đã xem bài báo hôm nay chưa?"
                    },
                    {
                        "en": "He sat down to read the paper.",
                        "vi": "Anh ngồi xuống để đọc tờ giấy."
                    },
                    {
                        "en": "in the paper I read about it in the paper.",
                        "vi": "trong bài báo, tôi đã đọc về nó trong bài báo."
                    },
                    {
                        "en": "She put an ad in the paper pleading for the dog's return.",
                        "vi": "Cô ấy dán một quảng cáo trên tờ báo cầu xin sự trở lại của con chó."
                    },
                    {
                        "en": "The papers (= newspapers in general) soon got hold of the story.",
                        "vi": "Các tờ báo (= báo chí nói chung) đã sớm nắm bắt được câu chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "pieces of paper with writing on them, such as letters, pieces of work or private documents",
                    "vi": "mảnh giấy có chữ viết trên đó, chẳng hạn như thư từ, mẩu công việc hoặc tài liệu riêng tư"
                },
                "examples": [
                    {
                        "en": "His desk was covered with books and papers.",
                        "vi": "Bàn làm việc của anh ta đầy sách và giấy tờ."
                    },
                    {
                        "en": "a stack/pile of papers",
                        "vi": "một chồng / đống giấy tờ"
                    },
                    {
                        "en": "I found these documents among my father's papers after his death.",
                        "vi": "Tôi đã tìm thấy những tài liệu này trong số những giấy tờ của cha tôi sau khi ông mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "official documents that prove your identity, give you permission to do something, etc.",
                    "vi": "tài liệu chính thức chứng minh danh tính của bạn, cho phép bạn làm điều gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "identity papers",
                        "vi": "giấy tờ tùy thân"
                    },
                    {
                        "en": "The couple filed divorce papers at Los Angeles court on Monday.",
                        "vi": "Cặp đôi đã đệ đơn ly hôn tại tòa án Los Angeles vào thứ Hai."
                    },
                    {
                        "en": "Teresa signed the adoption papers.",
                        "vi": "Teresa đã ký giấy nhận con nuôi."
                    },
                    {
                        "en": "Immigration officials will ask to see your papers.",
                        "vi": "Các quan chức xuất nhập cảnh sẽ yêu cầu xem giấy tờ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of exam questions on a particular subject; the answers that people write to the questions",
                    "vi": "một bộ đề thi về một chủ đề cụ thể; câu trả lời mà mọi người viết cho các câu hỏi"
                },
                "examples": [
                    {
                        "en": "The geography paper was hard.",
                        "vi": "Bài báo địa lý thật khó."
                    },
                    {
                        "en": "She spent the evening marking exam papers.",
                        "vi": "Cô dành cả buổi tối để chấm bài thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an academic article about a particular subject that is written by and for specialists",
                    "vi": "một bài báo học thuật về một chủ đề cụ thể được viết bởi và cho các chuyên gia"
                },
                "examples": [
                    {
                        "en": "a recent paper in the Journal of Medicine",
                        "vi": "một bài báo gần đây trên Tạp chí Y học"
                    },
                    {
                        "en": "paper on something He has published a research paper on the topic.",
                        "vi": "paper on something Anh ấy đã xuất bản một bài báo nghiên cứu về chủ đề này."
                    },
                    {
                        "en": "a consultation/discussion paper",
                        "vi": "một bài tham vấn / thảo luận"
                    },
                    {
                        "en": "She was invited to give a paper (= a talk) at an international scientific congress.",
                        "vi": "Cô được mời đưa ra một bài báo (= một bài nói chuyện) tại một đại hội khoa học quốc tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of written work done by a student",
                    "vi": "một tác phẩm viết của một học sinh"
                },
                "examples": [
                    {
                        "en": "Your grade will be based on four papers and a final exam.",
                        "vi": "Điểm của bạn sẽ dựa trên bốn bài báo và một bài kiểm tra cuối kỳ."
                    },
                    {
                        "en": "paper on something I'm writing a paper on ‘Macbeth’.",
                        "vi": "giấy về cái gì đó Tôi đang viết một bài báo về 'Macbeth'."
                    }
                ]
            },
            {
                "define": {
                    "en": "paper that you use to cover and decorate the walls of a room",
                    "vi": "giấy mà bạn sử dụng để phủ và trang trí các bức tường trong phòng"
                },
                "examples": [
                    {
                        "en": "The room was damp and the paper was peeling off.",
                        "vi": "Căn phòng ẩm ướt và giấy đã bong ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "having no value, especially legally, or because one of the people involved has no intention of doing what they said they would",
                    "vi": "không có giá trị, đặc biệt là về mặt pháp lý, hoặc bởi vì một trong những người liên quan không có ý định làm những gì họ đã nói rằng họ sẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when you put something on paper, you write it down",
                    "vi": "khi bạn đặt một cái gì đó trên giấy, bạn viết nó ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "judged from written information only, but not proved in practice",
                    "vi": "chỉ đánh giá từ thông tin bằng văn bản, nhưng không được chứng minh trong thực tế"
                },
                "examples": [
                    {
                        "en": "The idea looks good on paper.",
                        "vi": "Ý tưởng có vẻ tốt trên giấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write or start to write something",
                    "vi": "để viết hoặc bắt đầu viết một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d5671965c5c40ef9f013d8e0a16011b",
        "word": "review",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/rɪˈvjuː/",
            "us": "/rɪˈvjuː/"
        },
        "nearby": [
            {
                "word": "revert to",
                "pos": "phrasal verb"
            },
            {
                "word": "revetment",
                "pos": "noun"
            },
            {
                "word": "review",
                "pos": "noun"
            },
            {
                "word": "review",
                "pos": "verb"
            },
            {
                "word": "reviewer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a report in a newspaper or magazine, or on the internet, television or radio, in which somebody gives their opinion of a book, play, film, product, etc.; the act of writing this kind of report",
                    "vi": "một báo cáo trên một tờ báo hoặc tạp chí, hoặc trên internet, truyền hình hoặc đài phát thanh, trong đó ai đó đưa ra ý kiến của họ về một cuốn sách, vở kịch, bộ phim, sản phẩm, v.v.; hành động viết báo cáo kiểu này"
                },
                "examples": [
                    {
                        "en": "a book review",
                        "vi": "bình luận về một cuốn sách"
                    },
                    {
                        "en": "She gave the film a glowing review.",
                        "vi": "Cô ấy đã cho bộ phim một bài đánh giá sáng chói."
                    },
                    {
                        "en": "mixed/negative/bad reviews",
                        "vi": "đánh giá hỗn hợp / tiêu cực / xấu"
                    },
                    {
                        "en": "a positive/favourable review",
                        "vi": "một đánh giá tích cực / thuận lợi"
                    },
                    {
                        "en": "an online review of the restaurant",
                        "vi": "đánh giá trực tuyến về nhà hàng"
                    },
                    {
                        "en": "He submitted his latest novel for review.",
                        "vi": "Anh ấy đã gửi cuốn tiểu thuyết mới nhất của mình để được xem xét."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of looking again at something you have studied or written, especially in order to prepare for an exam",
                    "vi": "hành động nhìn lại nội dung bạn đã học hoặc viết, đặc biệt là để chuẩn bị cho kỳ thi"
                },
                "examples": [
                    {
                        "en": "We need to do the review for the test tomorrow.",
                        "vi": "Chúng ta cần làm bài kiểm tra cho bài kiểm tra ngày mai."
                    },
                    {
                        "en": "I should have time for a quick review of my notes before the test.",
                        "vi": "Tôi nên có thời gian để xem lại nhanh các ghi chú của mình trước khi kiểm tra."
                    },
                    {
                        "en": "We'll have time at the end of class for review.",
                        "vi": "Chúng ta sẽ có thời gian vào cuối lớp để xem xét."
                    },
                    {
                        "en": "There is a grammar review section at the end of each unit.",
                        "vi": "Có phần ôn tập ngữ pháp ở cuối mỗi bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of something, with the intention of changing it if necessary",
                    "vi": "kiểm tra một cái gì đó, với ý định thay đổi nó nếu cần thiết"
                },
                "examples": [
                    {
                        "en": "The government has embarked on a systematic review of transport policy.",
                        "vi": "Chính phủ đã bắt tay vào việc xem xét lại chính sách giao thông một cách có hệ thống."
                    },
                    {
                        "en": "MPS have called for an independent review.",
                        "vi": "MPS đã kêu gọi một cuộc đánh giá độc lập."
                    },
                    {
                        "en": "The proposals are available for review online.",
                        "vi": "Các đề xuất có sẵn để xem xét trực tuyến."
                    },
                    {
                        "en": "under review The terms of the contract are under review.",
                        "vi": "đang xem xét Các điều khoản của hợp đồng đang được xem xét."
                    },
                    {
                        "en": "up for review His parole application is up for review next week.",
                        "vi": "lên để xem xét Đơn xin ân xá của anh ấy sẽ được xem xét vào tuần tới."
                    },
                    {
                        "en": "a review board/panel",
                        "vi": "một hội đồng / hội đồng xét duyệt"
                    },
                    {
                        "en": "a pay/salary review",
                        "vi": "đánh giá lương / lương"
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of all the relevant information on a subject or on a series of events",
                    "vi": "kiểm tra tất cả các thông tin liên quan về một chủ đề hoặc về một loạt các sự kiện"
                },
                "examples": [
                    {
                        "en": "to conduct/undertake a review of customer complaints",
                        "vi": "tiến hành / thực hiện việc xem xét các khiếu nại của khách hàng"
                    },
                    {
                        "en": "to publish a review of recent cancer research",
                        "vi": "để xuất bản một đánh giá về nghiên cứu ung thư gần đây"
                    },
                    {
                        "en": "a comprehensive review of current scientific knowledge on the subject",
                        "vi": "đánh giá toàn diện kiến thức khoa học hiện tại về chủ đề này"
                    },
                    {
                        "en": "a thorough review of relevant materials",
                        "vi": "xem xét kỹ lưỡng các tài liệu liên quan"
                    },
                    {
                        "en": "The literature review suggests a number of areas for further study.",
                        "vi": "Tổng quan tài liệu gợi ý một số lĩnh vực để nghiên cứu thêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony that involves an official inspection of soldiers, etc. by an important visitor",
                    "vi": "một buổi lễ liên quan đến việc kiểm tra chính thức binh lính, v.v. bởi một vị khách quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a476c6adc8174422a7bcf598834c0161",
        "word": "short story",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌʃɔːt ˈstɔːri/",
            "us": "/ˌʃɔːrt ˈstɔːri/"
        },
        "nearby": [
            {
                "word": "short-stay",
                "pos": "adjective"
            },
            {
                "word": "shortstop",
                "pos": "noun"
            },
            {
                "word": "short story",
                "pos": "noun"
            },
            {
                "word": "short-tempered",
                "pos": "adjective"
            },
            {
                "word": "short-term",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a story, usually about imaginary characters and events, that is short enough to be read from beginning to end without stopping",
                    "vi": "một câu chuyện, thường là về các nhân vật và sự kiện tưởng tượng, đủ ngắn để có thể đọc từ đầu đến cuối mà không dừng lại"
                },
                "examples": [
                    {
                        "en": "his first published short story",
                        "vi": "truyện ngắn xuất bản đầu tiên của anh ấy"
                    },
                    {
                        "en": "a collection of short stories",
                        "vi": "một tập truyện ngắn"
                    }
                ]
            }
        ]
    },
    {
        "id": "9797a653908c49569e9ffc4da6b5e43d",
        "word": "work",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/wɜːk/",
            "us": "/wɜːrk/"
        },
        "nearby": [
            {
                "word": "wore",
                "pos": ""
            },
            {
                "word": "work",
                "pos": "verb"
            },
            {
                "word": "work",
                "pos": "noun"
            },
            {
                "word": "workable",
                "pos": "adjective"
            },
            {
                "word": "workaday",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the job that a person does especially in order to earn money",
                    "vi": "công việc mà một người đặc biệt làm để kiếm tiền"
                },
                "examples": [
                    {
                        "en": "He started work as a security guard.",
                        "vi": "Anh bắt đầu công việc của một nhân viên bảo vệ."
                    },
                    {
                        "en": "I'm still looking for work.",
                        "vi": "Tôi vẫn đang tìm việc."
                    },
                    {
                        "en": "It is difficult to find work in the present economic climate.",
                        "vi": "Rất khó để tìm được việc làm trong bối cảnh kinh tế hiện nay."
                    },
                    {
                        "en": "She's planning to return to work once the children start school.",
                        "vi": "Cô ấy dự định sẽ trở lại làm việc sau khi bọn trẻ bắt đầu đi học."
                    },
                    {
                        "en": "full-time/part-time/unpaid/voluntary work",
                        "vi": "công việc toàn thời gian / bán thời gian / không lương / tình nguyện"
                    },
                    {
                        "en": "out of work She had been out of work (= without a job) for a year.",
                        "vi": "out of work Cô ấy đã nghỉ việc (= không có việc làm) trong một năm."
                    },
                    {
                        "en": "in work (British English) They are in work (= have a job).",
                        "vi": "trong công việc (tiếng Anh Anh) Họ đang làm việc (= có một công việc)."
                    },
                    {
                        "en": "What line of work are you in (= what type of work do you do)?",
                        "vi": "Bạn đang làm công việc gì (= bạn làm công việc gì)?"
                    },
                    {
                        "en": "off work She's been off work (= not going to work) with a bad back since July.",
                        "vi": "nghỉ làm Cô ấy đã nghỉ làm (= không đi làm) với tình trạng trở lại tồi tệ kể từ tháng Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where you do your job; the time that you spend there",
                    "vi": "nơi bạn làm công việc của mình; thời gian mà bạn dành ở đó"
                },
                "examples": [
                    {
                        "en": "I go to work at 8 o'clock.",
                        "vi": "Tôi đi làm lúc 8 giờ."
                    },
                    {
                        "en": "I was late for work again.",
                        "vi": "Tôi lại đi làm muộn."
                    },
                    {
                        "en": "I have to leave work early today.",
                        "vi": "Hôm nay tôi phải đi làm sớm."
                    },
                    {
                        "en": "Her friends from work came to see her in the hospital.",
                        "vi": "Bạn bè của cô ấy từ nơi làm việc đến gặp cô ấy trong bệnh viện."
                    },
                    {
                        "en": "I get on well with my work colleagues.",
                        "vi": "Tôi hòa thuận với các đồng nghiệp làm việc của mình."
                    },
                    {
                        "en": "a pleasant work environment",
                        "vi": "một môi trường làm việc dễ chịu"
                    },
                    {
                        "en": "at work The new legislation concerns health and safety at work.",
                        "vi": "tại nơi làm việc Luật mới liên quan đến sức khỏe và an toàn tại nơi làm việc."
                    },
                    {
                        "en": "before/after work I like to go for a run after work.",
                        "vi": "trước / sau giờ làm việc Tôi thích chạy bộ sau giờ làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the duties that you have and the activities that you do as part of your job",
                    "vi": "những nhiệm vụ mà bạn có và những hoạt động bạn làm như một phần công việc của mình"
                },
                "examples": [
                    {
                        "en": "Police work is mainly routine.",
                        "vi": "Công việc của cảnh sát là chủ yếu."
                    },
                    {
                        "en": "The accountant described his work to the sales staff.",
                        "vi": "Kế toán mô tả công việc của mình cho nhân viên kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "tasks that need to be done",
                    "vi": "những công việc cần phải hoàn thành"
                },
                "examples": [
                    {
                        "en": "Taking care of a baby is hard work.",
                        "vi": "Chăm sóc một em bé là một công việc khó khăn."
                    },
                    {
                        "en": "Whenever am I going to do all this work?",
                        "vi": "Bất cứ khi nào tôi sẽ làm tất cả công việc này?"
                    },
                    {
                        "en": "There is plenty of work to be done in the garden.",
                        "vi": "Có rất nhiều việc phải làm trong vườn."
                    },
                    {
                        "en": "Stop talking and get on with your work.",
                        "vi": "Đừng nói nữa và tiếp tục công việc của bạn."
                    },
                    {
                        "en": "He completed the work shortly before his death.",
                        "vi": "Ông đã hoàn thành công việc không lâu trước khi qua đời."
                    },
                    {
                        "en": "important work being undertaken by volunteers",
                        "vi": "công việc quan trọng do tình nguyện viên đảm nhận"
                    },
                    {
                        "en": "Big football matches make a lot of work for the police.",
                        "vi": "Những trận bóng lớn khiến cảnh sát phải vất vả rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "materials needed or used for doing work, especially books, papers, etc.",
                    "vi": "tài liệu cần thiết hoặc được sử dụng để thực hiện công việc, đặc biệt là sách, giấy tờ, v.v."
                },
                "examples": [
                    {
                        "en": "She often brings work (= for example, files and documents) home with her from the office.",
                        "vi": "Cô ấy thường mang công việc (= ví dụ: hồ sơ và tài liệu) về nhà từ văn phòng."
                    },
                    {
                        "en": "His work was spread all over the floor.",
                        "vi": "Công việc của anh ấy được rải khắp sàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of physical strength or mental power in order to do or make something",
                    "vi": "sử dụng sức mạnh thể chất hoặc sức mạnh tinh thần để làm hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She earned her grades through sheer hard work.",
                        "vi": "Cô ấy đã giành được điểm của mình nhờ làm việc chăm chỉ tuyệt đối."
                    },
                    {
                        "en": "work on something We began work on the project last year.",
                        "vi": "làm việc trên một cái gì đó Chúng tôi đã bắt đầu làm việc với dự án năm ngoái."
                    },
                    {
                        "en": "They performed pioneering work on the treatment of cancer.",
                        "vi": "Họ đã thực hiện công việc tiên phong trong việc điều trị ung thư."
                    },
                    {
                        "en": "Work continues on renovating the hotel.",
                        "vi": "Công việc cải tạo khách sạn vẫn tiếp tục."
                    },
                    {
                        "en": "work of doing something The work of building the bridge took six months.",
                        "vi": "Công việc xây dựng cây cầu mất sáu tháng."
                    },
                    {
                        "en": "The art collection was his life's work.",
                        "vi": "Bộ sưu tập nghệ thuật là tác phẩm để đời của anh ấy."
                    },
                    {
                        "en": "She set them to work painting the fence.",
                        "vi": "Cô bắt chúng làm công việc sơn hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or things that are produced as a result of work",
                    "vi": "một thứ hoặc những thứ được tạo ra do kết quả của công việc"
                },
                "examples": [
                    {
                        "en": "She's an artist whose work I really admire.",
                        "vi": "Cô ấy là một nghệ sĩ mà tôi thực sự ngưỡng mộ."
                    },
                    {
                        "en": "outstanding work in this area/field",
                        "vi": "công việc xuất sắc trong lĩnh vực / lĩnh vực này"
                    },
                    {
                        "en": "Is this all your own work (= did you do it without help from others)?",
                        "vi": "Đây có phải là tất cả công việc của riêng bạn (= bạn đã làm mà không có sự giúp đỡ của người khác)?"
                    },
                    {
                        "en": "The book is a detailed and thorough piece of work covering all aspects of the subject.",
                        "vi": "Cuốn sách là một tác phẩm chi tiết và kỹ lưỡng bao gồm tất cả các khía cạnh của chủ đề này."
                    },
                    {
                        "en": "He left a substantial body of work—drawings and watercolours as well as oils.",
                        "vi": "Ông đã để lại một lượng lớn tác phẩm - bản vẽ và màu nước cũng như dầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book, piece of music, painting, etc.",
                    "vi": "một cuốn sách, bản nhạc, bức tranh, v.v."
                },
                "examples": [
                    {
                        "en": "the collected/complete works of Tolstoy",
                        "vi": "các tác phẩm được sưu tầm / hoàn chỉnh của Tolstoy"
                    },
                    {
                        "en": "works of fiction/literature",
                        "vi": "tác phẩm hư cấu / văn học"
                    },
                    {
                        "en": "Chopin’s piano works",
                        "vi": "Tác phẩm piano của Chopin"
                    },
                    {
                        "en": "Beethoven composed his greatest works in the latter part of his life.",
                        "vi": "Beethoven đã sáng tác những tác phẩm vĩ đại nhất của mình trong phần sau của cuộc đời."
                    },
                    {
                        "en": "work by somebody He recognized the sketch as an early work by Degas.",
                        "vi": "tác phẩm của ai đó Anh ấy nhận ra bản phác thảo là tác phẩm ban đầu của Degas."
                    }
                ]
            },
            {
                "define": {
                    "en": "the result of an action; what is done by somebody",
                    "vi": "kết quả của một hành động; những gì được thực hiện bởi một người nào đó"
                },
                "examples": [
                    {
                        "en": "The damage is clearly the work of vandals.",
                        "vi": "Thiệt hại rõ ràng là tác phẩm của những kẻ phá hoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "activities involving building or repairing something",
                    "vi": "các hoạt động liên quan đến xây dựng hoặc sửa chữa một cái gì đó"
                },
                "examples": [
                    {
                        "en": "roadworks",
                        "vi": "làm đường"
                    },
                    {
                        "en": "They expanded the shipyards and started engineering works.",
                        "vi": "Họ mở rộng xưởng đóng tàu và bắt đầu các công trình kỹ thuật."
                    },
                    {
                        "en": "A contract can ensure that landlords carry out the works for which they are legally responsible.",
                        "vi": "Một hợp đồng có thể đảm bảo rằng chủ nhà thực hiện các công việc mà họ chịu trách nhiệm về mặt pháp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where things are made or industrial processes take place",
                    "vi": "một nơi mà mọi thứ được tạo ra hoặc các quy trình công nghiệp diễn ra"
                },
                "examples": [
                    {
                        "en": "an engineering works",
                        "vi": "một công trình kỹ thuật"
                    },
                    {
                        "en": "a brickworks",
                        "vi": "một công trình xây dựng"
                    },
                    {
                        "en": "Raw materials were carried to the works by barge.",
                        "vi": "Nguyên liệu thô được vận chuyển đến công trình bằng sà lan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the moving parts of a machine, etc.",
                    "vi": "các bộ phận chuyển động của máy, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everything",
                    "vi": "mọi điều"
                },
                "examples": [
                    {
                        "en": "We went to the chip shop and had the works: fish, chips, gherkins, mushy peas.",
                        "vi": "Chúng tôi đến cửa hàng bán khoai tây chiên và có các tác phẩm: cá, khoai tây chiên, gherkins, đậu Hà Lan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of force to produce movement",
                    "vi": "sử dụng lực để tạo ra chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "part of your normal working life and not unusual",
                    "vi": "một phần của cuộc sống làm việc bình thường của bạn và không phải là bất thường"
                },
                "examples": [
                    {
                        "en": "Swimming with sharks or training a tiger cub—it's all in a day's work for animal wrangler Chris Bolton.",
                        "vi": "Bơi cùng cá mập hay huấn luyện một chú hổ con — đó là tất cả công việc trong một ngày của người quấn quít động vật Chris Bolton."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not healthy to spend all your time working; you need to relax too",
                    "vi": "không có lợi cho sức khỏe nếu bạn dành toàn bộ thời gian để làm việc; bạn cũng cần thư giãn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having an effect on something",
                    "vi": "có ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She suspected that secret influences were at work.",
                        "vi": "Cô nghi ngờ rằng có những ảnh hưởng bí mật trong công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "busy doing something",
                    "vi": "bận làm gì đó"
                },
                "examples": [
                    {
                        "en": "He is still at work on the painting.",
                        "vi": "Anh ấy vẫn đang làm việc trên bức tranh."
                    },
                    {
                        "en": "Danger—men at work.",
                        "vi": "Nguy hiểm — những người đàn ông tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who do not have enough to do often start to do wrong",
                    "vi": "những người không có đủ năng lực để làm thường bắt đầu làm sai"
                },
                "examples": [
                    {
                        "en": "She blamed the crimes on the local jobless teenagers. ‘The devil makes work for idle hands,’ she would say.",
                        "vi": "Cô đổ lỗi cho những thanh thiếu niên thất nghiệp tại địa phương. Cô ấy sẽ nói: 'Ma quỷ kiếm việc làm cho những đôi tay nhàn rỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to do) the unpleasant or dishonest jobs that somebody else does not want to do",
                    "vi": "(phải làm) những công việc khó chịu hoặc không trung thực mà người khác không muốn làm"
                },
                "examples": [
                    {
                        "en": "Next time you can get somebody else to do your dirty work for you!",
                        "vi": "Lần sau, bạn có thể nhờ người khác làm công việc bẩn thỉu của bạn cho bạn!"
                    },
                    {
                        "en": "He always gets someone else to do the dirty work for him.",
                        "vi": "Anh ta luôn nhờ người khác làm công việc bẩn thỉu cho mình."
                    },
                    {
                        "en": "The drugs gang used children to do their dirty work for them.",
                        "vi": "Băng đảng ma túy đã sử dụng trẻ em để làm công việc bẩn thỉu của chúng cho chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin; to make a start",
                    "vi": "để bắt đầu; để bắt đầu"
                },
                "examples": [
                    {
                        "en": "We set to work on the outside of the house (= for example, painting it).",
                        "vi": "Chúng tôi bắt đầu làm việc bên ngoài ngôi nhà (= ví dụ: sơn nó)."
                    },
                    {
                        "en": "Let's get to work.",
                        "vi": "Cùng bắt tay vào làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or tell somebody everything",
                    "vi": "để cung cấp cho hoặc nói với ai đó mọi thứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do/start to do your work",
                    "vi": "để làm / bắt đầu làm công việc của bạn"
                },
                "examples": [
                    {
                        "en": "She went cheerfully about her work.",
                        "vi": "Cô ấy vui vẻ đi về công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind acts to help others",
                    "vi": "hành động tốt để giúp đỡ người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be likely to have difficulty doing something",
                    "vi": "có khả năng gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have your work cut out to get there by nine o'clock.",
                        "vi": "Bạn sẽ phải hoàn thành công việc của mình để đến đó trước chín giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is in the works is being discussed, planned or prepared and will happen or exist soon",
                    "vi": "một cái gì đó trong công việc đang được thảo luận, lên kế hoạch hoặc chuẩn bị và sẽ sớm xảy ra hoặc tồn tại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use more time or energy on a task than is necessary",
                    "vi": "sử dụng nhiều thời gian hoặc năng lượng cho một công việc hơn mức cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something quickly and with little effort",
                    "vi": "để làm điều gì đó nhanh chóng và ít nỗ lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to defeat, deal with something/somebody quickly",
                    "vi": "để đánh bại, đối phó với một cái gì đó / ai đó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Liverpool made short work of the opposition (= in a football match).",
                        "vi": "Liverpool đã làm được điều đó với phe đối lập (= trong một trận đấu bóng đá)."
                    },
                    {
                        "en": "He made short work of his lunch (= ate it quickly).",
                        "vi": "Anh ấy đã làm xong bữa trưa của mình (= ăn nhanh)."
                    },
                    {
                        "en": "Mike made short work of fixing the engine.",
                        "vi": "Mike thực hiện công việc sửa chữa động cơ trong thời gian ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a job is made easier if a lot of people help",
                    "vi": "thường nói rằng một công việc sẽ dễ dàng hơn nếu có nhiều người giúp đỡ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is unpleasant, unkind or dishonest",
                    "vi": "một người khó ưa, không tử tế hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Don’t trust him; he’s a nasty piece of work.",
                        "vi": "Đừng tin tưởng anh ta; anh ấy là một công việc khó chịu."
                    },
                    {
                        "en": "He's a thoroughly nasty piece of work.",
                        "vi": "Anh ta là một công việc hoàn toàn khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when somebody has done something well",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi ai đó đã làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "You did a good job today. Nice work, James!",
                        "vi": "Bạn đã làm một công việc tốt ngày hôm nay. Làm tốt lắm, James!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you wish that you had somebody’s success or good luck and think they have achieved it with little effort",
                    "vi": "được sử dụng khi bạn ước rằng bạn có được ai đó thành công hoặc may mắn và nghĩ rằng họ đã đạt được điều đó mà không cần nỗ lực"
                },
                "examples": [
                    {
                        "en": "He was paid £200 for a ten-minute speech? Nice work if you can get it.",
                        "vi": "Anh ta được trả 200 bảng cho một bài phát biểu dài mười phút? Làm tốt lắm nếu bạn có thể nhận được nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to cause) a delay or problem with something that somebody is planning or doing",
                    "vi": "(gây ra) sự chậm trễ hoặc vấn đề với điều gì đó mà ai đó đang lên kế hoạch hoặc làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "needing too much effort",
                    "vi": "cần quá nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I can't be bothered making a hot meal—it's too much like hard work.",
                        "vi": "Tôi không thể làm phiền khi nấu một bữa ăn nóng - nó quá giống như một công việc khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that takes a very short time to do",
                    "vi": "một việc cần một thời gian rất ngắn để làm"
                },
                "examples": [
                    {
                        "en": "It was the work of a few minutes to hide the damage.",
                        "vi": "Đó là công việc của một vài phút để che giấu thiệt hại."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a00efe57ebc465aa1fdfbec3313c27c",
        "word": "excerpt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈeksɜːpt/",
            "us": "/ˈeksɜːrpt/"
        },
        "nearby": [
            {
                "word": "exceptionally",
                "pos": "adverb"
            },
            {
                "word": "excerpt",
                "pos": "verb"
            },
            {
                "word": "excerpt",
                "pos": "noun"
            },
            {
                "word": "excess",
                "pos": "noun"
            },
            {
                "word": "excess",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short piece of writing, music, film, etc. taken from a longer whole",
                    "vi": "một đoạn ngắn của văn bản, nhạc, phim, v.v. được lấy từ một tổng thể dài hơn"
                },
                "examples": [
                    {
                        "en": "Read the following excerpt from one of Milton’s poems.",
                        "vi": "Đọc đoạn trích sau đây từ một trong những bài thơ của Milton."
                    },
                    {
                        "en": "They only played a short excerpt.",
                        "vi": "Họ chỉ chơi một đoạn trích ngắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "3caa4b963e8343ce8e4557842da3278f",
        "word": "journal",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdʒɜːnl/",
            "us": "/ˈdʒɜːrnl/"
        },
        "nearby": [
            {
                "word": "jottings",
                "pos": "noun"
            },
            {
                "word": "joule",
                "pos": "noun"
            },
            {
                "word": "journal",
                "pos": "noun"
            },
            {
                "word": "journalese",
                "pos": "noun"
            },
            {
                "word": "journalism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a newspaper or magazine that deals with a particular subject or profession",
                    "vi": "một tờ báo hoặc tạp chí đề cập đến một chủ đề hoặc nghề nghiệp cụ thể"
                },
                "examples": [
                    {
                        "en": "a scientific/an academic journal",
                        "vi": "một tạp chí khoa học / học thuật"
                    },
                    {
                        "en": "the British Medical Journal",
                        "vi": "Tạp chí Y khoa Anh"
                    },
                    {
                        "en": "the Journal of Experimental Psychology",
                        "vi": "Tạp chí Tâm lý học Thực nghiệm"
                    },
                    {
                        "en": "a trade/professional/specialist journal",
                        "vi": "một tạp chí thương mại / chuyên nghiệp / chuyên gia"
                    },
                    {
                        "en": "an online journal",
                        "vi": "một tạp chí trực tuyến"
                    },
                    {
                        "en": "a journal article",
                        "vi": "một bài báo"
                    },
                    {
                        "en": "in a journal The results of the study are expected to be published in a peer-reviewed journal next month.",
                        "vi": "trên một tạp chí Kết quả của nghiên cứu dự kiến sẽ được công bố trên một tạp chí có bình duyệt vào tháng tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the title of some newspapers",
                    "vi": "được sử dụng trong tiêu đề của một số tờ báo"
                },
                "examples": [
                    {
                        "en": "the Wall Street Journal",
                        "vi": "Tạp chí Phố Wall"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written record of the things you do, see, etc. every day",
                    "vi": "một bản ghi về những việc bạn làm, xem, v.v. hàng ngày"
                },
                "examples": [
                    {
                        "en": "He kept a journal of his travels across Asia.",
                        "vi": "Anh ấy đã ghi nhật ký về những chuyến du lịch khắp châu Á của mình."
                    },
                    {
                        "en": "I'm keeping a food journal for a school science project.",
                        "vi": "Tôi đang viết nhật ký thực phẩm cho một dự án khoa học của trường."
                    },
                    {
                        "en": "Her journal entry for that day describes a thunderstorm.",
                        "vi": "Mục nhập nhật ký của cô ấy cho ngày hôm đó mô tả một cơn giông bão."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfbc056f2e6344188bfe4c0caef6ba06",
        "word": "poem",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpəʊɪm/",
            "us": "/ˈpəʊəm/"
        },
        "nearby": [
            {
                "word": "Podunk",
                "pos": "adjective"
            },
            {
                "word": "Edgar Allan Poe",
                "pos": ""
            },
            {
                "word": "poem",
                "pos": "noun"
            },
            {
                "word": "poesy",
                "pos": "noun"
            },
            {
                "word": "poet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing in which the words are chosen for their sound and the images they suggest, not just for their obvious meanings. The words are arranged in separate lines, usually with a repeated rhythm, and often the lines rhyme at the end.",
                    "vi": "một đoạn viết trong đó các từ được chọn cho âm thanh và hình ảnh mà chúng gợi ý, không chỉ cho ý nghĩa rõ ràng của chúng. Các từ được sắp xếp thành các dòng riêng biệt, thường có nhịp điệu lặp lại, và các dòng này thường có vần ở cuối."
                },
                "examples": [
                    {
                        "en": "His collected poems were published after the war.",
                        "vi": "Những bài thơ sưu tầm của ông đã được xuất bản sau chiến tranh."
                    },
                    {
                        "en": "a prose/an epic poem",
                        "vi": "một bài văn xuôi / một bài thơ sử thi"
                    }
                ]
            }
        ]
    },
    {
        "id": "7236d92714994fdbaf2676c0378c4d2e",
        "word": "quotation",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kwəʊˈteɪʃn/",
            "us": "/kwəʊˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "quotable",
                "pos": "adjective"
            },
            {
                "word": "quota system",
                "pos": "noun"
            },
            {
                "word": "quotation",
                "pos": "noun"
            },
            {
                "word": "quotation marks",
                "pos": "noun"
            },
            {
                "word": "quote",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of words or a short piece of writing taken from a book, play, speech, etc. and repeated because it is interesting or useful",
                    "vi": "một nhóm từ hoặc một đoạn văn bản ngắn được lấy từ một cuốn sách, vở kịch, bài phát biểu, v.v. và được lặp lại vì nó thú vị hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "a dictionary of quotations",
                        "vi": "từ điển danh ngôn"
                    },
                    {
                        "en": "Two short quotations will illustrate my point.",
                        "vi": "Hai trích dẫn ngắn sẽ minh họa quan điểm của tôi."
                    },
                    {
                        "en": "quotation from something The book began with a quotation from Goethe.",
                        "vi": "trích dẫn từ một cái gì đó Cuốn sách bắt đầu với một trích dẫn từ Goethe."
                    },
                    {
                        "en": "a direct quotation from a recent speech by the president",
                        "vi": "một trích dẫn trực tiếp từ một bài phát biểu gần đây của tổng thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of repeating something interesting or useful that another person has written or said",
                    "vi": "hành động lặp lại điều gì đó thú vị hoặc hữu ích mà người khác đã viết hoặc nói"
                },
                "examples": [
                    {
                        "en": "The writer illustrates his point by quotation from a number of sources.",
                        "vi": "Người viết minh họa quan điểm của mình bằng cách trích dẫn từ một số nguồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of how much money a particular piece of work will cost",
                    "vi": "một tuyên bố về số tiền mà một tác phẩm cụ thể sẽ có giá"
                },
                "examples": [
                    {
                        "en": "You need to get a written quotation before they start work.",
                        "vi": "Bạn cần nhận được một báo giá bằng văn bản trước khi họ bắt đầu công việc."
                    },
                    {
                        "en": "We’ll give you a free quotation for replacing your windows.",
                        "vi": "Chúng tôi sẽ cung cấp cho bạn một báo giá miễn phí cho việc thay thế các cửa sổ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of the current value of goods or shares",
                    "vi": "một tuyên bố về giá trị hiện tại của hàng hóa hoặc cổ phiếu"
                },
                "examples": [
                    {
                        "en": "the latest quotations from the Stock Exchange",
                        "vi": "báo giá mới nhất từ Sở giao dịch chứng khoán"
                    },
                    {
                        "en": "It was the first football club to have a full stock market quotation.",
                        "vi": "Đây là câu lạc bộ bóng đá đầu tiên có bảng báo giá đầy đủ trên thị trường chứng khoán."
                    }
                ]
            }
        ]
    },
    {
        "id": "e36afd6f5d56458b95e32d3ff9945720",
        "word": "autobiography",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɔːtəbaɪˈɒɡrəfi/",
            "us": "/ˌɔːtəbaɪˈɑːɡrəfi/"
        },
        "nearby": [
            {
                "word": "auto-",
                "pos": "combining form"
            },
            {
                "word": "autobiographical",
                "pos": "adjective"
            },
            {
                "word": "autobiography",
                "pos": "noun"
            },
            {
                "word": "autochanger",
                "pos": "noun"
            },
            {
                "word": "autochthonous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the story of a person’s life, written by that person; this type of writing",
                    "vi": "câu chuyện về cuộc đời của một người, được viết bởi người đó; loại văn bản này"
                },
                "examples": [
                    {
                        "en": "In his autobiography, he recalls the poverty he grew up in.",
                        "vi": "Trong cuốn tự truyện của mình, anh nhớ lại cuộc sống nghèo khó mà anh lớn lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "6da14f3c39cb4d86beaa96e73af3bb51",
        "word": "bestseller",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌbestˈselə(r)/",
            "us": "/ˌbestˈselər/"
        },
        "nearby": [
            {
                "word": "best practice",
                "pos": "noun"
            },
            {
                "word": "bestride",
                "pos": "verb"
            },
            {
                "word": "bestseller",
                "pos": "noun"
            },
            {
                "word": "bestselling",
                "pos": "adjective"
            },
            {
                "word": "besuited",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a product, usually a book, which is bought by large numbers of people",
                    "vi": "một sản phẩm, thường là sách, được nhiều người mua"
                },
                "examples": [
                    {
                        "en": "the bestseller list",
                        "vi": "danh sách bán chạy nhất"
                    }
                ]
            }
        ]
    },
    {
        "id": "41e6ff0405184200a1ceb59b5d6d04fc",
        "word": "caption",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkæpʃn/",
            "us": "/ˈkæpʃn/"
        },
        "nearby": [
            {
                "word": "captain of industry",
                "pos": "noun"
            },
            {
                "word": "captcha",
                "pos": "noun"
            },
            {
                "word": "caption",
                "pos": "noun"
            },
            {
                "word": "caption",
                "pos": "verb"
            },
            {
                "word": "captivate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that are printed below a picture, cartoon, etc. that explain or describe it",
                    "vi": "các từ được in bên dưới hình ảnh, phim hoạt hình, v.v. giải thích hoặc mô tả nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "862f37bc2c20444cac833a43a247fd31",
        "word": "classic",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈklæsɪk/",
            "us": "/ˈklæsɪk/"
        },
        "nearby": [
            {
                "word": "class-consciousness",
                "pos": "noun"
            },
            {
                "word": "classic",
                "pos": "adjective"
            },
            {
                "word": "classic",
                "pos": "noun"
            },
            {
                "word": "classical",
                "pos": "adjective"
            },
            {
                "word": "classically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book, film or song which is well known and considered to be of very high quality, setting standards for other books, etc.",
                    "vi": "một cuốn sách, bộ phim hoặc bài hát nổi tiếng và được coi là có chất lượng rất cao, đặt ra tiêu chuẩn cho những cuốn sách khác, v.v."
                },
                "examples": [
                    {
                        "en": "The film is now a cult classic.",
                        "vi": "Bộ phim hiện là một tác phẩm kinh điển đình đám."
                    },
                    {
                        "en": "The song became an instant classic.",
                        "vi": "Bài hát trở thành một tác phẩm kinh điển ngay lập tức."
                    },
                    {
                        "en": "The novel may become a modern classic.",
                        "vi": "Cuốn tiểu thuyết có thể trở thành một tác phẩm kinh điển hiện đại."
                    },
                    {
                        "en": "English classics such as ‘Alice in Wonderland’",
                        "vi": "Tác phẩm kinh điển của Anh như 'Alice ở xứ sở thần tiên'"
                    },
                    {
                        "en": "His book is something of a classic of the genre.",
                        "vi": "Cuốn sách của anh ấy là một cuốn sách kinh điển của thể loại này."
                    },
                    {
                        "en": "one of the true classics of French cinema",
                        "vi": "một trong những tác phẩm kinh điển thực sự của điện ảnh Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is an excellent example of its kind",
                    "vi": "một thứ là một ví dụ xuất sắc của loại hình này"
                },
                "examples": [
                    {
                        "en": "That match was a classic.",
                        "vi": "Trận đấu đó là một trận kinh điển."
                    },
                    {
                        "en": "The second goal was an absolute classic.",
                        "vi": "Bàn thắng thứ hai là một bàn thắng kinh điển tuyệt đối."
                    },
                    {
                        "en": "The professor's reply was a classic.",
                        "vi": "Câu trả lời của giáo sư là một câu trả lời kinh điển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing, a vehicle or other item that is admired for its beautiful style or design that is not affected by changes in fashion",
                    "vi": "một bộ quần áo, một chiếc xe hoặc một món đồ khác được ngưỡng mộ vì kiểu dáng hoặc thiết kế đẹp mắt mà không bị ảnh hưởng bởi những thay đổi của thời trang"
                },
                "examples": [
                    {
                        "en": "Classics don't lose their style.",
                        "vi": "Các tác phẩm kinh điển không bị mất phong cách."
                    },
                    {
                        "en": "We pick out some collectors' cars and modern classics.",
                        "vi": "Chúng tôi chọn ra một số xe hơi của các nhà sưu tập và các tác phẩm cổ điển hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of ancient Greek and Roman culture, especially their languages and literature",
                    "vi": "nghiên cứu văn hóa Hy Lạp và La Mã cổ đại, đặc biệt là ngôn ngữ và văn học của họ"
                },
                "examples": [
                    {
                        "en": "a degree in Classics",
                        "vi": "bằng cấp về Kinh điển"
                    }
                ]
            }
        ]
    },
    {
        "id": "cebf685f6b8c4c6d88d26c8511c18ad7",
        "word": "e-book",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈiː bʊk/",
            "us": "/ˈiː bʊk/"
        },
        "nearby": [
            {
                "word": "ebony",
                "pos": "adjective"
            },
            {
                "word": "Ebony",
                "pos": ""
            },
            {
                "word": "e-book",
                "pos": "noun"
            },
            {
                "word": "ebullience",
                "pos": "noun"
            },
            {
                "word": "ebullient",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that is displayed on a computer screen or on an electronic device that is held in the hand, instead of being printed on paper",
                    "vi": "một cuốn sách được hiển thị trên màn hình máy tính hoặc trên thiết bị điện tử được cầm trên tay, thay vì được in trên giấy"
                },
                "examples": [
                    {
                        "en": "You can download unlimited e-books for free.",
                        "vi": "Bạn có thể tải xuống không giới hạn sách điện tử miễn phí."
                    },
                    {
                        "en": "academic e-books in multiple electronic formats",
                        "vi": "sách điện tử học thuật ở nhiều định dạng điện tử"
                    }
                ]
            }
        ]
    },
    {
        "id": "d1bf5323b0e143ada584757f9cfddbf8",
        "word": "edition",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈdɪʃn/",
            "us": "/ɪˈdɪʃn/"
        },
        "nearby": [
            {
                "word": "editable",
                "pos": "adjective"
            },
            {
                "word": "Edith",
                "pos": ""
            },
            {
                "word": "edition",
                "pos": "noun"
            },
            {
                "word": "editor",
                "pos": "noun"
            },
            {
                "word": "editorial",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the form in which a book, newspaper, etc. is published",
                    "vi": "hình thức xuất bản sách, báo, v.v."
                },
                "examples": [
                    {
                        "en": "a paperback/hardback edition",
                        "vi": "một ấn bản bìa mềm / bìa cứng"
                    },
                    {
                        "en": "the print/online edition",
                        "vi": "ấn bản in / trực tuyến"
                    },
                    {
                        "en": "the online edition of ‘The Guardian’",
                        "vi": "ấn bản trực tuyến của 'The Guardian'"
                    },
                    {
                        "en": "a deluxe edition of Mark Twain's ‘Huckleberry Finn’",
                        "vi": "một phiên bản cao cấp của 'Huckleberry Finn' của Mark Twain"
                    },
                    {
                        "en": "a facsimile edition of Dr Johnson's Dictionary of 1755",
                        "vi": "một ấn bản fax của Từ điển Tiến sĩ Johnson năm 1755"
                    }
                ]
            },
            {
                "define": {
                    "en": "a version of a book or other text that is regularly revised",
                    "vi": "phiên bản của một cuốn sách hoặc văn bản khác thường xuyên được sửa đổi"
                },
                "examples": [
                    {
                        "en": "A second edition appeared in 1824.",
                        "vi": "Ấn bản thứ hai xuất hiện vào năm 1824."
                    },
                    {
                        "en": "The dictionary is now in its tenth edition.",
                        "vi": "Từ điển hiện đã được xuất bản lần thứ mười."
                    },
                    {
                        "en": "a revised/an updated/an expanded edition",
                        "vi": "một sửa đổi / một cập nhật / một phiên bản mở rộng"
                    },
                    {
                        "en": "She worked on the previous edition of our Brazil guide.",
                        "vi": "Cô ấy đã làm việc trên ấn bản trước của hướng dẫn Brazil của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular newspaper or magazine, or radio or television programme, especially one in a regular series",
                    "vi": "một tờ báo hoặc tạp chí cụ thể, hoặc chương trình phát thanh hoặc truyền hình, đặc biệt là một trong một loạt bài thông thường"
                },
                "examples": [
                    {
                        "en": "Tonight's edition of ‘Panorama’ looks at unemployment.",
                        "vi": "Ấn bản 'Toàn cảnh' tối nay xem xét tình trạng thất nghiệp."
                    },
                    {
                        "en": "the November edition of ‘Vogue’",
                        "vi": "ấn bản tháng 11 của 'Vogue'"
                    },
                    {
                        "en": "There will be a live edition of the show tomorrow night.",
                        "vi": "Sẽ có một phiên bản trực tiếp của chương trình vào tối mai."
                    },
                    {
                        "en": "in an edition of something The article appeared in the evening edition of ‘The Mercury’.",
                        "vi": "trong một ấn bản của một cái gì đó Bài báo đã xuất hiện trong ấn bản buổi tối của 'The Mercury'."
                    },
                    {
                        "en": "The story was in Tuesday's edition of ‘The New York Times’.",
                        "vi": "Câu chuyện được đăng trên tờ 'The New York Times' vào ngày thứ Ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of copies of a book, newspaper or magazine, etc. published at one time",
                    "vi": "tổng số bản sao của một cuốn sách, tờ báo hoặc tạp chí, v.v. được xuất bản cùng một lúc"
                },
                "examples": [
                    {
                        "en": "It was originally published in 1836 in an edition of 500 copies.",
                        "vi": "Ban đầu nó được xuất bản vào năm 1836 với số lượng 500 bản."
                    },
                    {
                        "en": "Sometimes only part of the edition is printed initially.",
                        "vi": "Đôi khi chỉ một phần của ấn bản được in ban đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "3706116a7fa14782b5a2178ea42564bf",
        "word": "e-reader",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈiː riːdə(r)/",
            "us": "/ˈiː riːdər/"
        },
        "nearby": [
            {
                "word": "erbium",
                "pos": "noun"
            },
            {
                "word": "ere",
                "pos": "conjunction, preposition"
            },
            {
                "word": "e-reader",
                "pos": "noun"
            },
            {
                "word": "erect",
                "pos": "verb"
            },
            {
                "word": "erect",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small device on which you can store and read texts taken from the internet; an application on a device that enables you to do this",
                    "vi": "một thiết bị nhỏ mà bạn có thể lưu trữ và đọc các văn bản lấy từ internet; một ứng dụng trên thiết bị cho phép bạn làm điều này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4054b98a273345269de5f09ec54ca575",
        "word": "leaflet",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈliːflət/",
            "us": "/ˈliːflət/"
        },
        "nearby": [
            {
                "word": "leaf",
                "pos": "verb"
            },
            {
                "word": "leafless",
                "pos": "adjective"
            },
            {
                "word": "leaflet",
                "pos": "noun"
            },
            {
                "word": "leaflet",
                "pos": "verb"
            },
            {
                "word": "leaf mould",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a printed sheet of paper or a few printed pages that are given free to advertise or give information about something",
                    "vi": "một tờ giấy in hoặc một vài trang in được phát miễn phí để quảng cáo hoặc cung cấp thông tin về điều gì đó"
                },
                "examples": [
                    {
                        "en": "We picked up a few leaflets on local places of interest.",
                        "vi": "Chúng tôi nhặt được một vài tờ rơi về các địa điểm tham quan ở địa phương."
                    },
                    {
                        "en": "Pick up a free leaflet from your local post office.",
                        "vi": "Nhận một tờ rơi miễn phí từ bưu điện địa phương của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "efb918de5e4849c49ea752c3f3fd5a0b",
        "word": "set book",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌset ˈbʊk/",
            "us": "/ˌset ˈbʊk/"
        },
        "nearby": [
            {
                "word": "set back",
                "pos": "phrasal verb"
            },
            {
                "word": "setback",
                "pos": "noun"
            },
            {
                "word": "set book",
                "pos": "noun"
            },
            {
                "word": "set down",
                "pos": "phrasal verb"
            },
            {
                "word": "set forth",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that students must study for a particular exam",
                    "vi": "một cuốn sách mà học sinh phải học cho một kỳ thi cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3cc009943bf04a0fbb0f9e97992560c9",
        "word": "set text",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌset ˈtekst/",
            "us": "/ˌset ˈtekst/"
        },
        "nearby": [
            {
                "word": "settee",
                "pos": "noun"
            },
            {
                "word": "setter",
                "pos": "noun"
            },
            {
                "word": "set text",
                "pos": "noun"
            },
            {
                "word": "setting",
                "pos": "noun"
            },
            {
                "word": "settle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that students must study for a particular exam",
                    "vi": "một cuốn sách mà học sinh phải học cho một kỳ thi cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea92c080b7184ae7bb77f5f6805f1d8a",
        "word": "sketch",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/sketʃ/",
            "us": "/sketʃ/"
        },
        "nearby": [
            {
                "word": "skepticism",
                "pos": "noun"
            },
            {
                "word": "skerry",
                "pos": "noun"
            },
            {
                "word": "sketch",
                "pos": "noun"
            },
            {
                "word": "sketch",
                "pos": "verb"
            },
            {
                "word": "sketchbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a simple picture that is drawn quickly and does not have many details",
                    "vi": "một bức tranh đơn giản được vẽ nhanh và không có nhiều chi tiết"
                },
                "examples": [
                    {
                        "en": "The artist is making sketches for his next painting.",
                        "vi": "Người nghệ sĩ đang vẽ phác thảo cho bức tranh tiếp theo của mình."
                    },
                    {
                        "en": "She drew a sketch map of the area to show us the way.",
                        "vi": "Cô ấy đã vẽ một bản đồ phác thảo của khu vực để chỉ đường cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short funny scene on television, in the theatre, etc.",
                    "vi": "một cảnh hài hước ngắn trên truyền hình, trong rạp hát, v.v."
                },
                "examples": [
                    {
                        "en": "The drama group did a sketch about a couple buying a new car.",
                        "vi": "Nhóm kịch đã vẽ phác thảo về một cặp vợ chồng mua một chiếc ô tô mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short report or story that gives only basic details about something",
                    "vi": "một báo cáo hoặc câu chuyện ngắn chỉ cung cấp các chi tiết cơ bản về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a biographical sketch of the prime minister",
                        "vi": "bản phác thảo tiểu sử của thủ tướng"
                    }
                ]
            }
        ]
    },
    {
        "id": "3907ddb408fc4313aa1a4461d1cd0292",
        "word": "volume",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɒljuːm/",
            "us": "/ˈvɑːljəm/"
        },
        "nearby": [
            {
                "word": "voluble",
                "pos": "adjective"
            },
            {
                "word": "volubly",
                "pos": "adverb"
            },
            {
                "word": "volume",
                "pos": "noun"
            },
            {
                "word": "voluminous",
                "pos": "adjective"
            },
            {
                "word": "voluminously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of space that an object or a substance fills; the amount of space that a container has",
                    "vi": "khoảng không gian mà một vật hoặc một chất lấp đầy; lượng không gian mà một thùng chứa có"
                },
                "examples": [
                    {
                        "en": "volume of something How do you measure the volume of a gas?",
                        "vi": "Làm thế nào để đo thể tích của một chất khí?"
                    },
                    {
                        "en": "In the experiment, lighted candles were put under jars of different volumes.",
                        "vi": "Trong thí nghiệm, những ngọn nến được thắp sáng được đặt dưới những chiếc lọ có thể tích khác nhau."
                    },
                    {
                        "en": "Patients showed an improvement in lung volume.",
                        "vi": "Bệnh nhân cho thấy sự cải thiện về thể tích phổi."
                    },
                    {
                        "en": "Wait until the dough doubles in volume before kneading it again.",
                        "vi": "Chờ cho đến khi khối lượng bột tăng gấp đôi trước khi nhào lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of something",
                    "vi": "số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "volume of something the sheer volume (= large amount) of business",
                        "vi": "khối lượng của một cái gì đó khối lượng tuyệt đối (= số lượng lớn) của doanh nghiệp"
                    },
                    {
                        "en": "New roads are being built to cope with the increased volume of traffic.",
                        "vi": "Những con đường mới đang được xây dựng để đối phó với lưu lượng giao thông ngày càng tăng."
                    },
                    {
                        "en": "Sales volumes fell 0.2% in June.",
                        "vi": "Sản lượng tiêu thụ giảm 0,2% trong tháng Sáu."
                    },
                    {
                        "en": "The total volume of exports fell by 14.5 per cent.",
                        "vi": "Tổng khối lượng xuất khẩu giảm 14,5%."
                    },
                    {
                        "en": "an attempt to increase the volume of trade",
                        "vi": "một nỗ lực để tăng khối lượng thương mại"
                    },
                    {
                        "en": "powerful computers that can handle large volumes of data",
                        "vi": "máy tính mạnh mẽ có thể xử lý khối lượng lớn dữ liệu"
                    },
                    {
                        "en": "This work has grown in volume recently.",
                        "vi": "Công việc này đã phát triển về số lượng gần đây."
                    },
                    {
                        "en": "Due to the volume of mail Mary receives, she may not be able to respond to individual inquiries.",
                        "vi": "Do khối lượng thư mà Mary nhận được, cô ấy có thể không trả lời được các câu hỏi riêng lẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of sound that is produced by a television, radio, etc.",
                    "vi": "lượng âm thanh được tạo ra bởi ti vi, đài phát thanh, v.v."
                },
                "examples": [
                    {
                        "en": "to turn the volume up/down",
                        "vi": "để tăng / giảm âm lượng"
                    },
                    {
                        "en": "at a volume This music is best played at very high volume.",
                        "vi": "ở mức âm lượng Bản nhạc này được phát tốt nhất ở mức âm lượng rất lớn."
                    },
                    {
                        "en": "The song has been recorded at a low volume.",
                        "vi": "Bài hát đã được thu âm với âm lượng nhỏ."
                    },
                    {
                        "en": "He adjusted the volume on his phone.",
                        "vi": "Anh điều chỉnh âm lượng trên điện thoại của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that is part of a series of books",
                    "vi": "một cuốn sách là một phần của loạt sách"
                },
                "examples": [
                    {
                        "en": "an encyclopedia in 20 volumes",
                        "vi": "một bách khoa toàn thư gồm 20 tập"
                    },
                    {
                        "en": "The encyclopedia is a huge work, running to 20 volumes.",
                        "vi": "Bộ bách khoa toàn thư là một tác phẩm khổng lồ, dài tới 20 tập."
                    },
                    {
                        "en": "a companion volume to the one on African wildlife",
                        "vi": "một tập đồng hành với một tập về động vật hoang dã Châu Phi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a book",
                    "vi": "một quyển sách"
                },
                "examples": [
                    {
                        "en": "a library of over 50 000 volumes",
                        "vi": "một thư viện hơn 50 000 đầu sách"
                    },
                    {
                        "en": "She published her first book, a slim volume of poetry, at the age of sixteen.",
                        "vi": "Cô xuất bản cuốn sách đầu tiên của mình, một tập thơ mỏng, ở tuổi mười sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of different issues of the same magazine, especially all the issues for one year",
                    "vi": "một loạt các số báo khác nhau của cùng một tạp chí, đặc biệt là tất cả các số báo trong một năm"
                },
                "examples": [
                    {
                        "en": "‘New Scientist’ volume 142, number 3",
                        "vi": "Nhà khoa học mới' tập 142, số 3"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell you a lot about something/somebody, without the need for words",
                    "vi": "để nói với bạn rất nhiều điều về một cái gì đó / ai đó, mà không cần lời nói"
                },
                "examples": [
                    {
                        "en": "His achievement speaks volumes for his determination.",
                        "vi": "Thành tích của anh ấy nói lên quyết tâm của anh ấy."
                    },
                    {
                        "en": "What you wear speaks volumes about you.",
                        "vi": "Những gì bạn mặc nói lên rất nhiều điều về bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "fcdc2a95967f42518ac13c89d273936a",
        "word": "biography",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/baɪˈɒɡrəfi/",
            "us": "/baɪˈɑːɡrəfi/"
        },
        "nearby": [
            {
                "word": "biographer",
                "pos": "noun"
            },
            {
                "word": "biographical",
                "pos": "adjective"
            },
            {
                "word": "biography",
                "pos": "noun"
            },
            {
                "word": "biohazard",
                "pos": "noun"
            },
            {
                "word": "biological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the story of a person’s life written by somebody else; this type of writing",
                    "vi": "câu chuyện về cuộc đời của một người được viết bởi người khác; loại văn bản này"
                },
                "examples": [
                    {
                        "en": "Boswell’s biography of Johnson",
                        "vi": "Tiểu sử của Boswell về Johnson"
                    },
                    {
                        "en": "a biography by Antonia Fraser",
                        "vi": "tiểu sử của Antonia Fraser"
                    },
                    {
                        "en": "The book gives potted biographies of all the major painters.",
                        "vi": "Cuốn sách cung cấp tiểu sử trong chậu của tất cả các họa sĩ lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "51a122a6333e415da911d6a971bbb61f",
        "word": "comic strip",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒmɪk strɪp/",
            "us": "/ˈkɑːmɪk strɪp/"
        },
        "nearby": [
            {
                "word": "comically",
                "pos": "adverb"
            },
            {
                "word": "Comic Relief",
                "pos": ""
            },
            {
                "word": "comic strip",
                "pos": "noun"
            },
            {
                "word": "coming",
                "pos": "noun"
            },
            {
                "word": "coming",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of drawings inside boxes that tell a story and are often published in newspapers",
                    "vi": "một loạt các bức vẽ bên trong hộp kể một câu chuyện và thường được đăng trên báo"
                },
                "examples": [
                    {
                        "en": "He draws comic strips for ‘The Guardian’.",
                        "vi": "Anh ấy vẽ truyện tranh cho 'The Guardian'."
                    }
                ]
            }
        ]
    },
    {
        "id": "92aae0b195da4ed08dc6492cc2fe9e30",
        "word": "graphic novel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɡræfɪk ˈnɒvl/",
            "us": "/ˌɡræfɪk ˈnɑːvl/"
        },
        "nearby": [
            {
                "word": "graphic arts",
                "pos": "noun"
            },
            {
                "word": "graphic equalizer",
                "pos": "noun"
            },
            {
                "word": "graphic novel",
                "pos": "noun"
            },
            {
                "word": "graphics",
                "pos": "noun"
            },
            {
                "word": "graphics adapter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a novel in the form of a comic strip",
                    "vi": "một cuốn tiểu thuyết dưới dạng truyện tranh"
                },
                "examples": [
                    {
                        "en": "Graphic novels can offer exciting stories with stimulating art work.",
                        "vi": "Tiểu thuyết đồ họa có thể mang đến những câu chuyện thú vị với tác phẩm nghệ thuật đầy kích thích."
                    }
                ]
            }
        ]
    },
    {
        "id": "44ec52fe4cfb4710b1bad1211cc436d4",
        "word": "hardback",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːdbæk/",
            "us": "/ˈhɑːrdbæk/"
        },
        "nearby": [
            {
                "word": "hard",
                "pos": "adverb"
            },
            {
                "word": "hard-ass",
                "pos": "adjective"
            },
            {
                "word": "hardback",
                "pos": "noun"
            },
            {
                "word": "hardball",
                "pos": "noun"
            },
            {
                "word": "hard-bitten",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that has a stiff cover",
                    "vi": "một cuốn sách có bìa cứng"
                },
                "examples": [
                    {
                        "en": "What's the price of the hardback?",
                        "vi": "Giá của bìa cứng là bao nhiêu?"
                    },
                    {
                        "en": "in hardback It was published in hardback last year.",
                        "vi": "trong bìa cứng Nó đã được xuất bản trong bìa cứng vào năm ngoái."
                    },
                    {
                        "en": "It’s only available in hardback.",
                        "vi": "Nó chỉ có sẵn trong bìa cứng."
                    },
                    {
                        "en": "hardback books/editions",
                        "vi": "sách / ấn bản bìa cứng"
                    }
                ]
            }
        ]
    },
    {
        "id": "8bff76ba789d476fa4eb8305489b2fbc",
        "word": "hardcover",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːdkʌvə(r)/",
            "us": "/ˈhɑːrdkʌvər/"
        },
        "nearby": [
            {
                "word": "hard-core",
                "pos": "adjective"
            },
            {
                "word": "hard court",
                "pos": "noun"
            },
            {
                "word": "hardcover",
                "pos": "noun"
            },
            {
                "word": "hard currency",
                "pos": "noun"
            },
            {
                "word": "hard disk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that has a stiff cover",
                    "vi": "một cuốn sách có bìa cứng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "975bc8f66e394973b623f45dab3a827b",
        "word": "pamphlet",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpæmflət/",
            "us": "/ˈpæmflət/"
        },
        "nearby": [
            {
                "word": "pampas grass",
                "pos": "noun"
            },
            {
                "word": "pamper",
                "pos": "verb"
            },
            {
                "word": "pamphlet",
                "pos": "noun"
            },
            {
                "word": "pamphleteer",
                "pos": "noun"
            },
            {
                "word": "pan1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very thin book with a paper cover, containing information about a particular subject",
                    "vi": "một cuốn sách rất mỏng có bìa giấy, chứa thông tin về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "The government provides a pamphlet for all immigrants, outlining their rights.",
                        "vi": "Chính phủ cung cấp một cuốn sách nhỏ cho tất cả những người nhập cư, phác thảo các quyền của họ."
                    },
                    {
                        "en": "He dismissed claims published in pamphlets that the King's powers had been usurped.",
                        "vi": "Ông bác bỏ những tuyên bố được xuất bản trong các tập sách nhỏ rằng quyền lực của Nhà vua đã bị soán ngôi."
                    },
                    {
                        "en": "accusations that were made in the pamphlet",
                        "vi": "những lời buộc tội đã được đưa ra trong cuốn sách nhỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "060375a2bd7642dabf647d6b3161fdbb",
        "word": "paperback",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpeɪpəbæk/",
            "us": "/ˈpeɪpərbæk/"
        },
        "nearby": [
            {
                "word": "paper",
                "pos": "noun"
            },
            {
                "word": "paper",
                "pos": "verb"
            },
            {
                "word": "paperback",
                "pos": "noun"
            },
            {
                "word": "paperboard",
                "pos": "noun"
            },
            {
                "word": "paper boy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that has a thick paper cover",
                    "vi": "một cuốn sách có bìa dày"
                },
                "examples": [
                    {
                        "en": "a cheap paperback",
                        "vi": "một bìa mềm giá rẻ"
                    },
                    {
                        "en": "in paperback When is it coming out in paperback?",
                        "vi": "trong bìa mềm Khi nào nó được phát hành trong bìa mềm?"
                    },
                    {
                        "en": "a paperback book/edition",
                        "vi": "một cuốn sách / ấn bản bìa mềm"
                    }
                ]
            }
        ]
    },
    {
        "id": "9f27347b66e94ab19f2bff1382a8d536",
        "word": "prose",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/prəʊz/",
            "us": "/prəʊz/"
        },
        "nearby": [
            {
                "word": "proscribe",
                "pos": "verb"
            },
            {
                "word": "proscription",
                "pos": "noun"
            },
            {
                "word": "prose",
                "pos": "noun"
            },
            {
                "word": "Prosecco",
                "pos": "noun"
            },
            {
                "word": "prosecute",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "writing that is not poetry",
                    "vi": "viết mà không phải là thơ"
                },
                "examples": [
                    {
                        "en": "the author’s clear elegant prose (= style of writing)",
                        "vi": "văn xuôi thanh lịch rõ ràng của tác giả (= phong cách viết)"
                    },
                    {
                        "en": "I plan out an essay in note form before writing it up in continuous prose.",
                        "vi": "Tôi lập kế hoạch cho một bài luận dưới dạng ghi chú trước khi viết nó thành văn xuôi liên tục."
                    },
                    {
                        "en": "a passage in prose",
                        "vi": "một đoạn văn trong văn xuôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "fae4cd07ddb44eff81dac30c95ea0e33",
        "word": "strip cartoon",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌstrɪp kɑːˈtuːn/",
            "us": "/ˌstrɪp kɑːrˈtuːn/"
        },
        "nearby": [
            {
                "word": "strip",
                "pos": "verb"
            },
            {
                "word": "the Strip",
                "pos": ""
            },
            {
                "word": "strip cartoon",
                "pos": "noun"
            },
            {
                "word": "strip club",
                "pos": "noun"
            },
            {
                "word": "stripe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of drawings inside boxes that tell a story and are often published in newspapers",
                    "vi": "một loạt các bức vẽ bên trong hộp kể một câu chuyện và thường được đăng trên báo"
                },
                "examples": [
                    {
                        "en": "He draws strip cartoons for ‘The Guardian’.",
                        "vi": "Anh ấy vẽ phim hoạt hình dải cho 'The Guardian'."
                    }
                ]
            }
        ]
    },
    {
        "id": "62ba682bd23c441aa0bdbd8822b4ee4d",
        "word": "trilogy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtrɪlədʒi/",
            "us": "/ˈtrɪlədʒi/"
        },
        "nearby": [
            {
                "word": "trillion",
                "pos": "number"
            },
            {
                "word": "trilobite",
                "pos": "noun"
            },
            {
                "word": "trilogy",
                "pos": "noun"
            },
            {
                "word": "trim",
                "pos": "verb"
            },
            {
                "word": "trim",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of three books, films, etc. that have the same subject or characters",
                    "vi": "một nhóm ba cuốn sách, bộ phim, v.v. có cùng chủ đề hoặc nhân vật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6cb2e6dea3144c2a9bf37eaa53a33f0f",
        "word": "codex",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkəʊdeks/",
            "us": "/ˈkəʊdeks/"
        },
        "nearby": [
            {
                "word": "code-switching",
                "pos": "noun"
            },
            {
                "word": "code word",
                "pos": "noun"
            },
            {
                "word": "codex",
                "pos": "noun"
            },
            {
                "word": "codfish",
                "pos": "noun"
            },
            {
                "word": "codger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ancient text in the form of a book",
                    "vi": "một văn bản cổ dưới dạng một cuốn sách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an official list of medicines or chemicals",
                    "vi": "danh sách chính thức của thuốc hoặc hóa chất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2478fb62893d466ea298e64871cbfeb5",
        "word": "dime novel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaɪm nɒvl/",
            "us": "/ˈdaɪm nɑːvl/"
        },
        "nearby": [
            {
                "word": "Joe DiMaggio",
                "pos": ""
            },
            {
                "word": "dime",
                "pos": "noun"
            },
            {
                "word": "dime novel",
                "pos": "noun"
            },
            {
                "word": "dimension",
                "pos": "noun"
            },
            {
                "word": "dimensional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cheap popular novel, usually an exciting adventure or romantic story",
                    "vi": "một cuốn tiểu thuyết bình dân rẻ tiền, thường là một cuộc phiêu lưu thú vị hoặc một câu chuyện lãng mạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e034a3b9b59f4f7cb314c781306781f0",
        "word": "fanzine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfænziːn/",
            "us": "/ˈfænziːn/"
        },
        "nearby": [
            {
                "word": "fantasy",
                "pos": "noun"
            },
            {
                "word": "fantasy football",
                "pos": "noun"
            },
            {
                "word": "fanzine",
                "pos": "noun"
            },
            {
                "word": "FAO",
                "pos": "abbreviation"
            },
            {
                "word": "FAO Schwarz",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a magazine that is written and read by fans of a musician, sports team, etc.",
                    "vi": "một tạp chí được viết và đọc bởi những người hâm mộ nhạc sĩ, đội thể thao, v.v."
                },
                "examples": [
                    {
                        "en": "The first science fiction fanzine was published in 1930.",
                        "vi": "Fanzine khoa học viễn tưởng đầu tiên được xuất bản vào năm 1930."
                    }
                ]
            }
        ]
    },
    {
        "id": "12d6aeabf5784d5485f2580ad7fd5640",
        "word": "hagiography",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhæɡiˈɒɡrəfi/",
            "us": "/ˌhæɡiˈɑːɡrəfi/"
        },
        "nearby": [
            {
                "word": "haggle",
                "pos": "verb"
            },
            {
                "word": "hagiographer",
                "pos": "noun"
            },
            {
                "word": "hagiography",
                "pos": "noun"
            },
            {
                "word": "hah",
                "pos": "exclamation"
            },
            {
                "word": "hai",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book about the life of a person that praises them too much; this style of writing",
                    "vi": "một cuốn sách về cuộc đời của một người mà ca ngợi họ quá nhiều; phong cách viết này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "writing about the lives of saints (= Christian holy people)",
                    "vi": "viết về cuộc đời của các vị thánh (= những người thánh của đạo Cơ đốc)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a9722ded529c4b3cb0c250a52bbf3924",
        "word": "lampoon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/læmˈpuːn/",
            "us": "/læmˈpuːn/"
        },
        "nearby": [
            {
                "word": "lamplit",
                "pos": "adjective"
            },
            {
                "word": "lampoon",
                "pos": "verb"
            },
            {
                "word": "lampoon",
                "pos": "noun"
            },
            {
                "word": "lamp post",
                "pos": "noun"
            },
            {
                "word": "lamprey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing that criticizes somebody/something and makes them/it look silly",
                    "vi": "một đoạn văn chỉ trích ai đó / cái gì đó và khiến họ / trông thật ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "Such lampoons of royalty were previously found only in the foreign press.",
                        "vi": "Những ngọn đèn hoàng gia như vậy trước đây chỉ được tìm thấy trên báo chí nước ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ec5593978da4dd682d9f115fac84c99",
        "word": "marginalia",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɑːdʒɪˈneɪliə/",
            "us": "/ˌmɑːrdʒɪˈneɪliə/"
        },
        "nearby": [
            {
                "word": "marginal",
                "pos": "adjective"
            },
            {
                "word": "marginal",
                "pos": "noun"
            },
            {
                "word": "marginalia",
                "pos": "noun"
            },
            {
                "word": "marginalization",
                "pos": "noun"
            },
            {
                "word": "marginalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "notes written in the margins of a book, etc.",
                    "vi": "ghi chú được viết bên lề của một cuốn sách, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "facts or details that are not very important",
                    "vi": "sự kiện hoặc chi tiết không quan trọng lắm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "904376f3efc8494e8f08bd524feb1b36",
        "word": "monograph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəɡrɑːf/",
            "us": "/ˈmɑːnəɡræf/"
        },
        "nearby": [
            {
                "word": "monogram",
                "pos": "noun"
            },
            {
                "word": "monogrammed",
                "pos": "adjective"
            },
            {
                "word": "monograph",
                "pos": "noun"
            },
            {
                "word": "monokini",
                "pos": "noun"
            },
            {
                "word": "monolingual",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a detailed written study of a single subject, usually in the form of a short book",
                    "vi": "một nghiên cứu bằng văn bản chi tiết về một chủ đề, thường ở dạng một cuốn sách ngắn"
                },
                "examples": [
                    {
                        "en": "He has published several books on Cubism and numerous monographs on individual artists.",
                        "vi": "Ông đã xuất bản một số cuốn sách về Chủ nghĩa Lập thể và nhiều sách chuyên khảo về các nghệ sĩ cá nhân."
                    }
                ]
            }
        ]
    },
    {
        "id": "934e2523b4f9482d992641abab057d1d",
        "word": "monologue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəlɒɡ/",
            "us": "/ˈmɑːnəlɔːɡ/"
        },
        "nearby": [
            {
                "word": "monolith",
                "pos": "noun"
            },
            {
                "word": "monolithic",
                "pos": "adjective"
            },
            {
                "word": "monologue",
                "pos": "noun"
            },
            {
                "word": "monomania",
                "pos": "noun"
            },
            {
                "word": "monomer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long speech by one person during a conversation that stops other people from speaking or expressing an opinion",
                    "vi": "một bài phát biểu dài của một người trong cuộc trò chuyện khiến người khác không thể phát biểu hoặc bày tỏ ý kiến"
                },
                "examples": [
                    {
                        "en": "He went into a long monologue about life in America.",
                        "vi": "Anh ấy đã đi vào một đoạn độc thoại dài về cuộc sống ở Mỹ."
                    },
                    {
                        "en": "She launched into a long monologue about how wonderful the company was.",
                        "vi": "Cô ấy bắt đầu một đoạn độc thoại dài về công ty tuyệt vời như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long speech in a play, film, etc. spoken by one actor, especially when alone",
                    "vi": "một bài phát biểu dài trong một vở kịch, bộ phim, v.v. do một diễn viên nói, đặc biệt là khi ở một mình"
                },
                "examples": [
                    {
                        "en": "She delivered her monologue in a deadpan voice.",
                        "vi": "Cô độc thoại bằng một giọng cụt ngủn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a dramatic story, especially in verse, told or performed by one person",
                    "vi": "một câu chuyện kịch tính, đặc biệt là ở dạng câu thơ, do một người kể hoặc trình diễn"
                },
                "examples": [
                    {
                        "en": "an entertainer who does comic monologues",
                        "vi": "một nghệ sĩ giải trí độc thoại truyện tranh"
                    }
                ]
            }
        ]
    },
    {
        "id": "c24a9ad572ea4259b8c26fdd42e2a255",
        "word": "novella",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nəˈvelə/",
            "us": "/nəˈvelə/"
        },
        "nearby": [
            {
                "word": "novelist",
                "pos": "noun"
            },
            {
                "word": "novelistic",
                "pos": "adjective"
            },
            {
                "word": "novella",
                "pos": "noun"
            },
            {
                "word": "Ivor Novello",
                "pos": ""
            },
            {
                "word": "novelty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short novel",
                    "vi": "một cuốn tiểu thuyết ngắn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "982d47b62e2544838fbd6da3e9a69862",
        "word": "oeuvre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɜːvrə/",
            "us": "/ˈɜːvrə/"
        },
        "nearby": [
            {
                "word": "oestrogen",
                "pos": "noun"
            },
            {
                "word": "oestrus",
                "pos": "noun"
            },
            {
                "word": "oeuvre",
                "pos": "noun"
            },
            {
                "word": "of",
                "pos": "preposition"
            },
            {
                "word": "Ofcom",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the works of a writer, artist, etc.",
                    "vi": "tất cả các tác phẩm của một nhà văn, nghệ sĩ, v.v."
                },
                "examples": [
                    {
                        "en": "Picasso’s oeuvre",
                        "vi": "Picasso's oeuvre"
                    },
                    {
                        "en": "She created an oeuvre that is both refreshing and overwhelming.",
                        "vi": "Cô ấy đã tạo ra một oeuvre vừa sảng khoái vừa choáng ngợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "58d4cdca7f8849a2a3a874a490c479f9",
        "word": "parody",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpærədi/",
            "us": "/ˈpærədi/"
        },
        "nearby": [
            {
                "word": "parochial school",
                "pos": "noun"
            },
            {
                "word": "parodist",
                "pos": "noun"
            },
            {
                "word": "parody",
                "pos": "noun"
            },
            {
                "word": "parody",
                "pos": "verb"
            },
            {
                "word": "parole",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing, music, acting, etc. that deliberately copies the style of somebody/something in order to be humorous",
                    "vi": "một đoạn văn bản, âm nhạc, diễn xuất, v.v. cố tình sao chép phong cách của ai đó / điều gì đó để gây hài hước"
                },
                "examples": [
                    {
                        "en": "a parody of a horror film",
                        "vi": "một bộ phim kinh dị nhại lại"
                    },
                    {
                        "en": "His personality made him an easy subject for parody.",
                        "vi": "Tính cách của anh khiến anh trở thành đối tượng dễ bị bắt chước."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is such a bad or an unfair example of something that it seems silly",
                    "vi": "một cái gì đó thật tồi tệ hoặc một ví dụ không công bằng về một cái gì đó mà nó có vẻ ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "The trial was a parody of justice.",
                        "vi": "Phiên tòa là một sự nhại lại công lý."
                    },
                    {
                        "en": "This article is a grotesque parody of the truth.",
                        "vi": "Bài báo này là một sự bắt chước kỳ cục của sự thật."
                    }
                ]
            }
        ]
    },
    {
        "id": "7db153e6a1784b61b7f7e2849bec6f04",
        "word": "photonovel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊtəʊnɒvl/",
            "us": "/ˈfəʊtəʊnɑːvl/"
        },
        "nearby": [
            {
                "word": "photomontage",
                "pos": "noun"
            },
            {
                "word": "photon",
                "pos": "noun"
            },
            {
                "word": "photonovel",
                "pos": "noun"
            },
            {
                "word": "photo opportunity",
                "pos": "noun"
            },
            {
                "word": "photorealism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a novel in which the story is told by means of a series of photographs, using speech bubbles or captions to show what the characters are saying and to explain what is happening",
                    "vi": "một cuốn tiểu thuyết trong đó câu chuyện được kể bằng một loạt ảnh, sử dụng bong bóng thoại hoặc chú thích để cho biết các nhân vật đang nói gì và giải thích điều gì đang xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "317d1d7afaf14b1e997683e5a667fe11",
        "word": "potboiler",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒtbɔɪlə(r)/",
            "us": "/ˈpɑːtbɔɪlər/"
        },
        "nearby": [
            {
                "word": "pot belly",
                "pos": "noun"
            },
            {
                "word": "potbelly stove",
                "pos": "noun"
            },
            {
                "word": "potboiler",
                "pos": "noun"
            },
            {
                "word": "pot-bound",
                "pos": "adjective"
            },
            {
                "word": "pot cheese",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book, a play, etc. that is produced only to earn money quickly",
                    "vi": "một cuốn sách, một vở kịch, v.v. được sản xuất chỉ để kiếm tiền nhanh chóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "230c9a1fef44466eb773366bcca216f8",
        "word": "prose poem",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprəʊz pəʊɪm/",
            "us": "/ˈprəʊz pəʊəm/"
        },
        "nearby": [
            {
                "word": "prosecutor",
                "pos": "noun"
            },
            {
                "word": "proselytize",
                "pos": "verb"
            },
            {
                "word": "prose poem",
                "pos": "noun"
            },
            {
                "word": "pro shop",
                "pos": "noun"
            },
            {
                "word": "prosodic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing that uses the language and ideas associated with poetry, but is not in verse form",
                    "vi": "một bài viết sử dụng ngôn ngữ và ý tưởng kết hợp với thơ, nhưng không ở dạng câu thơ."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f4c757c873304fe08a476957a8e1962e",
        "word": "psalm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sɑːm/",
            "us": "/sɑːm/"
        },
        "nearby": [
            {
                "word": "pry",
                "pos": "verb"
            },
            {
                "word": "PS",
                "pos": "noun"
            },
            {
                "word": "psalm",
                "pos": "noun"
            },
            {
                "word": "psalter",
                "pos": "noun"
            },
            {
                "word": "PSAT",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a song, poem or prayer that praises God, especially one in the Bible",
                    "vi": "một bài hát, bài thơ hoặc lời cầu nguyện ca ngợi Chúa, đặc biệt là bài hát trong Kinh thánh"
                },
                "examples": [
                    {
                        "en": "the Book of Psalms",
                        "vi": "Sách Thi thiên"
                    }
                ]
            }
        ]
    }
]