[
    {
        "id": "9129ecbe618a49c48e69dbe2ebe6d5ee",
        "word": "help",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/help/",
            "us": "/help/"
        },
        "nearby": [
            {
                "word": "helmsman",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "verb"
            },
            {
                "word": "help",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "exclamation"
            },
            {
                "word": "help desk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of helping somebody to do something",
                    "vi": "hành động giúp ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Thank you for all your help.",
                        "vi": "Cảm ơn bạn cho tất cả sự giúp đỡ của bạn."
                    },
                    {
                        "en": "to ask/call/appeal for help",
                        "vi": "yêu cầu / gọi / khiếu nại để được giúp đỡ"
                    },
                    {
                        "en": "The offer of help came too late.",
                        "vi": "Lời đề nghị giúp đỡ đã đến quá muộn."
                    },
                    {
                        "en": "help with something Do you need any help with that?",
                        "vi": "giúp đỡ về điều gì Bạn có cần giúp gì không?"
                    },
                    {
                        "en": "of help (to somebody) Can I be of any help to you?",
                        "vi": "giúp đỡ (cho ai đó) Tôi có thể giúp được gì cho bạn không?"
                    },
                    {
                        "en": "with help from somebody/something With help from a parent, a child can do simple cooking.",
                        "vi": "với sự giúp đỡ của ai đó / cái gì đó Với sự giúp đỡ của cha mẹ, một đứa trẻ có thể nấu ăn đơn giản."
                    },
                    {
                        "en": "with the help of somebody/something She recovered with the help of her family and friends.",
                        "vi": "với sự giúp đỡ của ai đó / cái gì đó Cô ấy đã bình phục với sự giúp đỡ của gia đình và bạn bè của cô ấy."
                    },
                    {
                        "en": "He attended university with the help of a scholarship.",
                        "vi": "Anh ấy đã theo học đại học với sự trợ giúp của một học bổng."
                    },
                    {
                        "en": "without the help of somebody/something None of this would have been possible without their help.",
                        "vi": "Nếu không có sự giúp đỡ của ai đó / cái gì đó Không ai trong số này có thể thực hiện được nếu không có sự giúp đỡ của họ."
                    },
                    {
                        "en": "They have at last decided to enlist the help of experts.",
                        "vi": "Cuối cùng họ đã quyết định tranh thủ sự giúp đỡ của các chuyên gia."
                    },
                    {
                        "en": "They can usually manage by themselves, but occasionally need outside help.",
                        "vi": "Họ thường có thể tự xoay sở, nhưng đôi khi cần sự trợ giúp từ bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of helping somebody who is in danger",
                    "vi": "hành động giúp đỡ ai đó đang gặp nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Quick, get help!",
                        "vi": "Nhanh lên, nhận trợ giúp!"
                    },
                    {
                        "en": "She screamed for help.",
                        "vi": "Cô hét lên để được giúp đỡ."
                    },
                    {
                        "en": "His suicide attempt was really a cry for help.",
                        "vi": "Nỗ lực tự tử của anh thực sự là một tiếng kêu cứu."
                    }
                ]
            },
            {
                "define": {
                    "en": "advice, money, etc. that is given to somebody in order to solve their problems",
                    "vi": "lời khuyên, tiền bạc, v.v. được đưa cho ai đó để giải quyết vấn đề của họ"
                },
                "examples": [
                    {
                        "en": "professional/medical/financial help",
                        "vi": "trợ giúp chuyên môn / y tế / tài chính"
                    },
                    {
                        "en": "I decided to seek legal help.",
                        "vi": "Tôi quyết định tìm kiếm sự trợ giúp pháp lý."
                    },
                    {
                        "en": "help in doing something The organization offers practical help in dealing with paperwork.",
                        "vi": "giúp đỡ trong việc làm gì đó Tổ chức cung cấp sự trợ giúp thiết thực trong việc giải quyết các thủ tục giấy tờ."
                    },
                    {
                        "en": "help with something You should qualify for help with the costs of running a car.",
                        "vi": "giúp đỡ một cái gì đó Bạn nên đủ điều kiện để được giúp đỡ về chi phí chạy xe."
                    },
                    {
                        "en": "help for somebody The charity provides emergency help for refugees.",
                        "vi": "giúp đỡ cho ai đó Tổ chức từ thiện cung cấp trợ giúp khẩn cấp cho những người tị nạn."
                    },
                    {
                        "en": "help from somebody Get help from someone who understands the legal side.",
                        "vi": "trợ giúp từ ai đó Nhận trợ giúp từ người hiểu rõ về mặt pháp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "a function on a computer, phone, etc. that provides information on how to use the computer, phone, etc.",
                    "vi": "một chức năng trên máy tính, điện thoại, v.v. cung cấp thông tin về cách sử dụng máy tính, điện thoại, v.v."
                },
                "examples": [
                    {
                        "en": "The online help is very good.",
                        "vi": "Sự trợ giúp trực tuyến là rất tốt."
                    },
                    {
                        "en": "a help file/page/menu/screen",
                        "vi": "tệp trợ giúp / trang / menu / màn hình"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being useful",
                    "vi": "thực tế là hữu ích"
                },
                "examples": [
                    {
                        "en": "The map wasn't much help.",
                        "vi": "Bản đồ không giúp được gì nhiều."
                    },
                    {
                        "en": "Was the information I gave you any help?",
                        "vi": "Thông tin tôi đã cung cấp cho bạn có giúp được gì không?"
                    },
                    {
                        "en": "Just shouting at him isn't going to be a lot of help.",
                        "vi": "Chỉ hét vào mặt anh ta sẽ không giúp ích được nhiều."
                    },
                    {
                        "en": "with the help of something I managed to understand it with the help of a dictionary.",
                        "vi": "với sự trợ giúp của một thứ gì đó, tôi đã cố gắng hiểu được nó với sự trợ giúp của từ điển."
                    },
                    {
                        "en": "of help (to somebody) The course they sent me on was of no help whatsoever!",
                        "vi": "giúp đỡ (cho ai đó) Khóa học mà họ đã gửi cho tôi không giúp ích được gì!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that helps somebody",
                    "vi": "một người hoặc một việc giúp đỡ ai đó"
                },
                "examples": [
                    {
                        "en": "She was more of a hindrance than a help.",
                        "vi": "Cô ấy là một trở ngại nhiều hơn là một sự giúp đỡ."
                    },
                    {
                        "en": "It's a great help having you around.",
                        "vi": "Đó là một sự trợ giúp tuyệt vời khi có bạn ở bên."
                    },
                    {
                        "en": "Your advice was a big help.",
                        "vi": "Lời khuyên của bạn là một trợ giúp lớn."
                    },
                    {
                        "en": "a help to somebody She's been a big help to her father.",
                        "vi": "một sự giúp đỡ cho ai đó Cô ấy là một người giúp đỡ rất nhiều cho cha cô ấy."
                    },
                    {
                        "en": "(ironic) You're a great help, I must say!",
                        "vi": "(mỉa mai) Tôi phải nói rằng bạn là một người giúp đỡ tuyệt vời!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person or people employed by somebody to clean their house, etc.",
                    "vi": "người hoặc những người được ai đó thuê để dọn dẹp nhà cửa của họ, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is not possible to avoid doing something that may harm somebody in some way",
                    "vi": "không thể tránh làm điều gì đó có thể gây hại cho ai đó theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "There's no help for it. We shall have to call the police.",
                        "vi": "Không có trợ giúp cho nó. Chúng tôi sẽ phải gọi cảnh sát."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0a6713215eb4c57bbb23e29439dc6aa",
        "word": "alarm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈlɑːm/",
            "us": "/əˈlɑːrm/"
        },
        "nearby": [
            {
                "word": "à la mode",
                "pos": "adjective, adverb"
            },
            {
                "word": "Alan",
                "pos": ""
            },
            {
                "word": "alarm",
                "pos": "noun"
            },
            {
                "word": "alarm",
                "pos": "verb"
            },
            {
                "word": "alarm call",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loud noise or a signal that warns people of danger or of a problem",
                    "vi": "một tiếng ồn lớn hoặc một tín hiệu cảnh báo mọi người đang gặp nguy hiểm hoặc sự cố"
                },
                "examples": [
                    {
                        "en": "She decided to sound the alarm (= warn people that the situation was dangerous).",
                        "vi": "Cô ấy quyết định phát ra âm thanh báo động (= cảnh báo mọi người rằng tình hình rất nguy hiểm)."
                    },
                    {
                        "en": "I hammered on all the doors to raise the alarm.",
                        "vi": "Tôi đập vào tất cả các cửa để báo động."
                    },
                    {
                        "en": "By the time the alarm was raised the intruders had escaped.",
                        "vi": "Vào thời điểm báo động được nâng lên, những kẻ đột nhập đã trốn thoát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that warns people of a particular danger, or that a particular person is in danger",
                    "vi": "một thiết bị cảnh báo mọi người về một mối nguy hiểm cụ thể hoặc một người cụ thể đang gặp nguy hiểm"
                },
                "examples": [
                    {
                        "en": "a burglar/fire/smoke alarm",
                        "vi": "báo trộm / báo cháy / báo khói"
                    },
                    {
                        "en": "The cat set off the alarm (= made it start ringing).",
                        "vi": "Con mèo đã tắt chuông báo thức (= làm cho nó bắt đầu đổ chuông)."
                    },
                    {
                        "en": "A car alarm went off in the middle of the night (= started ringing).",
                        "vi": "Một chiếc báo động ô tô kêu vào lúc nửa đêm (= bắt đầu đổ chuông)."
                    },
                    {
                        "en": "Carry a personal alarm with you.",
                        "vi": "Mang theo một báo động cá nhân với bạn."
                    },
                    {
                        "en": "Install an alarm system and learn how to use it.",
                        "vi": "Cài đặt hệ thống báo động và học cách sử dụng nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ringing sound or a tune played by a clock or your phone after you have set it to play at a particular time to wake you up",
                    "vi": "âm thanh đổ chuông hoặc một giai điệu được phát bởi đồng hồ hoặc điện thoại của bạn sau khi bạn đã cài đặt để phát vào một thời điểm cụ thể để đánh thức bạn"
                },
                "examples": [
                    {
                        "en": "The alarm went off at 7 o'clock.",
                        "vi": "Chuông báo thức kêu lúc 7 giờ."
                    },
                    {
                        "en": "I set my alarm for 6.30.",
                        "vi": "Tôi đặt báo thức lúc 6 giờ 30."
                    }
                ]
            },
            {
                "define": {
                    "en": "fear and worry that somebody feels when something dangerous or unpleasant might happen",
                    "vi": "sợ hãi và lo lắng rằng ai đó cảm thấy khi điều gì đó nguy hiểm hoặc khó chịu có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "in alarm What have you done?’ Ellie cried in alarm.",
                        "vi": "trong báo động Bạn đã làm gì? ' Ellie kêu lên trong cảnh báo."
                    },
                    {
                        "en": "I felt a growing sense of alarm when he did not return that night.",
                        "vi": "Tôi cảm thấy lo lắng ngày càng tăng khi anh ấy không trở về vào đêm hôm đó."
                    },
                    {
                        "en": "The doctor said there was no cause for alarm.",
                        "vi": "Bác sĩ nói không có nguyên nhân nào đáng báo động."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you say that alarm bells are ringing, you mean that people are starting to feel worried and to suspect that something is wrong",
                    "vi": "nếu bạn nói rằng chuông báo thức đang reo, bạn có nghĩa là mọi người bắt đầu cảm thấy lo lắng và nghi ngờ rằng có điều gì đó không ổn"
                },
                "examples": [
                    {
                        "en": "The government’s proposal has set alarm bells ringing for people on low incomes.",
                        "vi": "Đề xuất của chính phủ đã gióng lên hồi chuông cảnh báo đối với những người có thu nhập thấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "261b93b0566e42669ab77da7f1a96adf",
        "word": "escape",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈskeɪp/",
            "us": "/ɪˈskeɪp/"
        },
        "nearby": [
            {
                "word": "escalope",
                "pos": "noun"
            },
            {
                "word": "escapade",
                "pos": "noun"
            },
            {
                "word": "escape",
                "pos": "verb"
            },
            {
                "word": "escape",
                "pos": "noun"
            },
            {
                "word": "escape clause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get away from a place where you have been kept as a prisoner or not allowed to leave",
                    "vi": "rời khỏi một nơi mà bạn đã bị giam giữ như một tù nhân hoặc không được phép rời khỏi"
                },
                "examples": [
                    {
                        "en": "Two prisoners have escaped.",
                        "vi": "Hai tù nhân đã trốn thoát."
                    },
                    {
                        "en": "They were caught trying to escape.",
                        "vi": "Họ đã bị bắt khi cố gắng trốn thoát."
                    },
                    {
                        "en": "escape from somebody/something He escaped from prison this morning.",
                        "vi": "trốn thoát khỏi ai đó / cái gì đó Anh ấy đã trốn khỏi nhà tù sáng nay."
                    },
                    {
                        "en": "She attempted to escape from the pirates holding her hostage.",
                        "vi": "Cô cố gắng trốn thoát khỏi những tên cướp biển đang giữ cô làm con tin."
                    },
                    {
                        "en": "escape somebody/something She managed to escape her captors.",
                        "vi": "thoát khỏi ai đó / cái gì đó Cô ấy đã cố gắng thoát khỏi những kẻ bắt giữ cô ấy."
                    },
                    {
                        "en": "He escaped prison with two other inmates.",
                        "vi": "Anh ta đã vượt ngục cùng với hai bạn tù khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get away from or avoid something unpleasant or dangerous",
                    "vi": "để tránh xa hoặc tránh điều gì đó khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Although he had no idea what life there would be like, he had to take the chance to escape.",
                        "vi": "Mặc dù anh không biết cuộc sống ở đó sẽ như thế nào, nhưng anh phải chớp lấy cơ hội để trốn thoát."
                    },
                    {
                        "en": "escape from something She managed to escape from the burning car.",
                        "vi": "thoát khỏi một cái gì đó Cô đã cố gắng thoát khỏi chiếc xe đang cháy."
                    },
                    {
                        "en": "escape into/to something (figurative) As a child he would often escape into a dream world of his own.",
                        "vi": "trốn vào một cái gì đó (nghĩa bóng) Khi còn nhỏ, anh thường trốn vào một thế giới mơ ước của riêng mình."
                    },
                    {
                        "en": "We were able to escape to the countryside during the summer months.",
                        "vi": "Chúng tôi đã có thể trốn về nông thôn trong những tháng mùa hè."
                    },
                    {
                        "en": "escape with something I escaped with only minor injuries.",
                        "vi": "trốn thoát với một cái gì đó Tôi đã trốn thoát với chỉ bị thương nhẹ."
                    },
                    {
                        "en": "+ adj. Both drivers escaped unhurt.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "to escape unharmed/uninjured/unscathed",
                        "vi": "để thoát khỏi bình an / không bị thương / không bị thương"
                    },
                    {
                        "en": "escape something She was lucky to escape punishment.",
                        "vi": "thoát khỏi cái gì đó Cô đã may mắn thoát khỏi sự trừng phạt."
                    },
                    {
                        "en": "They were glad to have escaped the clutches of winter for another year.",
                        "vi": "Họ vui mừng vì đã thoát khỏi nanh vuốt của mùa đông trong một năm nữa."
                    },
                    {
                        "en": "The pilot escaped death by seconds.",
                        "vi": "Phi công thoát chết trong giây lát."
                    },
                    {
                        "en": "There was no escaping the fact that he was overweight.",
                        "vi": "Không có gì thoát khỏi sự thật rằng anh ấy đã quá cân."
                    },
                    {
                        "en": "escape doing something He narrowly escaped being killed.",
                        "vi": "thoát khỏi làm điều gì đó Anh ta thoát khỏi bị giết trong gang tấc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be forgotten or not noticed",
                    "vi": "bị lãng quên hoặc không được chú ý"
                },
                "examples": [
                    {
                        "en": "Her name escapes me (= I can't remember it).",
                        "vi": "Tên của cô ấy thoát khỏi tôi (= Tôi không thể nhớ nó)."
                    },
                    {
                        "en": "It might have escaped your notice, but I'm very busy at the moment.",
                        "vi": "Nó có thể đã thoát khỏi thông báo của bạn, nhưng tôi đang rất bận vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get out of a container, especially through a hole",
                    "vi": "ra khỏi thùng chứa, đặc biệt là qua một cái lỗ"
                },
                "examples": [
                    {
                        "en": "Put a lid on to prevent heat escaping.",
                        "vi": "Đậy nắp để ngăn nhiệt thoát ra ngoài."
                    },
                    {
                        "en": "escape into something toxic waste escaping into the sea",
                        "vi": "thoát vào một cái gì đó chất thải độc hại thoát ra biển"
                    }
                ]
            },
            {
                "define": {
                    "en": "to come out from your mouth without you intending it to",
                    "vi": "phát ra từ miệng của bạn mà bạn không có ý định"
                },
                "examples": [
                    {
                        "en": "A groan escaped her lips.",
                        "vi": "Một tiếng rên rỉ thoát ra khỏi môi cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to prevent or avoid loss or damage when it is already too late to do so",
                    "vi": "để cố gắng ngăn ngừa hoặc tránh mất mát hoặc thiệt hại khi đã quá muộn để làm như vậy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65eb456ee58347f3a234287a925a7760",
        "word": "escape",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈskeɪp/",
            "us": "/ɪˈskeɪp/"
        },
        "nearby": [
            {
                "word": "escapade",
                "pos": "noun"
            },
            {
                "word": "escape",
                "pos": "verb"
            },
            {
                "word": "escape",
                "pos": "noun"
            },
            {
                "word": "escape clause",
                "pos": "noun"
            },
            {
                "word": "escaped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or a method of escaping from a place or an unpleasant or dangerous situation",
                    "vi": "hành động hoặc phương pháp trốn thoát khỏi một nơi hoặc một tình huống khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "I had a narrow escape (= I was lucky to have escaped).",
                        "vi": "Tôi đã có một lối thoát trong gang tấc (= Tôi đã may mắn thoát chết)."
                    },
                    {
                        "en": "He had a lucky escape when his car skidded out of control.",
                        "vi": "Anh ta đã may mắn thoát chết khi chiếc xe của anh ta trượt khỏi tầm kiểm soát."
                    },
                    {
                        "en": "As soon as he turned his back, she would make her escape.",
                        "vi": "Ngay khi anh quay lưng lại, cô sẽ khiến cô trốn thoát."
                    },
                    {
                        "en": "escape from something an escape from a prisoner of war camp",
                        "vi": "trốn thoát khỏi một cái gì đó một cuộc trốn thoát khỏi trại tù binh chiến tranh"
                    },
                    {
                        "en": "There was no hope of escape from her disastrous marriage.",
                        "vi": "Không có hy vọng thoát khỏi cuộc hôn nhân thảm khốc của cô."
                    },
                    {
                        "en": "He took an elaborate escape route from South Africa to Britain.",
                        "vi": "Anh ta đã thực hiện một con đường trốn thoát phức tạp từ Nam Phi đến Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of forgetting something unpleasant or difficult for a short time",
                    "vi": "một cách để quên đi điều gì đó khó chịu hoặc khó khăn trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Craig finds escape in dreams.",
                        "vi": "Craig tìm thấy lối thoát trong những giấc mơ."
                    },
                    {
                        "en": "escape from something For her, travel was an escape from the boredom of her everyday life.",
                        "vi": "thoát khỏi một cái gì đó Đối với cô, du lịch là một lối thoát khỏi sự nhàm chán của cuộc sống hàng ngày của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of a liquid, gas, etc. coming out of a pipe or container by accident; the amount that comes out",
                    "vi": "thực tế là một chất lỏng, khí, vv vô tình thoát ra khỏi đường ống hoặc thùng chứa; số tiền đi ra"
                },
                "examples": [
                    {
                        "en": "an escape of gas",
                        "vi": "thoát khí"
                    }
                ]
            },
            {
                "define": {
                    "en": "a button on a computer keyboard that you press to stop a particular operation or leave a program",
                    "vi": "một nút trên bàn phím máy tính mà bạn nhấn để dừng một thao tác cụ thể hoặc rời khỏi chương trình"
                },
                "examples": [
                    {
                        "en": "Press escape to get back to the menu.",
                        "vi": "Nhấn phím thoát để quay lại menu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to escape completely",
                    "vi": "quản lý để thoát khỏi hoàn toàn"
                },
                "examples": [
                    {
                        "en": "He made good his escape from a crowd of journalists by jumping over a barrier.",
                        "vi": "Anh ta đã trốn thoát tốt khỏi đám đông nhà báo bằng cách nhảy qua hàng rào."
                    },
                    {
                        "en": "I found an open door and made good my escape.",
                        "vi": "Tôi đã tìm thấy một cánh cửa rộng mở và đã trốn thoát tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "7409e1c940c0432d9ed9e44ba69dcfbb",
        "word": "guard",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɡɑːd/",
            "us": "/ɡɑːrd/"
        },
        "nearby": [
            {
                "word": "guarantor",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "verb"
            },
            {
                "word": "guard against",
                "pos": "phrasal verb"
            },
            {
                "word": "guard dog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to protect property, places or people from attack or danger",
                    "vi": "để bảo vệ tài sản, địa điểm hoặc con người khỏi bị tấn công hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Armed officers guarded the entrance.",
                        "vi": "Các sĩ quan có vũ trang bảo vệ lối vào."
                    },
                    {
                        "en": "The dog was guarding its owner's luggage.",
                        "vi": "Chú chó đang canh giữ hành lý của chủ nhân."
                    },
                    {
                        "en": "political leaders guarded by the police",
                        "vi": "các nhà lãnh đạo chính trị được cảnh sát bảo vệ"
                    },
                    {
                        "en": "You can't get in; the whole place is guarded.",
                        "vi": "Bạn không thể vào được; toàn bộ nơi được canh gác."
                    },
                    {
                        "en": "(figurative) The recipe is a closely guarded secret.",
                        "vi": "(nghĩa bóng) Công thức là một bí mật được bảo vệ chặt chẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent prisoners from escaping",
                    "vi": "để ngăn chặn tù nhân trốn thoát"
                },
                "examples": [
                    {
                        "en": "The prisoners were guarded by soldiers.",
                        "vi": "Các tù nhân được canh gác bởi những người lính."
                    }
                ]
            }
        ]
    },
    {
        "id": "0b9f5bc4d2794effb27e87ee5db75f3e",
        "word": "look out",
        "pos": "phrasal verb",
        "level": "b1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "look on as",
                "pos": "phrasal verb"
            },
            {
                "word": "look on with",
                "pos": "phrasal verb"
            },
            {
                "word": "look out",
                "pos": "phrasal verb"
            },
            {
                "word": "lookout",
                "pos": "noun"
            },
            {
                "word": "look out for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to warn somebody to be careful, especially when there is danger",
                    "vi": "được sử dụng để cảnh báo ai đó hãy cẩn thận, đặc biệt là khi có nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Look out! There's a car coming.",
                        "vi": "Coi chưng! Có một chiếc ô tô đang chạy tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to search for something from among your possessions",
                    "vi": "để tìm kiếm thứ gì đó trong số tài sản của bạn"
                },
                "examples": [
                    {
                        "en": "I'll look out those old photographs you wanted to see.",
                        "vi": "Tôi sẽ xem những bức ảnh cũ mà bạn muốn xem."
                    }
                ]
            }
        ]
    },
    {
        "id": "c40f81c74a7d49e2aa80c636cb241395",
        "word": "mind",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/maɪnd/",
            "us": "/maɪnd/"
        },
        "nearby": [
            {
                "word": "mincing",
                "pos": "adjective"
            },
            {
                "word": "mind",
                "pos": "noun"
            },
            {
                "word": "mind",
                "pos": "verb"
            },
            {
                "word": "Mind",
                "pos": ""
            },
            {
                "word": "mind-altering",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be upset, annoyed or worried by something",
                    "vi": "buồn bã, khó chịu hoặc lo lắng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "mind (something) I don't mind the cold—it's the rain I don't like.",
                        "vi": "tâm trí (cái gì đó) Tôi không bận tâm đến cái lạnh - đó là cơn mưa mà tôi không thích."
                    },
                    {
                        "en": "I hope you don't mind the noise.",
                        "vi": "Tôi hy vọng bạn không bận tâm đến tiếng ồn."
                    },
                    {
                        "en": "He wouldn't have minded so much if she'd told him the truth.",
                        "vi": "Anh sẽ không bận tâm nhiều đến vậy nếu cô nói cho anh biết sự thật."
                    },
                    {
                        "en": "mind about something Did she mind about not getting the job?",
                        "vi": "tâm trí về điều gì Cô ấy có phiền về việc không nhận được công việc không?"
                    },
                    {
                        "en": "mind doing something Did she mind not getting the job?",
                        "vi": "phiền làm gì đó Cô ấy có phiền khi không nhận được công việc không?"
                    },
                    {
                        "en": "mind somebody/something doing something Do your parents mind you leaving home?",
                        "vi": "phiền ai đó / cái gì đó đang làm gì đó. Bố mẹ bạn có phiền bạn bỏ nhà đi không?"
                    },
                    {
                        "en": "(formal) Do your parents mind your leaving home?",
                        "vi": "(trang trọng) Bố mẹ bạn có phiền khi bạn rời nhà không?"
                    },
                    {
                        "en": "mind how, what, etc… She never minded how hot it was.",
                        "vi": "nhớ làm thế nào, cái gì, vv… Cô ấy không bao giờ bận tâm nó nóng như thế nào."
                    },
                    {
                        "en": "mind that… He minded that he hadn't been asked.",
                        "vi": "nhớ rằng… Anh ấy bận tâm rằng anh ấy đã không được hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask for permission to do something, or to ask somebody in a polite way to do something",
                    "vi": "được sử dụng để xin phép làm điều gì đó hoặc yêu cầu ai đó làm điều gì đó một cách lịch sự"
                },
                "examples": [
                    {
                        "en": "Do you mind if I open the window?",
                        "vi": "Bạn có phiền không nếu tôi mở cửa sổ?"
                    },
                    {
                        "en": "mind somebody doing something Are you married, if you don't mind me asking?",
                        "vi": "phiền ai đó đang làm gì đó Bạn đã kết hôn, nếu bạn không phiền tôi hỏi?"
                    },
                    {
                        "en": "(formal) Are you married, if you don't mind my asking?",
                        "vi": "(trang trọng) Bạn đã kết hôn chưa, nếu bạn không phiền lời yêu cầu của tôi?"
                    },
                    {
                        "en": "mind doing something Would you mind explaining that again, please?",
                        "vi": "phiền làm gì đó Bạn có vui lòng giải thích điều đó một lần nữa không?"
                    },
                    {
                        "en": "Do you mind driving? I'm feeling pretty tired.",
                        "vi": "Bạn có phiền khi lái xe không? Tôi cảm thấy khá mệt mỏi."
                    },
                    {
                        "en": "Would you mind terribly if I went on my own?",
                        "vi": "Bạn có phiền kinh khủng không nếu tôi đi một mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to not care or not be concerned about something",
                    "vi": "không quan tâm hoặc không quan tâm đến điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Would you like tea or coffee?’ ‘I don't mind—either's fine.’",
                        "vi": "Bạn muốn dùng trà hay cà phê?' \"Tôi không phiền - cũng được.\""
                    },
                    {
                        "en": "mind somebody Don't mind her—she didn't mean what she said.",
                        "vi": "phiền ai đó Đừng bận tâm cô ấy — cô ấy không cố ý những gì cô ấy nói."
                    },
                    {
                        "en": "Don't mind me (= don't let me disturb you)—I'll just sit here quietly.",
                        "vi": "Don't mind me (= đừng để tôi làm phiền bạn) —Tôi sẽ chỉ ngồi đây yên lặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing to do something",
                    "vi": "sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I don't mind helping if you can't find anyone else.",
                        "vi": "Tôi không ngại giúp nếu bạn không tìm được ai khác."
                    },
                    {
                        "en": "They had thought the boys wouldn't mind sharing; as it turned out, they minded bitterly.",
                        "vi": "Họ đã nghĩ rằng các chàng trai sẽ không ngại chia sẻ; hóa ra, họ nghĩ một cách cay đắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to be careful about something or warn them about a danger",
                    "vi": "được sử dụng để nói với ai đó hãy cẩn thận về điều gì đó hoặc cảnh báo họ về một mối nguy hiểm"
                },
                "examples": [
                    {
                        "en": "mind something Mind (= Don't fall on) that step!",
                        "vi": "tâm trí gì đó Tâm trí (= Đừng rơi vào) bước đó!"
                    },
                    {
                        "en": "Mind your head! (= for example, be careful you don't hit it on a low ceiling)",
                        "vi": "Hãy để tâm đến cái đầu của bạn! (= ví dụ, hãy cẩn thận, bạn không đánh nó ở trần thấp)"
                    },
                    {
                        "en": "Mind your language! (= don't speak in a rude or offensive way)",
                        "vi": "Cẩn thận với lời ăn tiếng nói! (= không nói một cách thô lỗ hoặc xúc phạm)"
                    },
                    {
                        "en": "mind how, where, etc… Mind how you go! (= often used when you say goodbye to somebody)",
                        "vi": "nhớ như thế nào, ở đâu, vv… Nhớ cách bạn đi! (= thường được sử dụng khi bạn nói lời tạm biệt với ai đó)"
                    },
                    {
                        "en": "Mind where you're treading!",
                        "vi": "Nhớ nơi bạn đang giẫm chân!"
                    },
                    {
                        "en": "mind (that)… Mind you don't cut yourself—that knife's very sharp.",
                        "vi": "nhớ (điều đó)… Xin đừng tự cắt mình — con dao đó rất sắc."
                    },
                    {
                        "en": "You must be home for dinner, mind.",
                        "vi": "Bạn phải ở nhà để ăn tối, tâm trí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay attention to what somebody says, and obey them",
                    "vi": "chú ý đến những gì ai đó nói và tuân theo họ"
                },
                "examples": [
                    {
                        "en": "And the moral of the story is: always mind your mother!",
                        "vi": "Và đạo lý của câu chuyện là: hãy luôn nhớ đến mẹ bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of somebody/something",
                    "vi": "chăm sóc ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Who's minding the children this evening?",
                        "vi": "Ai đang để ý đến bọn trẻ tối nay?"
                    },
                    {
                        "en": "Could you mind my bags for a moment?",
                        "vi": "Bạn có thể phiền túi của tôi một chút không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are annoyed about something that somebody has just said or done",
                    "vi": "được sử dụng để cho thấy rằng bạn đang khó chịu về điều gì đó mà ai đó vừa nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "Do you mind? I was here before you.",
                        "vi": "Bạn có phiền? Tôi đã ở đây trước bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying, especially when you are talking about something that may be embarrassing for you",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói, đặc biệt là khi bạn đang nói về điều gì đó có thể khiến bạn xấu hổ"
                },
                "examples": [
                    {
                        "en": "I was scared, I don't mind telling you!",
                        "vi": "Em sợ lắm, anh không ngại nói cho em biết!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say politely that you would like something you have been offered",
                    "vi": "được sử dụng để nói một cách lịch sự rằng bạn muốn một cái gì đó bạn đã được cung cấp"
                },
                "examples": [
                    {
                        "en": "‘Cup of tea, Brian?’ ‘I don't mind if I do.’",
                        "vi": "Tách trà, Brian? 'Tôi không phiền nếu tôi làm thế.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to check that somebody does not object to something you want to do, or to ask somebody politely to do something",
                    "vi": "được sử dụng để kiểm tra xem ai đó không phản đối điều gì đó bạn muốn làm hoặc để yêu cầu ai đó làm điều gì đó một cách lịch sự"
                },
                "examples": [
                    {
                        "en": "I'd like to ask you a few questions, if you don't mind.",
                        "vi": "Tôi muốn hỏi bạn một vài câu hỏi, nếu bạn không phiền."
                    },
                    {
                        "en": "Can you read that form carefully, if you wouldn't mind, and then sign it.",
                        "vi": "Bạn có thể đọc kỹ mẫu đơn đó không, nếu bạn không phiền, và sau đó ký tên."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you object to something that somebody has said or done",
                    "vi": "được sử dụng để cho thấy rằng bạn phản đối điều gì đó mà ai đó đã nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "I give the orders around here, if you don't mind.",
                        "vi": "Tôi ra lệnh quanh đây, nếu bạn không phiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refuse an offer politely",
                    "vi": "đã từng từ chối một lời đề nghị một cách lịch sự"
                },
                "examples": [
                    {
                        "en": "‘Will you come with us tonight?’ ‘I won't, if you don't mind—I've got a lot of work to do.’",
                        "vi": "Bạn có đi với chúng tôi tối nay không?' \"Tôi sẽ không, nếu bạn không phiền - Tôi có rất nhiều việc phải làm.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are going to criticize somebody or say something that might upset them",
                    "vi": "được sử dụng khi bạn định chỉ trích ai đó hoặc nói điều gì đó có thể khiến họ khó chịu"
                },
                "examples": [
                    {
                        "en": "That colour doesn't really suit you, if you don't mind my saying so.",
                        "vi": "Màu đó không thực sự phù hợp với bạn, nếu bạn không phiền khi tôi nói như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say politely that you would very much like something/to do something",
                    "vi": "được sử dụng để nói một cách lịch sự rằng bạn rất muốn điều gì đó / làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I wouldn't mind a cup of coffee, if it's no trouble.",
                        "vi": "Tôi sẽ không ngại một tách cà phê, nếu nó không có vấn đề gì."
                    },
                    {
                        "en": "I wouldn't mind having his money!",
                        "vi": "Tôi sẽ không phiền khi có tiền của anh ta!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful about what you say in order not to upset or offend somebody",
                    "vi": "cẩn thận về những gì bạn nói để không làm ai đó khó chịu hoặc xúc phạm"
                },
                "examples": [
                    {
                        "en": "Watch your language, young man!",
                        "vi": "Hãy xem ngôn ngữ của bạn, chàng trai trẻ!"
                    },
                    {
                        "en": "The referee told the players to mind their language.",
                        "vi": "Trọng tài nói với các cầu thủ để ý đến ngôn ngữ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think about your own affairs and not ask questions about or try to get involved in other people’s lives",
                    "vi": "nghĩ về công việc của riêng bạn và không đặt câu hỏi hoặc cố gắng tham gia vào cuộc sống của người khác"
                },
                "examples": [
                    {
                        "en": "‘What are you reading?’ ‘Mind your own business!’",
                        "vi": "Bạn đang đọc gì vậy?' 'Hãy để tâm đến việc riêng của bạn!'"
                    },
                    {
                        "en": "I was just sitting there, minding my own business, when a man started shouting at me.",
                        "vi": "Tôi chỉ đang ngồi đó, để tâm đến việc riêng của mình, thì một người đàn ông bắt đầu hét vào mặt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in the most polite way you can",
                    "vi": "cư xử theo cách lịch sự nhất mà bạn có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in charge of something for a short time while somebody is away",
                    "vi": "phụ trách một việc gì đó trong một thời gian ngắn khi ai đó đi vắng"
                },
                "examples": [
                    {
                        "en": "Who's minding the shop while the boss is abroad?",
                        "vi": "Ai đang trông coi cửa hàng trong khi ông chủ đang ở nước ngoài?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to walk carefully",
                    "vi": "đi bộ cẩn thận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a careful and sensible way",
                    "vi": "cư xử một cách cẩn thận và hợp lý"
                },
                "examples": [
                    {
                        "en": "You’d better watch your step with him if you don’t want trouble.",
                        "vi": "Tốt hơn hết bạn nên theo dõi bước đi của mình cùng anh ấy nếu không muốn gặp rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to add something to what you have just said, especially something that makes it less strong",
                    "vi": "được sử dụng để thêm một cái gì đó vào những gì bạn vừa nói, đặc biệt là một cái gì đó làm cho nó kém mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "I've heard they're getting divorced. Mind you, I'm not surprised—they were always arguing.",
                        "vi": "Tôi nghe nói họ sắp ly hôn. Xin phiền bạn, tôi không ngạc nhiên — họ luôn tranh cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to worry or be upset",
                    "vi": "được sử dụng để nói với ai đó đừng lo lắng hoặc buồn bã"
                },
                "examples": [
                    {
                        "en": "Have you broken it? Never mind, we can buy another one.",
                        "vi": "Bạn đã phá vỡ nó? Đừng bận tâm, chúng ta có thể mua một cái khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that something is not important",
                    "vi": "được sử dụng để gợi ý rằng một cái gì đó không quan trọng"
                },
                "examples": [
                    {
                        "en": "This isn't where I intended to take you—but never mind, it's just as good.",
                        "vi": "Đây không phải là nơi tôi định đưa bạn đến — nhưng đừng bận tâm, nó vẫn tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that what is true about the first thing you have said is even more true about the second",
                    "vi": "được sử dụng để nhấn mạnh rằng điều đúng về điều đầu tiên bạn đã nói thậm chí còn đúng hơn về điều thứ hai"
                },
                "examples": [
                    {
                        "en": "I never thought she'd win once, never mind twice!",
                        "vi": "Tôi chưa bao giờ nghĩ rằng cô ấy sẽ thắng một lần, đừng bận tâm đến hai lần!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody they shouldn’t think about something or do something because it is not as important as something else, or because you will do it",
                    "vi": "được sử dụng để nói với ai đó rằng họ không nên nghĩ về điều gì đó hoặc làm điều gì đó bởi vì nó không quan trọng bằng điều gì đó khác, hoặc bởi vì bạn sẽ làm điều đó"
                },
                "examples": [
                    {
                        "en": "Never mind your car—what about the damage to my fence?",
                        "vi": "Đừng bận tâm đến chiếc xe của bạn — còn hàng rào của tôi thì sao?"
                    },
                    {
                        "en": "Never mind washing the dishes—I'll do them later.",
                        "vi": "Đừng bận tâm đến việc rửa bát - tôi sẽ làm sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that one thing is a surprising contrast to another",
                    "vi": "thường nói rằng một thứ là một sự tương phản đáng ngạc nhiên với một thứ khác"
                },
                "examples": [
                    {
                        "en": "The big house is a status symbol—never mind the fact that most of the rooms will be empty.",
                        "vi": "Ngôi nhà lớn là một biểu tượng địa vị — đừng bận tâm đến thực tế là hầu hết các phòng sẽ trống."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to ask about something because you are not going to tell them",
                    "vi": "được sử dụng để nói với ai đó đừng hỏi về điều gì đó bởi vì bạn sẽ không nói với họ"
                },
                "examples": [
                    {
                        "en": "‘Who told you about it?’ ‘Never you mind!’",
                        "vi": "Ai đã nói với bạn về điều đó?' 'Đừng bận tâm!'"
                    },
                    {
                        "en": "Never you mind how I found out—it's true, isn't it?",
                        "vi": "Đừng bận tâm về cách tôi phát hiện ra - đó là sự thật, phải không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "600bd1a54aab4c98bbccab566d66779d",
        "word": "safety measure",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈseɪfti meʒə(r)/",
            "us": "/ˈseɪfti meʒər/"
        },
        "nearby": [
            {
                "word": "safety lamp",
                "pos": "noun"
            },
            {
                "word": "safety match",
                "pos": "noun"
            },
            {
                "word": "safety measure",
                "pos": "noun"
            },
            {
                "word": "safety net",
                "pos": "noun"
            },
            {
                "word": "safety pin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you do in order to prevent something bad or dangerous from happening",
                    "vi": "điều gì đó mà bạn làm để ngăn điều gì đó xấu hoặc nguy hiểm xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "10d35ee3578d4c59b63a343269814e04",
        "word": "guard",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɡɑːd/",
            "us": "/ɡɑːrd/"
        },
        "nearby": [
            {
                "word": "guarantee",
                "pos": "noun"
            },
            {
                "word": "guarantor",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "verb"
            },
            {
                "word": "guard against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, such as a soldier, a police officer or a prison officer, who protects a place or people, or prevents prisoners from escaping",
                    "vi": "một người, chẳng hạn như một người lính, một sĩ quan cảnh sát hoặc một viên chức quản giáo, người bảo vệ một địa điểm hoặc người dân, hoặc ngăn cản các tù nhân trốn thoát"
                },
                "examples": [
                    {
                        "en": "prison/border guards",
                        "vi": "nhà tù / lính biên phòng"
                    },
                    {
                        "en": "The building is protected by armed guards.",
                        "vi": "Tòa nhà được bảo vệ bởi lực lượng bảo vệ có vũ trang."
                    },
                    {
                        "en": "The prisoner slipped past the guards on the gate and escaped.",
                        "vi": "Người tù vượt qua các lính canh trên cổng và trốn thoát."
                    },
                    {
                        "en": "A guard was posted outside the building.",
                        "vi": "Một bảo vệ được bố trí bên ngoài tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or duty of protecting property, places or people from attack or danger; the act or duty of preventing prisoners from escaping",
                    "vi": "hành động hoặc nghĩa vụ bảo vệ tài sản, địa điểm hoặc con người khỏi bị tấn công hoặc nguy hiểm; hành động hoặc nhiệm vụ ngăn cản tù nhân trốn thoát"
                },
                "examples": [
                    {
                        "en": "on guard a sentry on guard (= at his or her post, on duty)",
                        "vi": "canh gác một lính canh canh gác (= tại trụ sở của anh ta hoặc cô ta, đang làm nhiệm vụ)"
                    },
                    {
                        "en": "to be on guard duty",
                        "vi": "làm nhiệm vụ bảo vệ"
                    },
                    {
                        "en": "under guard The escaped prisoner was brought back under armed guard.",
                        "vi": "dưới sự canh gác Người tù vượt ngục được đưa trở lại dưới sự canh gác có vũ trang."
                    },
                    {
                        "en": "The terrorist was kept under police guard.",
                        "vi": "Kẻ khủng bố đã bị cảnh sát canh giữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people, such as soldiers or police officers, who protect somebody/something",
                    "vi": "một nhóm người, chẳng hạn như binh lính hoặc cảnh sát, những người bảo vệ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "the captain of the guard",
                        "vi": "đội trưởng đội bảo vệ"
                    },
                    {
                        "en": "the changing of the guard (= when one group replaces another)",
                        "vi": "sự thay đổi của người bảo vệ (= khi một nhóm thay thế nhóm khác)"
                    },
                    {
                        "en": "The guard is/are being inspected today.",
                        "vi": "Người bảo vệ đã / đang được kiểm tra ngày hôm nay."
                    },
                    {
                        "en": "Fellow airmen provided a guard of honour at his wedding.",
                        "vi": "Các phi công đã bảo vệ danh dự cho đám cưới của anh ta."
                    },
                    {
                        "en": "The president always travels with an armed guard.",
                        "vi": "Tổng thống luôn đi cùng một vệ sĩ có vũ trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK and some other countries) special regiments of soldiers whose original duty was to protect the king or queen",
                    "vi": "(ở Anh và một số quốc gia khác) các trung đoàn lính đặc biệt có nhiệm vụ ban đầu là bảo vệ nhà vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "the Scots Guards",
                        "vi": "Đội bảo vệ người Scotland"
                    },
                    {
                        "en": "a Guards officer",
                        "vi": "một sĩ quan bảo vệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that covers a part of a person’s body or a dangerous part of a machine to prevent injury",
                    "vi": "thứ gì đó che phủ một phần cơ thể của một người hoặc một bộ phận nguy hiểm của máy móc để ngăn ngừa thương tích"
                },
                "examples": [
                    {
                        "en": "All players wear helmets and face guards.",
                        "vi": "Tất cả các cầu thủ đều đội mũ bảo hiểm và đeo kính bảo vệ mặt."
                    },
                    {
                        "en": "Ensure the guard is in place before operating the machine.",
                        "vi": "Đảm bảo có thiết bị bảo vệ trước khi vận hành máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "conductor (= a person who is in charge of a train and travels with it, but does not drive it)",
                    "vi": "người điều khiển (= người phụ trách đoàn tàu và đi cùng với nó, nhưng không lái nó)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a position you take to defend yourself, especially in a sport such as boxing or fencing",
                    "vi": "một vị trí bạn thực hiện để tự vệ, đặc biệt là trong một môn thể thao như quyền anh hoặc đấu kiếm"
                },
                "examples": [
                    {
                        "en": "to drop/keep up your guard",
                        "vi": "để giảm / giữ cảnh giác của bạn"
                    },
                    {
                        "en": "(figurative) In spite of the awkward questions the minister never let his guard fall for a moment.",
                        "vi": "(nghĩa bóng) Bất chấp những câu hỏi khó xử, bộ trưởng không bao giờ để mất cảnh giác trong giây lát."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the two players on a basketball team who are mainly responsible for staying close to players of the other team to stop them from scoring",
                    "vi": "một trong hai cầu thủ của đội bóng rổ chịu trách nhiệm chính trong việc theo sát các cầu thủ của đội kia để ngăn họ ghi bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the two players on an American football team who play either side of the centre forward",
                    "vi": "một trong hai cầu thủ của đội bóng đá Mỹ chơi ở hai bên tiền đạo trung tâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very careful and prepared for something difficult or dangerous",
                    "vi": "phải rất cẩn thận và chuẩn bị cho một cái gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "He was always on his guard against moneymaking schemes.",
                        "vi": "Anh luôn cảnh giác trước những âm mưu kiếm tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop being careful and preparing yourself for possible danger or difficulty",
                    "vi": "ngừng cẩn thận và chuẩn bị cho mình đối với nguy hiểm hoặc khó khăn có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "You can never drop your guard with a two-year-old.",
                        "vi": "Bạn không bao giờ có thể mất cảnh giác với một đứa trẻ hai tuổi."
                    },
                    {
                        "en": "Even when he's winning, he never drops his guard.",
                        "vi": "Ngay cả khi anh ấy đang chiến thắng, anh ấy không bao giờ mất cảnh giác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch or protect somebody/something",
                    "vi": "để theo dõi hoặc bảo vệ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Four soldiers stood guard over the coffin.",
                        "vi": "Bốn người lính đứng canh quan tài."
                    },
                    {
                        "en": "One of the men kept guard, while the other broke into the house.",
                        "vi": "Một trong hai người đàn ông canh giữ, trong khi người kia đột nhập vào nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "not careful or prepared for something difficult or dangerous",
                    "vi": "không cẩn thận hoặc chuẩn bị cho một cái gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The lawyer’s apparently innocent question was designed to catch the witness off (his) guard.",
                        "vi": "Câu hỏi có vẻ vô tội của luật sư được thiết kế để khiến nhân chứng mất cảnh giác (của anh ta)."
                    }
                ]
            }
        ]
    },
    {
        "id": "dd058bd05e1e4e4790804106864e5492",
        "word": "harmless",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɑːmləs/",
            "us": "/ˈhɑːrmləs/"
        },
        "nearby": [
            {
                "word": "harmfully",
                "pos": "adverb"
            },
            {
                "word": "harmfulness",
                "pos": "noun"
            },
            {
                "word": "harmless",
                "pos": "adjective"
            },
            {
                "word": "harmlessly",
                "pos": "adverb"
            },
            {
                "word": "harmlessness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unable or unlikely to cause damage or harm",
                    "vi": "không thể hoặc không có khả năng gây ra thiệt hại hoặc tác hại"
                },
                "examples": [
                    {
                        "en": "The bacteria is harmless to humans.",
                        "vi": "Vi khuẩn này vô hại đối với con người."
                    }
                ]
            },
            {
                "define": {
                    "en": "unlikely to upset or offend anyone",
                    "vi": "không có khả năng làm khó chịu hoặc xúc phạm bất cứ ai"
                },
                "examples": [
                    {
                        "en": "It's just a bit of harmless fun.",
                        "vi": "Nó chỉ là một chút vui vẻ vô hại."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e0e59a152394d89a6b4b2ca7e75a4dd",
        "word": "harmlessly",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɑːmləsli/",
            "us": "/ˈhɑːrmləsli/"
        },
        "nearby": [
            {
                "word": "harmfulness",
                "pos": "noun"
            },
            {
                "word": "harmless",
                "pos": "adjective"
            },
            {
                "word": "harmlessly",
                "pos": "adverb"
            },
            {
                "word": "harmlessness",
                "pos": "noun"
            },
            {
                "word": "harmonic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is unable or unlikely to cause damage or harm",
                    "vi": "theo cách không thể hoặc không có khả năng gây ra thiệt hại hoặc tác hại"
                },
                "examples": [
                    {
                        "en": "The missile fell harmlessly into the sea.",
                        "vi": "Tên lửa rơi xuống biển một cách vô hại."
                    },
                    {
                        "en": "His interest in guns started harmlessly enough, but later it became an obsession.",
                        "vi": "Sở thích của anh ta đối với súng bắt đầu vô hại, nhưng sau đó nó trở thành một nỗi ám ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is unlikely to upset or offend anyone",
                    "vi": "theo một cách mà không có khả năng làm khó chịu hoặc xúc phạm bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "She was flirting harmlessly with some boys who were passing by.",
                        "vi": "Cô ấy đang tán tỉnh một cách vô hại với một số chàng trai đi ngang qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce2638e9373245c7b50e99f6cc740a46",
        "word": "rescue",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreskjuː/",
            "us": "/ˈreskjuː/"
        },
        "nearby": [
            {
                "word": "rescind",
                "pos": "verb"
            },
            {
                "word": "rescission",
                "pos": "noun"
            },
            {
                "word": "rescue",
                "pos": "verb"
            },
            {
                "word": "rescue",
                "pos": "noun"
            },
            {
                "word": "rescuer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to save somebody/something from a dangerous or harmful situation",
                    "vi": "để cứu ai đó / cái gì đó khỏi một tình huống nguy hiểm hoặc có hại"
                },
                "examples": [
                    {
                        "en": "rescue somebody/something from something/somebody The coastguard rescued six people from the sinking boat.",
                        "vi": "cứu ai đó / cái gì đó khỏi cái gì đó / ai đó Lực lượng tuần duyên đã giải cứu sáu người khỏi chiếc thuyền đang chìm."
                    },
                    {
                        "en": "The woman was rescued from her burning home by firefighters.",
                        "vi": "Người phụ nữ được các nhân viên cứu hỏa giải cứu khỏi ngôi nhà đang bốc cháy của mình."
                    },
                    {
                        "en": "You rescued me from an embarrassing situation.",
                        "vi": "Bạn đã giải cứu tôi khỏi một tình huống xấu hổ."
                    },
                    {
                        "en": "The house was rescued from demolition.",
                        "vi": "Ngôi nhà đã được giải cứu khỏi việc phá dỡ."
                    },
                    {
                        "en": "rescue somebody/something from doing something He rescued a child from drowning.",
                        "vi": "giải cứu ai đó / điều gì đó khỏi làm điều gì đó Anh ấy đã cứu một đứa trẻ khỏi chết đuối."
                    },
                    {
                        "en": "rescue somebody/something The hostages were rescued and brought to safety.",
                        "vi": "giải cứu ai đó / cái gì đó Các con tin đã được giải cứu và đưa đến nơi an toàn."
                    },
                    {
                        "en": "The shelter rescues stray dogs.",
                        "vi": "Nơi trú ẩn giải cứu chó hoang."
                    },
                    {
                        "en": "rescue somebody/something + adj. She had despaired of ever being rescued alive.",
                        "vi": "giải cứu ai đó / cái gì đó + adj. Cô đã tuyệt vọng về việc từng được cứu sống."
                    }
                ]
            }
        ]
    },
    {
        "id": "d2cf93f6ad13424dac25330073bb14b4",
        "word": "rescue",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreskjuː/",
            "us": "/ˈreskjuː/"
        },
        "nearby": [
            {
                "word": "rescission",
                "pos": "noun"
            },
            {
                "word": "rescue",
                "pos": "verb"
            },
            {
                "word": "rescue",
                "pos": "noun"
            },
            {
                "word": "rescuer",
                "pos": "noun"
            },
            {
                "word": "rescue worker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of saving somebody/something from a dangerous or difficult situation; the fact of being saved",
                    "vi": "hành động cứu ai đó / cái gì đó khỏi một tình huống nguy hiểm hoặc khó khăn; thực tế là được cứu"
                },
                "examples": [
                    {
                        "en": "We had given up hope of rescue.",
                        "vi": "Chúng tôi đã từ bỏ hy vọng được giải cứu."
                    },
                    {
                        "en": "A wealthy benefactor came to their rescue with a generous donation.",
                        "vi": "Một nhà hảo tâm giàu có đã ra tay cứu giúp họ với một khoản tài trợ hào phóng."
                    },
                    {
                        "en": "a rescue operation/mission",
                        "vi": "một hoạt động / nhiệm vụ cứu hộ"
                    },
                    {
                        "en": "a mountain rescue team",
                        "vi": "một đội cứu hộ núi"
                    },
                    {
                        "en": "rescue helicopters/boats/workers",
                        "vi": "trực thăng cứu hộ / thuyền / công nhân"
                    },
                    {
                        "en": "The United Nations is helping to coordinate rescue efforts.",
                        "vi": "Liên hợp quốc đang giúp điều phối các nỗ lực cứu hộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when somebody/something is saved from a dangerous or difficult situation",
                    "vi": "một dịp khi ai đó / điều gì đó được cứu thoát khỏi một tình huống nguy hiểm hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "Ten fishermen were saved in a daring sea rescue.",
                        "vi": "Mười ngư dân đã được cứu trong một cuộc giải cứu táo bạo trên biển."
                    },
                    {
                        "en": "Her own boat capsized after she attempted a rescue.",
                        "vi": "Thuyền của cô ấy bị lật sau khi cô ấy cố gắng giải cứu."
                    }
                ]
            }
        ]
    },
    {
        "id": "3aef809e34ad4e79acace2401efe66f0",
        "word": "rescuer",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreskjuːə(r)/",
            "us": "/ˈreskjuːər/"
        },
        "nearby": [
            {
                "word": "rescue",
                "pos": "verb"
            },
            {
                "word": "rescue",
                "pos": "noun"
            },
            {
                "word": "rescuer",
                "pos": "noun"
            },
            {
                "word": "rescue worker",
                "pos": "noun"
            },
            {
                "word": "research",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who saves somebody/something from a dangerous or harmful situation",
                    "vi": "một người cứu ai đó / cái gì đó khỏi một tình huống nguy hiểm hoặc có hại"
                },
                "examples": [
                    {
                        "en": "Rescuers began to free the trapped miners.",
                        "vi": "Lực lượng cứu hộ bắt đầu giải phóng những người thợ mỏ bị mắc kẹt."
                    }
                ]
            }
        ]
    },
    {
        "id": "50a048930c6f496c9f9c71d63a9c3e89",
        "word": "rescue worker",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreskjuː wɜːkə(r)/",
            "us": "/ˈreskjuː wɜːrkər/"
        },
        "nearby": [
            {
                "word": "rescue",
                "pos": "noun"
            },
            {
                "word": "rescuer",
                "pos": "noun"
            },
            {
                "word": "rescue worker",
                "pos": "noun"
            },
            {
                "word": "research",
                "pos": "noun"
            },
            {
                "word": "research",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to try to save people from dangerous or difficult situations, especially after an accident or a disaster",
                    "vi": "một người có công việc là cố gắng cứu mọi người khỏi những tình huống nguy hiểm hoặc khó khăn, đặc biệt là sau một tai nạn hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "Rescue workers are working under very difficult conditions to find survivors from the blast.",
                        "vi": "Các nhân viên cứu hộ đang làm việc trong những điều kiện rất khó khăn để tìm kiếm những người sống sót sau vụ nổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5c0b4c076ff4172b8e89cf70cae7f16",
        "word": "alert",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈlɜːt/",
            "us": "/əˈlɜːrt/"
        },
        "nearby": [
            {
                "word": "alert",
                "pos": "verb"
            },
            {
                "word": "alert",
                "pos": "noun"
            },
            {
                "word": "alert",
                "pos": "adjective"
            },
            {
                "word": "alertly",
                "pos": "adverb"
            },
            {
                "word": "alertness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to think quickly; quick to notice things",
                    "vi": "có khả năng suy nghĩ nhanh chóng; nhanh chóng để ý mọi thứ"
                },
                "examples": [
                    {
                        "en": "Suddenly he found himself awake and fully alert.",
                        "vi": "Đột nhiên anh thấy mình tỉnh táo và hoàn toàn tỉnh táo."
                    },
                    {
                        "en": "Two alert scientists spotted the mistake.",
                        "vi": "Hai nhà khoa học tỉnh táo đã phát hiện ra sai lầm."
                    },
                    {
                        "en": "Try to stay alert while driving at night.",
                        "vi": "Cố gắng giữ tỉnh táo khi lái xe vào ban đêm."
                    },
                    {
                        "en": "an alert mind",
                        "vi": "một tâm trí tỉnh táo"
                    },
                    {
                        "en": "mentally alert",
                        "vi": "Cảnh báo tinh thần"
                    }
                ]
            },
            {
                "define": {
                    "en": "aware of something, especially a problem or danger",
                    "vi": "nhận thức về một cái gì đó, đặc biệt là một vấn đề hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "We must be alert to the possibility of danger.",
                        "vi": "Chúng ta phải cảnh giác với khả năng xảy ra nguy hiểm."
                    },
                    {
                        "en": "She was alert to the slightest sound.",
                        "vi": "Cô cảnh giác với những âm thanh nhỏ nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "00f960fd93ca4e1e8ca9c08085011fcd",
        "word": "alert",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈlɜːt/",
            "us": "/əˈlɜːrt/"
        },
        "nearby": [
            {
                "word": "aleck",
                "pos": "noun"
            },
            {
                "word": "alehouse",
                "pos": "noun"
            },
            {
                "word": "alert",
                "pos": "verb"
            },
            {
                "word": "alert",
                "pos": "noun"
            },
            {
                "word": "alert",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to warn somebody about a dangerous situation or one that requires immediate action",
                    "vi": "để cảnh báo ai đó về một tình huống nguy hiểm hoặc một tình huống cần hành động ngay lập tức"
                },
                "examples": [
                    {
                        "en": "alert somebody Neighbours quickly alerted the emergency services.",
                        "vi": "báo cho ai đó Hàng xóm nhanh chóng cảnh báo các dịch vụ khẩn cấp."
                    },
                    {
                        "en": "(be) alerted by something Alerted by a noise downstairs, he sat up and turned on the light.",
                        "vi": "(được) cảnh báo bởi điều gì đó Được cảnh báo bởi một tiếng động ở tầng dưới, anh ta ngồi dậy và bật đèn."
                    },
                    {
                        "en": "be alerted that… The coastguard were alerted that a yacht had run into difficulties.",
                        "vi": "được cảnh báo rằng… Lực lượng tuần duyên đã được cảnh báo rằng một chiếc du thuyền đã gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody aware of something",
                    "vi": "để làm cho ai đó biết về điều gì đó"
                },
                "examples": [
                    {
                        "en": "be alerted to something They had been alerted to the possibility of further price rises.",
                        "vi": "được cảnh báo về điều gì đó Họ đã được cảnh báo về khả năng giá tăng hơn nữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "101a595dc19b4d7986e50092ba4c8544",
        "word": "avert",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈvɜːt/",
            "us": "/əˈvɜːrt/"
        },
        "nearby": [
            {
                "word": "aversion",
                "pos": "noun"
            },
            {
                "word": "aversion therapy",
                "pos": "noun"
            },
            {
                "word": "avert",
                "pos": "verb"
            },
            {
                "word": "Tex Avery",
                "pos": ""
            },
            {
                "word": "avian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prevent something bad or dangerous from happening",
                    "vi": "để ngăn điều gì đó xấu hoặc nguy hiểm xảy ra"
                },
                "examples": [
                    {
                        "en": "A disaster was narrowly averted.",
                        "vi": "Một thảm họa đã được ngăn chặn trong gang tấc."
                    },
                    {
                        "en": "He did his best to avert suspicion.",
                        "vi": "Anh ấy đã cố gắng hết sức để ngăn chặn sự nghi ngờ."
                    },
                    {
                        "en": "Talks are taking place in an attempt to avert a strike.",
                        "vi": "Các cuộc đàm phán đang diễn ra nhằm tìm cách ngăn chặn một cuộc đình công."
                    },
                    {
                        "en": "He managed to avert the closure of the factory.",
                        "vi": "Ông đã tìm cách ngăn chặn việc đóng cửa nhà máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn your eyes, etc. away from something that you do not want to see",
                    "vi": "để chuyển mắt, v.v. khỏi thứ gì đó mà bạn không muốn nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She averted her eyes from the terrible scene in front of her.",
                        "vi": "Cô dời mắt khỏi cảnh tượng khủng khiếp trước mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "e53cf8ca49e54cd69e3d0585b3706055",
        "word": "caution",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɔːʃn/",
            "us": "/ˈkɔːʃn/"
        },
        "nearby": [
            {
                "word": "caustic soda",
                "pos": "noun"
            },
            {
                "word": "cauterize",
                "pos": "verb"
            },
            {
                "word": "caution",
                "pos": "noun"
            },
            {
                "word": "caution",
                "pos": "verb"
            },
            {
                "word": "cautionary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "care that you take in order to avoid danger or mistakes; the fact of not taking any risks",
                    "vi": "quan tâm mà bạn thực hiện để tránh nguy hiểm hoặc sai lầm; thực tế là không chấp nhận bất kỳ rủi ro nào"
                },
                "examples": [
                    {
                        "en": "extreme/great caution",
                        "vi": "cực kỳ thận trọng"
                    },
                    {
                        "en": "with caution Statistics should be treated with caution.",
                        "vi": "thận trọng Số liệu thống kê nên được xử lý một cách thận trọng."
                    },
                    {
                        "en": "He could find himself making enemies as well as friends unless he proceeds with the utmost caution.",
                        "vi": "Anh ta có thể thấy mình gây thù chuốc oán với bạn bè trừ khi tiến hành một cách hết sức thận trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a warning that is given by the police to somebody who has committed a crime that is not too serious",
                    "vi": "cảnh sát đưa ra cảnh báo cho ai đó đã phạm tội không quá nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "As a first offender, she got off with a caution.",
                        "vi": "Là một người vi phạm lần đầu, cô ấy đã dừng lại một cách thận trọng."
                    },
                    {
                        "en": "They let her off with a caution.",
                        "vi": "Họ để cô ấy đi một cách thận trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a warning or a piece of advice about a possible danger or risk",
                    "vi": "một cảnh báo hoặc một lời khuyên về một nguy cơ hoặc rủi ro có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "a word/note of caution",
                        "vi": "một từ / lưu ý về sự thận trọng"
                    },
                    {
                        "en": "Some cautions must be mentioned—for example good tools are essential to do the job well.",
                        "vi": "Một số lưu ý phải được đề cập — ví dụ, các công cụ tốt là điều cần thiết để thực hiện tốt công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop caring about how dangerous something might be; to start taking risks",
                    "vi": "ngừng quan tâm đến mức độ nguy hiểm của một cái gì đó; bắt đầu chấp nhận rủi ro"
                },
                "examples": [
                    {
                        "en": "He threw caution to the wind and dived into the water after the child.",
                        "vi": "Anh ta ném thận trọng vào gió và lặn xuống nước sau đứa trẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "672497020b7b4fa888703cdf7f0f6eb7",
        "word": "early warning",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɜːli ˈwɔːnɪŋ/",
            "us": "/ˌɜːrli ˈwɔːrnɪŋ/"
        },
        "nearby": [
            {
                "word": "early music",
                "pos": "noun"
            },
            {
                "word": "early night",
                "pos": "noun"
            },
            {
                "word": "early warning",
                "pos": "noun"
            },
            {
                "word": "earmark",
                "pos": "verb"
            },
            {
                "word": "earmark",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that tells you in advance that something serious or dangerous is going to happen",
                    "vi": "một điều cho bạn biết trước rằng điều gì đó nghiêm trọng hoặc nguy hiểm sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "an early warning of heart disease",
                        "vi": "một cảnh báo sớm về bệnh tim"
                    },
                    {
                        "en": "an early warning system (= of enemy attack)",
                        "vi": "một hệ thống cảnh báo sớm (= về cuộc tấn công của kẻ thù)"
                    },
                    {
                        "en": "The sensors provide early warning of the approach of enemy troops.",
                        "vi": "Các cảm biến cung cấp cảnh báo sớm về sự tiếp cận của quân địch."
                    }
                ]
            }
        ]
    },
    {
        "id": "d34defd3be76440293e301108129471b",
        "word": "evacuate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈvækjueɪt/",
            "us": "/ɪˈvækjueɪt/"
        },
        "nearby": [
            {
                "word": "eutrophication",
                "pos": "noun"
            },
            {
                "word": "EV",
                "pos": "noun"
            },
            {
                "word": "evacuate",
                "pos": "verb"
            },
            {
                "word": "evacuation",
                "pos": "noun"
            },
            {
                "word": "evacuee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move people from a place of danger to a safer place",
                    "vi": "để di chuyển mọi người từ nơi nguy hiểm đến nơi an toàn hơn"
                },
                "examples": [
                    {
                        "en": "evacuate something Police evacuated nearby buildings.",
                        "vi": "sơ tán thứ gì đó Cảnh sát đã sơ tán các tòa nhà gần đó."
                    },
                    {
                        "en": "evacuate somebody (from…) (to…) Children were evacuated from London to escape the bombing.",
                        "vi": "sơ tán ai đó (từ…) (đến…) Trẻ em được sơ tán khỏi London để thoát khỏi vụ đánh bom."
                    },
                    {
                        "en": "Families were evacuated to safer parts of the city.",
                        "vi": "Các gia đình đã được sơ tán đến các khu vực an toàn hơn của thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move out of a place because of danger, and leave the place empty",
                    "vi": "di chuyển khỏi một nơi vì nguy hiểm và để nơi trống"
                },
                "examples": [
                    {
                        "en": "Employees were urged to evacuate their offices immediately.",
                        "vi": "Các nhân viên đã được yêu cầu sơ tán khỏi văn phòng của họ ngay lập tức."
                    },
                    {
                        "en": "Locals were told to evacuate.",
                        "vi": "Người dân địa phương đã được yêu cầu sơ tán."
                    }
                ]
            },
            {
                "define": {
                    "en": "to empty your bowels",
                    "vi": "để làm sạch ruột của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "12dede4f507d484d87bb028cbcd543fa",
        "word": "evacuation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˌvækjuˈeɪʃn/",
            "us": "/ɪˌvækjuˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "EV",
                "pos": "noun"
            },
            {
                "word": "evacuate",
                "pos": "verb"
            },
            {
                "word": "evacuation",
                "pos": "noun"
            },
            {
                "word": "evacuee",
                "pos": "noun"
            },
            {
                "word": "evade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of moving people from a place of danger to a safer place",
                    "vi": "quá trình di chuyển mọi người từ nơi nguy hiểm đến nơi an toàn hơn"
                },
                "examples": [
                    {
                        "en": "the emergency evacuation of thousands of people after the earthquake",
                        "vi": "sơ tán khẩn cấp hàng nghìn người sau trận động đất"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of emptying a building or other place of people because it is not safe for them to stay there",
                    "vi": "Hành động dọn sạch một tòa nhà hoặc nơi khác của mọi người vì họ không an toàn khi ở đó"
                },
                "examples": [
                    {
                        "en": "Officials ordered the evacuation of the Florida Keys as the tropical storm approached.",
                        "vi": "Các quan chức đã ra lệnh sơ tán Florida Keys khi cơn bão nhiệt đới đến gần."
                    }
                ]
            }
        ]
    },
    {
        "id": "e441b9fe6ddf485aac83901b31f7b572",
        "word": "flee",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/fliː/",
            "us": "/fliː/"
        },
        "nearby": [
            {
                "word": "fledged",
                "pos": "adjective"
            },
            {
                "word": "fledgling",
                "pos": "noun"
            },
            {
                "word": "flee",
                "pos": "verb"
            },
            {
                "word": "fleece",
                "pos": "noun"
            },
            {
                "word": "fleece",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to leave a person or place very quickly, especially because you are afraid of possible danger",
                    "vi": "rời khỏi một người hoặc một địa điểm rất nhanh chóng, đặc biệt là vì bạn sợ nguy hiểm có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "She burst into tears and fled.",
                        "vi": "Cô ấy đã bật khóc và bỏ trốn."
                    },
                    {
                        "en": "flee from somebody/something a camp for refugees fleeing from the war",
                        "vi": "chạy trốn khỏi ai đó / cái gì đó một trại dành cho những người tị nạn chạy trốn khỏi chiến tranh"
                    },
                    {
                        "en": "flee to…/into… He fled to London after an argument with his family.",
                        "vi": "chạy trốn đến… / vào… Anh ta trốn đến London sau một cuộc tranh cãi với gia đình."
                    },
                    {
                        "en": "flee something He was caught trying to flee the country.",
                        "vi": "chạy trốn một cái gì đó Anh ta đã bị bắt khi cố gắng chạy trốn khỏi đất nước."
                    },
                    {
                        "en": "The driver had already fled the scene of the accident.",
                        "vi": "Tài xế đã bỏ trốn khỏi hiện trường vụ tai nạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "df8f234dea6942dba3620f182b75f7a1",
        "word": "for fear of something/of doing something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/fɪə(r)/",
            "us": "/fɪr/"
        },
        "nearby": [
            {
                "word": "FE",
                "pos": "abbreviation"
            },
            {
                "word": "fealty",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the bad feeling that you have when you are in danger or when a particular thing frightens you",
                    "vi": "cảm giác tồi tệ mà bạn có khi gặp nguy hiểm hoặc khi một điều cụ thể làm bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Her eyes showed no fear.",
                        "vi": "Đôi mắt cô ấy không hề tỏ ra sợ hãi."
                    },
                    {
                        "en": "The child was shaking with fear.",
                        "vi": "Đứa trẻ run lên vì sợ hãi."
                    },
                    {
                        "en": "I suddenly felt gripped by fear.",
                        "vi": "Tôi đột nhiên cảm thấy sợ hãi bao trùm."
                    },
                    {
                        "en": "She nearly went crazy with fear and anxiety.",
                        "vi": "Cô gần như phát điên vì sợ hãi và lo lắng."
                    },
                    {
                        "en": "The attacks created a climate of fear.",
                        "vi": "Các cuộc tấn công đã tạo ra một bầu không khí sợ hãi."
                    },
                    {
                        "en": "Terror attacks are a tool to instil fear in the public.",
                        "vi": "Các cuộc tấn công khủng bố là một công cụ để gieo rắc nỗi sợ hãi trong công chúng."
                    },
                    {
                        "en": "He managed to overcome his fears.",
                        "vi": "Anh ấy đã vượt qua được nỗi sợ hãi của mình."
                    },
                    {
                        "en": "fear of somebody/something Fear of crime can affect people's lives.",
                        "vi": "sợ hãi ai đó / điều gì đó Sợ hãi tội phạm có thể ảnh hưởng đến cuộc sống của mọi người."
                    },
                    {
                        "en": "in fear of somebody/something We lived in constant fear of losing our jobs.",
                        "vi": "sợ hãi ai đó / điều gì đó Chúng tôi đã sống trong nỗi sợ hãi thường xuyên bị mất việc làm."
                    },
                    {
                        "en": "without fear of somebody/something Women should be able to work without fear of harassment.",
                        "vi": "mà không sợ ai đó / điều gì đó Phụ nữ có thể làm việc mà không sợ bị quấy rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of concern about somebody's safety or about something bad that might happen",
                    "vi": "cảm giác lo lắng về sự an toàn của ai đó hoặc về điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The doctor's report confirmed our worst fears.",
                        "vi": "Báo cáo của bác sĩ đã xác nhận nỗi sợ hãi tồi tệ nhất của chúng tôi."
                    },
                    {
                        "en": "Police tried hard to allay the fears of local residents.",
                        "vi": "Cảnh sát đã cố gắng hết sức để xoa dịu nỗi sợ hãi của cư dân địa phương."
                    },
                    {
                        "en": "fear for somebody/something her fears for her son’s safety",
                        "vi": "nỗi sợ hãi cho ai đó / điều gì đó cô ấy lo sợ cho sự an toàn của con trai mình"
                    },
                    {
                        "en": "Alan spoke of his fears for the future.",
                        "vi": "Alan nói về nỗi sợ hãi của anh ấy đối với tương lai."
                    },
                    {
                        "en": "fear that… the fear that he had cancer",
                        "vi": "sợ rằng ... sợ rằng anh ấy bị ung thư"
                    },
                    {
                        "en": "The announcement sparked fears that interest rates will rise.",
                        "vi": "Thông báo này làm dấy lên lo ngại rằng lãi suất sẽ tăng."
                    },
                    {
                        "en": "amid fears The government announced the new measures amid growing security fears.",
                        "vi": "trong bối cảnh lo ngại Chính phủ công bố các biện pháp mới trong bối cảnh lo ngại về an ninh ngày càng gia tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid the danger of something happening",
                    "vi": "để tránh nguy hiểm của một cái gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "We spoke quietly for fear of waking the guards.",
                        "vi": "Chúng tôi nói nhỏ vì sợ lính canh đánh thức."
                    },
                    {
                        "en": "I had to run away for fear (that) he might one day kill me.",
                        "vi": "Tôi đã phải bỏ chạy vì sợ (rằng) một ngày nào đó anh ta có thể giết tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling frightened that you might be killed",
                    "vi": "cảm thấy sợ hãi rằng bạn có thể bị giết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you definitely do not want to do something",
                    "vi": "từng nói rằng bạn chắc chắn không muốn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Are you coming climbing?’ ‘No fear!’",
                        "vi": "Bạn có đang leo núi không?' 'Đừng sợ!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened, especially in order to make them do something",
                    "vi": "khiến ai đó rất sợ hãi, đặc biệt là để khiến họ làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a fair way",
                    "vi": "một cách công bằng"
                },
                "examples": [
                    {
                        "en": "They undertook to make their judgement without fear or favour.",
                        "vi": "Họ tiến hành đưa ra phán quyết của họ mà không sợ hãi hoặc thuận lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a20ae26cffe45a5bf441ac18e50d700",
        "word": "precaution",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/prɪˈkɔːʃn/",
            "us": "/prɪˈkɔːʃn/"
        },
        "nearby": [
            {
                "word": "precariousness",
                "pos": "noun"
            },
            {
                "word": "precast",
                "pos": "adjective"
            },
            {
                "word": "precaution",
                "pos": "noun"
            },
            {
                "word": "precautionary",
                "pos": "adjective"
            },
            {
                "word": "precede",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that is done in advance in order to prevent problems or to avoid danger",
                    "vi": "điều gì đó được thực hiện trước để ngăn ngừa sự cố hoặc tránh nguy hiểm"
                },
                "examples": [
                    {
                        "en": "safety precautions",
                        "vi": "biện pháp phòng ngừa an toàn"
                    },
                    {
                        "en": "precautions against fire",
                        "vi": "đề phòng hỏa hoạn"
                    },
                    {
                        "en": "You must take all reasonable precautions to protect yourself and your family.",
                        "vi": "Bạn phải thực hiện tất cả các biện pháp phòng ngừa hợp lý để bảo vệ bản thân và gia đình của bạn."
                    },
                    {
                        "en": "I'll keep the letter as a precaution.",
                        "vi": "Tôi sẽ giữ lá thư để đề phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of referring to contraception",
                    "vi": "một cách đề cập đến biện pháp tránh thai"
                },
                "examples": [
                    {
                        "en": "We didn't take any precautions and I got pregnant.",
                        "vi": "Chúng tôi không thực hiện bất kỳ biện pháp phòng ngừa nào và tôi đã có thai."
                    }
                ]
            }
        ]
    },
    {
        "id": "e66439c2ddc54a55b588dd110e84d850",
        "word": "refuge",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrefjuːdʒ/",
            "us": "/ˈrefjuːdʒ/"
        },
        "nearby": [
            {
                "word": "refrigerator",
                "pos": "noun"
            },
            {
                "word": "refuel",
                "pos": "verb"
            },
            {
                "word": "refuge",
                "pos": "noun"
            },
            {
                "word": "refugee",
                "pos": "noun"
            },
            {
                "word": "the Refugee Council",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "shelter or protection from danger, trouble, etc.",
                    "vi": "nơi trú ẩn hoặc bảo vệ khỏi nguy hiểm, rắc rối, v.v."
                },
                "examples": [
                    {
                        "en": "A further 300 people have taken refuge in the US embassy.",
                        "vi": "Hơn 300 người đã đến tị nạn trong đại sứ quán Hoa Kỳ."
                    },
                    {
                        "en": "The region was a place of refuge for outlaws and bandits.",
                        "vi": "Khu vực này là nơi ẩn náu của những kẻ sống ngoài vòng pháp luật và những tên cướp."
                    },
                    {
                        "en": "refuge from somebody/something They were forced to seek refuge from the fighting.",
                        "vi": "nơi ẩn náu từ ai đó / cái gì đó Họ buộc phải tìm nơi ẩn náu từ cuộc giao tranh."
                    },
                    {
                        "en": "As the situation at home got worse she increasingly took refuge in her work.",
                        "vi": "Khi tình hình ở nhà trở nên tồi tệ hơn, cô ấy ngày càng trốn tránh công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place, person or thing that provides shelter or protection for somebody/something",
                    "vi": "một nơi, người hoặc vật cung cấp nơi trú ẩn hoặc bảo vệ cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The marshes are a wetland refuge for seabirds, waders and wild fowl.",
                        "vi": "Các đầm lầy là nơi trú ẩn của các loài chim biển, chim lội nước và gà rừng."
                    },
                    {
                        "en": "refuge from somebody/something He regarded the room as a refuge from the outside world.",
                        "vi": "nơi ẩn náu từ ai đó / cái gì đó Anh ấy coi căn phòng như một nơi ẩn náu từ thế giới bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building that provides a temporary home for people in need of shelter or protection from somebody/something",
                    "vi": "một tòa nhà cung cấp một ngôi nhà tạm thời cho những người cần nơi trú ẩn hoặc sự bảo vệ khỏi ai đó / thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The best option for a female victim of domestic abuse is to contact a women's refuge.",
                        "vi": "Lựa chọn tốt nhất cho một nạn nhân nữ của lạm dụng gia đình là liên hệ với nơi ẩn náu của phụ nữ."
                    },
                    {
                        "en": "During the great fire of 1871 the church served as a refuge for the homeless.",
                        "vi": "Trong trận hỏa hoạn lớn năm 1871, nhà thờ là nơi ẩn náu cho những người vô gia cư."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area in the middle of a road where you can stand and wait for cars to go past until it is safe for you to cross",
                    "vi": "khu vực ở giữa đường nơi bạn có thể đứng và đợi xe ô tô đi qua cho đến khi bạn băng qua đường an toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9822bdde967b4aafb419831c184a3325",
        "word": "safeguard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈseɪfɡɑːd/",
            "us": "/ˈseɪfɡɑːrd/"
        },
        "nearby": [
            {
                "word": "safe deposit box",
                "pos": "noun"
            },
            {
                "word": "safeguard",
                "pos": "verb"
            },
            {
                "word": "safeguard",
                "pos": "noun"
            },
            {
                "word": "safe haven",
                "pos": "noun"
            },
            {
                "word": "safe house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that is designed to protect people from harm, risk or danger",
                    "vi": "thứ gì đó được thiết kế để bảo vệ mọi người khỏi bị tổn hại, rủi ro hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Stronger legal safeguards are needed to protect the consumer.",
                        "vi": "Cần có các biện pháp bảo vệ pháp lý mạnh mẽ hơn để bảo vệ người tiêu dùng."
                    },
                    {
                        "en": "The measures have been introduced as a safeguard against fraud.",
                        "vi": "Các biện pháp đã được đưa ra như một biện pháp bảo vệ chống lại gian lận."
                    }
                ]
            }
        ]
    },
    {
        "id": "5aa3e162df1443cb923028ea39249576",
        "word": "be on the lookout (for somebody/something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlʊkaʊt/",
            "us": "/ˈlʊkaʊt/"
        },
        "nearby": [
            {
                "word": "look on with",
                "pos": "phrasal verb"
            },
            {
                "word": "look out",
                "pos": "phrasal verb"
            },
            {
                "word": "lookout",
                "pos": "noun"
            },
            {
                "word": "look out for",
                "pos": "phrasal verb"
            },
            {
                "word": "look over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place for watching from, especially for danger or an enemy coming towards you",
                    "vi": "một nơi để quan sát, đặc biệt là đối với nguy hiểm hoặc kẻ thù đang tiến về phía bạn"
                },
                "examples": [
                    {
                        "en": "a lookout point/tower",
                        "vi": "một điểm / tháp quan sát"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the responsibility of watching for something, especially danger, etc.",
                    "vi": "một người có trách nhiệm quan sát một cái gì đó, đặc biệt là nguy hiểm, v.v."
                },
                "examples": [
                    {
                        "en": "One of the men stood at the door to act as a lookout.",
                        "vi": "Một trong những người đàn ông đứng ở cửa để trông chừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not think somebody’s actions are sensible, but that it is their own problem or responsibility",
                    "vi": "được sử dụng để nói rằng bạn không nghĩ hành động của ai đó là hợp lý, nhưng đó là vấn đề hoặc trách nhiệm của chính họ"
                },
                "examples": [
                    {
                        "en": "If he wants to waste his money, that's his lookout.",
                        "vi": "Nếu anh ta muốn lãng phí tiền của mình, đó là sự chú ý của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch carefully for somebody/something in order to avoid danger, etc. or in order to find something you want",
                    "vi": "để quan sát cẩn thận ai đó / thứ gì đó để tránh nguy hiểm, v.v. hoặc để tìm thứ gì đó bạn muốn"
                },
                "examples": [
                    {
                        "en": "The public should be on the lookout for symptoms of the disease.",
                        "vi": "Công chúng nên theo dõi các triệu chứng của bệnh."
                    },
                    {
                        "en": "The guards have to keep a sharp lookout for anything suspicious.",
                        "vi": "Các lính canh phải theo dõi sắc bén cho bất cứ điều gì đáng ngờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "137002b347ad4f29bb7e686fe64de8fd",
        "word": "be on the watch (for somebody/something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wɒtʃ/",
            "us": "/wɑːtʃ/"
        },
        "nearby": [
            {
                "word": "wastrel",
                "pos": "noun"
            },
            {
                "word": "watch",
                "pos": "verb"
            },
            {
                "word": "watch",
                "pos": "noun"
            },
            {
                "word": "watchable",
                "pos": "adjective"
            },
            {
                "word": "watchband",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of small clock that you wear on your wrist, or (in the past) carried in your pocket",
                    "vi": "một loại đồng hồ nhỏ mà bạn đeo trên cổ tay hoặc (trước đây) bỏ trong túi"
                },
                "examples": [
                    {
                        "en": "She kept looking anxiously at her watch.",
                        "vi": "Cô ấy cứ lo lắng nhìn đồng hồ đeo tay."
                    },
                    {
                        "en": "He paced nervously, checking his watch.",
                        "vi": "Anh lo lắng đi đi lại lại, kiểm tra đồng hồ."
                    },
                    {
                        "en": "My watch is fast/slow.",
                        "vi": "Đồng hồ của tôi là nhanh / chậm."
                    },
                    {
                        "en": "Sorry I'm late—my watch has stopped.",
                        "vi": "Xin lỗi, tôi đến muộn — đồng hồ của tôi đã dừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of watching somebody/something carefully in case of possible danger or problems",
                    "vi": "hành động quan sát ai đó / cái gì đó cẩn thận trong trường hợp nguy hiểm hoặc vấn đề có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The police have mounted a watch outside the hotel.",
                        "vi": "Cảnh sát đã gắn một chiếc đồng hồ bên ngoài khách sạn."
                    },
                    {
                        "en": "I'll keep watch while you go through his papers (= watch and warn you if somebody is coming).",
                        "vi": "Tôi sẽ theo dõi trong khi bạn xem xét giấy tờ của anh ta (= theo dõi và cảnh báo bạn nếu có ai đó đến)."
                    },
                    {
                        "en": "The government is keeping a close watch on how the situation develops.",
                        "vi": "Chính phủ đang theo dõi chặt chẽ tình hình phát triển như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fixed period of time, usually while other people are asleep, during which somebody watches for any danger so that they can warn others, for example on a ship; the person or people who do this",
                    "vi": "một khoảng thời gian cố định, thường là khi những người khác đang ngủ, trong thời gian đó ai đó quan sát mọi nguy hiểm để họ có thể cảnh báo những người khác, chẳng hạn như trên tàu; người hoặc những người làm điều này"
                },
                "examples": [
                    {
                        "en": "on watch I go on watch in an hour.",
                        "vi": "trên đồng hồ, tôi tiếp tục xem trong một giờ nữa."
                    },
                    {
                        "en": "I'm on first watch.",
                        "vi": "Tôi đến xem đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a notice or an announcement that warns the public that there may be severe weather conditions very soon",
                    "vi": "một thông báo hoặc một thông báo cảnh báo công chúng rằng có thể có các điều kiện thời tiết khắc nghiệt rất sớm"
                },
                "examples": [
                    {
                        "en": "They're in charge of issuing the tornado watches.",
                        "vi": "Họ phụ trách phát hành đồng hồ lốc xoáy."
                    },
                    {
                        "en": "We have tornado watches in effect for a lot of Florida.",
                        "vi": "Chúng tôi có đồng hồ lốc xoáy có hiệu lực ở nhiều bang Florida."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be looking carefully for somebody/something that you expect to see, especially in order to avoid possible danger",
                    "vi": "đang tìm kiếm một người / điều gì đó mà bạn mong đợi được nhìn thấy một cách cẩn thận, đặc biệt là để tránh nguy hiểm có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "Be on the watch for thieves.",
                        "vi": "Hãy đề phòng kẻ trộm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully",
                    "vi": "để xem ai đó / cái gì đó cẩn thận"
                },
                "examples": [
                    {
                        "en": "Over the next few months we will keep a close watch on sales.",
                        "vi": "Trong vài tháng tới, chúng tôi sẽ theo dõi chặt chẽ doanh số bán hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "3551f21f5d1c43aea0fa821d394a81f7",
        "word": "be on your guard",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɑːd/",
            "us": "/ɡɑːrd/"
        },
        "nearby": [
            {
                "word": "guarantee",
                "pos": "noun"
            },
            {
                "word": "guarantor",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "noun"
            },
            {
                "word": "guard",
                "pos": "verb"
            },
            {
                "word": "guard against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, such as a soldier, a police officer or a prison officer, who protects a place or people, or prevents prisoners from escaping",
                    "vi": "một người, chẳng hạn như một người lính, một sĩ quan cảnh sát hoặc một viên chức quản giáo, người bảo vệ một địa điểm hoặc người dân, hoặc ngăn cản các tù nhân trốn thoát"
                },
                "examples": [
                    {
                        "en": "prison/border guards",
                        "vi": "nhà tù / lính biên phòng"
                    },
                    {
                        "en": "The building is protected by armed guards.",
                        "vi": "Tòa nhà được bảo vệ bởi lực lượng bảo vệ có vũ trang."
                    },
                    {
                        "en": "The prisoner slipped past the guards on the gate and escaped.",
                        "vi": "Người tù vượt qua các lính canh trên cổng và trốn thoát."
                    },
                    {
                        "en": "A guard was posted outside the building.",
                        "vi": "Một bảo vệ được bố trí bên ngoài tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or duty of protecting property, places or people from attack or danger; the act or duty of preventing prisoners from escaping",
                    "vi": "hành động hoặc nghĩa vụ bảo vệ tài sản, địa điểm hoặc con người khỏi bị tấn công hoặc nguy hiểm; hành động hoặc nhiệm vụ ngăn cản tù nhân trốn thoát"
                },
                "examples": [
                    {
                        "en": "on guard a sentry on guard (= at his or her post, on duty)",
                        "vi": "canh gác một lính canh canh gác (= tại trụ sở của anh ta hoặc cô ta, đang làm nhiệm vụ)"
                    },
                    {
                        "en": "to be on guard duty",
                        "vi": "làm nhiệm vụ bảo vệ"
                    },
                    {
                        "en": "under guard The escaped prisoner was brought back under armed guard.",
                        "vi": "dưới sự canh gác Người tù vượt ngục được đưa trở lại dưới sự canh gác có vũ trang."
                    },
                    {
                        "en": "The terrorist was kept under police guard.",
                        "vi": "Kẻ khủng bố đã bị cảnh sát canh giữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people, such as soldiers or police officers, who protect somebody/something",
                    "vi": "một nhóm người, chẳng hạn như binh lính hoặc cảnh sát, những người bảo vệ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "the captain of the guard",
                        "vi": "đội trưởng đội bảo vệ"
                    },
                    {
                        "en": "the changing of the guard (= when one group replaces another)",
                        "vi": "sự thay đổi của người bảo vệ (= khi một nhóm thay thế nhóm khác)"
                    },
                    {
                        "en": "The guard is/are being inspected today.",
                        "vi": "Người bảo vệ đã / đang được kiểm tra ngày hôm nay."
                    },
                    {
                        "en": "Fellow airmen provided a guard of honour at his wedding.",
                        "vi": "Các phi công đã bảo vệ danh dự cho đám cưới của anh ta."
                    },
                    {
                        "en": "The president always travels with an armed guard.",
                        "vi": "Tổng thống luôn đi cùng một vệ sĩ có vũ trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK and some other countries) special regiments of soldiers whose original duty was to protect the king or queen",
                    "vi": "(ở Anh và một số quốc gia khác) các trung đoàn lính đặc biệt có nhiệm vụ ban đầu là bảo vệ nhà vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "the Scots Guards",
                        "vi": "Đội bảo vệ người Scotland"
                    },
                    {
                        "en": "a Guards officer",
                        "vi": "một sĩ quan bảo vệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that covers a part of a person’s body or a dangerous part of a machine to prevent injury",
                    "vi": "thứ gì đó che phủ một phần cơ thể của một người hoặc một bộ phận nguy hiểm của máy móc để ngăn ngừa thương tích"
                },
                "examples": [
                    {
                        "en": "All players wear helmets and face guards.",
                        "vi": "Tất cả các cầu thủ đều đội mũ bảo hiểm và đeo kính bảo vệ mặt."
                    },
                    {
                        "en": "Ensure the guard is in place before operating the machine.",
                        "vi": "Đảm bảo có thiết bị bảo vệ trước khi vận hành máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "conductor (= a person who is in charge of a train and travels with it, but does not drive it)",
                    "vi": "người điều khiển (= người phụ trách đoàn tàu và đi cùng với nó, nhưng không lái nó)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a position you take to defend yourself, especially in a sport such as boxing or fencing",
                    "vi": "một vị trí bạn thực hiện để tự vệ, đặc biệt là trong một môn thể thao như quyền anh hoặc đấu kiếm"
                },
                "examples": [
                    {
                        "en": "to drop/keep up your guard",
                        "vi": "để giảm / giữ cảnh giác của bạn"
                    },
                    {
                        "en": "(figurative) In spite of the awkward questions the minister never let his guard fall for a moment.",
                        "vi": "(nghĩa bóng) Bất chấp những câu hỏi khó xử, bộ trưởng không bao giờ để mất cảnh giác trong giây lát."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the two players on a basketball team who are mainly responsible for staying close to players of the other team to stop them from scoring",
                    "vi": "một trong hai cầu thủ của đội bóng rổ chịu trách nhiệm chính trong việc theo sát các cầu thủ của đội kia để ngăn họ ghi bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the two players on an American football team who play either side of the centre forward",
                    "vi": "một trong hai cầu thủ của đội bóng đá Mỹ chơi ở hai bên tiền đạo trung tâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very careful and prepared for something difficult or dangerous",
                    "vi": "phải rất cẩn thận và chuẩn bị cho một cái gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "He was always on his guard against moneymaking schemes.",
                        "vi": "Anh luôn cảnh giác trước những âm mưu kiếm tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop being careful and preparing yourself for possible danger or difficulty",
                    "vi": "ngừng cẩn thận và chuẩn bị cho mình đối với nguy hiểm hoặc khó khăn có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "You can never drop your guard with a two-year-old.",
                        "vi": "Bạn không bao giờ có thể mất cảnh giác với một đứa trẻ hai tuổi."
                    },
                    {
                        "en": "Even when he's winning, he never drops his guard.",
                        "vi": "Ngay cả khi anh ấy đang chiến thắng, anh ấy không bao giờ mất cảnh giác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch or protect somebody/something",
                    "vi": "để theo dõi hoặc bảo vệ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Four soldiers stood guard over the coffin.",
                        "vi": "Bốn người lính đứng canh quan tài."
                    },
                    {
                        "en": "One of the men kept guard, while the other broke into the house.",
                        "vi": "Một trong hai người đàn ông canh giữ, trong khi người kia đột nhập vào nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "not careful or prepared for something difficult or dangerous",
                    "vi": "không cẩn thận hoặc chuẩn bị cho một cái gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The lawyer’s apparently innocent question was designed to catch the witness off (his) guard.",
                        "vi": "Câu hỏi có vẻ vô tội của luật sư được thiết kế để khiến nhân chứng mất cảnh giác (của anh ta)."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd62967e947c461cb61a6e6ff1728746",
        "word": "discretion is the better part of valour",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈskreʃn/",
            "us": "/dɪˈskreʃn/"
        },
        "nearby": [
            {
                "word": "discretely",
                "pos": "adverb"
            },
            {
                "word": "discreteness",
                "pos": "noun"
            },
            {
                "word": "discretion",
                "pos": "noun"
            },
            {
                "word": "discretionary",
                "pos": "adjective"
            },
            {
                "word": "discriminate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the freedom or power to decide what should be done in a particular situation",
                    "vi": "quyền tự do hoặc quyền lực để quyết định những gì nên được thực hiện trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "I'll leave it up to you to use your discretion.",
                        "vi": "Tôi sẽ để nó cho bạn sử dụng theo ý của bạn."
                    },
                    {
                        "en": "How much to tell terminally ill patients is left to the discretion of the doctor.",
                        "vi": "Việc nói với những bệnh nhân mắc bệnh nan y bao nhiêu thì tuỳ bác sĩ quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "care in what you say or do, in order to keep something secret or to avoid causing difficulty for somebody or making them feel embarrassed; the quality of being discreet",
                    "vi": "quan tâm đến những gì bạn nói hoặc làm, để giữ bí mật điều gì đó hoặc để tránh gây khó khăn cho ai đó hoặc khiến họ cảm thấy xấu hổ; phẩm chất của sự kín đáo"
                },
                "examples": [
                    {
                        "en": "This is confidential, but I know that I can rely on your discretion.",
                        "vi": "Điều này là bí mật, nhưng tôi biết rằng tôi có thể dựa vào quyết định của bạn."
                    },
                    {
                        "en": "Jane is the soul of discretion (= you can trust her).",
                        "vi": "Jane là linh hồn của sự tùy nghi (= bạn có thể tin tưởng cô ấy)."
                    },
                    {
                        "en": "Use the utmost discretion when you talk to her.",
                        "vi": "Hãy hết sức thận trọng khi nói chuyện với cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "according to what somebody decides or wishes to do",
                    "vi": "theo những gì ai đó quyết định hoặc muốn làm"
                },
                "examples": [
                    {
                        "en": "Bail is granted at the discretion of the court.",
                        "vi": "Bảo lãnh được cấp theo quyết định của tòa án."
                    },
                    {
                        "en": "There is no service charge and tipping is at your discretion.",
                        "vi": "Không có phí dịch vụ và tiền boa là tùy theo quyết định của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should avoid danger and not take unnecessary risks",
                    "vi": "bạn nên tránh nguy hiểm và không gặp rủi ro không cần thiết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d261757d4e904f7da7f82b0c8c5932f8",
        "word": "do something at your (own) peril",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈperəl/",
            "us": "/ˈperəl/"
        },
        "nearby": [
            {
                "word": "pericardium",
                "pos": "noun"
            },
            {
                "word": "perigee",
                "pos": "noun"
            },
            {
                "word": "peril",
                "pos": "noun"
            },
            {
                "word": "perilous",
                "pos": "adjective"
            },
            {
                "word": "perilously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "serious danger",
                    "vi": "nguy hiểm nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "in peril The country's economy is now in grave peril.",
                        "vi": "đang gặp nguy hiểm Nền kinh tế của đất nước hiện đang lâm vào tình trạng nguy hiểm nghiêm trọng."
                    },
                    {
                        "en": "The heroine finds herself in mortal peril.",
                        "vi": "Nữ chính thấy mình đang gặp nguy hiểm chết người."
                    },
                    {
                        "en": "She seemed blissfully unaware of the peril she was in.",
                        "vi": "Cô ấy có vẻ hạnh phúc khi không biết về nguy cơ mà mình đang gặp phải."
                    },
                    {
                        "en": "They warned that his life was in imminent peril.",
                        "vi": "Họ cảnh báo rằng cuộc sống của anh ta sắp gặp nguy hiểm."
                    },
                    {
                        "en": "peril of doing something We face the immediate peril of being bought out by another company.",
                        "vi": "nguy hiểm khi làm điều gì đó Chúng ta phải đối mặt với nguy cơ ngay lập tức là bị mua lại bởi một công ty khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of something being dangerous or harmful",
                    "vi": "thực tế là một cái gì đó nguy hiểm hoặc có hại"
                },
                "examples": [
                    {
                        "en": "She gave a warning about the perils of drug abuse.",
                        "vi": "Cô ấy đã đưa ra một cảnh báo về nguy cơ lạm dụng ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn somebody that if they do something, it may be dangerous or cause them problems",
                    "vi": "được sử dụng để cảnh báo ai đó rằng nếu họ làm điều gì đó, nó có thể nguy hiểm hoặc gây ra vấn đề cho họ"
                },
                "examples": [
                    {
                        "en": "Teachers ignore the importance of these results at their peril.",
                        "vi": "Các giáo viên phớt lờ tầm quan trọng của những kết quả này khi họ gặp nguy hiểm."
                    },
                    {
                        "en": "Ignore these warnings at your peril.",
                        "vi": "Bỏ qua những cảnh báo này khi bạn gặp nguy hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc5e05dc2a4f4371b3e7c3230f5360e3",
        "word": "evacuee",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˌvækjuˈiː/",
            "us": "/ɪˌvækjuˈiː/"
        },
        "nearby": [
            {
                "word": "evacuate",
                "pos": "verb"
            },
            {
                "word": "evacuation",
                "pos": "noun"
            },
            {
                "word": "evacuee",
                "pos": "noun"
            },
            {
                "word": "evade",
                "pos": "verb"
            },
            {
                "word": "evaluate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is sent away from a place because it is dangerous, especially during a war",
                    "vi": "một người bị đuổi khỏi một nơi vì nó nguy hiểm, đặc biệt là trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "Allowances were available to cover the cost of hosting an evacuee.",
                        "vi": "Các khoản trợ cấp đã có sẵn để trang trải chi phí tiếp đón một người di tản."
                    },
                    {
                        "en": "During 1942 evacuee families started to arrive in the town.",
                        "vi": "Trong năm 1942, các gia đình di tản bắt đầu đến thị trấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "afbeea56555e4aab9f69667e686d8015",
        "word": "flight",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/flaɪt/",
            "us": "/flaɪt/"
        },
        "nearby": [
            {
                "word": "flier",
                "pos": "noun"
            },
            {
                "word": "flies",
                "pos": "noun"
            },
            {
                "word": "flight",
                "pos": "noun"
            },
            {
                "word": "flight",
                "pos": "verb"
            },
            {
                "word": "flight attendant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a journey made by air, especially in a plane",
                    "vi": "một cuộc hành trình được thực hiện bằng đường hàng không, đặc biệt là trên máy bay"
                },
                "examples": [
                    {
                        "en": "a smooth/comfortable/bumpy flight",
                        "vi": "một chuyến bay suôn sẻ / thoải mái / gập ghềnh"
                    },
                    {
                        "en": "a domestic/an international flight",
                        "vi": "một chuyến bay nội địa / một chuyến bay quốc tế"
                    },
                    {
                        "en": "a transatlantic flight",
                        "vi": "một chuyến bay xuyên Đại Tây Dương"
                    },
                    {
                        "en": "The first prize is a return flight to Delhi.",
                        "vi": "Giải nhất là một chuyến bay khứ hồi đến Delhi."
                    },
                    {
                        "en": "China's first manned space flight",
                        "vi": "Chuyến bay không gian có người lái đầu tiên của Trung Quốc"
                    },
                    {
                        "en": "a hot-air balloon flight",
                        "vi": "một chuyến bay khinh khí cầu"
                    },
                    {
                        "en": "flight (from A) (to B) We met on a flight from London to Paris.",
                        "vi": "chuyến bay (từ A) (đến B) Chúng tôi đã gặp nhau trên chuyến bay từ London đến Paris."
                    },
                    {
                        "en": "It is vital that people get up and walk about if they are on a long-haul flight.",
                        "vi": "Điều quan trọng là mọi người phải đứng dậy và đi lại nếu họ đang trên một chuyến bay đường dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a plane making a particular journey",
                    "vi": "một chiếc máy bay thực hiện một hành trình cụ thể"
                },
                "examples": [
                    {
                        "en": "We're booked on the same flight.",
                        "vi": "Chúng tôi đã đặt trên cùng một chuyến bay."
                    },
                    {
                        "en": "If we leave now, I can catch the earlier flight.",
                        "vi": "Nếu chúng ta đi ngay bây giờ, tôi có thể bắt chuyến bay sớm hơn."
                    },
                    {
                        "en": "After a few phone calls he boarded a flight to Bangkok.",
                        "vi": "Sau một vài cuộc điện thoại, anh ấy đã lên chuyến bay đến Bangkok."
                    },
                    {
                        "en": "Flight BA 4793 is now boarding at Gate 17.",
                        "vi": "Chuyến bay BA 4793 hiện đang cất cánh tại Cổng 17."
                    },
                    {
                        "en": "They've cancelled my flight!",
                        "vi": "Họ đã hủy chuyến bay của tôi!"
                    },
                    {
                        "en": "flight (to A) (from B) At present there is no direct flight to Egypt from Namibia.",
                        "vi": "chuyến bay (đến A) (từ B) Hiện tại không có chuyến bay thẳng đến Ai Cập từ Namibia."
                    },
                    {
                        "en": "flight to A They took a commercial flight to Vicenza, Italy.",
                        "vi": "chuyến bay đến A Họ đáp chuyến bay thương mại đến Vicenza, Ý."
                    },
                    {
                        "en": "flight for A She took a flight for Los Angeles.",
                        "vi": "chuyến bay cho A Cô ấy đã đáp chuyến bay đến Los Angeles."
                    },
                    {
                        "en": "flight out of B I had an early morning flight out of Stockholm.",
                        "vi": "chuyến bay ra khỏi BI có một chuyến bay sáng sớm ra khỏi Stockholm."
                    },
                    {
                        "en": "flight between A and B All flights between New York and Washington have been cancelled due to fog.",
                        "vi": "chuyến bay giữa A và B Tất cả các chuyến bay giữa New York và Washington đã bị hủy do sương mù."
                    },
                    {
                        "en": "mercy/relief flights (= planes taking help to countries where there is a war)",
                        "vi": "chuyến bay thương xót / cứu trợ (= máy bay giúp đỡ các quốc gia có chiến tranh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of flying",
                    "vi": "hành động bay"
                },
                "examples": [
                    {
                        "en": "the age of supersonic flight",
                        "vi": "thời đại của chuyến bay siêu thanh"
                    },
                    {
                        "en": "in flight The bird is easily recognized in flight (= when it is flying) by the black band at the end of its tail.",
                        "vi": "trong chuyến bay Người ta dễ dàng nhận ra con chim đang bay (= khi nó đang bay) bởi dải đen ở cuối đuôi."
                    },
                    {
                        "en": "the stresses the body endures in space flight",
                        "vi": "căng thẳng mà cơ thể phải chịu đựng trong chuyến bay vũ trụ"
                    },
                    {
                        "en": "flight safety",
                        "vi": "hạ cánh an toàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement or direction of an object as it travels through the air",
                    "vi": "chuyển động hoặc hướng của một vật thể khi nó di chuyển trong không khí"
                },
                "examples": [
                    {
                        "en": "the flight of a ball",
                        "vi": "chuyến bay của một quả bóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of steps between two floors or levels",
                    "vi": "một loạt các bước giữa hai tầng hoặc các tầng"
                },
                "examples": [
                    {
                        "en": "She fell down a flight of stairs/steps and hurt her back.",
                        "vi": "Cô ấy bị ngã xuống cầu thang / bậc thang và bị thương ở lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of running away from a dangerous or difficult situation",
                    "vi": "hành động chạy trốn khỏi tình huống nguy hiểm hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "flight (of somebody) (from somebody/something) the flight of refugees from the advancing forces",
                        "vi": "chuyến bay (của ai đó) (từ ai đó / cái gì đó) chuyến bay của những người tị nạn khỏi các lực lượng tiến lên"
                    },
                    {
                        "en": "a flight from harsh reality",
                        "vi": "một chuyến bay khỏi thực tế khắc nghiệt"
                    },
                    {
                        "en": "in flight from something The main character is a journalist in flight from a failed marriage.",
                        "vi": "trong chuyến bay từ một cái gì đó Nhân vật chính là một nhà báo trong chuyến bay từ một cuộc hôn nhân thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "an idea or a statement that shows a lot of imagination but is not practical or sensible",
                    "vi": "một ý tưởng hoặc một tuyên bố thể hiện nhiều trí tưởng tượng nhưng không thực tế hoặc không hợp lý"
                },
                "examples": [
                    {
                        "en": "This idea was one of my wilder flights of fancy.",
                        "vi": "Ý tưởng này là một trong những chuyến bay hoang dã của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of birds or aircraft flying together",
                    "vi": "một nhóm chim hoặc máy bay bay cùng nhau"
                },
                "examples": [
                    {
                        "en": "a flight of geese",
                        "vi": "một chuyến bay của ngỗng"
                    },
                    {
                        "en": "They flew in two flights of three aircraft.",
                        "vi": "Họ đã bay trong hai chuyến bay của ba chiếc máy bay."
                    },
                    {
                        "en": "an aircraft of the Queen’s flight",
                        "vi": "một chiếc máy bay của chuyến bay của Nữ hoàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "among the best of a particular group",
                    "vi": "trong số những người giỏi nhất của một nhóm cụ thể"
                },
                "examples": [
                    {
                        "en": "This is the team’s first season back in the top flight for more than 60 years.",
                        "vi": "Đây là mùa giải đầu tiên của đội trở lại trong chuyến bay đỉnh cao trong hơn 60 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to run away",
                    "vi": "buộc ai đó bỏ chạy"
                },
                "examples": [
                    {
                        "en": "The enemy was quickly put to flight.",
                        "vi": "Kẻ thù nhanh chóng bị hạ gục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run away",
                    "vi": "bỏ chạy"
                },
                "examples": [
                    {
                        "en": "The gang took flight when they heard the police car.",
                        "vi": "Cả nhóm đã bay khi nghe thấy tiếng xe cảnh sát."
                    },
                    {
                        "en": "As soon as they detected the cheetah it took flight.",
                        "vi": "Ngay sau khi họ phát hiện ra con báo, nó đã bay."
                    }
                ]
            }
        ]
    },
    {
        "id": "2cb842e083c34cd483b2e152ecb2aa4e",
        "word": "foghorn",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɒɡhɔːn/",
            "us": "/ˈfɑːɡhɔːrn/"
        },
        "nearby": [
            {
                "word": "foggy",
                "pos": "adjective"
            },
            {
                "word": "Foggy Bottom",
                "pos": ""
            },
            {
                "word": "foghorn",
                "pos": "noun"
            },
            {
                "word": "fog lamp",
                "pos": "noun"
            },
            {
                "word": "fogy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that makes a loud noise to warn ships of danger in fog",
                    "vi": "thiết bị phát ra tiếng ồn lớn để cảnh báo tàu nguy hiểm trong sương mù"
                },
                "examples": [
                    {
                        "en": "He's got a voice like a foghorn (= a loud unpleasant voice).",
                        "vi": "Anh ấy có một giọng nói giống như sương mù (= một giọng nói lớn khó chịu)."
                    }
                ]
            }
        ]
    },
    {
        "id": "86ba846a8e5a46ed8250b4a6e24f19fd",
        "word": "forewarned is forearmed",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/fɔːˈwɔːn/",
            "us": "/fɔːrˈwɔːrn/"
        },
        "nearby": [
            {
                "word": "forever",
                "pos": "adverb"
            },
            {
                "word": "forever home",
                "pos": "noun"
            },
            {
                "word": "forewarn",
                "pos": "verb"
            },
            {
                "word": "forewarning",
                "pos": "noun"
            },
            {
                "word": "forewoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to warn somebody about something bad or unpleasant before it happens",
                    "vi": "để cảnh báo ai đó về điều gì đó tồi tệ hoặc khó chịu trước khi nó xảy ra"
                },
                "examples": [
                    {
                        "en": "be forewarned of something The commander had been forewarned of the attack.",
                        "vi": "được báo trước về điều gì đó Chỉ huy đã được báo trước về cuộc tấn công."
                    },
                    {
                        "en": "be forewarned that… They were forewarned that a storm was approaching.",
                        "vi": "được báo trước rằng… Họ đã được báo trước rằng một cơn bão đang đến gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you know about problems, dangers, etc. before they happen, you can be better prepared for them",
                    "vi": "nếu bạn biết về các vấn đề, nguy hiểm, v.v. trước khi chúng xảy ra, bạn có thể chuẩn bị tốt hơn cho chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dbc25bb2877844c98d51bd90ec7b85cf",
        "word": "live, etc. to tell the tale",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/tel/",
            "us": "/tel/"
        },
        "nearby": [
            {
                "word": "Thomas Telford",
                "pos": ""
            },
            {
                "word": "telic",
                "pos": "adjective"
            },
            {
                "word": "tell",
                "pos": "verb"
            },
            {
                "word": "tell against",
                "pos": "phrasal verb"
            },
            {
                "word": "tell-all",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give information to somebody by speaking or writing",
                    "vi": "để cung cấp thông tin cho ai đó bằng cách nói hoặc viết"
                },
                "examples": [
                    {
                        "en": "tell something to somebody He told the news to everybody he saw.",
                        "vi": "kể điều gì đó với ai đó Anh ấy đã kể tin tức cho tất cả những người anh ấy đã thấy."
                    },
                    {
                        "en": "tell somebody something He told everybody he saw the news.",
                        "vi": "nói với ai đó điều gì đó Anh ấy nói với mọi người anh ấy đã xem tin tức."
                    },
                    {
                        "en": "Did she tell you her name?",
                        "vi": "Cô ấy có nói cho bạn biết tên của cô ấy không?"
                    },
                    {
                        "en": "What did I tell you? (= you should have listened to my advice)",
                        "vi": "Tôi đã nói gì với bạn? (= bạn nên nghe lời khuyên của tôi)"
                    },
                    {
                        "en": "‘Come closer,’ she said, ‘I want to tell you something’.",
                        "vi": "Hãy đến gần hơn, cô ấy nói, \"Tôi muốn nói với bạn một điều\"."
                    },
                    {
                        "en": "tell somebody about something Why wasn't I told about the accident?",
                        "vi": "nói với ai đó về điều gì đó Tại sao tôi không được kể về vụ tai nạn?"
                    },
                    {
                        "en": "tell somebody/yourself (that)… They’ve told us (that) they’re not coming.",
                        "vi": "nói với ai đó / chính bạn (điều đó)… Họ đã nói với chúng tôi (rằng) họ sẽ không đến."
                    },
                    {
                        "en": "I told him straight (= in a direct way) that I wasn't voting for him.",
                        "vi": "Tôi đã nói thẳng với anh ấy (= một cách trực tiếp) rằng tôi không bỏ phiếu cho anh ấy."
                    },
                    {
                        "en": "He later told the court that he had returned the money.",
                        "vi": "Sau đó anh ta nói với tòa rằng anh ta đã trả lại tiền."
                    },
                    {
                        "en": "I kept telling myself (that) everything was OK.",
                        "vi": "Tôi tiếp tục nói với bản thân (rằng) mọi thứ đều ổn."
                    },
                    {
                        "en": "Are you telling me you didn't have any help with this? (= I don't believe what you have said)",
                        "vi": "Bạn đang nói với tôi rằng bạn không có bất kỳ sự giúp đỡ nào trong việc này? (= Tôi không tin những gì bạn đã nói)"
                    },
                    {
                        "en": "tell somebody where, what, etc… Tell me where you live.",
                        "vi": "nói với ai đó ở đâu, cái gì, v.v. Hãy cho tôi biết bạn sống ở đâu."
                    },
                    {
                        "en": "tell somebody + speech ‘I'm ready to go now,’ he told her.",
                        "vi": "nói với ai đó + bài phát biểu 'Tôi đã sẵn sàng đi ngay bây giờ,' anh ấy nói với cô ấy."
                    },
                    {
                        "en": "'We hope that there will be some progress,' he told reporters.",
                        "vi": "Chúng tôi hy vọng rằng sẽ có một số tiến bộ, ông nói với các phóng viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give information about something",
                    "vi": "để cung cấp thông tin về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tell somebody something The advertisement told us very little about the product.",
                        "vi": "nói với ai đó điều gì đó Quảng cáo cho chúng ta biết rất ít về sản phẩm."
                    },
                    {
                        "en": "tell somebody how, where, etc… This gauge tells you how much fuel you have left.",
                        "vi": "nói cho ai đó biết làm thế nào, ở đâu, v.v. ... Máy đo này cho bạn biết bạn còn lại bao nhiêu nhiên liệu."
                    },
                    {
                        "en": "tell somebody (that)… The sound of his breathing told her (that) he was asleep.",
                        "vi": "nói với ai đó (điều đó)… Tiếng thở của anh ấy nói với cô ấy (rằng) anh ấy đang ngủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express something in words",
                    "vi": "để diễn đạt điều gì đó bằng lời"
                },
                "examples": [
                    {
                        "en": "tell something to tell stories/jokes/lies",
                        "vi": "kể điều gì đó để kể chuyện / chuyện cười / nói dối"
                    },
                    {
                        "en": "Are you sure you're telling the truth?",
                        "vi": "Bạn có chắc là bạn đang nói sự thật?"
                    },
                    {
                        "en": "tell somebody how, what, etc… I can't tell you how happy I am.",
                        "vi": "nói cho ai đó biết làm thế nào, điều gì, v.v.… Tôi không thể nói với bạn rằng tôi hạnh phúc như thế nào."
                    },
                    {
                        "en": "tell somebody something We'd go fishing and she'd tell me stories.",
                        "vi": "nói với ai đó điều gì đó Chúng tôi sẽ đi câu cá và cô ấy sẽ kể cho tôi nghe những câu chuyện."
                    },
                    {
                        "en": "All of them had an interesting story to tell.",
                        "vi": "Tất cả họ đều có một câu chuyện thú vị để kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "to let somebody know a secret",
                    "vi": "để cho ai đó biết một bí mật"
                },
                "examples": [
                    {
                        "en": "Promise you won't tell.",
                        "vi": "Hãy hứa là bạn sẽ không nói."
                    },
                    {
                        "en": "‘Who are you going out with tonight?’ ‘That would be telling!’ (= it's a secret)",
                        "vi": "Bạn sẽ đi chơi với ai tối nay?' 'Cái sẽ nói!' (= đó là một bí mật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to order or advise somebody to do something",
                    "vi": "ra lệnh hoặc khuyên ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "tell somebody/yourself to do something He was told to sit down and wait.",
                        "vi": "bảo ai đó / bản thân bạn làm điều gì đó Anh ấy được yêu cầu ngồi xuống và đợi."
                    },
                    {
                        "en": "There was a sign telling motorists to slow down.",
                        "vi": "Có một biển báo cho những người lái xe ô tô giảm tốc độ."
                    },
                    {
                        "en": "I kept telling myself to keep calm.",
                        "vi": "Tôi cứ tự nhủ mình phải giữ bình tĩnh."
                    },
                    {
                        "en": "I specifically told you to be here on time.",
                        "vi": "Tôi đặc biệt nói với bạn là phải ở đây đúng giờ."
                    },
                    {
                        "en": "tell somebody something Do what I tell you.",
                        "vi": "nói với ai đó điều gì đó Hãy làm những gì tôi nói với bạn."
                    },
                    {
                        "en": "tell somebody Children must do as they're told.",
                        "vi": "nói với ai đó Trẻ em phải làm như chúng được bảo."
                    },
                    {
                        "en": "tell somebody what, when, etc… Don't tell me what to do!",
                        "vi": "nói với ai đó cái gì, khi nào, v.v. Đừng nói với tôi phải làm gì!"
                    },
                    {
                        "en": "tell somebody (that)… The doctor told me (that) I should eat less fat.",
                        "vi": "nói với ai đó (điều đó)… Bác sĩ nói với tôi (rằng) tôi nên ăn ít chất béo hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know, see or judge something correctly",
                    "vi": "để biết, xem hoặc đánh giá một cái gì đó một cách chính xác"
                },
                "examples": [
                    {
                        "en": "I think he's happy. It's hard to tell.",
                        "vi": "Tôi nghĩ anh ấy hạnh phúc. Nó rất khó để nói."
                    },
                    {
                        "en": "As far as I can tell, she's enjoying the course.",
                        "vi": "Theo như tôi có thể nói, cô ấy thích khóa học."
                    },
                    {
                        "en": "‘That's not an original.’ ‘How can you tell?’",
                        "vi": "Đó không phải là bản gốc.' \"Làm thế nào bạn có thể nói?\""
                    },
                    {
                        "en": "tell (that)… I could tell (that) he was angry from his expression.",
                        "vi": "nói (điều đó)… Tôi có thể nói (điều đó) anh ấy đang tức giận từ biểu hiện của mình."
                    },
                    {
                        "en": "tell how, if, etc… The only way to tell if you like something is by trying it.",
                        "vi": "nói như thế nào, nếu, v.v. ... Cách duy nhất để biết bạn có thích thứ gì đó hay không là thử nó."
                    },
                    {
                        "en": "It's too early to tell how popular this service will be.",
                        "vi": "Còn quá sớm để nói rằng dịch vụ này sẽ phổ biến như thế nào."
                    },
                    {
                        "en": "It's impossible to tell exactly where the problem is.",
                        "vi": "Không thể nói chính xác vấn đề là ở đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to recognize the difference between one thing or person and another",
                    "vi": "để nhận ra sự khác biệt giữa vật này hoặc người nọ và vật khác"
                },
                "examples": [
                    {
                        "en": "tell something It was hard to tell the difference between the two versions.",
                        "vi": "nói điều gì đó Thật khó để nhận ra sự khác biệt giữa hai phiên bản."
                    },
                    {
                        "en": "tell A from B Can you tell Tom from his twin brother?",
                        "vi": "nói với A từ B Bạn có thể nói với Tom từ anh trai sinh đôi của anh ấy không?"
                    },
                    {
                        "en": "Can you tell this copy from the original?",
                        "vi": "Bạn có thể cho biết bản sao này từ bản gốc không?"
                    },
                    {
                        "en": "tell A and B apart It's difficult to tell them apart.",
                        "vi": "phân biệt A và B Thật khó để phân biệt chúng."
                    },
                    {
                        "en": "tell which, what, etc… The kittens look exactly alike—how can you tell which is which?",
                        "vi": "nói cái nào, cái gì, v.v."
                    },
                    {
                        "en": "I couldn't tell who was meant to be the chairman.",
                        "vi": "Tôi không thể biết ai được định làm chủ tịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect on somebody/something, especially a bad one",
                    "vi": "có ảnh hưởng đến ai đó / điều gì đó, đặc biệt là một người xấu"
                },
                "examples": [
                    {
                        "en": "The strain was beginning to tell on the rescue team.",
                        "vi": "Đội cứu hộ bắt đầu căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with all people, etc. counted and included",
                    "vi": "với tất cả mọi người, v.v. được tính và bao gồm"
                },
                "examples": [
                    {
                        "en": "There are 52 people coming, all told.",
                        "vi": "Có 52 người đến, tất cả đã kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you know or can guess what somebody is going to say, especially because it is typical of them",
                    "vi": "được sử dụng để nói rằng bạn biết hoặc có thể đoán những gì ai đó sẽ nói, đặc biệt là vì nó là điển hình của họ"
                },
                "examples": [
                    {
                        "en": "Don't tell me you were late again!",
                        "vi": "Đừng nói với tôi rằng bạn đã đến muộn một lần nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hear people talking about something",
                    "vi": "để nghe mọi người nói về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I've often heard tell of such things.",
                        "vi": "Tôi thường nghe kể về những điều như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody the true facts about a situation, especially when these are not known by other people",
                    "vi": "được sử dụng để nói cho ai đó sự thật về một tình huống, đặc biệt là khi những sự thật này không được người khác biết"
                },
                "examples": [
                    {
                        "en": "If the truth be known, I was afraid to tell anyone.",
                        "vi": "Nếu sự thật được biết, tôi sợ không dám nói với ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something you have just said is not true or correct",
                    "vi": "được sử dụng để nói rằng điều gì đó bạn vừa nói là không đúng hoặc không đúng"
                },
                "examples": [
                    {
                        "en": "We first met in 2006, no, I tell a lie, it was 2007.",
                        "vi": "Chúng tôi gặp nhau lần đầu tiên vào năm 2006, không, tôi nói dối, đó là năm 2007."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying, especially when it is surprising or difficult to believe",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói, đặc biệt là khi nó gây ngạc nhiên hoặc khó tin"
                },
                "examples": [
                    {
                        "en": "It isn't cheap, I can tell you!",
                        "vi": "Nó không hề rẻ, tôi có thể nói với bạn!"
                    },
                    {
                        "en": "I'm telling you, that's exactly what she said.",
                        "vi": "Tôi đang nói với bạn, đó chính xác là những gì cô ấy đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a suggestion",
                    "vi": "được sử dụng để giới thiệu một gợi ý"
                },
                "examples": [
                    {
                        "en": "I'll tell you what—let's stay in instead.",
                        "vi": "Tôi sẽ cho bạn biết điều gì — thay vào đó hãy ở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when something bad has happened, to remind somebody that you warned them about it and they did not listen to you",
                    "vi": "được sử dụng khi điều gì đó tồi tệ đã xảy ra, để nhắc nhở ai đó rằng bạn đã cảnh báo họ về điều đó và họ không nghe bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of referring to somebody talking publicly, usually for money, about a past sexual relationship with somebody famous",
                    "vi": "một cách ám chỉ ai đó đang nói chuyện công khai, thường là vì tiền, về mối quan hệ tình ái trong quá khứ với người nổi tiếng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to know/tell somebody some useful, interesting or surprising information about somebody/something",
                    "vi": "để biết / nói với ai đó một số thông tin hữu ích, thú vị hoặc đáng ngạc nhiên về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's been married five times, so she knows a thing or two about men!",
                        "vi": "Cô ấy đã kết hôn năm lần, vì vậy cô ấy biết một hoặc hai điều về đàn ông!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody told you something but you do not want to say who it was",
                    "vi": "từng nói rằng ai đó đã nói với bạn điều gì đó nhưng bạn không muốn nói đó là ai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to survive a difficult or dangerous experience so that you can tell others what really happened",
                    "vi": "để sống sót qua một trải nghiệm khó khăn hoặc nguy hiểm để bạn có thể nói cho người khác biết điều gì đã thực sự xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give some information that is different from what you expect or have been told",
                    "vi": "để cung cấp một số thông tin khác với những gì bạn mong đợi hoặc đã được cho biết"
                },
                "examples": [
                    {
                        "en": "These drugs are widely believed to be effective medications. The data, however, tell a different story.",
                        "vi": "Những loại thuốc này được nhiều người tin rằng là những loại thuốc chữa bệnh hiệu quả. Tuy nhiên, dữ liệu lại kể một câu chuyện khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a question",
                    "vi": "dùng để giới thiệu một câu hỏi"
                },
                "examples": [
                    {
                        "en": "Tell me, have you had lunch yet?",
                        "vi": "Nói cho tôi biết, bạn đã ăn trưa chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you understand what somebody is talking about and have had the same experience",
                    "vi": "được sử dụng để nói rằng bạn hiểu những gì ai đó đang nói về và đã có trải nghiệm tương tự"
                },
                "examples": [
                    {
                        "en": "‘I get so annoyed with Steve!’ ‘Tell me about it. He drives me crazy.’",
                        "vi": "Tôi rất khó chịu với Steve!' 'Nói cho tôi nghe về nó đi. Anh ấy khiến tôi phát điên lên.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you do not believe what they have said",
                    "vi": "từng nói với ai đó rằng bạn không tin những gì họ đã nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to explain itself, without needing any further explanation or comment",
                    "vi": "để tự giải thích mà không cần giải thích hoặc bình luận gì thêm"
                },
                "examples": [
                    {
                        "en": "Her face told its own story.",
                        "vi": "Khuôn mặt của cô ấy đã kể câu chuyện của chính nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody about something that another person has done wrong",
                    "vi": "để nói với ai đó về điều gì đó mà người khác đã làm sai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody/know some useful, interesting or surprising information about somebody/something",
                    "vi": "để nói với ai đó / biết một số thông tin hữu ích, thú vị hoặc đáng ngạc nhiên về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "After winning several Oscars, Nick Park can tell you a thing or two about making animated films.",
                        "vi": "Sau khi giành được một số giải Oscar, Nick Park có thể cho bạn biết một hoặc hai điều về việc làm phim hoạt hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to read the time from a clock, etc.",
                    "vi": "để đọc thời gian từ đồng hồ, v.v."
                },
                "examples": [
                    {
                        "en": "She's only five—she hasn't learnt to tell the time yet.",
                        "vi": "Cô ấy mới năm tuổi — cô ấy chưa học cách nói thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it clear to somebody that you will no longer accept their bad behaviour",
                    "vi": "nói rõ với ai đó rằng bạn sẽ không chấp nhận hành vi xấu của họ nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make it clear to somebody that you are angry and are rejecting what they are offering you",
                    "vi": "để nói rõ với ai đó rằng bạn đang tức giận và đang từ chối những gì họ đang cung cấp cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that it is impossible to know what happened or will happen",
                    "vi": "được sử dụng để nói rằng không thể biết điều gì đã xảy ra hoặc sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "There's no telling how they'll react.",
                        "vi": "Không có gì để biết họ sẽ phản ứng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will have to wait for some time to find out the result of a situation",
                    "vi": "thường nói rằng bạn sẽ phải đợi một thời gian để tìm ra kết quả của một tình huống"
                },
                "examples": [
                    {
                        "en": "Only time will tell if the treatment has been successful.",
                        "vi": "Chỉ có thời gian mới biết liệu việc điều trị có thành công hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when admitting something",
                    "vi": "được sử dụng khi thừa nhận điều gì đó"
                },
                "examples": [
                    {
                        "en": "To tell the truth, I fell asleep in the middle of her talk.",
                        "vi": "Nói thật là tôi đã ngủ quên giữa buổi nói chuyện của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "you can never be sure, for example because things are not always what they appear to be",
                    "vi": "bạn không bao giờ có thể chắc chắn, chẳng hạn như vì mọi thứ không phải lúc nào cũng giống như"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "I completely agree with you",
                    "vi": "Tôi hoàn toàn đồng ý với bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "478429cfd87747de8b4b4594c44241f6",
        "word": "mind out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "mind-numbing",
                "pos": "adjective"
            },
            {
                "word": "mind-numbingly",
                "pos": "adverb"
            },
            {
                "word": "mind out",
                "pos": "phrasal verb"
            },
            {
                "word": "mind reader",
                "pos": "noun"
            },
            {
                "word": "mindset",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to tell somebody to move so that you can pass",
                    "vi": "được sử dụng để nói với ai đó di chuyển để bạn có thể vượt qua"
                },
                "examples": [
                    {
                        "en": "Mind out—you're in the way there!",
                        "vi": "Lưu ý — bạn đang theo cách đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn somebody of danger",
                    "vi": "được sử dụng để cảnh báo ai đó về sự nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Have some of my plum jam—but mind out for the stones.",
                        "vi": "Hãy ăn một ít mứt mận của tôi — nhưng hãy để ý đến những viên đá."
                    }
                ]
            }
        ]
    },
    {
        "id": "e5dad4d49c94435ab5814960da8d934f",
        "word": "precautionary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/prɪˈkɔːʃənəri/",
            "us": "/prɪˈkɔːʃəneri/"
        },
        "nearby": [
            {
                "word": "precast",
                "pos": "adjective"
            },
            {
                "word": "precaution",
                "pos": "noun"
            },
            {
                "word": "precautionary",
                "pos": "adjective"
            },
            {
                "word": "precede",
                "pos": "verb"
            },
            {
                "word": "precedence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done in order to prevent problems or to avoid danger",
                    "vi": "được thực hiện để ngăn ngừa sự cố hoặc để tránh nguy hiểm"
                },
                "examples": [
                    {
                        "en": "He was kept in the hospital overnight as a precautionary measure.",
                        "vi": "Anh ta được giữ lại bệnh viện qua đêm như một biện pháp phòng ngừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "d38f4170612f43679ad6c8a320707739",
        "word": "presence of mind",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprezns əv ˈmaɪnd/",
            "us": "/ˌprezns əv ˈmaɪnd/"
        },
        "nearby": [
            {
                "word": "pre-sell",
                "pos": "verb"
            },
            {
                "word": "presence",
                "pos": "noun"
            },
            {
                "word": "presence of mind",
                "pos": "noun"
            },
            {
                "word": "present",
                "pos": "adjective"
            },
            {
                "word": "present",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to react quickly and stay calm in a difficult or dangerous situation",
                    "vi": "khả năng phản ứng nhanh chóng và giữ bình tĩnh trong một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The boy had the presence of mind to turn off the gas.",
                        "vi": "Chàng trai có tâm hiện tại tắt ga."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab32b52f1982456f9103ac984576e3ec",
        "word": "red alert",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌred əˈlɜːt/",
            "us": "/ˌred əˈlɜːrt/"
        },
        "nearby": [
            {
                "word": "redaction",
                "pos": "noun"
            },
            {
                "word": "red admiral",
                "pos": "noun"
            },
            {
                "word": "red alert",
                "pos": "noun"
            },
            {
                "word": "the Red Arrows",
                "pos": ""
            },
            {
                "word": "the Red Berets",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which you are prepared for something dangerous to happen; a warning of this",
                    "vi": "một tình huống mà bạn đang chuẩn bị cho một điều gì đó nguy hiểm sẽ xảy ra; một cảnh báo về điều này"
                },
                "examples": [
                    {
                        "en": "Following the bomb blast, local hospitals have been put on red alert.",
                        "vi": "Sau vụ nổ bom, các bệnh viện địa phương đã được đặt trong tình trạng báo động đỏ."
                    },
                    {
                        "en": "The water authority has issued a red alert until the cause of the pollution has been removed.",
                        "vi": "Cơ quan cấp nước đã ban hành báo động đỏ cho đến khi nguyên nhân ô nhiễm được loại bỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ecd32ef9bce144bfa0ca7091df7a6a1e",
        "word": "red flag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌred ˈflæɡ/",
            "us": "/ˌred ˈflæɡ/"
        },
        "nearby": [
            {
                "word": "red-eye",
                "pos": "noun"
            },
            {
                "word": "red-faced",
                "pos": "adjective"
            },
            {
                "word": "red flag",
                "pos": "noun"
            },
            {
                "word": "The Red Flag",
                "pos": ""
            },
            {
                "word": "red giant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flag used to warn people of danger",
                    "vi": "một lá cờ được sử dụng để cảnh báo mọi người về sự nguy hiểm"
                },
                "examples": [
                    {
                        "en": "You mustn’t swim when the red flag is flying.",
                        "vi": "Bạn không được bơi khi lá cờ đỏ đang bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a red flag as a symbol of revolution or communism",
                    "vi": "lá cờ đỏ là biểu tượng của cách mạng hoặc chủ nghĩa cộng sản"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed4bfd4078d2432d80b7f1b11e646a5a",
        "word": "risk-averse",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrɪsk əvɜːs/",
            "us": "/ˈrɪsk əvɜːrs/"
        },
        "nearby": [
            {
                "word": "risk",
                "pos": "verb"
            },
            {
                "word": "risk assessment",
                "pos": "noun"
            },
            {
                "word": "risk-averse",
                "pos": "adjective"
            },
            {
                "word": "riskily",
                "pos": "adverb"
            },
            {
                "word": "riskiness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not willing to do something if it is possible that something bad could happen as a result",
                    "vi": "không sẵn sàng làm điều gì đó nếu có thể là một điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "We live in a risk-averse culture.",
                        "vi": "Chúng ta đang sống trong một nền văn hóa không thích rủi ro."
                    },
                    {
                        "en": "In business you cannot be innovative and risk-averse at the same time.",
                        "vi": "Trong kinh doanh, bạn không thể đồng thời đổi mới và không ngại rủi ro."
                    }
                ]
            }
        ]
    }
]