[
    {
        "id": "78d91de2ce2a46a3808d8d98f2e19677",
        "word": "bath",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/bɑːθ/",
            "us": "/bæθ/"
        },
        "nearby": [
            {
                "word": "Norman Bates",
                "pos": ""
            },
            {
                "word": "batgirl",
                "pos": "noun"
            },
            {
                "word": "bath",
                "pos": "noun"
            },
            {
                "word": "bath",
                "pos": "verb"
            },
            {
                "word": "Bath",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large, long container that you put water in and then get into to wash your whole body",
                    "vi": "một cái thùng lớn và dài mà bạn cho nước vào rồi lấy nước đó để rửa toàn bộ cơ thể"
                },
                "examples": [
                    {
                        "en": "I'm in the bath!",
                        "vi": "Tôi ở trong bôn tăm!"
                    },
                    {
                        "en": "bath taps",
                        "vi": "vòi tắm"
                    },
                    {
                        "en": "a bath with shower attachment",
                        "vi": "một bồn tắm với vòi hoa sen đính kèm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of washing your whole body by sitting or lying in water",
                    "vi": "một hành động rửa toàn bộ cơ thể của bạn bằng cách ngồi hoặc nằm trong nước"
                },
                "examples": [
                    {
                        "en": "(British English) I think I'll have a bath and go to bed.",
                        "vi": "(Anh Anh) Tôi nghĩ tôi sẽ đi tắm và đi ngủ."
                    },
                    {
                        "en": "(especially North American English) to take a bath",
                        "vi": "(đặc biệt là người Anh ở Bắc Mỹ) đi tắm"
                    },
                    {
                        "en": "She took the baby upstairs to give him a bath.",
                        "vi": "Cô bế đứa bé lên gác để tắm cho nó."
                    },
                    {
                        "en": "It's the children's bath time.",
                        "vi": "Đã đến giờ tắm của bọn trẻ."
                    },
                    {
                        "en": "When she got home she decided she needed a bath.",
                        "vi": "Khi về đến nhà, cô quyết định mình cần đi tắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the water in a bath ready to use",
                    "vi": "nước trong bồn tắm đã sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "a long soak in a hot bath",
                        "vi": "ngâm mình lâu trong bồn tắm nước nóng"
                    },
                    {
                        "en": "Please run a bath for me (= fill the bath with water).",
                        "vi": "Please run a bath for me (= đổ đầy nước vào bồn tắm)."
                    },
                    {
                        "en": "I lay soaking in a hot bubble bath.",
                        "vi": "Tôi nằm ngâm mình trong bồn nước nóng đầy bọt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public building where you can go to swim",
                    "vi": "một tòa nhà công cộng nơi bạn có thể đi bơi"
                },
                "examples": [
                    {
                        "en": "My father took me to the baths every Sunday.",
                        "vi": "Cha tôi đưa tôi đi tắm vào Chủ nhật hàng tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public place where people went in the past to wash or have a bath",
                    "vi": "một nơi công cộng mà trước đây mọi người đã đến để tắm rửa hoặc tắm rửa"
                },
                "examples": [
                    {
                        "en": "Roman villas and baths",
                        "vi": "Biệt thự La Mã và nhà tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a container with a liquid such as water or a dye in it, in which something is washed or placed for a period of time. Baths are used in industrial, chemical and medical processes.",
                    "vi": "một vật chứa có chất lỏng như nước hoặc thuốc nhuộm, trong đó một thứ gì đó được rửa hoặc đặt trong một khoảng thời gian. Bồn tắm được sử dụng trong các quy trình công nghiệp, hóa chất và y tế."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to lose money on a business agreement",
                    "vi": "mất tiền trong một thỏa thuận kinh doanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "508ae46fe59445b6af71ec80d406be74",
        "word": "light",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/laɪt/",
            "us": "/laɪt/"
        },
        "nearby": [
            {
                "word": "ligature",
                "pos": "noun"
            },
            {
                "word": "ligger",
                "pos": "noun"
            },
            {
                "word": "light",
                "pos": "noun"
            },
            {
                "word": "light",
                "pos": "adjective"
            },
            {
                "word": "light",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the energy from the sun, a lamp, etc. that makes it possible to see things",
                    "vi": "năng lượng từ mặt trời, đèn, v.v. giúp bạn có thể nhìn thấy mọi thứ"
                },
                "examples": [
                    {
                        "en": "bright/dim light",
                        "vi": "ánh sáng sáng / mờ"
                    },
                    {
                        "en": "a room with good natural light",
                        "vi": "một căn phòng có ánh sáng tự nhiên tốt"
                    },
                    {
                        "en": "White paint reflects the light.",
                        "vi": "Màu sơn trắng phản chiếu ánh sáng."
                    },
                    {
                        "en": "The light was beginning to fail (= it was beginning to get dark).",
                        "vi": "The light was started to fail (= trời bắt đầu tối)."
                    },
                    {
                        "en": "The knife gleamed as it caught the light (= as the light shone on it).",
                        "vi": "Con dao sáng lấp lánh khi nó bắt được ánh sáng (= as the light shone on it)."
                    },
                    {
                        "en": "The substance causes the bacteria to emit light.",
                        "vi": "Chất làm cho vi khuẩn phát ra ánh sáng."
                    },
                    {
                        "en": "Some light filters through the dense tree cover.",
                        "vi": "Một số ánh sáng lọc qua lớp cây dày đặc."
                    },
                    {
                        "en": "by the light of something She could just see by the light of the candle.",
                        "vi": "bởi ánh sáng của thứ gì đó Cô ấy chỉ có thể nhìn thấy bằng ánh sáng của ngọn nến."
                    },
                    {
                        "en": "in the fading light of a summer’s evening",
                        "vi": "trong ánh sáng mờ dần của buổi tối mùa hè"
                    },
                    {
                        "en": "into the light Bring it into the light so I can see it.",
                        "vi": "vào ánh sáng Đưa nó vào ánh sáng để tôi có thể nhìn thấy nó."
                    },
                    {
                        "en": "towards the light The plants grow towards the light.",
                        "vi": "hướng tới ánh sáng Các cây phát triển hướng tới ánh sáng."
                    },
                    {
                        "en": "travelling at the speed of light",
                        "vi": "di chuyển với tốc độ ánh sáng"
                    },
                    {
                        "en": "a beam/ray of light",
                        "vi": "một chùm / tia sáng"
                    },
                    {
                        "en": "a light source/beam",
                        "vi": "một nguồn / chùm ánh sáng"
                    },
                    {
                        "en": "changes in light intensity",
                        "vi": "thay đổi cường độ ánh sáng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of light with its own colour or qualities",
                    "vi": "một loại ánh sáng cụ thể với màu sắc hoặc phẩm chất riêng của nó"
                },
                "examples": [
                    {
                        "en": "A cold, grey light crept under the curtains.",
                        "vi": "Một tia sáng xám lạnh lẽo len lỏi dưới rèm cửa."
                    },
                    {
                        "en": "It glowed and gave off a white light.",
                        "vi": "Nó phát sáng và phát ra ánh sáng trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that produces light, especially an electric light",
                    "vi": "một thứ tạo ra ánh sáng, đặc biệt là đèn điện"
                },
                "examples": [
                    {
                        "en": "to turn/switch the lights on/off",
                        "vi": "để bật / tắt đèn"
                    },
                    {
                        "en": "to turn out the light(s)",
                        "vi": "tắt (các) ánh sáng"
                    },
                    {
                        "en": "to turn down/dim the lights",
                        "vi": "tắt / làm mờ đèn"
                    },
                    {
                        "en": "the lights fade/flicker",
                        "vi": "ánh sáng mờ dần / nhấp nháy"
                    },
                    {
                        "en": "The lights dimmed and the film began.",
                        "vi": "Ánh đèn mờ đi và bộ phim bắt đầu."
                    },
                    {
                        "en": "Suddenly all the lights went out.",
                        "vi": "Đột nhiên tất cả các đèn tắt."
                    },
                    {
                        "en": "It was an hour before the lights came on again.",
                        "vi": "Đã một giờ trước khi đèn bật sáng trở lại."
                    },
                    {
                        "en": "A light flashed in the distance.",
                        "vi": "Xa xa lóe lên một tia sáng."
                    },
                    {
                        "en": "A bright light shone in his eyes.",
                        "vi": "Ánh sáng rực rỡ chiếu vào mắt anh."
                    },
                    {
                        "en": "ceiling/wall lights",
                        "vi": "đèn trần / tường"
                    },
                    {
                        "en": "The city twinkled with Christmas lights.",
                        "vi": "Thành phố lấp lánh ánh đèn Giáng sinh."
                    },
                    {
                        "en": "A police car went by with flashing lights.",
                        "vi": "Một chiếc xe cảnh sát đi qua với đèn nhấp nháy."
                    },
                    {
                        "en": "Keep going—the lights (= traffic lights) are green.",
                        "vi": "Tiếp tục đi — đèn (= đèn giao thông) màu xanh lục."
                    },
                    {
                        "en": "Check your car before you drive to make sure that your lights are working.",
                        "vi": "Kiểm tra xe trước khi lái xe để đảm bảo rằng đèn của bạn đang hoạt động."
                    },
                    {
                        "en": "He was cycling at night without lights.",
                        "vi": "Anh ấy đã đạp xe vào ban đêm mà không có đèn."
                    },
                    {
                        "en": "She felt along the wall and found the light switch.",
                        "vi": "Cô sờ dọc theo bức tường và tìm thấy công tắc đèn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an expression in somebody’s eyes that shows what they are thinking or feeling",
                    "vi": "biểu hiện trong mắt ai đó cho thấy họ đang nghĩ gì hoặc cảm thấy gì"
                },
                "examples": [
                    {
                        "en": "There was a soft light in her eyes as she looked at him.",
                        "vi": "Có một tia sáng dịu dàng trong mắt cô khi cô nhìn anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "light colours in a picture, which contrast with darker ones",
                    "vi": "màu sáng trong một bức tranh, tương phản với màu tối hơn"
                },
                "examples": [
                    {
                        "en": "Examine the artist's use of light and shade.",
                        "vi": "Kiểm tra việc sử dụng ánh sáng và bóng râm của nghệ sĩ."
                    },
                    {
                        "en": "contrasting areas of light and dark",
                        "vi": "vùng sáng và tối tương phản"
                    }
                ]
            },
            {
                "define": {
                    "en": "a match or device with which you can light a cigarette",
                    "vi": "que diêm hoặc thiết bị mà bạn có thể châm thuốc"
                },
                "examples": [
                    {
                        "en": "(British English) Have you got a light?",
                        "vi": "(Anh Anh) Bạn có đèn không?"
                    },
                    {
                        "en": "(North American English, British English) Do you have a light?",
                        "vi": "(Tiếng Anh Bắc Mỹ, tiếng Anh Anh) Do you have a light?"
                    },
                    {
                        "en": "Could you give me a light?",
                        "vi": "Bạn có thể cho tôi một ánh sáng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a window or an opening to allow light in",
                    "vi": "một cửa sổ hoặc một khe hở để cho phép ánh sáng vào"
                },
                "examples": [
                    {
                        "en": "leaded lights",
                        "vi": "đèn chì"
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the standards that somebody sets for himself or herself",
                    "vi": "theo các tiêu chuẩn mà ai đó đặt ra cho chính mình"
                },
                "examples": [
                    {
                        "en": "The police were left to do the job according to their lights.",
                        "vi": "Cảnh sát được để làm công việc theo ánh sáng của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be between somebody and a source of light",
                    "vi": "ở giữa ai đó và nguồn ánh sáng"
                },
                "examples": [
                    {
                        "en": "Could you move—you're in my light.",
                        "vi": "Bạn có thể di chuyển không - bạn đang ở trong ánh sáng của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to sleep very quickly",
                    "vi": "đi ngủ rất nhanh"
                },
                "examples": [
                    {
                        "en": "She returned to bed and went out like a light.",
                        "vi": "Cô trở lại giường và đi ra ngoài như một ngọn đèn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be pleasant, friendly and polite",
                    "vi": "trở nên dễ chịu, thân thiện và lịch sự"
                },
                "examples": [
                    {
                        "en": "I can’t complain—he’s been all sweetness and light with me.",
                        "vi": "Tôi không thể phàn nàn — anh ấy luôn ngọt ngào và nhẹ nhàng với tôi."
                    },
                    {
                        "en": "People think she's all sweetness and light, but she actually has a temper.",
                        "vi": "Mọi người nghĩ rằng cô ấy rất ngọt ngào và nhẹ nhàng, nhưng cô ấy thực sự rất nóng tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be fun and easy to deal with",
                    "vi": "để trở nên vui vẻ và dễ dàng đối phó với"
                },
                "examples": [
                    {
                        "en": "It’s not all sweetness and light being an actor.",
                        "vi": "Việc trở thành một diễn viên không phải là tất cả đều ngọt ngào và nhẹ nhàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the excitement of city life",
                    "vi": "sự sôi động của cuộc sống thành phố"
                },
                "examples": [
                    {
                        "en": "Although he grew up in the country, he's always had a taste for the bright lights.",
                        "vi": "Mặc dù lớn lên ở nông thôn, nhưng anh ấy luôn có niềm yêu thích với ánh đèn rực rỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make new information known to people",
                    "vi": "để mọi người biết đến thông tin mới"
                },
                "examples": [
                    {
                        "en": "These facts have only just been brought to light.",
                        "vi": "Những sự thật này chỉ mới được đưa ra ánh sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a problem, etc. easier to understand",
                    "vi": "để tạo ra một vấn đề, v.v. dễ hiểu hơn"
                },
                "examples": [
                    {
                        "en": "Recent research has thrown new light on the causes of the disease.",
                        "vi": "Nghiên cứu gần đây đã đưa ra ánh sáng mới về nguyên nhân của căn bệnh này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become known to people",
                    "vi": "được mọi người biết đến"
                },
                "examples": [
                    {
                        "en": "New evidence has recently come to light.",
                        "vi": "Bằng chứng mới gần đây đã được đưa ra ánh sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not let people know that you are good at something",
                    "vi": "để không cho mọi người biết rằng bạn giỏi một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when you have had time to think calmly about something; in the morning when things are clearer",
                    "vi": "khi bạn đã có thời gian để bình tĩnh suy nghĩ về điều gì đó; vào buổi sáng khi mọi thứ rõ ràng hơn"
                },
                "examples": [
                    {
                        "en": "These things always look different in the cold light of day.",
                        "vi": "Những thứ này luôn trông khác biệt trong ánh sáng lạnh giá của ban ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you see something or put something in a good, bad, etc. light, it seems good, bad, etc.",
                    "vi": "nếu bạn nhìn thấy một cái gì đó hoặc đặt một cái gì đó trong ánh sáng tốt, xấu, v.v., nó có vẻ tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "You must not view what happened in a negative light.",
                        "vi": "Bạn không được xem những gì đã xảy ra dưới ánh sáng tiêu cực."
                    },
                    {
                        "en": "They want to present their policies in the best possible light.",
                        "vi": "Họ muốn trình bày các chính sách của mình theo cách tốt nhất có thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "after considering something",
                    "vi": "sau khi xem xét một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He rewrote the book in the light of further research.",
                        "vi": "Ông đã viết lại cuốn sách dưới góc độ nghiên cứu sâu hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to stop at a red traffic light",
                    "vi": "không dừng lại ở đèn giao thông đỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that shows you are nearly at the end of a long and difficult time or situation",
                    "vi": "một cái gì đó cho thấy bạn gần kết thúc một thời gian hoặc tình huống dài và khó khăn"
                },
                "examples": [
                    {
                        "en": "For the first time since the start of his treatment, we can now see light at the end of the tunnel.",
                        "vi": "Lần đầu tiên kể từ khi anh ấy bắt đầu điều trị, bây giờ chúng ta có thể nhìn thấy ánh sáng ở cuối đường hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody suddenly understood or began to understand something",
                    "vi": "ai đó đột nhiên hiểu hoặc bắt đầu hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I puzzled over the problem for ages before the light suddenly dawned.",
                        "vi": "Tôi đã phân vân về vấn đề này trong nhiều năm trước khi ánh sáng đột nhiên ló dạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person somebody loves more than any other",
                    "vi": "người mà ai đó yêu hơn bất kỳ người nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe somebody who is stupid, not thinking clearly or not paying attention",
                    "vi": "được sử dụng để mô tả ai đó ngu ngốc, không suy nghĩ rõ ràng hoặc không chú ý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to finally understand or accept something, especially something obvious",
                    "vi": "để cuối cùng hiểu hoặc chấp nhận điều gì đó, đặc biệt là điều gì đó hiển nhiên"
                },
                "examples": [
                    {
                        "en": "He thinks she’s wonderful but he’ll soon see the light! (= realize that she’s not)",
                        "vi": "Anh ấy nghĩ cô ấy tuyệt vời nhưng anh ấy sẽ sớm nhìn thấy ánh sáng! (= nhận ra rằng cô ấy không phải)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to believe in a religion",
                    "vi": "bắt đầu tin vào một tôn giáo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to begin to exist or to become publicly known about",
                    "vi": "bắt đầu tồn tại hoặc được công chúng biết đến"
                },
                "examples": [
                    {
                        "en": "He's written a lot of good material that has never seen the light of day.",
                        "vi": "Anh ấy đã viết rất nhiều tài liệu hay chưa từng thấy ánh sáng trong ngày."
                    },
                    {
                        "en": "Some of his paintings never even saw the light of day.",
                        "vi": "Một số bức tranh của ông thậm chí không bao giờ nhìn thấy ánh sáng ban ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something start burning",
                    "vi": "để làm cho một cái gì đó bắt đầu cháy"
                },
                "examples": [
                    {
                        "en": "A spark from the fire had set light to a rug.",
                        "vi": "Một tia lửa từ ngọn lửa đã thắp sáng một tấm thảm."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8c4295604634cf0b6b7f59be8756cc4",
        "word": "shower",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈʃaʊə(r)/",
            "us": "/ˈʃaʊər/"
        },
        "nearby": [
            {
                "word": "showcase",
                "pos": "verb"
            },
            {
                "word": "showdown",
                "pos": "noun"
            },
            {
                "word": "shower",
                "pos": "noun"
            },
            {
                "word": "shower",
                "pos": "verb"
            },
            {
                "word": "showery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment producing a flow of water that you stand under to wash yourself; the small room or part of a room that contains a shower",
                    "vi": "một thiết bị tạo ra dòng nước mà bạn đứng dưới để rửa mình; căn phòng nhỏ hoặc một phần của căn phòng có vòi hoa sen"
                },
                "examples": [
                    {
                        "en": "in the shower He's in the shower.",
                        "vi": "trong phòng tắm Anh ấy đang trong phòng tắm."
                    },
                    {
                        "en": "I've just got out of the shower.",
                        "vi": "Tôi vừa mới ra khỏi phòng tắm."
                    },
                    {
                        "en": "an en-suite shower room",
                        "vi": "phòng tắm riêng"
                    },
                    {
                        "en": "a shower cubicle/curtain",
                        "vi": "một buồng tắm / rèm"
                    },
                    {
                        "en": "an electric shower",
                        "vi": "vòi sen điện"
                    },
                    {
                        "en": "a hotel room with bath and shower",
                        "vi": "một phòng khách sạn có bồn tắm và vòi hoa sen"
                    },
                    {
                        "en": "She was getting into the shower when the doorbell rang.",
                        "vi": "Cô đang đi tắm thì chuông cửa vang lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of washing yourself with a shower",
                    "vi": "tắm rửa bằng vòi hoa sen"
                },
                "examples": [
                    {
                        "en": "a hot/cold shower",
                        "vi": "vòi sen nước nóng / lạnh"
                    },
                    {
                        "en": "(especially British English) to have a shower",
                        "vi": "(đặc biệt là tiếng Anh Anh) để tắm"
                    },
                    {
                        "en": "(especially North American English) to take a shower",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để đi tắm"
                    },
                    {
                        "en": "shower gel",
                        "vi": "sữa tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of rain or snow",
                    "vi": "mưa hoặc tuyết trong thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "scattered/heavy showers",
                        "vi": "mưa rào rải rác / nặng hạt"
                    },
                    {
                        "en": "April showers",
                        "vi": "Tháng tư mưa rào"
                    },
                    {
                        "en": "We were caught in a heavy shower.",
                        "vi": "Chúng tôi đã bị bắt gặp trong một trận mưa rào."
                    },
                    {
                        "en": "There's a chance of showers this afternoon.",
                        "vi": "Có thể có mưa rào vào chiều nay."
                    },
                    {
                        "en": "rain/snow showers",
                        "vi": "mưa / mưa tuyết"
                    },
                    {
                        "en": "wintry showers (= of snow)",
                        "vi": "mưa rào (= tuyết)"
                    },
                    {
                        "en": "shower of something a shower of rain/hail/hailstones",
                        "vi": "cơn mưa rào của cái gì đó một cơn mưa rào / mưa đá / mưa đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of things that arrive or fall together",
                    "vi": "một số lượng lớn những thứ đến hoặc rơi cùng nhau"
                },
                "examples": [
                    {
                        "en": "a meteor shower",
                        "vi": "mưa sao băng"
                    },
                    {
                        "en": "a shower of leaves",
                        "vi": "một cơn mưa lá"
                    },
                    {
                        "en": "a shower of sparks from the fire",
                        "vi": "một tia lửa từ ngọn lửa"
                    },
                    {
                        "en": "a shower of kisses",
                        "vi": "một nụ hôn mưa rào"
                    }
                ]
            },
            {
                "define": {
                    "en": "a party at which you give presents to a woman who is getting married or having a baby",
                    "vi": "một bữa tiệc mà bạn tặng quà cho một người phụ nữ sắp kết hôn hoặc sinh con"
                },
                "examples": [
                    {
                        "en": "a bridal/baby shower",
                        "vi": "tắm cho cô dâu / em bé"
                    }
                ]
            }
        ]
    },
    {
        "id": "bef43eed7ec746bbae38e6e7efa2779b",
        "word": "telephone",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtelɪfəʊn/",
            "us": "/ˈtelɪfəʊn/"
        },
        "nearby": [
            {
                "word": "telepathically",
                "pos": "adverb"
            },
            {
                "word": "telepathy",
                "pos": "noun"
            },
            {
                "word": "telephone",
                "pos": "noun"
            },
            {
                "word": "telephone",
                "pos": "verb"
            },
            {
                "word": "telephone banking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for talking to somebody else over long distances, using wires or radio; a machine used for this",
                    "vi": "một hệ thống để nói chuyện với người khác trong khoảng cách xa, sử dụng dây hoặc radio; một chiếc máy được sử dụng cho việc này"
                },
                "examples": [
                    {
                        "en": "The telephone rang and Pat answered it.",
                        "vi": "Điện thoại reo và Pat trả lời."
                    },
                    {
                        "en": "I need to make a telephone call.",
                        "vi": "Tôi cần gọi điện thoại."
                    },
                    {
                        "en": "over the telephone You can reserve seats over the telephone.",
                        "vi": "qua điện thoại Bạn có thể đặt chỗ qua điện thoại."
                    },
                    {
                        "en": "by telephone Can I get in touch by telephone?",
                        "vi": "qua điện thoại Tôi có thể liên lạc qua điện thoại không?"
                    },
                    {
                        "en": "on the telephone They talk on the telephone much more often than they meet.",
                        "vi": "trên điện thoại Họ nói chuyện qua điện thoại thường xuyên hơn nhiều so với gặp gỡ."
                    },
                    {
                        "en": "She spoke by telephone to the French President.",
                        "vi": "Cô đã nói chuyện qua điện thoại với Tổng thống Pháp."
                    },
                    {
                        "en": "a telephone conversation/interview",
                        "vi": "một cuộc trò chuyện / phỏng vấn qua điện thoại"
                    },
                    {
                        "en": "telephone lines/services",
                        "vi": "đường dây điện thoại / dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the phone that you hold in your hand and speak into",
                    "vi": "phần điện thoại bạn cầm trên tay và nói"
                },
                "examples": [
                    {
                        "en": "I picked up the telephone and called some people I knew.",
                        "vi": "Tôi nhấc điện thoại và gọi cho một số người tôi biết."
                    },
                    {
                        "en": "She put down the telephone and burst into tears.",
                        "vi": "Cô đặt điện thoại xuống và bật khóc."
                    },
                    {
                        "en": "I've been trying to phone him all day—he must have left his telephone off the hook.",
                        "vi": "Tôi đã cố gắng gọi điện cho anh ấy cả ngày - chắc chắn anh ấy đã để quên điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be using the phone",
                    "vi": "sử dụng điện thoại"
                },
                "examples": [
                    {
                        "en": "He's on the telephone at the moment.",
                        "vi": "Anh ấy đang nghe điện thoại vào lúc này."
                    },
                    {
                        "en": "You're wanted (= somebody wants to speak to you) on the telephone.",
                        "vi": "Bạn đang muốn (= ai đó muốn nói chuyện với bạn) qua điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a phone in your home or place of work",
                    "vi": "để có điện thoại ở nhà hoặc nơi làm việc của bạn"
                },
                "examples": [
                    {
                        "en": "We were not on the telephone at the cottage.",
                        "vi": "Chúng tôi không nói chuyện điện thoại ở ngôi nhà nhỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "956596c506b146519d00c94072b1554d",
        "word": "television",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtelɪvɪʒn/",
            "us": "/ˈtelɪvɪʒn/"
        },
        "nearby": [
            {
                "word": "televangelist",
                "pos": "noun"
            },
            {
                "word": "televise",
                "pos": "verb"
            },
            {
                "word": "television",
                "pos": "noun"
            },
            {
                "word": "television licence",
                "pos": "noun"
            },
            {
                "word": "televisual",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of electrical equipment with a screen on which you can watch programmes with moving pictures and sounds",
                    "vi": "một thiết bị điện có màn hình mà bạn có thể xem các chương trình có hình ảnh và âm thanh chuyển động"
                },
                "examples": [
                    {
                        "en": "a widescreen/flat-screen/plasma television",
                        "vi": "màn hình rộng / màn hình phẳng / tivi plasma"
                    },
                    {
                        "en": "to turn the television on/off",
                        "vi": "bật / tắt tivi"
                    },
                    {
                        "en": "The series first appeared on television screens in 2017.",
                        "vi": "Bộ phim lần đầu tiên xuất hiện trên màn ảnh truyền hình vào năm 2017."
                    }
                ]
            },
            {
                "define": {
                    "en": "the programmes broadcast on television",
                    "vi": "các chương trình phát sóng trên truyền hình"
                },
                "examples": [
                    {
                        "en": "We don't do much in the evenings except watch television.",
                        "vi": "Chúng tôi không làm gì nhiều vào buổi tối ngoại trừ xem tivi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the system, process or business of broadcasting television programmes",
                    "vi": "hệ thống, quy trình hoặc kinh doanh phát sóng các chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "satellite/terrestrial/digital/network television",
                        "vi": "truyền hình vệ tinh / mặt đất / kỹ thuật số / mạng"
                    },
                    {
                        "en": "These plays were originally broadcast on live television.",
                        "vi": "Những vở kịch này ban đầu được phát sóng trên truyền hình trực tiếp."
                    },
                    {
                        "en": "in television I'd like to work in television (= for a television company).",
                        "vi": "trong truyền hình Tôi muốn làm việc trong lĩnh vực truyền hình (= cho một công ty truyền hình)."
                    },
                    {
                        "en": "a television show/series/programme/broadcast",
                        "vi": "một chương trình truyền hình / loạt phim / chương trình / chương trình phát sóng"
                    },
                    {
                        "en": "a television drama/documentary/interview/commercial",
                        "vi": "một bộ phim truyền hình / phim tài liệu / phỏng vấn / thương mại"
                    },
                    {
                        "en": "a television company/presenter/station/channel",
                        "vi": "một công ty truyền hình / người dẫn chương trình / đài / kênh"
                    },
                    {
                        "en": "a television viewer/audience",
                        "vi": "một người xem / khán giả truyền hình"
                    },
                    {
                        "en": "a television ad/commercial",
                        "vi": "một quảng cáo / quảng cáo truyền hình"
                    },
                    {
                        "en": "the television news",
                        "vi": "tin tức truyền hình"
                    }
                ]
            },
            {
                "define": {
                    "en": "being broadcast by television; appearing in a television programme",
                    "vi": "được truyền hình; xuất hiện trong một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "What's on television tonight?",
                        "vi": "Có gì trên truyền hình tối nay?"
                    },
                    {
                        "en": "Is there anything good on the telly tonight?",
                        "vi": "Có điều gì tốt trên điện thoại tối nay?"
                    },
                    {
                        "en": "It was on TV yesterday.",
                        "vi": "Đó là trên TV ngày hôm qua."
                    },
                    {
                        "en": "Millions watched the events on live television.",
                        "vi": "Hàng triệu người đã xem các sự kiện trên truyền hình trực tiếp."
                    },
                    {
                        "en": "The film has never been shown on television.",
                        "vi": "Phim chưa từng được chiếu trên truyền hình."
                    },
                    {
                        "en": "I recognize you. Aren't you on television?",
                        "vi": "Tôi nhận ra bạn. Bạn không có trên truyền hình?"
                    },
                    {
                        "en": "She's always appearing on television.",
                        "vi": "Cô ấy luôn xuất hiện trên truyền hình."
                    }
                ]
            }
        ]
    },
    {
        "id": "173ccfeadc784e9e8478d5530a7716c4",
        "word": "toilet",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtɔɪlət/",
            "us": "/ˈtɔɪlət/"
        },
        "nearby": [
            {
                "word": "toil",
                "pos": "noun"
            },
            {
                "word": "toiler",
                "pos": "noun"
            },
            {
                "word": "toilet",
                "pos": "noun"
            },
            {
                "word": "toilet bag",
                "pos": "noun"
            },
            {
                "word": "toilet paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large bowl attached to a pipe that you sit on or stand over when you get rid of waste matter from your body",
                    "vi": "một cái bát lớn gắn vào đường ống mà bạn ngồi hoặc đứng lên khi thải chất thải ra khỏi cơ thể"
                },
                "examples": [
                    {
                        "en": "Have you flushed the toilet?",
                        "vi": "Bạn đã xả bồn cầu chưa?"
                    },
                    {
                        "en": "(British English) I need to go to the toilet (= use the toilet).",
                        "vi": "(Anh Anh) Tôi cần đi vệ sinh (= dùng nhà vệ sinh)."
                    },
                    {
                        "en": "a toilet seat",
                        "vi": "bệ xí"
                    },
                    {
                        "en": "the toilet bowl",
                        "vi": "bồn cầu"
                    },
                    {
                        "en": "toilet facilities",
                        "vi": "thiết bị vệ sinh"
                    },
                    {
                        "en": "Do you need the toilet?",
                        "vi": "Bạn có cần nhà vệ sinh?"
                    },
                    {
                        "en": "The girl asked if she could use the toilet.",
                        "vi": "Cô gái hỏi liệu cô có thể sử dụng nhà vệ sinh không."
                    },
                    {
                        "en": "The hotels usually have modern showers and toilets.",
                        "vi": "Các khách sạn thường có vòi hoa sen và nhà vệ sinh hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room containing a toilet",
                    "vi": "một căn phòng có một nhà vệ sinh"
                },
                "examples": [
                    {
                        "en": "Every flat has its own bathroom and toilet.",
                        "vi": "Mỗi căn hộ đều có phòng tắm và nhà vệ sinh riêng."
                    },
                    {
                        "en": "Who's in the toilet?",
                        "vi": "Ai đang ở trong nhà vệ sinh?"
                    },
                    {
                        "en": "There was a communal toilet on the landing for the four flats.",
                        "vi": "Có một nhà vệ sinh chung trên chiếu nghỉ cho bốn căn hộ."
                    },
                    {
                        "en": "There is a separate downstairs toilet.",
                        "vi": "Có toilet riêng ở tầng dưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room or small building containing several toilets, each in a separate smaller room",
                    "vi": "một căn phòng hoặc một tòa nhà nhỏ có một số nhà vệ sinh, mỗi nhà vệ sinh trong một căn phòng nhỏ hơn riêng biệt"
                },
                "examples": [
                    {
                        "en": "public toilets",
                        "vi": "nhà vệ sinh công cộng"
                    },
                    {
                        "en": "toilet facilities",
                        "vi": "thiết bị vệ sinh"
                    },
                    {
                        "en": "Could you tell me where the ladies' toilet is, please?",
                        "vi": "Bạn có thể cho tôi biết nhà vệ sinh nữ ở đâu được không?"
                    },
                    {
                        "en": "The toilets are located in the entrance area.",
                        "vi": "Nhà vệ sinh được bố trí ở khu vực lối vào."
                    },
                    {
                        "en": "a disabled toilet (= for disabled people)",
                        "vi": "nhà vệ sinh dành cho người khuyết tật (= dành cho người khuyết tật)"
                    },
                    {
                        "en": "His new duties included cleaning the toilets.",
                        "vi": "Nhiệm vụ mới của anh ấy bao gồm dọn dẹp nhà vệ sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of washing and dressing yourself, arranging your hair, etc.",
                    "vi": "quá trình tự tắm rửa và thay quần áo, sắp xếp đầu tóc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9169a864e114e7f809396923d8507b5",
        "word": "bin",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bɪn/",
            "us": "/bɪn/"
        },
        "nearby": [
            {
                "word": "bimetallic strip",
                "pos": "noun"
            },
            {
                "word": "bimonthly",
                "pos": "adjective, adverb"
            },
            {
                "word": "bin",
                "pos": "noun"
            },
            {
                "word": "bin",
                "pos": "verb"
            },
            {
                "word": "binary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container that you put waste in",
                    "vi": "một thùng chứa mà bạn bỏ chất thải vào"
                },
                "examples": [
                    {
                        "en": "a rubbish bin",
                        "vi": "cái thùng đựng rác"
                    },
                    {
                        "en": "Grey bins will be emptied weekly.",
                        "vi": "Các thùng màu xám sẽ được làm trống hàng tuần."
                    },
                    {
                        "en": "Many councils now have fortnightly bin collections.",
                        "vi": "Nhiều hội đồng hiện có các bộ sưu tập thùng rác hai tuần một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large container, usually with a lid (= cover), for storing things in",
                    "vi": "một hộp đựng lớn, thường có nắp (= cover), để đựng những thứ trong"
                },
                "examples": [
                    {
                        "en": "a bread bin",
                        "vi": "một thùng bánh mì"
                    },
                    {
                        "en": "All their toys are kept in plastic storage bins under the bed.",
                        "vi": "Tất cả đồ chơi của chúng đều được đựng trong các thùng nhựa đựng đồ dưới gầm giường."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3b578ad0fc740bfb397227bdca49bd6",
        "word": "cooker",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkʊkə(r)/",
            "us": "/ˈkʊkər/"
        },
        "nearby": [
            {
                "word": "Alistair Cooke",
                "pos": ""
            },
            {
                "word": "Sam Cooke",
                "pos": ""
            },
            {
                "word": "cooker",
                "pos": "noun"
            },
            {
                "word": "cookery",
                "pos": "noun"
            },
            {
                "word": "cookery book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of equipment for cooking food, containing an oven and gas or electric rings on top",
                    "vi": "một phần lớn của thiết bị để nấu thức ăn, có chứa một lò nướng và các vòng điện hoặc gas ở phía trên"
                },
                "examples": [
                    {
                        "en": "a gas cooker",
                        "vi": "bếp ga"
                    },
                    {
                        "en": "an electric cooker",
                        "vi": "nồi cơm điện"
                    },
                    {
                        "en": "on a cooker She set the house on fire by leaving a chip pan on the cooker.",
                        "vi": "trên một cái bếp. Cô ấy đốt cháy ngôi nhà bằng cách để một cái chảo chip trên nồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "8780c51fbed64858a21421d443996d15",
        "word": "dishwasher",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈdɪʃwɒʃə(r)/",
            "us": "/ˈdɪʃwɔːʃər/"
        },
        "nearby": [
            {
                "word": "dish up",
                "pos": "phrasal verb"
            },
            {
                "word": "dishware",
                "pos": "noun"
            },
            {
                "word": "dishwasher",
                "pos": "noun"
            },
            {
                "word": "dishwashing detergent",
                "pos": "noun"
            },
            {
                "word": "dishwashing liquid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine for washing plates, cups, etc.",
                    "vi": "máy rửa đĩa, cốc, v.v."
                },
                "examples": [
                    {
                        "en": "to load/stack the dishwasher",
                        "vi": "để tải / xếp máy rửa bát"
                    },
                    {
                        "en": "Are these glasses dishwasher safe?",
                        "vi": "Máy rửa chén bằng kính này có an toàn không?"
                    },
                    {
                        "en": "It wastes energy to run the dishwasher half empty.",
                        "vi": "Thật lãng phí năng lượng để chạy một nửa máy rửa bát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to wash plates, etc., for example in a restaurant",
                    "vi": "một người có công việc rửa đĩa, v.v., chẳng hạn như trong nhà hàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca98ee11e28347a58d99e57e7e981322",
        "word": "equipment",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪˈkwɪpmənt/",
            "us": "/ɪˈkwɪpmənt/"
        },
        "nearby": [
            {
                "word": "equinox",
                "pos": "noun"
            },
            {
                "word": "equip",
                "pos": "verb"
            },
            {
                "word": "equipment",
                "pos": "noun"
            },
            {
                "word": "equipoise",
                "pos": "noun"
            },
            {
                "word": "equitable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the things that are needed for a particular purpose or activity",
                    "vi": "những thứ cần thiết cho một mục đích hoặc hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "a useful piece of equipment for the kitchen",
                        "vi": "một phần thiết bị hữu ích cho nhà bếp"
                    },
                    {
                        "en": "Take care when using old electrical equipment.",
                        "vi": "Cẩn thận khi sử dụng các thiết bị điện cũ."
                    },
                    {
                        "en": "electronic/communications/computer equipment",
                        "vi": "thiết bị điện tử / truyền thông / máy tính"
                    },
                    {
                        "en": "military equipment and supplies",
                        "vi": "thiết bị quân sự và vật tư"
                    },
                    {
                        "en": "office equipment",
                        "vi": "thiết bị văn phòng"
                    },
                    {
                        "en": "They have installed state-of-the-art medical equipment to help improve early diagnosis of the condition.",
                        "vi": "Họ đã lắp đặt các thiết bị y tế hiện đại để giúp cải thiện chẩn đoán sớm tình trạng bệnh."
                    },
                    {
                        "en": "Everyone should bring the necessary equipment for camping in the mountains.",
                        "vi": "Mọi người nên mang theo những dụng cụ cần thiết cho việc cắm trại trên núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of providing a place or person with necessary things",
                    "vi": "quá trình cung cấp một địa điểm hoặc một người những thứ cần thiết"
                },
                "examples": [
                    {
                        "en": "The equipment of the photographic studio was expensive.",
                        "vi": "Trang thiết bị của studio chụp ảnh rất đắt tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "3d762baf4a8b4d818c852bdb26bd0262",
        "word": "fridge",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/frɪdʒ/",
            "us": "/frɪdʒ/"
        },
        "nearby": [
            {
                "word": "friction tape",
                "pos": "noun"
            },
            {
                "word": "Friday",
                "pos": "noun"
            },
            {
                "word": "fridge",
                "pos": "noun"
            },
            {
                "word": "fridge-freezer",
                "pos": "noun"
            },
            {
                "word": "fried",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of electrical equipment in which food is kept cold so that it stays fresh",
                    "vi": "một phần của thiết bị điện trong đó thực phẩm được giữ lạnh để chúng luôn tươi"
                },
                "examples": [
                    {
                        "en": "The kids tend to raid the fridge when they get home from school.",
                        "vi": "Bọn trẻ có xu hướng đột kích tủ lạnh khi chúng đi học về."
                    },
                    {
                        "en": "in the fridge There's no food in the fridge!",
                        "vi": "trong tủ lạnh Không có thức ăn trong tủ lạnh!"
                    }
                ]
            }
        ]
    },
    {
        "id": "f538bc7621494901a7a708e3ccbce29f",
        "word": "lock",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/lɒk/",
            "us": "/lɑːk/"
        },
        "nearby": [
            {
                "word": "loci",
                "pos": "noun"
            },
            {
                "word": "lock",
                "pos": "verb"
            },
            {
                "word": "lock",
                "pos": "noun"
            },
            {
                "word": "lockable",
                "pos": "adjective"
            },
            {
                "word": "lock away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that keeps a door, window, box, etc. shut, usually needing a key to open it",
                    "vi": "một thiết bị đóng cửa, cửa sổ, hộp, v.v., thường cần chìa khóa để mở"
                },
                "examples": [
                    {
                        "en": "She turned the key in the lock.",
                        "vi": "Cô vặn chìa khóa vào ổ khóa."
                    },
                    {
                        "en": "It's a good idea to have locks fitted on all your windows.",
                        "vi": "Bạn nên lắp ổ khóa trên tất cả các cửa sổ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that prevents a vehicle, machine or piece of equipment from being used",
                    "vi": "thiết bị ngăn phương tiện, máy móc hoặc thiết bị được sử dụng"
                },
                "examples": [
                    {
                        "en": "a bicycle lock",
                        "vi": "khóa xe đạp"
                    },
                    {
                        "en": "a steering lock",
                        "vi": "một khóa lái"
                    },
                    {
                        "en": "safety locks for handguns",
                        "vi": "khóa an toàn cho súng ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a feature on a computer or mobile phone that prevents somebody from accessing it without a code",
                    "vi": "một tính năng trên máy tính hoặc điện thoại di động ngăn ai đó truy cập vào nó mà không có mã"
                },
                "examples": [
                    {
                        "en": "There's a security lock on the phone.",
                        "vi": "Có một khóa bảo mật trên điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state in which the parts of a machine, etc. do not move",
                    "vi": "trạng thái mà các bộ phận của máy, v.v. không chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the amount that the front wheels can be turned in one direction or the other in order to turn the vehicle",
                    "vi": "số lượng bánh trước có thể quay theo hướng này hay hướng khác để quay đầu xe"
                },
                "examples": [
                    {
                        "en": "I had the steering wheel on full lock (= I had turned it as far as it would turn).",
                        "vi": "Tôi đã khóa tay lái hoàn toàn (= Tôi đã bẻ lái hết cỡ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of canal or river with a gate at either end, in which the water level can be changed so that boats can move from one level of the canal or river to another",
                    "vi": "một đoạn kênh hoặc sông có cửa ở hai đầu, mực nước có thể thay đổi để tàu thuyền có thể di chuyển từ kênh, sông này sang mực nước khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a few hairs that hang or lie together on your head",
                    "vi": "một vài sợi tóc buông thõng hoặc nằm lại với nhau trên đầu của bạn"
                },
                "examples": [
                    {
                        "en": "John brushed a lock of hair from his eyes.",
                        "vi": "John vuốt một lọn tóc trên mắt."
                    },
                    {
                        "en": "She kept a lock of her mother’s hair.",
                        "vi": "Cô ấy giữ một lọn tóc của mẹ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s hair",
                    "vi": "tóc của một người"
                },
                "examples": [
                    {
                        "en": "She shook her long, flowing locks.",
                        "vi": "Cô lắc những lọn tóc dài đang chảy của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a player in the second row of the scrum",
                    "vi": "một người chơi ở hàng thứ hai của trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "total control of something",
                    "vi": "kiểm soát hoàn toàn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "One company had a virtual lock on all orange juice sales in the state.",
                        "vi": "Một công ty đã khóa ảo tất cả doanh số bán nước cam trong tiểu bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "including everything",
                    "vi": "bao gồm tất cả mọi thứ"
                },
                "examples": [
                    {
                        "en": "He sold the business lock, stock and barrel.",
                        "vi": "Anh ta đã bán khóa kinh doanh, cổ phiếu và thùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "locked up safely somewhere; in prison",
                    "vi": "bị nhốt an toàn ở một nơi nào đó; trong nhà tù"
                },
                "examples": [
                    {
                        "en": "We keep our valuables under lock and key.",
                        "vi": "Chúng tôi giữ các vật có giá trị của chúng tôi trong khóa và chìa khóa."
                    },
                    {
                        "en": "I will not rest until the murderer is under lock and key.",
                        "vi": "Tôi sẽ không nghỉ ngơi cho đến khi kẻ sát nhân bị khóa và chìa khóa."
                    },
                    {
                        "en": "Prisoners are kept under lock and key 24 hours a day.",
                        "vi": "Các tù nhân được giữ trong khóa và chìa khóa 24 giờ một ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "82d356e3f3404a1bb95f73f0045e4377",
        "word": "washing machine",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈwɒʃɪŋ məʃiːn/",
            "us": "/ˈwɑːʃɪŋ məʃiːn/"
        },
        "nearby": [
            {
                "word": "washing day",
                "pos": "noun"
            },
            {
                "word": "washing line",
                "pos": "noun"
            },
            {
                "word": "washing machine",
                "pos": "noun"
            },
            {
                "word": "washing powder",
                "pos": "noun"
            },
            {
                "word": "washing soda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electric machine for washing clothes",
                    "vi": "máy giặt điện"
                },
                "examples": [
                    {
                        "en": "How often do you run your washing machine?",
                        "vi": "Bạn thường chạy máy giặt của mình như thế nào?"
                    },
                    {
                        "en": "I ran a load of laundry through the washing machine.",
                        "vi": "Tôi chạy một đống đồ qua máy giặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "469b1a7398bb480984a9b419fecd322d",
        "word": "alarm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈlɑːm/",
            "us": "/əˈlɑːrm/"
        },
        "nearby": [
            {
                "word": "à la mode",
                "pos": "adjective, adverb"
            },
            {
                "word": "Alan",
                "pos": ""
            },
            {
                "word": "alarm",
                "pos": "noun"
            },
            {
                "word": "alarm",
                "pos": "verb"
            },
            {
                "word": "alarm call",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loud noise or a signal that warns people of danger or of a problem",
                    "vi": "một tiếng ồn lớn hoặc một tín hiệu cảnh báo mọi người đang gặp nguy hiểm hoặc sự cố"
                },
                "examples": [
                    {
                        "en": "She decided to sound the alarm (= warn people that the situation was dangerous).",
                        "vi": "Cô ấy quyết định phát ra âm thanh báo động (= cảnh báo mọi người rằng tình hình rất nguy hiểm)."
                    },
                    {
                        "en": "I hammered on all the doors to raise the alarm.",
                        "vi": "Tôi đập vào tất cả các cửa để báo động."
                    },
                    {
                        "en": "By the time the alarm was raised the intruders had escaped.",
                        "vi": "Vào thời điểm báo động được nâng lên, những kẻ đột nhập đã trốn thoát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that warns people of a particular danger, or that a particular person is in danger",
                    "vi": "một thiết bị cảnh báo mọi người về một mối nguy hiểm cụ thể hoặc một người cụ thể đang gặp nguy hiểm"
                },
                "examples": [
                    {
                        "en": "a burglar/fire/smoke alarm",
                        "vi": "báo trộm / báo cháy / báo khói"
                    },
                    {
                        "en": "The cat set off the alarm (= made it start ringing).",
                        "vi": "Con mèo đã tắt chuông báo thức (= làm cho nó bắt đầu đổ chuông)."
                    },
                    {
                        "en": "A car alarm went off in the middle of the night (= started ringing).",
                        "vi": "Một chiếc báo động ô tô kêu vào lúc nửa đêm (= bắt đầu đổ chuông)."
                    },
                    {
                        "en": "Carry a personal alarm with you.",
                        "vi": "Mang theo một báo động cá nhân với bạn."
                    },
                    {
                        "en": "Install an alarm system and learn how to use it.",
                        "vi": "Cài đặt hệ thống báo động và học cách sử dụng nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ringing sound or a tune played by a clock or your phone after you have set it to play at a particular time to wake you up",
                    "vi": "âm thanh đổ chuông hoặc một giai điệu được phát bởi đồng hồ hoặc điện thoại của bạn sau khi bạn đã cài đặt để phát vào một thời điểm cụ thể để đánh thức bạn"
                },
                "examples": [
                    {
                        "en": "The alarm went off at 7 o'clock.",
                        "vi": "Chuông báo thức kêu lúc 7 giờ."
                    },
                    {
                        "en": "I set my alarm for 6.30.",
                        "vi": "Tôi đặt báo thức lúc 6 giờ 30."
                    }
                ]
            },
            {
                "define": {
                    "en": "fear and worry that somebody feels when something dangerous or unpleasant might happen",
                    "vi": "sợ hãi và lo lắng rằng ai đó cảm thấy khi điều gì đó nguy hiểm hoặc khó chịu có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "in alarm What have you done?’ Ellie cried in alarm.",
                        "vi": "trong báo động Bạn đã làm gì? ' Ellie kêu lên trong cảnh báo."
                    },
                    {
                        "en": "I felt a growing sense of alarm when he did not return that night.",
                        "vi": "Tôi cảm thấy lo lắng ngày càng tăng khi anh ấy không trở về vào đêm hôm đó."
                    },
                    {
                        "en": "The doctor said there was no cause for alarm.",
                        "vi": "Bác sĩ nói không có nguyên nhân nào đáng báo động."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you say that alarm bells are ringing, you mean that people are starting to feel worried and to suspect that something is wrong",
                    "vi": "nếu bạn nói rằng chuông báo thức đang reo, bạn có nghĩa là mọi người bắt đầu cảm thấy lo lắng và nghi ngờ rằng có điều gì đó không ổn"
                },
                "examples": [
                    {
                        "en": "The government’s proposal has set alarm bells ringing for people on low incomes.",
                        "vi": "Đề xuất của chính phủ đã gióng lên hồi chuông cảnh báo đối với những người có thu nhập thấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7677b0810fd49e292a7a13186240a06",
        "word": "burglar alarm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbɜːɡlər əlɑːm/",
            "us": "/ˈbɜːrɡlər əlɑːrm/"
        },
        "nearby": [
            {
                "word": "Burghley House",
                "pos": ""
            },
            {
                "word": "burglar",
                "pos": "noun"
            },
            {
                "word": "burglar alarm",
                "pos": "noun"
            },
            {
                "word": "burglary",
                "pos": "noun"
            },
            {
                "word": "burgle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic device, often fixed to a wall, that rings a loud bell if somebody tries to enter a building by force",
                    "vi": "một thiết bị điện tử, thường được cố định vào tường, rung chuông lớn nếu ai đó cố gắng dùng vũ lực để vào một tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "538085c761cb47b6ad3958f367eb0fca",
        "word": "fire alarm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfaɪər əlɑːm/",
            "us": "/ˈfaɪər əlɑːrm/"
        },
        "nearby": [
            {
                "word": "fire",
                "pos": "noun"
            },
            {
                "word": "fire",
                "pos": "verb"
            },
            {
                "word": "fire alarm",
                "pos": "noun"
            },
            {
                "word": "fire ant",
                "pos": "noun"
            },
            {
                "word": "firearm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bell or other device that gives people warning of a fire in a building",
                    "vi": "chuông hoặc thiết bị khác giúp mọi người cảnh báo về đám cháy trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "Who set off the fire alarm?",
                        "vi": "Ai đã đặt chuông báo cháy?"
                    },
                    {
                        "en": "It was thought that the fire alarm had been set off as a prank.",
                        "vi": "Người ta cho rằng chuông báo cháy đã được đặt ra như một trò chơi khăm."
                    },
                    {
                        "en": "The fire alarm went off when I was making a coffee.",
                        "vi": "Chuông báo cháy kêu khi tôi đang pha cà phê."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a fire alarm goes off",
                    "vi": "một dịp khi chuông báo cháy vang lên"
                },
                "examples": [
                    {
                        "en": "We had a fire alarm at work this morning.",
                        "vi": "Chúng tôi đã có một chuông báo cháy tại nơi làm việc sáng nay."
                    }
                ]
            }
        ]
    },
    {
        "id": "4fb9da7b98da4e52a28423809fecfb58",
        "word": "freezer",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfriːzə(r)/",
            "us": "/ˈfriːzər/"
        },
        "nearby": [
            {
                "word": "freeze out",
                "pos": "phrasal verb"
            },
            {
                "word": "freeze over",
                "pos": "phrasal verb"
            },
            {
                "word": "freezer",
                "pos": "noun"
            },
            {
                "word": "freezing",
                "pos": "adjective"
            },
            {
                "word": "freezing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of electrical equipment in which you can store food for a long time at a low temperature so that it stays frozen",
                    "vi": "một thiết bị điện lớn mà bạn có thể bảo quản thực phẩm trong thời gian dài ở nhiệt độ thấp để chúng luôn đông lạnh"
                },
                "examples": [
                    {
                        "en": "Your freezer contents can be insured against loss.",
                        "vi": "Nội dung trong tủ đông của bạn có thể được bảo hiểm để tránh mất mát."
                    },
                    {
                        "en": "They bought all their frozen food from the same freezer centre.",
                        "vi": "Họ mua tất cả thực phẩm đông lạnh của họ từ cùng một trung tâm tủ đông."
                    },
                    {
                        "en": "the products in your supermarket's freezer cabinet/​case",
                        "vi": "các sản phẩm trong tủ đông / tủ đông siêu thị của bạn"
                    }
                ]
            }
        ]
    },
    {
        "id": "6625ff7f0f15443da481dbb7259b8e59",
        "word": "gadget",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡædʒɪt/",
            "us": "/ˈɡædʒɪt/"
        },
        "nearby": [
            {
                "word": "gad around",
                "pos": "phrasal verb"
            },
            {
                "word": "gadfly",
                "pos": "noun"
            },
            {
                "word": "gadget",
                "pos": "noun"
            },
            {
                "word": "gadgetry",
                "pos": "noun"
            },
            {
                "word": "gadolinium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small tool or device that does something useful",
                    "vi": "một công cụ hoặc thiết bị nhỏ làm điều gì đó hữu ích"
                },
                "examples": [
                    {
                        "en": "We live in a world filled with high-tech gadgets.",
                        "vi": "Chúng ta đang sống trong một thế giới tràn ngập các tiện ích công nghệ cao."
                    },
                    {
                        "en": "She has invented a nifty little gadget for undoing stubborn nuts and bolts.",
                        "vi": "Cô ấy đã phát minh ra một thiết bị nhỏ tiện lợi để hoàn tác các đai ốc và bu lông cứng đầu."
                    },
                    {
                        "en": "kids that hassle their parents to buy the latest electronic gadget",
                        "vi": "những đứa trẻ làm phiền bố mẹ chúng để mua thiết bị điện tử mới nhất"
                    },
                    {
                        "en": "Modern gadgets like these make a huge difference to home life.",
                        "vi": "Những tiện ích hiện đại như thế này tạo nên sự khác biệt rất lớn cho cuộc sống gia đình."
                    }
                ]
            }
        ]
    },
    {
        "id": "54d5ee84055b405fa659537926b9e4dd",
        "word": "heater",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhiːtə(r)/",
            "us": "/ˈhiːtər/"
        },
        "nearby": [
            {
                "word": "heated",
                "pos": "adjective"
            },
            {
                "word": "heatedly",
                "pos": "adverb"
            },
            {
                "word": "heater",
                "pos": "noun"
            },
            {
                "word": "heat exchanger",
                "pos": "noun"
            },
            {
                "word": "heat exhaustion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine used for making air or water warmer",
                    "vi": "một máy được sử dụng để làm cho không khí hoặc nước ấm hơn"
                },
                "examples": [
                    {
                        "en": "a gas heater",
                        "vi": "lò sưởi gas"
                    },
                    {
                        "en": "a water heater",
                        "vi": "máy nước nóng"
                    }
                ]
            }
        ]
    },
    {
        "id": "8a819dd45978464a9dbd95281a74f547",
        "word": "heating",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhiːtɪŋ/",
            "us": "/ˈhiːtɪŋ/"
        },
        "nearby": [
            {
                "word": "Heathrow",
                "pos": ""
            },
            {
                "word": "heat index",
                "pos": "noun"
            },
            {
                "word": "heating",
                "pos": "noun"
            },
            {
                "word": "heat lightning",
                "pos": "noun"
            },
            {
                "word": "heat map",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of supplying heat to a room or building; a system used to do this",
                    "vi": "quá trình cung cấp nhiệt cho một căn phòng hoặc tòa nhà; một hệ thống được sử dụng để làm điều này"
                },
                "examples": [
                    {
                        "en": "to put/turn the heating on",
                        "vi": "để đặt / bật hệ thống sưởi"
                    },
                    {
                        "en": "Who turned the heating off?",
                        "vi": "Ai đã tắt máy sưởi?"
                    },
                    {
                        "en": "What type of heating do you have?",
                        "vi": "Bạn có loại sưởi ấm nào?"
                    },
                    {
                        "en": "underfloor heating",
                        "vi": "hệ thống sưởi ấm dưới sàn"
                    },
                    {
                        "en": "a solar/gas-fired heating system",
                        "vi": "một hệ thống sưởi ấm bằng năng lượng mặt trời / khí đốt"
                    },
                    {
                        "en": "heating bills/costs",
                        "vi": "hóa đơn / chi phí sưởi ấm"
                    },
                    {
                        "en": "heating oil",
                        "vi": "dầu nóng"
                    }
                ]
            }
        ]
    },
    {
        "id": "14dad5be2b0f4708b651d0995ea75ae6",
        "word": "refrigerator",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈfrɪdʒəreɪtə(r)/",
            "us": "/rɪˈfrɪdʒəreɪtər/"
        },
        "nearby": [
            {
                "word": "refrigerate",
                "pos": "verb"
            },
            {
                "word": "refrigeration",
                "pos": "noun"
            },
            {
                "word": "refrigerator",
                "pos": "noun"
            },
            {
                "word": "refuel",
                "pos": "verb"
            },
            {
                "word": "refuge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of electrical equipment in which food is kept cold so that it stays fresh",
                    "vi": "một phần của thiết bị điện trong đó thực phẩm được giữ lạnh để chúng luôn tươi"
                },
                "examples": [
                    {
                        "en": "This dessert can be served straight from the refrigerator.",
                        "vi": "Món tráng miệng này có thể được phục vụ ngay từ tủ lạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c97a583e98c3484eaea95903c945b145",
        "word": "sink",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/sɪŋk/",
            "us": "/sɪŋk/"
        },
        "nearby": [
            {
                "word": "sinister",
                "pos": "adjective"
            },
            {
                "word": "sink",
                "pos": "verb"
            },
            {
                "word": "sink",
                "pos": "noun"
            },
            {
                "word": "sink",
                "pos": "adjective"
            },
            {
                "word": "sinker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large open container in a kitchen that has taps to supply water and that you use for washing dishes in",
                    "vi": "một thùng chứa mở lớn trong nhà bếp có vòi để cấp nước và bạn dùng để rửa bát"
                },
                "examples": [
                    {
                        "en": "Don't just leave your dirty plates in the sink!",
                        "vi": "Đừng chỉ để những chiếc đĩa bẩn của bạn trong bồn rửa!"
                    },
                    {
                        "en": "I felt chained to the kitchen sink (= I had to spend all my time doing jobs in the house).",
                        "vi": "Tôi cảm thấy bị xích vào bồn rửa bát (= Tôi phải dành toàn bộ thời gian để làm các công việc trong nhà)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large bowl that has taps and is fixed to the wall in a bathroom, used for washing your hands and face in",
                    "vi": "một chiếc bát lớn có vòi và được gắn cố định vào tường trong phòng tắm, dùng để rửa tay và rửa mặt trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very large number of things, probably more than is necessary",
                    "vi": "rất nhiều thứ, có lẽ nhiều hơn mức cần thiết"
                },
                "examples": [
                    {
                        "en": "We seem to take everything but the kitchen sink when we go camping.",
                        "vi": "Chúng tôi dường như lấy tất cả mọi thứ trừ bồn rửa trong bếp khi chúng tôi đi cắm trại."
                    }
                ]
            }
        ]
    },
    {
        "id": "71e1cfb7ad3943979c30e53e6fdb723d",
        "word": "solar panel",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌsəʊlə ˈpænl/",
            "us": "/ˌsəʊlər ˈpænl/"
        },
        "nearby": [
            {
                "word": "solar flare",
                "pos": "noun"
            },
            {
                "word": "solarium",
                "pos": "noun"
            },
            {
                "word": "solar panel",
                "pos": "noun"
            },
            {
                "word": "solar plexus",
                "pos": "noun"
            },
            {
                "word": "solar power",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment, often on the roof of a building, that uses light and heat energy from the sun to produce hot water and electricity",
                    "vi": "một thiết bị, thường trên mái của một tòa nhà, sử dụng năng lượng ánh sáng và nhiệt từ mặt trời để sản xuất nước nóng và điện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "305334e05ae74ffaa174c70ac5361b6e",
        "word": "air-conditioned",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeə kəndɪʃnd/",
            "us": "/ˈer kəndɪʃnd/"
        },
        "nearby": [
            {
                "word": "air chief marshal",
                "pos": "noun"
            },
            {
                "word": "air commodore",
                "pos": "noun"
            },
            {
                "word": "air-conditioned",
                "pos": "adjective"
            },
            {
                "word": "air conditioner",
                "pos": "noun"
            },
            {
                "word": "air conditioning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a system that cools and dries the air inside it",
                    "vi": "có một hệ thống làm mát và làm khô không khí bên trong nó"
                },
                "examples": [
                    {
                        "en": "air-conditioned offices",
                        "vi": "văn phòng máy lạnh"
                    },
                    {
                        "en": "The restaurant is fully air-conditioned.",
                        "vi": "Nhà hàng được lắp máy lạnh đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "225f941d216649b383c19f36a68817a0",
        "word": "air conditioning",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeə kəndɪʃənɪŋ/",
            "us": "/ˈer kəndɪʃənɪŋ/"
        },
        "nearby": [
            {
                "word": "air-conditioned",
                "pos": "adjective"
            },
            {
                "word": "air conditioner",
                "pos": "noun"
            },
            {
                "word": "air conditioning",
                "pos": "noun"
            },
            {
                "word": "air-cooled",
                "pos": "adjective"
            },
            {
                "word": "air cooler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that cools and dries the air in a building or car",
                    "vi": "một hệ thống làm mát và làm khô không khí trong một tòa nhà hoặc ô tô"
                },
                "examples": [
                    {
                        "en": "Is the air conditioning on?",
                        "vi": "Máy lạnh có bật không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb3a3a0d4aca458cad8a7d426cf6a399",
        "word": "central heating",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsentrəl ˈhiːtɪŋ/",
            "us": "/ˌsentrəl ˈhiːtɪŋ/"
        },
        "nearby": [
            {
                "word": "Central European Time",
                "pos": "noun"
            },
            {
                "word": "central government",
                "pos": "noun"
            },
            {
                "word": "central heating",
                "pos": "noun"
            },
            {
                "word": "the Central Intelligence Agency",
                "pos": "noun"
            },
            {
                "word": "centralism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for heating a building from one source that then sends the hot water or hot air around the building through pipes",
                    "vi": "hệ thống sưởi ấm tòa nhà từ một nguồn sau đó đưa nước nóng hoặc không khí nóng xung quanh tòa nhà qua các đường ống"
                },
                "examples": [
                    {
                        "en": "gas-fired central heating",
                        "vi": "sưởi ấm trung tâm bằng khí đốt"
                    }
                ]
            }
        ]
    },
    {
        "id": "813880d26aa3476ba82c43ef65487b63",
        "word": "dustbin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʌstbɪn/",
            "us": "/ˈdʌstbɪn/"
        },
        "nearby": [
            {
                "word": "dust",
                "pos": "verb"
            },
            {
                "word": "dustball",
                "pos": "noun"
            },
            {
                "word": "dustbin",
                "pos": "noun"
            },
            {
                "word": "dust bowl",
                "pos": "noun"
            },
            {
                "word": "dust bunny",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large container with a lid (= cover), used for putting rubbish in, usually kept outside the house",
                    "vi": "một thùng lớn có nắp (= nắp), dùng để bỏ rác vào, thường được giữ bên ngoài nhà"
                },
                "examples": [
                    {
                        "en": "How regularly are the dustbins emptied?",
                        "vi": "Các thùng rác được làm trống thường xuyên như thế nào?"
                    },
                    {
                        "en": "We put out the dustbins on a Wednesday morning before the van comes.",
                        "vi": "Chúng tôi đóng thùng rác vào sáng thứ Tư trước khi xe tải đến."
                    },
                    {
                        "en": "She chucked the mouldy potatoes in the dustbin.",
                        "vi": "Cô cho khoai tây mốc meo vào thùng rác."
                    },
                    {
                        "en": "These old shoes can go in the dustbin now.",
                        "vi": "Những đôi giày cũ này có thể bỏ vào thùng rác ngay bây giờ."
                    },
                    {
                        "en": "(figurative) The politicians who lost the elections will be consigned to the dustbin of history.",
                        "vi": "(nghĩa bóng) Những chính trị gia thua cuộc trong cuộc bầu cử sẽ bị đưa vào thùng rác lịch sử."
                    },
                    {
                        "en": "(figurative) The pollution in this country makes it the dustbin of Europe.",
                        "vi": "(nghĩa bóng) Tình trạng ô nhiễm ở đất nước này khiến nó trở thành thùng rác của châu Âu."
                    }
                ]
            }
        ]
    },
    {
        "id": "01aebbb7296c4605857fd26224ff77c8",
        "word": "ladder",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlædə(r)/",
            "us": "/ˈlædər/"
        },
        "nearby": [
            {
                "word": "lad",
                "pos": "noun"
            },
            {
                "word": "Ladbrokes",
                "pos": ""
            },
            {
                "word": "ladder",
                "pos": "noun"
            },
            {
                "word": "ladder",
                "pos": "verb"
            },
            {
                "word": "laddie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment for climbing up and down a wall, the side of a building, etc., consisting of two lengths of wood or metal that are joined together by steps or rungs",
                    "vi": "một phần của thiết bị để leo lên và xuống tường, mặt bên của tòa nhà, v.v., bao gồm hai chiều dài bằng gỗ hoặc kim loại được nối với nhau bằng các bậc thang hoặc bậc thang"
                },
                "examples": [
                    {
                        "en": "to climb up/fall off a ladder",
                        "vi": "trèo lên / rơi khỏi thang"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of stages by which you can make progress in your life or career",
                    "vi": "một loạt các giai đoạn mà bạn có thể đạt được tiến bộ trong cuộc sống hoặc sự nghiệp của mình"
                },
                "examples": [
                    {
                        "en": "to move up or down the social ladder",
                        "vi": "lên hoặc xuống bậc thang xã hội"
                    },
                    {
                        "en": "the career ladder",
                        "vi": "Các bậc thang nghề nghiệp"
                    },
                    {
                        "en": "(British English) to get onto the property ladder (= buy your first home)",
                        "vi": "(Tiếng Anh Anh) để lên bậc thang tài sản (= mua căn nhà đầu tiên của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, thin hole in tights or stockings where some threads have broken",
                    "vi": "một lỗ dài, mỏng trên quần tất hoặc tất chân, nơi một số sợi chỉ bị đứt"
                },
                "examples": [
                    {
                        "en": "I've got a ladder in my new tights.",
                        "vi": "Tôi có một cái thang trong chiếc quần tất mới của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition in a particular sport or game in which teams or players are arranged in a list and they can move up the list by defeating one of the teams or players above",
                    "vi": "một cuộc thi trong một môn thể thao hoặc trò chơi cụ thể trong đó các đội hoặc người chơi được sắp xếp trong một danh sách và họ có thể di chuyển lên danh sách bằng cách đánh bại một trong các đội hoặc người chơi ở trên"
                },
                "examples": [
                    {
                        "en": "He’s third on the tennis ladder at work.",
                        "vi": "Anh ấy đứng thứ ba trên thang tennis tại nơi làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "caae187d150342ba87756731add19f15",
        "word": "remote control",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˌməʊt kənˈtrəʊl/",
            "us": "/rɪˌməʊt kənˈtrəʊl/"
        },
        "nearby": [
            {
                "word": "remote",
                "pos": "noun"
            },
            {
                "word": "remote access",
                "pos": "noun"
            },
            {
                "word": "remote control",
                "pos": "noun"
            },
            {
                "word": "remote-controlled",
                "pos": "adjective"
            },
            {
                "word": "remote learning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to operate a machine from a distance using radio or electrical signals",
                    "vi": "khả năng vận hành máy từ xa bằng tín hiệu vô tuyến hoặc điện"
                },
                "examples": [
                    {
                        "en": "by remote control It works by remote control.",
                        "vi": "bằng điều khiển từ xa Nó hoạt động bằng điều khiển từ xa."
                    },
                    {
                        "en": "a remote-control camera",
                        "vi": "một máy ảnh điều khiển từ xa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that allows you to operate a television, etc. from a distance",
                    "vi": "một thiết bị cho phép bạn điều khiển TV, v.v. từ xa"
                },
                "examples": [
                    {
                        "en": "I can't find the remote control.",
                        "vi": "Tôi không thể tìm thấy điều khiển từ xa."
                    }
                ]
            }
        ]
    },
    {
        "id": "27627d1da8164acdbe0348228de15cd1",
        "word": "smoke alarm",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsməʊk əlɑːm/",
            "us": "/ˈsməʊk əlɑːrm/"
        },
        "nearby": [
            {
                "word": "smoke",
                "pos": "noun"
            },
            {
                "word": "smoke",
                "pos": "verb"
            },
            {
                "word": "smoke alarm",
                "pos": "noun"
            },
            {
                "word": "smoke bomb",
                "pos": "noun"
            },
            {
                "word": "smoked glass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that makes a loud noise if smoke is in the air to warn you of a fire",
                    "vi": "một thiết bị tạo ra tiếng ồn lớn nếu có khói trong không khí để cảnh báo bạn về hỏa hoạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "461034086cff4ef28114755370a9f797",
        "word": "stove",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/stəʊv/",
            "us": "/stəʊv/"
        },
        "nearby": [
            {
                "word": "stoutly",
                "pos": "adverb"
            },
            {
                "word": "stoutness",
                "pos": "noun"
            },
            {
                "word": "stove",
                "pos": "noun"
            },
            {
                "word": "stove",
                "pos": "verb"
            },
            {
                "word": "stoved",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment that can burn various fuels and is used for heating rooms",
                    "vi": "một thiết bị có thể đốt cháy nhiều loại nhiên liệu khác nhau và được sử dụng để sưởi ấm phòng"
                },
                "examples": [
                    {
                        "en": "a gas/wood-burning stove",
                        "vi": "bếp ga / đốt củi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large piece of equipment for cooking food, containing an oven and gas or electric rings on top",
                    "vi": "một phần lớn của thiết bị để nấu thức ăn, có chứa một lò nướng và các vòng điện hoặc gas ở phía trên"
                },
                "examples": [
                    {
                        "en": "She put a pan of water on the stove.",
                        "vi": "Cô bắc một chảo nước lên bếp."
                    },
                    {
                        "en": "Most people don't want to spend hours slaving over a hot stove (= cooking).",
                        "vi": "Hầu hết mọi người đều không muốn mất hàng giờ đồng hồ bên bếp lò nóng (= nấu ăn)."
                    }
                ]
            }
        ]
    },
    {
        "id": "b39ec1b1885d48a2bc59efd29b16d0e3",
        "word": "washbasin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwɒʃbeɪsn/",
            "us": "/ˈwɑːʃbeɪsn/"
        },
        "nearby": [
            {
                "word": "wash away",
                "pos": "phrasal verb"
            },
            {
                "word": "washbag",
                "pos": "noun"
            },
            {
                "word": "washbasin",
                "pos": "noun"
            },
            {
                "word": "washboard",
                "pos": "noun"
            },
            {
                "word": "washcloth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large bowl that has taps and is fixed to the wall in a bathroom, used for washing your hands and face in",
                    "vi": "một chiếc bát lớn có vòi và được gắn cố định vào tường trong phòng tắm, dùng để rửa tay và rửa mặt trong"
                },
                "examples": [
                    {
                        "en": "He washed his shirt in the washbasin.",
                        "vi": "Anh ấy giặt áo sơ mi của mình trong chậu rửa mặt."
                    },
                    {
                        "en": "She filled the washbasin with warm soapy water.",
                        "vi": "Cô đổ đầy nước xà phòng ấm vào bồn rửa mặt."
                    },
                    {
                        "en": "She was washing her hands at the washbasin.",
                        "vi": "Cô ấy đang rửa tay ở bồn rửa tay."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc9f434b29104e05ab36146efabf70e3",
        "word": "aerial",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈeəriəl/",
            "us": "/ˈeriəl/"
        },
        "nearby": [
            {
                "word": "aerate",
                "pos": "verb"
            },
            {
                "word": "aeration",
                "pos": "noun"
            },
            {
                "word": "aerial",
                "pos": "noun"
            },
            {
                "word": "aerial",
                "pos": "adjective"
            },
            {
                "word": "aerialist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment made of wire or long straight pieces of metal for receiving or sending radio and television signals",
                    "vi": "một phần thiết bị làm bằng dây hoặc mảnh kim loại dài thẳng để nhận hoặc gửi tín hiệu vô tuyến và truyền hình"
                },
                "examples": [
                    {
                        "en": "a forest of television aerials on the roofs",
                        "vi": "trên mái nhà của một rừng máy chiếu truyền hình"
                    }
                ]
            }
        ]
    },
    {
        "id": "918d708f4fa24b5d97e5a0902086bf18",
        "word": "antenna",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ænˈtenə/",
            "us": "/ænˈtenə/"
        },
        "nearby": [
            {
                "word": "antelope",
                "pos": "noun"
            },
            {
                "word": "antenatal",
                "pos": "adjective"
            },
            {
                "word": "antenna",
                "pos": "noun"
            },
            {
                "word": "antepenultimate",
                "pos": "adjective"
            },
            {
                "word": "anterior",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two long thin parts on the heads of some insects and some animals that live in shells, used to feel and touch things with",
                    "vi": "một trong hai phần dài mỏng trên đầu của một số côn trùng và một số động vật sống trong vỏ, được sử dụng để cảm nhận và chạm vào các vật bằng"
                },
                "examples": [
                    {
                        "en": "(figurative) The minister was praised for his acute political antennae (= ability to understand complicated political situations).",
                        "vi": "(nghĩa bóng) Bộ trưởng được khen ngợi vì có râu chính trị nhạy bén (= khả năng hiểu các tình huống chính trị phức tạp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment made of wire or long straight pieces of metal for receiving or sending radio and television signals",
                    "vi": "một phần thiết bị làm bằng dây hoặc mảnh kim loại dài thẳng để nhận hoặc gửi tín hiệu vô tuyến và truyền hình"
                },
                "examples": [
                    {
                        "en": "radio antennas",
                        "vi": "ăng-ten radio"
                    },
                    {
                        "en": "They installed a dish antenna on the roof.",
                        "vi": "Họ đã lắp đặt một ăng-ten đĩa trên mái nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "5fed14662a54441f824de8fe4c4c9c2c",
        "word": "blind",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/blaɪnd/",
            "us": "/blaɪnd/"
        },
        "nearby": [
            {
                "word": "blind",
                "pos": "adjective"
            },
            {
                "word": "blind",
                "pos": "verb"
            },
            {
                "word": "blind",
                "pos": "noun"
            },
            {
                "word": "blind",
                "pos": "adverb"
            },
            {
                "word": "blind alley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "material that covers a window, often consisting of a roll of cloth that is fixed at the top of the window and can be pulled up and down",
                    "vi": "vật liệu che cửa sổ, thường bao gồm một cuộn vải được cố định ở đầu cửa sổ và có thể kéo lên xuống"
                },
                "examples": [
                    {
                        "en": "She saw a figure through the blinds.",
                        "vi": "Cô nhìn thấy một bóng người qua tấm rèm."
                    },
                    {
                        "en": "Pull up the blinds and let some light in.",
                        "vi": "Kéo rèm lên và để một chút ánh sáng vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "something people say or do to hide the truth about something in order to trick other people",
                    "vi": "điều gì đó mọi người nói hoặc làm để che giấu sự thật về điều gì đó để lừa người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e8f023e24bcf426796e3905fde85e0a4",
        "word": "boiler",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɔɪlə(r)/",
            "us": "/ˈbɔɪlər/"
        },
        "nearby": [
            {
                "word": "boil down to",
                "pos": "phrasal verb"
            },
            {
                "word": "boiled sweet",
                "pos": "noun"
            },
            {
                "word": "boiler",
                "pos": "noun"
            },
            {
                "word": "boilermaker",
                "pos": "noun"
            },
            {
                "word": "boilerplate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container in which water is heated to provide hot water and heating in a building or to produce steam in an engine",
                    "vi": "một thùng chứa trong đó nước được đun nóng để cung cấp nước nóng và sưởi ấm trong một tòa nhà hoặc để tạo ra hơi nước trong động cơ"
                },
                "examples": [
                    {
                        "en": "a central heating boiler",
                        "vi": "một lò hơi sưởi ấm trung tâm"
                    },
                    {
                        "en": "a gas boiler",
                        "vi": "một nồi hơi"
                    },
                    {
                        "en": "a back boiler (= located behind a fire)",
                        "vi": "một nồi hơi phía sau (= nằm sau ngọn lửa)"
                    }
                ]
            }
        ]
    },
    {
        "id": "e032bd471bd940359c189ea333883778",
        "word": "deep freeze",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdiːp ˈfriːz/",
            "us": "/ˌdiːp ˈfriːz/"
        },
        "nearby": [
            {
                "word": "deep end",
                "pos": "noun"
            },
            {
                "word": "deepfake",
                "pos": "noun"
            },
            {
                "word": "deep freeze",
                "pos": "noun"
            },
            {
                "word": "deep-frozen",
                "pos": "adjective"
            },
            {
                "word": "deep-fry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of electrical equipment in which you can store food for a long time at a low temperature so that it stays frozen",
                    "vi": "một thiết bị điện lớn mà bạn có thể bảo quản thực phẩm trong thời gian dài ở nhiệt độ thấp để chúng luôn đông lạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "df5c76305cf7452689252cd2da4fca5c",
        "word": "fan",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fæn/",
            "us": "/fæn/"
        },
        "nearby": [
            {
                "word": "the Famous Five",
                "pos": ""
            },
            {
                "word": "famously",
                "pos": "adverb"
            },
            {
                "word": "fan",
                "pos": "noun"
            },
            {
                "word": "fan",
                "pos": "verb"
            },
            {
                "word": "fanatic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who admires somebody/something or enjoys watching or listening to somebody/something very much",
                    "vi": "một người ngưỡng mộ ai đó / điều gì đó hoặc thích xem hoặc lắng nghe ai đó / điều gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "sports/music fans",
                        "vi": "người hâm mộ thể thao / âm nhạc"
                    },
                    {
                        "en": "Movie fans will be familiar with his work already.",
                        "vi": "Những người hâm mộ điện ảnh sẽ quen thuộc với công việc của anh ấy rồi."
                    },
                    {
                        "en": "Crowds of football fans filled the streets.",
                        "vi": "Đông đảo người hâm mộ bóng đá tràn ra đường."
                    },
                    {
                        "en": "I like his films, but I wouldn't say I'm a diehard fan (= one who strongly admires somebody/something in all circumstances).",
                        "vi": "Tôi thích phim của anh ấy, nhưng tôi sẽ không nói rằng tôi là một người hâm mộ cuồng nhiệt (= một người cực kỳ ngưỡng mộ ai đó / điều gì đó trong mọi hoàn cảnh)."
                    },
                    {
                        "en": "fan of somebody/something I'm a big fan of her books.",
                        "vi": "fan của ai đó / cái gì đó Tôi là một fan hâm mộ lớn của những cuốn sách của cô ấy."
                    },
                    {
                        "en": "I'm a huge fan of Rihanna.",
                        "vi": "Tôi là một fan cuồng nhiệt của Rihanna."
                    },
                    {
                        "en": "I'm not a great fan of bushy beards (= I don't like them).",
                        "vi": "Tôi không phải là một fan cuồng của những bộ râu rậm rạp (= Tôi không thích chúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine that creates a current of air",
                    "vi": "một máy tạo ra một luồng không khí"
                },
                "examples": [
                    {
                        "en": "to switch on the electric fan",
                        "vi": "bật quạt điện"
                    },
                    {
                        "en": "a fan heater",
                        "vi": "quạt sưởi"
                    },
                    {
                        "en": "a fan blowing cold air",
                        "vi": "quạt thổi không khí lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you hold in your hand and wave to create a current of cool air",
                    "vi": "một thứ mà bạn cầm trên tay và vẫy tay để tạo ra một luồng không khí mát mẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when somebody in authority finds out about something bad or wrong that somebody has done",
                    "vi": "khi ai đó có thẩm quyền phát hiện ra điều gì đó xấu hoặc sai mà ai đó đã làm"
                },
                "examples": [
                    {
                        "en": "When the shit hits the fan, I don't want to be here.",
                        "vi": "Khi cái thứ chết tiệt đó xảy ra với người hâm mộ, tôi không muốn ở đây."
                    }
                ]
            }
        ]
    },
    {
        "id": "7aca0a1614f240d58dd7f05f9500b157",
        "word": "fireplace",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfaɪəpleɪs/",
            "us": "/ˈfaɪərpleɪs/"
        },
        "nearby": [
            {
                "word": "fire off",
                "pos": "phrasal verb"
            },
            {
                "word": "the Fire of London",
                "pos": ""
            },
            {
                "word": "fireplace",
                "pos": "noun"
            },
            {
                "word": "firepower",
                "pos": "noun"
            },
            {
                "word": "fire practice",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an open space for a fire in the wall of a room",
                    "vi": "một không gian mở cho ngọn lửa trong bức tường của một căn phòng"
                },
                "examples": [
                    {
                        "en": "A log fire crackled in the fireplace.",
                        "vi": "Một khúc củi cháy nổ lách tách trong lò sưởi."
                    },
                    {
                        "en": "Every room in the house has a fireplace.",
                        "vi": "Mỗi phòng trong nhà đều có lò sưởi."
                    }
                ]
            }
        ]
    },
    {
        "id": "68f2dd8abd7a446bbd01d575552b1799",
        "word": "hi-fi",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhaɪ faɪ/",
            "us": "/ˈhaɪ faɪ/"
        },
        "nearby": [
            {
                "word": "hieroglyphics",
                "pos": "noun"
            },
            {
                "word": "hi-fi",
                "pos": "adjective"
            },
            {
                "word": "hi-fi",
                "pos": "noun"
            },
            {
                "word": "‘Hurricane' Higgins",
                "pos": ""
            },
            {
                "word": "higgledy-piggledy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "equipment for playing recorded music that produces high-quality stereo sound",
                    "vi": "thiết bị để phát nhạc đã ghi tạo ra âm thanh nổi chất lượng cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc625189413f4e8aa734692df7db1d8d",
        "word": "letter box",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈletə bɒks/",
            "us": "/ˈletər bɑːks/"
        },
        "nearby": [
            {
                "word": "letter",
                "pos": "verb"
            },
            {
                "word": "letter bomb",
                "pos": "noun"
            },
            {
                "word": "letter box",
                "pos": "noun"
            },
            {
                "word": "letterbox",
                "pos": "noun"
            },
            {
                "word": "letterbox",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow opening in a door or wall through which mail is delivered",
                    "vi": "một khe hở hẹp trong cánh cửa hoặc bức tường mà thư được gửi qua đó"
                },
                "examples": [
                    {
                        "en": "The postman put a bundle of letters through the letter box.",
                        "vi": "Người đưa thư đưa một bó thư qua hộp thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small box near the main door of a building or by the road, which mail is delivered to",
                    "vi": "một hộp nhỏ gần cửa chính của một tòa nhà hoặc bên đường, thư được chuyển đến"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c2df4461a5145d28fe9076ffe586786",
        "word": "mailbox",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmeɪlbɒks/",
            "us": "/ˈmeɪlbɑːks/"
        },
        "nearby": [
            {
                "word": "mail bomb",
                "pos": "noun"
            },
            {
                "word": "mail-bomb",
                "pos": "verb"
            },
            {
                "word": "mailbox",
                "pos": "noun"
            },
            {
                "word": "mail carrier",
                "pos": "noun"
            },
            {
                "word": "mail drop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area of a computer’s memory where email messages are stored",
                    "vi": "khu vực bộ nhớ của máy tính, nơi các thư email được lưu trữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small box near the main door of a building or by the road, which mail is delivered to",
                    "vi": "một hộp nhỏ gần cửa chính của một tòa nhà hoặc bên đường, thư được chuyển đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a public box, for example in the street, that you put letters into when you send them",
                    "vi": "một hộp công cộng, chẳng hạn như trên đường phố, mà bạn đặt các lá thư vào khi bạn gửi chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d0ec19ca7aa4df388ff89a39f241c00",
        "word": "mat",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/mæt/",
            "us": "/mæt/"
        },
        "nearby": [
            {
                "word": "masturbation",
                "pos": "noun"
            },
            {
                "word": "masturbatory",
                "pos": "adjective"
            },
            {
                "word": "mat",
                "pos": "noun"
            },
            {
                "word": "mat",
                "pos": "adjective"
            },
            {
                "word": "Mata",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of thick carpet or strong material that is used to cover part of a floor",
                    "vi": "một tấm thảm nhỏ dày hoặc vật liệu chắc chắn được sử dụng để trải một phần sàn nhà"
                },
                "examples": [
                    {
                        "en": "Wipe your feet on the mat before you come in, please.",
                        "vi": "Lau chân của bạn trên thảm trước khi bạn vào, làm ơn."
                    },
                    {
                        "en": "The man unrolled his prayer mat.",
                        "vi": "Người đàn ông mở tấm thảm cầu nguyện của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of thick material such as rubber or plastic used especially in some sports for people to lie on or fall onto",
                    "vi": "một mảnh vật liệu dày như cao su hoặc nhựa được sử dụng đặc biệt trong một số môn thể thao để mọi người nằm hoặc ngã lên"
                },
                "examples": [
                    {
                        "en": "a judo/an exercise mat",
                        "vi": "một judo / một tấm thảm tập thể dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of plastic, wood or cloth used on a table for decoration or to protect the surface from heat or damage",
                    "vi": "một miếng nhựa, gỗ hoặc vải nhỏ dùng trên bàn để trang trí hoặc để bảo vệ bề mặt khỏi nhiệt hoặc hư hỏng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thick mass of something that is stuck together",
                    "vi": "một khối dày của thứ gì đó bị dính vào nhau"
                },
                "examples": [
                    {
                        "en": "a mat of hair",
                        "vi": "một tấm thảm tóc"
                    },
                    {
                        "en": "the dense mat of roots at the bottom of the tree",
                        "vi": "rễ cây dày đặc ở dưới cùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to support or defend somebody/something in an argument with somebody",
                    "vi": "để hỗ trợ hoặc bảo vệ ai đó / điều gì đó trong cuộc tranh cãi với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get involved in an argument with somebody/something",
                    "vi": "tham gia vào một cuộc tranh cãi với ai đó / cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d29e4f828c4c4f42a71960c93ab10bd8",
        "word": "plug",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/plʌɡ/",
            "us": "/plʌɡ/"
        },
        "nearby": [
            {
                "word": "plug-in",
                "pos": "noun"
            },
            {
                "word": "plug",
                "pos": "verb"
            },
            {
                "word": "plug",
                "pos": "noun"
            },
            {
                "word": "Plug and Play",
                "pos": "noun"
            },
            {
                "word": "plug-and-play",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small plastic object with two or three metal pins that connects a piece of electrical equipment to the main supply of electricity",
                    "vi": "một vật nhỏ bằng nhựa có hai hoặc ba chốt kim loại nối một phần của thiết bị điện với nguồn điện chính"
                },
                "examples": [
                    {
                        "en": "The iron is fitted with a three-pin plug.",
                        "vi": "Bàn là được gắn một phích cắm ba chân."
                    },
                    {
                        "en": "I'll have to change the plug on my hairdryer.",
                        "vi": "Tôi sẽ phải thay phích cắm trên máy sấy tóc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small opening in a wall, by which you connect a piece of electrical equipment to the main supply of electricity",
                    "vi": "một khe hở nhỏ trên tường, qua đó bạn kết nối một phần thiết bị điện với nguồn điện chính"
                },
                "examples": [
                    {
                        "en": "Can I use this plug for my iron?",
                        "vi": "Tôi có thể sử dụng phích cắm này cho bàn ủi của mình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small object that connects a wire from one piece of electrical equipment to an opening in another",
                    "vi": "một vật nhỏ nối dây dẫn từ thiết bị điện này với lỗ hở của thiết bị điện khác"
                },
                "examples": [
                    {
                        "en": "the plug from the computer to the printer",
                        "vi": "phích cắm từ máy tính đến máy in"
                    },
                    {
                        "en": "I pushed the jack plug into the amp.",
                        "vi": "Tôi đẩy giắc cắm giắc cắm vào amp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part in a car engine that produces a spark (= a flash of electricity) which makes the fuel burn and starts the engine",
                    "vi": "một bộ phận trong động cơ ô tô tạo ra tia lửa điện (= tia điện) làm cho nhiên liệu cháy và khởi động động cơ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thick round piece of plastic, rubber or metal that you put in the hole in a bath or a sink to stop the water flowing out",
                    "vi": "một miếng nhựa, cao su hoặc kim loại tròn dày mà bạn đặt vào lỗ trong bồn tắm hoặc bồn rửa để ngăn nước chảy ra"
                },
                "examples": [
                    {
                        "en": "She pulled out the plug and let the water drain away.",
                        "vi": "Cô rút phích cắm ra và để cho nước rút đi."
                    },
                    {
                        "en": "There was plenty of hot water, but there was no bath plug.",
                        "vi": "Có rất nhiều nước nóng, nhưng không có phích cắm của bồn tắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a round piece of material that fits into a hole and blocks it",
                    "vi": "một miếng vật liệu tròn vừa với một cái lỗ và chặn nó lại"
                },
                "examples": [
                    {
                        "en": "She took the plug of cotton wool from her ear.",
                        "vi": "Cô lấy bông gòn bịt lỗ tai."
                    },
                    {
                        "en": "We fixed the leak with a plug made from an old cloth.",
                        "vi": "Chúng tôi đã sửa chỗ rò rỉ bằng một phích cắm làm từ vải cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that fits into the top of a bottle to close it",
                    "vi": "một vật thể vừa với miệng chai để đóng lại"
                },
                "examples": [
                    {
                        "en": "a jar with a tight-fitting lid",
                        "vi": "một cái lọ có nắp đậy kín"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small plastic tube that you put into a hole in a wall so that it will hold a screw",
                    "vi": "một ống nhựa nhỏ mà bạn đặt vào một lỗ trên tường để nó giữ một cái vít"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "praise or attention that somebody gives to a new book, film, etc. in order to encourage people to buy or see it",
                    "vi": "lời khen ngợi hoặc sự chú ý mà ai đó dành cho một cuốn sách, bộ phim mới, v.v. để khuyến khích mọi người mua hoặc xem nó"
                },
                "examples": [
                    {
                        "en": "He managed to get in a plug for his new book.",
                        "vi": "Anh ấy đã cố gắng chuẩn bị cho cuốn sách mới của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put an end to somebody’s project, a plan, etc.",
                    "vi": "để chấm dứt dự án, kế hoạch của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "The television company pulled the plug on the series after only five episodes.",
                        "vi": "Hãng truyền hình đã rút khỏi bộ phim chỉ sau năm tập."
                    },
                    {
                        "en": "They decided to pull the plug on the project.",
                        "vi": "Họ quyết định rút phích cắm vào dự án."
                    }
                ]
            }
        ]
    },
    {
        "id": "1d3feb2fac4c4522b6cc80f934952cee",
        "word": "power point",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpaʊə pɔɪnt/",
            "us": "/ˈpaʊər pɔɪnt/"
        },
        "nearby": [
            {
                "word": "power plant",
                "pos": "noun"
            },
            {
                "word": "power play",
                "pos": "noun"
            },
            {
                "word": "power point",
                "pos": "noun"
            },
            {
                "word": "power politics",
                "pos": "noun"
            },
            {
                "word": "power-sharing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in a wall that you put a plug into in order to connect electrical equipment to the power supply of a building",
                    "vi": "một thiết bị trong tường mà bạn cắm vào để kết nối thiết bị điện với nguồn điện của tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6664a4bda329432caa193aea71887012",
        "word": "satellite dish",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsætəlaɪt dɪʃ/",
            "us": "/ˈsætəlaɪt dɪʃ/"
        },
        "nearby": [
            {
                "word": "sated",
                "pos": "adjective"
            },
            {
                "word": "satellite",
                "pos": "noun"
            },
            {
                "word": "satellite dish",
                "pos": "noun"
            },
            {
                "word": "satellite station",
                "pos": "noun"
            },
            {
                "word": "sati",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment that receives signals from a satellite, used to enable people to watch satellite television",
                    "vi": "một thiết bị nhận tín hiệu từ vệ tinh, được sử dụng để cho phép mọi người xem truyền hình vệ tinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ddff30de7cf14c589c6fc39663fceaf2",
        "word": "socket",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɒkɪt/",
            "us": "/ˈsɑːkɪt/"
        },
        "nearby": [
            {
                "word": "sock",
                "pos": "verb"
            },
            {
                "word": "sock away",
                "pos": "phrasal verb"
            },
            {
                "word": "socket",
                "pos": "noun"
            },
            {
                "word": "socking",
                "pos": "adverb"
            },
            {
                "word": "sock puppet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in a wall that you put a plug into in order to connect electrical equipment to the power supply of a building",
                    "vi": "một thiết bị trong tường mà bạn cắm vào để kết nối thiết bị điện với nguồn điện của tòa nhà"
                },
                "examples": [
                    {
                        "en": "a wall socket",
                        "vi": "ổ cắm trên tường"
                    },
                    {
                        "en": "The battery charger plugs into any mains socket.",
                        "vi": "Bộ sạc pin cắm vào bất kỳ ổ cắm điện nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device on a piece of electrical equipment that you can fix a plug, a light bulb, etc. into",
                    "vi": "một thiết bị trên một phần của thiết bị điện mà bạn có thể cố định phích cắm, bóng đèn, v.v. vào"
                },
                "examples": [
                    {
                        "en": "an aerial socket on the television",
                        "vi": "một ổ cắm trên không trên tivi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a curved hollow space in the surface of something that another part fits into or moves around in",
                    "vi": "một không gian rỗng cong trên bề mặt của một cái gì đó mà một bộ phận khác nằm gọn trong đó hoặc di chuyển xung quanh"
                },
                "examples": [
                    {
                        "en": "His eyes bulged in their sockets.",
                        "vi": "Mắt anh lồi ra trong hốc."
                    },
                    {
                        "en": "The dog nearly pulled my arm out of its socket.",
                        "vi": "Con chó gần như kéo cánh tay tôi ra khỏi ổ cắm của nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea63df674be6454a8631a6cf16cb71c8",
        "word": "blackout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblækaʊt/",
            "us": "/ˈblækaʊt/"
        },
        "nearby": [
            {
                "word": "blackness",
                "pos": "noun"
            },
            {
                "word": "black out",
                "pos": "phrasal verb"
            },
            {
                "word": "blackout",
                "pos": "noun"
            },
            {
                "word": "Black Panther",
                "pos": "noun"
            },
            {
                "word": "black pepper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period when there is no light as a result of an electrical power failure",
                    "vi": "khoảng thời gian không có ánh sáng do mất điện"
                },
                "examples": [
                    {
                        "en": "The storm caused blackouts in many areas.",
                        "vi": "Bão khiến nhiều khu vực mất điện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation when the government or the police will not allow any news or information on a particular subject to be given to the public",
                    "vi": "một tình huống khi chính phủ hoặc cảnh sát sẽ không cho phép bất kỳ tin tức hoặc thông tin về một chủ đề cụ thể được cung cấp cho công chúng"
                },
                "examples": [
                    {
                        "en": "a news/media blackout",
                        "vi": "một tin tức / phương tiện truyền thông bị mất điện"
                    },
                    {
                        "en": "The government imposed a news blackout during the crisis.",
                        "vi": "Chính phủ đã áp đặt một lệnh cấm tin tức trong cuộc khủng hoảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during a war when all lights must be put out or covered at night, so that they cannot be seen by an enemy attacking by air",
                    "vi": "Khoảng thời gian trong chiến tranh khi tất cả các đèn phải được tắt hoặc che vào ban đêm để kẻ thù tấn công bằng đường không nhìn thấy chúng."
                },
                "examples": [
                    {
                        "en": "It used to take hours to travel home in the blackout.",
                        "vi": "Đã từng mất hàng giờ để đi về nhà trong tình trạng mất điện."
                    },
                    {
                        "en": "They met during a blackout in the war.",
                        "vi": "Họ gặp nhau trong một lần mất điện trong chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of material that covers windows to stop light being seen from outside, or light from outside from coming into a room",
                    "vi": "một mảnh vật liệu che cửa sổ để ngăn ánh sáng từ bên ngoài nhìn thấy hoặc ánh sáng từ bên ngoài chiếu vào phòng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a temporary loss of consciousness, sight or memory",
                    "vi": "mất ý thức, thị giác hoặc trí nhớ tạm thời"
                },
                "examples": [
                    {
                        "en": "She had a blackout and couldn't remember anything about the accident.",
                        "vi": "Cô ấy đã mất điện và không thể nhớ gì về vụ tai nạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f9442aed0b824c759953b3c6dcf3c16a",
        "word": "cat flap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæt flæp/",
            "us": "/ˈkæt flæp/"
        },
        "nearby": [
            {
                "word": "catfish",
                "pos": "noun"
            },
            {
                "word": "catfish",
                "pos": "verb"
            },
            {
                "word": "cat flap",
                "pos": "noun"
            },
            {
                "word": "catgut",
                "pos": "noun"
            },
            {
                "word": "catharsis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hole cut in the bottom of the door to a house, covered by a piece of hard plastic that moves freely, so a pet cat can go in and out",
                    "vi": "một lỗ khoét ở đáy cửa vào nhà, được che bởi miếng nhựa cứng di chuyển tự do nên mèo cưng có thể ra vào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d99836e76b484cfa9e9e670dd794f730",
        "word": "cistern",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪstən/",
            "us": "/ˈsɪstərn/"
        },
        "nearby": [
            {
                "word": "cissy",
                "pos": "noun"
            },
            {
                "word": "cissy",
                "pos": "adjective"
            },
            {
                "word": "cistern",
                "pos": "noun"
            },
            {
                "word": "citadel",
                "pos": "noun"
            },
            {
                "word": "the Citadel",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container in which water is stored in a building, especially one in the roof or connected to a toilet",
                    "vi": "một thùng chứa trong đó nước được lưu trữ trong một tòa nhà, đặc biệt là một thùng chứa trong mái nhà hoặc kết nối với nhà vệ sinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e751109068504b1885ca0b4235e55c69",
        "word": "drain",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dreɪn/",
            "us": "/dreɪn/"
        },
        "nearby": [
            {
                "word": "drag up",
                "pos": "phrasal verb"
            },
            {
                "word": "drain",
                "pos": "verb"
            },
            {
                "word": "drain",
                "pos": "noun"
            },
            {
                "word": "drainage",
                "pos": "noun"
            },
            {
                "word": "drained",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe that carries away dirty water or other liquid waste",
                    "vi": "ống dẫn nước bẩn hoặc chất thải lỏng khác"
                },
                "examples": [
                    {
                        "en": "We had to call in a plumber to unblock the drain.",
                        "vi": "Chúng tôi đã phải gọi thợ sửa ống nước đến để thông tắc cống."
                    },
                    {
                        "en": "The drains (= the system of pipes) date from the beginning of the century.",
                        "vi": "Các cống (= hệ thống đường ống) có niên đại từ đầu thế kỷ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a frame of metal bars over the opening to a drain in the ground",
                    "vi": "một khung các thanh kim loại trên lỗ thông ra cống trên mặt đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a hole in a bath, sink, etc. where the water flows away and into which a plug fits",
                    "vi": "một lỗ trong bồn tắm, bồn rửa, v.v. nơi nước chảy đi và cắm vào đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing that uses a lot of the time, money, etc. that could be used for something else",
                    "vi": "một thứ sử dụng nhiều thời gian, tiền bạc, v.v. có thể được sử dụng cho việc khác"
                },
                "examples": [
                    {
                        "en": "Military spending is a huge drain on the country's resources.",
                        "vi": "Chi tiêu quân sự đang làm tiêu hao rất nhiều tài nguyên của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of resources, people, etc. being lost or wasted",
                    "vi": "thực trạng tài nguyên, con người, v.v. bị mất hoặc lãng phí"
                },
                "examples": [
                    {
                        "en": "the drain of talented staff to the United States",
                        "vi": "nguồn nhân viên tài năng đến Hoa Kỳ"
                    }
                ]
            },
            {
                "define": {
                    "en": "(to be) wasted; (to get) very much worse",
                    "vi": "(lãng phí; (để trở nên) tệ hơn rất nhiều"
                },
                "examples": [
                    {
                        "en": "It's just money down the drain, you know.",
                        "vi": "Đó chỉ là tiền xuống cống, bạn biết đấy."
                    },
                    {
                        "en": "Safety standards have gone down the drain.",
                        "vi": "Các tiêu chuẩn an toàn đã đi xuống cống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh very loudly",
                    "vi": "cười rất to"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e56b7bc66bd04081af8710246676572c",
        "word": "Entryphone™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈentrifəʊn/",
            "us": "/ˈentrifəʊn/"
        },
        "nearby": [
            {
                "word": "entry",
                "pos": "noun"
            },
            {
                "word": "entry-level",
                "pos": "adjective"
            },
            {
                "word": "Entryphone",
                "pos": "noun"
            },
            {
                "word": "entry point",
                "pos": "noun"
            },
            {
                "word": "entryway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of phone on the wall next to the entrance to a building enabling a person inside the building to speak to a person outside before opening the door",
                    "vi": "một loại điện thoại trên tường cạnh lối vào tòa nhà cho phép người bên trong tòa nhà nói chuyện với người bên ngoài trước khi mở cửa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "201901c3a4024e0387e26ceddd9d333b",
        "word": "French door",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfrentʃ ˈdɔː(r)/",
            "us": "/ˌfrentʃ ˈdɔːr/"
        },
        "nearby": [
            {
                "word": "French Canadian",
                "pos": "adjective"
            },
            {
                "word": "French cricket",
                "pos": "noun"
            },
            {
                "word": "French door",
                "pos": "noun"
            },
            {
                "word": "French dressing",
                "pos": "noun"
            },
            {
                "word": "French fry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a glass door, usually one of a pair that leads to a garden or balcony",
                    "vi": "một cửa kính, thường là một trong những cặp dẫn đến khu vườn hoặc ban công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a1a9c335e1204c40a470cc7bc1c7380d",
        "word": "French window",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfrentʃ ˈwɪndəʊ/",
            "us": "/ˌfrentʃ ˈwɪndəʊ/"
        },
        "nearby": [
            {
                "word": "French toast",
                "pos": "noun"
            },
            {
                "word": "French twist",
                "pos": "noun"
            },
            {
                "word": "French window",
                "pos": "noun"
            },
            {
                "word": "Frenchwoman",
                "pos": "noun"
            },
            {
                "word": "frenemy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a glass door, usually one of a pair that leads to a garden or balcony",
                    "vi": "một cửa kính, thường là một trong những cặp dẫn đến khu vườn hoặc ban công"
                },
                "examples": [
                    {
                        "en": "French windows lead out onto the patio.",
                        "vi": "Cửa sổ kiểu Pháp dẫn ra hiên."
                    },
                    {
                        "en": "You get to the garden through French windows at the back of the house.",
                        "vi": "Bạn có thể đến khu vườn qua các cửa sổ kiểu Pháp ở phía sau ngôi nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "865c384d0f8b4cbfbfdc60149947ac7a",
        "word": "fuse box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfjuːz bɒks/",
            "us": "/ˈfjuːz bɑːks/"
        },
        "nearby": [
            {
                "word": "fuse",
                "pos": "noun"
            },
            {
                "word": "fuse",
                "pos": "verb"
            },
            {
                "word": "fuse box",
                "pos": "noun"
            },
            {
                "word": "fuselage",
                "pos": "noun"
            },
            {
                "word": "fuse wire",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small box or cupboard that contains the fuses of the electrical system of a building",
                    "vi": "một hộp hoặc tủ nhỏ có chứa cầu chì của hệ thống điện của một tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c53384e52ed349518cd3ba3a33152c1d",
        "word": "gasometer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡæˈsɒmɪtə(r)/",
            "us": "/ɡæˈsɑːmɪtər/"
        },
        "nearby": [
            {
                "word": "gas oil",
                "pos": "noun"
            },
            {
                "word": "gasoline",
                "pos": "noun"
            },
            {
                "word": "gasometer",
                "pos": "noun"
            },
            {
                "word": "gasp",
                "pos": "verb"
            },
            {
                "word": "gasp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large round container or building in which gas is stored and from which it is sent through pipes to other buildings",
                    "vi": "một thùng chứa tròn rất lớn hoặc tòa nhà trong đó khí được lưu trữ và từ đó nó được đưa qua các đường ống đến các tòa nhà khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bad7ceec61864ec98c190e35ecbd3303",
        "word": "hatch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hætʃ/",
            "us": "/hætʃ/"
        },
        "nearby": [
            {
                "word": "hatbox",
                "pos": "noun"
            },
            {
                "word": "hatch",
                "pos": "verb"
            },
            {
                "word": "hatch",
                "pos": "noun"
            },
            {
                "word": "Hatchards",
                "pos": ""
            },
            {
                "word": "hatchback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening or a door in a ship, aircraft or spacecraft",
                    "vi": "một sự mở hoặc một cánh cửa trong một con tàu, máy bay hoặc tàu vũ trụ"
                },
                "examples": [
                    {
                        "en": "The engineer was peering into the service hatch.",
                        "vi": "Kỹ sư đang chăm chú vào cửa hầm dịch vụ."
                    },
                    {
                        "en": "an escape hatch",
                        "vi": "một lối thoát hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening in a wall between two rooms, especially a kitchen and a dining room, through which food can be passed",
                    "vi": "một khe hở trong bức tường giữa hai phòng, đặc biệt là nhà bếp và phòng ăn, qua đó thức ăn có thể đi qua"
                },
                "examples": [
                    {
                        "en": "a serving hatch",
                        "vi": "một khẩu phần ăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening or a door in a floor or ceiling",
                    "vi": "một lỗ mở hoặc một cánh cửa trên sàn nhà hoặc trần nhà"
                },
                "examples": [
                    {
                        "en": "a hatch to the attic",
                        "vi": "một cửa sập cho tầng áp mái"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare yourself for a period of difficulty or trouble",
                    "vi": "để chuẩn bị cho mình trong một giai đoạn khó khăn hoặc rắc rối"
                },
                "examples": [
                    {
                        "en": "A natural tendency in times of recession is to batten down the hatches and think about our own needs.",
                        "vi": "Một xu hướng tự nhiên trong thời kỳ suy thoái là thu mình lại và suy nghĩ về nhu cầu của chính chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut all the entrances to the lower part, especially because a storm is expected",
                    "vi": "đóng tất cả các lối vào phần dưới, đặc biệt là vì dự kiến sẽ có bão"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used before drinking something, especially to express good wishes before drinking alcohol",
                    "vi": "được sử dụng trước khi uống một thứ gì đó, đặc biệt là để bày tỏ những lời chúc tốt đẹp trước khi uống rượu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dac25bf8e2cf45b38e20721ccb491062",
        "word": "immersion heater",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈmɜːʃn hiːtə(r)/",
            "us": "/ɪˈmɜːrʒn hiːtər/"
        },
        "nearby": [
            {
                "word": "immerse",
                "pos": "verb"
            },
            {
                "word": "immersion",
                "pos": "noun"
            },
            {
                "word": "immersion heater",
                "pos": "noun"
            },
            {
                "word": "immersive",
                "pos": "adjective"
            },
            {
                "word": "immigrant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that provides hot water for a house by heating water in a tank",
                    "vi": "thiết bị cung cấp nước nóng cho ngôi nhà bằng cách đun nước trong bể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aa8e1459a28d4382a6cb57aa13b8eed7",
        "word": "Jacuzzi™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒəˈkuːzi/",
            "us": "/dʒəˈkuːzi/"
        },
        "nearby": [
            {
                "word": "the Jacobite rebellions",
                "pos": "noun"
            },
            {
                "word": "Jacqueline",
                "pos": ""
            },
            {
                "word": "Jacuzzi",
                "pos": "noun"
            },
            {
                "word": "jade",
                "pos": "noun"
            },
            {
                "word": "Jade",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large bath with a pump that moves the water around, giving a pleasant feeling to your body",
                    "vi": "một bồn tắm lớn có máy bơm chuyển động dòng nước, tạo cảm giác dễ chịu cho cơ thể bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "61a61acf7a494659b38d16687284271d",
        "word": "main",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/meɪn/",
            "us": "/meɪn/"
        },
        "nearby": [
            {
                "word": "maim",
                "pos": "verb"
            },
            {
                "word": "main",
                "pos": "adjective"
            },
            {
                "word": "main",
                "pos": "noun"
            },
            {
                "word": "main clause",
                "pos": "noun"
            },
            {
                "word": "main course",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large pipe that carries water or gas to a building; a large cable that carries electricity to a building",
                    "vi": "một đường ống lớn dẫn nước hoặc khí đốt đến một tòa nhà; một dây cáp lớn mang điện đến một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a leaking gas main",
                        "vi": "khí gas chính bị rò rỉ"
                    },
                    {
                        "en": "The main serves four towns.",
                        "vi": "Chính phục vụ bốn thị trấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large pipe that carries waste water and sewage (= human waste, etc.) away from a building",
                    "vi": "một đường ống lớn dẫn nước thải và nước thải (= chất thải của con người, v.v.) ra khỏi tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the place where the supply of water, gas or electricity to a building or an area starts; the system of providing gas, water and electricity to a building or of carrying it away from a building",
                    "vi": "nơi bắt đầu cung cấp nước, khí đốt hoặc điện cho một tòa nhà hoặc một khu vực; hệ thống cung cấp khí đốt, nước và điện cho tòa nhà hoặc mang nó ra khỏi tòa nhà"
                },
                "examples": [
                    {
                        "en": "The house is not yet connected to the mains.",
                        "vi": "Ngôi nhà vẫn chưa được kết nối với nguồn điện."
                    },
                    {
                        "en": "at the mains The electricity supply has been cut off at the mains.",
                        "vi": "tại nguồn điện Nguồn điện đã bị cắt tại nguồn điện lưới."
                    },
                    {
                        "en": "Plug the transformer into the mains (= the place on a wall where electricity is brought into a room).",
                        "vi": "Cắm máy biến áp vào nguồn điện (= nơi trên tường nơi dẫn điện vào phòng)."
                    },
                    {
                        "en": "mains gas/water/electricity",
                        "vi": "nguồn điện khí / nước / điện"
                    },
                    {
                        "en": "The shaver will run off batteries or mains.",
                        "vi": "Máy cạo râu sẽ hết pin hoặc nguồn điện."
                    },
                    {
                        "en": "mains drainage",
                        "vi": "hệ thống thoát nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a statement is true in most cases",
                    "vi": "được sử dụng để nói rằng một tuyên bố là đúng trong hầu hết các trường hợp"
                },
                "examples": [
                    {
                        "en": "The service here is, in the main, reliable.",
                        "vi": "Dịch vụ ở đây là chính, đáng tin cậy."
                    },
                    {
                        "en": "In the main, the money raised goes to children’s charities.",
                        "vi": "Chủ yếu, số tiền quyên góp được dành cho các tổ chức từ thiện dành cho trẻ em."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc38114969bf470d8d4ccb4055453bbe",
        "word": "mod con",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɒd ˈkɒn/",
            "us": "/ˌmɑːd ˈkɑːn/"
        },
        "nearby": [
            {
                "word": "modal",
                "pos": "noun"
            },
            {
                "word": "modality",
                "pos": "noun"
            },
            {
                "word": "mod con",
                "pos": "noun"
            },
            {
                "word": "modding",
                "pos": "noun"
            },
            {
                "word": "mode",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the things in a house or flat that make living there easier and more comfortable",
                    "vi": "bất kỳ vật dụng nào trong ngôi nhà hoặc căn hộ giúp cuộc sống ở đó dễ dàng và thoải mái hơn"
                },
                "examples": [
                    {
                        "en": "The property has many interesting features and all mod cons.",
                        "vi": "Tài sản có nhiều tính năng thú vị và tất cả các khuyết điểm của mod."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba0c0a29460d4b9ca7a98b34c15d4926",
        "word": "plughole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplʌɡhəʊl/",
            "us": "/ˈplʌɡhəʊl/"
        },
        "nearby": [
            {
                "word": "plug-and-play",
                "pos": "adjective"
            },
            {
                "word": "plug away",
                "pos": "phrasal verb"
            },
            {
                "word": "plughole",
                "pos": "noun"
            },
            {
                "word": "plug in",
                "pos": "phrasal verb"
            },
            {
                "word": "plug-in",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hole in a bath, sink, etc. where the water flows away and into which a plug fits",
                    "vi": "một lỗ trong bồn tắm, bồn rửa, v.v. nơi nước chảy đi và cắm vào đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to be) wasted; (to get) very much worse",
                    "vi": "(lãng phí; (để trở nên) tệ hơn rất nhiều"
                },
                "examples": [
                    {
                        "en": "It's just money down the plughole, you know.",
                        "vi": "Đó chỉ là tiền xuống lỗ, bạn biết đấy."
                    },
                    {
                        "en": "Safety standards have gone down the plughole.",
                        "vi": "Các tiêu chuẩn an toàn đã đi xuống lỗ hổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "771a3f492c4f4a3dbbd7a4f523f47f4f",
        "word": "plunger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplʌndʒə(r)/",
            "us": "/ˈplʌndʒər/"
        },
        "nearby": [
            {
                "word": "plunge into",
                "pos": "phrasal verb"
            },
            {
                "word": "plunge pool",
                "pos": "noun"
            },
            {
                "word": "plunger",
                "pos": "noun"
            },
            {
                "word": "plunging",
                "pos": "adjective"
            },
            {
                "word": "plunk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a piece of equipment that can be pushed down",
                    "vi": "một bộ phận của thiết bị có thể được đẩy xuống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of equipment used for clearing kitchen and bathroom pipes, that consists of a rubber cup fixed to a handle",
                    "vi": "một phần của thiết bị được sử dụng để làm sạch đường ống nhà bếp và phòng tắm, bao gồm một cốc cao su được cố định vào tay cầm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9b883f0a19f941d9951a424eed09fa80",
        "word": "poker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊkə(r)/",
            "us": "/ˈpəʊkər/"
        },
        "nearby": [
            {
                "word": "poke around",
                "pos": "phrasal verb"
            },
            {
                "word": "poke at",
                "pos": "phrasal verb"
            },
            {
                "word": "poker",
                "pos": "noun"
            },
            {
                "word": "poker face",
                "pos": "noun"
            },
            {
                "word": "poker-faced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a card game for two or more people, in which the players bet on the values of the cards they hold",
                    "vi": "một trò chơi bài cho hai người trở lên, trong đó người chơi đặt cược vào giá trị của quân bài mà họ nắm giữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a metal stick for moving or breaking up coal in a fire",
                    "vi": "một thanh kim loại để di chuyển hoặc làm vỡ than trong lửa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dff6088fb5ea4cd3ab61c5bbe0a05e87",
        "word": "radiator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪdieɪtə(r)/",
            "us": "/ˈreɪdieɪtər/"
        },
        "nearby": [
            {
                "word": "radiation",
                "pos": "noun"
            },
            {
                "word": "radiation belt",
                "pos": "noun"
            },
            {
                "word": "radiator",
                "pos": "noun"
            },
            {
                "word": "radical",
                "pos": "adjective"
            },
            {
                "word": "radical",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hollow metal device for heating rooms. Radiators are usually connected by pipes through which hot water is sent.",
                    "vi": "một thiết bị kim loại rỗng để sưởi ấm phòng. Bộ tản nhiệt thường được kết nối bằng các đường ống dẫn nước nóng qua đó."
                },
                "examples": [
                    {
                        "en": "a central heating system with a radiator in each room",
                        "vi": "hệ thống sưởi trung tâm với bộ tản nhiệt trong mỗi phòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device for cooling the engine of a vehicle or an aircraft",
                    "vi": "một thiết bị để làm mát động cơ của một chiếc xe hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "He filled his car radiator with water.",
                        "vi": "Anh đổ đầy nước vào bộ tản nhiệt ô tô của mình."
                    },
                    {
                        "en": "Top up the radiator before making a long journey.",
                        "vi": "Nạp đầy bộ tản nhiệt trước khi thực hiện một hành trình dài."
                    }
                ]
            }
        ]
    },
    {
        "id": "d4cc41c7b73042c0b957fe68bdb3e660",
        "word": "skylight",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskaɪlaɪt/",
            "us": "/ˈskaɪlaɪt/"
        },
        "nearby": [
            {
                "word": "Skylab",
                "pos": ""
            },
            {
                "word": "skylark",
                "pos": "noun"
            },
            {
                "word": "skylight",
                "pos": "noun"
            },
            {
                "word": "skyline",
                "pos": "noun"
            },
            {
                "word": "sky marshal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small window in a roof",
                    "vi": "một cửa sổ nhỏ trên mái nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "436dd2e164d245a5a3396a6ea022ca81",
        "word": "soil pipe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɔɪl paɪp/",
            "us": "/ˈsɔɪl paɪp/"
        },
        "nearby": [
            {
                "word": "soil",
                "pos": "verb"
            },
            {
                "word": "the Soil Association",
                "pos": ""
            },
            {
                "word": "soil pipe",
                "pos": "noun"
            },
            {
                "word": "soil science",
                "pos": "noun"
            },
            {
                "word": "soirée",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe that carries waste water from a building",
                    "vi": "một đường ống dẫn nước thải từ một tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f08541419fa407888cf90d0188cbddf",
        "word": "storage heater",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɔːrɪdʒ hiːtə(r)/",
            "us": "/ˈstɔːrɪdʒ hiːtər/"
        },
        "nearby": [
            {
                "word": "storage",
                "pos": "noun"
            },
            {
                "word": "storage battery",
                "pos": "noun"
            },
            {
                "word": "storage heater",
                "pos": "noun"
            },
            {
                "word": "store",
                "pos": "noun"
            },
            {
                "word": "store",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electric heater that stores heat when electricity is cheaper, for example at night",
                    "vi": "một lò sưởi điện lưu trữ nhiệt khi điện rẻ hơn, chẳng hạn như vào ban đêm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a25459801bdd4c50b8dadbe75df73783",
        "word": "thermostat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθɜːməstæt/",
            "us": "/ˈθɜːrməstæt/"
        },
        "nearby": [
            {
                "word": "thermosetting",
                "pos": "adjective"
            },
            {
                "word": "the thermosphere",
                "pos": "noun"
            },
            {
                "word": "thermostat",
                "pos": "noun"
            },
            {
                "word": "thermostatic",
                "pos": "adjective"
            },
            {
                "word": "thermostatically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that measures and controls the temperature of a machine or room, by switching the heating or cooling system on and off as necessary",
                    "vi": "một thiết bị đo và kiểm soát nhiệt độ của máy hoặc phòng, bằng cách bật và tắt hệ thống sưởi hoặc làm mát khi cần thiết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d5ebfbc9f9084864803f6b9a90106502",
        "word": "tumble dryer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtʌmbl ˈdraɪə(r)/",
            "us": "/ˌtʌmbl ˈdraɪər/"
        },
        "nearby": [
            {
                "word": "tumbledown",
                "pos": "adjective"
            },
            {
                "word": "tumble-dry",
                "pos": "verb"
            },
            {
                "word": "tumble dryer",
                "pos": "noun"
            },
            {
                "word": "tumbler",
                "pos": "noun"
            },
            {
                "word": "tumble to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine that uses hot air to dry clothes after they have been washed",
                    "vi": "một máy sử dụng không khí nóng để làm khô quần áo sau khi chúng đã được giặt sạch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e268e784f32a471f8dfd7d3baea381db",
        "word": "vent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vent/",
            "us": "/vent/"
        },
        "nearby": [
            {
                "word": "venomously",
                "pos": "adverb"
            },
            {
                "word": "venous",
                "pos": "adjective"
            },
            {
                "word": "vent",
                "pos": "noun"
            },
            {
                "word": "vent",
                "pos": "verb"
            },
            {
                "word": "ventilate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening that allows air, gas or liquid to pass out of or into a room, building, container, etc.",
                    "vi": "một khe hở cho phép không khí, khí đốt hoặc chất lỏng đi ra ngoài hoặc đi vào phòng, tòa nhà, thùng chứa, v.v."
                },
                "examples": [
                    {
                        "en": "air/heating vents",
                        "vi": "lỗ thông hơi / sưởi ấm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opening in the body of a bird, fish, reptile or other small animal, through which waste matter is passed out",
                    "vi": "lỗ mở trong cơ thể của chim, cá, bò sát hoặc động vật nhỏ khác, qua đó chất thải được thải ra ngoài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long, thin opening at the bottom of the back or side of a coat or jacket",
                    "vi": "một lỗ dài và mỏng ở dưới cùng của lưng hoặc bên hông của áo khoác hoặc áo khoác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to express a feeling, especially anger, strongly",
                    "vi": "thể hiện một cách mạnh mẽ cảm xúc, đặc biệt là tức giận"
                },
                "examples": [
                    {
                        "en": "Children give vent to their anger in various ways.",
                        "vi": "Trẻ em giải tỏa cơn giận bằng nhiều cách khác nhau."
                    },
                    {
                        "en": "She gave full vent to her feelings in a violent outburst.",
                        "vi": "Cô ấy đã bộc lộ hết cảm xúc của mình trong một cơn bộc phát dữ dội."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee6ac441f7614bb7b601888450ba08e2",
        "word": "ventilator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈventɪleɪtə(r)/",
            "us": "/ˈventɪleɪtər/"
        },
        "nearby": [
            {
                "word": "ventilate",
                "pos": "verb"
            },
            {
                "word": "ventilation",
                "pos": "noun"
            },
            {
                "word": "ventilator",
                "pos": "noun"
            },
            {
                "word": "ventral",
                "pos": "adjective"
            },
            {
                "word": "ventricle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device or an opening for letting fresh air come into a room, etc.",
                    "vi": "một thiết bị hoặc một khe hở để cho không khí trong lành vào phòng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of medical equipment with a pump that helps somebody to breathe by sending air in and out of their lungs",
                    "vi": "một thiết bị y tế có máy bơm giúp ai đó thở bằng cách đưa không khí vào và ra khỏi phổi của họ"
                },
                "examples": [
                    {
                        "en": "He was put on a ventilator.",
                        "vi": "Anh ta được đưa vào máy thở."
                    }
                ]
            }
        ]
    },
    {
        "id": "62384a6effe1477b898e60de9d6c80a7",
        "word": "white goods",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪt ɡʊdz/",
            "us": "/ˈwaɪt ɡʊdz/"
        },
        "nearby": [
            {
                "word": "white flight",
                "pos": "noun"
            },
            {
                "word": "white flour",
                "pos": "noun"
            },
            {
                "word": "white goods",
                "pos": "noun"
            },
            {
                "word": "Whitehall",
                "pos": "noun"
            },
            {
                "word": "the Whitehall Theatre",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "large pieces of electrical equipment in the house, such as washing machines, etc.",
                    "vi": "các thiết bị điện lớn trong nhà, chẳng hạn như máy giặt, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a3e8a64e1de443d2bcb411bb3da81da7",
        "word": "worktop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɜːktɒp/",
            "us": "/ˈwɜːrktɑːp/"
        },
        "nearby": [
            {
                "word": "work surface",
                "pos": "noun"
            },
            {
                "word": "work to",
                "pos": "phrasal verb"
            },
            {
                "word": "worktop",
                "pos": "noun"
            },
            {
                "word": "work-to-rule",
                "pos": "noun"
            },
            {
                "word": "work towards",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat surface in a kitchen for preparing food on",
                    "vi": "một bề mặt phẳng trong nhà bếp để chuẩn bị thức ăn"
                },
                "examples": [
                    {
                        "en": "The kitchen has granite worktops.",
                        "vi": "Nhà bếp có bàn làm việc bằng đá granit."
                    }
                ]
            }
        ]
    },
    {
        "id": "aa59652ef2764f16944e41138e643186",
        "word": "zapper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈzæpə(r)/",
            "us": "/ˈzæpər/"
        },
        "nearby": [
            {
                "word": "zap",
                "pos": "verb"
            },
            {
                "word": "Frank Zappa",
                "pos": ""
            },
            {
                "word": "zapper",
                "pos": "noun"
            },
            {
                "word": "ZAR",
                "pos": "abbreviation"
            },
            {
                "word": "Zara",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that allows you to operate a television, etc. from a distance",
                    "vi": "một thiết bị cho phép bạn điều khiển TV, v.v. từ xa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a device or weapon that attacks or destroys something quickly",
                    "vi": "một thiết bị hoặc vũ khí tấn công hoặc phá hủy một cái gì đó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "a bug zapper",
                        "vi": "một con bọ hung"
                    }
                ]
            }
        ]
    }
]