[
    {
        "id": "3a9d7f915142484da250c691057fab8c",
        "word": "adventure",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ədˈventʃə(r)/",
            "us": "/ədˈventʃər/"
        },
        "nearby": [
            {
                "word": "adventitious",
                "pos": "adjective"
            },
            {
                "word": "Advent Sunday",
                "pos": "noun"
            },
            {
                "word": "adventure",
                "pos": "noun"
            },
            {
                "word": "adventure game",
                "pos": "noun"
            },
            {
                "word": "adventure playground",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unusual, exciting or dangerous experience, journey or series of events",
                    "vi": "một trải nghiệm bất thường, thú vị hoặc nguy hiểm, hành trình hoặc chuỗi sự kiện"
                },
                "examples": [
                    {
                        "en": "her adventures travelling in Africa",
                        "vi": "cuộc phiêu lưu của cô ấy đi du lịch ở châu Phi"
                    },
                    {
                        "en": "adventure stories",
                        "vi": "những câu chuyện phiêu lưu"
                    },
                    {
                        "en": "Four members of our staff have embarked on the adventure of a lifetime.",
                        "vi": "Bốn nhân viên của chúng tôi đã bắt tay vào cuộc phiêu lưu của cuộc đời."
                    },
                    {
                        "en": "They fly around in their rocket ship and go on exciting adventures.",
                        "vi": "Họ bay xung quanh trong con tàu tên lửa của họ và tham gia vào những cuộc phiêu lưu thú vị."
                    },
                    {
                        "en": "When you're a child, life is one big adventure.",
                        "vi": "Khi bạn còn là một đứa trẻ, cuộc sống là một cuộc phiêu lưu lớn."
                    },
                    {
                        "en": "Popper described science as the greatest adventure in the world.",
                        "vi": "Popper mô tả khoa học là cuộc phiêu lưu vĩ đại nhất trên thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being excited and willing to take risks, try new ideas, etc.",
                    "vi": "phẩm chất của việc hào hứng và sẵn sàng chấp nhận rủi ro, thử những ý tưởng mới, v.v."
                },
                "examples": [
                    {
                        "en": "a sense/spirit of adventure",
                        "vi": "ý thức / tinh thần phiêu lưu"
                    },
                    {
                        "en": "I set out across the country looking for adventure.",
                        "vi": "Tôi bắt đầu đi khắp đất nước để tìm kiếm cuộc phiêu lưu."
                    },
                    {
                        "en": "the adventure travel industry",
                        "vi": "ngành du lịch mạo hiểm"
                    },
                    {
                        "en": "Travelling by train has always been associated with romance and adventure.",
                        "vi": "Du lịch bằng tàu hỏa luôn gắn liền với sự lãng mạn và mạo hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8d42a028ef849bcbf2411cfe197f6ae",
        "word": "chance",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/tʃɑːns/",
            "us": "/tʃæns/"
        },
        "nearby": [
            {
                "word": "Charlie Chan",
                "pos": ""
            },
            {
                "word": "chana",
                "pos": "noun"
            },
            {
                "word": "chance",
                "pos": "noun"
            },
            {
                "word": "chance",
                "pos": "verb"
            },
            {
                "word": "chance",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a possibility of something happening, especially something that you want",
                    "vi": "khả năng xảy ra điều gì đó, đặc biệt là điều gì đó mà bạn muốn"
                },
                "examples": [
                    {
                        "en": "chance of doing something She only has a slim chance of passing the exam.",
                        "vi": "Cô ấy chỉ có một cơ hội nhỏ để vượt qua kỳ thi."
                    },
                    {
                        "en": "Is there any chance of getting tickets for tonight?",
                        "vi": "Có cơ hội nhận được vé cho tối nay không?"
                    },
                    {
                        "en": "chance that… There's a good chance that he'll be back in time.",
                        "vi": "cơ hội đó… Có một cơ hội tốt là anh ấy sẽ quay lại thời gian."
                    },
                    {
                        "en": "There is no chance that he will change his mind.",
                        "vi": "Không có cơ hội để anh ta thay đổi ý định của mình."
                    },
                    {
                        "en": "chance of somebody/something doing something What chance is there of anybody being found alive?",
                        "vi": "cơ hội ai đó / cái gì đó đang làm gì đó Có cơ hội nào để ai đó được tìm thấy còn sống?"
                    },
                    {
                        "en": "There is little chance of that happening.",
                        "vi": "Có rất ít khả năng điều đó xảy ra."
                    },
                    {
                        "en": "chance of something The operation has a fifty-fifty chance of success.",
                        "vi": "cơ hội của điều gì đó Hoạt động có 50 cơ hội thành công."
                    },
                    {
                        "en": "Nowadays a premature baby has a very good chance of survival.",
                        "vi": "Ngày nay, trẻ sinh non có cơ hội sống sót rất cao."
                    },
                    {
                        "en": "Not wearing a helmet could increase your chance of injury.",
                        "vi": "Không đội mũ bảo hiểm có thể làm tăng khả năng bị thương."
                    },
                    {
                        "en": "The Met Office said there was an 80 per cent chance of severe weather.",
                        "vi": "Văn phòng Met cho biết có 80% khả năng xảy ra thời tiết khắc nghiệt."
                    },
                    {
                        "en": "chance at something Now that he's met the love of his life, he finally has a chance at real happiness.",
                        "vi": "cơ hội ở một cái gì đó Bây giờ anh ấy đã gặp được tình yêu của đời mình, anh ấy cuối cùng cũng có cơ hội hạnh phúc thực sự."
                    },
                    {
                        "en": "chance for something We believe the plan has a good chance for success.",
                        "vi": "cơ hội cho một cái gì đó Chúng tôi tin rằng kế hoạch có một cơ hội tốt để thành công."
                    },
                    {
                        "en": "with a chance They are the one team with a chance of beating us.",
                        "vi": "có cơ hội Họ là đội có cơ hội đánh bại chúng tôi."
                    },
                    {
                        "en": "an outside chance (= a very small one)",
                        "vi": "một cơ hội bên ngoài (= một cơ hội rất nhỏ)"
                    },
                    {
                        "en": "The chances are a million to one against being struck by lightning.",
                        "vi": "Cơ hội là một triệu một để chống lại việc bị sét đánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a suitable time or situation when you have the opportunity to do something",
                    "vi": "một thời điểm hoặc tình huống thích hợp khi bạn có cơ hội để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "It was the chance she had been waiting for.",
                        "vi": "Đó là cơ hội mà cô đã chờ đợi."
                    },
                    {
                        "en": "Jeff deceived me once already—I won't give him a second chance.",
                        "vi": "Jeff đã lừa dối tôi một lần rồi - tôi sẽ không cho anh ta cơ hội thứ hai."
                    },
                    {
                        "en": "This is your big chance (= opportunity for success).",
                        "vi": "Đây là cơ hội lớn của bạn (= cơ hội thành công)."
                    },
                    {
                        "en": "chance of something We won't get another chance of a holiday this year.",
                        "vi": "cơ hội của một cái gì đó Chúng ta sẽ không có cơ hội khác trong một kỳ nghỉ năm nay."
                    },
                    {
                        "en": "chance to do something Please give me a chance to explain.",
                        "vi": "cơ hội để làm điều gì đó Xin hãy cho tôi một cơ hội để giải thích."
                    },
                    {
                        "en": "You'll have the chance to ask questions at the end.",
                        "vi": "Bạn sẽ có cơ hội đặt câu hỏi ở phần cuối."
                    },
                    {
                        "en": "The team missed their chance to win the cup.",
                        "vi": "Đội đã bỏ lỡ cơ hội giành cúp."
                    },
                    {
                        "en": "Tonight is your last chance to catch the play at your local theatre.",
                        "vi": "Tối nay là cơ hội cuối cùng để bạn xem vở kịch tại nhà hát địa phương."
                    },
                    {
                        "en": "He jumped at the chance to go back to Australia.",
                        "vi": "Anh ấy đã chớp lấy cơ hội để quay trở lại Úc."
                    },
                    {
                        "en": "He realized that this might be his only chance to save himself.",
                        "vi": "Anh nhận ra rằng đây có thể là cơ hội duy nhất để tự cứu mình."
                    },
                    {
                        "en": "chance for somebody to do something There will be a chance for parents to look around the school.",
                        "vi": "cơ hội cho ai đó làm điều gì đó Sẽ có cơ hội cho phụ huynh nhìn quanh trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant or dangerous possibility",
                    "vi": "một khả năng khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "When installing electrical equipment don't take any chances. A mistake could kill.",
                        "vi": "Khi lắp đặt thiết bị điện, đừng có bất kỳ cơ hội nào. Một sai lầm có thể giết chết."
                    },
                    {
                        "en": "The car might break down but that's a chance we'll have to take.",
                        "vi": "Chiếc xe có thể bị hỏng nhưng đó là cơ hội mà chúng tôi phải thực hiện."
                    },
                    {
                        "en": "chance on somebody/something The producers didn't want to take a chance on an unknown actor.",
                        "vi": "cơ hội vào ai đó / cái gì đó Các nhà sản xuất không muốn có cơ hội vào một diễn viên vô danh."
                    },
                    {
                        "en": "chance with somebody/something The police were taking no chances with the protesters.",
                        "vi": "cơ hội với ai đó / cái gì đó Cảnh sát không có cơ hội với những người biểu tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that some things happen without any cause that you can see or understand",
                    "vi": "cách mà một số điều xảy ra mà không có nguyên nhân nào mà bạn có thể thấy hoặc hiểu được"
                },
                "examples": [
                    {
                        "en": "I met her by chance (= without planning to) at the airport.",
                        "vi": "Tôi đã gặp cô ấy một cách tình cờ (= mà không có kế hoạch) ở sân bay."
                    },
                    {
                        "en": "Chess is not a game of chance.",
                        "vi": "Cờ vua không phải là trò chơi may rủi."
                    },
                    {
                        "en": "It was pure chance that we were both there.",
                        "vi": "Đó là cơ hội thuần túy khi cả hai chúng tôi đều ở đó."
                    },
                    {
                        "en": "We'll plan everything very carefully and leave nothing to chance.",
                        "vi": "Chúng tôi sẽ lên kế hoạch cho mọi thứ rất cẩn thận và không để xảy ra bất kỳ cơ hội nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "happening in a way that was lucky, although it was not planned",
                    "vi": "xảy ra một cách may mắn, mặc dù nó không được lên kế hoạch"
                },
                "examples": [
                    {
                        "en": "As chance would have it, John was going to London too, so I went with him.",
                        "vi": "Như có cơ hội xảy ra, John cũng sẽ đến London, vì vậy tôi đã đi cùng anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the possibility of succeeding or achieving something",
                    "vi": "có khả năng thành công hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Do you think we'll win?’ ‘I think we're in with a chance.’",
                        "vi": "Bạn có nghĩ chúng ta sẽ thắng không?' 'Tôi nghĩ chúng ta đang có một cơ hội.'"
                    },
                    {
                        "en": "He's in with a good chance of passing the exam.",
                        "vi": "Anh ấy tham gia với một cơ hội tốt để vượt qua kỳ thi."
                    },
                    {
                        "en": "After a poor start, they are now in with a chance of winning the league.",
                        "vi": "Sau khởi đầu tệ hại, họ đang đứng trước cơ hội vô địch giải đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially in questions, to ask whether something is true, possible, etc.",
                    "vi": "được sử dụng đặc biệt trong các câu hỏi, để hỏi liệu điều gì đó có đúng, có thể xảy ra hay không, v.v."
                },
                "examples": [
                    {
                        "en": "Are you in love with him, by any chance?",
                        "vi": "Bạn có yêu anh ấy không?"
                    },
                    {
                        "en": "Are you by any chance Mr Ludd?",
                        "vi": "Bạn có tình cờ không, Mr Ludd?"
                    }
                ]
            },
            {
                "define": {
                    "en": "it is likely that…",
                    "vi": "có khả năng là…"
                },
                "examples": [
                    {
                        "en": "The chances are you won't have to pay.",
                        "vi": "Cơ hội là bạn sẽ không phải trả tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely",
                    "vi": "mọi người nói rằng cơ hội sẽ là một điều tốt để thể hiện rằng họ muốn làm hoặc có điều mà ai đó đã đề cập, nhưng họ không nghĩ rằng nó rất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used for saying that you do not believe something is likely to happen",
                    "vi": "được sử dụng để nói rằng bạn không tin rằng điều gì đó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "‘They might let us in without tickets.’ ‘Fat chance of that!’",
                        "vi": "Họ có thể cho chúng tôi vào mà không cần vé.' 'Cơ hội béo bở của điều đó!'"
                    },
                    {
                        "en": "Fat chance of him helping you!",
                        "vi": "Cơ hội béo bở để anh ấy giúp bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small chance of being successful if a great effort is made",
                    "vi": "cơ hội thành công nhỏ nếu nỗ lực lớn"
                },
                "examples": [
                    {
                        "en": "We still have a fighting chance of beating them and winning the Cup.",
                        "vi": "Chúng tôi vẫn còn cơ hội chiến đấu để đánh bại họ và giành Cúp."
                    },
                    {
                        "en": "If you win this round then you still have a fighting chance.",
                        "vi": "Nếu bạn thắng vòng này thì bạn vẫn còn cơ hội chiến đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody/something some opportunity to do something",
                    "vi": "để cho ai đó / cái gì đó một số cơ hội để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "That dog will give you a nasty bite, given half a chance.",
                        "vi": "Con chó đó sẽ cắn bạn một cách khó chịu, nếu có một nửa cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be equally likely to do or not do something",
                    "vi": "có khả năng làm hoặc không làm điều gì đó như nhau"
                },
                "examples": [
                    {
                        "en": "She has more than an even chance of winning tomorrow.",
                        "vi": "Cô ấy có nhiều hơn cơ hội chiến thắng vào ngày mai."
                    },
                    {
                        "en": "There’s an even chance that the jury will find him guilty.",
                        "vi": "Thậm chí có khả năng bồi thẩm đoàn sẽ kết tội anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is no possibility",
                    "vi": "không có khả năng"
                },
                "examples": [
                    {
                        "en": "‘Do you think he'll do it?’ ‘No chance.’",
                        "vi": "Bạn có nghĩ rằng anh ấy sẽ làm điều đó?' 'Không có cơ hội.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "He hasn't a dog's chance of passing the exam.",
                        "vi": "Nó không có cơ hội vượt qua kỳ thi của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "There isn't a snowball's chance in hell that I'll wear that thing!",
                        "vi": "Không có chuyện quả cầu tuyết mà tôi sẽ mặc thứ đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "because of the possibility of something happening, although it is unlikely",
                    "vi": "vì khả năng xảy ra điều gì đó, mặc dù nó không chắc"
                },
                "examples": [
                    {
                        "en": "I didn't think you'd be at home but I just called by on the off chance.",
                        "vi": "Tôi không nghĩ rằng bạn đang ở nhà nhưng tôi chỉ gọi điện khi có cơ hội."
                    },
                    {
                        "en": "She scanned the crowd on the off chance of seeing someone she knew.",
                        "vi": "Cô lướt qua đám đông nếu không có cơ hội nhìn thấy một người mà cô biết."
                    },
                    {
                        "en": "I called in at the office on the off chance that you would still be there.",
                        "vi": "Tôi đã gọi đến văn phòng nếu bạn vẫn còn ở đó."
                    },
                    {
                        "en": "I rang the company just on the off chance that they might have a vacancy.",
                        "vi": "Tôi gọi điện cho công ty chỉ khi có cơ hội rằng họ có thể có một vị trí tuyển dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a reasonable chance of success",
                    "vi": "một cơ hội thành công hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have the possibility of succeeding or achieving something",
                    "vi": "có khả năng thành công hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The driver didn't stand a chance of stopping in time.",
                        "vi": "Người lái xe không có cơ hội dừng lại kịp thời."
                    },
                    {
                        "en": "He doesn't stand a chance of winning against such an experienced player.",
                        "vi": "Anh ấy không có cơ hội chiến thắng trước một cầu thủ giàu kinh nghiệm như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to do something, knowing that it might be the wrong choice",
                    "vi": "quyết định làm điều gì đó, biết rằng đó có thể là lựa chọn sai lầm"
                },
                "examples": [
                    {
                        "en": "We took a chance on the weather and planned to have the party outside.",
                        "vi": "Chúng tôi đã nắm bắt thời tiết và dự định tổ chức bữa tiệc bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk or to use the opportunities that you have and hope that things will happen in the way that you want",
                    "vi": "chấp nhận rủi ro hoặc sử dụng các cơ hội mà bạn có và hy vọng rằng mọi thứ sẽ xảy ra theo cách bạn muốn"
                },
                "examples": [
                    {
                        "en": "He took his chances and jumped into the water.",
                        "vi": "Anh chớp lấy cơ hội của mình và nhảy xuống nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the hope of using a particular situation in order to gain some advantage for yourself",
                    "vi": "với hy vọng sử dụng một tình huống cụ thể để đạt được một số lợi thế cho bản thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c5fb4cdb35d4c62b26e4c435a91b531",
        "word": "emergency",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈmɜːdʒənsi/",
            "us": "/ɪˈmɜːrdʒənsi/"
        },
        "nearby": [
            {
                "word": "emerge",
                "pos": "verb"
            },
            {
                "word": "emergence",
                "pos": "noun"
            },
            {
                "word": "emergency",
                "pos": "noun"
            },
            {
                "word": "emergency brake",
                "pos": "noun"
            },
            {
                "word": "emergency room",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden serious and dangerous event or situation that needs immediate action to deal with it",
                    "vi": "một sự kiện hoặc tình huống nghiêm trọng và nguy hiểm đột ngột cần hành động ngay lập tức để giải quyết nó"
                },
                "examples": [
                    {
                        "en": "This is a medical emergency needing urgent treatment with antibiotics.",
                        "vi": "Đây là một trường hợp cấp cứu y tế cần được điều trị khẩn cấp bằng kháng sinh."
                    },
                    {
                        "en": "The government has declared a state of emergency following the earthquake.",
                        "vi": "Chính phủ đã ban bố tình trạng khẩn cấp sau trận động đất."
                    },
                    {
                        "en": "In times of national emergency, the usual rules may not apply.",
                        "vi": "Trong trường hợp khẩn cấp quốc gia, các quy tắc thông thường có thể không được áp dụng."
                    },
                    {
                        "en": "in an emergency This door should only be used in an emergency.",
                        "vi": "trong trường hợp khẩn cấp Cửa này chỉ được sử dụng trong trường hợp khẩn cấp."
                    },
                    {
                        "en": "for emergencies I always have some extra cash with me for emergencies.",
                        "vi": "cho những trường hợp khẩn cấp, tôi luôn mang theo một số tiền mặt dự phòng cho những trường hợp khẩn cấp."
                    },
                    {
                        "en": "the emergency exit (= to be used in an emergency)",
                        "vi": "lối thoát hiểm (= được sử dụng trong trường hợp khẩn cấp)"
                    },
                    {
                        "en": "The pilot made an emergency landing in a field.",
                        "vi": "Phi công đã hạ cánh khẩn cấp xuống một cánh đồng."
                    },
                    {
                        "en": "The emergency response team was on the scene within eight minutes.",
                        "vi": "Đội phản ứng khẩn cấp đã có mặt tại hiện trường trong vòng tám phút."
                    },
                    {
                        "en": "The government has been granted emergency powers (= to deal with an emergency).",
                        "vi": "Chính phủ đã được cấp quyền hạn khẩn cấp (= để đối phó với trường hợp khẩn cấp)."
                    },
                    {
                        "en": "The purpose of these drills is to be prepared in the case of an emergency.",
                        "vi": "Mục đích của các cuộc tập trận này là để chuẩn bị trong trường hợp khẩn cấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "76f19eaa6cc941fa9798f1eb6d5e89a9",
        "word": "alert",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈlɜːt/",
            "us": "/əˈlɜːrt/"
        },
        "nearby": [
            {
                "word": "alehouse",
                "pos": "noun"
            },
            {
                "word": "alert",
                "pos": "verb"
            },
            {
                "word": "alert",
                "pos": "noun"
            },
            {
                "word": "alert",
                "pos": "adjective"
            },
            {
                "word": "alertly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which people are watching for danger and ready to deal with it",
                    "vi": "một tình huống mà mọi người đang đề phòng nguy hiểm và sẵn sàng đối phó với nó"
                },
                "examples": [
                    {
                        "en": "on the alert (for something) Police are warning the public to be on the alert for suspicious packages.",
                        "vi": "cảnh báo (vì điều gì đó) Cảnh sát đang cảnh báo công chúng cảnh giác với các gói đáng ngờ."
                    },
                    {
                        "en": "on alert More than 5 000 troops have been placed on (full) alert.",
                        "vi": "trong tình trạng báo động Hơn 5000 quân đã được đặt trong tình trạng báo động (đầy đủ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a warning of danger or of a problem",
                    "vi": "một cảnh báo nguy hiểm hoặc một vấn đề"
                },
                "examples": [
                    {
                        "en": "a bomb/fire alert",
                        "vi": "cảnh báo bom / cháy"
                    }
                ]
            }
        ]
    },
    {
        "id": "cb3a74a930b14f66b7df0756ff087e94",
        "word": "dare",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/deə(r)/",
            "us": "/der/"
        },
        "nearby": [
            {
                "word": "the Dardanelles",
                "pos": ""
            },
            {
                "word": "dare",
                "pos": "verb"
            },
            {
                "word": "dare",
                "pos": "noun"
            },
            {
                "word": "daredevil",
                "pos": "noun"
            },
            {
                "word": "daredevil",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something dangerous, difficult or embarrassing that you try to persuade somebody to do, to see if they will do it",
                    "vi": "điều gì đó nguy hiểm, khó khăn hoặc xấu hổ mà bạn cố gắng thuyết phục ai đó làm, để xem liệu họ có làm điều đó không"
                },
                "examples": [
                    {
                        "en": "for a dare (British English) He climbed onto the roof for a dare.",
                        "vi": "vì một sự dám (tiếng Anh Anh) Anh ấy đã trèo lên mái nhà vì một sự dám."
                    },
                    {
                        "en": "on a dare (North American English) She learned to fly on a dare.",
                        "vi": "khi dám (tiếng Anh Bắc Mỹ) Cô ấy đã học cách bay khi dám."
                    }
                ]
            }
        ]
    },
    {
        "id": "c70838de85804126a17eea893801fe19",
        "word": "distress",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstres/",
            "us": "/dɪˈstres/"
        },
        "nearby": [
            {
                "word": "distractor",
                "pos": "noun"
            },
            {
                "word": "distraught",
                "pos": "adjective"
            },
            {
                "word": "distress",
                "pos": "noun"
            },
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great worry or unhappiness; great mental pain",
                    "vi": "cảm giác vô cùng lo lắng hoặc không vui; nỗi đau tinh thần lớn"
                },
                "examples": [
                    {
                        "en": "The newspaper article caused the actor considerable distress.",
                        "vi": "Bài báo trên báo đã khiến nam diễn viên xót xa đáng kể."
                    },
                    {
                        "en": "She sensed his deep emotional distress.",
                        "vi": "Cô cảm nhận được tình cảm sâu sắc của anh."
                    },
                    {
                        "en": "in distress She was obviously in distress after the attack.",
                        "vi": "gặp nạn Cô ấy rõ ràng đã gặp nạn sau cuộc tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "severe problems caused by not having enough money, food, etc.",
                    "vi": "các vấn đề nghiêm trọng do không có đủ tiền, thức ăn, v.v."
                },
                "examples": [
                    {
                        "en": "economic/financial distress",
                        "vi": "khó khăn kinh tế / tài chính"
                    },
                    {
                        "en": "The charity aims to relieve poverty and distress caused by natural disasters.",
                        "vi": "Tổ chức từ thiện nhằm giảm bớt đói nghèo và khốn khó do thiên tai gây ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a ship, plane, etc. is in danger or difficulty and needs help",
                    "vi": "một tình huống trong đó một con tàu, máy bay, v.v. đang gặp nguy hiểm hoặc khó khăn và cần được giúp đỡ"
                },
                "examples": [
                    {
                        "en": "a distress signal (= a message asking for help)",
                        "vi": "một tín hiệu cấp cứu (= một thông báo yêu cầu giúp đỡ)"
                    },
                    {
                        "en": "in distress It is a rule of the sea to help another boat in distress.",
                        "vi": "gặp nạn Đó là một quy luật của biển cả để giúp đỡ một con thuyền khác gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of physical pain and effort, especially difficulty in breathing",
                    "vi": "trạng thái đau đớn về thể chất và gắng sức, đặc biệt là khó thở"
                },
                "examples": [
                    {
                        "en": "The patient was suffering serious respiratory distress.",
                        "vi": "Bệnh nhân suy hô hấp nặng."
                    },
                    {
                        "en": "in distress The baby was clearly in distress.",
                        "vi": "gặp nạn Em bé rõ ràng đang gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who needs help",
                    "vi": "một người phụ nữ cần giúp đỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5569d103931d4fcab1b313f682dd0ecc",
        "word": "gamble",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡæmbl/",
            "us": "/ˈɡæmbl/"
        },
        "nearby": [
            {
                "word": "gambit",
                "pos": "noun"
            },
            {
                "word": "gamble",
                "pos": "verb"
            },
            {
                "word": "gamble",
                "pos": "noun"
            },
            {
                "word": "gamble away",
                "pos": "phrasal verb"
            },
            {
                "word": "gamble on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action that you take when you know there is a risk but when you hope that the result will be a success",
                    "vi": "một hành động mà bạn thực hiện khi bạn biết có rủi ro nhưng khi bạn hy vọng rằng kết quả sẽ thành công"
                },
                "examples": [
                    {
                        "en": "She knew she was taking a gamble but decided it was worth it.",
                        "vi": "Cô biết mình đang tham gia một canh bạc nhưng quyết định điều đó là xứng đáng."
                    },
                    {
                        "en": "They invested money in the company right at the start and the gamble paid off (= brought them success).",
                        "vi": "Họ đã đầu tư tiền vào công ty ngay từ đầu và canh bạc đã được đền đáp (= đã mang lại thành công cho họ)."
                    },
                    {
                        "en": "It was the biggest gamble of his political career.",
                        "vi": "Đó là canh bạc lớn nhất trong sự nghiệp chính trị của ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "6194d05c0f7045a2a94b7db9968c4ddf",
        "word": "madness",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmædnəs/",
            "us": "/ˈmædnəs/"
        },
        "nearby": [
            {
                "word": "madly",
                "pos": "adverb"
            },
            {
                "word": "madman",
                "pos": "noun"
            },
            {
                "word": "madness",
                "pos": "noun"
            },
            {
                "word": "madonna",
                "pos": "noun"
            },
            {
                "word": "madras",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of having a serious mental illness",
                    "vi": "tình trạng mắc bệnh tâm thần nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "There may be a link between madness and creativity.",
                        "vi": "Có thể có mối liên hệ giữa sự điên rồ và sự sáng tạo."
                    },
                    {
                        "en": "They say that talking to yourself is the first sign of madness!",
                        "vi": "Họ nói rằng tự nói chuyện với chính mình là dấu hiệu đầu tiên của sự điên rồ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "crazy or stupid behaviour that could be dangerous",
                    "vi": "hành vi điên rồ hoặc ngu ngốc có thể nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It would be sheer madness to trust a man like that.",
                        "vi": "Thật là điên rồ nếu tin tưởng một người đàn ông như thế."
                    },
                    {
                        "en": "In a moment of madness she had agreed to go out with him.",
                        "vi": "Trong một lúc điên cuồng cô đã đồng ý hẹn hò với anh."
                    },
                    {
                        "en": "The real victim in this collective madness is our society.",
                        "vi": "Nạn nhân thực sự trong cơn điên loạn tập thể này là xã hội của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is a reason for somebody’s behaviour and it is not as strange or as stupid as it seems",
                    "vi": "có lý do cho hành vi của ai đó và nó không kỳ lạ hay ngu ngốc như nó có vẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6cbb3de7504d4bbc9e15abf7a32c18e8",
        "word": "menace",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmenəs/",
            "us": "/ˈmenəs/"
        },
        "nearby": [
            {
                "word": "memsahib",
                "pos": "noun"
            },
            {
                "word": "men",
                "pos": "noun"
            },
            {
                "word": "menace",
                "pos": "noun"
            },
            {
                "word": "menace",
                "pos": "verb"
            },
            {
                "word": "menacing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that causes, or may cause, serious damage, harm or danger",
                    "vi": "một người hoặc vật gây ra hoặc có thể gây ra thiệt hại nghiêm trọng, tổn hại hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "a new initiative aimed at beating the menace of illegal drugs",
                        "vi": "một sáng kiến mới nhằm đánh bại sự đe dọa của ma túy bất hợp pháp"
                    },
                    {
                        "en": "The communists remain a potential menace to the stability of the government.",
                        "vi": "Những người cộng sản vẫn là mối đe dọa tiềm tàng đối với sự ổn định của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an atmosphere that makes you feel threatened or frightened",
                    "vi": "một bầu không khí khiến bạn cảm thấy bị đe dọa hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "a sense/an air/a hint of menace in his voice",
                        "vi": "một cảm giác / một không khí / một chút đe dọa trong giọng nói của anh ta"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is annoying or causes trouble",
                    "vi": "một người hoặc vật gây phiền nhiễu hoặc gây rắc rối"
                },
                "examples": [
                    {
                        "en": "They have become a public menace.",
                        "vi": "Họ đã trở thành một mối đe dọa công khai."
                    }
                ]
            },
            {
                "define": {
                    "en": "threats that somebody will cause harm if they do not get what they are asking for",
                    "vi": "mối đe dọa mà ai đó sẽ gây ra tổn hại nếu họ không nhận được những gì họ đang yêu cầu"
                },
                "examples": [
                    {
                        "en": "with menaces to demand money with menaces",
                        "vi": "với menaces để đòi tiền với menaces"
                    }
                ]
            }
        ]
    },
    {
        "id": "be54c78a934a4700a98003a328c28ff1",
        "word": "a leap in the dark",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/liːp/",
            "us": "/liːp/"
        },
        "nearby": [
            {
                "word": "lean towards",
                "pos": "phrasal verb"
            },
            {
                "word": "leap",
                "pos": "verb"
            },
            {
                "word": "leap",
                "pos": "noun"
            },
            {
                "word": "leap at",
                "pos": "phrasal verb"
            },
            {
                "word": "leapfrog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long or high jump",
                    "vi": "nhảy xa hoặc nhảy cao"
                },
                "examples": [
                    {
                        "en": "a leap of six metres",
                        "vi": "một bước nhảy vọt sáu mét"
                    },
                    {
                        "en": "She took a flying leap and landed on the other side of the stream.",
                        "vi": "Cô ấy bay nhảy và hạ cánh xuống phía bên kia con suối."
                    },
                    {
                        "en": "He made a flying leap at the ball.",
                        "vi": "Anh ấy đã thực hiện một bước bay nhảy với quả bóng."
                    },
                    {
                        "en": "(figurative) His heart gave a sudden leap when he saw her.",
                        "vi": "(nghĩa bóng) Trái tim anh đột ngột nhảy lên khi nhìn thấy cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden large increase in something",
                    "vi": "sự gia tăng đột ngột của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a leap in profits",
                        "vi": "một bước nhảy vọt về lợi nhuận"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden change from one thing to another; very fast progress with something",
                    "vi": "một sự thay đổi đột ngột từ điều này sang điều khác; tiến bộ rất nhanh với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Few people successfully make the leap from television to the movies.",
                        "vi": "Rất ít người thực hiện thành công bước nhảy vọt từ truyền hình sang điện ảnh."
                    },
                    {
                        "en": "a great leap into the unknown",
                        "vi": "một bước nhảy vọt vào điều chưa biết"
                    },
                    {
                        "en": "They've made a great leap forward with their building in the last few years.",
                        "vi": "Họ đã tạo ra một bước tiến lớn với tòa nhà của họ trong vài năm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quickly; in large amounts",
                    "vi": "rất nhanh; với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "Her health has improved in leaps and bounds.",
                        "vi": "Sức khỏe của cô đã được cải thiện nhanh chóng."
                    },
                    {
                        "en": "His technique has come on in leaps and bounds this season.",
                        "vi": "Kỹ thuật của anh ấy đã phát triển vượt bậc trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action or a risk that you take without knowing anything about the activity or what the result will be",
                    "vi": "một hành động hoặc một rủi ro mà bạn thực hiện mà không biết bất cứ điều gì về hoạt động hoặc kết quả sẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "I didn’t know what the new job would be like—I just took a leap in the dark.",
                        "vi": "Tôi không biết công việc mới sẽ như thế nào — tôi chỉ có một bước nhảy vọt trong bóng tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a belief in something that is not known or has not been done before",
                    "vi": "niềm tin vào điều gì đó chưa được biết đến hoặc chưa được thực hiện trước đây"
                },
                "examples": [
                    {
                        "en": "These reforms are totally untested and will require a leap of faith on the part of teachers.",
                        "vi": "Những cải cách này hoàn toàn chưa được thử nghiệm và sẽ đòi hỏi một bước nhảy vọt về niềm tin từ phía các giáo viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "85c4ef6efac84b9284e85c2fa8f30b0c",
        "word": "an accident/a disaster waiting to happen",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/weɪt/",
            "us": "/weɪt/"
        },
        "nearby": [
            {
                "word": "waist-high",
                "pos": "adjective, adverb"
            },
            {
                "word": "waistline",
                "pos": "noun"
            },
            {
                "word": "wait",
                "pos": "verb"
            },
            {
                "word": "wait",
                "pos": "noun"
            },
            {
                "word": "wait about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay where you are or delay doing something until somebody/something comes or something happens",
                    "vi": "ở lại vị trí của bạn hoặc trì hoãn làm điều gì đó cho đến khi ai đó / điều gì đó đến hoặc điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "She rang the bell and waited.",
                        "vi": "Cô bấm chuông và chờ đợi."
                    },
                    {
                        "en": "The President agreed to speak to the waiting journalists.",
                        "vi": "Tổng thống đã đồng ý nói chuyện với các nhà báo đang chờ đợi."
                    },
                    {
                        "en": "They waited patiently while I got ready.",
                        "vi": "Họ kiên nhẫn chờ đợi trong khi tôi đã sẵn sàng."
                    },
                    {
                        "en": "I waited and waited, but the bus didn't come.",
                        "vi": "Tôi đợi và đợi, nhưng xe buýt không đến."
                    },
                    {
                        "en": "wait + adv./prep. Have you been waiting long?",
                        "vi": "chờ đợi + adv./prep. Bạn đã đợi lâu chưa?"
                    },
                    {
                        "en": "to wait (for) hours/days/weeks/months/years",
                        "vi": "chờ (trong) giờ / ngày / tuần / tháng / năm"
                    },
                    {
                        "en": "I’ve been waiting (for) twenty minutes.",
                        "vi": "Tôi đã đợi (trong) hai mươi phút."
                    },
                    {
                        "en": "I'll wait outside until the meeting's over.",
                        "vi": "Tôi sẽ đợi bên ngoài cho đến khi cuộc họp kết thúc."
                    },
                    {
                        "en": "(especially North American English) I had to wait in line at the bank.",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) Tôi đã phải xếp hàng chờ tại ngân hàng."
                    },
                    {
                        "en": "wait for somebody/something Wait for me!",
                        "vi": "đợi ai đó / cái gì đó Chờ tôi!"
                    },
                    {
                        "en": "to wait for a bus",
                        "vi": "đợi xe buýt"
                    },
                    {
                        "en": "I'm still waiting for the results of my blood test.",
                        "vi": "Tôi vẫn đang chờ kết quả xét nghiệm máu của mình."
                    },
                    {
                        "en": "He smiled, waiting for an answer to his question.",
                        "vi": "Anh mỉm cười, chờ đợi câu trả lời cho câu hỏi của mình."
                    },
                    {
                        "en": "wait for somebody/something to do something We're waiting for the rain to stop before we go out.",
                        "vi": "đợi ai đó / cái gì đó làm gì đó Chúng tôi đang đợi cơn mưa tạnh trước khi chúng tôi đi ra ngoài."
                    },
                    {
                        "en": "wait to do something Hurry up! We're waiting to go.",
                        "vi": "chờ để làm gì đó Nhanh lên! Chúng tôi đang đợi để đi."
                    },
                    {
                        "en": "We'll have to wait until it stops raining.",
                        "vi": "Chúng ta sẽ phải đợi cho đến khi trời tạnh mưa."
                    },
                    {
                        "en": "wait your turn You'll just have to wait your turn (= wait until your turn comes).",
                        "vi": "đợi đến lượt của bạn Bạn sẽ chỉ phải đợi đến lượt của mình (= đợi cho đến khi đến lượt của bạn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hope or watch for something to happen, especially for a long time",
                    "vi": "để hy vọng hoặc theo dõi điều gì đó sẽ xảy ra, đặc biệt là trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "wait for something Leeds United had waited for success for eighteen years.",
                        "vi": "chờ đợi điều mà Leeds United đã chờ đợi để đạt được thành công trong mười tám năm."
                    },
                    {
                        "en": "This is just the opportunity I've been waiting for.",
                        "vi": "Đây chỉ là cơ hội mà tôi đã chờ đợi."
                    },
                    {
                        "en": "They are waiting for the right moment to make their move.",
                        "vi": "Họ đang chờ đợi thời điểm thích hợp để thực hiện hành động của mình."
                    },
                    {
                        "en": "wait for somebody/something to do something He's waiting for me to make a mistake.",
                        "vi": "đợi ai đó / điều gì đó làm điều gì đó Anh ấy đang đợi tôi mắc lỗi."
                    },
                    {
                        "en": "wait to do something I've been waiting a long time to say that to her.",
                        "vi": "đợi để làm điều gì đó Tôi đã chờ đợi từ lâu để nói điều đó với cô ấy."
                    },
                    {
                        "en": "wait your chance I waited my chance and slipped out when no one was looking.",
                        "vi": "Hãy chờ đợi cơ hội của bạn Tôi đã chờ đợi cơ hội của mình và trượt ra ngoài khi không có ai nhìn."
                    },
                    {
                        "en": "We simply cannot afford to wait any longer.",
                        "vi": "Chúng tôi chỉ đơn giản là không thể chờ đợi lâu hơn nữa."
                    },
                    {
                        "en": "I waited with bated breath for what would happen next.",
                        "vi": "Tôi chờ đợi với hơi thở dồn dập cho những gì sẽ xảy ra tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be ready for somebody to have or use",
                    "vi": "sẵn sàng cho ai đó có hoặc sử dụng"
                },
                "examples": [
                    {
                        "en": "Your car is waiting, sir.",
                        "vi": "Xe của ông đang đợi, thưa ông."
                    },
                    {
                        "en": "When we arrived on the platform, there was a train waiting.",
                        "vi": "Khi chúng tôi đến sân ga, có một chuyến tàu đang đợi."
                    },
                    {
                        "en": "wait for somebody There's a letter waiting for you at home.",
                        "vi": "đợi ai đó Có một lá thư đang đợi bạn ở nhà."
                    },
                    {
                        "en": "There was a nice surprise waiting for me when I got back.",
                        "vi": "Có một điều bất ngờ thú vị đang chờ đợi tôi khi tôi quay lại."
                    },
                    {
                        "en": "wait to do something The hotel had a taxi waiting to collect us.",
                        "vi": "đợi để làm gì đó. Khách sạn đã có một chiếc taxi chờ đón chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be left to be dealt with at a later time because immediate action is not needed",
                    "vi": "sẽ được xử lý sau vì không cần hành động ngay lập tức"
                },
                "examples": [
                    {
                        "en": "I've got some calls to make but they can wait until tomorrow.",
                        "vi": "Tôi có một số cuộc gọi phải thực hiện nhưng họ có thể đợi đến ngày mai."
                    },
                    {
                        "en": "I'm afraid this can't wait. It's very important.",
                        "vi": "Tôi e rằng điều này không thể chờ đợi. Nó rất quan trọng."
                    },
                    {
                        "en": "We've just spent a fortune on a new roof, so the new car is going to have to wait.",
                        "vi": "Chúng tôi vừa chi một gia tài cho một mái nhà mới, vì vậy chiếc xe mới sẽ phải chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave",
                    "vi": "một vật hoặc người rất có thể gây ra nguy hiểm hoặc vấn đề trong tương lai vì tình trạng của nó hoặc cách họ cư xử"
                },
                "examples": [
                    {
                        "en": "Any one of these nuclear plants may be a disaster waiting to happen.",
                        "vi": "Bất kỳ một trong những nhà máy hạt nhân này đều có thể là một thảm họa đang chực chờ xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "ready to take over a particular job or be used in a particular situation when needed",
                    "vi": "sẵn sàng đảm nhận một công việc cụ thể hoặc được sử dụng trong một tình huống cụ thể khi cần thiết"
                },
                "examples": [
                    {
                        "en": "She was aware of a whole host of ambitious young managers waiting in the wings.",
                        "vi": "Cô nhận thức được rằng có rất nhiều nhà quản lý trẻ đầy tham vọng đang chờ đợi trong cánh."
                    },
                    {
                        "en": "There's a wealth of talent waiting in the wings of British theatre.",
                        "vi": "Có rất nhiều tài năng đang chờ đợi trong cánh của nhà hát Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are emphasizing that somebody is very excited about something or keen to do it",
                    "vi": "được sử dụng khi bạn nhấn mạnh rằng ai đó rất vui mừng về điều gì đó hoặc muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "The children can't wait for Christmas to come.",
                        "vi": "Các em nhỏ không khỏi háo hức chờ đón Giáng sinh đến."
                    },
                    {
                        "en": "I can hardly wait to see him again.",
                        "vi": "Tôi khó có thể chờ đợi để gặp lại anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody have to wait or be delayed, especially because you arrive late",
                    "vi": "khiến ai đó phải đợi hoặc bị trì hoãn, đặc biệt là vì bạn đến muộn"
                },
                "examples": [
                    {
                        "en": "I'm sorry to have kept you waiting.",
                        "vi": "Tôi xin lỗi vì đã để bạn chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wait for a situation to become clear or certain",
                    "vi": "để chờ một tình huống trở nên rõ ràng hoặc chắc chắn"
                },
                "examples": [
                    {
                        "en": "He waited for the dust to settle after the election before making any new decisions.",
                        "vi": "Anh ấy đợi cho cát bụi lắng xuống sau cuộc bầu cử trước khi đưa ra bất kỳ quyết định mới nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that they must be patient and wait to find out about something later",
                    "vi": "từng nói với ai đó rằng họ phải kiên nhẫn và chờ đợi để tìm hiểu về điều gì đó sau"
                },
                "examples": [
                    {
                        "en": "We'll just have to wait and see—there's nothing we can do at the moment.",
                        "vi": "Chúng tôi sẽ chỉ cần chờ xem — không thể làm gì vào lúc này."
                    },
                    {
                        "en": "a wait-and-see policy",
                        "vi": "chính sách chờ và xem"
                    },
                    {
                        "en": "‘Where are we going?’ ‘Wait and see!’",
                        "vi": "Chúng ta đang đi đâu vậy?' 'Chờ và xem!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to serve food to people, for example at a formal meal",
                    "vi": "để phục vụ thức ăn cho mọi người, chẳng hạn như trong một bữa ăn chính thức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are about to tell somebody something that is surprising",
                    "vi": "đã từng nói rằng bạn sắp nói với ai đó điều gì đó gây ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "They're off on a trip, to—wait for it—the Maldives!",
                        "vi": "Họ đang có một chuyến đi, đến — chờ đợi — Maldives!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to start doing something yet, but to wait until you tell them",
                    "vi": "thường nói với ai đó rằng đừng bắt đầu làm điều gì đó, nhưng hãy đợi cho đến khi bạn nói với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to wait for a short time",
                    "vi": "đợi một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Can you wait a second while I make a call?",
                        "vi": "Bạn có thể đợi một chút trong khi tôi gọi điện không?"
                    },
                    {
                        "en": "Hey! Wait a minute! I'll come with you!",
                        "vi": "Này! Đợi tí! Tôi sẽ đi với bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you have just noticed or remembered something, or had a sudden idea",
                    "vi": "được sử dụng khi bạn vừa mới nhận ra hoặc nhớ ra điều gì đó, hoặc có một ý tưởng đột ngột"
                },
                "examples": [
                    {
                        "en": "Wait a minute—this isn't the right key.",
                        "vi": "Chờ một chút — đây không phải là chìa khóa phù hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of somebody’s needs so well that they do not have to do anything for themselves",
                    "vi": "chăm sóc nhu cầu của ai đó thật tốt để họ không phải làm bất cứ điều gì cho bản thân"
                },
                "examples": [
                    {
                        "en": "He seems to expect me to wait on him hand and foot.",
                        "vi": "Anh ta dường như mong đợi tôi chờ đợi anh ta bằng tay và chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work serving food to people in a restaurant",
                    "vi": "làm việc phục vụ đồ ăn cho mọi người trong nhà hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show that you are very excited about telling or showing something to somebody",
                    "vi": "được sử dụng để cho thấy rằng bạn rất hào hứng với việc kể hoặc cho ai đó xem điều gì đó"
                },
                "examples": [
                    {
                        "en": "Wait till you see what I've found!",
                        "vi": "Chờ cho đến khi bạn thấy những gì tôi đã tìm thấy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to threaten to punish somebody or do something bad to them",
                    "vi": "từng đe dọa trừng phạt ai đó hoặc làm điều gì đó xấu với họ"
                },
                "examples": [
                    {
                        "en": "Wait till I get my hands on him!",
                        "vi": "Chờ cho đến khi tôi chạm tay vào anh ấy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that you should all start doing what you have been discussing",
                    "vi": "được sử dụng để gợi ý rằng tất cả các bạn nên bắt đầu làm những gì bạn đã thảo luận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody to do something now rather than later",
                    "vi": "được sử dụng để nói với ai đó làm điều gì đó bây giờ thay vì sau này"
                },
                "examples": [
                    {
                        "en": "If the car needs cleaning, what are you waiting for?",
                        "vi": "Nếu xe cần làm sạch, bạn còn chần chừ gì nữa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize a threat, warning or promise",
                    "vi": "được sử dụng để nhấn mạnh một mối đe dọa, cảnh báo hoặc hứa hẹn"
                },
                "examples": [
                    {
                        "en": "I'll be famous one day, just you wait!",
                        "vi": "Một ngày nào đó tôi sẽ nổi tiếng, chỉ cần bạn chờ đợi!"
                    }
                ]
            }
        ]
    },
    {
        "id": "94d32290afe74adeb613d8514f70c843",
        "word": "cancer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænsə(r)/",
            "us": "/ˈkænsər/"
        },
        "nearby": [
            {
                "word": "cancellation",
                "pos": "noun"
            },
            {
                "word": "cancel out",
                "pos": "phrasal verb"
            },
            {
                "word": "cancer",
                "pos": "noun"
            },
            {
                "word": "Cancer",
                "pos": "noun"
            },
            {
                "word": "Cancerian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a serious disease in which growths of cells, also called cancers, form in the body and kill normal body cells. The disease often causes death.",
                    "vi": "một căn bệnh nghiêm trọng trong đó sự phát triển của các tế bào, còn được gọi là ung thư, hình thành trong cơ thể và giết chết các tế bào bình thường của cơ thể. Bệnh thường gây tử vong."
                },
                "examples": [
                    {
                        "en": "breast/lung cancer",
                        "vi": "ung thư vú / phổi"
                    },
                    {
                        "en": "Most skin cancers are completely curable.",
                        "vi": "Hầu hết các bệnh ung thư da đều có thể chữa khỏi hoàn toàn."
                    },
                    {
                        "en": "cancer of something cancer of the colon/cervix",
                        "vi": "ung thư của một cái gì đó ung thư ruột kết / cổ tử cung"
                    },
                    {
                        "en": "The cancer has spread to his stomach.",
                        "vi": "Căn bệnh ung thư đã di căn đến dạ dày của anh ấy."
                    },
                    {
                        "en": "Smokers face an increased risk of developing lung cancer.",
                        "vi": "Những người hút thuốc lá phải đối mặt với nguy cơ phát triển ung thư phổi."
                    },
                    {
                        "en": "to detect/diagnose/treat/cure cancer",
                        "vi": "để phát hiện / chẩn đoán / điều trị / chữa khỏi bệnh ung thư"
                    },
                    {
                        "en": "The drug can lower the risk of breast cancer.",
                        "vi": "Thuốc có thể làm giảm nguy cơ ung thư vú."
                    },
                    {
                        "en": "cancer patients/survivors",
                        "vi": "bệnh nhân ung thư / người sống sót"
                    },
                    {
                        "en": "cancer research",
                        "vi": "nghiên cứu ung thư"
                    },
                    {
                        "en": "cancer screening/treatment/prevention/risk",
                        "vi": "tầm soát / điều trị / phòng ngừa / nguy cơ ung thư"
                    }
                ]
            },
            {
                "define": {
                    "en": "an evil or dangerous thing that spreads quickly",
                    "vi": "một thứ xấu xa hoặc nguy hiểm lây lan nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Violence is a cancer in our society.",
                        "vi": "Bạo lực là một căn bệnh ung thư trong xã hội của chúng ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "0fefcae5605e46cba288bc7f8deaa329",
        "word": "canker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæŋkə(r)/",
            "us": "/ˈkæŋkər/"
        },
        "nearby": [
            {
                "word": "caning",
                "pos": "noun"
            },
            {
                "word": "canister",
                "pos": "noun"
            },
            {
                "word": "canker",
                "pos": "noun"
            },
            {
                "word": "canker sore",
                "pos": "noun"
            },
            {
                "word": "cannabis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disease that destroys the wood of plants and trees",
                    "vi": "một loại bệnh phá hủy gỗ của cây cối và cây cối"
                },
                "examples": [
                    {
                        "en": "Cut out lesions on branches caused by canker.",
                        "vi": "Cắt bỏ các vết bệnh trên cành do bệnh xì mủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a damaged area in a plant or tree caused by disease or injury",
                    "vi": "một khu vực bị hư hại trên cây hoặc cây do bệnh tật hoặc thương tích"
                },
                "examples": [
                    {
                        "en": "Check trees for cankers.",
                        "vi": "Kiểm tra cây cho người ăn cắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small painful area in the mouth",
                    "vi": "một vùng đau nhỏ trong miệng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a disease that causes painful areas in the ears of animals, especially dogs and cats",
                    "vi": "một bệnh gây đau vùng tai của động vật, đặc biệt là chó và mèo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an evil or dangerous influence that spreads and affects people’s behaviour",
                    "vi": "ảnh hưởng xấu xa hoặc nguy hiểm lây lan và ảnh hưởng đến hành vi của mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "35c02d608c1d40279935c01555e25e27",
        "word": "caper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkeɪpə(r)/",
            "us": "/ˈkeɪpər/"
        },
        "nearby": [
            {
                "word": "caped",
                "pos": "adjective"
            },
            {
                "word": "the caped crusader",
                "pos": ""
            },
            {
                "word": "caper",
                "pos": "noun"
            },
            {
                "word": "caper",
                "pos": "verb"
            },
            {
                "word": "capercaillie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the small green flower bud of a Mediterranean bush, preserved in vinegar and used in preparing sauces and other dishes",
                    "vi": "nụ hoa xanh nhỏ của một bụi cây Địa Trung Hải, được bảo quản trong giấm và dùng để chế biến nước sốt và các món ăn khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an activity, especially one that is illegal or dangerous",
                    "vi": "một hoạt động, đặc biệt là một hoạt động bất hợp pháp hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "A call to the police should put an end to their little caper.",
                        "vi": "Một cuộc gọi cho cảnh sát sẽ chấm dứt tình trạng bạch hoa nhỏ của họ."
                    },
                    {
                        "en": "He’s involved in some sort of organized crime caper.",
                        "vi": "Anh ta tham gia vào một số loại caper tội phạm có tổ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "a humorous film that contains a lot of action",
                    "vi": "một bộ phim hài hước có nhiều pha hành động"
                },
                "examples": [
                    {
                        "en": "a British spy caper",
                        "vi": "một điệp viên người Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short jumping or dancing movement",
                    "vi": "một động tác nhảy hoặc nhảy ngắn"
                },
                "examples": [
                    {
                        "en": "He cut a little celebratory caper (= jumped or danced a few steps) in the middle of the road.",
                        "vi": "Anh ta cắt một cây bạch hoa ăn mừng nhỏ (= nhảy hoặc nhảy vài bước) ở giữa đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "7aae8d461172477baa33418e2cb1f11a",
        "word": "death trap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeθtræp/",
            "us": "/ˈdeθtræp/"
        },
        "nearby": [
            {
                "word": "death throes",
                "pos": "noun"
            },
            {
                "word": "death toll",
                "pos": "noun"
            },
            {
                "word": "death trap",
                "pos": "noun"
            },
            {
                "word": "Death Valley",
                "pos": ""
            },
            {
                "word": "death warrant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building, vehicle, etc. that is dangerous and could cause somebody’s death",
                    "vi": "một tòa nhà, phương tiện, v.v. nguy hiểm và có thể gây ra cái chết cho ai đó"
                },
                "examples": [
                    {
                        "en": "The cars blocking the exits could turn this place into a death trap.",
                        "vi": "Những chiếc xe chặn lối ra có thể biến nơi này thành một cái bẫy tử thần."
                    },
                    {
                        "en": "Oil slicks, overhead cables and pollution are all death traps for birds.",
                        "vi": "Dầu loang, dây cáp trên cao và ô nhiễm đều là những cái bẫy chết chóc đối với các loài chim."
                    }
                ]
            }
        ]
    },
    {
        "id": "c29d12158f944e71ac903bf4b108fc08",
        "word": "escapade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeskəpeɪd/",
            "us": "/ˈeskəpeɪd/"
        },
        "nearby": [
            {
                "word": "escalator",
                "pos": "noun"
            },
            {
                "word": "escalope",
                "pos": "noun"
            },
            {
                "word": "escapade",
                "pos": "noun"
            },
            {
                "word": "escape",
                "pos": "verb"
            },
            {
                "word": "escape",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an exciting adventure (often one that people think is dangerous or stupid)",
                    "vi": "một cuộc phiêu lưu thú vị (thường là một cuộc phiêu lưu mà mọi người nghĩ là nguy hiểm hoặc ngu ngốc)"
                },
                "examples": [
                    {
                        "en": "Isabel’s latest romantic escapade",
                        "vi": "Cuộc phiêu lưu lãng mạn mới nhất của Isabel"
                    },
                    {
                        "en": "The people who planned the escapade did not realize what they were getting involved in.",
                        "vi": "Những người lên kế hoạch cho cuộc vượt ngục không nhận ra họ đang tham gia vào việc gì."
                    }
                ]
            }
        ]
    },
    {
        "id": "72d18d0c8c074281bfbfc8e98e84eb8b",
        "word": "Frankenstein",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfræŋkənstaɪn/",
            "us": "/ˈfræŋkənstaɪn/"
        },
        "nearby": [
            {
                "word": "Frank",
                "pos": ""
            },
            {
                "word": "Frankenfood",
                "pos": "noun"
            },
            {
                "word": "Frankenstein",
                "pos": "noun"
            },
            {
                "word": "frankfurter",
                "pos": "noun"
            },
            {
                "word": "Felix Frankfurter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to talk about something that somebody creates or invents that goes out of control and becomes dangerous, often destroying the person who created it",
                    "vi": "được sử dụng để nói về một cái gì đó mà ai đó tạo ra hoặc phát minh ra ngoài tầm kiểm soát và trở nên nguy hiểm, thường tiêu diệt người đã tạo ra nó"
                },
                "examples": [
                    {
                        "en": "The organization has now become a Frankenstein monster beyond the control of the people who created it.",
                        "vi": "Tổ chức giờ đã trở thành một quái vật Frankenstein ngoài tầm kiểm soát của những người đã tạo ra nó."
                    },
                    {
                        "en": "If you were going to do a Frankenstein and put a swimmer together from scratch, you would build Michael Phelps.",
                        "vi": "Nếu bạn định đóng một Frankenstein và tập hợp một vận động viên bơi lội lại với nhau từ đầu, bạn sẽ xây dựng Michael Phelps."
                    },
                    {
                        "en": "Can genetic engineering shake off its Frankenstein image?",
                        "vi": "Liệu kỹ thuật di truyền có thể loại bỏ hình ảnh Frankenstein của nó không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "7846f0653af34609b8dd31cee2833e91",
        "word": "in a (tight) corner/spot",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːnə(r)/",
            "us": "/ˈkɔːrnər/"
        },
        "nearby": [
            {
                "word": "corned beef",
                "pos": "noun"
            },
            {
                "word": "cornelian",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "verb"
            },
            {
                "word": "cornerback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of something where two or more sides, lines or edges join",
                    "vi": "một phần của thứ gì đó có hai hoặc nhiều cạnh, đường hoặc cạnh nối với nhau"
                },
                "examples": [
                    {
                        "en": "the four corners of a square",
                        "vi": "bốn góc của một hình vuông"
                    },
                    {
                        "en": "I hit my knee on the corner of the table.",
                        "vi": "Tôi đập đầu gối vào góc bàn."
                    },
                    {
                        "en": "Write your address in the top right-hand corner of the letter.",
                        "vi": "Viết địa chỉ của bạn ở góc trên cùng bên phải của bức thư."
                    },
                    {
                        "en": "the left/right corner",
                        "vi": "góc trái / phải"
                    },
                    {
                        "en": "the north-west/north-east/south-east/south-west corner",
                        "vi": "góc tây bắc / đông bắc / nam đông / tây nam"
                    },
                    {
                        "en": "A smile lifted the corner of his mouth.",
                        "vi": "Một nụ cười nhếch lên khóe miệng."
                    },
                    {
                        "en": "in the corner of something a speck of dirt in the corner of her eye",
                        "vi": "trong góc của thứ gì đó có một đốm bẩn trong khóe mắt của cô ấy"
                    },
                    {
                        "en": "He scored with a shot into the bottom corner of the goal.",
                        "vi": "Anh ấy đã ghi bàn bằng một cú sút vào góc thấp khung thành."
                    },
                    {
                        "en": "She tucked the ball into the corner of the net.",
                        "vi": "Cô ấy đệm bóng vào góc lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the number of corners mentioned; involving the number of groups mentioned",
                    "vi": "với số lượng các góc đã nêu; liên quan đến số lượng các nhóm được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-cornered hat",
                        "vi": "một chiếc mũ ba góc"
                    },
                    {
                        "en": "a three-cornered fight",
                        "vi": "một cuộc chiến ba góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the place inside a room or a box where two sides join; the area around this place",
                    "vi": "nơi bên trong một căn phòng hoặc một cái hộp mà hai bên tham gia vào nhau; khu vực xung quanh nơi này"
                },
                "examples": [
                    {
                        "en": "A large desk occupies another corner of the room.",
                        "vi": "Một bàn làm việc lớn chiếm một góc khác của căn phòng."
                    },
                    {
                        "en": "He found a quiet corner and got on with his work.",
                        "vi": "Anh tìm một góc yên tĩnh và tiếp tục với công việc của mình."
                    },
                    {
                        "en": "in the corner They made straight for the table in the corner.",
                        "vi": "ở góc Họ đã làm thẳng cho cái bàn trong góc."
                    },
                    {
                        "en": "in the corner of something She spotted him sitting in the corner of the bar.",
                        "vi": "trong góc của cái gì đó Cô phát hiện ra anh ta đang ngồi trong góc của quầy bar."
                    },
                    {
                        "en": "We found an empty booth in a dark corner of the pub.",
                        "vi": "Chúng tôi tìm thấy một gian hàng trống trong một góc tối của quán rượu."
                    },
                    {
                        "en": "There was a television in the far corner of the bedroom.",
                        "vi": "Có một chiếc tivi ở góc xa của phòng ngủ."
                    },
                    {
                        "en": "a corner table/seat/cupboard",
                        "vi": "một cái bàn / chỗ ngồi / cái tủ ở góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two streets join",
                    "vi": "một nơi mà hai con phố nối với nhau"
                },
                "examples": [
                    {
                        "en": "The wind hit him as he turned the corner.",
                        "vi": "Gió ập vào anh khi anh rẽ vào góc đường."
                    },
                    {
                        "en": "corner of A and B the last house before the corner of Beach Road and Hill Avenue",
                        "vi": "căn góc A và B căn nhà cuối cùng trước góc đường Beach và đại lộ Hill"
                    },
                    {
                        "en": "on the corner There was a group of youths standing on the street corner.",
                        "vi": "ở góc phố Có một nhóm thanh niên đang đứng ở góc phố."
                    },
                    {
                        "en": "on the corner of something There’s a hotel on the corner of my street.",
                        "vi": "ở góc của cái gì đó Có một khách sạn ở góc đường của tôi."
                    },
                    {
                        "en": "at the corner (of something) Turn right at the corner of Sunset and Crescent Heights Boulevards.",
                        "vi": "ở góc (của một cái gì đó) Rẽ phải ở góc của Đại lộ Hoàng hôn và Lưỡi liềm."
                    },
                    {
                        "en": "around/round the corner The bus stop is around the corner, I think.",
                        "vi": "xung quanh / vòng quanh góc Trạm xe buýt ở quanh góc, tôi nghĩ."
                    },
                    {
                        "en": "around/round the corner from something the bookshop around the corner from our hotel",
                        "vi": "xung quanh / vòng quanh góc từ một cái gì đó hiệu sách xung quanh góc từ khách sạn của chúng tôi"
                    },
                    {
                        "en": "(at the) corner with something the big tree at the corner with Hill Street",
                        "vi": "(ở góc) với một cái gì đó cái cây lớn ở góc với Phố Hill"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road",
                    "vi": "một khúc cua gấp trên một con đường"
                },
                "examples": [
                    {
                        "en": "The car was taking the corners too fast.",
                        "vi": "Chiếc xe đã vào góc quá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a region or an area of a place (sometimes used for one that is far away or difficult to reach)",
                    "vi": "một khu vực hoặc một khu vực của một địa điểm (đôi khi được sử dụng cho một địa điểm ở xa hoặc khó tiếp cận)"
                },
                "examples": [
                    {
                        "en": "She lives in a quiet corner of rural Yorkshire.",
                        "vi": "Cô sống ở một góc yên tĩnh của vùng nông thôn Yorkshire."
                    },
                    {
                        "en": "Students come here from the four corners of the world.",
                        "vi": "Sinh viên đến đây từ bốn phương."
                    },
                    {
                        "en": "He knew every corner of the old town.",
                        "vi": "Anh biết mọi ngóc ngách của khu phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation",
                    "vi": "Một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "to back/drive/force somebody into a corner",
                        "vi": "lùi / lái xe / buộc ai đó vào một góc"
                    },
                    {
                        "en": "They had got her in a corner, and there wasn't much she could do about it.",
                        "vi": "Họ đã dồn cô ấy vào một góc, và cô ấy không thể làm được gì nhiều."
                    },
                    {
                        "en": "He was used to talking his way out of tight corners.",
                        "vi": "Anh ấy đã quen với việc nói theo cách của mình từ những góc hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a free kick or hit that you take from the corner of your opponent’s end of the field",
                    "vi": "một quả đá phạt hoặc cú đánh mà bạn thực hiện từ góc cuối sân của đối phương"
                },
                "examples": [
                    {
                        "en": "Moore took the corner.",
                        "vi": "Moore thực hiện quả phạt góc."
                    },
                    {
                        "en": "The referee awarded a corner.",
                        "vi": "Trọng tài cho hưởng quả phạt góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four corners of a ring; the supporters who help in the corner",
                    "vi": "bất kỳ trong bốn góc của một chiếc nhẫn; những người ủng hộ giúp đỡ trong góc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very near",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "Her house is just around the corner.",
                        "vi": "Nhà cô ấy ở ngay góc phố."
                    },
                    {
                        "en": "(figurative) There were good times around the corner (= they would soon come).",
                        "vi": "(nghĩa bóng) Đã có những khoảng thời gian tuyệt vời (= họ sẽ sớm đến)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support and encourage somebody; to have somebody who supports and encourages you",
                    "vi": "để hỗ trợ và khuyến khích ai đó; để có ai đó ủng hộ và khuyến khích bạn"
                },
                "examples": [
                    {
                        "en": "He's been in my corner all these years and I can never thank him enough.",
                        "vi": "Anh ấy đã ở trong góc của tôi suốt những năm qua và tôi không bao giờ có thể cảm ơn anh ấy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go across the corner of an area and not around the sides of it, because it is quicker",
                    "vi": "để đi qua góc của một khu vực chứ không phải xung quanh các cạnh của nó, bởi vì nó nhanh hơn"
                },
                "examples": [
                    {
                        "en": "There’s a worn patch on the grass because everyone cuts (off) the corner.",
                        "vi": "Có một mảng cỏ đã mòn vì mọi người cắt bỏ (cắt bỏ) góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out",
                    "vi": "để làm điều gì đó theo cách dễ nhất, rẻ nhất hoặc nhanh nhất, thường bằng cách bỏ qua các quy tắc hoặc bỏ qua điều gì đó"
                },
                "examples": [
                    {
                        "en": "To be competitive, they paid low wages and cut corners on health and safety.",
                        "vi": "Để cạnh tranh, họ trả lương thấp và cắt giảm sức khỏe và an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defend your/somebody’s position against other people",
                    "vi": "để bảo vệ lập trường của bạn / ai đó trước những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft corner for you.",
                        "vi": "Cô ấy luôn có một góc mềm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    },
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it",
                    "vi": "nhìn thấy vật gì đó một cách tình cờ hoặc không rõ ràng lắm vì bạn nhìn thấy vật đó từ phía bên mắt mình và không nhìn thẳng vào vật đó"
                },
                "examples": [
                    {
                        "en": "Out of the corner of her eye, she saw him coming closer.",
                        "vi": "Qua khóe mắt, cô thấy anh đang tiến lại gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass a very important point in an illness or a difficult situation and begin to improve",
                    "vi": "vượt qua một điểm rất quan trọng trong một căn bệnh hoặc một tình huống khó khăn và bắt đầu cải thiện"
                },
                "examples": [
                    {
                        "en": "The country's economy has finally turned the corner.",
                        "vi": "Nền kinh tế của đất nước cuối cùng cũng đã rẽ vào ngõ ngách."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d4d6a99123145c79ab05a0da9e676c3",
        "word": "in a (tight) spot",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪt/",
            "us": "/taɪt/"
        },
        "nearby": [
            {
                "word": "tigerish",
                "pos": "adjective"
            },
            {
                "word": "tiger mother",
                "pos": "noun"
            },
            {
                "word": "tight",
                "pos": "adjective"
            },
            {
                "word": "tight",
                "pos": "adverb"
            },
            {
                "word": "tight-arse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "held or fixed in position securely; difficult to move, open or separate",
                    "vi": "được giữ hoặc cố định ở vị trí an toàn; khó di chuyển, mở hoặc tách rời"
                },
                "examples": [
                    {
                        "en": "He kept a tight grip on her arm.",
                        "vi": "Anh giữ chặt cánh tay cô."
                    },
                    {
                        "en": "She twisted her hair into a tight knot.",
                        "vi": "Cô ấy xoắn tóc thành một nút chặt."
                    },
                    {
                        "en": "The screw was so tight that it wouldn't move.",
                        "vi": "Vít chặt đến mức nó sẽ không di chuyển."
                    },
                    {
                        "en": "Dave's arms were tight around her waist.",
                        "vi": "Dave vòng tay ôm chặt eo cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "fitting closely to your body and sometimes uncomfortable",
                    "vi": "vừa khít với cơ thể của bạn và đôi khi không thoải mái"
                },
                "examples": [
                    {
                        "en": "She was wearing a tight pair of jeans.",
                        "vi": "Cô ấy đang mặc một chiếc quần jean bó."
                    },
                    {
                        "en": "These shoes are much too tight.",
                        "vi": "Đôi giày này quá chật."
                    },
                    {
                        "en": "The new sweater was a tight fit.",
                        "vi": "Chiếc áo len mới vừa vặn."
                    },
                    {
                        "en": "The dress is a little tight across the chest.",
                        "vi": "Chiếc váy hơi ôm sát ngực."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult to manage with because there is not enough",
                    "vi": "khó quản lý vì không có đủ"
                },
                "examples": [
                    {
                        "en": "We have a very tight budget.",
                        "vi": "Chúng tôi có một ngân sách rất eo hẹp."
                    },
                    {
                        "en": "The president has a tight schedule today.",
                        "vi": "Tổng thống có một lịch trình dày đặc hôm nay."
                    },
                    {
                        "en": "The deadline for finishing the project is too tight (= too soon).",
                        "vi": "Thời hạn hoàn thành dự án quá chặt chẽ (= quá sớm)."
                    },
                    {
                        "en": "I think we'd better leave—time's getting very tight.",
                        "vi": "Tôi nghĩ tốt hơn là chúng ta nên rời đi — thời gian đang rất eo hẹp."
                    },
                    {
                        "en": "As always, money is tight.",
                        "vi": "Như mọi khi, tiền bạc eo hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "very strict and hard to resist, avoid, etc.",
                    "vi": "rất nghiêm ngặt và khó cưỡng lại, né tránh, v.v."
                },
                "examples": [
                    {
                        "en": "to keep tight control over something",
                        "vi": "để kiểm soát chặt chẽ một cái gì đó"
                    },
                    {
                        "en": "Dozens of streets are being closed and security is tight.",
                        "vi": "Hàng chục con phố đang bị đóng cửa và an ninh được thắt chặt."
                    },
                    {
                        "en": "We need tighter security at the airport.",
                        "vi": "Chúng tôi cần an ninh chặt chẽ hơn ở sân bay."
                    },
                    {
                        "en": "Are the controls tight enough?",
                        "vi": "Các biện pháp kiểm soát đã đủ chặt chẽ chưa?"
                    },
                    {
                        "en": "tight restrictions/regulations",
                        "vi": "hạn chế / quy định chặt chẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "stretched or pulled so that it cannot stretch much further",
                    "vi": "kéo căng hoặc kéo để nó không thể kéo dài thêm nữa"
                },
                "examples": [
                    {
                        "en": "The rope was stretched tight.",
                        "vi": "Sợi dây bị kéo căng."
                    },
                    {
                        "en": "The constant pull of the river will keep your line tight.",
                        "vi": "Lực kéo liên tục của sông sẽ giữ cho đường dây của bạn chặt chẽ."
                    },
                    {
                        "en": "He drew the cord tighter with a jerk.",
                        "vi": "Anh giật sợi dây chặt hơn."
                    },
                    {
                        "en": "Pull in your navel and keep your abs tight.",
                        "vi": "Hóp rốn vào và giữ cho cơ bụng căng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with things or people packed closely together, leaving little space between them",
                    "vi": "với những thứ hoặc con người được đóng gói chặt chẽ với nhau, để lại ít khoảng cách giữa chúng"
                },
                "examples": [
                    {
                        "en": "There was a tight group of people around the speaker.",
                        "vi": "Có một nhóm người vây quanh diễn giả."
                    },
                    {
                        "en": "With six of us in the car it was a tight squeeze.",
                        "vi": "Với sáu người chúng tôi trong xe, đó là một sự siết chặt."
                    },
                    {
                        "en": "She managed to reverse into a tight parking space.",
                        "vi": "Cô xoay sở để lùi vào một chỗ đậu xe chật hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking or sounding anxious, upset or angry",
                    "vi": "nhìn hoặc có vẻ lo lắng, buồn bã hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "‘I'm sorry,’ she said, with a tight smile.",
                        "vi": "Tôi xin lỗi, cô ấy nói, với một nụ cười ngặt nghẽo."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling painful or uncomfortable because of illness or emotion",
                    "vi": "cảm thấy đau đớn hoặc khó chịu vì bệnh tật hoặc cảm xúc"
                },
                "examples": [
                    {
                        "en": "He complained of having a tight chest.",
                        "vi": "Anh ấy phàn nàn về việc có một bộ ngực căng."
                    },
                    {
                        "en": "Her throat felt tight, just looking at her baby.",
                        "vi": "Cổ họng cô như thắt lại, chỉ nhìn con mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a close relationship with somebody else or with other people",
                    "vi": "có mối quan hệ thân thiết với người khác hoặc với những người khác"
                },
                "examples": [
                    {
                        "en": "It was a tight community and newcomers were not welcome.",
                        "vi": "Đó là một cộng đồng chặt chẽ và những người mới đến không được chào đón."
                    }
                ]
            },
            {
                "define": {
                    "en": "curving suddenly rather than gradually",
                    "vi": "cong đột ngột thay vì dần dần"
                },
                "examples": [
                    {
                        "en": "The driver slowed down at a tight bend in the road.",
                        "vi": "Người lái xe giảm tốc độ ở một khúc cua hẹp trên đường."
                    },
                    {
                        "en": "The plane flew around in a tight circle.",
                        "vi": "Máy bay bay xung quanh trong một vòng tròn chặt chẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "with runners, teams, etc. that seem to be equally good",
                    "vi": "với người chạy, đội, v.v. có vẻ tốt như nhau"
                },
                "examples": [
                    {
                        "en": "a tight race",
                        "vi": "một cuộc đua chặt chẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "not wanting to spend much money; not generous",
                    "vi": "không muốn tiêu nhiều tiền; không hào phóng"
                },
                "examples": [
                    {
                        "en": "He's very tight with his money.",
                        "vi": "Anh ấy rất chặt chẽ với tiền của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "drunk",
                    "vi": "say"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not allowing the substance mentioned to enter",
                    "vi": "không cho phép chất được đề cập đi vào"
                },
                "examples": [
                    {
                        "en": "measures to make your home weathertight",
                        "vi": "các biện pháp để làm cho ngôi nhà của bạn kín gió"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    },
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to control somebody/something carefully or strictly",
                    "vi": "để kiểm soát ai đó / cái gì đó một cách cẩn thận hoặc nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "It’s essential to keep a tight rein on public spending.",
                        "vi": "Điều cần thiết là phải kiểm soát chặt chẽ chi tiêu công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize something in a very efficient way, controlling other people very closely",
                    "vi": "tổ chức một cái gì đó một cách rất hiệu quả, kiểm soát những người khác rất chặt chẽ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "24781a3162974f75bffaf83f3987c88f",
        "word": "in a (tight) spot/corner",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/spɒt/",
            "us": "/spɑːt/"
        },
        "nearby": [
            {
                "word": "sport utility vehicle",
                "pos": "noun"
            },
            {
                "word": "sporty",
                "pos": "adjective"
            },
            {
                "word": "spot",
                "pos": "noun"
            },
            {
                "word": "spot",
                "pos": "verb"
            },
            {
                "word": "spot",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small round area that has a different colour or feels different from the surface it is on",
                    "vi": "một khu vực tròn nhỏ có màu khác hoặc có cảm giác khác với bề mặt của nó"
                },
                "examples": [
                    {
                        "en": "Which has spots, the leopard or the tiger?",
                        "vi": "Con nào có đốm, con báo hay con hổ?"
                    },
                    {
                        "en": "The male bird has a red spot on its beak.",
                        "vi": "Chim trống có một đốm đỏ trên mỏ."
                    },
                    {
                        "en": "(British English) She was wearing a black skirt with white spots.",
                        "vi": "(Anh Anh) Cô ấy đang mặc một chiếc váy đen với những đốm trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small mark or lump on a person’s skin, sometimes with a yellow head to it",
                    "vi": "một vết nhỏ hoặc cục u trên da của một người, đôi khi có đầu màu vàng"
                },
                "examples": [
                    {
                        "en": "The baby's whole body was covered in small red spots.",
                        "vi": "Toàn thân cháu bé nổi đầy những nốt mụn nhỏ màu đỏ."
                    },
                    {
                        "en": "He had a large spot on his nose.",
                        "vi": "Anh ta có một đốm lớn trên mũi."
                    },
                    {
                        "en": "The aim of acne treatments is to shorten the length of time someone has spots.",
                        "vi": "Mục đích của phương pháp điều trị mụn trứng cá là rút ngắn thời gian bị mụn trứng cá."
                    },
                    {
                        "en": "(British English) teenagers worried about their spots",
                        "vi": "(Tiếng Anh Anh) thanh thiếu niên lo lắng về điểm của họ"
                    },
                    {
                        "en": "The children all had measles, and had broken out in spots.",
                        "vi": "Các cháu đều mắc bệnh sởi, thành từng đám."
                    },
                    {
                        "en": "enlarged pores and spots on the skin",
                        "vi": "lỗ chân lông to và các đốm trên da"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small dirty mark on something",
                    "vi": "một vết bẩn nhỏ trên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His jacket was covered with spots of mud.",
                        "vi": "Áo khoác của anh ta dính đầy những đốm bùn."
                    },
                    {
                        "en": "rust spots",
                        "vi": "điểm rỉ sét"
                    },
                    {
                        "en": "There were grease spots all over the walls.",
                        "vi": "Có những vết dầu mỡ khắp các bức tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area or place",
                    "vi": "một khu vực hoặc địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "a quiet/secluded/lonely spot",
                        "vi": "một nơi yên tĩnh / hẻo lánh / cô đơn"
                    },
                    {
                        "en": "This is a favourite spot for walkers and climbers.",
                        "vi": "Đây là địa điểm yêu thích của những người thích đi bộ và leo núi."
                    },
                    {
                        "en": "I won't drive around for 20 minutes looking for a parking spot.",
                        "vi": "Tôi sẽ không lái xe trong 20 phút để tìm chỗ đậu xe."
                    },
                    {
                        "en": "He was exhausted and just wanted to find a spot to sleep.",
                        "vi": "Anh kiệt sức và chỉ muốn tìm một chỗ để ngủ."
                    },
                    {
                        "en": "The bay has become a popular spot for young international travellers.",
                        "vi": "Vịnh đã trở thành một điểm nổi tiếng đối với du khách quốc tế trẻ tuổi."
                    },
                    {
                        "en": "He showed me the exact spot where he had asked her to marry him.",
                        "vi": "Anh ấy chỉ cho tôi địa điểm chính xác mà anh ấy đã hỏi cưới cô ấy."
                    },
                    {
                        "en": "a tourist spot",
                        "vi": "một điểm du lịch"
                    },
                    {
                        "en": "She placed the ball on the penalty spot and waited for the whistle.",
                        "vi": "Cô đặt bóng vào chấm phạt đền và chờ tiếng còi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small feature or part of somebody/something with a particular quality",
                    "vi": "một tính năng nhỏ hoặc một phần của ai đó / cái gì đó với một chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He usually wears a hat to hide his bald spot.",
                        "vi": "Anh ấy thường đội một chiếc mũ để che đi vết hói của mình."
                    },
                    {
                        "en": "(figurative) She knew her weak spot where Steve was concerned.",
                        "vi": "(nghĩa bóng) Cô ấy biết điểm yếu của mình nơi Steve lo lắng."
                    },
                    {
                        "en": "(figurative) From her angry reply it was obvious that I had touched a sensitive spot.",
                        "vi": "(nghĩa bóng) Từ câu trả lời giận dữ của cô ấy, rõ ràng là tôi đã chạm vào chỗ nhạy cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of something",
                    "vi": "một số lượng nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's in a spot of trouble.",
                        "vi": "Anh ấy đang gặp rắc rối."
                    },
                    {
                        "en": "Would you like a spot of lunch?",
                        "vi": "Bạn có muốn ăn trưa tại chỗ không?"
                    },
                    {
                        "en": "She’s gone out to do a spot of shopping.",
                        "vi": "Cô ấy ra ngoài để mua sắm."
                    },
                    {
                        "en": "We got into a spot of bother with the police.",
                        "vi": "Chúng tôi vướng vào một chỗ làm phiền với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of a liquid",
                    "vi": "một lượng nhỏ chất lỏng"
                },
                "examples": [
                    {
                        "en": "I felt a few spots of rain.",
                        "vi": "Tôi cảm thấy một vài điểm mưa."
                    },
                    {
                        "en": "There was a spot of rain in the afternoon, but otherwise the weather has been perfect.",
                        "vi": "Có một chút mưa vào buổi chiều, nhưng nếu không thì thời tiết thật hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a television, radio, club or theatre show that is given to a particular person or type of entertainment",
                    "vi": "một phần của chương trình truyền hình, đài phát thanh, câu lạc bộ hoặc nhà hát dành cho một người hoặc loại hình giải trí cụ thể"
                },
                "examples": [
                    {
                        "en": "a guest/solo spot",
                        "vi": "một khách / điểm solo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in a competition, event or team",
                    "vi": "một vị trí trong một cuộc thi, sự kiện hoặc đội"
                },
                "examples": [
                    {
                        "en": "two teams battling for (the) top spot",
                        "vi": "hai đội chiến đấu cho (vị trí) đầu"
                    },
                    {
                        "en": "She has earned a spot on the national team.",
                        "vi": "Cô ấy đã giành được một suất trong đội tuyển quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "a spotlight (= a light with a single, very bright beam that can be directed at a particular place or person, especially a performer on the stage)",
                    "vi": "đèn sân khấu (= đèn có một chùm sáng rất sáng có thể chiếu thẳng vào một địa điểm hoặc một người cụ thể, đặc biệt là một người biểu diễn trên sân khấu)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a good or pleasant part of something that is unpleasant or bad in all other ways",
                    "vi": "một phần tốt hoặc dễ chịu của điều gì đó khó chịu hoặc xấu theo tất cả các cách khác"
                },
                "examples": [
                    {
                        "en": "The win last week was the only bright spot in their last ten games.",
                        "vi": "Chiến thắng tuần trước là điểm sáng duy nhất trong mười trận gần nhất của họ."
                    },
                    {
                        "en": "The birth of my son was the one bright spot in a terrible year.",
                        "vi": "Sự ra đời của con trai tôi là một điểm sáng trong một năm tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to move, for example because you are frightened or surprised",
                    "vi": "không thể di chuyển, chẳng hạn như vì bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "I stood rooted to the spot with terror.",
                        "vi": "Tôi sợ hãi đứng rễ tại chỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft spot for you.",
                        "vi": "Cô ấy luôn có một điểm yếu cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something hits the spot it does exactly what it should do",
                    "vi": "nếu một cái gì đó chạm đúng vị trí, nó sẽ làm chính xác những gì nó nên làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very much better than somebody/something",
                    "vi": "trở nên tốt hơn rất nhiều so với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She knocks spots off all the other candidates.",
                        "vi": "Cô ấy đánh bật tất cả các ứng cử viên khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "people cannot change their character, especially if they have a bad character",
                    "vi": "con người không thể thay đổi tính cách của họ, đặc biệt là nếu họ có một tính cách xấu"
                },
                "examples": [
                    {
                        "en": "You didn’t really expect her to be on time, did you? A leopard can’t change its spots.",
                        "vi": "Bạn không thực sự mong đợi cô ấy đến đúng giờ, phải không? Một con báo không thể thay đổi điểm của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "immediately",
                    "vi": "ngay lập tức"
                },
                "examples": [
                    {
                        "en": "He answered the question on the spot.",
                        "vi": "Anh ta trả lời câu hỏi ngay tại chỗ."
                    },
                    {
                        "en": "an on-the-spot parking fine",
                        "vi": "phạt đậu xe tại chỗ"
                    }
                ]
            },
            {
                "define": {
                    "en": "at the actual place where something is happening",
                    "vi": "tại địa điểm thực tế nơi có điều gì đó đang xảy ra"
                },
                "examples": [
                    {
                        "en": "An ambulance was on the spot within minutes.",
                        "vi": "Xe cấp cứu đã có mặt tại chỗ trong vòng vài phút."
                    },
                    {
                        "en": "an on-the-spot report",
                        "vi": "một báo cáo tại chỗ"
                    }
                ]
            },
            {
                "define": {
                    "en": "in one exact place, without moving in any direction",
                    "vi": "ở một nơi chính xác, không di chuyển theo bất kỳ hướng nào"
                },
                "examples": [
                    {
                        "en": "Running on the spot is good exercise.",
                        "vi": "Chạy tại chỗ là thể dục tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel uncomfortable or embarrassed by asking them a difficult question",
                    "vi": "làm cho ai đó cảm thấy khó chịu hoặc xấu hổ bằng cách hỏi họ một câu hỏi khó"
                },
                "examples": [
                    {
                        "en": "The interviewer's questions really put him on the spot.",
                        "vi": "Các câu hỏi của người phỏng vấn thực sự đặt anh ta vào chỗ đứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "06dd3fabb25b4a9095978d34f7003c42",
        "word": "insanity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈsænəti/",
            "us": "/ɪnˈsænəti/"
        },
        "nearby": [
            {
                "word": "insanely",
                "pos": "adverb"
            },
            {
                "word": "insanitary",
                "pos": "adjective"
            },
            {
                "word": "insanity",
                "pos": "noun"
            },
            {
                "word": "insatiable",
                "pos": "adjective"
            },
            {
                "word": "insatiably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being insane",
                    "vi": "trạng thái mất trí"
                },
                "examples": [
                    {
                        "en": "He was found not guilty, by reason of insanity.",
                        "vi": "Anh ta được coi là không có tội, bởi lý do điên rồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "actions that are very stupid and possibly dangerous",
                    "vi": "những hành động rất ngu ngốc và có thể nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It would be sheer insanity to attempt the trip in such bad weather.",
                        "vi": "Thật là điên rồ nếu cố gắng thực hiện chuyến đi trong thời tiết xấu như vậy."
                    },
                    {
                        "en": "Congress has one option to stop this insanity.",
                        "vi": "Quốc hội có một lựa chọn để ngăn chặn sự điên rồ này."
                    },
                    {
                        "en": "But the show does capture the various insanities and absurdities of his life.",
                        "vi": "Nhưng chương trình đã ghi lại những điều điên rồ và vô lý khác nhau trong cuộc đời của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "12f42853a00b4a44b93c072ef1862535",
        "word": "jungle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʌŋɡl/",
            "us": "/ˈdʒʌŋɡl/"
        },
        "nearby": [
            {
                "word": "Juneau",
                "pos": ""
            },
            {
                "word": "Juneteenth",
                "pos": "noun"
            },
            {
                "word": "jungle",
                "pos": "noun"
            },
            {
                "word": "The Jungle Book",
                "pos": ""
            },
            {
                "word": "jungle gym",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of tropical forest where trees and plants grow very thickly",
                    "vi": "một khu vực rừng nhiệt đới nơi cây cối và thực vật mọc rất dày"
                },
                "examples": [
                    {
                        "en": "The area was covered in dense jungle.",
                        "vi": "Khu vực này được bao phủ bởi rừng rậm."
                    },
                    {
                        "en": "the jungles of South-East Asia",
                        "vi": "rừng rậm Đông Nam Á"
                    },
                    {
                        "en": "jungle warfare",
                        "vi": "chiến tranh trong rừng"
                    },
                    {
                        "en": "Our garden is a complete jungle.",
                        "vi": "Khu vườn của chúng tôi là một khu rừng hoàn chỉnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a dangerous or unfriendly place or situation, especially one where it is very difficult to be successful or to trust anyone",
                    "vi": "một địa điểm hoặc tình huống nguy hiểm hoặc không thân thiện, đặc biệt là một nơi rất khó thành công hoặc để tin tưởng bất cứ ai"
                },
                "examples": [
                    {
                        "en": "It's a jungle out there—you've got to be strong to succeed.",
                        "vi": "Ngoài kia là một khu rừng - bạn phải mạnh mẽ để thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of electronic dance music developed in the UK in the early 1990s, which has a fast drum beat and a strong slower bass beat",
                    "vi": "một loại nhạc khiêu vũ điện tử được phát triển ở Anh vào đầu những năm 1990, có nhịp trống nhanh và nhịp trầm chậm hơn mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which people are prepared to harm other people in order to succeed",
                    "vi": "một tình huống trong đó mọi người chuẩn bị để làm hại người khác để thành công"
                },
                "examples": [
                    {
                        "en": "These criminal gangs only recognize the law of the jungle.",
                        "vi": "Các băng nhóm tội phạm này chỉ thừa nhận luật rừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e49f32afdf94ff586d9ddbf55ab56b3",
        "word": "lunatic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈluːnətɪk/",
            "us": "/ˈluːnətɪk/"
        },
        "nearby": [
            {
                "word": "lunar month",
                "pos": "noun"
            },
            {
                "word": "lunar year",
                "pos": "noun"
            },
            {
                "word": "lunatic",
                "pos": "noun"
            },
            {
                "word": "lunatic",
                "pos": "adjective"
            },
            {
                "word": "lunatic asylum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does crazy things that are often dangerous",
                    "vi": "một người thường làm những điều điên rồ và nguy hiểm"
                },
                "examples": [
                    {
                        "en": "This lunatic in a white van pulled out right in front of me!",
                        "vi": "Kẻ mất trí này trong một chiếc xe van màu trắng đã lao ra ngay trước mặt tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is severely mentally ill (the use of this word is now offensive)",
                    "vi": "một người bị bệnh tâm thần nặng (việc sử dụng từ này bây giờ là xúc phạm)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cffad2e959f740f59f2b74764af19929",
        "word": "maniac",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeɪniæk/",
            "us": "/ˈmeɪniæk/"
        },
        "nearby": [
            {
                "word": "-mania",
                "pos": "combining form"
            },
            {
                "word": "maniac",
                "pos": "adjective"
            },
            {
                "word": "maniac",
                "pos": "noun"
            },
            {
                "word": "-maniac",
                "pos": "combining form"
            },
            {
                "word": "maniacal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who behaves in an extremely dangerous, wild or stupid way",
                    "vi": "một người cư xử theo cách cực kỳ nguy hiểm, ngông cuồng hoặc ngu ngốc"
                },
                "examples": [
                    {
                        "en": "He was driving like a maniac.",
                        "vi": "Anh ta đang lái xe như một kẻ điên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has an extremely strong desire or enthusiasm for something, to an extent that other people think is not normal",
                    "vi": "một người có mong muốn hoặc nhiệt tình cực kỳ mạnh mẽ đối với điều gì đó, đến mức mà người khác nghĩ là không bình thường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person suffering from mania",
                    "vi": "một người bị chứng hưng cảm"
                },
                "examples": [
                    {
                        "en": "a homicidal maniac",
                        "vi": "một kẻ cuồng giết người"
                    }
                ]
            }
        ]
    },
    {
        "id": "f811e1f917924f9b8af6ec87a1093e03",
        "word": "minefield",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪnfiːld/",
            "us": "/ˈmaɪnfiːld/"
        },
        "nearby": [
            {
                "word": "mine detector",
                "pos": "noun"
            },
            {
                "word": "mine dump",
                "pos": "noun"
            },
            {
                "word": "minefield",
                "pos": "noun"
            },
            {
                "word": "minehunter",
                "pos": "noun"
            },
            {
                "word": "miner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land or water where mines (= bombs that explode when they are touched) have been hidden",
                    "vi": "một khu vực đất hoặc nước nơi mìn (= bom nổ khi chạm vào) đã được giấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation that contains hidden dangers or difficulties",
                    "vi": "một tình huống ẩn chứa những nguy hiểm hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "a legal minefield",
                        "vi": "một bãi mìn hợp pháp"
                    },
                    {
                        "en": "Tax can be a minefield for the unwary.",
                        "vi": "Thuế có thể là một bãi mìn cho những người không thận trọng."
                    },
                    {
                        "en": "You will first have to pick your way through the minefield of professional advice.",
                        "vi": "Trước tiên, bạn sẽ phải chọn con đường của mình thông qua bãi mìn của những lời khuyên chuyên nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "669e45e080fe48e3a2008950d8a5ee19",
        "word": "powder keg",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpaʊdə keɡ/",
            "us": "/ˈpaʊdər keɡ/"
        },
        "nearby": [
            {
                "word": "powdered milk",
                "pos": "noun"
            },
            {
                "word": "powdered sugar",
                "pos": "noun"
            },
            {
                "word": "powder keg",
                "pos": "noun"
            },
            {
                "word": "powder puff",
                "pos": "noun"
            },
            {
                "word": "powder room",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dangerous situation that may suddenly become very violent",
                    "vi": "một tình huống nguy hiểm có thể đột nhiên trở nên rất bạo lực"
                },
                "examples": [
                    {
                        "en": "We're sitting on a powder keg of tension in the city.",
                        "vi": "Chúng tôi đang ngồi trên một thùng bột căng thẳng trong thành phố."
                    }
                ]
            }
        ]
    },
    {
        "id": "afb3f798eb0e40138e0ab5e824450e88",
        "word": "pressure cooker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpreʃə kʊkə(r)/",
            "us": "/ˈpreʃər kʊkər/"
        },
        "nearby": [
            {
                "word": "pressure",
                "pos": "noun"
            },
            {
                "word": "pressure",
                "pos": "verb"
            },
            {
                "word": "pressure cooker",
                "pos": "noun"
            },
            {
                "word": "pressure group",
                "pos": "noun"
            },
            {
                "word": "pressure hose",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong metal pot with a tight lid (= cover), that cooks food quickly by steam under high pressure",
                    "vi": "một nồi kim loại chắc chắn có nắp đậy (= nắp đậy), nấu chín thức ăn nhanh chóng bằng hơi nước dưới áp suất cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation that is difficult or dangerous because people are likely to become anxious or violent",
                    "vi": "một tình huống khó khăn hoặc nguy hiểm bởi vì mọi người có thể trở nên lo lắng hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "I needed to get away from the pressure cooker atmosphere of the campus during finals week.",
                        "vi": "Tôi cần phải tránh xa bầu không khí nồi áp suất của khuôn viên trường trong tuần cuối cùng."
                    },
                    {
                        "en": "They performed wonders in keeping the lid on the pressure cooker of a rapidly rising jail population.",
                        "vi": "Họ đã làm nên điều kỳ diệu trong việc đậy nắp nồi áp suất của một dân số tù đang gia tăng nhanh chóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ff0c4804e604d94a2cfbdeb220b528f",
        "word": "quagmire",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwæɡmaɪə(r)/",
            "us": "/ˈkwæɡmaɪər/"
        },
        "nearby": [
            {
                "word": "quaff",
                "pos": "verb"
            },
            {
                "word": "quagga",
                "pos": "noun"
            },
            {
                "word": "quagmire",
                "pos": "noun"
            },
            {
                "word": "quahog",
                "pos": "noun"
            },
            {
                "word": "quail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of soft wet ground",
                    "vi": "một khu vực đất mềm ẩm ướt"
                },
                "examples": [
                    {
                        "en": "The heavy rain soon turned the field into a quagmire.",
                        "vi": "Cơn mưa lớn chẳng mấy chốc đã biến cánh đồng thành vũng lầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult or dangerous situation",
                    "vi": "một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "508f4d85c8884447a99052e9df6dfdb3",
        "word": "quicksand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɪksænd/",
            "us": "/ˈkwɪksænd/"
        },
        "nearby": [
            {
                "word": "quickness",
                "pos": "noun"
            },
            {
                "word": "quick one",
                "pos": "noun"
            },
            {
                "word": "quicksand",
                "pos": "noun"
            },
            {
                "word": "quicksilver",
                "pos": "noun"
            },
            {
                "word": "quicksilver",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "deep wet sand that you sink into if you walk on it",
                    "vi": "cát ướt sâu mà bạn chìm vào nếu bạn đi trên nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation that is dangerous or difficult to escape from",
                    "vi": "một tình huống nguy hiểm hoặc khó thoát khỏi"
                },
                "examples": []
            }
        ]
    }
]