[
    {
        "id": "45748ec236ae4901bacc97fa8368f571",
        "word": "good",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡʊd/",
            "us": "/ɡʊd/"
        },
        "nearby": [
            {
                "word": "goo",
                "pos": "noun"
            },
            {
                "word": "goober",
                "pos": "noun"
            },
            {
                "word": "good",
                "pos": "adjective"
            },
            {
                "word": "good",
                "pos": "noun"
            },
            {
                "word": "good",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of high quality or an acceptable standard",
                    "vi": "chất lượng cao hoặc tiêu chuẩn có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "a good book",
                        "vi": "một cuốn sách hay"
                    },
                    {
                        "en": "good food",
                        "vi": "thức ăn ngon"
                    },
                    {
                        "en": "The piano was in really good condition.",
                        "vi": "Cây đàn piano đã ở trong tình trạng thực sự tốt."
                    },
                    {
                        "en": "Your work is just not good enough.",
                        "vi": "Công việc của bạn chỉ là không đủ tốt."
                    },
                    {
                        "en": "The results were pretty good.",
                        "vi": "Kết quả là khá tốt."
                    },
                    {
                        "en": "Sorry, my English is not very good.",
                        "vi": "Xin lỗi tiếng Anh của tôi không tốt lắm."
                    },
                    {
                        "en": "They've done a reasonably good job.",
                        "vi": "Họ đã hoàn thành một công việc khá tốt."
                    },
                    {
                        "en": "Keep up the good work!",
                        "vi": "Hãy tiếp tục phát huy!"
                    },
                    {
                        "en": "It's a good way to make friends.",
                        "vi": "Đó là một cách tốt để kết bạn."
                    },
                    {
                        "en": "The sound and picture are both of good quality.",
                        "vi": "Âm thanh và hình ảnh đều có chất lượng tốt."
                    },
                    {
                        "en": "Things are looking good at the moment.",
                        "vi": "Mọi thứ đang có vẻ tốt vào lúc này."
                    },
                    {
                        "en": "You'll never marry her—she's much too good for you.",
                        "vi": "Bạn sẽ không bao giờ cưới cô ấy - cô ấy quá tốt với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant; that you enjoy or want",
                    "vi": "hài lòng; mà bạn thích hoặc muốn"
                },
                "examples": [
                    {
                        "en": "Did you have a good time in London?",
                        "vi": "Bạn đã có một thời gian vui vẻ ở London?"
                    },
                    {
                        "en": "This is very good news.",
                        "vi": "Đây là một tin rất tốt."
                    },
                    {
                        "en": "Let's hope we have good weather tomorrow.",
                        "vi": "Hãy hy vọng chúng ta có thời tiết tốt vào ngày mai."
                    },
                    {
                        "en": "it is good to do something It's good to see you again.",
                        "vi": "thật tốt khi làm điều gì đó Thật tốt khi gặp lại bạn."
                    },
                    {
                        "en": "There are loads of good things about working here.",
                        "vi": "Có rất nhiều điều tốt khi làm việc ở đây."
                    },
                    {
                        "en": "We are still friends, though, which is good.",
                        "vi": "Tuy nhiên, chúng tôi vẫn là bạn bè, điều đó thật tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible, logical or strongly supporting what is being discussed",
                    "vi": "hợp lý, hợp lý hoặc ủng hộ mạnh mẽ những gì đang được thảo luận"
                },
                "examples": [
                    {
                        "en": "Thank you, good question.",
                        "vi": "Cảm ơn bạn, câu hỏi hay."
                    },
                    {
                        "en": "Yes, that's a good point.",
                        "vi": "Vâng, đó là một điểm tốt."
                    },
                    {
                        "en": "I have good reason to be suspicious.",
                        "vi": "Tôi có lý do chính đáng để nghi ngờ."
                    },
                    {
                        "en": "What a good idea!",
                        "vi": "Thật là một ý kiến hay!"
                    },
                    {
                        "en": "This is a good example of what I mean.",
                        "vi": "Đây là một ví dụ điển hình về những gì tôi muốn nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing or getting approval or respect",
                    "vi": "thể hiện hoặc nhận được sự chấp thuận hoặc tôn trọng"
                },
                "examples": [
                    {
                        "en": "The play had good reviews.",
                        "vi": "Vở kịch đã được đánh giá tốt."
                    },
                    {
                        "en": "The hotel has a good reputation.",
                        "vi": "Khách sạn có một danh tiếng tốt."
                    },
                    {
                        "en": "He comes from a good family.",
                        "vi": "Anh ấy xuất thân trong một gia đình tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to do something well",
                    "vi": "có thể làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "a good player",
                        "vi": "một người chơi giỏi"
                    },
                    {
                        "en": "a good actor/cook",
                        "vi": "một diễn viên / đầu bếp giỏi"
                    },
                    {
                        "en": "good at something to be good at languages/your job",
                        "vi": "giỏi một thứ gì đó để giỏi ngôn ngữ / công việc của bạn"
                    },
                    {
                        "en": "good at doing something Nick has always been good at finding cheap flights.",
                        "vi": "giỏi làm việc gì đó Nick luôn giỏi trong việc tìm kiếm các chuyến bay giá rẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to use something or deal with people well",
                    "vi": "có thể sử dụng một cái gì đó hoặc đối xử tốt với mọi người"
                },
                "examples": [
                    {
                        "en": "She's good with her hands (= able to make things, etc.).",
                        "vi": "Cô ấy giỏi với đôi tay của mình (= có thể làm ra mọi thứ, v.v.)."
                    },
                    {
                        "en": "He's very good with children.",
                        "vi": "Anh ấy rất tốt với trẻ em."
                    },
                    {
                        "en": "She's good with figures.",
                        "vi": "Cô ấy giỏi về số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "morally right; behaving in a way that is morally right",
                    "vi": "Đúng đạo đức; cư xử theo cách đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "She has tried to lead a good life.",
                        "vi": "Cô ấy đã cố gắng để có một cuộc sống tốt đẹp."
                    },
                    {
                        "en": "I took Sarah's children to school so I've done my good deed for the day.",
                        "vi": "Tôi đưa các con của Sarah đến trường vì vậy tôi đã làm việc tốt của mình trong ngày."
                    },
                    {
                        "en": "Giving her that money was a good thing to do.",
                        "vi": "Đưa cho cô ấy số tiền đó là điều nên làm."
                    },
                    {
                        "en": "He is a very good man.",
                        "vi": "Anh ấy là một người đàn ông rất tốt."
                    },
                    {
                        "en": "She prayed that God would make her a better person.",
                        "vi": "Cô cầu nguyện rằng Chúa sẽ biến cô trở thành một người tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "following strictly a set of rules or principles",
                    "vi": "tuân thủ nghiêm ngặt một bộ quy tắc hoặc nguyên tắc"
                },
                "examples": [
                    {
                        "en": "It is good practice to supply a written report to the buyer.",
                        "vi": "Thông lệ tốt là cung cấp báo cáo bằng văn bản cho người mua."
                    },
                    {
                        "en": "She was a good Catholic girl.",
                        "vi": "Cô ấy là một cô gái Công giáo tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to help; kind to other people",
                    "vi": "sẵn lòng giúp đỡ; tử tế với người khác"
                },
                "examples": [
                    {
                        "en": "You've always been such a good friend.",
                        "vi": "Bạn luôn là một người bạn tốt."
                    },
                    {
                        "en": "good to somebody He was very good to me when I was ill.",
                        "vi": "tốt với ai đó Anh ấy rất tốt với tôi khi tôi bị ốm."
                    },
                    {
                        "en": "good of somebody She looked into it for me, which was very good of her.",
                        "vi": "tốt của ai đó Cô ấy đã xem xét nó vì tôi, điều đó rất tốt với cô ấy."
                    },
                    {
                        "en": "good of somebody to do something It was very good of you to come.",
                        "vi": "tốt cho ai đó làm điều gì đó Rất tốt cho bạn khi đến."
                    },
                    {
                        "en": "good about something I had to take a week off work but my colleagues were very good about it.",
                        "vi": "tốt về điều gì đó Tôi đã phải nghỉ làm một tuần nhưng các đồng nghiệp của tôi rất tốt về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving well or politely",
                    "vi": "cư xử tốt hoặc lịch sự"
                },
                "examples": [
                    {
                        "en": "You can stay up late if you're good.",
                        "vi": "Bạn có thể thức khuya nếu bạn giỏi."
                    },
                    {
                        "en": "Get dressed now, there's a good girl.",
                        "vi": "Mặc quần áo ngay đi, có một cô gái tốt."
                    },
                    {
                        "en": "‘That's a good dog,’ I said, patting its head.",
                        "vi": "Đó là một con chó tốt, tôi nói, vỗ đầu nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "healthy or strong",
                    "vi": "khỏe mạnh hoặc mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Can you speak into my good ear?",
                        "vi": "Bạn có thể nói vào tai tốt của tôi?"
                    },
                    {
                        "en": "I don't feel too good today.",
                        "vi": "Tôi không cảm thấy quá tốt hôm nay."
                    },
                    {
                        "en": "‘How are you?’ ‘I'm good.’ (= used as a general reply to a greeting)",
                        "vi": "Bạn khỏe không?' 'Tôi ổn.' (= được sử dụng như một câu trả lời chung cho một lời chào)"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a useful or helpful effect on somebody/something",
                    "vi": "có tác dụng hữu ích hoặc hữu ích đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "Living so close to a chemicals factory can't be good.",
                        "vi": "Sống gần nhà máy hóa chất như vậy không thể tốt được."
                    },
                    {
                        "en": "good for somebody/something Too much sun isn't good for you.",
                        "vi": "tốt cho ai đó / cái gì đó Quá nhiều nắng không tốt cho bạn."
                    },
                    {
                        "en": "Vegetables are good for you.",
                        "vi": "Rau rất tốt cho bạn."
                    },
                    {
                        "en": "policies that are good for business",
                        "vi": "chính sách tốt cho doanh nghiệp"
                    },
                    {
                        "en": "The deal will be good for the country as a whole.",
                        "vi": "Thỏa thuận này sẽ tốt cho đất nước nói chung."
                    },
                    {
                        "en": "it is good for somebody/something to do something It's probably good for you to get some criticism now and then.",
                        "vi": "Nó là tốt cho ai đó / điều gì đó để làm điều gì đó Có thể tốt cho bạn bây giờ và sau đó nhận được một số lời chỉ trích."
                    },
                    {
                        "en": "(informal) Shut your mouth, if you know what's good for you (= used as a threat).",
                        "vi": "(thân mật) Hãy ngậm miệng lại, nếu bạn biết điều gì tốt cho bạn (= được sử dụng như một lời đe dọa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "suitable or appropriate",
                    "vi": "phù hợp hoặc thích hợp"
                },
                "examples": [
                    {
                        "en": "Now is a good time to buy a house.",
                        "vi": "Bây giờ là thời điểm tốt để mua nhà."
                    },
                    {
                        "en": "Do you really think this is a good use of your time?",
                        "vi": "Bạn có thực sự nghĩ rằng đây là cách sử dụng thời gian của bạn tốt không?"
                    },
                    {
                        "en": "Students are not allowed to miss classes without good reason.",
                        "vi": "Học sinh không được nghỉ học mà không có lý do chính đáng."
                    },
                    {
                        "en": "good for something/to do something She would be good for the job.",
                        "vi": "good for something / to do something Cô ấy sẽ tốt cho công việc."
                    },
                    {
                        "en": "good for somebody Can we change our meeting? Monday isn't good (= convenient) for me.",
                        "vi": "tốt cho ai đó Chúng ta có thể thay đổi cuộc họp của mình không? Thứ Hai không tốt (= thuận tiện) đối với tôi."
                    },
                    {
                        "en": "This is as good a place as any to spend the night.",
                        "vi": "Đây là một nơi tốt như bất kỳ nơi nào để nghỉ qua đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in speaking to show that you approve of or are pleased about something that has been said or done, or to show that you want to move on to a new topic of conversation",
                    "vi": "được sử dụng khi nói để thể hiện rằng bạn tán thành hoặc hài lòng về điều gì đó đã được nói hoặc đã làm, hoặc để thể hiện rằng bạn muốn chuyển sang một chủ đề mới của cuộc trò chuyện"
                },
                "examples": [
                    {
                        "en": "‘Dinner's ready.’ ‘Good—I'm starving.’",
                        "vi": "Bữa ăn tối đã sẵn sàng.' 'Tốt - tôi đang đói.'"
                    },
                    {
                        "en": "‘I got the job.’ ‘Oh, good.’",
                        "vi": "Tôi đã nhận được công việc.' 'Tốt.'"
                    },
                    {
                        "en": "Good, I think we've come to a decision.",
                        "vi": "Tốt, tôi nghĩ chúng ta đã đi đến quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a form of praise",
                    "vi": "được sử dụng như một hình thức khen ngợi"
                },
                "examples": [
                    {
                        "en": "Good old Jack!",
                        "vi": "Jack già tốt!"
                    },
                    {
                        "en": "‘I've ordered some drinks.’ ‘Good man!’",
                        "vi": "Tôi đã gọi một số đồ uống.' 'Người đàn ông tốt!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in exclamations",
                    "vi": "được sử dụng trong câu cảm thán"
                },
                "examples": [
                    {
                        "en": "Good heavens!",
                        "vi": "Lạy trời!"
                    },
                    {
                        "en": "Good God!",
                        "vi": "Chúa ơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "great in number, amount or degree",
                    "vi": "tuyệt vời về số lượng, số lượng hoặc mức độ"
                },
                "examples": [
                    {
                        "en": "a good number of people",
                        "vi": "một số lượng tốt"
                    },
                    {
                        "en": "The kitchen is a good size.",
                        "vi": "Nhà bếp là một kích thước tốt."
                    },
                    {
                        "en": "We spent a good while (= quite a long time) looking for the house.",
                        "vi": "Chúng tôi đã dành một khoảng thời gian (= khá lâu) để tìm kiếm ngôi nhà."
                    },
                    {
                        "en": "He devoted a good deal of (= a lot of) attention to the problem.",
                        "vi": "Anh ấy đã dành rất nhiều (= rất nhiều) sự chú ý cho vấn đề."
                    },
                    {
                        "en": "There's a good chance (= it is likely) that I won't be here next year.",
                        "vi": "Có một cơ hội tốt (= có khả năng) là tôi sẽ không ở đây vào năm tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "not less than; rather more than",
                    "vi": "không ít hơn; hơn là"
                },
                "examples": [
                    {
                        "en": "We waited for a good hour.",
                        "vi": "Chúng tôi đã chờ một giờ tốt."
                    },
                    {
                        "en": "It's a good three miles to the station.",
                        "vi": "Đó là một ba dặm tốt để đến nhà ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "done to a high level or a great degree; complete",
                    "vi": "được thực hiện ở mức độ cao hoặc mức độ tuyệt vời; hoàn thành"
                },
                "examples": [
                    {
                        "en": "We had a good laugh about it afterwards.",
                        "vi": "Chúng tôi đã có một trận cười sảng khoái về nó sau đó."
                    },
                    {
                        "en": "You'll feel better after a good sleep.",
                        "vi": "Bạn sẽ cảm thấy tốt hơn sau một giấc ngủ ngon."
                    }
                ]
            },
            {
                "define": {
                    "en": "funny or clever",
                    "vi": "hài hước hoặc thông minh"
                },
                "examples": [
                    {
                        "en": "a good story/joke",
                        "vi": "một câu chuyện hay một trò đùa"
                    },
                    {
                        "en": "(informal) That's a good one!",
                        "vi": "(không chính thức) Đó là một điều tốt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having enough energy, health, strength, etc. to last for a particular length of time or distance",
                    "vi": "có đủ năng lượng, sức khỏe, sức mạnh, v.v. để tồn tại trong một khoảng thời gian hoặc khoảng cách cụ thể"
                },
                "examples": [
                    {
                        "en": "You're good for (= you will live) a few years yet.",
                        "vi": "Bạn còn tốt cho (= bạn sẽ sống) vài năm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "acceptable for something",
                    "vi": "chấp nhận được cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The ticket is good for three months.",
                        "vi": "Vé tốt cho ba tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to provide something",
                    "vi": "có khả năng cung cấp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's always good for a laugh.",
                        "vi": "Anh ấy luôn vui cười."
                    },
                    {
                        "en": "Bobby should be good for a few drinks.",
                        "vi": "Bobby sẽ tốt cho một vài ly."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nearly",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "The matter is as good as settled.",
                        "vi": "Vấn đề là tốt như được giải quyết."
                    },
                    {
                        "en": "He as good as called me a coward (= suggested that I was a coward without actually using the word ‘coward’).",
                        "vi": "Anh ta hay gọi tôi là kẻ hèn nhát (= gợi ý rằng tôi là kẻ hèn nhát mà không thực sự sử dụng từ 'hèn nhát')."
                    },
                    {
                        "en": "She’s as good as won.",
                        "vi": "Cô ấy giỏi như đã thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that a situation is not going to get any better",
                    "vi": "được sử dụng khi bạn nói rằng một tình huống sẽ không trở nên tốt hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(of a thing) to be prepared and ready for use; (of a person) to be prepared and ready to do something",
                    "vi": "(của một điều) được chuẩn bị và sẵn sàng để sử dụng; (của một người) để chuẩn bị và sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "By tomorrow afternoon the document will be good to go.",
                        "vi": "Đến chiều mai, tài liệu sẽ tốt."
                    },
                    {
                        "en": "I’ve spent several months training for this race so now I’m good to go.",
                        "vi": "Tôi đã dành vài tháng để tập luyện cho cuộc đua này nên bây giờ tôi đã sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "I won't go until I'm good and ready.",
                        "vi": "Tôi sẽ không đi cho đến khi tôi tốt và sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "several",
                    "vi": "vài"
                },
                "examples": [
                    {
                        "en": "There are still a good few empty seats.",
                        "vi": "Vẫn còn một vài ghế trống tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to praise somebody for doing something well",
                    "vi": "được sử dụng để khen ngợi ai đó đã làm điều gì đó tốt"
                },
                "examples": [
                    {
                        "en": "‘I passed first time.’ ‘Good for you!’",
                        "vi": "Tôi đã vượt qua lần đầu tiên.' 'Tốt cho bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of somebody/something",
                    "vi": "rất nhiều ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were a good many people there.",
                        "vi": "Có rất nhiều người tốt ở đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "669362a2c6b04c2c9e80f2f026d0b908",
        "word": "duty",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdjuːti/",
            "us": "/ˈduːti/"
        },
        "nearby": [
            {
                "word": "dutiful",
                "pos": "adjective"
            },
            {
                "word": "dutifully",
                "pos": "adverb"
            },
            {
                "word": "duty",
                "pos": "noun"
            },
            {
                "word": "duty-bound",
                "pos": "adjective"
            },
            {
                "word": "duty-free",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you feel you have to do because it is your moral or legal responsibility",
                    "vi": "điều gì đó mà bạn cảm thấy mình phải làm vì đó là trách nhiệm đạo đức hoặc pháp lý của bạn"
                },
                "examples": [
                    {
                        "en": "duty to do something It is my duty to report it to the police.",
                        "vi": "Nhiệm vụ của tôi là phải báo cảnh sát."
                    },
                    {
                        "en": "Local councillors have a duty to serve the community.",
                        "vi": "Các ủy viên hội đồng địa phương có nhiệm vụ phục vụ cộng đồng."
                    },
                    {
                        "en": "under a duty to do something You are under a legal duty to keep accurate records.",
                        "vi": "dưới một nghĩa vụ phải làm một cái gì đó Bạn có nghĩa vụ pháp lý để lưu giữ các hồ sơ chính xác."
                    },
                    {
                        "en": "to do your duty for your country",
                        "vi": "làm nghĩa vụ của bạn cho đất nước của bạn"
                    },
                    {
                        "en": "duty to somebody/something He has failed in his duty to his client.",
                        "vi": "nghĩa vụ với ai đó / điều gì đó Anh ta đã thất bại trong nhiệm vụ đối với khách hàng của mình."
                    },
                    {
                        "en": "duty as somebody your duties as a parent",
                        "vi": "bổn phận với tư cách là ai đó bổn phận của bạn với tư cách là cha mẹ"
                    },
                    {
                        "en": "duty of something The company owes a duty of care to its employees.",
                        "vi": "nghĩa vụ của một cái gì đó Công ty có nghĩa vụ chăm sóc cho nhân viên của mình."
                    },
                    {
                        "en": "duty of doing something Local councils were charged with the duty of allocating land for building.",
                        "vi": "nhiệm vụ của việc làm gì đó Các hội đồng địa phương được giao trách nhiệm phân bổ đất để xây dựng."
                    },
                    {
                        "en": "a statutory/fiduciary duty",
                        "vi": "một nghĩa vụ theo luật định / ủy thác"
                    },
                    {
                        "en": "a civic/patriotic/moral duty",
                        "vi": "nghĩa vụ công dân / yêu nước / đạo đức"
                    },
                    {
                        "en": "I don't want you to visit me simply out of a sense of duty.",
                        "vi": "Tôi không muốn bạn đến thăm tôi chỉ đơn giản là vì nghĩa vụ."
                    },
                    {
                        "en": "I’ll have to go, I’m afraid—duty calls (= there is a duty I need to go and do).",
                        "vi": "Tôi phải đi, tôi e rằng — các cuộc gọi nhiệm vụ (= có một nhiệm vụ tôi cần phải đi và làm)."
                    },
                    {
                        "en": "a breach/dereliction of duty",
                        "vi": "vi phạm / bỏ ngang nhiệm vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the work that is your job",
                    "vi": "công việc đó là công việc của bạn"
                },
                "examples": [
                    {
                        "en": "Report for duty at 8 a.m.",
                        "vi": "Báo cáo trực lúc 8 giờ sáng"
                    },
                    {
                        "en": "He was the duty manager that day.",
                        "vi": "Anh ấy là người quản lý trực ban ngày hôm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "tasks that are part of your job",
                    "vi": "nhiệm vụ là một phần công việc của bạn"
                },
                "examples": [
                    {
                        "en": "I spend a lot of time on administrative duties.",
                        "vi": "Tôi dành nhiều thời gian cho các nhiệm vụ hành chính."
                    },
                    {
                        "en": "The princess has taken on her mother's official duties.",
                        "vi": "Công chúa đã đảm nhận nhiệm vụ chính thức của mẹ mình."
                    },
                    {
                        "en": "to perform/fulfil/discharge your duties",
                        "vi": "để thực hiện / hoàn thành / hoàn thành nhiệm vụ của bạn"
                    },
                    {
                        "en": "Your duties will include greeting visitors and answering the phone.",
                        "vi": "Nhiệm vụ của bạn sẽ bao gồm chào hỏi khách đến thăm và trả lời điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tax that you pay on things that you buy, especially those that you bring into a country",
                    "vi": "thuế bạn phải trả cho những thứ bạn mua, đặc biệt là những thứ bạn mang vào một quốc gia"
                },
                "examples": [
                    {
                        "en": "customs/excise/import duties",
                        "vi": "thuế hải quan / tiêu thụ đặc biệt / nhập khẩu"
                    },
                    {
                        "en": "duty on something duty on wine and beer",
                        "vi": "làm nhiệm vụ gì đó về rượu và bia"
                    },
                    {
                        "en": "The US imposed a duty on imports.",
                        "vi": "Mỹ áp thuế hàng nhập khẩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a higher standard or level than is required for a job or task",
                    "vi": "đến một tiêu chuẩn hoặc cấp độ cao hơn mức cần thiết cho một công việc hoặc nhiệm vụ"
                },
                "examples": [
                    {
                        "en": "She went above and beyond the call of duty in her efforts to save his life.",
                        "vi": "Cô ấy đã vượt lên trên cả lời kêu gọi của nhiệm vụ trong nỗ lực cứu sống anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you feel you must do; a responsibility which cannot be ignored",
                    "vi": "một cái gì đó mà bạn cảm thấy bạn phải làm; một trách nhiệm không thể bỏ qua"
                },
                "examples": [
                    {
                        "en": "He felt it was his bounden duty to tell the police what he knew.",
                        "vi": "Anh cảm thấy nhiệm vụ nhất định của mình là phải báo cho cảnh sát những gì anh biết."
                    },
                    {
                        "en": "We have a bounden duty to respond to this call for help.",
                        "vi": "Chúng tôi có nhiệm vụ rõ ràng là phải trả lời lời kêu gọi giúp đỡ này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform two roles or functions at the same time",
                    "vi": "để thực hiện hai vai trò hoặc chức năng cùng một lúc"
                },
                "examples": [
                    {
                        "en": "This device can pull double duty as a decent laptop and an adequate tablet.",
                        "vi": "Thiết bị này có thể thực hiện nhiệm vụ kép như một máy tính xách tay tốt và một máy tính bảng phù hợp."
                    },
                    {
                        "en": "She deserves credit for serving double duty as a host and performer.",
                        "vi": "Cô ấy xứng đáng được ghi nhận vì đã thực hiện hai nhiệm vụ vừa là người dẫn chương trình vừa là người biểu diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a job",
                    "vi": "trong khi làm một công việc"
                },
                "examples": [
                    {
                        "en": "A policeman was injured in the line of duty yesterday.",
                        "vi": "Một cảnh sát đã bị thương trong khi làm nhiệm vụ ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "working/not working at a particular time",
                    "vi": "làm việc / không hoạt động tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "Who's on duty today?",
                        "vi": "Hôm nay ai trực?"
                    },
                    {
                        "en": "What time do you go off duty?",
                        "vi": "Mấy giờ bạn tan sở?"
                    },
                    {
                        "en": "You're not allowed to drink alcohol on duty.",
                        "vi": "Bạn không được phép uống rượu khi làm nhiệm vụ."
                    }
                ]
            }
        ]
    },
    {
        "id": "657b27f1ea00420abb221f4a37f6a0c3",
        "word": "ethic",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeθɪk/",
            "us": "/ˈeθɪk/"
        },
        "nearby": [
            {
                "word": "ethereal",
                "pos": "adjective"
            },
            {
                "word": "Ethernet",
                "pos": "noun"
            },
            {
                "word": "ethic",
                "pos": "noun"
            },
            {
                "word": "ethical",
                "pos": "adjective"
            },
            {
                "word": "ethically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "moral principles that control or influence a person’s behaviour",
                    "vi": "các nguyên tắc đạo đức kiểm soát hoặc ảnh hưởng đến hành vi của một người"
                },
                "examples": [
                    {
                        "en": "professional/business/medical ethics",
                        "vi": "đạo đức nghề nghiệp / kinh doanh / y tế"
                    },
                    {
                        "en": "to draw up a code of ethics",
                        "vi": "xây dựng quy tắc đạo đức"
                    },
                    {
                        "en": "He began to question the ethics of his position.",
                        "vi": "Anh bắt đầu đặt câu hỏi về đạo đức của vị trí của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of moral principles or rules of behaviour",
                    "vi": "một hệ thống các nguyên tắc đạo đức hoặc các quy tắc hành vi"
                },
                "examples": [
                    {
                        "en": "The ethic of personal achievement is very strong in western societies.",
                        "vi": "Đạo đức về thành tích cá nhân rất mạnh mẽ ở các xã hội phương Tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "the branch of philosophy that deals with moral principles",
                    "vi": "nhánh triết học liên quan đến các nguyên tắc đạo đức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43742a7337eb463b90d2182c59a62a0b",
        "word": "ethical",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeθɪkl/",
            "us": "/ˈeθɪkl/"
        },
        "nearby": [
            {
                "word": "Ethernet",
                "pos": "noun"
            },
            {
                "word": "ethic",
                "pos": "noun"
            },
            {
                "word": "ethical",
                "pos": "adjective"
            },
            {
                "word": "ethically",
                "pos": "adverb"
            },
            {
                "word": "Ethiopia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with beliefs and principles about what is right and wrong",
                    "vi": "kết nối với niềm tin và nguyên tắc về điều gì là đúng và sai"
                },
                "examples": [
                    {
                        "en": "ethical issues/standards/questions/dilemmas",
                        "vi": "vấn đề đạo đức / tiêu chuẩn / câu hỏi / tình huống khó xử"
                    },
                    {
                        "en": "the ethical problems of human embryo research",
                        "vi": "vấn đề đạo đức của nghiên cứu phôi thai người"
                    }
                ]
            },
            {
                "define": {
                    "en": "morally correct or acceptable",
                    "vi": "đúng về mặt đạo đức hoặc có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "it is ethical to do something Is it ethical to keep animals in zoos?",
                        "vi": "Làm điều gì đó có đạo đức Không khi nuôi động vật trong vườn thú?"
                    },
                    {
                        "en": "it is ethical for somebody to do something It would have been more ethical for him to resign.",
                        "vi": "việc ai đó làm điều gì đó là hợp đạo đức Người từ chức sẽ có đạo đức hơn."
                    },
                    {
                        "en": "ethical investment (= investing money in businesses that are considered morally acceptable)",
                        "vi": "đầu tư có đạo đức (= đầu tư tiền vào các doanh nghiệp được coi là có thể chấp nhận được về mặt đạo đức)"
                    },
                    {
                        "en": "I don't consider the arms trade to be an ethical one.",
                        "vi": "Tôi không coi việc buôn bán vũ khí là một hành vi đạo đức."
                    }
                ]
            }
        ]
    },
    {
        "id": "e796fac371264d0ca2725c0f6f68d1c1",
        "word": "holy",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhəʊli/",
            "us": "/ˈhəʊli/"
        },
        "nearby": [
            {
                "word": "holster",
                "pos": "verb"
            },
            {
                "word": "Victoria Holt",
                "pos": ""
            },
            {
                "word": "holy",
                "pos": "adjective"
            },
            {
                "word": "Holy Communion",
                "pos": "noun"
            },
            {
                "word": "the Holy Father",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with God or a particular religion",
                    "vi": "kết nối với Chúa hoặc một tôn giáo cụ thể"
                },
                "examples": [
                    {
                        "en": "the Holy Bible",
                        "vi": "kinh Thánh"
                    },
                    {
                        "en": "holy books/scriptures",
                        "vi": "sách thánh / kinh sách"
                    },
                    {
                        "en": "the holy city of Mecca",
                        "vi": "thánh địa Mecca"
                    },
                    {
                        "en": "Islam’s holiest shrine",
                        "vi": "Đền thờ linh thiêng nhất của đạo Hồi"
                    },
                    {
                        "en": "a holy day/month",
                        "vi": "một ngày thánh / tháng"
                    },
                    {
                        "en": "a holy war (= one fought to defend the beliefs of a particular religion)",
                        "vi": "một cuộc thánh chiến (= một người đã chiến đấu để bảo vệ niềm tin của một tôn giáo cụ thể)"
                    },
                    {
                        "en": "holy ground",
                        "vi": "vùng đất thiêng"
                    }
                ]
            },
            {
                "define": {
                    "en": "good in a moral and religious way",
                    "vi": "tốt theo cách đạo đức và tôn giáo"
                },
                "examples": [
                    {
                        "en": "a holy life/man",
                        "vi": "một cuộc sống thánh thiện / người đàn ông"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you are surprised, afraid, etc.",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn ngạc nhiên, sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "Holy cow! What was that?",
                        "vi": "Chúa ơi! Đó là gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "7c9775d81360423eada4b9cf9180b5e0",
        "word": "honor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒnə(r)/",
            "us": "/ˈɑːnər/"
        },
        "nearby": [
            {
                "word": "honky-tonk",
                "pos": "noun"
            },
            {
                "word": "Honolulu",
                "pos": ""
            },
            {
                "word": "honor",
                "pos": "noun"
            },
            {
                "word": "honor",
                "pos": "verb"
            },
            {
                "word": "honorable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great respect for somebody",
                    "vi": "rất tôn trọng ai đó"
                },
                "examples": [
                    {
                        "en": "the guest of honor (= the most important one)",
                        "vi": "vị khách danh dự (= người quan trọng nhất)"
                    },
                    {
                        "en": "the seat/place of honor (= given to the most important guest)",
                        "vi": "ghế / nơi vinh danh (= được trao cho vị khách quan trọng nhất)"
                    },
                    {
                        "en": "They stood in silence as a mark of honor to her.",
                        "vi": "Họ đứng trong im lặng như một sự tôn vinh đối với cô."
                    },
                    {
                        "en": "do honor to somebody/something This biography does great honor to the poet's achievements.",
                        "vi": "làm vinh dự cho ai đó / cái gì đó Tiểu sử này rất vinh dự đối với những thành tựu của nhà thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you are very pleased or proud to do because people are showing you great respect",
                    "vi": "điều gì đó mà bạn rất hài lòng hoặc tự hào khi làm vì mọi người đang thể hiện sự tôn trọng của bạn"
                },
                "examples": [
                    {
                        "en": "It was a great honor to be invited here today.",
                        "vi": "Đó là một vinh dự lớn khi được mời đến đây ngày hôm nay."
                    },
                    {
                        "en": "It was my honor and privilege to be Helen's friend.",
                        "vi": "Đó là vinh dự và đặc ân của tôi khi được làm bạn của Helen."
                    },
                    {
                        "en": "It is a great honor to represent my country at the Olympics.",
                        "vi": "Đó là một vinh dự lớn khi đại diện cho đất nước của tôi tại Thế vận hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of knowing and doing what is morally right",
                    "vi": "phẩm chất của việc biết và làm những gì là đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "a man of honor",
                        "vi": "một người đàn ông của danh dự"
                    },
                    {
                        "en": "a sense of honor",
                        "vi": "một cảm giác vinh dự"
                    },
                    {
                        "en": "Proving his innocence has become a matter of honor.",
                        "vi": "Chứng minh sự vô tội của mình đã trở thành một vấn đề danh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a good reputation; respect from other people",
                    "vi": "một danh tiếng tốt; sự tôn trọng từ những người khác"
                },
                "examples": [
                    {
                        "en": "upholding the honor of your country",
                        "vi": "đề cao danh dự của đất nước bạn"
                    },
                    {
                        "en": "The family honor is at stake.",
                        "vi": "Danh dự của gia đình đang bị đe dọa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that causes others to respect and admire something/somebody",
                    "vi": "một người hoặc một điều khiến người khác tôn trọng và ngưỡng mộ điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She is an honor to the profession.",
                        "vi": "Cô ấy là một vinh dự đối với nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "an award, official title, etc. given to somebody as a reward for something that they have done",
                    "vi": "một giải thưởng, danh hiệu chính thức, v.v. được trao cho ai đó như một phần thưởng cho điều gì đó mà họ đã làm"
                },
                "examples": [
                    {
                        "en": "to win the highest honor",
                        "vi": "để giành được vinh dự cao nhất"
                    },
                    {
                        "en": "She received nearly every honor bestowed upon a poet.",
                        "vi": "Cô nhận được gần như mọi vinh dự do một nhà thơ ban tặng."
                    },
                    {
                        "en": "He was buried with full military honors (= with a special military service as a sign of respect).",
                        "vi": "Ông được chôn cất với đầy đủ các danh hiệu quân sự (= với một nghĩa vụ quân sự đặc biệt như một dấu hiệu của sự tôn trọng)."
                    },
                    {
                        "en": "He wears his scars like badges of honor (= rewards that you can see).",
                        "vi": "Anh ta đeo những vết sẹo của mình như huy hiệu danh dự (= phần thưởng mà bạn có thể nhìn thấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a university course that is of a higher level than a basic course (in the US also used to describe a class in school that is at a higher level than other classes)",
                    "vi": "khóa học đại học ở cấp độ cao hơn khóa học cơ bản (ở Mỹ cũng được sử dụng để mô tả một lớp học trong trường ở cấp độ cao hơn các lớp học khác)"
                },
                "examples": [
                    {
                        "en": "an honors degree/course",
                        "vi": "một bằng cấp danh dự / khóa học"
                    },
                    {
                        "en": "a First Class Honors degree",
                        "vi": "bằng Danh dự Hạng Nhất"
                    },
                    {
                        "en": "(North American English) I took an honors class in English.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã học một lớp danh dự bằng tiếng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you pass an exam or graduate from a university or school with honors, you receive a special grade for having achieved a very high standard",
                    "vi": "nếu bạn vượt qua một kỳ thi hoặc tốt nghiệp từ một trường đại học hoặc trường học xuất sắc, bạn sẽ nhận được điểm đặc biệt vì đã đạt được tiêu chuẩn rất cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a title of respect used when talking to or about a judge or a US mayor",
                    "vi": "một danh hiệu tôn trọng được sử dụng khi nói chuyện với hoặc về thẩm phán hoặc thị trưởng Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "No more questions, Your Honor.",
                        "vi": "Không còn câu hỏi nào nữa, thưa Ngài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cards that have the highest value",
                    "vi": "thẻ có giá trị cao nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something to make somebody feel very proud and pleased",
                    "vi": "làm điều gì đó để khiến ai đó cảm thấy rất tự hào và hài lòng"
                },
                "examples": [
                    {
                        "en": "Would you do me the honor of dining with me?",
                        "vi": "Bạn có thể làm cho tôi vinh dự được ăn tối với tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a social duty or ceremony, such as pouring drinks, making a speech, etc.",
                    "vi": "để thực hiện một nghĩa vụ xã hội hoặc nghi lễ, chẳng hạn như rót đồ uống, phát biểu, v.v."
                },
                "examples": [
                    {
                        "en": "Would you do the honors and draw the winning ticket?",
                        "vi": "Bạn có làm được danh dự và rút được tấm vé chiến thắng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be given the opportunity to do something that makes you feel proud and happy",
                    "vi": "được trao cơ hội để làm điều gì đó khiến bạn cảm thấy tự hào và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "May I have the honor of the next dance?",
                        "vi": "Tôi có thể có vinh dự của buổi khiêu vũ tiếp theo không?"
                    },
                    {
                        "en": "She had the honor of being the first living artist to have her work exhibited in the Louvre.",
                        "vi": "Cô có vinh dự là nghệ sĩ còn sống đầu tiên được trưng bày tác phẩm của mình tại Louvre."
                    },
                    {
                        "en": "I had the rare honor of being allowed into the artist's studio.",
                        "vi": "Tôi có vinh dự hiếm hoi được phép vào phòng thu của nghệ sĩ."
                    },
                    {
                        "en": "Max was given the dubious honor (= it may not really have made him feel proud and happy) of organizing the children's party.",
                        "vi": "Max đã được trao cho vinh dự không rõ ràng (= nó có thể không thực sự khiến anh ấy cảm thấy tự hào và hạnh phúc) khi tổ chức bữa tiệc cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that even criminals have standards of behaviour that they respect",
                    "vi": "được sử dụng để nói rằng ngay cả tội phạm cũng có các tiêu chuẩn hành vi mà họ tôn trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel that you must do something because of your sense of moral duty",
                    "vi": "để cảm thấy rằng bạn phải làm điều gì đó vì ý thức của bạn về nghĩa vụ đạo đức"
                },
                "examples": [
                    {
                        "en": "He felt honor-bound to help her.",
                        "vi": "Anh cảm thấy có vinh dự được giúp đỡ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "no particular person, team, etc. is doing better than the others in a competition, an argument, etc.",
                    "vi": "không có người, đội cụ thể nào, v.v. làm tốt hơn những người khác trong một cuộc thi, một cuộc tranh cãi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in order to show great respect for somebody/something",
                    "vi": "để thể hiện sự tôn trọng tuyệt đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a ceremony in honor of those killed in the explosion",
                        "vi": "một buổi lễ vinh danh những người thiệt mạng trong vụ nổ"
                    },
                    {
                        "en": "A banquet was held in her honor.",
                        "vi": "Một bữa tiệc được tổ chức để vinh danh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to promise very seriously that you will do something or that something is true",
                    "vi": "từng hứa rất nghiêm túc rằng bạn sẽ làm điều gì đó hoặc điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "I swear on my honor that I knew nothing about this.",
                        "vi": "Tôi xin thề trên danh dự của mình rằng tôi không biết gì về điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be trusted to do something",
                    "vi": "được tin tưởng để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You're on your honor not to go into my room.",
                        "vi": "Bạn vinh dự không vào phòng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody considers to be very important for their honour or reputation",
                    "vi": "một điều mà ai đó coi là rất quan trọng đối với danh dự hoặc danh tiếng của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "17dd8a999a4c4732be8d42184fbbe9a7",
        "word": "honour",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒnə(r)/",
            "us": "/ˈɑːnər/"
        },
        "nearby": [
            {
                "word": "honor society",
                "pos": "noun"
            },
            {
                "word": "honor system",
                "pos": "noun"
            },
            {
                "word": "honour",
                "pos": "noun"
            },
            {
                "word": "honour",
                "pos": "verb"
            },
            {
                "word": "honourable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great respect for somebody",
                    "vi": "rất tôn trọng ai đó"
                },
                "examples": [
                    {
                        "en": "the guest of honour (= the most important one)",
                        "vi": "vị khách danh dự (= người quan trọng nhất)"
                    },
                    {
                        "en": "the seat/place of honour (= given to the most important guest)",
                        "vi": "ghế / nơi vinh danh (= được trao cho vị khách quan trọng nhất)"
                    },
                    {
                        "en": "They stood in silence as a mark of honour to her.",
                        "vi": "Họ đứng trong im lặng như một sự tôn vinh đối với cô."
                    },
                    {
                        "en": "do honour to somebody/something This biography does great honour to the poet's achievements.",
                        "vi": "làm vinh dự cho ai đó / cái gì đó Tiểu sử này rất vinh dự đối với những thành tựu của nhà thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you are very pleased or proud to do because people are showing you great respect",
                    "vi": "điều gì đó mà bạn rất hài lòng hoặc tự hào khi làm vì mọi người đang thể hiện sự tôn trọng của bạn"
                },
                "examples": [
                    {
                        "en": "honour to do something It was a great honour to be invited here today.",
                        "vi": "vinh dự được làm điều gì đó Thật vinh dự khi được mời đến đây hôm nay."
                    },
                    {
                        "en": "It is a great honour to represent my country at the Olympics.",
                        "vi": "Đó là một vinh dự lớn khi đại diện cho đất nước của tôi tại Thế vận hội."
                    },
                    {
                        "en": "It was my honour and privilege to be Helen's friend.",
                        "vi": "Đó là vinh dự và đặc ân của tôi khi được làm bạn của Helen."
                    },
                    {
                        "en": "honour of doing something The city has the dubious honour (= something that does not make you pleased or proud) of being the road rage capital of Europe.",
                        "vi": "vinh dự làm điều gì đó Thành phố có vinh dự không rõ ràng (= điều gì đó không làm bạn hài lòng hoặc tự hào) là thủ đô thịnh nộ đường của Châu Âu."
                    },
                    {
                        "en": "He shared the honour of being the season's top scorer with Andy Cole.",
                        "vi": "Anh ấy đã chia sẻ niềm vinh dự là cầu thủ ghi bàn hàng đầu của mùa giải với Andy Cole."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of knowing and doing what is morally right",
                    "vi": "phẩm chất của việc biết và làm những gì là đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "a man of honour",
                        "vi": "một người đàn ông của danh dự"
                    },
                    {
                        "en": "Proving his innocence has become a matter of honour.",
                        "vi": "Chứng minh sự vô tội của mình đã trở thành một vấn đề danh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a good reputation; respect from other people",
                    "vi": "một danh tiếng tốt; sự tôn trọng từ những người khác"
                },
                "examples": [
                    {
                        "en": "upholding the honour of your country",
                        "vi": "đề cao danh dự của đất nước bạn"
                    },
                    {
                        "en": "The family honour is at stake.",
                        "vi": "Danh dự của gia đình đang bị đe dọa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that causes others to respect and admire something/somebody",
                    "vi": "một người hoặc một điều khiến người khác tôn trọng và ngưỡng mộ điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She is an honour to the profession.",
                        "vi": "Cô ấy là một vinh dự đối với nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "an award, official title, etc. given to somebody as a reward for something that they have done",
                    "vi": "một giải thưởng, danh hiệu chính thức, v.v. được trao cho ai đó như một phần thưởng cho điều gì đó mà họ đã làm"
                },
                "examples": [
                    {
                        "en": "the New Year’s Honours list (= in Britain, a list of awards and titles given on January 1 each year)",
                        "vi": "danh sách Danh dự Năm mới (= ở Anh, danh sách các giải thưởng và danh hiệu được trao vào ngày 1 tháng 1 hàng năm)"
                    },
                    {
                        "en": "to receive/win the highest honour",
                        "vi": "để nhận được / giành được vinh dự cao nhất"
                    },
                    {
                        "en": "to bestow an honour on somebody",
                        "vi": "để ban tặng một vinh dự cho ai đó"
                    },
                    {
                        "en": "She received nearly every honour bestowed upon a poet.",
                        "vi": "Cô nhận được gần như mọi vinh dự do một nhà thơ ban tặng."
                    },
                    {
                        "en": "He received numerous honours, including the OBE in 1961.",
                        "vi": "Ông đã nhận được nhiều danh hiệu, bao gồm cả OBE vào năm 1961."
                    },
                    {
                        "en": "He was buried with full military honours (= with a special military service as a sign of respect).",
                        "vi": "Ông được chôn cất với đầy đủ các danh hiệu quân sự (= với một nghĩa vụ quân sự đặc biệt như một dấu hiệu của sự tôn trọng)."
                    },
                    {
                        "en": "He wears his scars like badges of honour (= rewards that you can see).",
                        "vi": "Anh ta đeo những vết sẹo của mình như huy hiệu danh dự (= phần thưởng mà bạn có thể nhìn thấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a university course that is of a higher level than a basic course (in the US also used to describe a class in school that is at a higher level than other classes)",
                    "vi": "khóa học đại học ở cấp độ cao hơn khóa học cơ bản (ở Mỹ cũng được sử dụng để mô tả một lớp học trong trường ở cấp độ cao hơn các lớp học khác)"
                },
                "examples": [
                    {
                        "en": "an honours degree/course",
                        "vi": "một bằng cấp danh dự / khóa học"
                    },
                    {
                        "en": "a First Class Honours degree",
                        "vi": "bằng Danh dự Hạng Nhất"
                    },
                    {
                        "en": "(North American English) I took an honors class in English.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã học một lớp danh dự bằng tiếng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you pass an exam or graduate from a university or school with honours, you receive a special grade for having achieved a very high standard",
                    "vi": "nếu bạn vượt qua một kỳ thi hoặc tốt nghiệp từ một trường đại học hoặc trường học xuất sắc, bạn sẽ nhận được điểm đặc biệt vì đã đạt được tiêu chuẩn rất cao"
                },
                "examples": [
                    {
                        "en": "He passed with second-class honours.",
                        "vi": "Anh đã đỗ bằng danh dự hạng nhì."
                    }
                ]
            },
            {
                "define": {
                    "en": "a title of respect used when talking to or about a judge or a US mayor",
                    "vi": "một danh hiệu tôn trọng được sử dụng khi nói chuyện với hoặc về thẩm phán hoặc thị trưởng Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "No more questions, Your Honour.",
                        "vi": "Không còn câu hỏi nào nữa, thưa Ngài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cards that have the highest value",
                    "vi": "thẻ có giá trị cao nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something to make somebody feel very proud and pleased",
                    "vi": "làm điều gì đó để khiến ai đó cảm thấy rất tự hào và hài lòng"
                },
                "examples": [
                    {
                        "en": "Would you do me the honour of dining with me?",
                        "vi": "Bạn có thể làm cho tôi vinh dự được ăn tối với tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a social duty or ceremony, such as pouring drinks, making a speech, etc.",
                    "vi": "để thực hiện một nghĩa vụ xã hội hoặc nghi lễ, chẳng hạn như rót đồ uống, phát biểu, v.v."
                },
                "examples": [
                    {
                        "en": "Would you do the honours and draw the winning ticket?",
                        "vi": "Bạn có làm được danh dự và rút được tấm vé chiến thắng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be given the opportunity to do something that makes you feel proud and happy",
                    "vi": "được trao cơ hội để làm điều gì đó khiến bạn cảm thấy tự hào và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "May I have the honour of the next dance?",
                        "vi": "Tôi có thể có vinh dự của buổi khiêu vũ tiếp theo không?"
                    },
                    {
                        "en": "It was Tevez who had the honour of scoring the first goal.",
                        "vi": "Chính Tevez là người có vinh dự ghi bàn đầu tiên."
                    },
                    {
                        "en": "She had the honour of being the first living artist to have her work exhibited in the Louvre.",
                        "vi": "Cô có vinh dự là nghệ sĩ còn sống đầu tiên được trưng bày tác phẩm của mình tại Louvre."
                    },
                    {
                        "en": "I had the rare honour of being allowed into the artist's studio.",
                        "vi": "Tôi có vinh dự hiếm hoi được phép vào phòng thu của nghệ sĩ."
                    },
                    {
                        "en": "Max was given the dubious honour (= it may not really have made him feel proud and happy) of organizing the children's party.",
                        "vi": "Max đã được trao cho vinh dự không rõ ràng (= nó có thể không thực sự khiến anh ấy cảm thấy tự hào và hạnh phúc) khi tổ chức bữa tiệc cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that even criminals have standards of behaviour that they respect",
                    "vi": "được sử dụng để nói rằng ngay cả tội phạm cũng có các tiêu chuẩn hành vi mà họ tôn trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel that you must do something because of your sense of moral duty",
                    "vi": "để cảm thấy rằng bạn phải làm điều gì đó vì ý thức của bạn về nghĩa vụ đạo đức"
                },
                "examples": [
                    {
                        "en": "She felt honour-bound to attend as she had promised to.",
                        "vi": "Cô cảm thấy vinh dự được tham dự như những gì cô đã hứa."
                    },
                    {
                        "en": "He felt honour bound to help her.",
                        "vi": "Anh cảm thấy vinh dự khi được giúp đỡ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "no particular person, team, etc. is doing better than the others in a competition, an argument, etc.",
                    "vi": "không có người, đội cụ thể nào, v.v. làm tốt hơn những người khác trong một cuộc thi, một cuộc tranh cãi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in order to show great respect for somebody/something",
                    "vi": "để thể hiện sự tôn trọng tuyệt đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a ceremony in honour of those killed in the explosion",
                        "vi": "một buổi lễ vinh danh những người thiệt mạng trong vụ nổ"
                    },
                    {
                        "en": "A banquet was held in her honour.",
                        "vi": "Một bữa tiệc được tổ chức để vinh danh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to promise very seriously that you will do something or that something is true",
                    "vi": "từng hứa rất nghiêm túc rằng bạn sẽ làm điều gì đó hoặc điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "I swear on my honour that I knew nothing about this.",
                        "vi": "Tôi xin thề trên danh dự của mình rằng tôi không biết gì về điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be trusted to do something",
                    "vi": "được tin tưởng để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You're on your honour not to go into my room.",
                        "vi": "Bạn vinh dự không vào phòng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody considers to be very important for their honour or reputation",
                    "vi": "một điều mà ai đó coi là rất quan trọng đối với danh dự hoặc danh tiếng của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f842cb38b7b471caac3c3b4df64a555",
        "word": "moral",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒrəl/",
            "us": "/ˈmɔːrəl/"
        },
        "nearby": [
            {
                "word": "MOR",
                "pos": "noun"
            },
            {
                "word": "moraine",
                "pos": "noun"
            },
            {
                "word": "moral",
                "pos": "adjective"
            },
            {
                "word": "moral",
                "pos": "noun"
            },
            {
                "word": "moral compass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with principles of right and wrong behaviour",
                    "vi": "kết nối với các nguyên tắc hành vi đúng và sai"
                },
                "examples": [
                    {
                        "en": "a moral issue/dilemma",
                        "vi": "một vấn đề đạo đức / tiến thoái lưỡng nan"
                    },
                    {
                        "en": "traditional moral values",
                        "vi": "giá trị đạo đức truyền thống"
                    },
                    {
                        "en": "a decline in moral standards",
                        "vi": "sự suy giảm các tiêu chuẩn đạo đức"
                    },
                    {
                        "en": "moral and ethical questions",
                        "vi": "câu hỏi đạo đức và đạo đức"
                    },
                    {
                        "en": "The basic moral philosophies of most world religions are remarkably similar.",
                        "vi": "Các triết lý đạo đức cơ bản của hầu hết các tôn giáo trên thế giới đều giống nhau một cách đáng kể."
                    },
                    {
                        "en": "He was a deeply religious man with a highly developed moral sense.",
                        "vi": "Ông là một người đàn ông sùng đạo sâu sắc với một ý thức đạo đức rất phát triển."
                    },
                    {
                        "en": "The newspapers were full of moral outrage at the weakness of other countries.",
                        "vi": "Các tờ báo đầy sự phẫn nộ về mặt đạo đức trước sự yếu kém của các quốc gia khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "based on your own sense of what is right and fair, not on legal rights or duties",
                    "vi": "dựa trên ý thức của riêng bạn về điều gì là đúng và công bằng, không dựa trên các quyền hoặc nghĩa vụ pháp lý"
                },
                "examples": [
                    {
                        "en": "moral responsibility/duty/authority",
                        "vi": "trách nhiệm đạo đức / nghĩa vụ / quyền hạn"
                    },
                    {
                        "en": "We have a moral imperative to help whenever we can.",
                        "vi": "Chúng ta có mệnh lệnh đạo đức là phải giúp đỡ bất cứ khi nào chúng ta có thể."
                    },
                    {
                        "en": "I make no moral judgement on this decision.",
                        "vi": "Tôi không đưa ra phán xét đạo đức nào về quyết định này."
                    },
                    {
                        "en": "Governments have at least a moral obligation to answer these questions.",
                        "vi": "Các chính phủ ít nhất phải có nghĩa vụ đạo đức để trả lời những câu hỏi này."
                    },
                    {
                        "en": "Children learn to develop their own moral code for adulthood.",
                        "vi": "Trẻ em học cách phát triển quy tắc đạo đức của riêng mình khi trưởng thành."
                    },
                    {
                        "en": "The job was to call on all her diplomatic skills and moral courage (= the courage to do what you think is right).",
                        "vi": "Công việc là kêu gọi tất cả các kỹ năng ngoại giao và lòng can đảm đạo đức của cô ấy (= sự can đảm để làm những gì bạn cho là đúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "following the standards of behaviour considered acceptable and right by most people",
                    "vi": "tuân theo các tiêu chuẩn hành vi được hầu hết mọi người coi là có thể chấp nhận và đúng đắn"
                },
                "examples": [
                    {
                        "en": "He led a very moral life.",
                        "vi": "Ông đã sống một cuộc sống rất đạo đức."
                    },
                    {
                        "en": "a very moral person",
                        "vi": "một người rất đạo đức"
                    },
                    {
                        "en": "We try to teach our students to be conscientious, moral young people.",
                        "vi": "Chúng tôi cố gắng dạy học sinh của mình trở thành những người trẻ có lương tâm, có đạo đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to understand the difference between right and wrong",
                    "vi": "có thể hiểu sự khác biệt giữa đúng và sai"
                },
                "examples": [
                    {
                        "en": "Children are not naturally moral beings.",
                        "vi": "Trẻ em không tự nhiên là những sinh vật có đạo đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to claim that your side of an argument is morally better than your opponents’ side; to argue in a way that makes your side seem morally better",
                    "vi": "để khẳng định rằng phe lập luận của bạn tốt hơn về mặt đạo đức so với phe đối thủ của bạn; tranh luận theo cách làm cho phe của bạn có vẻ tốt hơn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "I was angry with his blatant attempt to take the moral high ground.",
                        "vi": "Tôi tức giận với nỗ lực trắng trợn của anh ta để lấy điểm cao về mặt đạo đức."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b3e824e2a7148f69ebd8d866883f616",
        "word": "principle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈprɪnsəpl/",
            "us": "/ˈprɪnsəpl/"
        },
        "nearby": [
            {
                "word": "principally",
                "pos": "adverb"
            },
            {
                "word": "principal parts",
                "pos": "noun"
            },
            {
                "word": "principle",
                "pos": "noun"
            },
            {
                "word": "principled",
                "pos": "adjective"
            },
            {
                "word": "Pringle",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a moral rule or a strong belief that influences your actions",
                    "vi": "một quy tắc đạo đức hoặc một niềm tin mạnh mẽ ảnh hưởng đến hành động của bạn"
                },
                "examples": [
                    {
                        "en": "He has high moral principles.",
                        "vi": "Anh ấy có những nguyên tắc đạo đức cao."
                    },
                    {
                        "en": "Stick to your principles and tell him you won't do it.",
                        "vi": "Hãy tuân thủ các nguyên tắc của bạn và nói với anh ấy rằng bạn sẽ không làm điều đó."
                    },
                    {
                        "en": "against your principles I refuse to lie about it; it's against my principles.",
                        "vi": "chống lại các nguyên tắc của bạn, tôi từ chối nói dối về nó; nó trái với nguyên tắc của tôi."
                    },
                    {
                        "en": "on principle He doesn't invest in the arms industry on principle.",
                        "vi": "về nguyên tắc Anh ấy không đầu tư vào ngành công nghiệp vũ khí."
                    },
                    {
                        "en": "She refuses to allow her family to help her as a matter of principle.",
                        "vi": "Cô từ chối cho phép gia đình giúp cô như một vấn đề nguyên tắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a law, a rule or a theory that something is based on",
                    "vi": "một luật, một quy tắc hoặc một lý thuyết mà một cái gì đó dựa trên"
                },
                "examples": [
                    {
                        "en": "The same principles apply to both humans and animals.",
                        "vi": "Các nguyên tắc tương tự áp dụng cho cả người và động vật."
                    },
                    {
                        "en": "an important legal principle",
                        "vi": "một nguyên tắc pháp lý quan trọng"
                    },
                    {
                        "en": "‘You learn general principles from studying particular things,’ he asserts.",
                        "vi": "Ông khẳng định: “Bạn học được những nguyên tắc chung từ việc nghiên cứu những điều cụ thể."
                    },
                    {
                        "en": "principle of something the basic principles of car maintenance",
                        "vi": "nguyên tắc của một cái gì đó các nguyên tắc cơ bản của bảo dưỡng ô tô"
                    },
                    {
                        "en": "There are three fundamental principles of teamwork.",
                        "vi": "Có ba nguyên tắc cơ bản của làm việc nhóm."
                    },
                    {
                        "en": "to learn the basic/general principles of something",
                        "vi": "để tìm hiểu các nguyên tắc cơ bản / chung của một cái gì đó"
                    },
                    {
                        "en": "the principles of justice/law",
                        "vi": "các nguyên tắc của công lý / luật pháp"
                    },
                    {
                        "en": "principle of doing something the principles and practice of writing reports",
                        "vi": "nguyên tắc làm một cái gì đó các nguyên tắc và thực hành viết báo cáo"
                    },
                    {
                        "en": "principle for something draft principles for the management of shared natural resources",
                        "vi": "nguyên tắc cho một cái gì đó dự thảo các nguyên tắc để quản lý các nguồn tài nguyên thiên nhiên được chia sẻ"
                    },
                    {
                        "en": "principle for doing something a document setting out principles for resolving the dispute",
                        "vi": "nguyên tắc để làm điều gì đó một tài liệu đưa ra các nguyên tắc để giải quyết tranh chấp"
                    },
                    {
                        "en": "principle behind something The principle behind it is very simple.",
                        "vi": "Nguyên tắc đằng sau một cái gì đó Nguyên tắc đằng sau nó rất đơn giản."
                    },
                    {
                        "en": "Discussing all these details will get us nowhere; we must get back to first principles (= the most basic rules).",
                        "vi": "Thảo luận về tất cả những chi tiết này sẽ giúp chúng ta không đi đến đâu; chúng ta phải quay lại các nguyên tắc đầu tiên (= các quy tắc cơ bản nhất)."
                    },
                    {
                        "en": "The court derived a set of principles from this general rule.",
                        "vi": "Tòa án đã đưa ra một loạt các nguyên tắc từ quy tắc chung này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a belief that is accepted as a reason for acting or thinking in a particular way",
                    "vi": "một niềm tin được chấp nhận như một lý do để hành động hoặc suy nghĩ theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "The welfare of the child is the guiding principle of the family courts.",
                        "vi": "Phúc lợi của đứa trẻ là nguyên tắc chỉ đạo của các tòa án gia đình."
                    },
                    {
                        "en": "They were accused of violating the principles of democracy.",
                        "vi": "Họ bị buộc tội vi phạm các nguyên tắc dân chủ."
                    },
                    {
                        "en": "The principle of equality is enshrined in the Constitution.",
                        "vi": "Nguyên tắc bình đẳng được ghi trong Hiến pháp."
                    },
                    {
                        "en": "principle that… the application of the principle that men and women should receive equal pay for equal work",
                        "vi": "nguyên tắc rằng… việc áp dụng nguyên tắc nam và nữ phải được trả công bình đẳng cho công việc như nhau"
                    },
                    {
                        "en": "The UN declaration sought to establish the principle that everyone is entitled to the same basic rights",
                        "vi": "Tuyên bố của Liên hợp quốc nhằm thiết lập nguyên tắc rằng mọi người đều được hưởng các quyền cơ bản như nhau"
                    },
                    {
                        "en": "the principle that free education should be available for all children",
                        "vi": "nguyên tắc rằng giáo dục miễn phí nên có sẵn cho tất cả trẻ em"
                    },
                    {
                        "en": "in accordance with a principle Ethical behaviour entails acting in accordance with established principles of right and wrong",
                        "vi": "phù hợp với một nguyên tắc Hành vi đạo đức đòi hỏi hành động phù hợp với các nguyên tắc đúng và sai đã được thiết lập"
                    }
                ]
            },
            {
                "define": {
                    "en": "a general or scientific law that explains how something works or why something happens",
                    "vi": "một quy luật chung hoặc khoa học giải thích cách thức hoạt động của một thứ gì đó hoặc tại sao điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "O'Sullivan was among the first chemists to apply scientific principles to brewing beer.",
                        "vi": "O'Sullivan là một trong những nhà hóa học đầu tiên áp dụng các nguyên tắc khoa học để sản xuất bia."
                    },
                    {
                        "en": "principle that… the principle that heat rises",
                        "vi": "nguyên tắc rằng ... nguyên lý mà nhiệt tăng lên"
                    },
                    {
                        "en": "in principle A tidal current turbine is similar in principle to a windmill.",
                        "vi": "về nguyên tắc Một tuabin dòng thủy triều về nguyên tắc tương tự như một cối xay gió."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something can be done in principle, there is no good reason why it should not be done although it has not yet been done and there may be some difficulties",
                    "vi": "nếu một điều gì đó có thể được thực hiện về nguyên tắc, không có lý do chính đáng tại sao nó không nên được thực hiện mặc dù nó chưa được thực hiện và có thể gặp một số khó khăn"
                },
                "examples": [
                    {
                        "en": "In principle there is nothing that a human can do that a machine might not be able to do one day.",
                        "vi": "Về nguyên tắc, không có gì mà con người có thể làm được mà một ngày nào đó máy móc không thể làm được."
                    }
                ]
            },
            {
                "define": {
                    "en": "in general but not in detail",
                    "vi": "nói chung nhưng không chi tiết"
                },
                "examples": [
                    {
                        "en": "They have agreed to the proposal in principle but we still have to negotiate the terms.",
                        "vi": "Về nguyên tắc, họ đã đồng ý với đề xuất này nhưng chúng tôi vẫn phải thương lượng các điều khoản."
                    },
                    {
                        "en": "I agree with you in principle, but we'll need to discuss the details.",
                        "vi": "Tôi đồng ý với bạn về nguyên tắc, nhưng chúng ta sẽ cần thảo luận chi tiết."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfb346caf15c4553833a5878643a8a90",
        "word": "conscience",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒnʃəns/",
            "us": "/ˈkɑːnʃəns/"
        },
        "nearby": [
            {
                "word": "Joseph Conrad",
                "pos": ""
            },
            {
                "word": "consanguinity",
                "pos": "noun"
            },
            {
                "word": "conscience",
                "pos": "noun"
            },
            {
                "word": "conscience-stricken",
                "pos": "adjective"
            },
            {
                "word": "conscientious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of your mind that tells you whether your actions are right or wrong",
                    "vi": "phần tâm trí cho bạn biết hành động của bạn là đúng hay sai"
                },
                "examples": [
                    {
                        "en": "to have a clear/guilty conscience (= to feel that you have done right/wrong)",
                        "vi": "có lương tâm trong sáng / có tội (= cảm thấy rằng bạn đã làm đúng / sai)"
                    },
                    {
                        "en": "This is a matter of individual conscience (= everyone must make their own judgement about it).",
                        "vi": "Đây là vấn đề của lương tâm cá nhân (= mọi người phải tự nhận định về vấn đề này)."
                    },
                    {
                        "en": "He won't let it trouble his conscience.",
                        "vi": "Anh ấy sẽ không để nó làm phiền lương tâm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a guilty feeling about something you have done or failed to do",
                    "vi": "cảm giác tội lỗi về điều gì đó bạn đã làm hoặc không làm được"
                },
                "examples": [
                    {
                        "en": "She was seized by a sudden pang of conscience.",
                        "vi": "Cô bị cắn rứt bởi lương tâm bất chợt."
                    },
                    {
                        "en": "I have a terrible conscience about it.",
                        "vi": "Tôi có một lương tâm khủng khiếp về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of behaving in a way that you feel is right even though this may cause problems",
                    "vi": "thực tế là hành xử theo cách mà bạn cảm thấy là đúng mặc dù điều này có thể gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "freedom of conscience (= the freedom to do what you believe to be right)",
                        "vi": "tự do lương tâm (= tự do làm những gì bạn tin là đúng)"
                    },
                    {
                        "en": "Emilia is the voice of conscience in the play.",
                        "vi": "Emilia là tiếng nói của lương tâm trong vở kịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "believing your actions to be fair",
                    "vi": "tin rằng hành động của bạn là công bằng"
                },
                "examples": [
                    {
                        "en": "We cannot in all conscience refuse to help.",
                        "vi": "Lương tâm chúng ta không thể từ chối giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel guilty for doing or failing to do something",
                    "vi": "khiến bạn cảm thấy tội lỗi khi làm hoặc không làm được điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'll write and apologize. I've had it on my conscience for weeks.",
                        "vi": "Tôi sẽ viết thư và xin lỗi. Tôi đã có nó trong lương tâm của tôi trong nhiều tuần."
                    },
                    {
                        "en": "It’s still on my conscience that I didn’t warn him in time.",
                        "vi": "Tôi vẫn còn lương tâm rằng tôi đã không cảnh báo anh ta kịp thời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel guilty about something; to feel guilty about something",
                    "vi": "khiến bạn cảm thấy tội lỗi về điều gì đó; cảm thấy tội lỗi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Her conscience pricked her as she lied to her sister.",
                        "vi": "Lương tâm của cô cắn rứt khi cô nói dối em gái mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0312cff46fb4c40b7e40be43fd05310",
        "word": "ethos",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈiːθɒs/",
            "us": "/ˈiːθɑːs/"
        },
        "nearby": [
            {
                "word": "ethnologist",
                "pos": "noun"
            },
            {
                "word": "ethnology",
                "pos": "noun"
            },
            {
                "word": "ethos",
                "pos": "noun"
            },
            {
                "word": "ethyl",
                "pos": "adjective"
            },
            {
                "word": "ethyl alcohol",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the moral ideas and attitudes that belong to a particular group, society or person",
                    "vi": "những ý tưởng và thái độ đạo đức thuộc về một nhóm, xã hội hoặc con người cụ thể"
                },
                "examples": [
                    {
                        "en": "an ethos of public service",
                        "vi": "một đặc tính của dịch vụ công cộng"
                    },
                    {
                        "en": "the carefree Californian ethos",
                        "vi": "đặc tính của người California vô tư"
                    },
                    {
                        "en": "Teaching was central to his ethos.",
                        "vi": "Giảng dạy là trung tâm trong đặc tính của ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "0cedf54cea474da980d54e7e9da6bc35",
        "word": "honorable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɒnərəbl/",
            "us": "/ˈɑːnərəbl/"
        },
        "nearby": [
            {
                "word": "honor",
                "pos": "noun"
            },
            {
                "word": "honor",
                "pos": "verb"
            },
            {
                "word": "honorable",
                "pos": "adjective"
            },
            {
                "word": "honorarium",
                "pos": "noun"
            },
            {
                "word": "honorary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "deserving great respect",
                    "vi": "xứng đáng được tôn trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "showing high moral standards",
                    "vi": "thể hiện các tiêu chuẩn đạo đức cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "allowing somebody to keep their good name and the respect of others",
                    "vi": "cho phép ai đó giữ tên tốt của họ và sự tôn trọng của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a title of respect used for an official of high rank",
                    "vi": "một danh hiệu tôn trọng được sử dụng cho một quan chức cấp cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b76f0314e19445c98c02e4539d0b32c2",
        "word": "honourable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɒnərəbl/",
            "us": "/ˈɑːnərəbl/"
        },
        "nearby": [
            {
                "word": "honour",
                "pos": "noun"
            },
            {
                "word": "honour",
                "pos": "verb"
            },
            {
                "word": "honourable",
                "pos": "adjective"
            },
            {
                "word": "the Honourable Artillery Company",
                "pos": ""
            },
            {
                "word": "honourable mention",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "deserving great respect",
                    "vi": "xứng đáng được tôn trọng"
                },
                "examples": [
                    {
                        "en": "She had a long and honourable career in government.",
                        "vi": "Bà đã có một sự nghiệp lâu dài và danh giá trong chính phủ."
                    },
                    {
                        "en": "They managed an honourable 2–2 draw.",
                        "vi": "Họ đã có được một trận hòa 2–2 danh dự."
                    },
                    {
                        "en": "With a few honourable exceptions, the staff were found to be incompetent.",
                        "vi": "Với một vài trường hợp ngoại lệ được vinh danh, các nhân viên được coi là không đủ năng lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing high moral standards",
                    "vi": "thể hiện các tiêu chuẩn đạo đức cao"
                },
                "examples": [
                    {
                        "en": "He was an honourable man who could not lie.",
                        "vi": "Ông là một người đàn ông đáng kính và không thể nói dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowing somebody to keep their good name and the respect of others",
                    "vi": "cho phép ai đó giữ tên tốt của họ và sự tôn trọng của người khác"
                },
                "examples": [
                    {
                        "en": "an honourable compromise",
                        "vi": "một thỏa hiệp danh dự"
                    },
                    {
                        "en": "They urged her to do the honourable thing and resign.",
                        "vi": "Họ thúc giục cô làm điều danh dự và từ chức."
                    },
                    {
                        "en": "He received an honourable discharge from the army.",
                        "vi": "Anh được giải ngũ danh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a title used by a child of some ranks of the nobility",
                    "vi": "(ở Anh) một danh hiệu được sử dụng bởi một đứa trẻ thuộc một số cấp bậc trong giới quý tộc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) a title used by Members of Parliament when talking about or to another Member during a debate",
                    "vi": "(ở Vương quốc Anh) một chức danh được các Thành viên Nghị viện sử dụng khi nói về hoặc với Thành viên khác trong cuộc tranh luận"
                },
                "examples": [
                    {
                        "en": "If my Honourable Friend would give me a chance to answer,…",
                        "vi": "Nếu Người Bạn Đáng kính của tôi cho tôi cơ hội trả lời,…"
                    },
                    {
                        "en": "Would the Honourable Member agree that…?",
                        "vi": "Thành viên đáng kính có đồng ý rằng…?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a title of respect used for an official of high rank",
                    "vi": "một danh hiệu tôn trọng được sử dụng cho một quan chức cấp cao"
                },
                "examples": [
                    {
                        "en": "the Honorable Alan Simpson, US senator",
                        "vi": "Alan Simpson, thượng nghị sĩ Hoa Kỳ"
                    }
                ]
            }
        ]
    },
    {
        "id": "3c13bc701fef441aa8ba34c8580e3d6f",
        "word": "judgemental",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dʒʌdʒˈmentl/",
            "us": "/dʒʌdʒˈmentl/"
        },
        "nearby": [
            {
                "word": "Judge Judy",
                "pos": ""
            },
            {
                "word": "judgement",
                "pos": "noun"
            },
            {
                "word": "judgemental",
                "pos": "adjective"
            },
            {
                "word": "judgement call",
                "pos": "noun"
            },
            {
                "word": "Judgement Day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "judging people and criticizing them too quickly",
                    "vi": "đánh giá mọi người và chỉ trích họ quá nhanh"
                },
                "examples": [
                    {
                        "en": "Stop always being so judgemental!",
                        "vi": "Đừng luôn phán xét như vậy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the process of judging things",
                    "vi": "kết nối với quá trình đánh giá mọi thứ"
                },
                "examples": [
                    {
                        "en": "the judgemental process",
                        "vi": "quá trình phán xét"
                    }
                ]
            }
        ]
    },
    {
        "id": "5fe901be8b59456b800bbd4915904455",
        "word": "morality",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈræləti/",
            "us": "/məˈræləti/"
        },
        "nearby": [
            {
                "word": "moralist",
                "pos": "noun"
            },
            {
                "word": "moralistic",
                "pos": "adjective"
            },
            {
                "word": "morality",
                "pos": "noun"
            },
            {
                "word": "morality play",
                "pos": "noun"
            },
            {
                "word": "moralize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "principles relating to right and wrong or good and bad behaviour",
                    "vi": "các nguyên tắc liên quan đến đúng và sai hoặc hành vi tốt và xấu"
                },
                "examples": [
                    {
                        "en": "matters of public/private morality",
                        "vi": "vấn đề đạo đức công / tư"
                    },
                    {
                        "en": "Standards of morality seem to be dropping.",
                        "vi": "Các tiêu chuẩn về đạo đức dường như đang giảm xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the degree to which something is right or wrong, good or bad, etc. according to moral principles",
                    "vi": "mức độ điều gì đó đúng hay sai, tốt hay xấu, v.v. theo các nguyên tắc đạo đức"
                },
                "examples": [
                    {
                        "en": "There is a continuing debate on the morality of abortion.",
                        "vi": "Có một cuộc tranh luận tiếp tục về đạo đức của việc phá thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of moral principles followed by a particular group of people",
                    "vi": "một hệ thống các nguyên tắc đạo đức được tuân theo bởi một nhóm người cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1245216e3ce241d68f9d1f206db33cc1",
        "word": "noble",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnəʊbl/",
            "us": "/ˈnəʊbl/"
        },
        "nearby": [
            {
                "word": "Nob Hill",
                "pos": ""
            },
            {
                "word": "nobility",
                "pos": "noun"
            },
            {
                "word": "noble",
                "pos": "adjective"
            },
            {
                "word": "noble",
                "pos": "noun"
            },
            {
                "word": "noble gas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or showing fine personal qualities that people admire, such as courage, honesty and care for others",
                    "vi": "có hoặc thể hiện những phẩm chất cá nhân tốt đẹp mà mọi người ngưỡng mộ, chẳng hạn như lòng dũng cảm, trung thực và quan tâm đến người khác"
                },
                "examples": [
                    {
                        "en": "a noble leader",
                        "vi": "một nhà lãnh đạo cao quý"
                    },
                    {
                        "en": "noble ideals",
                        "vi": "lý tưởng cao đẹp"
                    },
                    {
                        "en": "He died for a noble cause.",
                        "vi": "Anh ấy đã chết vì một mục đích cao cả."
                    },
                    {
                        "en": "She died in a noble cause.",
                        "vi": "Cô ấy chết vì một lý do cao cả."
                    },
                    {
                        "en": "It was very noble of you to go so far to take him home.",
                        "vi": "Bạn đã đi xa như vậy để đưa anh ấy về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a family of high social rank (= belonging to the nobility)",
                    "vi": "thuộc một gia đình có địa vị xã hội cao (= thuộc giới quý tộc)"
                },
                "examples": [
                    {
                        "en": "He was a young man of noble birth.",
                        "vi": "Anh là một thanh niên xuất thân cao quý."
                    },
                    {
                        "en": "one of the noblest families in Portugal",
                        "vi": "một trong những gia đình cao quý nhất ở Bồ Đào Nha"
                    },
                    {
                        "en": "Intermarriage between the noble families means that all the counts are related.",
                        "vi": "Kết hôn giữa các gia đình quý tộc có nghĩa là tất cả các số lượng đều có quan hệ họ hàng với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "very impressive in size or quality",
                    "vi": "rất ấn tượng về kích thước hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "a noble building",
                        "vi": "một tòa nhà cao quý"
                    }
                ]
            }
        ]
    },
    {
        "id": "a78814d783ad411788bfa973d515eacf",
        "word": "preach",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/priːtʃ/",
            "us": "/priːtʃ/"
        },
        "nearby": [
            {
                "word": "pre-wash",
                "pos": "noun"
            },
            {
                "word": "pre-",
                "pos": "prefix"
            },
            {
                "word": "preach",
                "pos": "verb"
            },
            {
                "word": "preacher",
                "pos": "noun"
            },
            {
                "word": "preachy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a religious talk in a public place, especially in a church during a service",
                    "vi": "để thuyết trình về tôn giáo ở nơi công cộng, đặc biệt là trong nhà thờ trong một buổi lễ"
                },
                "examples": [
                    {
                        "en": "She preached to the congregation about forgiveness.",
                        "vi": "Cô đã thuyết giảng cho hội thánh về sự tha thứ."
                    },
                    {
                        "en": "preach something The minister preached a sermon on the parable of the lost sheep.",
                        "vi": "giảng một cái gì đó Mục sư giảng một bài giảng về dụ ngôn con chiên bị mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell people about a particular religion, way of life, system, etc. in order to persuade them to accept it",
                    "vi": "nói với mọi người về một tôn giáo, cách sống, hệ thống cụ thể, v.v. để thuyết phục họ chấp nhận"
                },
                "examples": [
                    {
                        "en": "preach something to preach the word of God",
                        "vi": "giảng điều gì đó để giảng lời Chúa"
                    },
                    {
                        "en": "He preached the virtues of capitalism to us.",
                        "vi": "Ông ấy đã rao giảng những đức tính của chủ nghĩa tư bản cho chúng tôi."
                    },
                    {
                        "en": "preach (about something) She preached about the benefits of a healthy lifestyle.",
                        "vi": "giảng (về điều gì đó) Cô ấy giảng về lợi ích của lối sống lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody advice on moral standards, behaviour, etc., especially in a way that they find annoying or boring",
                    "vi": "để đưa ra lời khuyên cho ai đó về các tiêu chuẩn đạo đức, hành vi, v.v., đặc biệt là theo cách mà họ cảm thấy phiền phức hoặc nhàm chán"
                },
                "examples": [
                    {
                        "en": "I'm sorry, I didn't mean to preach.",
                        "vi": "Tôi xin lỗi, tôi không cố ý giảng."
                    },
                    {
                        "en": "preach at somebody You're preaching at me again!",
                        "vi": "giảng cho ai đó Bạn đang giảng lại cho tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do the things yourself that you tell other people to do",
                    "vi": "tự mình làm những việc mà bạn bảo người khác làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to speak to people in support of views that they already hold",
                    "vi": "nói chuyện với những người ủng hộ các quan điểm mà họ đã có"
                },
                "examples": [
                    {
                        "en": "I realize I may be preaching to the choir, but I think he's gorgeous.",
                        "vi": "Tôi nhận ra rằng tôi có thể đang giảng cho dàn hợp xướng, nhưng tôi nghĩ anh ấy thật tuyệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "d64542a5b6894381bf7b33683c225f54",
        "word": "principled",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprɪnsəpld/",
            "us": "/ˈprɪnsəpld/"
        },
        "nearby": [
            {
                "word": "principal parts",
                "pos": "noun"
            },
            {
                "word": "principle",
                "pos": "noun"
            },
            {
                "word": "principled",
                "pos": "adjective"
            },
            {
                "word": "Pringle",
                "pos": ""
            },
            {
                "word": "Pringles",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strong beliefs about what is right and wrong; based on strong beliefs",
                    "vi": "có niềm tin mạnh mẽ về điều đúng và sai; dựa trên niềm tin mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a principled woman",
                        "vi": "một người phụ nữ có nguyên tắc"
                    },
                    {
                        "en": "to take a principled stand against abortion",
                        "vi": "có lập trường nguyên tắc chống lại việc phá thai"
                    }
                ]
            },
            {
                "define": {
                    "en": "based on rules or truths",
                    "vi": "dựa trên các quy tắc hoặc sự thật"
                },
                "examples": [
                    {
                        "en": "a principled approach to language teaching",
                        "vi": "một cách tiếp cận có nguyên tắc để giảng dạy ngôn ngữ"
                    }
                ]
            }
        ]
    },
    {
        "id": "1ef47666942644c8beb70eb7ed7d2f77",
        "word": "virtue",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvɜːtʃuː/",
            "us": "/ˈvɜːrtʃuː/"
        },
        "nearby": [
            {
                "word": "virtual reality",
                "pos": "noun"
            },
            {
                "word": "virtual world",
                "pos": "noun"
            },
            {
                "word": "virtue",
                "pos": "noun"
            },
            {
                "word": "virtue signalling",
                "pos": "noun"
            },
            {
                "word": "virtuosity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaviour or attitudes that show high moral standards",
                    "vi": "hành vi hoặc thái độ thể hiện các tiêu chuẩn đạo đức cao"
                },
                "examples": [
                    {
                        "en": "He led a life of virtue.",
                        "vi": "Ông ấy đã sống một cuộc đời đức hạnh."
                    },
                    {
                        "en": "She was certainly no paragon of virtue (= her moral standards were very far from perfect).",
                        "vi": "Cô ấy chắc chắn không phải là mẫu mực của đức hạnh (= các tiêu chuẩn đạo đức của cô ấy còn rất xa mới hoàn hảo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular good quality or habit",
                    "vi": "một phẩm chất hoặc thói quen tốt cụ thể"
                },
                "examples": [
                    {
                        "en": "Patience is not one of her virtues, I'm afraid.",
                        "vi": "Tôi e rằng kiên nhẫn không phải là một trong những đức tính của cô ấy."
                    },
                    {
                        "en": "As a politician, he always emphasized the virtues of compromise and conciliation.",
                        "vi": "Là một chính trị gia, ông luôn nhấn mạnh các đức tính của sự thỏa hiệp và hòa giải."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attractive or useful quality",
                    "vi": "một chất lượng hấp dẫn hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "The plan has the virtue of simplicity.",
                        "vi": "Kế hoạch có đức tính đơn giản."
                    },
                    {
                        "en": "He was extolling the virtues of the internet.",
                        "vi": "Anh ấy đang tán dương những phẩm chất của Internet."
                    },
                    {
                        "en": "They could see no virtue in discussing it further.",
                        "vi": "Họ không thể thấy có ích gì khi thảo luận thêm về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "by means of or because of something",
                    "vi": "bởi vì hoặc vì một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She got the job by virtue of her greater experience.",
                        "vi": "Cô ấy đã nhận được công việc nhờ kinh nghiệm dày dặn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to present as a good quality something that other people might consider to be bad",
                    "vi": "quản lý để trình bày như một chất lượng tốt một cái gì đó mà người khác có thể coi là xấu"
                },
                "examples": [
                    {
                        "en": "There are artists who make a virtue of repetition.",
                        "vi": "Có những nghệ sĩ thực hiện một đức tính lặp lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to gain an advantage from something that you have to do and cannot avoid",
                    "vi": "quản lý để đạt được lợi thế từ điều gì đó mà bạn phải làm và không thể tránh"
                },
                "examples": [
                    {
                        "en": "She decided to make a virtue of necessity and combined a business trip to Paris with a visit to her cousins there.",
                        "vi": "Cô quyết định thực hiện một đức tính cần thiết và kết hợp một chuyến công tác đến Paris với một chuyến thăm anh em họ của cô ở đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to have sex with anyone",
                    "vi": "sẵn sàng quan hệ tình dục với bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "a woman of easy virtue",
                        "vi": "một người phụ nữ có đức tính dễ dàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the reward for acting in a moral or correct way is the knowledge that you have done so, and you should not expect more than this, for example praise from other people or payment",
                    "vi": "Phần thưởng cho việc hành động một cách có đạo đức hoặc đúng đắn là kiến thức mà bạn đã làm và bạn không nên mong đợi nhiều hơn thế, chẳng hạn như lời khen ngợi từ người khác hoặc sự thanh toán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c0d7851438b451e99c926ccc047483a",
        "word": "chivalrous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɪvəlrəs/",
            "us": "/ˈʃɪvəlrəs/"
        },
        "nearby": [
            {
                "word": "chit-chat",
                "pos": "noun"
            },
            {
                "word": "chitterlings",
                "pos": "noun"
            },
            {
                "word": "chivalrous",
                "pos": "adjective"
            },
            {
                "word": "chivalrously",
                "pos": "adverb"
            },
            {
                "word": "chivalry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "polite, kind and behaving with honour, especially towards women",
                    "vi": "lịch sự, tử tế và cư xử đúng mực, đặc biệt là đối với phụ nữ"
                },
                "examples": [
                    {
                        "en": "I was only trying to be chivalrous.",
                        "vi": "Tôi chỉ cố tỏ ra hào hiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "056105df15324a4484f60088c865e8f2",
        "word": "chivalry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɪvəlri/",
            "us": "/ˈʃɪvəlri/"
        },
        "nearby": [
            {
                "word": "chivalrous",
                "pos": "adjective"
            },
            {
                "word": "chivalrously",
                "pos": "adverb"
            },
            {
                "word": "chivalry",
                "pos": "noun"
            },
            {
                "word": "chive",
                "pos": "adjective"
            },
            {
                "word": "chives",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "polite and kind behaviour that shows a sense of honour, especially by men towards women",
                    "vi": "cư xử lịch sự và tử tế thể hiện ý thức tôn trọng, đặc biệt là của nam giới đối với phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the Middle Ages) the religious and moral system of behaviour that the perfect knight was expected to follow",
                    "vi": "(thời Trung Cổ) hệ thống hành vi tôn giáo và đạo đức mà hiệp sĩ hoàn hảo được mong đợi tuân theo"
                },
                "examples": [
                    {
                        "en": "the age of chivalry",
                        "vi": "thời đại của tinh thần hiệp sĩ"
                    }
                ]
            }
        ]
    },
    {
        "id": "a2f3d9079de54285b22f70a456d07542",
        "word": "clean-cut",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkliːn ˈkʌt/",
            "us": "/ˌkliːn ˈkʌt/"
        },
        "nearby": [
            {
                "word": "the Clean Air Act",
                "pos": ""
            },
            {
                "word": "clean and jerk",
                "pos": "noun"
            },
            {
                "word": "clean-cut",
                "pos": "adjective"
            },
            {
                "word": "clean down",
                "pos": "phrasal verb"
            },
            {
                "word": "clean eating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "looking neat and clean and therefore socially acceptable",
                    "vi": "trông gọn gàng và sạch sẽ và do đó được xã hội chấp nhận"
                },
                "examples": [
                    {
                        "en": "Simon’s clean-cut good looks",
                        "vi": "Simon ngoại hình đẹp"
                    }
                ]
            }
        ]
    },
    {
        "id": "d09e1d067b03406ca9d77d7f70f95262",
        "word": "clean-living",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkliːn ˈlɪvɪŋ/",
            "us": "/ˌkliːn ˈlɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "clean-limbed",
                "pos": "adjective"
            },
            {
                "word": "cleanliness",
                "pos": "noun"
            },
            {
                "word": "clean-living",
                "pos": "adjective"
            },
            {
                "word": "cleanly",
                "pos": "adverb"
            },
            {
                "word": "clean off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living a healthy life, by not drinking alcohol, not having sex with a lot of different people, etc.",
                    "vi": "sống lành mạnh, không uống rượu bia, không quan hệ tình dục với nhiều người, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ab01f74d915243b2be40d338f85a55a9",
        "word": "dutiful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdjuːtɪfl/",
            "us": "/ˈduːtɪfl/"
        },
        "nearby": [
            {
                "word": "Dutchman",
                "pos": "noun"
            },
            {
                "word": "Dutchwoman",
                "pos": "noun"
            },
            {
                "word": "dutiful",
                "pos": "adjective"
            },
            {
                "word": "dutifully",
                "pos": "adverb"
            },
            {
                "word": "duty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "doing everything that you are expected to do; willing to obey and to show respect",
                    "vi": "làm mọi thứ mà bạn dự kiến sẽ làm; sẵn sàng tuân theo và thể hiện sự tôn trọng"
                },
                "examples": [
                    {
                        "en": "a dutiful daughter/son/wife",
                        "vi": "con gái / con trai / vợ ngoan"
                    }
                ]
            }
        ]
    },
    {
        "id": "043793eb2eff494d9ed16050633aafa8",
        "word": "God-fearing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒd fɪərɪŋ/",
            "us": "/ˈɡɑːd fɪrɪŋ/"
        },
        "nearby": [
            {
                "word": "godfather",
                "pos": "noun"
            },
            {
                "word": "The Godfather",
                "pos": ""
            },
            {
                "word": "God-fearing",
                "pos": "adjective"
            },
            {
                "word": "godforsaken",
                "pos": "adjective"
            },
            {
                "word": "Godfrey",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living a moral life based on religious principles",
                    "vi": "sống một cuộc sống đạo đức dựa trên các nguyên tắc tôn giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bb230481e7ed470dbc1774f9b9fd4d1c",
        "word": "godly",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdli/",
            "us": "/ˈɡɑːdli/"
        },
        "nearby": [
            {
                "word": "godlike",
                "pos": "adjective"
            },
            {
                "word": "godliness",
                "pos": "noun"
            },
            {
                "word": "godly",
                "pos": "adjective"
            },
            {
                "word": "god-man",
                "pos": "noun"
            },
            {
                "word": "godmother",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living a moral life based on religious principles",
                    "vi": "sống một cuộc sống đạo đức dựa trên các nguyên tắc tôn giáo"
                },
                "examples": [
                    {
                        "en": "a godly man",
                        "vi": "một người đàn ông tin kính"
                    }
                ]
            }
        ]
    },
    {
        "id": "747df8e90c8c40669ab3b7024a378f2c",
        "word": "high-minded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪ ˈmaɪndɪd/",
            "us": "/ˌhaɪ ˈmaɪndɪd/"
        },
        "nearby": [
            {
                "word": "highly strung",
                "pos": "adjective"
            },
            {
                "word": "high-maintenance",
                "pos": "adjective"
            },
            {
                "word": "high-minded",
                "pos": "adjective"
            },
            {
                "word": "high-mindedness",
                "pos": "noun"
            },
            {
                "word": "Highness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strong moral principles",
                    "vi": "có các nguyên tắc đạo đức mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "I don't believe any of their motives are as high-minded as they pretend.",
                        "vi": "Tôi không tin rằng bất kỳ động cơ nào của họ cũng cao siêu như họ giả vờ."
                    },
                    {
                        "en": "It's sometimes hard to live up to his high-minded religious ideals.",
                        "vi": "Đôi khi thật khó để sống theo những lý tưởng tôn giáo cao đẹp của anh ấy."
                    },
                    {
                        "en": "She was the daughter of rich and high-minded Victorians.",
                        "vi": "Cô là con gái của những người Victoria giàu có và có trí tuệ cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "0fe226016ca64e1f9ba0810ab630eb6e",
        "word": "lofty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒfti/",
            "us": "/ˈlɔːfti/"
        },
        "nearby": [
            {
                "word": "loftily",
                "pos": "adverb"
            },
            {
                "word": "loftiness",
                "pos": "noun"
            },
            {
                "word": "lofty",
                "pos": "adjective"
            },
            {
                "word": "log",
                "pos": "noun"
            },
            {
                "word": "-log",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very high and impressive",
                    "vi": "rất cao và ấn tượng"
                },
                "examples": [
                    {
                        "en": "lofty ceilings/rooms/towers",
                        "vi": "trần nhà / phòng / tháp cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "deserving praise because of its high moral quality",
                    "vi": "đáng được khen ngợi vì phẩm chất đạo đức cao của nó"
                },
                "examples": [
                    {
                        "en": "lofty ambitions/ideals/principles",
                        "vi": "những hoài bão / lý tưởng / nguyên tắc cao cả"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing a belief that you are worth more than other people",
                    "vi": "thể hiện niềm tin rằng bạn đáng giá hơn những người khác"
                },
                "examples": [
                    {
                        "en": "her lofty disdain for other people",
                        "vi": "thái độ coi thường cao cả của cô ấy đối với người khác"
                    }
                ]
            }
        ]
    },
    {
        "id": "224728670fe340c8af89cd0e550ec62a",
        "word": "moral fibre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɒrəl ˈfaɪbə(r)/",
            "us": "/ˌmɔːrəl ˈfaɪbər/"
        },
        "nearby": [
            {
                "word": "moral compass",
                "pos": "noun"
            },
            {
                "word": "morale",
                "pos": "noun"
            },
            {
                "word": "moral fibre",
                "pos": "noun"
            },
            {
                "word": "moral hazard",
                "pos": "noun"
            },
            {
                "word": "moralist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the inner strength to do what you believe to be right in difficult situations",
                    "vi": "sức mạnh bên trong để làm những gì bạn tin là đúng trong những tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "It isn’t just a lack of moral fibre that leads to a rising divorce rate.",
                        "vi": "Nó không chỉ là sự thiếu chất lượng đạo đức dẫn đến tỷ lệ ly hôn ngày càng tăng."
                    }
                ]
            }
        ]
    },
    {
        "id": "8975e98a9fc641a1a061473ac0a968d2",
        "word": "moralist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒrəlɪst/",
            "us": "/ˈmɔːrəlɪst/"
        },
        "nearby": [
            {
                "word": "moral fibre",
                "pos": "noun"
            },
            {
                "word": "moral hazard",
                "pos": "noun"
            },
            {
                "word": "moralist",
                "pos": "noun"
            },
            {
                "word": "moralistic",
                "pos": "adjective"
            },
            {
                "word": "morality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has strong ideas about moral principles, especially one who tries to tell other people how they should behave",
                    "vi": "một người có ý tưởng mạnh mẽ về các nguyên tắc đạo đức, đặc biệt là một người cố gắng nói cho người khác biết họ nên cư xử như thế nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who teaches or writes about moral principles",
                    "vi": "một người dạy hoặc viết về các nguyên tắc đạo đức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a471676838fb48fc8ec1c97698cdf388",
        "word": "moralize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒrəlaɪz/",
            "us": "/ˈmɔːrəlaɪz/"
        },
        "nearby": [
            {
                "word": "morality",
                "pos": "noun"
            },
            {
                "word": "morality play",
                "pos": "noun"
            },
            {
                "word": "moralize",
                "pos": "verb"
            },
            {
                "word": "morally",
                "pos": "adverb"
            },
            {
                "word": "the moral majority",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell other people what is right and wrong especially in order to emphasize that your opinions are correct",
                    "vi": "để nói cho người khác biết điều gì là đúng và điều gì sai, đặc biệt là để nhấn mạnh rằng ý kiến của bạn là đúng"
                },
                "examples": [
                    {
                        "en": "He’s always moralizing about ‘young people today’.",
                        "vi": "Anh ấy luôn đạo đức về 'những người trẻ ngày nay'."
                    }
                ]
            }
        ]
    },
    {
        "id": "74c13b7cfc2a4cc1bf5400110bb808e7",
        "word": "proper",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprɒpə(r)/",
            "us": "/ˈprɑːpər/"
        },
        "nearby": [
            {
                "word": "propelling pencil",
                "pos": "noun"
            },
            {
                "word": "propensity",
                "pos": "noun"
            },
            {
                "word": "proper",
                "pos": "adjective"
            },
            {
                "word": "proper fraction",
                "pos": "noun"
            },
            {
                "word": "properly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "right, appropriate or correct; according to the rules",
                    "vi": "đúng, thích hợp hoặc chính xác; theo các quy tắc"
                },
                "examples": [
                    {
                        "en": "We should have had a proper discussion before voting.",
                        "vi": "Chúng ta nên có một cuộc thảo luận thích hợp trước khi bỏ phiếu."
                    },
                    {
                        "en": "Please follow the proper procedures for dealing with complaints.",
                        "vi": "Vui lòng làm theo các quy trình thích hợp để giải quyết các khiếu nại."
                    },
                    {
                        "en": "Manufacturers provide these directions to indicate the proper use of their products",
                        "vi": "Các nhà sản xuất cung cấp các hướng dẫn này để chỉ ra việc sử dụng đúng cách các sản phẩm của họ"
                    },
                    {
                        "en": "It is vital that they're given the proper training.",
                        "vi": "Điều quan trọng là họ được đào tạo thích hợp."
                    },
                    {
                        "en": "The Government is failing to deliver proper care and treatment to people with dementia.",
                        "vi": "Chính phủ đang không cung cấp dịch vụ chăm sóc và điều trị thích hợp cho những người bị sa sút trí tuệ."
                    },
                    {
                        "en": "Nothing is in its proper place.",
                        "vi": "Không có gì ở đúng vị trí của nó."
                    },
                    {
                        "en": "He is never referred to by his proper name in the play.",
                        "vi": "Anh ấy không bao giờ được nhắc đến bằng tên riêng trong vở kịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you consider to be real and of a good enough standard",
                    "vi": "mà bạn cho là có thật và đủ tiêu chuẩn tốt"
                },
                "examples": [
                    {
                        "en": "I haven't had a proper meal in days.",
                        "vi": "Tôi đã không có một bữa ăn thích hợp trong nhiều ngày."
                    },
                    {
                        "en": "Eat some proper food, not just toast and jam!",
                        "vi": "Ăn một số thực phẩm thích hợp, không chỉ bánh mì nướng và mứt!"
                    },
                    {
                        "en": "When are you going to get a proper job?",
                        "vi": "Khi nào bạn sẽ nhận được một công việc thích hợp?"
                    }
                ]
            },
            {
                "define": {
                    "en": "socially and morally acceptable",
                    "vi": "chấp nhận được về mặt xã hội và đạo đức"
                },
                "examples": [
                    {
                        "en": "It is right and proper that parents take responsibility for their children's attendance at school.",
                        "vi": "Việc phụ huynh chịu trách nhiệm về việc đi học của con em mình là đúng đắn và phù hợp."
                    },
                    {
                        "en": "The development was planned without proper regard to the interests of local people.",
                        "vi": "Việc phát triển đã được lên kế hoạch mà không quan tâm đến lợi ích của người dân địa phương."
                    },
                    {
                        "en": "He is always perfectly proper in his behaviour.",
                        "vi": "Anh ấy luôn hoàn toàn đúng mực trong cách cư xử của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the most exact meaning of the word",
                    "vi": "theo nghĩa chính xác nhất của từ này"
                },
                "examples": [
                    {
                        "en": "The celebrations proper always begin on the last stroke of midnight.",
                        "vi": "Lễ kỷ niệm thích hợp luôn bắt đầu vào nửa đêm cuối cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "complete",
                    "vi": "hoàn thành"
                },
                "examples": [
                    {
                        "en": "We're in a proper mess now.",
                        "vi": "Bây giờ chúng ta đang ở trong một mớ hỗn độn thích hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a particular type of thing; natural in a particular situation or place",
                    "vi": "thuộc về một loại sự vật cụ thể; tự nhiên trong một tình huống hoặc địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "They should be treated with the dignity proper to all individuals created by God.",
                        "vi": "Họ phải được đối xử với phẩm giá phù hợp với mọi cá nhân do Đức Chúa Trời tạo ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely; to the greatest extent possible",
                    "vi": "hoàn toàn; ở mức độ lớn nhất có thể"
                },
                "examples": [
                    {
                        "en": "That's messed things up good and proper.",
                        "vi": "Điều đó làm rối tung mọi thứ tốt và thích hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "a7048f26282f46538b45a5b6a584cc25",
        "word": "prude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pruːd/",
            "us": "/pruːd/"
        },
        "nearby": [
            {
                "word": "PRS for Music",
                "pos": ""
            },
            {
                "word": "Pru",
                "pos": ""
            },
            {
                "word": "prude",
                "pos": "noun"
            },
            {
                "word": "prudence",
                "pos": "noun"
            },
            {
                "word": "Prudence",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person that you think is too easily shocked by things connected with sex",
                    "vi": "một người mà bạn nghĩ là quá dễ bị sốc bởi những thứ liên quan đến tình dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "86529ebcf1324e9fa6c041fdcf667458",
        "word": "prudish",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpruːdɪʃ/",
            "us": "/ˈpruːdɪʃ/"
        },
        "nearby": [
            {
                "word": "prudently",
                "pos": "adverb"
            },
            {
                "word": "prudery",
                "pos": "noun"
            },
            {
                "word": "prudish",
                "pos": "adjective"
            },
            {
                "word": "prudishness",
                "pos": "noun"
            },
            {
                "word": "prune",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very easily shocked by things connected with sex",
                    "vi": "rất dễ bị sốc bởi những thứ liên quan đến tình dục"
                },
                "examples": [
                    {
                        "en": "He grew up in the prudish moral climate of the late nineteenth century.",
                        "vi": "Ông lớn lên trong bầu không khí đạo đức thận trọng của cuối thế kỷ XIX."
                    },
                    {
                        "en": "She can be quite prudish.",
                        "vi": "Cô ấy có thể khá thận trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "566de09620794cf3b761fe3d540eea94",
        "word": "puritan",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpjʊərɪtən/",
            "us": "/ˈpjʊrɪtən/"
        },
        "nearby": [
            {
                "word": "purism",
                "pos": "noun"
            },
            {
                "word": "purist",
                "pos": "noun"
            },
            {
                "word": "puritan",
                "pos": "noun"
            },
            {
                "word": "puritan",
                "pos": "adjective"
            },
            {
                "word": "puritanical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has very strict moral attitudes and who thinks that pleasure is bad",
                    "vi": "một người có thái độ đạo đức rất nghiêm khắc và người nghĩ rằng thú vui là xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a member of a Protestant group of Christians in England in the 16th and 17th centuries who wanted to worship God in a simple way",
                    "vi": "một thành viên của một nhóm Cơ đốc nhân theo đạo Tin lành ở Anh vào thế kỷ 16 và 17, những người muốn thờ phượng Chúa một cách đơn giản"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1b37a7cd96cb4bbbb2e2771144085b81",
        "word": "puritanical",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpjʊərɪˈtænɪkl/",
            "us": "/ˌpjʊrɪˈtænɪkl/"
        },
        "nearby": [
            {
                "word": "puritan",
                "pos": "noun"
            },
            {
                "word": "puritan",
                "pos": "adjective"
            },
            {
                "word": "puritanical",
                "pos": "adjective"
            },
            {
                "word": "puritanism",
                "pos": "noun"
            },
            {
                "word": "purity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having very strict moral attitudes",
                    "vi": "có thái độ đạo đức rất nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Their parents had a puritanical streak and didn't approve of dancing.",
                        "vi": "Cha mẹ của họ có một khuynh hướng thuần túy và không thích khiêu vũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "98949dbf99f74a328059b48f5ab39351",
        "word": "sermonize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːmənaɪz/",
            "us": "/ˈsɜːrmənaɪz/"
        },
        "nearby": [
            {
                "word": "the Serious Organised Crime Agency",
                "pos": ""
            },
            {
                "word": "sermon",
                "pos": "noun"
            },
            {
                "word": "sermonize",
                "pos": "verb"
            },
            {
                "word": "serotonin",
                "pos": "noun"
            },
            {
                "word": "serpent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give moral advice, especially when it is boring or not wanted",
                    "vi": "để đưa ra lời khuyên về đạo đức, đặc biệt là khi nó nhàm chán hoặc không muốn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0f1ba0c01ae44159a1cd6e720fcf0d48",
        "word": "straight-laced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌstreɪt ˈleɪst/",
            "us": "/ˌstreɪt ˈleɪst/"
        },
        "nearby": [
            {
                "word": "straight glass",
                "pos": "noun"
            },
            {
                "word": "straightjacket",
                "pos": "noun"
            },
            {
                "word": "straight-laced",
                "pos": "adjective"
            },
            {
                "word": "straight man",
                "pos": "noun"
            },
            {
                "word": "straightness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strict or old-fashioned ideas about people’s moral behaviour",
                    "vi": "có những tư tưởng nghiêm khắc hoặc cổ hủ về hành vi đạo đức của con người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c454f39c432a4c529d123336cfbce8ea",
        "word": "strait-laced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌstreɪt ˈleɪst/",
            "us": "/ˌstreɪt ˈleɪst/"
        },
        "nearby": [
            {
                "word": "straitened",
                "pos": "adjective"
            },
            {
                "word": "straitjacket",
                "pos": "noun"
            },
            {
                "word": "strait-laced",
                "pos": "adjective"
            },
            {
                "word": "strand",
                "pos": "noun"
            },
            {
                "word": "strand",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having strict or old-fashioned ideas about people’s moral behaviour",
                    "vi": "có những tư tưởng nghiêm khắc hoặc cổ hủ về hành vi đạo đức của con người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "488a8c89e699491793c648d9916f1bdf",
        "word": "upright",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌpraɪt/",
            "us": "/ˈʌpraɪt/"
        },
        "nearby": [
            {
                "word": "uppity",
                "pos": "adjective"
            },
            {
                "word": "upraised",
                "pos": "adjective"
            },
            {
                "word": "upright",
                "pos": "adjective"
            },
            {
                "word": "upright",
                "pos": "adverb"
            },
            {
                "word": "upright",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not lying down, and with the back straight rather than bent",
                    "vi": "không nằm xuống và với tư thế thẳng lưng thay vì cúi xuống"
                },
                "examples": [
                    {
                        "en": "Try to maintain an upright posture while doing this exercise.",
                        "vi": "Cố gắng duy trì tư thế thẳng đứng trong khi thực hiện bài tập này."
                    },
                    {
                        "en": "a fully upright posture",
                        "vi": "một tư thế hoàn toàn thẳng đứng"
                    },
                    {
                        "en": "Gradually raise your body into an upright position.",
                        "vi": "Dần dần nâng cơ thể của bạn vào tư thế thẳng đứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "placed in a vertical position",
                    "vi": "đặt ở một vị trí thẳng đứng"
                },
                "examples": [
                    {
                        "en": "Keep the bottle upright.",
                        "vi": "Giữ chai thẳng đứng."
                    },
                    {
                        "en": "an upright freezer (= one that is taller than it is wide)",
                        "vi": "tủ đông thẳng đứng (= tủ đông cao hơn chiều rộng)"
                    },
                    {
                        "en": "an upright vacuum cleaner (= one designed to be used in a vertical position)",
                        "vi": "máy hút bụi thẳng đứng (= máy hút bụi được thiết kế để sử dụng ở vị trí thẳng đứng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving in a moral and honest way",
                    "vi": "cư xử một cách có đạo đức và trung thực"
                },
                "examples": [
                    {
                        "en": "an upright citizen",
                        "vi": "một công dân ngay thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit or stand with your back straight",
                    "vi": "ngồi hoặc đứng thẳng lưng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d986582611a4d70a384ec77c77b32a9",
        "word": "upstanding",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌpˈstændɪŋ/",
            "us": "/ˌʌpˈstændɪŋ/"
        },
        "nearby": [
            {
                "word": "upstairs",
                "pos": "adjective"
            },
            {
                "word": "upstairs",
                "pos": "noun"
            },
            {
                "word": "upstanding",
                "pos": "adjective"
            },
            {
                "word": "upstart",
                "pos": "noun"
            },
            {
                "word": "upstate",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a moral and honest way",
                    "vi": "cư xử một cách có đạo đức và trung thực"
                },
                "examples": [
                    {
                        "en": "an upstanding member of the community",
                        "vi": "một thành viên xuất sắc của cộng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in a formal situation to tell people to stand up",
                    "vi": "được sử dụng trong một tình huống trang trọng để bảo mọi người đứng lên"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, please be upstanding for the bride and groom.",
                        "vi": "Kính thưa quý vị và các bạn, xin hãy bình an cho cô dâu và chú rể."
                    }
                ]
            }
        ]
    },
    {
        "id": "6262506235894f24889a10fdc762e5c3",
        "word": "virtuous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvɜːtʃuəs/",
            "us": "/ˈvɜːrtʃuəs/"
        },
        "nearby": [
            {
                "word": "virtuoso",
                "pos": "noun"
            },
            {
                "word": "virtuoso",
                "pos": "adjective"
            },
            {
                "word": "virtuous",
                "pos": "adjective"
            },
            {
                "word": "virtuous circle",
                "pos": "noun"
            },
            {
                "word": "virtuously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a very good and moral way; showing high moral standards",
                    "vi": "cư xử rất đúng mực và đạo đức; thể hiện các tiêu chuẩn đạo đức cao"
                },
                "examples": [
                    {
                        "en": "a wise and virtuous man",
                        "vi": "một người đàn ông khôn ngoan và đạo đức"
                    },
                    {
                        "en": "She lived an entirely virtuous life.",
                        "vi": "Cô ấy đã sống một cuộc đời hoàn toàn đạo đức."
                    },
                    {
                        "en": "They believe strongly that work is virtuous.",
                        "vi": "Họ tin tưởng mạnh mẽ rằng làm việc là có đạo đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "claiming to behave better or have higher moral standards than other people",
                    "vi": "tuyên bố hành xử tốt hơn hoặc có tiêu chuẩn đạo đức cao hơn những người khác"
                },
                "examples": [
                    {
                        "en": "He was feeling virtuous because he had finished and they hadn't.",
                        "vi": "Anh ấy cảm thấy có đức hạnh vì anh ấy đã hoàn thành còn họ thì không."
                    }
                ]
            }
        ]
    },
    {
        "id": "11f0d4d7e83446d6bfe4db040ffb6bc7",
        "word": "wholesome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhəʊlsəm/",
            "us": "/ˈhəʊlsəm/"
        },
        "nearby": [
            {
                "word": "wholesaler",
                "pos": "noun"
            },
            {
                "word": "wholesaling",
                "pos": "noun"
            },
            {
                "word": "wholesome",
                "pos": "adjective"
            },
            {
                "word": "wholesomeness",
                "pos": "noun"
            },
            {
                "word": "whole step",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good for your health",
                    "vi": "tốt cho sức khỏe của bạn"
                },
                "examples": [
                    {
                        "en": "fresh, wholesome food",
                        "vi": "thực phẩm tươi ngon"
                    }
                ]
            },
            {
                "define": {
                    "en": "morally good; having a good moral influence",
                    "vi": "tốt về mặt đạo đức; có ảnh hưởng đạo đức tốt"
                },
                "examples": [
                    {
                        "en": "It was clean wholesome fun.",
                        "vi": "Đó là niềm vui sạch sẽ lành mạnh."
                    }
                ]
            }
        ]
    }
]