[
    {
        "id": "67b51b0b18ce43e09245ab0909f3fc31",
        "word": "tennis",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtenɪs/",
            "us": "/ˈtenɪs/"
        },
        "nearby": [
            {
                "word": "Tennessee Valley Authority",
                "pos": ""
            },
            {
                "word": "John Tenniel",
                "pos": ""
            },
            {
                "word": "tennis",
                "pos": "noun"
            },
            {
                "word": "tennis elbow",
                "pos": "noun"
            },
            {
                "word": "tennis racket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which two or four players use rackets to hit a ball backwards and forwards across a net on a specially marked court",
                    "vi": "một trò chơi trong đó hai hoặc bốn người chơi sử dụng vợt để đánh một quả bóng tới và lui qua lưới trên một sân được đánh dấu đặc biệt"
                },
                "examples": [
                    {
                        "en": "to play tennis",
                        "vi": "chơi quần vợt"
                    },
                    {
                        "en": "a tennis player/court/ball",
                        "vi": "một người chơi tennis / sân / bóng"
                    },
                    {
                        "en": "I met a friend for a quick game of tennis after work.",
                        "vi": "Tôi gặp một người bạn để chơi tennis nhanh sau giờ làm việc."
                    },
                    {
                        "en": "a tennis match/tournament",
                        "vi": "một trận đấu / giải đấu quần vợt"
                    },
                    {
                        "en": "She is a popular figure on the international tennis circuit.",
                        "vi": "Cô ấy là một nhân vật nổi tiếng trên đường đua quần vợt quốc tế."
                    },
                    {
                        "en": "He retired from competitive tennis at the age of 34.",
                        "vi": "Anh từ giã sự nghiệp quần vợt ở tuổi 34."
                    }
                ]
            }
        ]
    },
    {
        "id": "06bee4994a3a484183dace2887b53e11",
        "word": "game",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɡeɪm/",
            "us": "/ɡeɪm/"
        },
        "nearby": [
            {
                "word": "the Gambling Commission",
                "pos": ""
            },
            {
                "word": "gambol",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "noun"
            },
            {
                "word": "game",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity that you do to have fun, often one that has rules and that you can win or lose; the equipment for a game",
                    "vi": "một hoạt động mà bạn làm để giải trí, thường là một hoạt động có quy tắc và bạn có thể thắng hoặc thua; thiết bị cho một trò chơi"
                },
                "examples": [
                    {
                        "en": "The kids were playing a game with their balloons.",
                        "vi": "Những đứa trẻ đang chơi một trò chơi với những quả bóng bay của chúng."
                    },
                    {
                        "en": "The children invented a new game.",
                        "vi": "Những đứa trẻ đã phát minh ra một trò chơi mới."
                    },
                    {
                        "en": "a video/computer game",
                        "vi": "một trò chơi điện tử / máy tính"
                    },
                    {
                        "en": "I play online games with my friends.",
                        "vi": "Tôi chơi trò chơi trực tuyến với bạn bè của tôi."
                    },
                    {
                        "en": "a game of chance/skill",
                        "vi": "một trò chơi may rủi / kỹ năng"
                    },
                    {
                        "en": "Buy your games and software from us.",
                        "vi": "Mua trò chơi và phần mềm của bạn từ chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sport with rules in which people or teams compete against each other",
                    "vi": "một môn thể thao với các quy tắc trong đó mọi người hoặc các đội thi đấu với nhau"
                },
                "examples": [
                    {
                        "en": "ball games, such as football or tennis",
                        "vi": "trò chơi bóng, chẳng hạn như bóng đá hoặc quần vợt"
                    },
                    {
                        "en": "How I hated team games at school!",
                        "vi": "Tôi ghét các trò chơi đồng đội ở trường như thế nào!"
                    },
                    {
                        "en": "the game of something the game of golf/cricket/basketball",
                        "vi": "trò chơi của một cái gì đó trò chơi gôn / cricket / bóng rổ"
                    },
                    {
                        "en": "Broadcasters have injected vast amounts of money into the game of football.",
                        "vi": "Các đài truyền hình đã bơm một lượng lớn tiền vào trò chơi bóng đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion of playing a game",
                    "vi": "một dịp để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "to win/lose a game",
                        "vi": "thắng / thua một trò chơi"
                    },
                    {
                        "en": "They lost their first home game of the season.",
                        "vi": "Họ đã thua trận sân nhà đầu tiên trong mùa giải."
                    },
                    {
                        "en": "a baseball/basketball game",
                        "vi": "một trận bóng chày / bóng rổ"
                    },
                    {
                        "en": "(especially North American English) a football game",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) một trò chơi bóng đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody plays a game",
                    "vi": "cách mà ai đó chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "Maguire raised his game to collect the £40 000 first prize.",
                        "vi": "Maguire đã gây quỹ cho trò chơi của mình để thu về giải nhất trị giá £ 40 000."
                    },
                    {
                        "en": "Stretching exercises can help you avoid injury and improve your game.",
                        "vi": "Các bài tập kéo căng có thể giúp bạn tránh chấn thương và cải thiện trò chơi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large organized sports event",
                    "vi": "một sự kiện thể thao được tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "She's hoping to participate in the next Olympic Games.",
                        "vi": "Cô ấy hy vọng sẽ tham gia Thế vận hội Olympic tiếp theo."
                    },
                    {
                        "en": "To stage the Games (= the Olympic Games or a similar event) is an honour.",
                        "vi": "Được tổ chức Thế vận hội (= Thế vận hội Olympic hoặc một sự kiện tương tự) là một vinh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "sport as a lesson or an activity at school",
                    "vi": "thể thao như một bài học hoặc một hoạt động ở trường"
                },
                "examples": [
                    {
                        "en": "I always hated games at school.",
                        "vi": "Tôi luôn ghét những trò chơi ở trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of some games, such as tennis, which forms a unit in scoring",
                    "vi": "một phần của một số trò chơi, chẳng hạn như quần vợt, tạo thành một đơn vị tính điểm"
                },
                "examples": [
                    {
                        "en": "two games all (= both players have won two games)",
                        "vi": "tất cả hai trò chơi (= cả hai người chơi đã thắng hai trò chơi)"
                    },
                    {
                        "en": "Zverev won the opening game of the third set.",
                        "vi": "Zverev đã giành chiến thắng trong game mở màn của set thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of activity or business",
                    "vi": "một loại hoạt động hoặc kinh doanh"
                },
                "examples": [
                    {
                        "en": "How long have you been in this game?",
                        "vi": "Bạn đã chơi trò chơi này bao lâu rồi?"
                    },
                    {
                        "en": "the game of politics",
                        "vi": "trò chơi của chính trị"
                    },
                    {
                        "en": "I'm new to this game myself.",
                        "vi": "Bản thân tôi là người mới tham gia trò chơi này."
                    },
                    {
                        "en": "Getting dirty was all part of the game to the kids.",
                        "vi": "Làm bẩn là một phần của trò chơi đối với bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret and clever plan; a trick",
                    "vi": "một kế hoạch bí mật và thông minh; một thủ thuật"
                },
                "examples": [
                    {
                        "en": "So that's his game (= now I know what he has been planning).",
                        "vi": "Vì vậy, đó là trò chơi của anh ấy (= bây giờ tôi biết anh ấy đã lên kế hoạch gì)."
                    }
                ]
            },
            {
                "define": {
                    "en": "wild animals or birds that people hunt for sport or food",
                    "vi": "động vật hoang dã hoặc các loài chim mà mọi người săn lùng để thể thao hoặc làm thực phẩm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at an advantage/disadvantage because you have done more/less preparation or know more/less than other people, especially those you are competing against",
                    "vi": "có lợi / bất lợi vì bạn đã chuẩn bị nhiều hơn / ít hơn hoặc biết nhiều hơn / ít hơn những người khác, đặc biệt là những người bạn đang cạnh tranh"
                },
                "examples": [
                    {
                        "en": "We'll be able to extract insights out of the data that will enable us to stay ahead of the game.",
                        "vi": "Chúng tôi sẽ có thể trích xuất thông tin chi tiết từ dữ liệu giúp chúng tôi dẫn đầu trò chơi."
                    },
                    {
                        "en": "Politicians are behind the game in understanding how fast the world is changing.",
                        "vi": "Các chính trị gia đứng sau trò chơi trong việc hiểu thế giới đang thay đổi nhanh như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat or do better than somebody in an activity which they have chosen or in which they think they are strong",
                    "vi": "để đánh bại hoặc làm tốt hơn ai đó trong một hoạt động mà họ đã chọn hoặc trong đó họ nghĩ rằng họ mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not be considered to be serious",
                    "vi": "không được coi là nghiêm túc"
                },
                "examples": [
                    {
                        "en": "For her the whole project was just a game.",
                        "vi": "Đối với cô ấy, toàn bộ dự án chỉ là một trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be working as a prostitute",
                    "vi": "làm gái mại dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to no longer have a chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "không còn cơ hội thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to still/once again have a good chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "vẫn / một lần nữa có cơ hội tốt để thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": [
                    {
                        "en": "The team was still in the game, just one goal down.",
                        "vi": "Đội vẫn đang thi đấu, chỉ ghi được một bàn thua."
                    },
                    {
                        "en": "(figurative) He’s been fighting to get the struggling company back in the game.",
                        "vi": "(nghĩa bóng) Anh ấy đang chiến đấu để đưa công ty đang gặp khó khăn trở lại trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "activities that are not serious and that other people may think are bad",
                    "vi": "các hoạt động không nghiêm túc và người khác có thể nghĩ là xấu"
                },
                "examples": [
                    {
                        "en": "Teaching isn't all fun and games, you know.",
                        "vi": "Bạn biết đấy, dạy học không phải là trò vui và trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "said to somebody who has done something wrong, when they are caught and the crime or trick has been discovered",
                    "vi": "nói với ai đó đã làm điều gì đó sai trái, khi họ bị bắt và tội ác hoặc thủ đoạn đã bị phát hiện"
                },
                "examples": [
                    {
                        "en": "Maggie knew that he had recognized her and the game was up.",
                        "vi": "Maggie biết rằng anh đã nhận ra cô và trò chơi đã kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after something has happened that makes it clear that a contest is not yet decided and anyone could still win",
                    "vi": "được sử dụng sau khi một điều gì đó đã xảy ra để làm rõ rằng một cuộc thi vẫn chưa được quyết định và bất kỳ ai vẫn có thể giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "We were losing 2–0 with ten minutes to go, and then we scored. It was game on!",
                        "vi": "Chúng tôi đã để thua 2–0 khi còn mười phút nữa, và sau đó chúng tôi ghi bàn. Đó là trò chơi trên!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is no longer possible for somebody/something to succeed, survive or continue",
                    "vi": "được sử dụng để nói rằng không còn có thể cho ai đó / cái gì đó thành công, tồn tại hoặc tiếp tục"
                },
                "examples": [
                    {
                        "en": "Given her recent slump in form, it might be game over already this season.",
                        "vi": "Với phong độ sa sút gần đây của cô ấy, có thể trận đấu đã kết thúc trong mùa giải này."
                    },
                    {
                        "en": "This technology could mean game over for gasoline-powered vehicles.",
                        "vi": "Công nghệ này có nghĩa là trò chơi kết thúc đối với các loại xe chạy bằng xăng."
                    },
                    {
                        "en": "The slightest mistake and it's game over for him.",
                        "vi": "Sai lầm nhỏ nhất và trò chơi đã kết thúc đối với anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a secret, especially by accident; to show something that should be kept hidden",
                    "vi": "để kể một bí mật, đặc biệt là tình cờ; để hiển thị một cái gì đó nên được giấu kín"
                },
                "examples": [
                    {
                        "en": "Don't let him talk to anybody or he'll give the game away.",
                        "vi": "Đừng để anh ta nói chuyện với bất kỳ ai, nếu không anh ta sẽ bỏ cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity that is unlikely to be successful or make a profit",
                    "vi": "một hoạt động không chắc sẽ thành công hoặc tạo ra lợi nhuận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most important aspect of an activity; the most important quality needed for an activity",
                    "vi": "khía cạnh quan trọng nhất của một hoạt động; chất lượng quan trọng nhất cần thiết cho một hoạt động"
                },
                "examples": [
                    {
                        "en": "Hard work is the name of the game if you want to succeed in business.",
                        "vi": "Làm việc chăm chỉ là tên của trò chơi nếu bạn muốn thành công trong kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the advantages to be gained from doing something are not great enough, considering the effort or cost involved",
                    "vi": "lợi thế đạt được từ việc làm gì đó là không đủ lớn, nếu xét đến nỗ lực hoặc chi phí liên quan"
                },
                "examples": [
                    {
                        "en": "If the price goes up again, he may decide that the game’s not worth the candle.",
                        "vi": "Nếu giá tăng trở lại, anh ta có thể quyết định rằng trò chơi không có giá trị như ngọn nến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of considering an activity, etc. that considers only the number of people doing something, things achieved, etc., not with who or what they are",
                    "vi": "một cách xem xét một hoạt động, v.v. chỉ xem xét số lượng người đang làm điều gì đó, những thứ đã đạt được, v.v., chứ không xem xét họ là ai hoặc cái gì"
                },
                "examples": [
                    {
                        "en": "MPs were playing the numbers game as the crucial vote drew closer.",
                        "vi": "Các nghị sĩ đã chơi trò chơi số khi cuộc bỏ phiếu quan trọng đến gần hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "performing badly/well, especially when compared with how well you usually perform",
                    "vi": "hoạt động kém / tốt, đặc biệt là khi so sánh với mức độ bạn thường thực hiện"
                },
                "examples": [
                    {
                        "en": "He was off his game and missed two early penalties.",
                        "vi": "Anh ấy đã nghỉ thi đấu và bỏ lỡ hai quả phạt đền sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important thing of a particular type, or the only thing that is available",
                    "vi": "điều quan trọng nhất của một loại cụ thể hoặc thứ duy nhất có sẵn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a cruel game with somebody in your power by changing your behaviour very often, so that they become nervous and do not know what to expect",
                    "vi": "chơi một trò chơi tàn ác với ai đó trong quyền lực của bạn bằng cách thay đổi hành vi của bạn rất thường xuyên, để họ trở nên lo lắng và không biết điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "He thought the police were playing some elaborate game of cat and mouse and waiting to trap him.",
                        "vi": "Anh ta nghĩ rằng cảnh sát đang chơi trò mèo vờn chuột phức tạp nào đó và chờ đợi để bẫy anh ta."
                    },
                    {
                        "en": "Young car thieves enjoy playing cat and mouse with the police.",
                        "vi": "Những tên trộm xe hơi thích thú chơi trò mèo vờn chuột với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that helps somebody else’s plans, especially by accident, when you did not intend to help them",
                    "vi": "để làm điều gì đó giúp ích cho kế hoạch của người khác, đặc biệt là do tình cờ, khi bạn không có ý định giúp họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a fair and honest way",
                    "vi": "cư xử một cách công bằng và trung thực"
                },
                "examples": [
                    {
                        "en": "You can’t do that—it’s not playing the game!",
                        "vi": "Bạn không thể làm điều đó — đó không phải là chơi trò chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "not to treat a situation seriously, especially in order to cheat somebody",
                    "vi": "không đối xử nghiêm túc với một tình huống, đặc biệt là để lừa dối ai đó"
                },
                "examples": [
                    {
                        "en": "Don't play silly games with me; I know you did it.",
                        "vi": "Đừng chơi những trò chơi ngớ ngẩn với tôi; Tôi biết bạn đã làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the standards of behaviour that most people accept or that actually operate in a particular area of life or business",
                    "vi": "các tiêu chuẩn hành vi mà hầu hết mọi người chấp nhận hoặc thực sự hoạt động trong một lĩnh vực cụ thể của cuộc sống hoặc kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk in a way that sounds convincing, but may not be sincere",
                    "vi": "nói theo cách nghe có vẻ thuyết phục, nhưng có thể không chân thành"
                },
                "examples": [
                    {
                        "en": "The senior managers talk a good game about customer relations, but really they don't care about the customer.",
                        "vi": "Các nhà quản lý cấp cao nói một trò chơi hay về quan hệ khách hàng, nhưng thực sự họ không quan tâm đến khách hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who has played a trick on you that you can do the same thing to them",
                    "vi": "từng nói với ai đó đã chơi lừa bạn rằng bạn có thể làm điều tương tự với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to improve the level at which you can compete, especially in a sport",
                    "vi": "để nâng cao trình độ mà bạn có thể thi đấu, đặc biệt là trong một môn thể thao"
                },
                "examples": [
                    {
                        "en": "She's really upped her game since she joined the tennis club.",
                        "vi": "Cô ấy đã thực sự nâng cao trò chơi của mình kể từ khi cô ấy tham gia câu lạc bộ quần vợt."
                    },
                    {
                        "en": "With these two snazzy new restaurants opening up, the other eating places in the area are going to have to up their game.",
                        "vi": "Với việc hai nhà hàng mới kinh doanh sôi động này mở cửa, các địa điểm ăn uống khác trong khu vực sẽ phải bắt đầu cuộc chơi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why somebody is behaving as they are",
                    "vi": "được sử dụng để hỏi tại sao ai đó lại cư xử như họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e851fa799c443848aae99f70e05691a",
        "word": "net",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/net/",
            "us": "/net/"
        },
        "nearby": [
            {
                "word": "Nestlé",
                "pos": ""
            },
            {
                "word": "nestling",
                "pos": "noun"
            },
            {
                "word": "net",
                "pos": "noun"
            },
            {
                "word": "net",
                "pos": "adverb"
            },
            {
                "word": "net",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "material that is made of string, thread or wire twisted or tied together, with small spaces in between; a piece of this material used for a particular purpose",
                    "vi": "Vật liệu làm bằng dây, chỉ hoặc dây xoắn hoặc buộc lại với nhau, có khoảng trống nhỏ ở giữa; một phần của vật liệu này được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Unfortunately the animals are often caught in fishing nets.",
                        "vi": "Thật không may, những con vật thường bị mắc vào lưới đánh cá."
                    },
                    {
                        "en": "She's always peering through the net curtains, spying on the neighbours.",
                        "vi": "Cô ấy luôn nhìn xuyên qua rèm lưới, theo dõi những người hàng xóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the frame covered in net that forms the goal",
                    "vi": "khung được bao phủ trong lưới tạo thành mục tiêu"
                },
                "examples": [
                    {
                        "en": "to kick the ball into the back of the net",
                        "vi": "sút bóng vào lưới"
                    },
                    {
                        "en": "She shot the ball past the goalkeeper and into an empty net.",
                        "vi": "Cô sút bóng qua thủ môn và vào lưới trống."
                    },
                    {
                        "en": "Kane finally found the net in the 78th minute.",
                        "vi": "Kane cuối cùng đã tìm thấy lưới ở phút 78."
                    }
                ]
            },
            {
                "define": {
                    "en": "the piece of net between the two players that the ball goes over",
                    "vi": "mảnh lưới giữa hai cầu thủ mà bóng đi qua"
                },
                "examples": [
                    {
                        "en": "She hit her second serve straight into the net.",
                        "vi": "Cô ấy đánh quả giao bóng thứ hai thẳng vào lưới."
                    },
                    {
                        "en": "to hit the ball over the net",
                        "vi": "đánh bóng qua lưới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ground with a net around it, used for practising batting and bowling",
                    "vi": "một mảnh đất có lưới xung quanh, dùng để tập đánh bóng và chơi bowling"
                },
                "examples": [
                    {
                        "en": "He practised bowling all morning in the nets.",
                        "vi": "Anh ấy đã tập chơi bowling cả buổi sáng trên lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the internet",
                    "vi": "mạng internet"
                },
                "examples": [
                    {
                        "en": "He spends his time playing computer games and surfing the net.",
                        "vi": "Anh ấy dành thời gian chơi game trên máy tính và lướt net."
                    }
                ]
            },
            {
                "define": {
                    "en": "a network of radios or computers that are connected to each other",
                    "vi": "một mạng vô tuyến hoặc máy tính được kết nối với nhau"
                },
                "examples": [
                    {
                        "en": "A call on the radio net went out that there had been a crash.",
                        "vi": "Một cuộc gọi trên mạng vô tuyến phát đi rằng đã có một sự cố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider a lot of different people, activities, possibilities, etc. when you are looking for something",
                    "vi": "để xem xét nhiều người, hoạt động, khả năng khác nhau, v.v. khi bạn đang tìm kiếm thứ gì đó"
                },
                "examples": [
                    {
                        "en": "It’s worth casting your net wide when applying for your first job.",
                        "vi": "Đó là giá trị sử dụng mạng lưới của bạn khi nộp đơn cho công việc đầu tiên của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "when somebody/something slips through the net, an organization or a system fails to find them and deal with them",
                    "vi": "khi ai đó / thứ gì đó lọt qua mạng, một tổ chức hoặc một hệ thống không thể tìm thấy họ và đối phó với họ"
                },
                "examples": [
                    {
                        "en": "We tried to contact all former students, but one or two slipped through the net.",
                        "vi": "Chúng tôi đã cố gắng liên lạc với tất cả học sinh cũ, nhưng một hoặc hai người đã lọt lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider a wide range of possibilities or cover a large area, especially to try to find somebody/something",
                    "vi": "để xem xét nhiều khả năng hoặc bao phủ một khu vực rộng lớn, đặc biệt là để cố gắng tìm ai đó / thứ gì đó"
                },
                "examples": [
                    {
                        "en": "They have spread their net far and wide in the search for a new team coach.",
                        "vi": "Họ đã giăng lưới rất xa để tìm kiếm một huấn luyện viên mới cho đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider or include a larger range of options or possibilities, especially when searching for something",
                    "vi": "để xem xét hoặc bao gồm một loạt các tùy chọn hoặc khả năng lớn hơn, đặc biệt là khi tìm kiếm một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "It's time to widen the net in the search for a suitable candidate.",
                        "vi": "Đã đến lúc mở rộng mạng lưới trong việc tìm kiếm một ứng viên phù hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "57732c0723d5481394bfa24cc64f58d4",
        "word": "court",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kɔːt/",
            "us": "/kɔːrt/"
        },
        "nearby": [
            {
                "word": "coursework",
                "pos": "noun"
            },
            {
                "word": "coursing",
                "pos": "noun"
            },
            {
                "word": "court",
                "pos": "noun"
            },
            {
                "word": "court",
                "pos": "verb"
            },
            {
                "word": "the Courtauld Institute",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where legal trials take place and where crimes, etc. are judged",
                    "vi": "nơi diễn ra các phiên tòa pháp lý và nơi xét xử tội ác, v.v."
                },
                "examples": [
                    {
                        "en": "the civil/criminal courts",
                        "vi": "tòa án dân sự / hình sự"
                    },
                    {
                        "en": "Her lawyer made a statement outside the court.",
                        "vi": "Luật sư của cô đã đưa ra một tuyên bố bên ngoài tòa án."
                    },
                    {
                        "en": "in court Relatives of the dead girl were in court.",
                        "vi": "tại tòa án Những người thân của cô gái đã chết có mặt tại tòa án."
                    },
                    {
                        "en": "She will appear in court tomorrow.",
                        "vi": "Cô ấy sẽ ra hầu tòa vào ngày mai."
                    },
                    {
                        "en": "to court They took their landlord to court for breaking the contract.",
                        "vi": "ra tòa Họ đã đưa chủ nhà của họ ra tòa vì đã phá vỡ hợp đồng."
                    },
                    {
                        "en": "The case took five years to come to court (= to be heard by the court).",
                        "vi": "Vụ án mất 5 năm để đưa ra tòa (= để được tòa án xét xử)."
                    },
                    {
                        "en": "There wasn't enough evidence to bring the case to court (= start a trial).",
                        "vi": "Không có đủ bằng chứng để đưa vụ việc ra tòa (= bắt đầu một phiên tòa)."
                    },
                    {
                        "en": "out of court The case was settled out of court (= a decision was reached without a trial).",
                        "vi": "ra khỏi tòa án Vụ việc đã được giải quyết ngoài tòa án (= một quyết định đã được đưa ra mà không cần xét xử)."
                    },
                    {
                        "en": "He won the court case and was awarded damages.",
                        "vi": "Anh ta đã thắng kiện tại tòa và được bồi thường thiệt hại."
                    },
                    {
                        "en": "She can't pay her tax and is facing court action.",
                        "vi": "Cô ấy không thể trả tiền thuế của mình và đang phải đối mặt với vụ kiện của tòa án."
                    },
                    {
                        "en": "During the court hearing, the prosecutor said she would seek maximum prison sentences.",
                        "vi": "Trong phiên tòa, công tố viên cho biết cô sẽ yêu cầu mức án tù tối đa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people in a court, especially those who make the decisions, such as the judge and jury",
                    "vi": "những người trong tòa án, đặc biệt là những người đưa ra quyết định, chẳng hạn như thẩm phán và bồi thẩm đoàn"
                },
                "examples": [
                    {
                        "en": "Please tell the court what happened.",
                        "vi": "Xin quý tòa cho biết chuyện gì đã xảy ra."
                    },
                    {
                        "en": "The court heard how the man collapsed after being stabbed.",
                        "vi": "Tòa án đã nghe cách người đàn ông suy sụp sau khi bị đâm."
                    },
                    {
                        "en": "The court ruled in favour of her claim.",
                        "vi": "Tòa án đã ra phán quyết có lợi cho yêu cầu của cô."
                    },
                    {
                        "en": "This is not a case to be decided by the courts.",
                        "vi": "Đây không phải là trường hợp được quyết định bởi tòa án."
                    },
                    {
                        "en": "before the court This evidence was not put before the court.",
                        "vi": "trước tòa Bằng chứng này không được đưa ra trước tòa."
                    },
                    {
                        "en": "Airlines could face huge compensation bills following a court ruling on flight delays.",
                        "vi": "Các hãng hàng không có thể phải đối mặt với các hóa đơn bồi thường khổng lồ sau phán quyết của tòa án về việc hoãn chuyến bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where games such as tennis and basketball are played",
                    "vi": "nơi chơi các trò chơi như quần vợt và bóng rổ"
                },
                "examples": [
                    {
                        "en": "a tennis/squash/basketball court",
                        "vi": "sân tennis / bóng quần / bóng rổ"
                    },
                    {
                        "en": "on court He won after only 52 minutes on court.",
                        "vi": "trên tòa Anh đã thắng chỉ sau 52 phút trên tòa."
                    },
                    {
                        "en": "off court The players are good friends off court and train together.",
                        "vi": "ngoài sân Các cầu thủ là những người bạn tốt ngoài sân và cùng nhau huấn luyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "the official place where kings and queens live",
                    "vi": "nơi chính thức nơi các vị vua và hoàng hậu sinh sống"
                },
                "examples": [
                    {
                        "en": "the court of Queen Victoria",
                        "vi": "tòa án của nữ hoàng Victoria"
                    },
                    {
                        "en": "at court He was presented to the queen at court.",
                        "vi": "tại tòa án Ông đã được trình bày với nữ hoàng tại tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "the king or queen, their family, and the people who work for them and/or give advice to them",
                    "vi": "vua hoặc hoàng hậu, gia đình của họ, và những người làm việc cho họ và / hoặc đưa ra lời khuyên cho họ"
                },
                "examples": [
                    {
                        "en": "The painting shows the emperor with his court.",
                        "vi": "Bức tranh vẽ hoàng đế với triều đình của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an open space that is partly or completely surrounded by buildings and is usually part of a castle, a large house, etc.",
                    "vi": "một không gian mở được bao quanh một phần hoặc hoàn toàn bởi các tòa nhà và thường là một phần của lâu đài, ngôi nhà lớn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used in the names of blocks of flats or apartment buildings, or of some short streets; (in the UK) used in the names of some large houses",
                    "vi": "được sử dụng trong tên của các khối căn hộ hoặc tòa nhà chung cư, hoặc của một số đường phố ngắn; (ở Anh) được sử dụng trong tên của một số ngôi nhà lớn"
                },
                "examples": [
                    {
                        "en": "The building is situated in a medieval court at the top of Edinburgh's royal mile.",
                        "vi": "Tòa nhà nằm trong một tòa án thời trung cổ ở trên cùng của dặm hoàng gia Edinburgh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large open section of a building, often with a glass roof",
                    "vi": "một phần mở lớn của tòa nhà, thường có mái kính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is your/somebody’s responsibility to take action next",
                    "vi": "đó là trách nhiệm của bạn / ai đó để thực hiện hành động tiếp theo"
                },
                "examples": [
                    {
                        "en": "They've offered me the job, so the ball's in my court now.",
                        "vi": "Họ đã mời tôi làm việc, vì vậy quả bóng đang ở trong sân của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to entertain people by telling them interesting or funny things",
                    "vi": "để giải trí mọi người bằng cách kể cho họ nghe những điều thú vị hoặc hài hước"
                },
                "examples": [
                    {
                        "en": "I met Giles holding court with some tourists in a cafe.",
                        "vi": "Tôi gặp Giles đang hầu tòa với một số khách du lịch trong một quán cà phê."
                    }
                ]
            },
            {
                "define": {
                    "en": "to completely reject an idea, a story, etc. that you think is not worth taking seriously at all",
                    "vi": "bác bỏ hoàn toàn một ý tưởng, một câu chuyện, v.v. mà bạn cho rằng không đáng để thực hiện một cách nghiêm túc"
                },
                "examples": [
                    {
                        "en": "All his attempts at explanation were simply laughed out of court.",
                        "vi": "Tất cả những nỗ lực giải thích của anh ấy chỉ đơn giản là bị cười trừ trước tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody with great respect in order to gain favour with them",
                    "vi": "đối xử với ai đó bằng sự tôn trọng tuyệt vời để có được sự ưu ái với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say that something is completely wrong or not worth considering, especially in a trial",
                    "vi": "để nói rằng có điều gì đó hoàn toàn sai hoặc không đáng được xem xét, đặc biệt là trong một phiên tòa"
                },
                "examples": [
                    {
                        "en": "The charges were thrown out of court.",
                        "vi": "Các cáo buộc đã được đưa ra khỏi tòa án."
                    },
                    {
                        "en": "Well that's my theory ruled out of court.",
                        "vi": "Đó là lý thuyết của tôi bị loại khỏi tòa án."
                    }
                ]
            }
        ]
    },
    {
        "id": "2834571ba61c4925b6d7e36a36343e14",
        "word": "racket",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈrækɪt/",
            "us": "/ˈrækɪt/"
        },
        "nearby": [
            {
                "word": "rack",
                "pos": "verb"
            },
            {
                "word": "rack-and-pinion",
                "pos": "adjective"
            },
            {
                "word": "racket",
                "pos": "noun"
            },
            {
                "word": "racket abuse",
                "pos": "noun"
            },
            {
                "word": "racketeer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loud unpleasant noise",
                    "vi": "một tiếng ồn lớn khó chịu"
                },
                "examples": [
                    {
                        "en": "Stop making that terrible racket!",
                        "vi": "Đừng làm cái vợt khủng khiếp đó nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a dishonest or illegal way of getting money",
                    "vi": "một cách kiếm tiền không trung thực hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "a protection/extortion/drugs, etc. racket",
                        "vi": "một cái vợt bảo vệ / tống tiền / ma túy, v.v."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of sports equipment used for hitting the ball, etc. in the games of tennis, squash or badminton. It has an oval frame, with strings stretched across and down it.",
                    "vi": "một thiết bị thể thao được sử dụng để đánh bóng, vv trong các trò chơi quần vợt, bóng quần hoặc cầu lông. Nó có một khung hình bầu dục, với các dây kéo căng ngang và kéo xuống nó."
                },
                "examples": [
                    {
                        "en": "He smashed his racket into the clay",
                        "vi": "Anh ta đập cây vợt của mình vào đất sét"
                    },
                    {
                        "en": "McEnroe received a warning for racket abuse in the second set.",
                        "vi": "McEnroe nhận cảnh cáo vì lạm dụng vợt trong set thứ hai."
                    },
                    {
                        "en": "You should restring your racket twice a year.",
                        "vi": "Bạn nên cho vợt của mình nghỉ ngơi hai lần một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game for two or four people, similar to squash, played with rackets and a small hard ball in a court with four walls",
                    "vi": "một trò chơi dành cho hai hoặc bốn người, tương tự như bóng quần, chơi với vợt và một quả bóng cứng nhỏ trong sân có bốn bức tường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f66c46f4e4cd4dde82460a48296459b7",
        "word": "tennis racket",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtenɪs rækɪt/",
            "us": "/ˈtenɪs rækɪt/"
        },
        "nearby": [
            {
                "word": "tennis",
                "pos": "noun"
            },
            {
                "word": "tennis elbow",
                "pos": "noun"
            },
            {
                "word": "tennis racket",
                "pos": "noun"
            },
            {
                "word": "tennis shoe",
                "pos": "noun"
            },
            {
                "word": "Lord Tennyson",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the racket that you use when you play tennis",
                    "vi": "cây vợt mà bạn sử dụng khi bạn chơi quần vợt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "397d8322069944a0aa9e7d1977853680",
        "word": "grass court",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɡrɑːs ˈkɔːt/",
            "us": "/ˌɡræs ˈkɔːrt/"
        },
        "nearby": [
            {
                "word": "grass",
                "pos": "noun"
            },
            {
                "word": "grass",
                "pos": "verb"
            },
            {
                "word": "grass court",
                "pos": "noun"
            },
            {
                "word": "grasscutter",
                "pos": "noun"
            },
            {
                "word": "grassed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tennis court with a grass surface",
                    "vi": "một sân tennis với mặt cỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9bbb90aa03f443e7b936a316c6a31b04",
        "word": "racquet",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrækɪt/",
            "us": "/ˈrækɪt/"
        },
        "nearby": [
            {
                "word": "raconteur",
                "pos": "noun"
            },
            {
                "word": "racoon",
                "pos": "noun"
            },
            {
                "word": "racquet",
                "pos": "noun"
            },
            {
                "word": "racquet abuse",
                "pos": "noun"
            },
            {
                "word": "racquetball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of sports equipment used for hitting the ball, etc. in the games of tennis, squash or badminton. It has an oval frame, with strings stretched across and down it.",
                    "vi": "một thiết bị thể thao được sử dụng để đánh bóng, vv trong các trò chơi quần vợt, bóng quần hoặc cầu lông. Nó có một khung hình bầu dục, với các dây kéo căng ngang và kéo xuống nó."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a game for two or four people, similar to squash, played with racquets and a small hard ball in a court with four walls",
                    "vi": "một trò chơi dành cho hai hoặc bốn người, tương tự như bóng quần, chơi với vợt và một quả bóng cứng nhỏ trong sân có bốn bức tường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8e51386a21ba40efb02a73260ec3ea2b",
        "word": "string",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/strɪŋ/",
            "us": "/strɪŋ/"
        },
        "nearby": [
            {
                "word": "Strine",
                "pos": "noun"
            },
            {
                "word": "Strine",
                "pos": "adjective"
            },
            {
                "word": "string",
                "pos": "noun"
            },
            {
                "word": "string",
                "pos": "verb"
            },
            {
                "word": "string",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "long, thin material used for tying things together, made of several threads that have been twisted together; a piece of string used to fasten or pull something or keep something in place",
                    "vi": "Vật liệu dài, mỏng dùng để buộc các thứ lại với nhau, làm bằng nhiều sợi chỉ xoắn lại với nhau; một đoạn dây được sử dụng để buộc hoặc kéo một cái gì đó hoặc giữ một cái gì đó ở đúng vị trí"
                },
                "examples": [
                    {
                        "en": "a piece/length/ball of string",
                        "vi": "một đoạn / chiều dài / chuỗi bóng"
                    },
                    {
                        "en": "He wrapped the package in brown paper and tied it with string.",
                        "vi": "Anh gói gói bằng giấy nâu và buộc nó bằng dây."
                    },
                    {
                        "en": "The key is hanging on a string by the door.",
                        "vi": "Chìa khóa được treo trên một sợi dây bên cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set or series of things that are joined together, for example on a string",
                    "vi": "một tập hợp hoặc một loạt các thứ được nối với nhau, ví dụ như trên một chuỗi"
                },
                "examples": [
                    {
                        "en": "a string of pearls",
                        "vi": "một chuỗi ngọc trai"
                    },
                    {
                        "en": "The molecules join together to form long strings.",
                        "vi": "Các phân tử liên kết với nhau tạo thành chuỗi dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of things or people that come closely one after another",
                    "vi": "một loạt những thứ hoặc những người đến gần nhau"
                },
                "examples": [
                    {
                        "en": "The band had a string of hits in the nineties.",
                        "vi": "Ban nhạc đã có một chuỗi thành công vào những năm chín mươi."
                    },
                    {
                        "en": "He owns a string of racing stables.",
                        "vi": "Anh ta sở hữu một chuỗi chuồng đua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of characters (= letters, numbers, etc.)",
                    "vi": "một loạt các ký tự (= chữ cái, số, v.v.)"
                },
                "examples": [
                    {
                        "en": "to key in/enter a search string",
                        "vi": "để nhập / nhập một chuỗi tìm kiếm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a tightly stretched piece of wire, nylon, or catgut on a musical instrument, that produces a musical note when the instrument is played",
                    "vi": "một đoạn dây, nylon hoặc catgut căng chặt trên một nhạc cụ, tạo ra một nốt nhạc khi nhạc cụ được chơi"
                },
                "examples": [
                    {
                        "en": "Play it on the G string.",
                        "vi": "Chơi nó trên dây G."
                    }
                ]
            },
            {
                "define": {
                    "en": "the group of musical instruments in an orchestra that have strings, for example violins; the people who play them",
                    "vi": "nhóm nhạc cụ trong dàn nhạc có bộ dây, ví dụ đàn vĩ cầm; những người chơi chúng"
                },
                "examples": [
                    {
                        "en": "The opening theme is taken up by the strings.",
                        "vi": "Chủ đề mở đầu được đảm nhận bởi các chuỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the tightly stretched pieces of nylon or natural gut in a racket, used for hitting balls in tennis and some other sports",
                    "vi": "bất kỳ miếng nylon hoặc ruột tự nhiên nào được kéo căng chặt chẽ trong vợt, được sử dụng để đánh bóng trong quần vợt và một số môn thể thao khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "special conditions or limits",
                    "vi": "điều kiện hoặc giới hạn đặc biệt"
                },
                "examples": [
                    {
                        "en": "Major loans like these always come with strings.",
                        "vi": "Các khoản vay lớn như thế này luôn đi kèm với các khoản nợ."
                    },
                    {
                        "en": "It's a business proposition, pure and simple. No strings attached.",
                        "vi": "Đó là một đề xuất kinh doanh, thuần túy và đơn giản. Không có chuỗi đính kèm."
                    }
                ]
            },
            {
                "define": {
                    "en": "(too much under) the influence and control of somebody",
                    "vi": "(quá nhiều dưới) ảnh hưởng và kiểm soát của ai đó"
                },
                "examples": [
                    {
                        "en": "The British prime minister is too apt to cling to Washington's apron strings.",
                        "vi": "Thủ tướng Anh quá thích đeo tạp dề của Washington."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have more than one skill or plan that you can use if you need to",
                    "vi": "có nhiều kỹ năng hoặc kế hoạch mà bạn có thể sử dụng nếu cần"
                },
                "examples": [
                    {
                        "en": "The exhibition shows that he has other strings to his artistic bow.",
                        "vi": "Triển lãm cho thấy anh ấy có những sợi dây khác với cung nghệ thuật của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is no definite answer to a question",
                    "vi": "được sử dụng để nói rằng không có câu trả lời chắc chắn cho một câu hỏi"
                },
                "examples": [
                    {
                        "en": "‘How long will it take?’ ‘How long's a piece of string?’",
                        "vi": "Làm cái đó mất bao lâu?' 'Một đoạn dây dài bao nhiêu?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to use your influence in order to get an advantage for somebody",
                    "vi": "sử dụng ảnh hưởng của bạn để có được lợi thế cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to control events or the actions of other people",
                    "vi": "để kiểm soát các sự kiện hoặc hành động của người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce6b443dc2414d20a508b16acd7d964b",
        "word": "two-handed",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌtuː ˈhændɪd/",
            "us": "/ˌtuː ˈhændɪd/"
        },
        "nearby": [
            {
                "word": "two-four",
                "pos": "noun"
            },
            {
                "word": "The Two Gentlemen of Verona",
                "pos": ""
            },
            {
                "word": "two-handed",
                "pos": "adjective"
            },
            {
                "word": "two-hander",
                "pos": "noun"
            },
            {
                "word": "Cy Twombly",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using or needing both hands",
                    "vi": "sử dụng hoặc cần cả hai tay"
                },
                "examples": [
                    {
                        "en": "a two-handed backhand (= in tennis)",
                        "vi": "trái tay hai tay (= trong quần vợt)"
                    },
                    {
                        "en": "a two-handed catch",
                        "vi": "bắt cá bằng hai tay"
                    }
                ]
            }
        ]
    },
    {
        "id": "4d4929aa40c746c6897f9a34d34e6116",
        "word": "clay court",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkleɪ kɔːt/",
            "us": "/ˈkleɪ kɔːrt/"
        },
        "nearby": [
            {
                "word": "clay",
                "pos": "noun"
            },
            {
                "word": "Cassius Clay",
                "pos": ""
            },
            {
                "word": "clay court",
                "pos": "noun"
            },
            {
                "word": "clayey",
                "pos": "adjective"
            },
            {
                "word": "claymore",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tennis court that has a surface made of clay",
                    "vi": "một sân tennis có bề mặt làm bằng đất sét"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4ff62dbc31d48f68e2856b2fe1165f4",
        "word": "double",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʌbl/",
            "us": "/ˈdʌbl/"
        },
        "nearby": [
            {
                "word": "double",
                "pos": "verb"
            },
            {
                "word": "double",
                "pos": "adverb"
            },
            {
                "word": "double",
                "pos": "noun"
            },
            {
                "word": "double act",
                "pos": "noun"
            },
            {
                "word": "double-action",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that looks exactly like another",
                    "vi": "một người hoặc một vật giống hệt như một người khác"
                },
                "examples": [
                    {
                        "en": "She's the double of her mother.",
                        "vi": "Cô ấy là đôi của mẹ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "an actor who replaces another actor in a film to do dangerous or other special things",
                    "vi": "một diễn viên thay thế một diễn viên khác trong phim để làm những việc nguy hiểm hoặc đặc biệt khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a bedroom for two people",
                    "vi": "một phòng ngủ cho hai người"
                },
                "examples": [
                    {
                        "en": "Is that a single or a double you want?",
                        "vi": "Đó là một đơn hay một đôi bạn muốn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a glass of strong alcoholic drink containing twice the usual amount",
                    "vi": "một ly đồ uống có cồn mạnh chứa gấp đôi lượng bình thường"
                },
                "examples": [
                    {
                        "en": "Two Scotches, please—and make those doubles, will you?",
                        "vi": "Hai người Scotch, làm ơn — và tạo thành đôi đó, được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a game, especially of tennis, in which one pair plays another",
                    "vi": "một trò chơi, đặc biệt là quần vợt, trong đó một cặp đấu cặp khác"
                },
                "examples": [
                    {
                        "en": "mixed doubles (= in which each pair consists of a man and a woman)",
                        "vi": "đôi hỗn hợp (= trong đó mỗi cặp bao gồm một nam và một nữ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of winning two important competitions or beating the same player or team twice, in the same season or year",
                    "vi": "thực tế là chiến thắng hai cuộc thi quan trọng hoặc đánh bại cùng một cầu thủ hoặc một đội hai lần, trong cùng một mùa giải hoặc năm"
                },
                "examples": [
                    {
                        "en": "She’s going for the double this year—the Olympics and the World Championship.",
                        "vi": "Cô ấy sẽ giành cú đúp trong năm nay — Thế vận hội và Giải vô địch thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "quickly; hurrying",
                    "vi": "Mau; vội vàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a risk in which you could win twice the amount you pay, or you could lose all your money",
                    "vi": "rủi ro trong đó bạn có thể thắng gấp đôi số tiền bạn trả hoặc bạn có thể mất tất cả tiền của mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0ab73482be2455cb542de080ab91633",
        "word": "grip",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡrɪp/",
            "us": "/ɡrɪp/"
        },
        "nearby": [
            {
                "word": "gringo",
                "pos": "noun"
            },
            {
                "word": "griot",
                "pos": "noun"
            },
            {
                "word": "grip",
                "pos": "noun"
            },
            {
                "word": "grip",
                "pos": "verb"
            },
            {
                "word": "gripe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of holding somebody/something tightly; a particular way of doing this",
                    "vi": "hành động ôm chặt ai đó / cái gì đó; một cách cụ thể để làm điều này"
                },
                "examples": [
                    {
                        "en": "Keep a tight grip on the rope.",
                        "vi": "Giữ chặt dây."
                    },
                    {
                        "en": "to loosen/release/relax your grip",
                        "vi": "nới lỏng / giải phóng / thả lỏng tay cầm của bạn"
                    },
                    {
                        "en": "She tried to get a grip on the icy rock.",
                        "vi": "Cô cố gắng bám vào tảng đá băng giá."
                    },
                    {
                        "en": "The climber slipped and lost her grip.",
                        "vi": "Người leo núi bị trượt chân và mất độ bám."
                    },
                    {
                        "en": "She struggled from his grip.",
                        "vi": "Cô vùng vẫy khỏi sự kìm kẹp của anh."
                    },
                    {
                        "en": "Try adjusting your grip on the racket.",
                        "vi": "Thử điều chỉnh độ bám của bạn trên vợt."
                    }
                ]
            },
            {
                "define": {
                    "en": "control or power over somebody/something",
                    "vi": "kiểm soát hoặc quyền lực đối với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The home team took a firm grip on the game.",
                        "vi": "Đội chủ nhà nắm chắc thế trận."
                    },
                    {
                        "en": "We need to tighten the grip we have on the market.",
                        "vi": "Chúng ta cần phải thắt chặt sự kìm kẹp mà chúng ta có trên thị trường."
                    },
                    {
                        "en": "The Prime Minister needs to keep a tight grip on his party.",
                        "vi": "Thủ tướng cần phải giữ chặt đảng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an understanding of something",
                    "vi": "sự hiểu biết về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't get a grip on what was going on.",
                        "vi": "Tôi không thể hiểu được chuyện gì đang xảy ra."
                    },
                    {
                        "en": "You need to keep a good grip on reality in this job.",
                        "vi": "Bạn cần phải nắm bắt tốt thực tế trong công việc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability of something to move over a surface without slipping",
                    "vi": "khả năng của một thứ gì đó di chuyển trên bề mặt mà không bị trượt"
                },
                "examples": [
                    {
                        "en": "These tyres give the bus better grip in slippery conditions.",
                        "vi": "Loại lốp này giúp xe bám đường tốt hơn trong điều kiện trơn trượt."
                    },
                    {
                        "en": "This type of sole gives a good grip on snow and ice.",
                        "vi": "Loại đế này cho cảm giác bám tốt trên băng tuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of something that has a special surface so that it can be held without the hands slipping",
                    "vi": "một bộ phận của vật gì đó có bề mặt đặc biệt để có thể cầm nó mà tay không bị trượt"
                },
                "examples": [
                    {
                        "en": "the grip on a golf club",
                        "vi": "tay cầm gậy đánh gôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small thin piece of metal or plastic folded in the middle, used by women for holding their hair in place",
                    "vi": "một mảnh kim loại hoặc nhựa mỏng nhỏ được gấp lại ở giữa, được phụ nữ sử dụng để giữ nếp tóc của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who prepares and moves the cameras, and sometimes the lighting equipment, when a film is being made",
                    "vi": "một người chuẩn bị và di chuyển máy ảnh, và đôi khi là thiết bị chiếu sáng, khi làm phim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large soft bag, used when travelling",
                    "vi": "một túi mềm lớn, được sử dụng khi đi du lịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to begin to understand and deal with something difficult",
                    "vi": "để bắt đầu hiểu và đối phó với điều gì đó khó khăn"
                },
                "examples": [
                    {
                        "en": "I'm slowly getting to grips with the language.",
                        "vi": "Tôi dần dần hiểu được ngôn ngữ này."
                    },
                    {
                        "en": "They have so far failed to come to grips with the ecological problems.",
                        "vi": "Cho đến nay, họ vẫn chưa hiểu rõ các vấn đề sinh thái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to improve your behaviour or control your emotions after being afraid, upset or angry",
                    "vi": "để cải thiện hành vi của bạn hoặc kiểm soát cảm xúc của bạn sau khi sợ hãi, khó chịu hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "I have to take a grip on myself, he told himself firmly.",
                        "vi": "Anh phải tự kiềm chế bản thân mình, anh kiên quyết nói với bản thân."
                    },
                    {
                        "en": "(informal) Get a grip! (= make an effort to control your emotions)",
                        "vi": "(không chính thức) Hãy nắm lấy! (= cố gắng kiểm soát cảm xúc của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "experiencing something unpleasant that cannot be stopped",
                    "vi": "trải qua một cái gì đó khó chịu mà không thể dừng lại"
                },
                "examples": [
                    {
                        "en": "a country in the grip of recession",
                        "vi": "một đất nước đang trong vòng suy thoái"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become unable to understand or control a situation",
                    "vi": "trở nên không thể hiểu hoặc kiểm soát một tình huống"
                },
                "examples": [
                    {
                        "en": "Sometimes I feel I'm losing my grip.",
                        "vi": "Đôi khi tôi cảm thấy mình đang mất dần sự bám víu."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee8fc04682544ca0a2752d9e8ff2292c",
        "word": "hard court",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhɑːd ˈkɔːt/",
            "us": "/ˌhɑːrd ˈkɔːrt/"
        },
        "nearby": [
            {
                "word": "hard core",
                "pos": "noun"
            },
            {
                "word": "hard-core",
                "pos": "adjective"
            },
            {
                "word": "hard court",
                "pos": "noun"
            },
            {
                "word": "hardcover",
                "pos": "noun"
            },
            {
                "word": "hard currency",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area with a hard surface for playing tennis on, not grass",
                    "vi": "một khu vực có bề mặt cứng để chơi quần vợt, không phải cỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "773ac154337a47cf9cc6b1d093c10059",
        "word": "match point",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmætʃ ˈpɔɪnt/",
            "us": "/ˌmætʃ ˈpɔɪnt/"
        },
        "nearby": [
            {
                "word": "Match of the Day",
                "pos": ""
            },
            {
                "word": "match play",
                "pos": "noun"
            },
            {
                "word": "match point",
                "pos": "noun"
            },
            {
                "word": "matchstick",
                "pos": "noun"
            },
            {
                "word": "matchstick figure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a point that, if won by a player, will also win them the match",
                    "vi": "một điểm mà nếu người chơi thắng, cũng sẽ thắng họ trong trận đấu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "58ded43221bc411db97aa1c896186854",
        "word": "single",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɪŋɡl/",
            "us": "/ˈsɪŋɡl/"
        },
        "nearby": [
            {
                "word": "Singin' in the Rain",
                "pos": ""
            },
            {
                "word": "single",
                "pos": "adjective"
            },
            {
                "word": "single",
                "pos": "noun"
            },
            {
                "word": "single",
                "pos": "verb"
            },
            {
                "word": "single bed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ticket that allows you to travel to a place but not back again",
                    "vi": "một tấm vé cho phép bạn đi đến một nơi nhưng không quay lại lần nữa"
                },
                "examples": [
                    {
                        "en": "How much is a single to York?",
                        "vi": "Bao nhiêu là một đơn đến York?"
                    },
                    {
                        "en": "I got a single to Birmingham.",
                        "vi": "Tôi có một đĩa đơn đến Birmingham."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a hotel, etc. for one person",
                    "vi": "một phòng trong khách sạn, v.v. cho một người"
                },
                "examples": [
                    {
                        "en": "Singles are available from £50 per night.",
                        "vi": "Người độc thân có giá từ £ 50 một đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are not married and do not have a romantic relationship with somebody else",
                    "vi": "những người chưa kết hôn và không có mối quan hệ lãng mạn với người khác"
                },
                "examples": [
                    {
                        "en": "They organize parties for singles.",
                        "vi": "Họ tổ chức những bữa tiệc cho những người độc thân."
                    },
                    {
                        "en": "a singles bar/club",
                        "vi": "một quán bar / câu lạc bộ độc thân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of recorded music, usually popular music, that consists of one song; a CD that a single is recorded on",
                    "vi": "một bản nhạc đã ghi, thường là nhạc phổ thông, bao gồm một bài hát; đĩa CD ghi một đĩa đơn"
                },
                "examples": [
                    {
                        "en": "The band releases its new single next week.",
                        "vi": "Ban nhạc phát hành đĩa đơn mới vào tuần tới."
                    },
                    {
                        "en": "The band has yet to record a hit single.",
                        "vi": "Ban nhạc vẫn chưa thu âm một đĩa đơn nào ăn khách."
                    },
                    {
                        "en": "Her catchy debut single was a hit.",
                        "vi": "Đĩa đơn đầu tay hấp dẫn của cô đã thành công vang dội."
                    },
                    {
                        "en": "This is a single from their album ‘Magic’.",
                        "vi": "Đây là một đĩa đơn trong album 'Magic' của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a note that is worth one dollar",
                    "vi": "một tờ tiền trị giá một đô la"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a game when only one player plays against one other; a series of two or more of these games",
                    "vi": "một trò chơi khi chỉ có một người chơi đấu với một người khác; một loạt hai hoặc nhiều trò chơi này"
                },
                "examples": [
                    {
                        "en": "the women’s singles champion",
                        "vi": "nhà vô địch đơn nữ"
                    },
                    {
                        "en": "the first round of the men’s singles",
                        "vi": "vòng đầu tiên của đơn nam"
                    },
                    {
                        "en": "a singles match",
                        "vi": "một trận đấu đơn"
                    },
                    {
                        "en": "She's won three singles titles this year.",
                        "vi": "Cô ấy đã giành được ba danh hiệu đơn trong năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hit from which a player scores one run (= point)",
                    "vi": "một cú đánh mà từ đó người chơi ghi được một lần chạy (= điểm)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a hit that only allows the player to run to first base",
                    "vi": "một cú đánh chỉ cho phép người chơi chạy đến căn cứ đầu tiên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bfb2ef5626e440109df0e9df6952e6c2",
        "word": "umpire",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʌmpaɪə(r)/",
            "us": "/ˈʌmpaɪər/"
        },
        "nearby": [
            {
                "word": "umlaut",
                "pos": "noun"
            },
            {
                "word": "UMPC",
                "pos": "noun"
            },
            {
                "word": "umpire",
                "pos": "noun"
            },
            {
                "word": "umpire",
                "pos": "verb"
            },
            {
                "word": "umpteen",
                "pos": "determiner"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to watch a game and make sure that rules are not broken",
                    "vi": "một người có công việc là xem một trò chơi và đảm bảo rằng các quy tắc không bị phá vỡ"
                },
                "examples": [
                    {
                        "en": "The umpire’s decision is final.",
                        "vi": "Quyết định của trọng tài là quyết định cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "319cc23f41d5499287f9650c6327bf23",
        "word": "ace",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/eɪs/",
            "us": "/eɪs/"
        },
        "nearby": [
            {
                "word": "accustomed",
                "pos": "adjective"
            },
            {
                "word": "accustom to",
                "pos": "phrasal verb"
            },
            {
                "word": "ace",
                "pos": "noun"
            },
            {
                "word": "ace",
                "pos": "adjective"
            },
            {
                "word": "ace",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a playing card with a large single symbol on it, which has either the highest or the lowest value in a particular card game",
                    "vi": "một thẻ chơi có một biểu tượng lớn trên đó, có giá trị cao nhất hoặc thấp nhất trong một trò chơi bài cụ thể"
                },
                "examples": [
                    {
                        "en": "the ace of spades/hearts/diamonds/clubs",
                        "vi": "át chủ bài / trái tim / kim cương / câu lạc bộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very good at doing something",
                    "vi": "một người rất giỏi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "a soccer/flying ace",
                        "vi": "một ace bóng đá / bay"
                    },
                    {
                        "en": "an ace marksman",
                        "vi": "một tay thiện xạ ace"
                    },
                    {
                        "en": "French ace Mbappé scored a late penalty.",
                        "vi": "Cầu thủ người Pháp, Mbappe đã ghi bàn sau một quả phạt đền muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a serve (= the first hit) that is so good that your opponent cannot reach the ball",
                    "vi": "một cú giao bóng (= cú đánh đầu tiên) tốt đến mức đối thủ của bạn không thể tiếp cận bóng"
                },
                "examples": [
                    {
                        "en": "He served 20 aces in the match.",
                        "vi": "Anh ta phục vụ 20 quân át chủ bài trong trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a player hits the ball from the tee into the hole using only one shot",
                    "vi": "một trường hợp khi một người chơi đánh bóng từ điểm phát bóng vào lỗ chỉ bằng một cú đánh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a secret advantage, for example a piece of information or a skill, that you are ready to use if you need to",
                    "vi": "một lợi thế bí mật, ví dụ như một phần thông tin hoặc một kỹ năng, mà bạn sẵn sàng sử dụng nếu bạn cần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have all the advantages in a situation",
                    "vi": "để có tất cả các lợi thế trong một tình huống"
                },
                "examples": [
                    {
                        "en": "The union soon realized that the management held all the aces.",
                        "vi": "Công đoàn sớm nhận ra rằng ban quản lý nắm giữ tất cả các quân át chủ bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use your best argument, etc. in order to get an advantage in a situation",
                    "vi": "sử dụng lý lẽ tốt nhất của bạn, v.v. để đạt được lợi thế trong một tình huống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very close to something",
                    "vi": "rất gần với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We came within an ace of victory.",
                        "vi": "Chúng tôi đã đến trong một chiến thắng át chủ bài."
                    }
                ]
            }
        ]
    },
    {
        "id": "d6afd8145bf748239a109eaed13de658",
        "word": "advantage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ədˈvɑːntɪdʒ/",
            "us": "/ədˈvæntɪdʒ/"
        },
        "nearby": [
            {
                "word": "advancement",
                "pos": "noun"
            },
            {
                "word": "advancing",
                "pos": "adjective"
            },
            {
                "word": "advantage",
                "pos": "noun"
            },
            {
                "word": "advantage",
                "pos": "verb"
            },
            {
                "word": "advantaged",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that helps you to be better or more successful than other people",
                    "vi": "một điều giúp bạn trở nên giỏi hơn hoặc thành công hơn những người khác"
                },
                "examples": [
                    {
                        "en": "a distinct/significant/huge advantage",
                        "vi": "một lợi thế khác biệt / đáng kể / to lớn"
                    },
                    {
                        "en": "It gives you an unfair advantage (= something that benefits you, but not your opponents).",
                        "vi": "Nó mang lại cho bạn một lợi thế không công bằng (= một cái gì đó có lợi cho bạn, nhưng không mang lại lợi ích cho đối thủ của bạn)."
                    },
                    {
                        "en": "She had the advantage of a good education.",
                        "vi": "Cô có một lợi thế là một nền giáo dục tốt."
                    },
                    {
                        "en": "You will be at an advantage (= have an advantage) in the interview if you have thought about the questions in advance.",
                        "vi": "Bạn sẽ có lợi thế (= có lợi thế) trong cuộc phỏng vấn nếu bạn đã suy nghĩ trước về các câu hỏi."
                    },
                    {
                        "en": "advantage over somebody The company was able to gain a competitive advantage over its rivals by reducing costs.",
                        "vi": "lợi thế hơn ai đó Công ty có thể đạt được lợi thế cạnh tranh so với các đối thủ của mình bằng cách giảm chi phí."
                    },
                    {
                        "en": "Being tall gave him an advantage over the other players.",
                        "vi": "Với chiều cao lớn giúp anh có lợi thế hơn so với các cầu thủ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quality of something that makes it better or more useful",
                    "vi": "chất lượng của một cái gì đó làm cho nó tốt hơn hoặc hữu ích hơn"
                },
                "examples": [
                    {
                        "en": "Each of these systems has its advantages and disadvantages.",
                        "vi": "Mỗi hệ thống này đều có những ưu điểm và nhược điểm của nó."
                    },
                    {
                        "en": "Continuous assessment offers clear advantages for teachers and students.",
                        "vi": "Đánh giá liên tục mang lại lợi thế rõ ràng cho giáo viên và học sinh."
                    },
                    {
                        "en": "advantage of (doing) something A small car has the added advantage of being cheaper to run.",
                        "vi": "lợi thế của (làm) điều gì đó Một chiếc xe nhỏ có thêm lợi thế là rẻ hơn để chạy."
                    },
                    {
                        "en": "advantage in (doing) something Is there any advantage in getting there early?",
                        "vi": "thuận lợi trong (làm) việc gì đó Có lợi thế nào khi đến đó sớm không?"
                    },
                    {
                        "en": "advantage to (doing) something There are many advantages to online shopping.",
                        "vi": "lợi thế để (làm) điều gì đó Có rất nhiều lợi thế khi mua sắm trực tuyến."
                    }
                ]
            },
            {
                "define": {
                    "en": "the first point scored after a score of 40–40",
                    "vi": "điểm đầu tiên ghi được sau điểm 40–40"
                },
                "examples": [
                    {
                        "en": "Advantage Miss Stephens.",
                        "vi": "Lợi thế của cô Stephens."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give you an advantage; to change a situation in a way that gives you an advantage",
                    "vi": "để cung cấp cho bạn một lợi thế; để thay đổi tình huống theo cách mang lại lợi thế cho bạn"
                },
                "examples": [
                    {
                        "en": "It would be to your advantage to attend this meeting.",
                        "vi": "Sẽ có lợi cho bạn nếu tham dự cuộc họp này."
                    },
                    {
                        "en": "Eventually, the new regulations will work to our advantage.",
                        "vi": "Cuối cùng, các quy định mới sẽ có lợi cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make use of something well; to make use of an opportunity",
                    "vi": "để sử dụng một cái gì đó tốt; để tận dụng cơ hội"
                },
                "examples": [
                    {
                        "en": "She took advantage of the children's absence to tidy their rooms.",
                        "vi": "Cô tranh thủ lúc bọn trẻ đi vắng để dọn dẹp phòng của chúng."
                    },
                    {
                        "en": "We took full advantage of the hotel facilities.",
                        "vi": "Chúng tôi đã tận dụng tối đa các tiện nghi của khách sạn."
                    },
                    {
                        "en": "I took complete advantage of the situation.",
                        "vi": "Tôi đã tận dụng hoàn toàn tình hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make use of somebody/something in a way that is unfair or dishonest",
                    "vi": "sử dụng ai đó / điều gì đó theo cách không công bằng hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "He took advantage of my generosity (= for example, by taking more than I had intended to give).",
                        "vi": "Anh ta đã lợi dụng sự hào phóng của tôi (= ví dụ, bằng cách nhận nhiều hơn những gì tôi định cho)."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that shows the best of somebody/something",
                    "vi": "theo cách thể hiện tốt nhất của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The photograph showed him to advantage.",
                        "vi": "Bức ảnh cho thấy anh ta có lợi thế."
                    },
                    {
                        "en": "May was the month to see the garden to best advantage.",
                        "vi": "Tháng 5 là tháng đi xem vườn để tận dụng tốt nhất."
                    },
                    {
                        "en": "The bright lighting showed the jewels to their best advantage.",
                        "vi": "Ánh sáng rực rỡ đã cho thấy những viên ngọc phát huy được lợi thế tốt nhất của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use or change a bad situation so that it helps you",
                    "vi": "sử dụng hoặc thay đổi một tình huống xấu để nó giúp bạn"
                },
                "examples": [
                    {
                        "en": "Every magician has a trick that goes wrong, but you can turn this to your advantage by pretending it was deliberate and making the audience laugh.",
                        "vi": "Mỗi ảo thuật gia đều có một mẹo sai, nhưng bạn có thể biến điều này thành lợi thế của mình bằng cách giả vờ đó là cố ý và làm cho khán giả cười."
                    }
                ]
            }
        ]
    },
    {
        "id": "4fdb42cbac0141e0b7d65d492ad83d2a",
        "word": "alley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæli/",
            "us": "/ˈæli/"
        },
        "nearby": [
            {
                "word": "alleviate",
                "pos": "verb"
            },
            {
                "word": "alleviation",
                "pos": "noun"
            },
            {
                "word": "alley",
                "pos": "noun"
            },
            {
                "word": "alley cat",
                "pos": "noun"
            },
            {
                "word": "Edward Alleyn",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow passage behind or between buildings",
                    "vi": "một lối đi hẹp phía sau hoặc giữa các tòa nhà"
                },
                "examples": [
                    {
                        "en": "a narrow/dark alley",
                        "vi": "một con hẻm hẹp / tối"
                    },
                    {
                        "en": "The car was hidden down a narrow alley in the downtown area.",
                        "vi": "Chiếc xe nằm khuất trong một con hẻm hẹp ở khu vực trung tâm thành phố."
                    },
                    {
                        "en": "He ran down one of the dark alleys at the back of the shops.",
                        "vi": "Anh chạy xuống một trong những con hẻm tối ở phía sau các cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area between the pair of straight lines on a tennis or badminton court that mark the extra area that is used when four people are playing",
                    "vi": "Khu vực giữa các cặp đường thẳng trên sân tennis hoặc sân cầu lông đánh dấu phần diện tích thừa được sử dụng khi bốn người đang chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very suitable for you because it is something that you know a lot about or are very interested in",
                    "vi": "rất phù hợp với bạn vì nó là thứ mà bạn biết nhiều hoặc rất quan tâm"
                },
                "examples": [
                    {
                        "en": "A teaching job would be right up her alley.",
                        "vi": "Một công việc dạy học sẽ ở ngay trên con hẻm của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "f658d1f8c8074503bd011efcff215b75",
        "word": "backhand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbækhænd/",
            "us": "/ˈbækhænd/"
        },
        "nearby": [
            {
                "word": "backgammon",
                "pos": "noun"
            },
            {
                "word": "background",
                "pos": "noun"
            },
            {
                "word": "backhand",
                "pos": "noun"
            },
            {
                "word": "backhanded",
                "pos": "adjective"
            },
            {
                "word": "backhander",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of hitting the ball in some sports that is played with the back of the hand turned in the direction towards which the ball is hit",
                    "vi": "một cách đánh bóng trong một số môn thể thao được chơi với mu bàn tay quay về hướng bóng được đánh"
                },
                "examples": [
                    {
                        "en": "He has a good backhand (= he can make good backhand strokes).",
                        "vi": "Anh ta có một trái tay tốt (= anh ta có thể thực hiện những cú đánh trái tay tốt)."
                    },
                    {
                        "en": "a backhand volley/drive",
                        "vi": "một cú vô lê / đánh trái tay"
                    }
                ]
            }
        ]
    },
    {
        "id": "c27d8f9050364ad1ac2d3657c32a2c76",
        "word": "ballboy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɔːlbɔɪ/",
            "us": "/ˈbɔːlbɔɪ/"
        },
        "nearby": [
            {
                "word": "ballast",
                "pos": "noun"
            },
            {
                "word": "ball bearing",
                "pos": "noun"
            },
            {
                "word": "ballboy",
                "pos": "noun"
            },
            {
                "word": "ball-breaker",
                "pos": "noun"
            },
            {
                "word": "ball-breaking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a boy who picks up the balls for the players in a tennis match",
                    "vi": "một cậu bé nhặt bóng cho các cầu thủ trong một trận đấu quần vợt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6cfa9eeed1624276a330a6c7c7caf00c",
        "word": "ballgirl",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɔːlɡɜːl/",
            "us": "/ˈbɔːlɡɜːrl/"
        },
        "nearby": [
            {
                "word": "balletomane",
                "pos": "noun"
            },
            {
                "word": "ball game",
                "pos": "noun"
            },
            {
                "word": "ballgirl",
                "pos": "noun"
            },
            {
                "word": "ballhawk",
                "pos": "noun"
            },
            {
                "word": "ball hockey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a girl who picks up the balls for the players in a tennis match",
                    "vi": "một cô gái nhặt bóng cho các cầu thủ trong một trận đấu quần vợt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bda6847379dd47e2818222c1e5a32629",
        "word": "baseline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbeɪslaɪn/",
            "us": "/ˈbeɪslaɪn/"
        },
        "nearby": [
            {
                "word": "base jumping",
                "pos": "noun"
            },
            {
                "word": "baseless",
                "pos": "adjective"
            },
            {
                "word": "baseline",
                "pos": "noun"
            },
            {
                "word": "basely",
                "pos": "adverb"
            },
            {
                "word": "baseman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line marking each end of the court in tennis or the edge of the area where a player can run in baseball",
                    "vi": "một đường đánh dấu mỗi đầu của sân trong môn quần vợt hoặc mép của khu vực mà một người chơi có thể chạy trong môn bóng chày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a line or measurement that is used as a starting point when comparing facts",
                    "vi": "một đường hoặc phép đo được sử dụng làm điểm bắt đầu khi so sánh các dữ kiện"
                },
                "examples": [
                    {
                        "en": "The figures for 2014 were used as a baseline for the study.",
                        "vi": "Các số liệu của năm 2014 được sử dụng làm cơ sở cho nghiên cứu."
                    }
                ]
            }
        ]
    },
    {
        "id": "ece6c4575f2442288c90f020cc6686a7",
        "word": "break",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/breɪk/",
            "us": "/breɪk/"
        },
        "nearby": [
            {
                "word": "breadwinner",
                "pos": "noun"
            },
            {
                "word": "break",
                "pos": "verb"
            },
            {
                "word": "break",
                "pos": "noun"
            },
            {
                "word": "breakable",
                "pos": "adjective"
            },
            {
                "word": "breakage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short period of time when you stop what you are doing and rest, eat, etc.",
                    "vi": "một khoảng thời gian ngắn khi bạn dừng việc đang làm và nghỉ ngơi, ăn uống, v.v."
                },
                "examples": [
                    {
                        "en": "She was on her lunch break.",
                        "vi": "Cô ấy đang nghỉ trưa."
                    },
                    {
                        "en": "a coffee/tea break",
                        "vi": "một ly cà phê / trà"
                    },
                    {
                        "en": "Let's take a break.",
                        "vi": "Hãy nghỉ ngơi đi."
                    },
                    {
                        "en": "break for something a break for lunch",
                        "vi": "nghỉ ngơi cho một cái gì đó nghỉ ngơi cho bữa trưa"
                    },
                    {
                        "en": "a bathroom break (= a short period when somebody stops what they are doing to use the toilet)",
                        "vi": "nghỉ trong phòng tắm (= một khoảng thời gian ngắn khi ai đó ngừng việc họ đang làm để đi vệ sinh)"
                    },
                    {
                        "en": "She worked all day without a break.",
                        "vi": "Cô ấy đã làm việc cả ngày không nghỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time between lessons at school",
                    "vi": "một khoảng thời gian giữa các bài học ở trường"
                },
                "examples": [
                    {
                        "en": "Come and see me at break.",
                        "vi": "Hãy đến và gặp tôi lúc giải lao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time when something stops before starting again",
                    "vi": "một khoảng thời gian khi một cái gì đó dừng lại trước khi bắt đầu lại"
                },
                "examples": [
                    {
                        "en": "Employees can take a career break of up to one year.",
                        "vi": "Nhân viên có thể nghỉ việc lên đến một năm."
                    },
                    {
                        "en": "break in something a break in my daily routine",
                        "vi": "phá vỡ một cái gì đó phá vỡ trong thói quen hàng ngày của tôi"
                    },
                    {
                        "en": "break from something He is having a break from his successful television show.",
                        "vi": "break from something Anh ấy đang nghỉ giải lao khỏi chương trình truyền hình thành công của mình."
                    },
                    {
                        "en": "break from doing something I need a break from caring for the children.",
                        "vi": "nghỉ làm việc gì đó Tôi cần nghỉ chăm sóc bọn trẻ."
                    },
                    {
                        "en": "the summer/winter break",
                        "vi": "kỳ nghỉ hè / nghỉ đông"
                    },
                    {
                        "en": "(especially British English) the Christmas/Easter break (= the period at Christmas/Easter when most people do not work)",
                        "vi": "(đặc biệt là tiếng Anh Anh) kỳ nghỉ Giáng sinh / Lễ Phục sinh (= khoảng thời gian vào Lễ Giáng sinh / Lễ Phục sinh khi hầu hết mọi người không làm việc)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of time when a television or radio show stops for advertisements",
                    "vi": "một khoảng thời gian ngắn khi một chương trình truyền hình hoặc đài phát thanh ngừng quảng cáo"
                },
                "examples": [
                    {
                        "en": "More news after the break.",
                        "vi": "Thêm tin tức sau giờ nghỉ."
                    },
                    {
                        "en": "Most viewers tend to skip through the ad breaks.",
                        "vi": "Hầu hết người xem có xu hướng bỏ qua các phần ngắt quảng cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short holiday",
                    "vi": "một kỳ nghỉ ngắn ngày"
                },
                "examples": [
                    {
                        "en": "We had a weekend break in New York.",
                        "vi": "Chúng tôi đã có một kỳ nghỉ cuối tuần ở New York."
                    },
                    {
                        "en": "a well-earned break",
                        "vi": "một kỳ nghỉ kiếm được nhiều tiền"
                    },
                    {
                        "en": "a two/three-night break",
                        "vi": "nghỉ hai / ba đêm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the moment when a situation or a relationship that has existed for a time changes, ends or is interrupted",
                    "vi": "thời điểm mà một tình huống hoặc một mối quan hệ đã tồn tại trong một thời gian thay đổi, kết thúc hoặc bị gián đoạn"
                },
                "examples": [
                    {
                        "en": "I wanted to leave but was nervous about making the break.",
                        "vi": "Tôi muốn rời đi nhưng lo lắng về việc nghỉ giải lao."
                    },
                    {
                        "en": "break with somebody/something He needed to make a complete break with the past.",
                        "vi": "chia tay với ai đó / điều gì đó Anh ấy cần phải đoạn tuyệt hoàn toàn với quá khứ."
                    },
                    {
                        "en": "a break with tradition (= a change from what is accepted, in something such as art, behaviour, etc.)",
                        "vi": "đoạn tuyệt với truyền thống (= một sự thay đổi so với những gì được chấp nhận, trong một cái gì đó chẳng hạn như nghệ thuật, hành vi, v.v.)"
                    },
                    {
                        "en": "break in something a break in the weather (= a change from one type of weather to a different one)",
                        "vi": "phá vỡ điều gì đó nghỉ ngơi trong thời tiết (= sự thay đổi từ một kiểu thời tiết này sang kiểu thời tiết khác)"
                    },
                    {
                        "en": "a break in diplomatic relations",
                        "vi": "đứt gãy quan hệ ngoại giao"
                    },
                    {
                        "en": "break from something This event represents a real break from tradition.",
                        "vi": "phá vỡ một cái gì đó Sự kiện này đại diện cho một sự phá vỡ thực sự khỏi truyền thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a space or an opening between two or more things",
                    "vi": "một khoảng trống hoặc một khoảng trống giữa hai hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "We could see the moon through a break in the clouds.",
                        "vi": "Chúng tôi có thể nhìn thấy mặt trăng qua một đám mây."
                    },
                    {
                        "en": "Wait for a break in the traffic before crossing the road.",
                        "vi": "Chờ cho xe tắc nghẽn trước khi băng qua đường."
                    },
                    {
                        "en": "The track bends left through a break in the hedge.",
                        "vi": "Đường đi uốn cong bên trái thông qua một điểm gãy trong hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "an opportunity to do something, usually to get something that you want or to achieve success",
                    "vi": "cơ hội để làm điều gì đó, thường là để đạt được điều gì đó bạn muốn hoặc đạt được thành công"
                },
                "examples": [
                    {
                        "en": "I got my lucky break when I won a ‘Young Journalist of the Year’ competition.",
                        "vi": "Tôi đã có một cơ hội may mắn khi giành chiến thắng trong cuộc thi 'Nhà báo trẻ của năm'."
                    },
                    {
                        "en": "We've had a few bad breaks (= pieces of bad luck) along the way.",
                        "vi": "Chúng tôi đã có một vài lần đổ vỡ tồi tệ (= những phần kém may mắn) trong suốt chặng đường."
                    },
                    {
                        "en": "If you just give me a break, you won’t regret it.",
                        "vi": "Chỉ cần anh cho em nghỉ ngơi, anh sẽ không hối hận."
                    },
                    {
                        "en": "He's the director who gave her her first big break.",
                        "vi": "Anh ấy là giám đốc đã mang lại cho cô ấy bước đột phá lớn đầu tiên."
                    },
                    {
                        "en": "It's often difficult for talented newcomers to get the break they deserve.",
                        "vi": "Những người mới tài năng thường khó có được kỳ nghỉ xứng đáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where something, especially a bone in your body, has broken",
                    "vi": "nơi có thứ gì đó, đặc biệt là xương trong cơ thể bạn, bị gãy"
                },
                "examples": [
                    {
                        "en": "The X-ray showed there was no break in his leg.",
                        "vi": "Ảnh chụp X-quang cho thấy không có vết gãy ở chân của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a win in a game in which your opponent is serving",
                    "vi": "chiến thắng trong một trò chơi mà đối thủ của bạn đang giao bóng"
                },
                "examples": [
                    {
                        "en": "It was her second break in the set.",
                        "vi": "Đó là lần nghỉ thứ hai của cô trong phim trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of successful shots by one player; the number of points scored in a series of successful shots",
                    "vi": "một loạt các cú sút thành công của một cầu thủ; số điểm ghi được trong một loạt các cú sút thành công"
                },
                "examples": [
                    {
                        "en": "He's put together a magnificent break.",
                        "vi": "Anh ấy đã cùng nhau tạo nên một kỳ nghỉ tuyệt vời."
                    },
                    {
                        "en": "a 147 break (= the highest possible break in snooker)",
                        "vi": "break 147 (= break cao nhất có thể có trong bi da)"
                    },
                    {
                        "en": "The champion began with breaks of 74 and 58.",
                        "vi": "Nhà vô địch bắt đầu với các break ở 74 và 58."
                    }
                ]
            },
            {
                "define": {
                    "en": "the moment in the early hours of the morning when it begins to get light",
                    "vi": "thời điểm vào sáng sớm khi trời bắt đầu sáng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a complete end to any connection with a person, an organization, a way of life, etc.",
                    "vi": "một kết thúc hoàn toàn cho bất kỳ mối liên hệ nào với một người, một tổ chức, một lối sống, v.v."
                },
                "examples": [
                    {
                        "en": "She wanted to make a clean break with the past.",
                        "vi": "Cô muốn đoạn tuyệt với quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a break in a bone in one place",
                    "vi": "gãy xương ở một chỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody a chance; to not judge somebody too severely",
                    "vi": "để cho ai đó một cơ hội; không đánh giá ai đó quá nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Give the lad a break—it's only his second day on the job.",
                        "vi": "Hãy cho chàng trai nghỉ ngơi — đó mới chỉ là ngày thứ hai anh ta làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when somebody wants somebody else to stop doing or saying something that is annoying, or to stop saying something that is not true",
                    "vi": "được sử dụng khi ai đó muốn người khác ngừng làm hoặc nói điều gì đó gây khó chịu hoặc ngừng nói điều gì đó không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run towards something in order to try and escape",
                    "vi": "chạy về phía thứ gì đó để cố gắng trốn thoát"
                },
                "examples": [
                    {
                        "en": "He suddenly leapt up and made a break for the door.",
                        "vi": "Anh đột ngột nhảy lên và phá cửa."
                    },
                    {
                        "en": "They decided to make a break for it (= to try and escape) that night.",
                        "vi": "Họ quyết định nghỉ ngơi cho nó (= cố gắng trốn thoát) vào đêm hôm đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "0e0288a4bfb043d1ab7a07e856b54fad",
        "word": "break point",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbreɪk pɔɪnt/",
            "us": "/ˈbreɪk pɔɪnt/"
        },
        "nearby": [
            {
                "word": "breakout",
                "pos": "adjective"
            },
            {
                "word": "break out in",
                "pos": "phrasal verb"
            },
            {
                "word": "break point",
                "pos": "noun"
            },
            {
                "word": "break through",
                "pos": "phrasal verb"
            },
            {
                "word": "breakthrough",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the point where something, especially a computer program, is interrupted",
                    "vi": "điểm mà một cái gì đó, đặc biệt là một chương trình máy tính, bị gián đoạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a point that the person who is serving must win in order not to lose a game",
                    "vi": "một điểm mà người đang giao bóng phải thắng để không bị thua một trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the time when problems become so great that a person, an organization or a system can no longer deal with them",
                    "vi": "thời điểm mà các vấn đề trở nên lớn đến mức một người, một tổ chức hoặc một hệ thống không thể giải quyết được nữa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d27f3eab1ad34c2998e9c1ec800afa7e",
        "word": "court tennis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɔːt ˈtenɪs/",
            "us": "/ˌkɔːrt ˈtenɪs/"
        },
        "nearby": [
            {
                "word": "courtship",
                "pos": "noun"
            },
            {
                "word": "court shoe",
                "pos": "noun"
            },
            {
                "word": "court tennis",
                "pos": "noun"
            },
            {
                "word": "courtyard",
                "pos": "noun"
            },
            {
                "word": "couscous",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old form of tennis played inside a building with a hard ball",
                    "vi": "một dạng quần vợt cũ được chơi trong một tòa nhà với một quả bóng cứng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "418e243874ba465a89c81f8f36a736f2",
        "word": "deuce",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/djuːs/",
            "us": "/duːs/"
        },
        "nearby": [
            {
                "word": "detumescence",
                "pos": "noun"
            },
            {
                "word": "detumescent",
                "pos": "adjective"
            },
            {
                "word": "deuce",
                "pos": "noun"
            },
            {
                "word": "deuced",
                "pos": "adjective"
            },
            {
                "word": "deuced",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the situation when both players have 40 as a score, after which one player must win two points one after the other in order to win the game",
                    "vi": "tình huống khi cả hai người chơi đều có điểm là 40, sau đó một người chơi phải giành được hai điểm lần lượt để giành chiến thắng trong trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a playing card with two pips on it",
                    "vi": "một thẻ chơi với hai pips trên đó"
                },
                "examples": [
                    {
                        "en": "the deuce of clubs",
                        "vi": "sự phá hoại của các câu lạc bộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in questions to show that you are annoyed",
                    "vi": "được sử dụng trong các câu hỏi để thể hiện rằng bạn đang khó chịu"
                },
                "examples": [
                    {
                        "en": "What the deuce is he doing?",
                        "vi": "Anh ta đang làm gì vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "a3cab0e1fb1c4084954bbacb9195616c",
        "word": "double fault",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʌbl ˈfɔːlt/",
            "us": "/ˌdʌbl ˈfɔːlt/"
        },
        "nearby": [
            {
                "word": "double entendre",
                "pos": "noun"
            },
            {
                "word": "double-entry bookkeeping",
                "pos": "noun"
            },
            {
                "word": "double fault",
                "pos": "noun"
            },
            {
                "word": "double-fault",
                "pos": "verb"
            },
            {
                "word": "double feature",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the loss of a point caused by a player making two bad serves, one after the other",
                    "vi": "mất điểm do một đấu thủ thực hiện hai quả giao bóng không tốt, cái này đến quả kia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6913de7cb3a41c5b392cc1a22ea78ec",
        "word": "double-fault",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʌbl ˈfɔːlt/",
            "us": "/ˌdʌbl ˈfɔːlt/"
        },
        "nearby": [
            {
                "word": "double-entry bookkeeping",
                "pos": "noun"
            },
            {
                "word": "double fault",
                "pos": "noun"
            },
            {
                "word": "double-fault",
                "pos": "verb"
            },
            {
                "word": "double feature",
                "pos": "noun"
            },
            {
                "word": "double-figure",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to lose a point by making two bad serves, one after the other",
                    "vi": "mất một điểm bằng cách thực hiện hai lần giao bóng kém, lần lượt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23af2330b70a46b98326df0b17c6559a",
        "word": "fault",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɔːlt/",
            "us": "/fɔːlt/"
        },
        "nearby": [
            {
                "word": "faujdar",
                "pos": "noun"
            },
            {
                "word": "William Faulkner",
                "pos": ""
            },
            {
                "word": "fault",
                "pos": "noun"
            },
            {
                "word": "fault",
                "pos": "verb"
            },
            {
                "word": "fault-finding",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the responsibility for something wrong that has happened or been done",
                    "vi": "trách nhiệm cho một cái gì đó sai đã xảy ra hoặc đã được thực hiện"
                },
                "examples": [
                    {
                        "en": "Why should I say sorry when it's not my fault?",
                        "vi": "Tại sao tôi phải nói xin lỗi khi đó không phải là lỗi của tôi?"
                    },
                    {
                        "en": "It's nobody's fault.",
                        "vi": "Đó là lỗi của không ai cả."
                    },
                    {
                        "en": "He believes that the product’s poor image is partly the fault of the press.",
                        "vi": "Anh cho rằng hình ảnh kém đẹp của sản phẩm có một phần lỗi của báo chí."
                    },
                    {
                        "en": "fault (that)… It was his fault that we were late.",
                        "vi": "lỗi (điều đó)… Đó là lỗi của anh ấy mà chúng tôi đã đến muộn."
                    },
                    {
                        "en": "fault for doing something It's your own fault for being careless.",
                        "vi": "lỗi khi làm điều gì đó Đó là lỗi của chính bạn vì đã bất cẩn."
                    },
                    {
                        "en": "fault for something He would not admit fault for the collision.",
                        "vi": "lỗi vì một cái gì đó Anh ấy sẽ không thừa nhận lỗi cho vụ va chạm."
                    },
                    {
                        "en": "at fault I think the owners are at fault (= responsible) for not warning us.",
                        "vi": "có lỗi, tôi nghĩ chủ sở hữu có lỗi (= có trách nhiệm) vì đã không cảnh báo chúng tôi."
                    },
                    {
                        "en": "Many people live in poverty through no fault of their own.",
                        "vi": "Nhiều người sống trong cảnh nghèo đói không phải do lỗi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bad or weak aspect of somebody’s character",
                    "vi": "một khía cạnh xấu hoặc yếu trong tính cách của ai đó"
                },
                "examples": [
                    {
                        "en": "He's proud of his children and blind to their faults.",
                        "vi": "Anh ấy tự hào về những đứa con của mình và mù quáng trước lỗi lầm của chúng."
                    },
                    {
                        "en": "I love her for all her faults (= in spite of them).",
                        "vi": "Tôi yêu cô ấy vì tất cả những lỗi lầm của cô ấy (= bất chấp chúng)."
                    },
                    {
                        "en": "I think my worst fault is impatience.",
                        "vi": "Tôi nghĩ lỗi tồi tệ nhất của tôi là thiếu kiên nhẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is wrong or not perfect; something that is wrong with a machine or system that stops it from working correctly",
                    "vi": "một cái gì đó sai hoặc không hoàn hảo; có gì đó không ổn với máy hoặc hệ thống khiến nó không hoạt động bình thường"
                },
                "examples": [
                    {
                        "en": "The book's virtues far outweigh its faults.",
                        "vi": "Những đức tính của cuốn sách vượt xa những lỗi lầm của nó."
                    },
                    {
                        "en": "a mechanical/technical fault",
                        "vi": "một lỗi cơ khí / kỹ thuật"
                    },
                    {
                        "en": "The fire was caused by an electrical fault.",
                        "vi": "Vụ cháy do sự cố điện."
                    },
                    {
                        "en": "The system, for all its faults, is the best available at the moment.",
                        "vi": "Hệ thống, đối với tất cả các lỗi của nó, là hệ thống tốt nhất hiện có."
                    },
                    {
                        "en": "fault in something a major fault in the design",
                        "vi": "lỗi trong một cái gì đó một lỗi lớn trong thiết kế"
                    },
                    {
                        "en": "We're trying to correct the faults in the program.",
                        "vi": "Chúng tôi đang cố gắng sửa các lỗi trong chương trình."
                    },
                    {
                        "en": "fault with something a common fault with this type of machine",
                        "vi": "lỗi với một cái gì đó lỗi phổ biến với loại máy này"
                    },
                    {
                        "en": "without fault The film is not without fault.",
                        "vi": "không có lỗi Bộ phim không phải là không có lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mistake made when serving",
                    "vi": "một sai lầm được thực hiện khi phục vụ"
                },
                "examples": [
                    {
                        "en": "He has served a number of double faults in this set.",
                        "vi": "Anh ấy đã phạm một số lỗi kép trong set này."
                    },
                    {
                        "en": "Even tennis champions sometimes serve double faults.",
                        "vi": "Ngay cả các nhà vô địch quần vợt đôi khi giao bóng lỗi kép."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where there is a break that is longer than usual in the layers of rock in the earth’s crust",
                    "vi": "nơi có sự đứt gãy lâu hơn bình thường của các lớp đá trong vỏ trái đất"
                },
                "examples": [
                    {
                        "en": "the San Andreas fault",
                        "vi": "đứt gãy San Andreas"
                    },
                    {
                        "en": "a fault line",
                        "vi": "một đường lỗi"
                    }
                ]
            },
            {
                "define": {
                    "en": "to look for and discover mistakes in somebody/something; to complain about somebody/something",
                    "vi": "để tìm kiếm và phát hiện ra những sai lầm ở ai đó / điều gì đó; phàn nàn về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "My mother did nothing but find fault with my manners.",
                        "vi": "Mẹ tôi không làm gì khác ngoài việc thấy có lỗi với cách cư xử của tôi."
                    },
                    {
                        "en": "She was always finding fault with his manners.",
                        "vi": "Cô luôn tìm ra lỗi với cách cư xử của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a lot, or even too much, of a particular good quality",
                    "vi": "thường nói rằng ai đó có rất nhiều hoặc thậm chí quá nhiều với một chất lượng tốt cụ thể"
                },
                "examples": [
                    {
                        "en": "She is generous to a fault.",
                        "vi": "Cô ấy rộng lượng cho một lỗi lầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dd3e37164b748168a7c39aefef014e4",
        "word": "follow-through",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɒləʊ θruː/",
            "us": "/ˈfɑːləʊ θruː/"
        },
        "nearby": [
            {
                "word": "follow-the-leader",
                "pos": "noun"
            },
            {
                "word": "follow through",
                "pos": "phrasal verb"
            },
            {
                "word": "follow-through",
                "pos": "noun"
            },
            {
                "word": "follow up",
                "pos": "phrasal verb"
            },
            {
                "word": "follow-up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the final part of the movement of the arm when hitting the ball after the ball has been hit",
                    "vi": "phần cuối cùng của chuyển động của cánh tay khi đánh bóng sau khi bóng đã được đánh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the actions that somebody takes in order to complete a plan",
                    "vi": "những hành động mà ai đó thực hiện để hoàn thành một kế hoạch"
                },
                "examples": [
                    {
                        "en": "The project could fail if there is inadequate follow-through.",
                        "vi": "Dự án có thể thất bại nếu không có quá trình theo dõi đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6a2f8fba5aa943159115615528d0d8a1",
        "word": "foot fault",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊt fɔːlt/",
            "us": "/ˈfʊt fɔːlt/"
        },
        "nearby": [
            {
                "word": "footer",
                "pos": "noun"
            },
            {
                "word": "footfall",
                "pos": "noun"
            },
            {
                "word": "foot fault",
                "pos": "noun"
            },
            {
                "word": "Foot Guards",
                "pos": "noun"
            },
            {
                "word": "foothill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mistake that is made by not keeping behind the line when serving",
                    "vi": "một sai lầm do không giữ phía sau vạch khi giao bóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "196be7faa2f14b45bb9de9ec9ed5c904",
        "word": "forehand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːhænd/",
            "us": "/ˈfɔːrhænd/"
        },
        "nearby": [
            {
                "word": "foreground",
                "pos": "noun"
            },
            {
                "word": "foreground",
                "pos": "verb"
            },
            {
                "word": "forehand",
                "pos": "noun"
            },
            {
                "word": "forehead",
                "pos": "noun"
            },
            {
                "word": "the Foreign, Commonwealth and Development Office",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of hitting a ball in which the inner part of the hand (= the palm) faces the ball as it is hit",
                    "vi": "cách đánh bóng trong đó phần bên trong của bàn tay (= lòng bàn tay) đối diện với quả bóng khi nó được đánh"
                },
                "examples": [
                    {
                        "en": "She has a strong forehand.",
                        "vi": "Cô ấy có một cú thuận tay mạnh mẽ."
                    },
                    {
                        "en": "a forehand volley",
                        "vi": "một cú vô lê thuận tay"
                    },
                    {
                        "en": "He served to his opponent's forehand.",
                        "vi": "Anh ta giao bóng thuận tay của đối thủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "aa6963747348482294d4bffc052c7df0",
        "word": "game point",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡeɪm ˈpɔɪnt/",
            "us": "/ˌɡeɪm ˈpɔɪnt/"
        },
        "nearby": [
            {
                "word": "game plan",
                "pos": "noun"
            },
            {
                "word": "gameplay",
                "pos": "noun"
            },
            {
                "word": "game point",
                "pos": "noun"
            },
            {
                "word": "gamer",
                "pos": "noun"
            },
            {
                "word": "game reserve",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a point that, if won by a player, will win them the game",
                    "vi": "một điểm mà nếu người chơi thắng, họ sẽ thắng trò chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3b69d97258514d6693676aeaad3a2a1e",
        "word": "grand slam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡrænd ˈslæm/",
            "us": "/ˌɡrænd ˈslæm/"
        },
        "nearby": [
            {
                "word": "Grand Prix",
                "pos": "noun"
            },
            {
                "word": "Grand Rapids",
                "pos": ""
            },
            {
                "word": "grand slam",
                "pos": "noun"
            },
            {
                "word": "grandson",
                "pos": "noun"
            },
            {
                "word": "grandstand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of very important competitions in a particular sport in the same year in tennis, golf or rugby; one of the individual competitions that make up a Grand Slam",
                    "vi": "một tập hợp các cuộc thi rất quan trọng trong một môn thể thao cụ thể trong cùng một năm như quần vợt, gôn hoặc bóng bầu dục; một trong những cuộc thi cá nhân tạo nên một Grand Slam"
                },
                "examples": [
                    {
                        "en": "The tennis Grand Slam consists of the four most important tournaments on the international circuit.",
                        "vi": "Grand Slam quần vợt bao gồm bốn giải đấu quan trọng nhất trên đường đua quốc tế."
                    },
                    {
                        "en": "a Grand Slam tournament/cup/title",
                        "vi": "một giải đấu / cúp / danh hiệu Grand Slam"
                    }
                ]
            },
            {
                "define": {
                    "en": "the winning of every part of a sports contest or all the main contests in a year for a particular sport",
                    "vi": "chiến thắng của tất cả các phần của một cuộc thi thể thao hoặc tất cả các cuộc thi chính trong một năm cho một môn thể thao cụ thể"
                },
                "examples": [
                    {
                        "en": "Will France win the grand slam this year (= in rugby)?",
                        "vi": "Liệu Pháp có giành được Grand Slam năm nay (= trong bóng bầu dục)?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a home run that is worth four points",
                    "vi": "một trận chạy trên sân nhà đáng giá bốn điểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the winning of all the tricks in a single game",
                    "vi": "chiến thắng của tất cả các thủ thuật trong một trò chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a112819fe1984d8589d681c0170db3f1",
        "word": "groundstroke",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡraʊndstrəʊk/",
            "us": "/ˈɡraʊndstrəʊk/"
        },
        "nearby": [
            {
                "word": "ground squirrel",
                "pos": "noun"
            },
            {
                "word": "ground staff",
                "pos": "noun"
            },
            {
                "word": "groundstroke",
                "pos": "noun"
            },
            {
                "word": "groundswell",
                "pos": "noun"
            },
            {
                "word": "groundwater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hit that is made after the ball has bounced",
                    "vi": "một cú đánh được thực hiện sau khi bóng bật ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a8abe9fce63647baa7835ebb58fbedcd",
        "word": "half-volley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːf vɒli/",
            "us": "/ˈhæf vɑːli/"
        },
        "nearby": [
            {
                "word": "halftone",
                "pos": "noun"
            },
            {
                "word": "half-truth",
                "pos": "noun"
            },
            {
                "word": "half-volley",
                "pos": "noun"
            },
            {
                "word": "halfway",
                "pos": "adjective"
            },
            {
                "word": "halfway",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shot or kick immediately after the ball has bounced",
                    "vi": "một cú sút hoặc một cú đá ngay sau khi bóng bật ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3a0bfc3985384658afc44327033254f0",
        "word": "lawn tennis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlɔːn ˈtenɪs/",
            "us": "/ˌlɔːn ˈtenɪs/"
        },
        "nearby": [
            {
                "word": "lawnmower",
                "pos": "noun"
            },
            {
                "word": "lawn sign",
                "pos": "noun"
            },
            {
                "word": "lawn tennis",
                "pos": "noun"
            },
            {
                "word": "D H Lawrence",
                "pos": ""
            },
            {
                "word": "Stephen Lawrence",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the usual form of tennis, played with a soft ball on an open court (originally a grass court)",
                    "vi": "hình thức quần vợt thông thường, chơi với bóng mềm trên sân mở (ban đầu là sân cỏ)"
                },
                "examples": [
                    {
                        "en": "the All England Lawn Tennis Club in Wimbledon",
                        "vi": "Câu lạc bộ quần vợt sân cỏ toàn nước Anh ở Wimbledon"
                    }
                ]
            }
        ]
    },
    {
        "id": "28ef5cb253364f8fa7964cde15305b6e",
        "word": "linesman",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪnzmən/",
            "us": "/ˈlaɪnzmən/"
        },
        "nearby": [
            {
                "word": "liner",
                "pos": "noun"
            },
            {
                "word": "liner note",
                "pos": "noun"
            },
            {
                "word": "linesman",
                "pos": "noun"
            },
            {
                "word": "line up",
                "pos": "phrasal verb"
            },
            {
                "word": "line-up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official who helps the referee in some games that are played on a field or court, especially in deciding whether or where a ball crosses one of the lines. Linesmen are now officially called referee’s assistants in football (soccer).",
                    "vi": "một quan chức giúp trọng tài trong một số trò chơi diễn ra trên sân hoặc trên sân, đặc biệt là trong việc quyết định xem bóng có vượt qua một trong các đường hay không. Những người phụ trách trọng tài chính hiện nay được gọi là trợ lý trọng tài trong môn bóng đá (bóng đá)."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose job is to repair phone or electricity power lines",
                    "vi": "một người có công việc sửa chữa điện thoại hoặc đường dây điện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6ed89bab638c4e49b2e5da76a4f4b953",
        "word": "love",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lʌv/",
            "us": "/lʌv/"
        },
        "nearby": [
            {
                "word": "lovable",
                "pos": "adjective"
            },
            {
                "word": "lovage",
                "pos": "noun"
            },
            {
                "word": "love",
                "pos": "noun"
            },
            {
                "word": "love",
                "pos": "verb"
            },
            {
                "word": "love affair",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very strong feeling of liking and caring for somebody/something, especially a member of your family or a friend",
                    "vi": "một cảm giác rất mạnh mẽ khi thích và quan tâm đến ai đó / điều gì đó, đặc biệt là một thành viên trong gia đình hoặc một người bạn của bạn"
                },
                "examples": [
                    {
                        "en": "She has earned the love and respect of many people.",
                        "vi": "Cô ấy đã giành được tình cảm và sự tôn trọng của nhiều người."
                    },
                    {
                        "en": "love for somebody/something a mother’s unconditional love for her children",
                        "vi": "tình yêu dành cho ai đó / điều gì đó là tình yêu vô điều kiện của một người mẹ dành cho những đứa con của mình"
                    },
                    {
                        "en": "love of somebody/something love of your country",
                        "vi": "tình yêu của ai đó / một cái gì đó tình yêu đất nước của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong feeling of romantic attraction for somebody",
                    "vi": "một cảm giác hấp dẫn lãng mạn mạnh mẽ đối với ai đó"
                },
                "examples": [
                    {
                        "en": "I'm sure you will find true love.",
                        "vi": "Tôi chắc rằng bạn sẽ tìm thấy tình yêu đích thực."
                    },
                    {
                        "en": "in love We're in love!",
                        "vi": "đang yêu Chúng ta đang yêu nhau!"
                    },
                    {
                        "en": "They're madly in love.",
                        "vi": "Họ yêu nhau điên cuồng."
                    },
                    {
                        "en": "She has been in and out of love many times.",
                        "vi": "Cô ấy đã ra vào yêu nhiều lần."
                    },
                    {
                        "en": "in love with somebody She was in love with him.",
                        "vi": "trong tình yêu với ai đó Cô ấy đã yêu anh ta."
                    },
                    {
                        "en": "They fell in love with each other.",
                        "vi": "Họ đã yêu nhau."
                    },
                    {
                        "en": "There wasn't anyone else in his life; he simply fell out of love with her.",
                        "vi": "Không có ai khác trong cuộc sống của anh ấy; đơn giản là anh ấy đã hết yêu cô ấy."
                    },
                    {
                        "en": "love for somebody They finally expressed their love for each other.",
                        "vi": "tình yêu dành cho ai đó Cuối cùng họ cũng bày tỏ tình yêu với nhau."
                    },
                    {
                        "en": "It was love at first sight (= they were attracted to each other the first time they met).",
                        "vi": "Đó là tình yêu sét đánh (= họ đã bị thu hút bởi nhau ngay lần đầu gặp mặt)."
                    },
                    {
                        "en": "It is a story of unrequited love (= love that is not returned).",
                        "vi": "Đó là một câu chuyện về tình yêu đơn phương (= tình yêu một đi không trở lại)."
                    },
                    {
                        "en": "romantic/undying/passionate love",
                        "vi": "tình yêu lãng mạn / bất diệt / đam mê"
                    },
                    {
                        "en": "a love song/story",
                        "vi": "một bài hát / câu chuyện tình yêu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the strong feeling of pleasure that something gives you",
                    "vi": "cảm giác mạnh mẽ của niềm vui mà một cái gì đó mang lại cho bạn"
                },
                "examples": [
                    {
                        "en": "love of something They shared a love of learning.",
                        "vi": "yêu thích điều gì đó Họ có chung niềm yêu thích học hỏi."
                    },
                    {
                        "en": "love for something her love for her garden",
                        "vi": "yêu thứ gì đó cô ấy yêu thích khu vườn của cô ấy"
                    },
                    {
                        "en": "in love with something He's in love with his work.",
                        "vi": "yêu cái gì đó Anh ấy yêu công việc của mình."
                    },
                    {
                        "en": "I fell in love with the house.",
                        "vi": "Tôi đã yêu ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, a thing or an activity that you like very much",
                    "vi": "một người, một sự vật hoặc một hoạt động mà bạn rất thích"
                },
                "examples": [
                    {
                        "en": "Take care, my love.",
                        "vi": "Bảo trọng, tình yêu của tôi."
                    },
                    {
                        "en": "He was the love of my life (= the person I loved most).",
                        "vi": "Anh ấy là tình yêu của đời tôi (= người tôi yêu nhất)."
                    },
                    {
                        "en": "I like most sports but tennis is my first love.",
                        "vi": "Tôi thích hầu hết các môn thể thao nhưng quần vợt là mối tình đầu của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word used as a friendly way of addressing somebody",
                    "vi": "một từ được sử dụng như một cách thân thiện để xưng hô với ai đó"
                },
                "examples": [
                    {
                        "en": "Can I help you, love?",
                        "vi": "Tôi có thể giúp gì cho bạn, tình yêu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a score of zero (points or games)",
                    "vi": "điểm 0 (điểm hoặc trò chơi)"
                },
                "examples": [
                    {
                        "en": "40–love!",
                        "vi": "40 – tình yêu!"
                    },
                    {
                        "en": "She won the first set six-love/six games to love.",
                        "vi": "Cô ấy đã thắng trong set sáu tình yêu / sáu trò chơi đầu tiên để yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "in some situations any type of behaviour is acceptable to get what you want",
                    "vi": "trong một số tình huống, bất kỳ loại hành vi nào cũng có thể chấp nhận được để đạt được điều bạn muốn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "love that somebody, especially a child, shows towards somebody else in order to get something",
                    "vi": "yêu ai đó, đặc biệt là một đứa trẻ, thể hiện đối với người khác để có được một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "without receiving payment or any other reward",
                    "vi": "mà không nhận được thanh toán hoặc bất kỳ phần thưởng nào khác"
                },
                "examples": [
                    {
                        "en": "They're all volunteers, working for the love of it.",
                        "vi": "Tất cả họ đều là những người tình nguyện, làm việc vì tình yêu của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are expressing anger and the fact that you are impatient",
                    "vi": "được sử dụng khi bạn đang thể hiện sự tức giận và thực tế là bạn đang thiếu kiên nhẫn"
                },
                "examples": [
                    {
                        "en": "For the love of God, tell me what he said!",
                        "vi": "Vì tình yêu của Đức Chúa Trời, hãy nói cho tôi biết những gì Ngài đã nói!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to send good wishes to somebody",
                    "vi": "được sử dụng để gửi những lời chúc tốt đẹp đến ai đó"
                },
                "examples": [
                    {
                        "en": "Give my love to Mary when you see her.",
                        "vi": "Hãy dành tình yêu của tôi cho Mary khi bạn nhìn thấy cô ấy."
                    },
                    {
                        "en": "Bob sends his love.",
                        "vi": "Bob gửi tình yêu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "loving somebody very much",
                    "vi": "yêu ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "He's fallen head over heels in love with his boss.",
                        "vi": "Anh ta say đắm sếp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hard task that you do because you want to, not because it is necessary",
                    "vi": "một nhiệm vụ khó khăn mà bạn làm vì bạn muốn, không phải vì nó là cần thiết"
                },
                "examples": [
                    {
                        "en": "Writing the book was a labour of love.",
                        "vi": "Viết cuốn sách là một lao động của tình yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used at the end of a letter to a friend or to somebody you love, followed by your name",
                    "vi": "được dùng ở cuối lá thư gửi cho bạn bè hoặc người nào đó mà bạn yêu quý, theo sau là tên của bạn"
                },
                "examples": [
                    {
                        "en": "Lots of love, Jenny",
                        "vi": "Yêu nhiều lắm, Jenny"
                    },
                    {
                        "en": "See you soon. Love, Steve.",
                        "vi": "Hẹn sớm gặp lại. Tình yêu, Steve."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you love somebody, you cannot see their faults",
                    "vi": "khi bạn yêu ai đó, bạn không thể nhìn thấy lỗi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have sex",
                    "vi": "quan hệ tình dục"
                },
                "examples": [
                    {
                        "en": "It was the first time they had made love.",
                        "vi": "Đó là lần đầu tiên họ làm tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you say you cannot do something for love nor money, you mean it is completely impossible to do it",
                    "vi": "nếu bạn nói bạn không thể làm điều gì đó vì tình yêu cũng như tiền bạc, bạn có nghĩa là bạn hoàn toàn không thể làm được"
                },
                "examples": [
                    {
                        "en": "We couldn't find a taxi for love nor money.",
                        "vi": "Chúng tôi không thể tìm thấy một chiếc taxi vì tình yêu cũng như tiền bạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "they do not like each other",
                    "vi": "họ không thích nhau"
                },
                "examples": [
                    {
                        "en": "There's no love lost between her and her in-laws.",
                        "vi": "Không có tình yêu nào mất đi giữa cô ấy và những người chồng của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "416a75b488e44c07b8a61e45bd5a4b13",
        "word": "mixed doubles",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪkst ˈdʌblz/",
            "us": "/ˌmɪkst ˈdʌblz/"
        },
        "nearby": [
            {
                "word": "mixed bag",
                "pos": "noun"
            },
            {
                "word": "mixed blessing",
                "pos": "noun"
            },
            {
                "word": "mixed doubles",
                "pos": "noun"
            },
            {
                "word": "mixed economy",
                "pos": "noun"
            },
            {
                "word": "mixed farming",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which a man and a woman play together against another man and woman",
                    "vi": "một trò chơi trong đó một người nam và một người nữ cùng chơi với một người nam và người nữ khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f3a6c551ab904348a53e31e1c56ca13c",
        "word": "passing shot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːsɪŋ ʃɒt/",
            "us": "/ˈpæsɪŋ ʃɑːt/"
        },
        "nearby": [
            {
                "word": "passing",
                "pos": "adjective"
            },
            {
                "word": "passing lane",
                "pos": "noun"
            },
            {
                "word": "passing shot",
                "pos": "noun"
            },
            {
                "word": "pass into",
                "pos": "phrasal verb"
            },
            {
                "word": "passion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shot which goes past your opponent, and which they cannot reach",
                    "vi": "một cú sút đi qua đối thủ của bạn và họ không thể đạt được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d5eddf9e661418bbb4c77aa792e17e1",
        "word": "racket abuse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrækɪt əbjuːs/",
            "us": "/ˈrækɪt əbjuːs/"
        },
        "nearby": [
            {
                "word": "rack-and-pinion",
                "pos": "adjective"
            },
            {
                "word": "racket",
                "pos": "noun"
            },
            {
                "word": "racket abuse",
                "pos": "noun"
            },
            {
                "word": "racketeer",
                "pos": "noun"
            },
            {
                "word": "racketeering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the offence in tennis of throwing a racket or deliberately breaking it, considered to be unacceptable behaviour",
                    "vi": "tội ném vợt hoặc cố ý làm gãy vợt trong môn quần vợt, được coi là hành vi không thể chấp nhận được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8365088b55c045ca8d64559862d097c8",
        "word": "rally",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræli/",
            "us": "/ˈræli/"
        },
        "nearby": [
            {
                "word": "Raleigh International",
                "pos": ""
            },
            {
                "word": "rallentando",
                "pos": "adverb"
            },
            {
                "word": "rally",
                "pos": "noun"
            },
            {
                "word": "rally",
                "pos": "verb"
            },
            {
                "word": "rally around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large public meeting, especially one held to support a particular idea or political party",
                    "vi": "một cuộc họp công khai lớn, đặc biệt là một cuộc họp được tổ chức để ủng hộ một ý tưởng hoặc đảng phái chính trị cụ thể"
                },
                "examples": [
                    {
                        "en": "to attend/hold a rally",
                        "vi": "tham dự / tổ chức một cuộc biểu tình"
                    },
                    {
                        "en": "a peace/protest rally",
                        "vi": "một cuộc biểu tình hòa bình / phản đối"
                    },
                    {
                        "en": "a mass rally in support of the strike",
                        "vi": "một cuộc biểu tình quần chúng ủng hộ cuộc đình công"
                    }
                ]
            },
            {
                "define": {
                    "en": "a race for cars, motorcycles, etc. over public roads",
                    "vi": "một cuộc đua ô tô, mô tô, v.v. trên đường công cộng"
                },
                "examples": [
                    {
                        "en": "the Monte Carlo rally",
                        "vi": "cuộc biểu tình Monte Carlo"
                    },
                    {
                        "en": "rally driving",
                        "vi": "lái xe tập hợp"
                    },
                    {
                        "en": "He will join the team at the rally next week.",
                        "vi": "Anh ấy sẽ tham gia cùng đội tại cuộc tập trung vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of hits of the ball before a point is scored",
                    "vi": "một loạt các cú đánh bóng trước khi một điểm được ghi"
                },
                "examples": [
                    {
                        "en": "That was a great rally!",
                        "vi": "Đó là một cuộc biểu tình tuyệt vời!"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of returning to a strong position after a period of difficulty or weakness",
                    "vi": "một hành động trở lại vị trí mạnh mẽ sau một thời gian khó khăn hoặc yếu kém"
                },
                "examples": [
                    {
                        "en": "After a furious late rally, they finally scored.",
                        "vi": "Sau một cuộc biểu tình muộn tức giận, cuối cùng họ đã ghi bàn."
                    },
                    {
                        "en": "a rally in shares on the stock market",
                        "vi": "một cuộc biểu tình về cổ phiếu trên thị trường chứng khoán"
                    }
                ]
            }
        ]
    },
    {
        "id": "214eacabd2604242bc8238240d154dde",
        "word": "real tennis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːəl tenɪs/",
            "us": "/ˈriːəl tenɪs/"
        },
        "nearby": [
            {
                "word": "real number",
                "pos": "noun"
            },
            {
                "word": "realpolitik",
                "pos": "noun"
            },
            {
                "word": "real tennis",
                "pos": "noun"
            },
            {
                "word": "real time",
                "pos": "noun"
            },
            {
                "word": "realtone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old form of tennis played inside a building with a hard ball",
                    "vi": "một dạng quần vợt cũ được chơi trong một tòa nhà với một quả bóng cứng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4a2141332bc45b0ac15b682d167d8b0",
        "word": "receive",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈsiːv/",
            "us": "/rɪˈsiːv/"
        },
        "nearby": [
            {
                "word": "receivable",
                "pos": "adjective"
            },
            {
                "word": "receivables",
                "pos": "noun"
            },
            {
                "word": "receive",
                "pos": "verb"
            },
            {
                "word": "received",
                "pos": "adjective"
            },
            {
                "word": "received pronunciation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get or accept something that is sent or given to you",
                    "vi": "để nhận hoặc chấp nhận một cái gì đó được gửi hoặc đưa cho bạn"
                },
                "examples": [
                    {
                        "en": "receive something",
                        "vi": "nhận một cái gì đó"
                    },
                    {
                        "en": "I was delighted to receive your letter.",
                        "vi": "Tôi rất vui khi nhận được thư của bạn."
                    },
                    {
                        "en": "She received many messages of support.",
                        "vi": "Cô nhận được nhiều tin nhắn ủng hộ."
                    },
                    {
                        "en": "Police had received information about a planned post office robbery.",
                        "vi": "Cảnh sát đã nhận được thông tin về một vụ cướp bưu điện được lên kế hoạch."
                    },
                    {
                        "en": "to receive payment/thanks",
                        "vi": "để nhận thanh toán / cảm ơn"
                    },
                    {
                        "en": "receive something from somebody/something He received an award for bravery from the police.",
                        "vi": "nhận một cái gì đó từ ai đó / cái gì đó Anh ấy đã nhận được giải thưởng cho sự dũng cảm từ cảnh sát."
                    },
                    {
                        "en": "I received a phone call from her a few weeks later.",
                        "vi": "Tôi nhận được một cuộc điện thoại từ cô ấy vài tuần sau đó."
                    },
                    {
                        "en": "I received a lovely email from Tina.",
                        "vi": "Tôi nhận được một email đáng yêu từ Tina."
                    },
                    {
                        "en": "The programme's website received many complaints from listeners.",
                        "vi": "Trang web của chương trình đã nhận được nhiều lời phàn nàn từ thính giả."
                    },
                    {
                        "en": "The service receives no money from the local council.",
                        "vi": "Dịch vụ không nhận được tiền từ hội đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to experience or be given a particular type of treatment or attention",
                    "vi": "trải nghiệm hoặc được cung cấp một loại điều trị hoặc sự chú ý cụ thể"
                },
                "examples": [
                    {
                        "en": "receive something Her work has not received the attention it deserves.",
                        "vi": "nhận được điều gì đó Công việc của cô ấy đã không nhận được sự quan tâm mà nó xứng đáng."
                    },
                    {
                        "en": "She received urgent hospital treatment.",
                        "vi": "Cô được điều trị khẩn cấp tại bệnh viện."
                    },
                    {
                        "en": "All our staff receive training on dealing with customers.",
                        "vi": "Tất cả nhân viên của chúng tôi đều được đào tạo về cách ứng xử với khách hàng."
                    },
                    {
                        "en": "receive something from somebody We have received overwhelming support from the local community.",
                        "vi": "nhận được một cái gì đó từ ai đó Chúng tôi đã nhận được sự hỗ trợ tích cực từ cộng đồng địa phương."
                    },
                    {
                        "en": "We received a warm welcome from our hosts.",
                        "vi": "Chúng tôi đã nhận được sự chào đón nồng nhiệt từ chủ nhà của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form an idea or impression of somebody/something as a result of what you see, experience, etc.",
                    "vi": "để hình thành một ý tưởng hoặc ấn tượng về ai đó / điều gì đó do kết quả của những gì bạn thấy, trải nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "I did not receive the impression that he was afraid.",
                        "vi": "Tôi không nhận được ấn tượng rằng anh ta sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be injured in a particular way",
                    "vi": "bị thương theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "Several of the passengers received severe injuries.",
                        "vi": "Một số hành khách bị thương nặng."
                    },
                    {
                        "en": "She received only minor cuts and bruises.",
                        "vi": "Cô chỉ bị những vết cắt nhỏ và bầm tím."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react to something new, in a particular way",
                    "vi": "để phản ứng với một cái gì đó mới, theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "be received + adv./prep. The play was well received by the critics.",
                        "vi": "được nhận + adv./prep. Vở kịch được giới phê bình đón nhận nồng nhiệt."
                    },
                    {
                        "en": "The speech was warmly received by the audience.",
                        "vi": "Bài phát biểu đã được khán giả đón nhận nồng nhiệt."
                    },
                    {
                        "en": "be received with something The proposals have been received with great enthusiasm.",
                        "vi": "được đón nhận với một cái gì đó Các đề xuất đã được đón nhận một cách nhiệt tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to welcome or entertain a guest, especially formally",
                    "vi": "để chào đón hoặc tiếp đãi một vị khách, đặc biệt là về mặt chính thức"
                },
                "examples": [
                    {
                        "en": "be received (as something) He was received as an honoured guest at the White House.",
                        "vi": "được nhận (như một cái gì đó) Ông đã được tiếp đón với tư cách là một vị khách danh dự tại Nhà Trắng."
                    },
                    {
                        "en": "be received with something We were received with great cordiality.",
                        "vi": "được nhận với một cái gì đó Chúng tôi đã được tiếp nhận với sự thân ái tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially recognize and accept somebody as a member of a group",
                    "vi": "chính thức công nhận và chấp nhận ai đó là thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "Three young people were received into the Church at Easter.",
                        "vi": "Ba người trẻ đã được rước vào Nhà thờ vào Lễ Phục sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change broadcast signals into sounds or pictures on a television, radio, etc.",
                    "vi": "để thay đổi tín hiệu phát sóng thành âm thanh hoặc hình ảnh trên tivi, radio, v.v."
                },
                "examples": [
                    {
                        "en": "to receive programmes via satellite",
                        "vi": "để nhận các chương trình qua vệ tinh"
                    },
                    {
                        "en": "a device for sending and receiving electronic signals",
                        "vi": "một thiết bị để gửi và nhận tín hiệu điện tử"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to hear a radio message that is being sent by somebody",
                    "vi": "để có thể nghe một tin nhắn radio đang được gửi bởi ai đó"
                },
                "examples": [
                    {
                        "en": "I'm receiving you loud and clear.",
                        "vi": "Tôi đang tiếp bạn to và rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to buy or accept goods that you know have been stolen",
                    "vi": "để mua hoặc chấp nhận hàng hóa mà bạn biết đã bị đánh cắp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be the player that the server hits the ball to",
                    "vi": "trở thành người chơi mà máy chủ đánh bóng"
                },
                "examples": [
                    {
                        "en": "She won the toss and chose to receive.",
                        "vi": "Cô ấy đã thắng tung và chọn nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person that an action, etc. is directed at, especially an unpleasant one",
                    "vi": "trở thành người mà một hành động, v.v. hướng đến, đặc biệt là một hành động khó chịu"
                },
                "examples": [
                    {
                        "en": "She found herself on the receiving end of a great deal of criticism.",
                        "vi": "Cô nhận thấy mình đang phải nhận rất nhiều lời chỉ trích."
                    }
                ]
            }
        ]
    },
    {
        "id": "e69856e973cf4b19b6d961c286d97e5b",
        "word": "return",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈtɜːn/",
            "us": "/rɪˈtɜːrn/"
        },
        "nearby": [
            {
                "word": "retry",
                "pos": "verb"
            },
            {
                "word": "retsina",
                "pos": "noun"
            },
            {
                "word": "return",
                "pos": "verb"
            },
            {
                "word": "return",
                "pos": "noun"
            },
            {
                "word": "returnable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come or go back from one place to another",
                    "vi": "đến hoặc quay lại từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "I waited a long time for him to return.",
                        "vi": "Tôi đã đợi anh ấy về rất lâu rồi."
                    },
                    {
                        "en": "returning emigrants/exiles/refugees (= who are coming home after being away)",
                        "vi": "người di cư trở về / người lưu vong / người tị nạn (= người sẽ trở về nhà sau khi đi vắng)"
                    },
                    {
                        "en": "return to… She's returning to Australia tomorrow after six months in Europe.",
                        "vi": "trở lại… Cô ấy sẽ trở lại Úc vào ngày mai sau sáu tháng ở Châu Âu."
                    },
                    {
                        "en": "He had recently returned to this country after living in Spain.",
                        "vi": "Anh ấy gần đây đã trở lại đất nước này sau khi sống ở Tây Ban Nha."
                    },
                    {
                        "en": "I had to return to the store to look for my purse.",
                        "vi": "Tôi phải quay lại cửa hàng để tìm ví của mình."
                    },
                    {
                        "en": "return from… I returned from work to find the house empty.",
                        "vi": "trở về từ… Tôi đi làm về thấy căn nhà trống rỗng."
                    },
                    {
                        "en": "People were returning home for the weekend.",
                        "vi": "Mọi người trở về nhà vào cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring, give, put or send something back to somebody/something",
                    "vi": "mang, cho, đặt hoặc gửi lại một cái gì đó cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "return somebody/something to somebody/something We had to return the hairdryer to the store because it was faulty.",
                        "vi": "trả lại ai đó / cái gì đó cho ai đó / cái gì đó Chúng tôi đã phải trả lại máy sấy tóc cho cửa hàng vì nó bị lỗi."
                    },
                    {
                        "en": "I must return some books to the library.",
                        "vi": "Tôi phải trả lại một số sách cho thư viện."
                    },
                    {
                        "en": "The court ordered him to return the children to their mother.",
                        "vi": "Tòa án yêu cầu anh ta trả lại những đứa trẻ cho mẹ của chúng."
                    },
                    {
                        "en": "Completed questionnaires should be returned to this address.",
                        "vi": "Các bảng câu hỏi đã hoàn thành sẽ được gửi lại địa chỉ này."
                    },
                    {
                        "en": "return something He refused to return our money.",
                        "vi": "trả lại một cái gì đó Anh ta từ chối trả lại tiền của chúng tôi."
                    },
                    {
                        "en": "return somebody/something + adj. I returned the letter unopened.",
                        "vi": "trả lại ai đó / cái gì đó + adj. Tôi trả lại bức thư chưa mở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come back again",
                    "vi": "quay lại lần nữa"
                },
                "examples": [
                    {
                        "en": "The following day the pain returned.",
                        "vi": "Ngày hôm sau cơn đau trở lại."
                    },
                    {
                        "en": "There's a chance the cancer will return.",
                        "vi": "Có khả năng ung thư sẽ quay trở lại."
                    },
                    {
                        "en": "Confidence returned and prices started to rise.",
                        "vi": "Sự tự tin trở lại và giá bắt đầu tăng."
                    },
                    {
                        "en": "The bad weather has returned with a vengeance.",
                        "vi": "Thời tiết xấu đã trở lại với một sự báo thù."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start discussing a subject you were discussing earlier, or doing an activity you were doing earlier",
                    "vi": "để bắt đầu thảo luận về một chủ đề bạn đã thảo luận trước đó hoặc thực hiện một hoạt động bạn đã làm trước đó"
                },
                "examples": [
                    {
                        "en": "He returns to this topic later in the report.",
                        "vi": "Anh ấy trở lại chủ đề này sau trong báo cáo."
                    },
                    {
                        "en": "She looked up briefly then returned to her sewing.",
                        "vi": "Cô nhìn lên một lúc sau đó quay trở lại công việc may vá của mình."
                    },
                    {
                        "en": "The doctor may allow her to return to work next week.",
                        "vi": "Bác sĩ có thể cho phép cô ấy trở lại làm việc vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go back to a previous state",
                    "vi": "để quay lại trạng thái trước đó"
                },
                "examples": [
                    {
                        "en": "Train services have returned to normal after the strike.",
                        "vi": "Dịch vụ tàu hỏa đã trở lại bình thường sau cuộc đình công."
                    },
                    {
                        "en": "The land has returned to its natural state.",
                        "vi": "Đất đã trở lại trạng thái tự nhiên."
                    },
                    {
                        "en": "Many find returning to civilian life difficult.",
                        "vi": "Nhiều người cảm thấy khó khăn khi trở lại cuộc sống thường dân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do or give something to somebody because they have done or given the same to you first; to have the same feeling about somebody that they have about you",
                    "vi": "để làm hoặc đưa một cái gì đó cho ai đó bởi vì họ đã làm hoặc đưa điều tương tự cho bạn trước tiên; có cùng cảm giác về ai đó mà họ có về bạn"
                },
                "examples": [
                    {
                        "en": "to return a smile/gaze/greeting",
                        "vi": "để đáp lại một nụ cười / ánh mắt / lời chào"
                    },
                    {
                        "en": "If you assist people when they ask for help, it is more likely they will return the favour.",
                        "vi": "Nếu bạn giúp đỡ mọi người khi họ yêu cầu giúp đỡ, thì nhiều khả năng họ sẽ trả ơn."
                    },
                    {
                        "en": "She phoned him several times but he was too busy to return her call.",
                        "vi": "Cô đã gọi điện cho anh nhiều lần nhưng anh quá bận nên không thể gọi lại cho cô."
                    },
                    {
                        "en": "It's time we returned their invitation (= invite them to something as they invited us first).",
                        "vi": "Đã đến lúc chúng tôi gửi lại lời mời của họ (= mời họ tham gia một cái gì đó như họ đã mời chúng tôi trước)."
                    },
                    {
                        "en": "‘You were both wonderful!’ ‘So were you!’ we said, returning the compliment.",
                        "vi": "Cả hai bạn đều tuyệt vời!' 'Bạn cũng vậy!' chúng tôi nói, đáp lại lời khen."
                    },
                    {
                        "en": "to return a kiss (= to kiss somebody with the same enthusiasm with which they kiss you)",
                        "vi": "để đáp lại một nụ hôn (= hôn ai đó với cùng sự nhiệt tình mà họ hôn bạn)"
                    },
                    {
                        "en": "He did not return her love.",
                        "vi": "Anh không đáp lại tình yêu của cô."
                    },
                    {
                        "en": "to return fire (= to shoot at somebody who is shooting at you)",
                        "vi": "để bắn trả (= bắn vào ai đó đang bắn vào bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit the ball back to your opponent during a game",
                    "vi": "đánh bóng trở lại đối thủ của bạn trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "to return a service/shot",
                        "vi": "để trả lại một dịch vụ / cảnh quay"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a decision about something in court",
                    "vi": "đưa ra quyết định về điều gì đó trước tòa"
                },
                "examples": [
                    {
                        "en": "The jury returned a verdict of not guilty.",
                        "vi": "Bồi thẩm đoàn tuyên bố không có tội."
                    },
                    {
                        "en": "The inquest returned a verdict of accidental death.",
                        "vi": "Cuộc điều tra trả lại một phán quyết về cái chết do tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to elect somebody to a political position",
                    "vi": "bầu ai đó vào một vị trí chính trị"
                },
                "examples": [
                    {
                        "en": "be returned (as something) She was returned as MP for Edgbaston in the last election.",
                        "vi": "được trả lại (như một cái gì đó) Cô ấy đã được trở lại làm nghị sĩ cho Edgbaston trong cuộc bầu cử cuối cùng."
                    },
                    {
                        "en": "be returned (to something) He was returned to Parliament with an increased majority.",
                        "vi": "được trả lại (cho một cái gì đó) Ông đã được trở lại Nghị viện với đa số gia tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or produce a particular amount of money as a profit or loss",
                    "vi": "để cung cấp hoặc sản xuất một số tiền cụ thể như một khoản lãi hoặc lỗ"
                },
                "examples": [
                    {
                        "en": "to return a high rate of interest",
                        "vi": "để trả lại một tỷ lệ lãi suất cao"
                    },
                    {
                        "en": "Last year the company returned a loss of £157 million.",
                        "vi": "Năm ngoái, công ty đã trả lại khoản lỗ 157 triệu bảng Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee11e597877f4b00b948e76d2c976894",
        "word": "royal tennis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrɔɪəl ˈtenɪs/",
            "us": "/ˌrɔɪəl ˈtenɪs/"
        },
        "nearby": [
            {
                "word": "the Royal Society for the Protection of Birds",
                "pos": ""
            },
            {
                "word": "the Royal Society of Arts",
                "pos": ""
            },
            {
                "word": "royal tennis",
                "pos": "noun"
            },
            {
                "word": "the Royal Tournament",
                "pos": ""
            },
            {
                "word": "royalty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old form of tennis played inside a building with a hard ball",
                    "vi": "một dạng quần vợt cũ được chơi trong một tòa nhà với một quả bóng cứng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f8d055408ec42d6b0fe037b61be7bed",
        "word": "seed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/siːd/",
            "us": "/siːd/"
        },
        "nearby": [
            {
                "word": "see",
                "pos": "noun"
            },
            {
                "word": "see about",
                "pos": "phrasal verb"
            },
            {
                "word": "seed",
                "pos": "noun"
            },
            {
                "word": "seed",
                "pos": "verb"
            },
            {
                "word": "seedbed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the small hard part produced by a plant, from which a new plant can grow",
                    "vi": "phần cứng nhỏ do cây tạo ra, từ đó cây mới có thể phát triển"
                },
                "examples": [
                    {
                        "en": "a packet of wild flower seeds",
                        "vi": "một gói hạt giống hoa dại"
                    },
                    {
                        "en": "sesame seeds",
                        "vi": "Hạt mè"
                    },
                    {
                        "en": "Sow the seeds outdoors in spring.",
                        "vi": "Gieo hạt ngoài trời vào mùa xuân."
                    },
                    {
                        "en": "Plant the seeds 10cm apart.",
                        "vi": "Trồng các hạt cách nhau 10cm."
                    },
                    {
                        "en": "These vegetables can be grown from seed.",
                        "vi": "Những loại rau này có thể được trồng từ hạt giống."
                    },
                    {
                        "en": "seed potatoes (= used for planting)",
                        "vi": "khoai tây hạt (= dùng để trồng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the small hard seed that is found in some types of fruit",
                    "vi": "hạt cứng nhỏ được tìm thấy trong một số loại trái cây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the beginning of a feeling or development that continues to grow",
                    "vi": "sự khởi đầu của một cảm giác hoặc sự phát triển tiếp tục phát triển"
                },
                "examples": [
                    {
                        "en": "the seeds of rebellion",
                        "vi": "mầm mống của sự nổi loạn"
                    },
                    {
                        "en": "This planted the seeds of doubt in my mind.",
                        "vi": "Điều này đã gieo mầm nghi ngờ trong tâm trí tôi."
                    },
                    {
                        "en": "He argued that capitalism contained the seeds of its own destruction.",
                        "vi": "Ông cho rằng chủ nghĩa tư bản chứa đựng mầm mống của sự hủy diệt của chính nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the best players in a competition. The seeds are given a position in a list to try and make sure that they do not play each other in the early parts of the competition.",
                    "vi": "một trong những người chơi giỏi nhất trong một cuộc thi. Các hạt giống được đưa ra một vị trí trong danh sách để thử và đảm bảo rằng chúng không chơi lẫn nhau trong những phần đầu của cuộc thi."
                },
                "examples": [
                    {
                        "en": "The top seed won comfortably.",
                        "vi": "Hạt giống hàng đầu chiến thắng một cách thoải mái."
                    },
                    {
                        "en": "the number one seed",
                        "vi": "hạt giống số một"
                    },
                    {
                        "en": "She was the top seed at the US Open this year.",
                        "vi": "Cô là hạt giống hàng đầu tại US Open năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "semen",
                    "vi": "tinh dịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the people who are the children, grandchildren, etc. of one man",
                    "vi": "tất cả những người là con, cháu, v.v. của một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce flowers and seeds as well as leaves",
                    "vi": "để tạo ra hoa và hạt cũng như lá"
                },
                "examples": [
                    {
                        "en": "The lettuces had all run to seed.",
                        "vi": "Tất cả các lettuces đã chạy để gieo hạt."
                    },
                    {
                        "en": "Cutting weeds before they go to seed will greatly reduce future weed problems.",
                        "vi": "Cắt cỏ dại trước khi gieo hạt sẽ làm giảm đáng kể các vấn đề về cỏ dại trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become much less attractive or good because of lack of attention",
                    "vi": "trở nên kém hấp dẫn hoặc kém hấp dẫn hơn nhiều vì thiếu sự chú ý"
                },
                "examples": [
                    {
                        "en": "After his divorce, he let himself go to seed.",
                        "vi": "Sau khi ly hôn, anh ta thả mình đi gieo hạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start the process that leads to a particular situation or result",
                    "vi": "để bắt đầu quá trình dẫn đến một tình huống hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "In this way he sowed the seeds of his own success.",
                        "vi": "Bằng cách này, anh đã gieo những hạt giống thành công của chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e5bb0036bc5423bb85ee223f0eb9d4f",
        "word": "seed",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/siːd/",
            "us": "/siːd/"
        },
        "nearby": [
            {
                "word": "see about",
                "pos": "phrasal verb"
            },
            {
                "word": "seed",
                "pos": "noun"
            },
            {
                "word": "seed",
                "pos": "verb"
            },
            {
                "word": "seedbed",
                "pos": "noun"
            },
            {
                "word": "seed cake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce seeds",
                    "vi": "để sản xuất hạt giống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce other plants using its own seeds",
                    "vi": "để sản xuất các cây khác bằng cách sử dụng hạt giống của chính nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to plant seeds in an area of ground",
                    "vi": "gieo hạt trên một khu đất"
                },
                "examples": [
                    {
                        "en": "be seeded (with something) The site has been seeded with prairie grasses and wildflowers.",
                        "vi": "được gieo hạt (với một cái gì đó) Địa điểm đã được gieo hạt bằng cỏ thảo nguyên và hoa dại."
                    },
                    {
                        "en": "a newly seeded lawn",
                        "vi": "một bãi cỏ mới được gieo hạt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody a seed in a competition",
                    "vi": "để biến ai đó trở thành hạt giống trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "be seeded He has been seeded 14th at Wimbledon next week.",
                        "vi": "được xếp hạt giống Anh ấy đã được xếp hạt giống thứ 14 tại Wimbledon vào tuần tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c19271738b94eb2baa859b3aa8d911e",
        "word": "seeded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːdɪd/",
            "us": "/ˈsiːdɪd/"
        },
        "nearby": [
            {
                "word": "seed coat",
                "pos": "noun"
            },
            {
                "word": "seed corn",
                "pos": "noun"
            },
            {
                "word": "seeded",
                "pos": "adjective"
            },
            {
                "word": "seediness",
                "pos": "noun"
            },
            {
                "word": "seedless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "given a number showing that they are one of the best players in a particular competition",
                    "vi": "đưa ra một con số cho thấy rằng họ là một trong những người chơi giỏi nhất trong một cuộc thi cụ thể"
                },
                "examples": [
                    {
                        "en": "a seeded player",
                        "vi": "một cầu thủ hạt giống"
                    }
                ]
            },
            {
                "define": {
                    "en": "with the seeds removed",
                    "vi": "với những hạt giống đã được loại bỏ"
                },
                "examples": [
                    {
                        "en": "seeded tomatoes",
                        "vi": "cà chua có hạt"
                    }
                ]
            }
        ]
    },
    {
        "id": "54022c2076ef4e2983be81a883f470cf",
        "word": "serve",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/sɜːv/",
            "us": "/sɜːrv/"
        },
        "nearby": [
            {
                "word": "serum",
                "pos": "noun"
            },
            {
                "word": "servant",
                "pos": "noun"
            },
            {
                "word": "serve",
                "pos": "verb"
            },
            {
                "word": "serve",
                "pos": "noun"
            },
            {
                "word": "serve out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody food or drink, for example at a restaurant or during a meal",
                    "vi": "để cho ai đó đồ ăn hoặc thức uống, ví dụ như tại nhà hàng hoặc trong một bữa ăn"
                },
                "examples": [
                    {
                        "en": "serve (something) Breakfast is served between 7 and 10 a.m.",
                        "vi": "phục vụ (một cái gì đó) Bữa sáng được phục vụ từ 7 đến 10 giờ sáng"
                    },
                    {
                        "en": "When do you stop serving hot food?",
                        "vi": "Khi nào bạn ngừng phục vụ đồ ăn nóng?"
                    },
                    {
                        "en": "Pour the sauce over the pasta and serve immediately.",
                        "vi": "Đổ nước sốt lên mì và phục vụ ngay lập tức."
                    },
                    {
                        "en": "Shall I serve?",
                        "vi": "Tôi sẽ phục vụ chứ?"
                    },
                    {
                        "en": "serve something with something Serve the lamb with new potatoes and green beans.",
                        "vi": "phục vụ một cái gì đó với một cái gì đó Phục vụ thịt cừu với khoai tây mới và đậu xanh."
                    },
                    {
                        "en": "serve something to somebody They served a wonderful meal to more than fifty delegates.",
                        "vi": "phục vụ một cái gì đó cho ai đó Họ đã phục vụ một bữa ăn tuyệt vời cho hơn năm mươi đại biểu."
                    },
                    {
                        "en": "serve somebody with something The delegates were served with a wonderful meal.",
                        "vi": "phục vụ ai đó với một cái gì đó Các đại biểu đã được phục vụ với một bữa ăn tuyệt vời."
                    },
                    {
                        "en": "serve somebody something She served us a delicious lunch.",
                        "vi": "phục vụ ai đó thứ gì đó Cô ấy đã phục vụ chúng tôi một bữa trưa ngon lành."
                    },
                    {
                        "en": "serve something + adj. The quiche can be served hot or cold.",
                        "vi": "phục vụ cái gì đó + adj. Bánh quiche có thể được phục vụ nóng hoặc lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be enough for somebody/something",
                    "vi": "là đủ cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "This dish will serve four hungry people.",
                        "vi": "Món ăn này sẽ phục vụ bốn người đói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help a customer or sell them something in a shop",
                    "vi": "để giúp khách hàng hoặc bán cho họ thứ gì đó trong cửa hàng"
                },
                "examples": [
                    {
                        "en": "Are you being served?",
                        "vi": "Có phải bạn đang được phục vụ?"
                    },
                    {
                        "en": "The bar staff spend more time chatting to friends than serving customers.",
                        "vi": "Nhân viên quán bar dành nhiều thời gian để trò chuyện với bạn bè hơn là phục vụ khách hàng."
                    },
                    {
                        "en": "She was serving behind the counter.",
                        "vi": "Cô ấy đang phục vụ phía sau quầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful to somebody in achieving or satisfying something",
                    "vi": "hữu ích cho ai đó trong việc đạt được hoặc thỏa mãn điều gì đó"
                },
                "examples": [
                    {
                        "en": "These experiments serve no useful purpose.",
                        "vi": "Những thí nghiệm này không có mục đích hữu ích."
                    },
                    {
                        "en": "Most of their economic policies serve the interests of big business.",
                        "vi": "Hầu hết các chính sách kinh tế của họ đều phục vụ lợi ích của các doanh nghiệp lớn."
                    },
                    {
                        "en": "How can we best serve the needs of future generations?",
                        "vi": "Làm thế nào chúng ta có thể phục vụ tốt nhất nhu cầu của thế hệ tương lai?"
                    },
                    {
                        "en": "Art serves an important function in our society.",
                        "vi": "Nghệ thuật phục vụ một chức năng quan trọng trong xã hội của chúng ta."
                    },
                    {
                        "en": "His linguistic ability served him well in his chosen profession.",
                        "vi": "Khả năng ngôn ngữ của anh ấy đã phục vụ anh ấy rất tốt trong nghề nghiệp mà anh ấy đã chọn."
                    },
                    {
                        "en": "This old car has served me very well.",
                        "vi": "Chiếc xe cũ này đã phục vụ tôi rất tốt."
                    },
                    {
                        "en": "The story would be better served by slowing down a little.",
                        "vi": "Câu chuyện sẽ tốt hơn nếu chậm lại một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide an area or a group of people with a product or service",
                    "vi": "để cung cấp cho một khu vực hoặc một nhóm người một sản phẩm hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "serve somebody/something The centre will serve the whole community.",
                        "vi": "phục vụ ai đó / cái gì đó Trung tâm sẽ phục vụ cả cộng đồng."
                    },
                    {
                        "en": "serve somebody/something with something The town is well served with buses and major road links.",
                        "vi": "phục vụ ai đó / cái gì đó với một cái gì đó Thị trấn được phục vụ tốt với xe buýt và các liên kết đường lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work or perform duties for a person, an organization, a country, etc.; to spend a period of time in a particular job",
                    "vi": "để làm việc hoặc thực hiện nhiệm vụ cho một người, một tổ chức, một quốc gia, v.v.; dành một khoảng thời gian cho một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "serve as something He served as a captain in the army.",
                        "vi": "phục vụ như một cái gì đó Ông đã phục vụ như một đội trưởng trong quân đội."
                    },
                    {
                        "en": "She was elected to serve as secretary of the local party.",
                        "vi": "Cô được bầu giữ chức vụ bí thư của đảng bộ địa phương."
                    },
                    {
                        "en": "to serve as president/director/chairman",
                        "vi": "giữ chức vụ chủ tịch / giám đốc / chủ tịch"
                    },
                    {
                        "en": "serve under/with somebody He served under Tony Blair in the 1990s.",
                        "vi": "phục vụ dưới quyền / với ai đó Ông phục vụ dưới quyền của Tony Blair trong những năm 1990."
                    },
                    {
                        "en": "serve + adv./prep. She served in the medical corps.",
                        "vi": "phục vụ + adv./prep. Cô ấy phục vụ trong quân đoàn y tế."
                    },
                    {
                        "en": "His father served with distinction in the First World War.",
                        "vi": "Cha của ông đã phục vụ một cách xuất sắc trong Chiến tranh thế giới thứ nhất."
                    },
                    {
                        "en": "serve somebody/something He proudly served his country during the war.",
                        "vi": "phục vụ ai đó / cái gì đó Anh ấy tự hào đã phục vụ đất nước của mình trong chiến tranh."
                    },
                    {
                        "en": "I wanted to work somewhere where I could serve the community.",
                        "vi": "Tôi muốn làm việc ở một nơi nào đó mà tôi có thể phục vụ cộng đồng."
                    },
                    {
                        "en": "She has already served two terms as mayor.",
                        "vi": "Cô ấy đã phục vụ hai nhiệm kỳ với tư cách là thị trưởng."
                    },
                    {
                        "en": "He served a one-year apprenticeship.",
                        "vi": "Anh ấy đã học việc một năm."
                    },
                    {
                        "en": "He served the family faithfully for many years (= as a servant).",
                        "vi": "Anh ấy đã trung thành phục vụ gia đình trong nhiều năm (= như một người hầu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be suitable for a particular use, especially when nothing else is available",
                    "vi": "để phù hợp cho một mục đích sử dụng cụ thể, đặc biệt là khi không có gì khác"
                },
                "examples": [
                    {
                        "en": "The sofa will serve as a bed for a night or two.",
                        "vi": "Ghế sofa sẽ phục vụ như một chiếc giường trong một hoặc hai đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular effect or result",
                    "vi": "để có một hiệu ứng hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "serve as something The judge said the punishment would serve as a warning to others.",
                        "vi": "phục vụ như một cái gì đó Thẩm phán cho biết hình phạt sẽ coi như một lời cảnh báo cho những người khác."
                    },
                    {
                        "en": "The highly visible ruins serve as a reminder of the building's history.",
                        "vi": "Những tàn tích có thể nhìn thấy rõ ràng là một lời nhắc nhở về lịch sử của tòa nhà."
                    },
                    {
                        "en": "There are several women in the field who have served as role models.",
                        "vi": "Có một số phụ nữ trong lĩnh vực này đã đóng vai trò là hình mẫu."
                    },
                    {
                        "en": "serve to do something The attack was unsuccessful and served only to alert the enemy.",
                        "vi": "phục vụ để làm gì đó Cuộc tấn công không thành công và chỉ phục vụ để cảnh báo đối phương."
                    },
                    {
                        "en": "This only served to complicate the situation further.",
                        "vi": "Điều này chỉ làm phức tạp thêm tình hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend a period of time in prison",
                    "vi": "ở tù một thời gian"
                },
                "examples": [
                    {
                        "en": "prisoners serving life sentences",
                        "vi": "tù nhân chấp hành án chung thân"
                    },
                    {
                        "en": "She is serving two years for theft.",
                        "vi": "Cô ấy đang thụ án hai năm vì tội trộm cắp."
                    },
                    {
                        "en": "He has served time (= been to prison) before.",
                        "vi": "Anh ta đã từng thụ án (= vào tù) trước đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or send somebody an official document, especially one that orders them to appear in court",
                    "vi": "cung cấp cho hoặc gửi cho ai đó một tài liệu chính thức, đặc biệt là một tài liệu ra lệnh cho họ ra hầu tòa"
                },
                "examples": [
                    {
                        "en": "serve something (on somebody) to serve a writ/summons on somebody",
                        "vi": "phục vụ một cái gì đó (cho ai đó) để phục vụ một lệnh / lệnh triệu tập đối với ai đó"
                    },
                    {
                        "en": "serve somebody with something to serve somebody with a writ/summons",
                        "vi": "phục vụ ai đó với một cái gì đó để phục vụ ai đó với một lệnh / lệnh triệu tập"
                    }
                ]
            },
            {
                "define": {
                    "en": "to start playing by throwing the ball into the air and hitting it",
                    "vi": "bắt đầu chơi bằng cách ném quả bóng lên không và đánh nó"
                },
                "examples": [
                    {
                        "en": "Who's serving?",
                        "vi": "Ai đang phục vụ?"
                    },
                    {
                        "en": "serve something She served an ace.",
                        "vi": "phục vụ một cái gì đó Cô ấy đã phục vụ một con át chủ bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform two roles or functions at the same time",
                    "vi": "để thực hiện hai vai trò hoặc chức năng cùng một lúc"
                },
                "examples": [
                    {
                        "en": "This device can pull double duty as a decent laptop and an adequate tablet.",
                        "vi": "Thiết bị này có thể thực hiện nhiệm vụ kép như một máy tính xách tay tốt và một máy tính bảng phù hợp."
                    },
                    {
                        "en": "She deserves credit for serving double duty as a host and performer.",
                        "vi": "Cô ấy xứng đáng được ghi nhận vì đã thực hiện hai nhiệm vụ vừa là người dẫn chương trình vừa là người biểu diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "people will be dealt with, seen, etc. strictly in the order in which they arrive",
                    "vi": "mọi người sẽ bị xử lý, nhìn thấy, v.v. nghiêm ngặt theo thứ tự mà họ đến"
                },
                "examples": [
                    {
                        "en": "Tickets are available on a first come, first served basis.",
                        "vi": "Vé có sẵn trên cơ sở ai đến trước được phục vụ trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if I remember correctly",
                    "vi": "nếu tôi nhớ không lầm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something that has happened to somebody is their own fault and they deserve it",
                    "vi": "thường nói rằng điều gì đó đã xảy ra với ai đó là lỗi của họ và họ xứng đáng với điều đó"
                },
                "examples": [
                    {
                        "en": "Left you, did she? It serves you right for being so selfish.",
                        "vi": "Bỏ lại bạn, phải không? Nó phục vụ bạn đúng vì ích kỷ như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful for a particular purpose or period of time",
                    "vi": "hữu ích cho một mục đích hoặc khoảng thời gian cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to support two different parties, principles, etc. at the same time",
                    "vi": "để hỗ trợ đồng thời hai đảng phái, nguyên tắc khác nhau, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f8103476ac7444d7816b53f6e4ac8b4d",
        "word": "serve",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sɜːv/",
            "us": "/sɜːrv/"
        },
        "nearby": [
            {
                "word": "servant",
                "pos": "noun"
            },
            {
                "word": "serve",
                "pos": "verb"
            },
            {
                "word": "serve",
                "pos": "noun"
            },
            {
                "word": "serve out",
                "pos": "phrasal verb"
            },
            {
                "word": "server",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of serving the ball to your opponent",
                    "vi": "hành động giao bóng cho đối thủ của bạn"
                },
                "examples": [
                    {
                        "en": "He has not lost his serve (= lost a game in which it was his turn to serve) in three matches.",
                        "vi": "Anh ta không bị mất giao bóng (= thua một trò chơi mà đến lượt anh ta giao bóng) trong ba trận đấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "50e1e1ce4f84449892084f2ed64fa6ea",
        "word": "server",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːvə(r)/",
            "us": "/ˈsɜːrvər/"
        },
        "nearby": [
            {
                "word": "serve",
                "pos": "noun"
            },
            {
                "word": "serve out",
                "pos": "phrasal verb"
            },
            {
                "word": "server",
                "pos": "noun"
            },
            {
                "word": "server farm",
                "pos": "noun"
            },
            {
                "word": "servery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer program that controls or supplies information to several computers connected in a network; the main computer on which this program is run",
                    "vi": "một chương trình máy tính điều khiển hoặc cung cấp thông tin cho một số máy tính được kết nối trong mạng; máy tính chính mà chương trình này được chạy trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a player who is serving, for example in tennis",
                    "vi": "một người chơi đang giao bóng, chẳng hạn như trong quần vợt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a kitchen utensil (= tool) used for putting food onto somebody’s plate",
                    "vi": "một dụng cụ nhà bếp (= công cụ) dùng để bày thức ăn lên đĩa của ai đó"
                },
                "examples": [
                    {
                        "en": "salad servers",
                        "vi": "máy chủ salad"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who serves food in a restaurant; a waiter or waitress",
                    "vi": "một người phục vụ đồ ăn trong nhà hàng; một người phục vụ bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who helps a priest during a church service",
                    "vi": "một người giúp đỡ một linh mục trong buổi lễ nhà thờ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3b197cc85c5148e58d8e2eb61c401491",
        "word": "service",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːvɪs/",
            "us": "/ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "servery",
                "pos": "noun"
            },
            {
                "word": "serve up",
                "pos": "phrasal verb"
            },
            {
                "word": "service",
                "pos": "noun"
            },
            {
                "word": "service",
                "pos": "verb"
            },
            {
                "word": "serviceable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that provides something that the public needs, organized by the government or a private company",
                    "vi": "một hệ thống cung cấp thứ gì đó mà công chúng cần, được tổ chức bởi chính phủ hoặc một công ty tư nhân"
                },
                "examples": [
                    {
                        "en": "the ambulance/bus/postal service",
                        "vi": "xe cứu thương / xe buýt / dịch vụ bưu điện"
                    },
                    {
                        "en": "The government aims to improve public services, especially education.",
                        "vi": "Chính phủ đặt mục tiêu cải thiện các dịch vụ công, đặc biệt là giáo dục."
                    },
                    {
                        "en": "Essential services (= the supply of water, gas, electricity) will be maintained.",
                        "vi": "Các dịch vụ thiết yếu (= cung cấp nước, khí đốt, điện) sẽ được duy trì."
                    },
                    {
                        "en": "Councillors have called for better provision of services for young people.",
                        "vi": "Các ủy viên hội đồng đã kêu gọi cung cấp các dịch vụ tốt hơn cho những người trẻ tuổi."
                    },
                    {
                        "en": "The charity provides a vital service to the local community.",
                        "vi": "Tổ chức từ thiện cung cấp một dịch vụ quan trọng cho cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a company that provides something for the public or does something for the government",
                    "vi": "một tổ chức hoặc một công ty cung cấp một cái gì đó cho công chúng hoặc làm một cái gì đó cho chính phủ"
                },
                "examples": [
                    {
                        "en": "the prison service",
                        "vi": "dịch vụ nhà tù"
                    },
                    {
                        "en": "the BBC World Service",
                        "vi": "Dịch vụ Thế giới của BBC"
                    },
                    {
                        "en": "the Foreign Service",
                        "vi": "Bộ Ngoại giao"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business whose work involves doing something for customers but not producing goods; the work that such a business does",
                    "vi": "một doanh nghiệp có công việc liên quan đến việc làm một cái gì đó cho khách hàng nhưng không sản xuất hàng hóa; công việc mà một doanh nghiệp như vậy làm"
                },
                "examples": [
                    {
                        "en": "financial services",
                        "vi": "các dịch vụ tài chính"
                    },
                    {
                        "en": "the development of new goods and services",
                        "vi": "sự phát triển của hàng hóa và dịch vụ mới"
                    },
                    {
                        "en": "Smith's Catering Services (= a company) offers the best value.",
                        "vi": "Smith's Catering Services (= một công ty) mang lại giá trị tốt nhất."
                    },
                    {
                        "en": "We guarantee (an) excellent service.",
                        "vi": "Chúng tôi đảm bảo (một) dịch vụ xuất sắc."
                    },
                    {
                        "en": "We aim to provide a high-quality service.",
                        "vi": "Chúng tôi mong muốn cung cấp một dịch vụ chất lượng cao."
                    },
                    {
                        "en": "They offer an after-care service.",
                        "vi": "Họ cung cấp một dịch vụ chăm sóc sau."
                    },
                    {
                        "en": "Training the staff required to deliver the service remains a challenge.",
                        "vi": "Đào tạo nhân viên cần thiết để cung cấp dịch vụ vẫn là một thách thức."
                    },
                    {
                        "en": "We are working hard to improve the services that we provide.",
                        "vi": "Chúng tôi đang làm việc chăm chỉ để cải thiện các dịch vụ mà chúng tôi cung cấp."
                    },
                    {
                        "en": "The number of people using the service has fallen.",
                        "vi": "Số lượng người sử dụng dịch vụ đã giảm."
                    },
                    {
                        "en": "I am not willing to pay for a service I am not receiving.",
                        "vi": "Tôi không sẵn sàng trả tiền cho một dịch vụ mà tôi không nhận được."
                    },
                    {
                        "en": "We offer clients a broad range of services.",
                        "vi": "Chúng tôi cung cấp cho khách hàng một loạt các dịch vụ."
                    },
                    {
                        "en": "the service sector (= the part of the economy involved in this type of business)",
                        "vi": "khu vực dịch vụ (= một phần của nền kinh tế tham gia vào loại hình kinh doanh này)"
                    },
                    {
                        "en": "a service industry",
                        "vi": "một ngành dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the serving of customers in hotels, restaurants, and shops",
                    "vi": "phục vụ khách hàng trong khách sạn, nhà hàng và cửa hàng"
                },
                "examples": [
                    {
                        "en": "The food was good but the service was very slow.",
                        "vi": "Thức ăn ngon nhưng dịch vụ rất chậm."
                    },
                    {
                        "en": "I complained about the poor service.",
                        "vi": "Tôi phàn nàn về dịch vụ kém."
                    },
                    {
                        "en": "10% will be added to your bill for service.",
                        "vi": "10% sẽ được thêm vào hóa đơn dịch vụ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the work that somebody does for an organization, etc., especially when it continues for a long time or is admired very much",
                    "vi": "công việc mà ai đó làm cho một tổ chức, v.v., đặc biệt là khi nó tiếp tục trong một thời gian dài hoặc được ngưỡng mộ rất nhiều"
                },
                "examples": [
                    {
                        "en": "service with something She has just celebrated 25 years' service with the company.",
                        "vi": "dịch vụ với một cái gì đó Cô ấy vừa kỷ niệm 25 năm phục vụ với công ty."
                    },
                    {
                        "en": "service to something He has retired after 30 years of dedicated service to the local community.",
                        "vi": "Ông đã nghỉ hưu sau 30 năm cống hiến cho cộng đồng địa phương."
                    },
                    {
                        "en": "She was presented with a long-service award after 40 years with the firm.",
                        "vi": "Cô đã được trao tặng giải thưởng phục vụ lâu dài sau 40 năm gắn bó với công ty."
                    },
                    {
                        "en": "The employees have good conditions of service.",
                        "vi": "Các nhân viên có điều kiện phục vụ tốt."
                    },
                    {
                        "en": "After retiring, she became involved in voluntary service in the local community.",
                        "vi": "Sau khi nghỉ hưu, cô đã tham gia hoạt động tình nguyện trong cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the army, the navy and the air force; the work done by people in them",
                    "vi": "lục quân, hải quân và không quân; công việc được thực hiện bởi những người trong họ"
                },
                "examples": [
                    {
                        "en": "Most of the boys went straight into the services.",
                        "vi": "Hầu hết các chàng trai đã đi thẳng vào các dịch vụ."
                    },
                    {
                        "en": "He saw service in North Africa.",
                        "vi": "Anh ấy đã thấy dịch vụ ở Bắc Phi."
                    },
                    {
                        "en": "After service in the US Army, he began his legal career.",
                        "vi": "Sau khi phục vụ trong Quân đội Hoa Kỳ, ông bắt đầu sự nghiệp luật sư của mình."
                    },
                    {
                        "en": "the country's military intelligence services",
                        "vi": "dịch vụ tình báo quân sự của đất nước"
                    },
                    {
                        "en": "a service family",
                        "vi": "một gia đình dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the use that you can get from a vehicle or machine; the state of being used",
                    "vi": "việc sử dụng mà bạn có thể nhận được từ một chiếc xe hoặc máy móc; trạng thái được sử dụng"
                },
                "examples": [
                    {
                        "en": "That computer gave us very good service.",
                        "vi": "Máy tính đó đã cung cấp cho chúng tôi dịch vụ rất tốt."
                    },
                    {
                        "en": "in service This bus is not in service.",
                        "vi": "đang hoạt động Xe buýt này không hoạt động."
                    },
                    {
                        "en": "out of service The ship will be taken out of service within two years.",
                        "vi": "hết hoạt động Con tàu sẽ ngừng hoạt động trong vòng hai năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of a vehicle or machine followed by any work that is necessary to keep it operating well",
                    "vi": "kiểm tra phương tiện hoặc máy móc sau đó là bất kỳ công việc nào cần thiết để giữ cho nó hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "a service engineer",
                        "vi": "một kỹ sư dịch vụ"
                    },
                    {
                        "en": "(British English) I had taken the car in for a service.",
                        "vi": "(Anh Anh) Tôi đã lấy xe hơi cho một dịch vụ."
                    },
                    {
                        "en": "(North American English) I had taken the car in for service.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã đưa xe vào dịch vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular skills or help that a person is able to offer",
                    "vi": "các kỹ năng cụ thể hoặc sự giúp đỡ mà một người có thể cung cấp"
                },
                "examples": [
                    {
                        "en": "You need the services of a good lawyer.",
                        "vi": "Bạn cần dịch vụ của một luật sư giỏi."
                    },
                    {
                        "en": "service as somebody/something He offered his services as a driver.",
                        "vi": "dịch vụ như một ai đó / cái gì đó Anh ấy đã cung cấp dịch vụ của mình với tư cách là một người lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious ceremony",
                    "vi": "một buổi lễ tôn giáo"
                },
                "examples": [
                    {
                        "en": "a funeral/memorial service",
                        "vi": "một lễ tang / lễ tưởng niệm"
                    },
                    {
                        "en": "A memorial service will be held at St James's Church on Sunday.",
                        "vi": "Một buổi lễ tưởng niệm sẽ được tổ chức tại Nhà thờ St James vào Chủ nhật."
                    },
                    {
                        "en": "More than 100 people attended the service.",
                        "vi": "Hơn 100 người đã tham dự buổi lễ."
                    },
                    {
                        "en": "to go to morning/evening service",
                        "vi": "đi phục vụ buổi sáng / buổi tối"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bus, train, etc. that goes regularly to a particular place at a particular time",
                    "vi": "xe buýt, xe lửa, v.v. thường xuyên đến một địa điểm cụ thể vào một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "the cancellation of the 10.15 service to Glasgow",
                        "vi": "việc hủy bỏ dịch vụ 10.15 đến Glasgow"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place next to a motorway where you can stop for petrol, a meal, the toilets, etc.",
                    "vi": "một nơi bên cạnh đường cao tốc, nơi bạn có thể dừng lại để đổ xăng, ăn uống, nhà vệ sinh, v.v."
                },
                "examples": [
                    {
                        "en": "motorway services",
                        "vi": "dịch vụ đường cao tốc"
                    },
                    {
                        "en": "It's five miles to the next services.",
                        "vi": "Còn năm dặm nữa là đến các dịch vụ tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting the ball in order to start playing; the way that you hit it",
                    "vi": "một hành động đánh bóng để bắt đầu chơi; cách bạn đánh nó"
                },
                "examples": [
                    {
                        "en": "It's your service (= your turn to start playing).",
                        "vi": "Đó là dịch vụ của bạn (= đến lượt bạn bắt đầu chơi)."
                    },
                    {
                        "en": "Her service has improved.",
                        "vi": "Dịch vụ của cô ấy đã được cải thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set of plates, dishes, etc. that match each other",
                    "vi": "một bộ đầy đủ các đĩa, đĩa, v.v. khớp với nhau"
                },
                "examples": [
                    {
                        "en": "a tea service (= cups, saucers, a teapot and plates, for serving tea)",
                        "vi": "một dịch vụ trà (= tách, đĩa, ấm trà và đĩa, để phục vụ trà)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state or position of being a servant",
                    "vi": "trạng thái hoặc vị trí của một người hầu"
                },
                "examples": [
                    {
                        "en": "to be in/go into service (= to be/become a servant)",
                        "vi": "được trong / đi phục vụ (= trở thành / trở thành người hầu)"
                    },
                    {
                        "en": "a job in domestic service",
                        "vi": "một công việc giúp việc gia đình"
                    }
                ]
            },
            {
                "define": {
                    "en": "the formal giving of an official document, etc. to somebody",
                    "vi": "việc trao chính thức một tài liệu chính thức, v.v. cho ai đó"
                },
                "examples": [
                    {
                        "en": "the service of a demand for payment",
                        "vi": "dịch vụ của một nhu cầu thanh toán"
                    }
                ]
            },
            {
                "define": {
                    "en": "completely available for somebody to use or to help somebody",
                    "vi": "hoàn toàn có sẵn để ai đó sử dụng hoặc để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "Healthcare must be at the service of all who need it.",
                        "vi": "Chăm sóc sức khỏe phải phục vụ tất cả những ai cần."
                    },
                    {
                        "en": "(formal or humorous) If you need anything, I am at your service.",
                        "vi": "(trang trọng hoặc hài hước) Nếu bạn cần bất cứ điều gì, tôi sẽ phục vụ bạn."
                    },
                    {
                        "en": "The cabin staff are at your service throughout the flight.",
                        "vi": "Các nhân viên tiếp viên phục vụ bạn trong suốt chuyến bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful or helpful",
                    "vi": "hữu ích hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "Can I be of service to anyone?",
                        "vi": "Tôi có thể phục vụ bất cứ ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is helpful/not helpful to somebody",
                    "vi": "làm điều gì đó hữu ích / không hữu ích cho ai đó"
                },
                "examples": [
                    {
                        "en": "She was doing herself no service by remaining silent.",
                        "vi": "Cô ấy không phục vụ mình bằng cách giữ im lặng."
                    },
                    {
                        "en": "You have done us a great service.",
                        "vi": "Bạn đã làm cho chúng tôi một dịch vụ tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available",
                    "vi": "sử dụng ai đó / cái gì đó cho một mục đích mà họ không được đào tạo hoặc dự định vì không có ai hoặc không có gì khác"
                },
                "examples": [
                    {
                        "en": "Every type of boat was pressed into service to rescue passengers from the sinking ferry.",
                        "vi": "Các loại thuyền đều dồn dập tham gia cứu hộ hành khách thoát khỏi vụ chìm phà."
                    }
                ]
            }
        ]
    },
    {
        "id": "b3d53763464842f29f54a9889c723077",
        "word": "set",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            },
            {
                "word": "set about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of similar things that belong together in some way",
                    "vi": "một nhóm những thứ giống nhau thuộc về nhau theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a set of six chairs",
                        "vi": "một bộ sáu chiếc ghế"
                    },
                    {
                        "en": "a complete set of her novels",
                        "vi": "một bộ tiểu thuyết hoàn chỉnh của cô ấy"
                    },
                    {
                        "en": "a set of false teeth",
                        "vi": "một bộ răng giả"
                    },
                    {
                        "en": "These companies operate under a strict set of rules.",
                        "vi": "Các công ty này hoạt động theo một bộ quy tắc nghiêm ngặt."
                    },
                    {
                        "en": "This is an unusual set of circumstances.",
                        "vi": "Đây là một tập hợp các tình huống bất thường."
                    },
                    {
                        "en": "I have a different set of values to them.",
                        "vi": "Tôi có một bộ giá trị khác với chúng."
                    },
                    {
                        "en": "Now they faced a whole new set of problems.",
                        "vi": "Bây giờ họ phải đối mặt với một loạt vấn đề hoàn toàn mới."
                    },
                    {
                        "en": "You can borrow my keys—I have a spare set.",
                        "vi": "Bạn có thể mượn chìa khóa của tôi — tôi có một bộ dự phòng."
                    },
                    {
                        "en": "She won a silver medal in the long jump to complete her set.",
                        "vi": "Cô đã giành huy chương bạc môn nhảy xa để hoàn thành set của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects used together, for example for playing a game",
                    "vi": "một nhóm các đối tượng được sử dụng cùng nhau, chẳng hạn như để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "a chess set",
                        "vi": "một bộ cờ vua"
                    },
                    {
                        "en": "a model train set",
                        "vi": "một bộ mô hình xe lửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have similar interests and spend a lot of time together socially",
                    "vi": "một nhóm những người có cùng sở thích và dành nhiều thời gian cho nhau trên phương diện xã hội"
                },
                "examples": [
                    {
                        "en": "the smart set (= rich, fashionable people)",
                        "vi": "bộ thông minh (= những người giàu có, thời trang)"
                    },
                    {
                        "en": "Dublin’s literary set",
                        "vi": "Bộ văn học của Dublin"
                    },
                    {
                        "en": "It's known as a playground for Scotland's rich hunting and fishing set.",
                        "vi": "Nó được biết đến như một sân chơi cho bộ môn săn bắn và câu cá phong phú của Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment for receiving television or radio signals",
                    "vi": "một phần của thiết bị để nhận tín hiệu truyền hình hoặc radio"
                },
                "examples": [
                    {
                        "en": "a television/TV set",
                        "vi": "một máy thu hình / TV"
                    }
                ]
            },
            {
                "define": {
                    "en": "the scenery used for a play, film, etc.",
                    "vi": "phong cảnh được sử dụng cho một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "We need volunteers to help build and paint the set.",
                        "vi": "Chúng tôi cần các tình nguyện viên giúp xây dựng và sơn bộ này."
                    },
                    {
                        "en": "The locations and set designs were fabulous.",
                        "vi": "Các vị trí và thiết kế thiết lập là tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a play is performed or part of a film is filmed",
                    "vi": "nơi biểu diễn một vở kịch hoặc một phần của bộ phim được quay"
                },
                "examples": [
                    {
                        "en": "The cast must all be on (the) set by 7 in the morning.",
                        "vi": "Tất cả các diễn viên phải có mặt trên (bộ) trước 7 giờ sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of a match in games such as tennis or volleyball",
                    "vi": "một phần của trận đấu trong các trò chơi như quần vợt hoặc bóng chuyền"
                },
                "examples": [
                    {
                        "en": "She won in straight sets (= without losing a set).",
                        "vi": "Cô ấy thắng trong các set liên tiếp (= mà không thua set nào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of things regarded as a unit because they all have particular qualities in common",
                    "vi": "một nhóm những thứ được coi là một đơn vị vì chúng đều có những điểm chung đặc biệt"
                },
                "examples": [
                    {
                        "en": "the set of all square numbers less than 50",
                        "vi": "tập hợp tất cả các số bình phương nhỏ hơn 50"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of songs or pieces of music that a musician or group performs at a concert",
                    "vi": "một loạt các bài hát hoặc đoạn nhạc mà một nhạc sĩ hoặc nhóm biểu diễn tại một buổi hòa nhạc"
                },
                "examples": [
                    {
                        "en": "a stunning solo set of ten songs",
                        "vi": "một bộ mười bài hát solo tuyệt đẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of school students with a similar ability in a particular subject",
                    "vi": "một nhóm học sinh có khả năng tương tự trong một môn học cụ thể"
                },
                "examples": [
                    {
                        "en": "She's in the top set for French.",
                        "vi": "Cô ấy thuộc nhóm hàng đầu về tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody’s face or body is fixed in a particular expression, especially one showing a feeling of being determined",
                    "vi": "cách mà khuôn mặt hoặc cơ thể của ai đó được cố định trong một biểu hiện cụ thể, đặc biệt là một người thể hiện cảm giác được xác định"
                },
                "examples": [
                    {
                        "en": "She admired the firm set of his jaw.",
                        "vi": "Cô ngưỡng mộ bộ hàm rắn chắc của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of arranging hair in a particular style while it is wet",
                    "vi": "một hành động sắp xếp tóc theo một kiểu cụ thể khi tóc ướt"
                },
                "examples": [
                    {
                        "en": "A shampoo and set costs £15.",
                        "vi": "Một bộ dầu gội đầu có giá 15 bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of becoming solid or hard",
                    "vi": "trạng thái trở nên rắn hoặc cứng"
                },
                "examples": [
                    {
                        "en": "To be sure of a good set when making the jam, use preserving sugar with added pectin.",
                        "vi": "Để đảm bảo mứt ngon khi làm mứt, hãy sử dụng đường bảo quản có thêm pectin."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hole in the ground where a badger lives",
                    "vi": "một cái lỗ trên mặt đất nơi một con lửng sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a young plant, shoot etc. for planting",
                    "vi": "một cây non, chồi vv để trồng"
                },
                "examples": [
                    {
                        "en": "onion sets",
                        "vi": "bộ hành"
                    }
                ]
            }
        ]
    },
    {
        "id": "1c26ca48ac4a44cf82c2b3893a403352",
        "word": "set point",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌset ˈpɔɪnt/",
            "us": "/ˌset ˈpɔɪnt/"
        },
        "nearby": [
            {
                "word": "set phrase",
                "pos": "noun"
            },
            {
                "word": "set piece",
                "pos": "noun"
            },
            {
                "word": "set point",
                "pos": "noun"
            },
            {
                "word": "set shot",
                "pos": "noun"
            },
            {
                "word": "set square",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a point that, if won by a player, will win them the set (7)",
                    "vi": "một điểm mà nếu người chơi thắng, họ sẽ thắng cả set (7)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9beb2ade2b1f42f79536c98911681595",
        "word": "shotmaking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɒtmeɪkɪŋ/",
            "us": "/ˈʃɑːtmeɪkɪŋ/"
        },
        "nearby": [
            {
                "word": "shotgun",
                "pos": "noun"
            },
            {
                "word": "shotgun wedding",
                "pos": "noun"
            },
            {
                "word": "shotmaking",
                "pos": "noun"
            },
            {
                "word": "Shotokan",
                "pos": "noun"
            },
            {
                "word": "shot-put",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of playing in which a player takes risks in order to win more points",
                    "vi": "một cách chơi trong đó người chơi chấp nhận rủi ro để giành được nhiều điểm hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "93ab525125c14479a30788a84734aeb0",
        "word": "sideline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaɪdlaɪn/",
            "us": "/ˈsaɪdlaɪn/"
        },
        "nearby": [
            {
                "word": "sidekick",
                "pos": "noun"
            },
            {
                "word": "sidelight",
                "pos": "noun"
            },
            {
                "word": "sideline",
                "pos": "noun"
            },
            {
                "word": "sideline",
                "pos": "verb"
            },
            {
                "word": "sidelong",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity that you do as well as your main job in order to earn extra money",
                    "vi": "một hoạt động mà bạn làm cũng như công việc chính của bạn để kiếm thêm tiền"
                },
                "examples": [
                    {
                        "en": "His hobby of winemaking was fast becoming a profitable sideline.",
                        "vi": "Sở thích nấu rượu của anh ấy nhanh chóng trở thành một công việc bên lề có lợi nhuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lines along the two long sides of a sports field, tennis court, etc. that mark the outer edges; the area just outside these",
                    "vi": "các đường dọc theo hai cạnh dài của sân thể thao, sân tennis, v.v. đánh dấu các mép ngoài; khu vực ngay bên ngoài những"
                },
                "examples": [
                    {
                        "en": "The coach stood on the sidelines yelling instructions to the players.",
                        "vi": "Huấn luyện viên đứng bên lề la hét hướng dẫn các cầu thủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "watching something but not actually involved in it",
                    "vi": "xem một cái gì đó nhưng không thực sự tham gia vào nó"
                },
                "examples": [
                    {
                        "en": "I had to watch from the sidelines as they destroyed the business I had built.",
                        "vi": "Tôi đã phải quan sát từ bên lề khi họ phá hủy công việc kinh doanh mà tôi đã gây dựng."
                    },
                    {
                        "en": "She has chosen to remain on the sidelines of public debate.",
                        "vi": "Cô ấy đã chọn ở lại bên lề cuộc tranh luận của công chúng."
                    }
                ]
            }
        ]
    },
    {
        "id": "40193304f8e9452c80f97662a91437af",
        "word": "slam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slæm/",
            "us": "/slæm/"
        },
        "nearby": [
            {
                "word": "slalom",
                "pos": "noun"
            },
            {
                "word": "slam",
                "pos": "verb"
            },
            {
                "word": "slam",
                "pos": "noun"
            },
            {
                "word": "slam dunk",
                "pos": "noun"
            },
            {
                "word": "slam-dunk",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of slamming something; the noise of something being slammed",
                    "vi": "một hành động đóng sầm một cái gì đó; tiếng ồn của một cái gì đó bị đóng sầm"
                },
                "examples": [
                    {
                        "en": "She gave the door a good hard slam.",
                        "vi": "Cô ấy đóng một cái thật mạnh cho cánh cửa."
                    },
                    {
                        "en": "The front door closed with a slam.",
                        "vi": "Cửa trước đóng sầm lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition in which people perform their poems to an audience, which chooses a winner",
                    "vi": "một cuộc thi trong đó mọi người trình diễn bài thơ của họ cho khán giả, cuộc thi này chọn người chiến thắng"
                },
                "examples": [
                    {
                        "en": "A poetry slam with cash prizes will be among the social events.",
                        "vi": "Một cuộc thi thơ với giải thưởng tiền mặt sẽ nằm trong số các sự kiện xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of very important competitions in a particular sport in the same year in tennis, golf or rugby; one of the individual competitions that make up a Grand Slam",
                    "vi": "một tập hợp các cuộc thi rất quan trọng trong một môn thể thao cụ thể trong cùng một năm như quần vợt, gôn hoặc bóng bầu dục; một trong những cuộc thi cá nhân tạo nên một Grand Slam"
                },
                "examples": [
                    {
                        "en": "She won her first slam with a dominant final.",
                        "vi": "Cô ấy đã giành chiến thắng đầu tiên của mình với một trận chung kết có ưu thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "8fa89accc0fd4dc59507f4a6dd26bd89",
        "word": "slice",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slaɪs/",
            "us": "/slaɪs/"
        },
        "nearby": [
            {
                "word": "slew",
                "pos": "verb"
            },
            {
                "word": "slew",
                "pos": "noun"
            },
            {
                "word": "slice",
                "pos": "noun"
            },
            {
                "word": "slice",
                "pos": "verb"
            },
            {
                "word": "slice away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat piece of bread, meat, cheese, etc. that has been cut off a larger piece; a piece of cake that has been cut from a larger cake",
                    "vi": "một miếng bánh mì dẹt mỏng, thịt, pho mát, vv đã được cắt ra một miếng lớn hơn; một miếng bánh đã được cắt ra từ một chiếc bánh lớn hơn"
                },
                "examples": [
                    {
                        "en": "Cut the meat into thin slices.",
                        "vi": "Cắt thịt thành từng lát mỏng."
                    },
                    {
                        "en": "slice of something a slice of bread/pie",
                        "vi": "lát của một cái gì đó một lát bánh mì / bánh"
                    },
                    {
                        "en": "a slice of toast/pizza",
                        "vi": "một lát bánh mì nướng / pizza"
                    },
                    {
                        "en": "Another slice of cake, anyone?",
                        "vi": "Một lát bánh khác, có ai không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part or share of something",
                    "vi": "một phần hoặc chia sẻ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Our firm is well placed to grab a large slice of the market.",
                        "vi": "Công ty của chúng tôi có vị thế tốt để nắm bắt một phần lớn thị trường."
                    },
                    {
                        "en": "The rent for my room was a large slice out of my budget.",
                        "vi": "Tiền thuê phòng của tôi là một phần lớn so với ngân sách của tôi."
                    },
                    {
                        "en": "With this win, they can claim a slice of history.",
                        "vi": "Với chiến thắng này, họ có thể khẳng định một phần lịch sử."
                    },
                    {
                        "en": "Every organization in the land has tried to claim a slice of the cash from the National Lottery.",
                        "vi": "Mọi tổ chức trong đất nước đều cố gắng đòi một phần tiền mặt từ Xổ số Quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "a kitchen utensil (= tool) that you use to lift and serve pieces of food",
                    "vi": "dụng cụ nhà bếp (= công cụ) mà bạn sử dụng để nâng và dọn thức ăn"
                },
                "examples": [
                    {
                        "en": "a cake slice",
                        "vi": "một lát bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a shot that makes the ball go to one side rather than straight ahead, while turning round and round",
                    "vi": "một cú đánh làm cho bóng đi về một phía thay vì đi thẳng về phía trước, trong khi quay tròn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a share or role in an interesting or exciting activity, especially one that makes money",
                    "vi": "một chia sẻ hoặc vai trò trong một hoạt động thú vị hoặc hấp dẫn, đặc biệt là một hoạt động kiếm tiền"
                },
                "examples": [
                    {
                        "en": "Foreign firms will all want a slice of the action if the new airport goes ahead.",
                        "vi": "Tất cả các công ty nước ngoài sẽ muốn có một phần hành động nếu sân bay mới đi vào hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film, play or book that gives a very realistic view of ordinary life",
                    "vi": "một bộ phim, vở kịch hoặc một cuốn sách mang đến một cái nhìn rất thực tế về cuộc sống bình thường"
                },
                "examples": [
                    {
                        "en": "This drama provides a slice of life in 1950s Connecticut.",
                        "vi": "Bộ phim này cung cấp một phần của cuộc sống ở Connecticut những năm 1950."
                    }
                ]
            },
            {
                "define": {
                    "en": "a share of the available money or benefits that you believe you have a right to",
                    "vi": "một phần tiền hoặc lợi ích hiện có mà bạn tin rằng bạn có quyền"
                },
                "examples": [
                    {
                        "en": "The company is demanding a larger slice of the corporate pie.",
                        "vi": "Công ty đang đòi hỏi một phần lớn hơn trong miếng bánh doanh nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "6909d8ebf01a4dcfa711cdd896600961",
        "word": "smash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/smæʃ/",
            "us": "/smæʃ/"
        },
        "nearby": [
            {
                "word": "smarty-pants",
                "pos": "noun"
            },
            {
                "word": "smash",
                "pos": "verb"
            },
            {
                "word": "smash",
                "pos": "noun"
            },
            {
                "word": "smash-and-grab",
                "pos": "adjective"
            },
            {
                "word": "smash down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of breaking something noisily into pieces; the sound this makes",
                    "vi": "một hành động phá vỡ một cái gì đó ồn ào thành nhiều mảnh; âm thanh này tạo ra"
                },
                "examples": [
                    {
                        "en": "The cup hit the floor with a smash.",
                        "vi": "Chiếc cốc đập mạnh xuống sàn."
                    },
                    {
                        "en": "He heard the smash of breaking glass.",
                        "vi": "Anh nghe thấy tiếng kính vỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an accident in which a vehicle hits another vehicle",
                    "vi": "một vụ tai nạn trong đó một chiếc xe đâm vào một chiếc xe khác"
                },
                "examples": [
                    {
                        "en": "a car smash",
                        "vi": "một vụ đập xe"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of hitting the ball downwards and very hard",
                    "vi": "một cách đánh bóng xuống dưới và rất khó"
                },
                "examples": [
                    {
                        "en": "He can hit a powerful overhead smash.",
                        "vi": "Anh ta có thể đánh một cú đập mạnh mẽ từ trên cao."
                    },
                    {
                        "en": "He misses a smash to hand Thiem a 5–0 lead.",
                        "vi": "Anh ấy bỏ lỡ một cú smash để dẫn Thiem dẫn 5–0."
                    }
                ]
            },
            {
                "define": {
                    "en": "a song, film or play that is very popular",
                    "vi": "một bài hát, bộ phim hoặc vở kịch rất phổ biến"
                },
                "examples": [
                    {
                        "en": "her latest chart smash",
                        "vi": "bảng xếp hạng mới nhất của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "8a5713a45d9d428b9096cc9f69c28968",
        "word": "tiebreaker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪbreɪkə(r)/",
            "us": "/ˈtaɪbreɪkər/"
        },
        "nearby": [
            {
                "word": "tie",
                "pos": "noun"
            },
            {
                "word": "tiebreak",
                "pos": "noun"
            },
            {
                "word": "tiebreaker",
                "pos": "noun"
            },
            {
                "word": "tied",
                "pos": "adjective"
            },
            {
                "word": "tied house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of extra play to decide who is the winner of a set when both players have won six games",
                    "vi": "một khoảng thời gian của hiệp phụ để quyết định ai là người chiến thắng trong một set khi cả hai người chơi đã thắng sáu trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an extra question in a competition to decide who is the winner when two or more of those taking part have equal scores",
                    "vi": "một câu hỏi phụ trong một cuộc thi để quyết định ai là người chiến thắng khi hai hoặc nhiều hơn những người tham gia có số điểm bằng nhau"
                },
                "examples": [
                    {
                        "en": "Write a tiebreaker slogan saying why you would like to visit New York.",
                        "vi": "Viết khẩu hiệu thắt cà vạt nói lý do tại sao bạn muốn đến thăm New York."
                    }
                ]
            }
        ]
    },
    {
        "id": "51b50fc621544c56a4e81a1cdb2c124d",
        "word": "topspin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒpspɪn/",
            "us": "/ˈtɑːpspɪn/"
        },
        "nearby": [
            {
                "word": "topside",
                "pos": "noun"
            },
            {
                "word": "topsoil",
                "pos": "noun"
            },
            {
                "word": "topspin",
                "pos": "noun"
            },
            {
                "word": "Topsy",
                "pos": ""
            },
            {
                "word": "topsy-turvy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of making a ball turn round and forward fast by hitting it or throwing it in a special way",
                    "vi": "hành động làm cho một quả bóng quay tròn và về phía trước nhanh chóng bằng cách đánh nó hoặc ném nó theo một cách đặc biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "53b61dc59967439b8a5bface398dc9d7",
        "word": "tramlines",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtræmlaɪnz/",
            "us": "/ˈtræmlaɪnz/"
        },
        "nearby": [
            {
                "word": "trajectory",
                "pos": "noun"
            },
            {
                "word": "tram",
                "pos": "noun"
            },
            {
                "word": "tramlines",
                "pos": "noun"
            },
            {
                "word": "trammel",
                "pos": "verb"
            },
            {
                "word": "tramp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the rails in the street that trams run on",
                    "vi": "đường ray xe điện chạy trên đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the pair of straight lines on a tennis or badminton court that mark the extra area that is used when four people are playing",
                    "vi": "cặp đường thẳng trên sân tennis hoặc sân cầu lông đánh dấu phần diện tích thừa được sử dụng khi bốn người đang chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "054a017c50ea464f9132c504714543e3",
        "word": "unseeded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ʌnˈsiːdɪd/",
            "us": "/ʌnˈsiːdɪd/"
        },
        "nearby": [
            {
                "word": "unseat",
                "pos": "verb"
            },
            {
                "word": "unsecured",
                "pos": "adjective"
            },
            {
                "word": "unseeded",
                "pos": "adjective"
            },
            {
                "word": "unseeing",
                "pos": "adjective"
            },
            {
                "word": "unseeingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not chosen as a seed (= one of the players expected to do well) in a sports competition, especially in tennis",
                    "vi": "không được chọn làm hạt giống (= một trong những người chơi được mong đợi sẽ thi đấu tốt) trong một cuộc thi thể thao, đặc biệt là trong quần vợt"
                },
                "examples": [
                    {
                        "en": "unseeded players",
                        "vi": "người chơi không có lông"
                    }
                ]
            }
        ]
    }
]