[
    {
        "id": "c39896be9c8d4dccb704950a6061bebf",
        "word": "job",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dʒɒb/",
            "us": "/dʒɑːb/"
        },
        "nearby": [
            {
                "word": "Joanna",
                "pos": ""
            },
            {
                "word": "Joanne",
                "pos": ""
            },
            {
                "word": "job",
                "pos": "noun"
            },
            {
                "word": "Job",
                "pos": "noun"
            },
            {
                "word": "job action",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work for which you receive regular payment",
                    "vi": "làm việc mà bạn nhận được thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "I don't have a job at present.",
                        "vi": "Hiện tại tôi không có việc làm."
                    },
                    {
                        "en": "He's trying to get a job.",
                        "vi": "Anh ấy đang cố gắng kiếm một công việc."
                    },
                    {
                        "en": "I'm thinking of applying for a new job.",
                        "vi": "Tôi đang nghĩ đến việc xin một công việc mới."
                    },
                    {
                        "en": "to look for/find a job",
                        "vi": "tìm kiếm / tìm việc làm"
                    },
                    {
                        "en": "Did they offer you the job?",
                        "vi": "Họ có cung cấp cho bạn công việc không?"
                    },
                    {
                        "en": "job as something She took a job as a waitress.",
                        "vi": "job as something Cô ấy đã nhận một công việc như một nhân viên phục vụ bàn."
                    },
                    {
                        "en": "job with somebody/something She's just started a job with a travel company.",
                        "vi": "job with somebody / something Cô ấy vừa bắt đầu công việc với một công ty du lịch."
                    },
                    {
                        "en": "His brother's just lost his job.",
                        "vi": "Anh trai anh ấy vừa bị mất việc."
                    },
                    {
                        "en": "to leave/quit your job",
                        "vi": "nghỉ việc / bỏ việc của bạn"
                    },
                    {
                        "en": "Don't be late again if you want to keep your job.",
                        "vi": "Đừng đến muộn một lần nữa nếu bạn muốn tiếp tục công việc của mình."
                    },
                    {
                        "en": "a temporary/permanent job",
                        "vi": "một công việc tạm thời / lâu dài"
                    },
                    {
                        "en": "a summer/Saturday/holiday/vacation job",
                        "vi": "một công việc mùa hè / thứ bảy / ngày lễ / kỳ nghỉ"
                    },
                    {
                        "en": "Both my parents have full-time jobs.",
                        "vi": "Cả bố mẹ tôi đều có công việc toàn thời gian."
                    },
                    {
                        "en": "Many women are in part-time jobs.",
                        "vi": "Nhiều phụ nữ đang làm công việc bán thời gian."
                    },
                    {
                        "en": "She's never had a steady job (= a job that is not going to end suddenly).",
                        "vi": "Cô ấy chưa bao giờ có một công việc ổn định (= một công việc sẽ không kết thúc đột ngột)."
                    },
                    {
                        "en": "It's one of the top jobs in management.",
                        "vi": "Đó là một trong những công việc hàng đầu trong quản lý."
                    },
                    {
                        "en": "job of something one of the people under consideration for the job of managing director",
                        "vi": "công việc của một cái gì đó một trong những người đang được xem xét cho vị trí giám đốc quản lý"
                    },
                    {
                        "en": "in a job an increase in the number of people in jobs (= having jobs)",
                        "vi": "trong một công việc, số lượng người có việc làm tăng lên (= có việc làm)"
                    },
                    {
                        "en": "out of a job He's been out of a job (= unemployed) for six months now.",
                        "vi": "out of a job Anh ấy đã mất việc làm (= thất nghiệp) được sáu tháng rồi."
                    },
                    {
                        "en": "The takeover of the company is bound to mean more job losses.",
                        "vi": "Việc tiếp quản công ty chắc chắn đồng nghĩa với việc mất việc làm nhiều hơn."
                    },
                    {
                        "en": "There is so much competition in the job market currently.",
                        "vi": "Có rất nhiều cạnh tranh trong thị trường việc làm hiện nay."
                    },
                    {
                        "en": "He certainly knows his job (= is very good at his job).",
                        "vi": "Anh ấy chắc chắn biết công việc của mình (= rất giỏi trong công việc của mình)."
                    },
                    {
                        "en": "I'm only doing my job (= I'm doing what I am paid to do).",
                        "vi": "I'm only doing my job (= Tôi đang làm những gì tôi được trả tiền để làm)."
                    },
                    {
                        "en": "These projects will help create jobs in rural areas.",
                        "vi": "Các dự án này sẽ giúp tạo việc làm ở các vùng nông thôn."
                    },
                    {
                        "en": "The alternative would have been to cut jobs to contain costs.",
                        "vi": "Giải pháp thay thế là cắt giảm việc làm để giảm chi phí."
                    },
                    {
                        "en": "The closure of the factory will mean the loss of over 800 jobs.",
                        "vi": "Việc đóng cửa nhà máy sẽ đồng nghĩa với việc mất đi hơn 800 việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular task or piece of work that you have to do",
                    "vi": "một nhiệm vụ hoặc một phần công việc cụ thể mà bạn phải làm"
                },
                "examples": [
                    {
                        "en": "I've got various jobs around the house to do.",
                        "vi": "Tôi có nhiều công việc xung quanh nhà để làm."
                    },
                    {
                        "en": "Sorting these papers out is going to be a long job.",
                        "vi": "Việc sắp xếp những giấy tờ này sẽ là một công việc lâu dài."
                    },
                    {
                        "en": "The builder has a couple of jobs on at the moment.",
                        "vi": "Người xây dựng có một vài công việc vào lúc này."
                    },
                    {
                        "en": "job of doing something She's taken on the job of organizing the Christmas party.",
                        "vi": "job of doing something Cô ấy đảm nhận công việc tổ chức bữa tiệc Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a responsibility or duty",
                    "vi": "một trách nhiệm hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "He said he wouldn't do it because it wasn't his job.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không làm điều đó vì đó không phải là công việc của anh ấy."
                    },
                    {
                        "en": "somebody's job to do something It's not my job to lock up!",
                        "vi": "nhiệm vụ của ai đó để làm điều gì đó Không phải việc của tôi là nhốt!"
                    },
                    {
                        "en": "It's the job of the press to expose wrongdoing.",
                        "vi": "Đó là công việc của báo chí để vạch trần những hành vi sai trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a crime, especially stealing",
                    "vi": "một tội ác, đặc biệt là ăn cắp"
                },
                "examples": [
                    {
                        "en": "a bank job",
                        "vi": "một công việc ngân hàng"
                    },
                    {
                        "en": "He got six months for that last job he did.",
                        "vi": "Anh ấy có sáu tháng cho công việc cuối cùng mà anh ấy đã làm."
                    },
                    {
                        "en": "an inside job (= done by somebody in the organization where the crime happens)",
                        "vi": "một công việc bên trong (= được thực hiện bởi ai đó trong tổ chức nơi tội phạm xảy ra)"
                    },
                    {
                        "en": "The gang bungled the job and got caught.",
                        "vi": "Cả nhóm đã làm hỏng công việc và bị bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular kind of thing",
                    "vi": "một loại điều cụ thể"
                },
                "examples": [
                    {
                        "en": "It's real wood—not one of those plastic jobs.",
                        "vi": "Đó là gỗ thật - không phải là một trong những công việc bằng nhựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item of work that is done by a computer as a single unit",
                    "vi": "một hạng mục công việc được thực hiện bởi máy tính như một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "The job can be processed overnight.",
                        "vi": "Công việc có thể được xử lý trong một sớm một chiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to allow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để cho phép điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "unemployed for a short time. People say ‘between jobs’ to avoid saying ‘unemployed’.",
                    "vi": "thất nghiệp trong một thời gian ngắn. Người ta nói 'giữa các công việc' để tránh nói 'thất nghiệp'."
                },
                "examples": [
                    {
                        "en": "He's between jobs at the moment so he's using the time to do some voluntary work.",
                        "vi": "Hiện tại anh ấy đang bận rộn với nhiều công việc nên anh ấy đang sử dụng thời gian để làm một số công việc tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very difficult or unpleasant job or time",
                    "vi": "một công việc hoặc thời gian rất khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've had a devil of a job finding you.",
                        "vi": "Tôi đã có một công việc quỷ dữ tìm thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something well, badly, etc.",
                    "vi": "để làm điều gì đó tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "They did a very professional job.",
                        "vi": "Họ đã làm một công việc rất chuyên nghiệp."
                    },
                    {
                        "en": "You've certainly made an excellent job of the kitchen (= for example, painting it).",
                        "vi": "Bạn chắc chắn đã hoàn thành xuất sắc công việc bếp núc (= ví dụ: sơn nhà)."
                    },
                    {
                        "en": "We haven’t done a very good job on the publicity for the show.",
                        "vi": "Chúng tôi đã không làm tốt công việc quảng bá cho chương trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be effective or successful in doing what you want",
                    "vi": "để trở nên hiệu quả hoặc thành công trong việc làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "This extra strong glue should do the job.",
                        "vi": "Keo cực mạnh này sẽ thực hiện công việc."
                    },
                    {
                        "en": "Try wedging it open—that should do the job.",
                        "vi": "Hãy thử mở nó ra — điều đó sẽ thực hiện được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/yourself to lose their/your job because the role is no longer required",
                    "vi": "khiến ai đó / chính bạn mất việc của họ / của bạn vì vai trò không còn cần thiết"
                },
                "examples": [
                    {
                        "en": "Our aim as a charity is to help people so successfully that we do ourselves out of a job.",
                        "vi": "Mục đích của chúng tôi với tư cách là một tổ chức từ thiện là giúp mọi người thành công đến mức chúng tôi hoàn thành công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to stop trying to help somebody or to do something because there is no hope of success",
                    "vi": "quyết định ngừng cố gắng giúp đỡ ai đó hoặc làm điều gì đó bởi vì không có hy vọng thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they have done well at something",
                    "vi": "được sử dụng để nói với ai đó rằng họ đã làm tốt một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about a situation or that somebody is lucky that something happened",
                    "vi": "được sử dụng để nói rằng bạn hài lòng về một tình huống hoặc ai đó may mắn vì điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "It's a good job you were there to help.",
                        "vi": "Đó là một công việc tốt bạn đã ở đó để giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "people use the expression jobs for the boys when they are criticizing the fact that somebody in power has given work to friends or relatives",
                    "vi": "mọi người sử dụng các công việc biểu đạt cho các cậu bé khi họ đang chỉ trích việc ai đó nắm quyền đã giao việc cho bạn bè hoặc người thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "exactly what is needed in a particular situation",
                    "vi": "chính xác những gì cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "That cup of tea was just the job.",
                        "vi": "Đó là một tách trà chỉ là công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept a bad or difficult situation and do as well as you can",
                    "vi": "chấp nhận một tình huống xấu hoặc khó khăn và làm tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not worth doing because it is against the rules or because it might cause you to lose your job",
                    "vi": "không đáng làm vì nó trái với quy tắc hoặc vì nó có thể khiến bạn mất việc"
                },
                "examples": [
                    {
                        "en": "It's more than my job's worth to let you in without a ticket.",
                        "vi": "Công việc của tôi còn hơn cả việc để bạn vào mà không cần vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a particular job",
                    "vi": "trong khi làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "No sleeping on the job!",
                        "vi": "Không ngủ trong công việc!"
                    },
                    {
                        "en": "on-the-job training",
                        "vi": "vào đào tạo nghề"
                    }
                ]
            },
            {
                "define": {
                    "en": "having sex",
                    "vi": "quan hệ tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop working in order to go on strike",
                    "vi": "ngừng làm việc để đình công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "09404a76893c4ecfa84cb151a66d2b38",
        "word": "fire",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfaɪə(r)/",
            "us": "/ˈfaɪər/"
        },
        "nearby": [
            {
                "word": "fir cone",
                "pos": "noun"
            },
            {
                "word": "fire",
                "pos": "noun"
            },
            {
                "word": "fire",
                "pos": "verb"
            },
            {
                "word": "fire alarm",
                "pos": "noun"
            },
            {
                "word": "fire ant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to shoot bullets, etc. from a gun or other weapon",
                    "vi": "để bắn đạn, v.v. từ súng hoặc vũ khí khác"
                },
                "examples": [
                    {
                        "en": "The officer ordered his men to fire.",
                        "vi": "Viên sĩ quan ra lệnh cho người của mình nổ súng."
                    },
                    {
                        "en": "fire on somebody/something Soldiers fired on the crowd.",
                        "vi": "bắn vào ai đó / cái gì đó Những người lính bắn vào đám đông."
                    },
                    {
                        "en": "fire something to fire missiles/rockets/bullets",
                        "vi": "bắn thứ gì đó để bắn tên lửa / rocket / đạn"
                    },
                    {
                        "en": "They ran away as soon as the first shot was fired.",
                        "vi": "Họ bỏ chạy ngay khi phát súng đầu tiên."
                    },
                    {
                        "en": "fire something into something He fired the gun into the air.",
                        "vi": "bắn một cái gì đó vào một cái gì đó Anh ta bắn súng lên không trung."
                    },
                    {
                        "en": "fire into something He fired into the air.",
                        "vi": "bắn vào một cái gì đó Ông đã bắn vào không khí."
                    },
                    {
                        "en": "fire at somebody/something She fired at her attacker.",
                        "vi": "bắn vào ai đó / cái gì đó Cô ấy bắn vào kẻ tấn công cô ấy."
                    },
                    {
                        "en": "fire something at somebody/something She fired an arrow at the target.",
                        "vi": "bắn cái gì đó vào ai đó / cái gì đó Cô ấy bắn một mũi tên vào mục tiêu."
                    },
                    {
                        "en": "Missiles were fired at the enemy.",
                        "vi": "Tên lửa đã được bắn vào kẻ thù."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shoot bullets out",
                    "vi": "bắn đạn ra ngoài"
                },
                "examples": [
                    {
                        "en": "We heard the sound of guns firing.",
                        "vi": "Chúng tôi nghe thấy tiếng súng nổ."
                    },
                    {
                        "en": "fire something A starter's pistol fires only blanks.",
                        "vi": "bắn một thứ gì đó Súng lục của người khởi động chỉ bắn ra khoảng trống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to leave their job",
                    "vi": "buộc ai đó phải rời bỏ công việc của họ"
                },
                "examples": [
                    {
                        "en": "fire somebody We had to fire him for dishonesty.",
                        "vi": "sa thải ai đó Chúng tôi đã phải sa thải anh ta vì không trung thực."
                    },
                    {
                        "en": "He was responsible for hiring and firing staff.",
                        "vi": "Ông chịu trách nhiệm tuyển dụng và sa thải nhân viên."
                    },
                    {
                        "en": "fire somebody from something She got fired from her first job.",
                        "vi": "sa thải ai đó khỏi một cái gì đó Cô ấy đã bị sa thải từ công việc đầu tiên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel very excited about something or interested in something",
                    "vi": "để làm cho ai đó cảm thấy rất hào hứng về điều gì đó hoặc quan tâm đến điều gì đó"
                },
                "examples": [
                    {
                        "en": "fire somebody with something The talk had fired her with enthusiasm for the project.",
                        "vi": "sa thải ai đó bằng một cái gì đó. Buổi nói chuyện đã truyền cho cô ấy sự nhiệt tình với dự án."
                    },
                    {
                        "en": "fire something The stories fired his imagination",
                        "vi": "cháy một cái gì đó Những câu chuyện đã khơi dậy trí tưởng tượng của anh ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "when an engine fires, an electrical spark is produced that makes the fuel burn and the engine start to work",
                    "vi": "khi động cơ cháy sẽ sinh ra tia lửa điện làm nhiên liệu cháy và động cơ bắt đầu hoạt động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "using the fuel mentioned in order to operate",
                    "vi": "sử dụng nhiên liệu được đề cập để hoạt động"
                },
                "examples": [
                    {
                        "en": "gas-fired central heating",
                        "vi": "sưởi ấm trung tâm bằng khí đốt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to heat a clay object to make it hard and strong",
                    "vi": "nung nóng một vật bằng đất sét để làm cho nó cứng và chắc"
                },
                "examples": [
                    {
                        "en": "to fire pottery",
                        "vi": "nung gốm"
                    },
                    {
                        "en": "to fire bricks in a kiln",
                        "vi": "nung gạch trong lò nung"
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions one after another or make a lot of comments very quickly",
                    "vi": "để hỏi ai đó nhiều câu hỏi lần lượt hoặc đưa ra nhiều nhận xét rất nhanh chóng"
                },
                "examples": [
                    {
                        "en": "The room was full of journalists, all firing questions at them.",
                        "vi": "Căn phòng đầy ắp các nhà báo, tất cả đều đặt câu hỏi về phía họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "using all your energy to do something; working as well as possible",
                    "vi": "sử dụng tất cả năng lượng của bạn để làm một cái gì đó; làm việc tốt nhất có thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2ae02a66229e4296aefefd0c7497b39c",
        "word": "unemployed",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌnɪmˈplɔɪd/",
            "us": "/ˌʌnɪmˈplɔɪd/"
        },
        "nearby": [
            {
                "word": "unemotionally",
                "pos": "adverb"
            },
            {
                "word": "unemployable",
                "pos": "adjective"
            },
            {
                "word": "unemployed",
                "pos": "adjective"
            },
            {
                "word": "the unemployed",
                "pos": "noun"
            },
            {
                "word": "unemployment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a job although able to work",
                    "vi": "không có việc làm mặc dù có thể làm việc"
                },
                "examples": [
                    {
                        "en": "How long have you been unemployed?",
                        "vi": "Bạn đã thất nghiệp bao lâu rồi?"
                    },
                    {
                        "en": "unemployed workers/people",
                        "vi": "công nhân / người thất nghiệp"
                    },
                    {
                        "en": "I've been unemployed for 5 months.",
                        "vi": "Tôi đã thất nghiệp được 5 tháng."
                    },
                    {
                        "en": "training for unemployed youth",
                        "vi": "đào tạo cho thanh niên thất nghiệp"
                    },
                    {
                        "en": "an unemployed miner/labourer/builder",
                        "vi": "một thợ mỏ / lao động / thợ xây thất nghiệp"
                    },
                    {
                        "en": "an increase in the number of people registered as unemployed",
                        "vi": "sự gia tăng số người đăng ký thất nghiệp"
                    },
                    {
                        "en": "Thousands of labourers became unemployed with no alternative employment.",
                        "vi": "Hàng nghìn lao động trở nên thất nghiệp mà không có việc làm thay thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "5315c2447ad6448ea83263471438dcd2",
        "word": "unemployment",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌnɪmˈplɔɪmənt/",
            "us": "/ˌʌnɪmˈplɔɪmənt/"
        },
        "nearby": [
            {
                "word": "unemployed",
                "pos": "adjective"
            },
            {
                "word": "the unemployed",
                "pos": "noun"
            },
            {
                "word": "unemployment",
                "pos": "noun"
            },
            {
                "word": "unemployment benefit",
                "pos": "noun"
            },
            {
                "word": "unencrypted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of a number of people not having a job; the number of people without a job",
                    "vi": "tình trạng một số người không có việc làm; số người không có việc làm"
                },
                "examples": [
                    {
                        "en": "an area of high/low unemployment",
                        "vi": "một khu vực có tỷ lệ thất nghiệp cao / thấp"
                    },
                    {
                        "en": "rising unemployment",
                        "vi": "thất nghiệp gia tăng"
                    },
                    {
                        "en": "It was a time of mass unemployment.",
                        "vi": "Đó là thời kỳ thất nghiệp hàng loạt."
                    },
                    {
                        "en": "Government schemes to combat youth unemployment",
                        "vi": "Các kế hoạch của chính phủ để chống thất nghiệp cho thanh niên"
                    },
                    {
                        "en": "the level/rate of unemployment",
                        "vi": "mức độ / tỷ lệ thất nghiệp"
                    },
                    {
                        "en": "The unemployment rate rose to 4.7 per cent.",
                        "vi": "Tỷ lệ thất nghiệp tăng lên 4,7%."
                    },
                    {
                        "en": "measures to help reduce/tackle unemployment",
                        "vi": "các biện pháp giúp giảm / giải quyết thất nghiệp"
                    },
                    {
                        "en": "The point is that this type of economics causes unemployment.",
                        "vi": "Vấn đề là kiểu kinh tế này gây ra thất nghiệp."
                    },
                    {
                        "en": "unemployment figures/statistics",
                        "vi": "số liệu / thống kê thất nghiệp"
                    },
                    {
                        "en": "a rise in both inflation and unemployment",
                        "vi": "sự gia tăng cả lạm phát và thất nghiệp"
                    },
                    {
                        "en": "He applied for unemployment insurance and was approved.",
                        "vi": "Anh ấy đã nộp đơn xin bảo hiểm thất nghiệp và được chấp thuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not having a job",
                    "vi": "tình trạng không có việc làm"
                },
                "examples": [
                    {
                        "en": "Thousands of young people are facing long-term unemployment.",
                        "vi": "Hàng nghìn thanh niên đang phải đối mặt với tình trạng thất nghiệp kéo dài."
                    },
                    {
                        "en": "He has had long periods of unemployment.",
                        "vi": "Anh ấy đã có thời gian dài thất nghiệp."
                    },
                    {
                        "en": "One million people suffered unemployment as a result of the tsunami.",
                        "vi": "Một triệu người bị thất nghiệp do hậu quả của sóng thần."
                    },
                    {
                        "en": "a study of male/female unemployment",
                        "vi": "một nghiên cứu về tình trạng thất nghiệp của nam / nữ"
                    }
                ]
            },
            {
                "define": {
                    "en": "money paid by the government to somebody who is unemployed",
                    "vi": "tiền do chính phủ trả cho ai đó thất nghiệp"
                },
                "examples": [
                    {
                        "en": "Since losing his job, Mike has been collecting unemployment.",
                        "vi": "Kể từ khi mất việc, Mike đã thu thập số tiền thất nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "9aa2153c5103474cbf987fa9e3ad3b40",
        "word": "benefit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbenɪfɪt/",
            "us": "/ˈbenɪfɪt/"
        },
        "nearby": [
            {
                "word": "beneficially",
                "pos": "adverb"
            },
            {
                "word": "beneficiary",
                "pos": "noun"
            },
            {
                "word": "benefit",
                "pos": "noun"
            },
            {
                "word": "benefit",
                "pos": "verb"
            },
            {
                "word": "Benelux",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an advantage that something gives you; a helpful and useful effect that something has",
                    "vi": "một lợi thế mà một cái gì đó mang lại cho bạn; một tác dụng hữu ích và hữu ích mà một cái gì đó có"
                },
                "examples": [
                    {
                        "en": "Freedom of information brings great benefits.",
                        "vi": "Tự do thông tin mang lại những lợi ích to lớn."
                    },
                    {
                        "en": "health/economic/tax benefits",
                        "vi": "lợi ích sức khỏe / kinh tế / thuế"
                    },
                    {
                        "en": "the benefits of modern medicine",
                        "vi": "lợi ích của y học hiện đại"
                    },
                    {
                        "en": "I've had the benefit of a good education.",
                        "vi": "Tôi đã có được lợi ích của một nền giáo dục tốt."
                    },
                    {
                        "en": "It was good to see her finally reaping the benefits (= enjoying the results) of all her hard work.",
                        "vi": "Thật vui khi thấy cô ấy cuối cùng cũng gặt hái được những thành quả (= tận hưởng thành quả) sau tất cả những gì cô ấy làm việc chăm chỉ."
                    },
                    {
                        "en": "The industry will be one of the first to enjoy the benefits of the recovery.",
                        "vi": "Ngành công nghiệp này sẽ là một trong những ngành đầu tiên được hưởng những lợi ích từ việc phục hồi."
                    },
                    {
                        "en": "The company derived substantial benefit from the deal.",
                        "vi": "Công ty thu được lợi nhuận đáng kể từ thương vụ này."
                    },
                    {
                        "en": "benefit of doing something He couldn't see the benefit of arguing any longer.",
                        "vi": "lợi ích của việc làm điều gì đó Anh ấy không thể thấy lợi ích của việc tranh cãi nữa."
                    },
                    {
                        "en": "be of benefit to somebody/something The new regulations will be of benefit to everyone concerned.",
                        "vi": "có lợi cho ai đó / cái gì đó Các quy định mới sẽ có lợi cho tất cả những người có liên quan."
                    },
                    {
                        "en": "to somebody's benefit It will be to your benefit to arrive early.",
                        "vi": "vì lợi ích của ai đó Sẽ có lợi cho bạn nếu bạn đến sớm."
                    },
                    {
                        "en": "benefit for somebody/something The project will have major benefits for the local community.",
                        "vi": "mang lại lợi ích cho ai đó / điều gì đó Dự án sẽ mang lại lợi ích chính cho cộng đồng địa phương."
                    },
                    {
                        "en": "With the benefit of hindsight (= knowing what we have learnt since), we would do things differently.",
                        "vi": "Với lợi ích của nhận thức muộn màng (= biết những gì chúng ta đã học được từ đó), chúng ta sẽ làm những điều khác biệt."
                    },
                    {
                        "en": "without the benefit of something Nobody should be sent to prison without the benefit of legal advice.",
                        "vi": "không có lợi ích của một cái gì đó Không ai nên bị đưa vào tù mà không có lợi ích của lời khuyên pháp lý."
                    },
                    {
                        "en": "For maximum benefit, take the tablets before meals.",
                        "vi": "Để có lợi ích tối đa, hãy uống thuốc trước bữa ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "money provided by the government to people who need financial help because they are unemployed, ill, etc.",
                    "vi": "tiền do chính phủ cung cấp cho những người cần giúp đỡ tài chính vì họ thất nghiệp, ốm đau, v.v."
                },
                "examples": [
                    {
                        "en": "You may be eligible to receive benefits.",
                        "vi": "Bạn có thể đủ điều kiện để nhận trợ cấp."
                    },
                    {
                        "en": "The number of people claiming unemployment benefit fell last month.",
                        "vi": "Số người yêu cầu trợ cấp thất nghiệp đã giảm trong tháng trước."
                    },
                    {
                        "en": "on benefits The aim is to help people who are on benefits (= receiving benefits) to find jobs.",
                        "vi": "về lợi ích Mục đích là giúp những người đang hưởng trợ cấp (= nhận trợ cấp) tìm được việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an advantage that you get from a company in addition to the money that you earn",
                    "vi": "một lợi thế mà bạn nhận được từ một công ty ngoài số tiền bạn kiếm được"
                },
                "examples": [
                    {
                        "en": "Private health insurance is offered as part of the employees' benefits package.",
                        "vi": "Bảo hiểm y tế tư nhân được cung cấp như một phần của gói phúc lợi dành cho nhân viên."
                    },
                    {
                        "en": "These benefits will now be extended to agency workers.",
                        "vi": "Giờ đây, những phúc lợi này sẽ được mở rộng cho nhân viên đại lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "money from an insurance company",
                    "vi": "tiền từ một công ty bảo hiểm"
                },
                "examples": [
                    {
                        "en": "The insurance plan will provide substantial cash benefits to your family in case of your death.",
                        "vi": "Chương trình bảo hiểm sẽ cung cấp các quyền lợi tiền mặt đáng kể cho gia đình bạn trong trường hợp bạn qua đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event such as a performance, a dinner, etc., organized in order to raise money for a particular person or charity",
                    "vi": "một sự kiện chẳng hạn như một buổi biểu diễn, một bữa tối, v.v., được tổ chức để quyên tiền cho một người cụ thể hoặc tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "a benefit match/concert",
                        "vi": "một trận đấu lợi ích / buổi hòa nhạc"
                    },
                    {
                        "en": "The proceeds from the benefit will go directly to the refugee camps.",
                        "vi": "Số tiền thu được từ phúc lợi sẽ được chuyển thẳng đến các trại tị nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "especially in order to help or be useful to somebody",
                    "vi": "đặc biệt là để giúp đỡ hoặc hữu ích cho ai đó"
                },
                "examples": [
                    {
                        "en": "I have typed out some lecture notes for the benefit of those people who were absent last week.",
                        "vi": "Tôi đã đánh máy một số ghi chú bài giảng vì lợi ích của những người vắng mặt tuần trước."
                    },
                    {
                        "en": "Don't go to any trouble for my benefit!",
                        "vi": "Đừng đi đến bất kỳ rắc rối vì lợi ích của tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept that somebody has told the truth or behaved well because you cannot prove that they have not",
                    "vi": "chấp nhận rằng ai đó đã nói sự thật hoặc cư xử tốt bởi vì bạn không thể chứng minh rằng họ không"
                },
                "examples": [
                    {
                        "en": "She may have been lying, but I felt I had to give her the benefit of the doubt.",
                        "vi": "Cô ấy có thể đã nói dối, nhưng tôi cảm thấy tôi phải cho cô ấy lợi ích của sự nghi ngờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c806b1e091a48b196388d9fa3006047",
        "word": "dismiss",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪsˈmɪs/",
            "us": "/dɪsˈmɪs/"
        },
        "nearby": [
            {
                "word": "dismember",
                "pos": "verb"
            },
            {
                "word": "dismemberment",
                "pos": "noun"
            },
            {
                "word": "dismiss",
                "pos": "verb"
            },
            {
                "word": "dismissal",
                "pos": "noun"
            },
            {
                "word": "dismissive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to decide that somebody/something is not important and not worth thinking or talking about",
                    "vi": "để quyết định rằng ai đó / điều gì đó không quan trọng và không đáng để suy nghĩ hoặc nói về"
                },
                "examples": [
                    {
                        "en": "dismiss somebody/something to dismiss a suggestion/a claim/an idea",
                        "vi": "bác bỏ ai đó / cái gì đó để bác bỏ một đề xuất / một tuyên bố / một ý tưởng"
                    },
                    {
                        "en": "The criticisms were summarily dismissed by the government.",
                        "vi": "Những lời chỉ trích đã bị chính phủ bác bỏ một cách nhanh chóng."
                    },
                    {
                        "en": "Rob is quick to dismiss the notion that his trip was horrific.",
                        "vi": "Rob nhanh chóng bác bỏ quan điểm rằng chuyến đi của anh ta là kinh khủng."
                    },
                    {
                        "en": "I think we can safely dismiss their objections.",
                        "vi": "Tôi nghĩ rằng chúng ta có thể bác bỏ sự phản đối của họ một cách an toàn."
                    },
                    {
                        "en": "dismiss somebody/something as something He dismissed the opinion polls as worthless.",
                        "vi": "bác bỏ ai đó / cái gì đó như một cái gì đó Anh ta bác bỏ các cuộc thăm dò ý kiến là vô giá trị."
                    },
                    {
                        "en": "His supporters dismissed the allegations as politically motivated.",
                        "vi": "Những người ủng hộ ông đã bác bỏ các cáo buộc là có động cơ chính trị."
                    },
                    {
                        "en": "Vegans are no longer dismissed as cranks.",
                        "vi": "Những người ăn chay trường không còn bị coi là những người quay cuồng nữa."
                    },
                    {
                        "en": "The suggestion should not be dismissed out of hand (= without thinking about it).",
                        "vi": "Không nên gạt bỏ gợi ý (= mà không cần suy nghĩ về nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put thoughts or feelings out of your mind",
                    "vi": "để loại bỏ những suy nghĩ hoặc cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "dismiss something Dismissing her fears, she climbed higher.",
                        "vi": "gạt bỏ điều gì đó Xua đi nỗi sợ hãi, cô leo lên cao hơn."
                    },
                    {
                        "en": "dismiss somebody/something from something He dismissed her from his mind.",
                        "vi": "loại bỏ ai đó / cái gì đó khỏi một cái gì đó Anh ấy gạt cô ấy ra khỏi tâm trí của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially remove somebody from their job",
                    "vi": "chính thức loại bỏ ai đó khỏi công việc của họ"
                },
                "examples": [
                    {
                        "en": "She claims she was unfairly dismissed from her post.",
                        "vi": "Cô ấy tuyên bố cô ấy đã bị loại khỏi bài đăng của mình một cách bất công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send somebody away or allow them to leave",
                    "vi": "để gửi ai đó đi hoặc cho phép họ rời đi"
                },
                "examples": [
                    {
                        "en": "At 12 o'clock the class was dismissed.",
                        "vi": "12 giờ cả lớp tan học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that a trial or legal case should not continue, usually because there is not enough evidence",
                    "vi": "nói rằng không nên tiếp tục một phiên tòa hoặc một vụ án pháp lý, thường là do không có đủ bằng chứng"
                },
                "examples": [
                    {
                        "en": "The judge dismissed the case for lack of evidence.",
                        "vi": "Thẩm phán đã bác bỏ vụ kiện vì thiếu bằng chứng."
                    },
                    {
                        "en": "to dismiss an appeal/application",
                        "vi": "để bác bỏ một kháng nghị / ứng dụng"
                    },
                    {
                        "en": "The court dismissed all the charges against her.",
                        "vi": "Tòa án đã bác bỏ mọi cáo buộc chống lại cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end the innings of a player or team",
                    "vi": "để kết thúc lượt chơi của một người chơi hoặc một đội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ee2ad5c33a347d491a0e5dc132e94ed",
        "word": "the unemployed",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ði ˌʌnɪmˈplɔɪd/",
            "us": "/ði ˌʌnɪmˈplɔɪd/"
        },
        "nearby": [
            {
                "word": "unemployable",
                "pos": "adjective"
            },
            {
                "word": "unemployed",
                "pos": "adjective"
            },
            {
                "word": "the unemployed",
                "pos": "noun"
            },
            {
                "word": "unemployment",
                "pos": "noun"
            },
            {
                "word": "unemployment benefit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people who do not have a job although they are able to work",
                    "vi": "những người không có việc làm mặc dù họ có thể làm việc"
                },
                "examples": [
                    {
                        "en": "a programme to get the long-term unemployed back to work",
                        "vi": "một chương trình giúp những người thất nghiệp dài hạn trở lại làm việc"
                    },
                    {
                        "en": "I've joined the ranks of the unemployed (= I've lost my job).",
                        "vi": "Tôi đã gia nhập hàng ngũ những người thất nghiệp (= Tôi đã mất việc làm)."
                    }
                ]
            }
        ]
    },
    {
        "id": "98d33f125fac4ea7b0d2834dbf9d5888",
        "word": "between jobs",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/dʒɒb/",
            "us": "/dʒɑːb/"
        },
        "nearby": [
            {
                "word": "Joanna",
                "pos": ""
            },
            {
                "word": "Joanne",
                "pos": ""
            },
            {
                "word": "job",
                "pos": "noun"
            },
            {
                "word": "Job",
                "pos": "noun"
            },
            {
                "word": "job action",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work for which you receive regular payment",
                    "vi": "làm việc mà bạn nhận được thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "I don't have a job at present.",
                        "vi": "Hiện tại tôi không có việc làm."
                    },
                    {
                        "en": "He's trying to get a job.",
                        "vi": "Anh ấy đang cố gắng kiếm một công việc."
                    },
                    {
                        "en": "I'm thinking of applying for a new job.",
                        "vi": "Tôi đang nghĩ đến việc xin một công việc mới."
                    },
                    {
                        "en": "to look for/find a job",
                        "vi": "tìm kiếm / tìm việc làm"
                    },
                    {
                        "en": "Did they offer you the job?",
                        "vi": "Họ có cung cấp cho bạn công việc không?"
                    },
                    {
                        "en": "job as something She took a job as a waitress.",
                        "vi": "job as something Cô ấy đã nhận một công việc như một nhân viên phục vụ bàn."
                    },
                    {
                        "en": "job with somebody/something She's just started a job with a travel company.",
                        "vi": "job with somebody / something Cô ấy vừa bắt đầu công việc với một công ty du lịch."
                    },
                    {
                        "en": "His brother's just lost his job.",
                        "vi": "Anh trai anh ấy vừa bị mất việc."
                    },
                    {
                        "en": "to leave/quit your job",
                        "vi": "nghỉ việc / bỏ việc của bạn"
                    },
                    {
                        "en": "Don't be late again if you want to keep your job.",
                        "vi": "Đừng đến muộn một lần nữa nếu bạn muốn tiếp tục công việc của mình."
                    },
                    {
                        "en": "a temporary/permanent job",
                        "vi": "một công việc tạm thời / lâu dài"
                    },
                    {
                        "en": "a summer/Saturday/holiday/vacation job",
                        "vi": "một công việc mùa hè / thứ bảy / ngày lễ / kỳ nghỉ"
                    },
                    {
                        "en": "Both my parents have full-time jobs.",
                        "vi": "Cả bố mẹ tôi đều có công việc toàn thời gian."
                    },
                    {
                        "en": "Many women are in part-time jobs.",
                        "vi": "Nhiều phụ nữ đang làm công việc bán thời gian."
                    },
                    {
                        "en": "She's never had a steady job (= a job that is not going to end suddenly).",
                        "vi": "Cô ấy chưa bao giờ có một công việc ổn định (= một công việc sẽ không kết thúc đột ngột)."
                    },
                    {
                        "en": "It's one of the top jobs in management.",
                        "vi": "Đó là một trong những công việc hàng đầu trong quản lý."
                    },
                    {
                        "en": "job of something one of the people under consideration for the job of managing director",
                        "vi": "công việc của một cái gì đó một trong những người đang được xem xét cho vị trí giám đốc quản lý"
                    },
                    {
                        "en": "in a job an increase in the number of people in jobs (= having jobs)",
                        "vi": "trong một công việc, số lượng người có việc làm tăng lên (= có việc làm)"
                    },
                    {
                        "en": "out of a job He's been out of a job (= unemployed) for six months now.",
                        "vi": "out of a job Anh ấy đã mất việc làm (= thất nghiệp) được sáu tháng rồi."
                    },
                    {
                        "en": "The takeover of the company is bound to mean more job losses.",
                        "vi": "Việc tiếp quản công ty chắc chắn đồng nghĩa với việc mất việc làm nhiều hơn."
                    },
                    {
                        "en": "There is so much competition in the job market currently.",
                        "vi": "Có rất nhiều cạnh tranh trong thị trường việc làm hiện nay."
                    },
                    {
                        "en": "He certainly knows his job (= is very good at his job).",
                        "vi": "Anh ấy chắc chắn biết công việc của mình (= rất giỏi trong công việc của mình)."
                    },
                    {
                        "en": "I'm only doing my job (= I'm doing what I am paid to do).",
                        "vi": "I'm only doing my job (= Tôi đang làm những gì tôi được trả tiền để làm)."
                    },
                    {
                        "en": "These projects will help create jobs in rural areas.",
                        "vi": "Các dự án này sẽ giúp tạo việc làm ở các vùng nông thôn."
                    },
                    {
                        "en": "The alternative would have been to cut jobs to contain costs.",
                        "vi": "Giải pháp thay thế là cắt giảm việc làm để giảm chi phí."
                    },
                    {
                        "en": "The closure of the factory will mean the loss of over 800 jobs.",
                        "vi": "Việc đóng cửa nhà máy sẽ đồng nghĩa với việc mất đi hơn 800 việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular task or piece of work that you have to do",
                    "vi": "một nhiệm vụ hoặc một phần công việc cụ thể mà bạn phải làm"
                },
                "examples": [
                    {
                        "en": "I've got various jobs around the house to do.",
                        "vi": "Tôi có nhiều công việc xung quanh nhà để làm."
                    },
                    {
                        "en": "Sorting these papers out is going to be a long job.",
                        "vi": "Việc sắp xếp những giấy tờ này sẽ là một công việc lâu dài."
                    },
                    {
                        "en": "The builder has a couple of jobs on at the moment.",
                        "vi": "Người xây dựng có một vài công việc vào lúc này."
                    },
                    {
                        "en": "job of doing something She's taken on the job of organizing the Christmas party.",
                        "vi": "job of doing something Cô ấy đảm nhận công việc tổ chức bữa tiệc Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a responsibility or duty",
                    "vi": "một trách nhiệm hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "He said he wouldn't do it because it wasn't his job.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không làm điều đó vì đó không phải là công việc của anh ấy."
                    },
                    {
                        "en": "somebody's job to do something It's not my job to lock up!",
                        "vi": "nhiệm vụ của ai đó để làm điều gì đó Không phải việc của tôi là nhốt!"
                    },
                    {
                        "en": "It's the job of the press to expose wrongdoing.",
                        "vi": "Đó là công việc của báo chí để vạch trần những hành vi sai trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a crime, especially stealing",
                    "vi": "một tội ác, đặc biệt là ăn cắp"
                },
                "examples": [
                    {
                        "en": "a bank job",
                        "vi": "một công việc ngân hàng"
                    },
                    {
                        "en": "He got six months for that last job he did.",
                        "vi": "Anh ấy có sáu tháng cho công việc cuối cùng mà anh ấy đã làm."
                    },
                    {
                        "en": "an inside job (= done by somebody in the organization where the crime happens)",
                        "vi": "một công việc bên trong (= được thực hiện bởi ai đó trong tổ chức nơi tội phạm xảy ra)"
                    },
                    {
                        "en": "The gang bungled the job and got caught.",
                        "vi": "Cả nhóm đã làm hỏng công việc và bị bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular kind of thing",
                    "vi": "một loại điều cụ thể"
                },
                "examples": [
                    {
                        "en": "It's real wood—not one of those plastic jobs.",
                        "vi": "Đó là gỗ thật - không phải là một trong những công việc bằng nhựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item of work that is done by a computer as a single unit",
                    "vi": "một hạng mục công việc được thực hiện bởi máy tính như một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "The job can be processed overnight.",
                        "vi": "Công việc có thể được xử lý trong một sớm một chiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to allow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để cho phép điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "unemployed for a short time. People say ‘between jobs’ to avoid saying ‘unemployed’.",
                    "vi": "thất nghiệp trong một thời gian ngắn. Người ta nói 'giữa các công việc' để tránh nói 'thất nghiệp'."
                },
                "examples": [
                    {
                        "en": "He's between jobs at the moment so he's using the time to do some voluntary work.",
                        "vi": "Hiện tại anh ấy đang bận rộn với nhiều công việc nên anh ấy đang sử dụng thời gian để làm một số công việc tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very difficult or unpleasant job or time",
                    "vi": "một công việc hoặc thời gian rất khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've had a devil of a job finding you.",
                        "vi": "Tôi đã có một công việc quỷ dữ tìm thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something well, badly, etc.",
                    "vi": "để làm điều gì đó tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "They did a very professional job.",
                        "vi": "Họ đã làm một công việc rất chuyên nghiệp."
                    },
                    {
                        "en": "You've certainly made an excellent job of the kitchen (= for example, painting it).",
                        "vi": "Bạn chắc chắn đã hoàn thành xuất sắc công việc bếp núc (= ví dụ: sơn nhà)."
                    },
                    {
                        "en": "We haven’t done a very good job on the publicity for the show.",
                        "vi": "Chúng tôi đã không làm tốt công việc quảng bá cho chương trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be effective or successful in doing what you want",
                    "vi": "để trở nên hiệu quả hoặc thành công trong việc làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "This extra strong glue should do the job.",
                        "vi": "Keo cực mạnh này sẽ thực hiện công việc."
                    },
                    {
                        "en": "Try wedging it open—that should do the job.",
                        "vi": "Hãy thử mở nó ra — điều đó sẽ thực hiện được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/yourself to lose their/your job because the role is no longer required",
                    "vi": "khiến ai đó / chính bạn mất việc của họ / của bạn vì vai trò không còn cần thiết"
                },
                "examples": [
                    {
                        "en": "Our aim as a charity is to help people so successfully that we do ourselves out of a job.",
                        "vi": "Mục đích của chúng tôi với tư cách là một tổ chức từ thiện là giúp mọi người thành công đến mức chúng tôi hoàn thành công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to stop trying to help somebody or to do something because there is no hope of success",
                    "vi": "quyết định ngừng cố gắng giúp đỡ ai đó hoặc làm điều gì đó bởi vì không có hy vọng thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they have done well at something",
                    "vi": "được sử dụng để nói với ai đó rằng họ đã làm tốt một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about a situation or that somebody is lucky that something happened",
                    "vi": "được sử dụng để nói rằng bạn hài lòng về một tình huống hoặc ai đó may mắn vì điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "It's a good job you were there to help.",
                        "vi": "Đó là một công việc tốt bạn đã ở đó để giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "people use the expression jobs for the boys when they are criticizing the fact that somebody in power has given work to friends or relatives",
                    "vi": "mọi người sử dụng các công việc biểu đạt cho các cậu bé khi họ đang chỉ trích việc ai đó nắm quyền đã giao việc cho bạn bè hoặc người thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "exactly what is needed in a particular situation",
                    "vi": "chính xác những gì cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "That cup of tea was just the job.",
                        "vi": "Đó là một tách trà chỉ là công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept a bad or difficult situation and do as well as you can",
                    "vi": "chấp nhận một tình huống xấu hoặc khó khăn và làm tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not worth doing because it is against the rules or because it might cause you to lose your job",
                    "vi": "không đáng làm vì nó trái với quy tắc hoặc vì nó có thể khiến bạn mất việc"
                },
                "examples": [
                    {
                        "en": "It's more than my job's worth to let you in without a ticket.",
                        "vi": "Công việc của tôi còn hơn cả việc để bạn vào mà không cần vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a particular job",
                    "vi": "trong khi làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "No sleeping on the job!",
                        "vi": "Không ngủ trong công việc!"
                    },
                    {
                        "en": "on-the-job training",
                        "vi": "vào đào tạo nghề"
                    }
                ]
            },
            {
                "define": {
                    "en": "having sex",
                    "vi": "quan hệ tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop working in order to go on strike",
                    "vi": "ngừng làm việc để đình công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "87241370c38447efac5a6cefd266236d",
        "word": "cutback",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkʌtbæk/",
            "us": "/ˈkʌtbæk/"
        },
        "nearby": [
            {
                "word": "cutaway",
                "pos": "noun"
            },
            {
                "word": "cut back",
                "pos": "phrasal verb"
            },
            {
                "word": "cutback",
                "pos": "noun"
            },
            {
                "word": "cut down",
                "pos": "phrasal verb"
            },
            {
                "word": "cut-down",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a reduction in something",
                    "vi": "giảm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Schools and hospitals will need to be prepared for sharp cutbacks in public spending.",
                        "vi": "Các trường học và bệnh viện sẽ cần phải chuẩn bị cho việc cắt giảm mạnh chi tiêu công."
                    },
                    {
                        "en": "There have been substantial staff cutbacks in order to save money.",
                        "vi": "Đã có sự cắt giảm đáng kể nhân viên để tiết kiệm tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "29eab8dfe85e442fae5957c9a0c049ca",
        "word": "jobcentre",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒɒbsentə(r)/",
            "us": "/ˈdʒɑːbsentər/"
        },
        "nearby": [
            {
                "word": "jobbie",
                "pos": "noun"
            },
            {
                "word": "jobbing",
                "pos": "adjective"
            },
            {
                "word": "jobcentre",
                "pos": "noun"
            },
            {
                "word": "Jobcentre Plus",
                "pos": "noun"
            },
            {
                "word": "job creation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a government office where people can get advice in finding work and where jobs are advertised",
                    "vi": "văn phòng chính phủ nơi mọi người có thể nhận được lời khuyên trong việc tìm việc và nơi quảng cáo việc làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a4feb558ddb4bb39e8c79f5ac164477",
        "word": "jobless",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒɒbləs/",
            "us": "/ˈdʒɑːbləs/"
        },
        "nearby": [
            {
                "word": "job description",
                "pos": "noun"
            },
            {
                "word": "job-hunt",
                "pos": "verb"
            },
            {
                "word": "jobless",
                "pos": "adjective"
            },
            {
                "word": "joblessness",
                "pos": "noun"
            },
            {
                "word": "job lot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a job",
                    "vi": "không có việc làm"
                },
                "examples": [
                    {
                        "en": "The closure left 500 people jobless.",
                        "vi": "Việc đóng cửa khiến 500 người mất việc làm."
                    },
                    {
                        "en": "The company has plans to make more people jobless.",
                        "vi": "Công ty có kế hoạch khiến nhiều người thất nghiệp hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are unemployed",
                    "vi": "những người thất nghiệp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "210683f72088431eb410f689f0f05648",
        "word": "jobseeker",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒɒbsiːkə(r)/",
            "us": "/ˈdʒɑːbsiːkər/"
        },
        "nearby": [
            {
                "word": "job satisfaction",
                "pos": "noun"
            },
            {
                "word": "job security",
                "pos": "noun"
            },
            {
                "word": "jobseeker",
                "pos": "noun"
            },
            {
                "word": "Jobseeker's Allowance",
                "pos": "noun"
            },
            {
                "word": "job-share",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "often used in official language in the UK to describe a person without a job who is trying to find one",
                    "vi": "thường được sử dụng trong ngôn ngữ chính thức ở Vương quốc Anh để mô tả một người không có việc làm đang cố gắng tìm kiếm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "95a7c50226234989a04b72d1cf051d3f",
        "word": "out-of-work",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌaʊt əv ˈwɜːk/",
            "us": "/ˌaʊt əv ˈwɜːrk/"
        },
        "nearby": [
            {
                "word": "out-of-the-way",
                "pos": "adjective"
            },
            {
                "word": "out-of-town",
                "pos": "adjective"
            },
            {
                "word": "out-of-work",
                "pos": "adjective"
            },
            {
                "word": "outpace",
                "pos": "verb"
            },
            {
                "word": "outpatient",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unemployed",
                    "vi": "thất nghiệp"
                },
                "examples": [
                    {
                        "en": "an out-of-work actor",
                        "vi": "một diễn viên không làm việc"
                    }
                ]
            }
        ]
    },
    {
        "id": "dc456e6dce414216ab41a3b3283ef59b",
        "word": "redundancy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈdʌndənsi/",
            "us": "/rɪˈdʌndənsi/"
        },
        "nearby": [
            {
                "word": "reductionist",
                "pos": "adjective"
            },
            {
                "word": "reductive",
                "pos": "adjective"
            },
            {
                "word": "redundancy",
                "pos": "noun"
            },
            {
                "word": "redundant",
                "pos": "adjective"
            },
            {
                "word": "redundantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the situation when somebody has to leave their job because there is no more work available for them",
                    "vi": "tình huống khi ai đó phải nghỉ việc vì không còn việc làm nữa"
                },
                "examples": [
                    {
                        "en": "Thousands of factory workers are facing redundancy.",
                        "vi": "Hàng nghìn công nhân của nhà máy đang phải đối mặt với tình trạng dư thừa."
                    },
                    {
                        "en": "to accept/take voluntary redundancy (= to offer to leave your job)",
                        "vi": "chấp nhận / tự nguyện nghỉ việc (= đề nghị nghỉ việc)"
                    },
                    {
                        "en": "the threat of compulsory redundancies",
                        "vi": "mối đe dọa của sự dư thừa bắt buộc"
                    },
                    {
                        "en": "All members of staff are entitled to redundancy payments.",
                        "vi": "Tất cả các thành viên của nhân viên được hưởng các khoản thanh toán dư thừa."
                    },
                    {
                        "en": "200 workers have been issued with redundancy notices.",
                        "vi": "200 công nhân đã được thông báo dư thừa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not being necessary or useful",
                    "vi": "tình trạng không cần thiết hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "Natural language is characterized by redundancy (= words are used that are not really necessary for somebody to understand the meaning).",
                        "vi": "Ngôn ngữ tự nhiên có đặc điểm là dư thừa (= các từ được sử dụng không thực sự cần thiết để ai đó hiểu nghĩa)."
                    }
                ]
            }
        ]
    },
    {
        "id": "df4ab73a3e46484e97265b168153abe6",
        "word": "redundant",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈdʌndənt/",
            "us": "/rɪˈdʌndənt/"
        },
        "nearby": [
            {
                "word": "reductive",
                "pos": "adjective"
            },
            {
                "word": "redundancy",
                "pos": "noun"
            },
            {
                "word": "redundant",
                "pos": "adjective"
            },
            {
                "word": "redundantly",
                "pos": "adverb"
            },
            {
                "word": "reduplicate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a job because there is no more work available for you in a company",
                    "vi": "không có việc làm vì không còn việc làm cho bạn trong một công ty"
                },
                "examples": [
                    {
                        "en": "to be made redundant from your job",
                        "vi": "được làm thừa từ công việc của bạn"
                    },
                    {
                        "en": "redundant employees",
                        "vi": "nhân viên dôi dư"
                    }
                ]
            },
            {
                "define": {
                    "en": "not needed or useful",
                    "vi": "không cần thiết hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "The picture has too much redundant detail.",
                        "vi": "Hình ảnh có quá nhiều chi tiết thừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "cabc98ebe2df4fb8ae7402b3bcde4683",
        "word": "sack",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/sæk/",
            "us": "/sæk/"
        },
        "nearby": [
            {
                "word": "sacerdotal",
                "pos": "adjective"
            },
            {
                "word": "sachet",
                "pos": "noun"
            },
            {
                "word": "sack",
                "pos": "verb"
            },
            {
                "word": "sack",
                "pos": "noun"
            },
            {
                "word": "sackbut",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dismiss somebody from a job",
                    "vi": "sa thải ai đó khỏi công việc"
                },
                "examples": [
                    {
                        "en": "She was sacked for refusing to work on Sundays.",
                        "vi": "Cô đã bị sa thải vì từ chối làm việc vào Chủ nhật."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of an army, etc., especially in the past) to destroy things and steal property in a town or building",
                    "vi": "(của một đội quân, v.v., đặc biệt là trong quá khứ) để phá hủy mọi thứ và đánh cắp tài sản trong một thị trấn hoặc tòa nhà"
                },
                "examples": [
                    {
                        "en": "Rome was sacked by the Goths in 410.",
                        "vi": "Rome bị người Goth cướp phá vào năm 410."
                    },
                    {
                        "en": "The army rebelled and sacked the palace.",
                        "vi": "Quân đội nổi loạn và cướp phá cung điện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to knock down the quarterback",
                    "vi": "hạ gục tiền vệ"
                },
                "examples": [
                    {
                        "en": "The quarterback was sacked on the 45 yard line, and it was first down for the other team.",
                        "vi": "Tiền vệ này đã bị sa thải ở vạch 45 yard, và nó lần đầu tiên bị sa thải cho đội khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "4a21dfd2c52f451aad10929154250a85",
        "word": "sacking",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsækɪŋ/",
            "us": "/ˈsækɪŋ/"
        },
        "nearby": [
            {
                "word": "sackcloth",
                "pos": "noun"
            },
            {
                "word": "sackful",
                "pos": "noun"
            },
            {
                "word": "sacking",
                "pos": "noun"
            },
            {
                "word": "sack it off",
                "pos": "phrasal verb"
            },
            {
                "word": "sack off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of sacking somebody (= dismissing them from their job)",
                    "vi": "một hành động sa thải ai đó (= sa thải họ khỏi công việc của họ)"
                },
                "examples": [
                    {
                        "en": "A council chief faced calls for his sacking yesterday over allegations that he had accepted bribes.",
                        "vi": "Một trưởng hội đồng đã phải đối mặt với những lời kêu gọi sa thải ông vào ngày hôm qua vì những cáo buộc rằng ông đã nhận hối lộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of rough cloth made from jute, etc., used for making sacks",
                    "vi": "một loại vải thô làm từ sợi đay, v.v., dùng để làm bao tải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d94237e492b34293bc83c4b821964b99",
        "word": "dole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dəʊl/",
            "us": "/dəʊl/"
        },
        "nearby": [
            {
                "word": "dolce",
                "pos": "adverb, adjective"
            },
            {
                "word": "doldrums",
                "pos": "noun"
            },
            {
                "word": "dole",
                "pos": "noun"
            },
            {
                "word": "dole",
                "pos": "verb"
            },
            {
                "word": "doleful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money paid by the state to unemployed people",
                    "vi": "tiền nhà nước trả cho người thất nghiệp"
                },
                "examples": [
                    {
                        "en": "on the dole He's been on the dole (= without a job) for a year.",
                        "vi": "trên dole Anh ấy đã làm việc dole (= không có việc làm) được một năm."
                    },
                    {
                        "en": "The changes will affect about 80 per cent of those receiving the dole.",
                        "vi": "Những thay đổi sẽ ảnh hưởng đến khoảng 80% những người nhận dole."
                    },
                    {
                        "en": "There have been calls to increase dole payments.",
                        "vi": "Đã có những cuộc gọi để tăng các khoản thanh toán dole."
                    },
                    {
                        "en": "We could all be in the dole queue on Monday (= have lost our jobs).",
                        "vi": "Tất cả chúng tôi đều có thể ở trong hàng đợi dole vào thứ Hai (= đã mất việc làm)."
                    }
                ]
            }
        ]
    },
    {
        "id": "05663b0363664e55a4ab004e94aef232",
        "word": "lay-off",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleɪ ɒf/",
            "us": "/ˈleɪ ɔːf/"
        },
        "nearby": [
            {
                "word": "layman",
                "pos": "noun"
            },
            {
                "word": "lay off",
                "pos": "phrasal verb"
            },
            {
                "word": "lay-off",
                "pos": "noun"
            },
            {
                "word": "lay on",
                "pos": "phrasal verb"
            },
            {
                "word": "lay out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of making people unemployed because there is no more work left for them to do",
                    "vi": "một hành động khiến mọi người thất nghiệp vì không còn việc làm nữa"
                },
                "examples": [
                    {
                        "en": "lay-offs in the factory",
                        "vi": "sa thải trong nhà máy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time when somebody is not working or not doing something that they normally do regularly",
                    "vi": "một khoảng thời gian mà ai đó không làm việc hoặc không làm điều gì đó mà họ thường làm"
                },
                "examples": [
                    {
                        "en": "an eight-week lay-off with a broken leg",
                        "vi": "sa thải tám tuần với một cái chân bị gãy"
                    }
                ]
            }
        ]
    },
    {
        "id": "c152e3171270484fb04e3223a1c9725b",
        "word": "lay off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "Layla",
                "pos": ""
            },
            {
                "word": "layman",
                "pos": "noun"
            },
            {
                "word": "lay off",
                "pos": "phrasal verb"
            },
            {
                "word": "lay-off",
                "pos": "noun"
            },
            {
                "word": "lay on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to tell somebody to stop doing something",
                    "vi": "được sử dụng để nói với ai đó ngừng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Lay off me will you—it's nothing to do with me.",
                        "vi": "Hãy từ bỏ tôi đi - không liên quan gì đến tôi."
                    },
                    {
                        "en": "lay off doing something Lay off bullying Jack.",
                        "vi": "sa thải làm điều gì đó Hãy thôi bắt nạt Jack."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop using something",
                    "vi": "ngừng sử dụng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "I think you'd better lay off fatty foods for a while.",
                        "vi": "Tôi nghĩ tốt hơn là bạn nên bỏ thức ăn béo một thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop employing somebody because there is not enough work for them to do",
                    "vi": "ngừng tuyển dụng ai đó vì không có đủ công việc để họ làm"
                },
                "examples": [
                    {
                        "en": "200 workers at the factory have been laid off.",
                        "vi": "200 công nhân tại nhà máy đã bị sa thải."
                    }
                ]
            }
        ]
    },
    {
        "id": "9dba198434e44f79bcf926b96afc3dd2",
        "word": "let somebody go",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/let/",
            "us": "/let/"
        },
        "nearby": [
            {
                "word": "lest",
                "pos": "conjunction"
            },
            {
                "word": "Lester",
                "pos": ""
            },
            {
                "word": "let",
                "pos": "verb"
            },
            {
                "word": "-let",
                "pos": "suffix"
            },
            {
                "word": "let",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used for making suggestions or as a polite way of telling people what you want them to do",
                    "vi": "được sử dụng để đưa ra đề xuất hoặc như một cách lịch sự để nói với mọi người những gì bạn muốn họ làm"
                },
                "examples": [
                    {
                        "en": "‘Shall we check it again?’ ‘Yes, let's.’",
                        "vi": "Chúng ta kiểm tra lại nhé?' \"Vâng, chúng ta hãy.\""
                    },
                    {
                        "en": "let's do something Let's go to the beach.",
                        "vi": "chúng ta hãy làm điều gì đó Hãy đi đến bãi biển."
                    },
                    {
                        "en": "Right, let's begin.",
                        "vi": "Được rồi, hãy bắt đầu."
                    },
                    {
                        "en": "(formal) Let us review these points in more detail.",
                        "vi": "(chính thức) Hãy để chúng tôi xem xét những điểm này chi tiết hơn."
                    },
                    {
                        "en": "Let's not tell her what we did.",
                        "vi": "Đừng nói với cô ấy những gì chúng ta đã làm."
                    },
                    {
                        "en": "(British English) Don't let's tell her what we did.",
                        "vi": "(Anh Anh) Đừng nói với cô ấy những gì chúng ta đã làm."
                    },
                    {
                        "en": "Now let's not be silly about this.",
                        "vi": "Bây giờ chúng ta đừng ngớ ngẩn về điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for offering help to somebody",
                    "vi": "được sử dụng để đề nghị giúp đỡ ai đó"
                },
                "examples": [
                    {
                        "en": "Let me help you with that.",
                        "vi": "Hãy để tôi giúp bạn điều đó."
                    },
                    {
                        "en": "Here, let me do it.",
                        "vi": "Đây, hãy để tôi làm điều đó."
                    },
                    {
                        "en": "Let us get those boxes down for you.",
                        "vi": "Hãy để chúng tôi lấy những chiếc hộp đó cho bạn."
                    },
                    {
                        "en": "'Please, let me,' she said, opening the door.",
                        "vi": "Làm ơn, để tôi, cô ấy nói, mở cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for making requests or giving instructions",
                    "vi": "được sử dụng để đưa ra yêu cầu hoặc đưa ra hướng dẫn"
                },
                "examples": [
                    {
                        "en": "Let me have your report by Friday.",
                        "vi": "Hãy để tôi có báo cáo của bạn trước thứ sáu."
                    },
                    {
                        "en": "Let me know (= tell me) how I can help.",
                        "vi": "Hãy cho tôi biết (= cho tôi biết) tôi có thể giúp gì."
                    },
                    {
                        "en": "Please let us know your decision as soon as possible.",
                        "vi": "Hãy cho chúng tôi biết quyết định của bạn càng sớm càng tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to do something or something to happen without trying to stop it",
                    "vi": "cho phép ai đó làm điều gì đó hoặc điều gì đó sẽ xảy ra mà không cố gắng ngăn chặn nó"
                },
                "examples": [
                    {
                        "en": "let somebody/something do something Let them splash around in the pool for a while.",
                        "vi": "hãy để ai đó / điều gì đó làm điều gì đó Hãy để họ tung tăng trong hồ bơi một lúc."
                    },
                    {
                        "en": "Don't let her upset you.",
                        "vi": "Đừng để cô ấy làm bạn khó chịu."
                    },
                    {
                        "en": "Let your body relax.",
                        "vi": "Hãy để cơ thể bạn được thư giãn."
                    },
                    {
                        "en": "I'll let others decide whether the play was a success or not.",
                        "vi": "Tôi sẽ để người khác quyết định xem vở kịch có thành công hay không."
                    },
                    {
                        "en": "Will you let me finish?",
                        "vi": "Bạn sẽ để tôi nói hết chứ?"
                    },
                    {
                        "en": "let somebody/something He'd eat chocolate all day long if I let him.",
                        "vi": "để ai đó / cái gì đó Anh ấy sẽ ăn sô cô la cả ngày nếu tôi để anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody permission to do something",
                    "vi": "cho phép ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "let somebody/something do something They won't let him leave the country.",
                        "vi": "để ai đó / điều gì đó làm điều gì đó Họ sẽ không để anh ta rời khỏi đất nước."
                    },
                    {
                        "en": "In some countries they let you drive at 15.",
                        "vi": "Ở một số quốc gia, họ cho phép bạn lái xe lúc 15 tuổi."
                    },
                    {
                        "en": "They refused to let us cross the border.",
                        "vi": "Họ từ chối cho chúng tôi qua biên giới."
                    },
                    {
                        "en": "let somebody/something I wanted to go but my parents wouldn't let me.",
                        "vi": "để ai đó / điều gì đó tôi muốn đi nhưng bố mẹ tôi không cho phép."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody/something to go somewhere",
                    "vi": "để cho phép ai đó / cái gì đó đi đâu đó"
                },
                "examples": [
                    {
                        "en": "to let somebody into the house",
                        "vi": "để ai đó vào nhà"
                    },
                    {
                        "en": "This lets more water into the soil.",
                        "vi": "Điều này cho phép nhiều nước hơn vào đất."
                    },
                    {
                        "en": "I'll give you a key so that you can let yourself in.",
                        "vi": "Tôi sẽ cung cấp cho bạn một chìa khóa để bạn có thể tự vào."
                    },
                    {
                        "en": "The hall will be able to let in more spectators.",
                        "vi": "Hội trường sẽ có thể đón nhiều khán giả hơn."
                    },
                    {
                        "en": "Please let me past.",
                        "vi": "Xin hãy để tôi quá khứ."
                    },
                    {
                        "en": "The cat wants to be let out.",
                        "vi": "Con mèo muốn được thả ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are not afraid or worried about somebody doing something",
                    "vi": "được sử dụng để thể hiện rằng bạn không sợ hãi hoặc lo lắng về việc ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "If he thinks he can cheat me, just let him try!",
                        "vi": "Nếu anh ta nghĩ rằng anh ta có thể lừa dối tôi, hãy để anh ta thử!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express a strong wish for something to happen",
                    "vi": "được sử dụng để bày tỏ một mong muốn mạnh mẽ cho một điều gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Let her come home safely!",
                        "vi": "Hãy để cô ấy về nhà an toàn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce what you are going to say or do",
                    "vi": "được sử dụng để giới thiệu những gì bạn sẽ nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "Let me give you an example.",
                        "vi": "Tôi sẽ cho bạn một ví dụ."
                    },
                    {
                        "en": "Let me just finish this and then I'll come.",
                        "vi": "Hãy để tôi hoàn thành việc này và sau đó tôi sẽ đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are supposing something to be true when you calculate something",
                    "vi": "được sử dụng để nói rằng bạn đang cho rằng một cái gì đó là đúng khi bạn tính toán một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Let line AB be equal to line CD.",
                        "vi": "Cho đoạn thẳng AB bằng đoạn thẳng CD."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to use a house, room, etc. in return for regular payments",
                    "vi": "để cho phép ai đó sử dụng nhà, phòng, v.v. để đổi lại các khoản thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "I let the spare room.",
                        "vi": "Tôi để phòng phụ."
                    },
                    {
                        "en": "They decided to let out the smaller offices at low rents.",
                        "vi": "Họ quyết định cho thuê các văn phòng nhỏ hơn với giá thuê thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop trying to change the behaviour or state of somebody/something",
                    "vi": "ngừng cố gắng thay đổi hành vi hoặc trạng thái của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I know I'm being grumpy, but I'm really tired so just let me be.",
                        "vi": "Tôi biết tôi đang cáu kỉnh, nhưng tôi thực sự mệt mỏi nên hãy để tôi được như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention something in a conversation, by accident or as if by accident",
                    "vi": "đề cập đến điều gì đó trong một cuộc trò chuyện, một cách tình cờ hoặc như một cách tình cờ"
                },
                "examples": [
                    {
                        "en": "She let fall a further heavy hint.",
                        "vi": "Cô ấy đưa ra một gợi ý nặng nề hơn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to be free",
                    "vi": "để cho phép ai đó được tự do"
                },
                "examples": [
                    {
                        "en": "Will they let the hostages go?",
                        "vi": "Liệu họ có để các con tin đi không?"
                    },
                    {
                        "en": "He's finally been let go.",
                        "vi": "Cuối cùng thì anh ấy cũng được cho đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody have to leave their job",
                    "vi": "khiến ai đó phải rời bỏ công việc của họ"
                },
                "examples": [
                    {
                        "en": "They're having to let 100 employees go because of falling profits.",
                        "vi": "Họ đang phải cho 100 nhân viên ra đi vì lợi nhuận giảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding somebody/something",
                    "vi": "ngừng giữ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Don't let the rope go.",
                        "vi": "Đừng để tuột dây."
                    },
                    {
                        "en": "Don't let go of the rope.",
                        "vi": "Đừng buông dây."
                    },
                    {
                        "en": "Let go! You're hurting me!",
                        "vi": "Đi thôi! Bạn đang làm tổn thương tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give up an idea or an attitude, or control of something",
                    "vi": "từ bỏ một ý tưởng hoặc một thái độ, hoặc kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It's time to let the past go.",
                        "vi": "Đã đến lúc để quá khứ trôi qua."
                    },
                    {
                        "en": "It's time to let go of the past.",
                        "vi": "Đã đến lúc buông bỏ quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop taking care of a house, garden, etc.",
                    "vi": "ngừng chăm sóc nhà cửa, khu vườn, v.v."
                },
                "examples": [
                    {
                        "en": "I'm afraid I've let the garden go this year.",
                        "vi": "Tôi e rằng tôi đã để vườn mất năm nay."
                    },
                    {
                        "en": "Let the house go in order to spend time with the kids.",
                        "vi": "Hãy để nhà đi để dành thời gian cho bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attack somebody physically or with words",
                    "vi": "tấn công ai đó bằng vật chất hoặc bằng lời nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say or do no more about something",
                    "vi": "để nói hoặc không làm gì thêm về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I don't entirely agree, but I'll let it go at that.",
                        "vi": "Tôi không hoàn toàn đồng ý, nhưng tôi sẽ cho qua."
                    },
                    {
                        "en": "I thought she was hinting at something, but I let it go.",
                        "vi": "Tôi nghĩ cô ấy đang ám chỉ điều gì đó, nhưng tôi đã bỏ qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are thinking or trying to remember something",
                    "vi": "được sử dụng khi bạn đang suy nghĩ hoặc cố gắng nhớ điều gì đó"
                },
                "examples": [
                    {
                        "en": "Now let me see—where did he say he lived?",
                        "vi": "Bây giờ hãy để tôi xem - anh ấy nói anh ấy sống ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when commenting on a situation to suggest that you could say something more or worse but prefer not to",
                    "vi": "được sử dụng khi nhận xét về một tình huống để gợi ý rằng bạn có thể nói điều gì đó nhiều hơn hoặc tệ hơn nhưng không muốn"
                },
                "examples": [
                    {
                        "en": "Let's just say he wasn't very happy about the decision (= he was very unhappy or angry about it).",
                        "vi": "Hãy chỉ nói rằng anh ấy không hài lòng lắm về quyết định này (= anh ấy rất không hài lòng hoặc tức giận về điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when making a suggestion or giving an example",
                    "vi": "được sử dụng khi đưa ra đề xuất hoặc đưa ra ví dụ"
                },
                "examples": [
                    {
                        "en": "I can let you have it for, well let's say £100.",
                        "vi": "Tôi có thể để bạn có nó, giả sử là 100 bảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a relaxed way without worrying about what people think of your behaviour",
                    "vi": "cư xử một cách thoải mái mà không lo lắng về những gì mọi người nghĩ về hành vi của bạn"
                },
                "examples": [
                    {
                        "en": "Come on, enjoy yourself, let yourself go!",
                        "vi": "Nào, hãy tận hưởng bản thân, hãy để bản thân đi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop being careful about how you look and dress, etc.",
                    "vi": "ngừng cẩn thận về cách bạn trông và ăn mặc, v.v."
                },
                "examples": [
                    {
                        "en": "He has let himself go since he lost his job.",
                        "vi": "Anh ấy đã thả mình ra ngoài kể từ khi anh ấy bị mất việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "available for rent",
                    "vi": "có sẵn cho thuê"
                },
                "examples": [
                    {
                        "en": "The website advertises flats to let in the local area.",
                        "vi": "Trang web quảng cáo căn hộ để cho phép trong khu vực địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "0506a43ea4e94533badde83c39bda105",
        "word": "retrench",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈtrentʃ/",
            "us": "/rɪˈtrentʃ/"
        },
        "nearby": [
            {
                "word": "retreat",
                "pos": "noun"
            },
            {
                "word": "retreat",
                "pos": "verb"
            },
            {
                "word": "retrench",
                "pos": "verb"
            },
            {
                "word": "retrenchment",
                "pos": "noun"
            },
            {
                "word": "retrial",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spend less money; to reduce costs",
                    "vi": "để tiêu ít tiền hơn; để giảm chi phí"
                },
                "examples": [
                    {
                        "en": "The Board of Directors realized the need to retrench in the face of falling demand.",
                        "vi": "Ban Giám đốc nhận thấy sự cần thiết phải rút lui trước nhu cầu giảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody that they cannot continue working for you",
                    "vi": "nói với ai đó rằng họ không thể tiếp tục làm việc cho bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c427fee57d964d0eb302714a3f6fe957",
        "word": "sign on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "sign-off",
                "pos": "noun"
            },
            {
                "word": "sign off on",
                "pos": "phrasal verb"
            },
            {
                "word": "sign on",
                "pos": "phrasal verb"
            },
            {
                "word": "sign out",
                "pos": "phrasal verb"
            },
            {
                "word": "sign over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to sign a form stating that you are an unemployed person so that you can receive payment from the government",
                    "vi": "để ký vào một biểu mẫu nói rằng bạn là một người thất nghiệp để bạn có thể nhận được khoản thanh toán từ chính phủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to sign a form or contract which says that you agree to do a job or become a soldier; to persuade somebody to sign a form or contract like this",
                    "vi": "để ký một mẫu đơn hoặc hợp đồng nói rằng bạn đồng ý làm một công việc hoặc trở thành một người lính; thuyết phục ai đó ký một biểu mẫu hoặc hợp đồng như thế này"
                },
                "examples": [
                    {
                        "en": "He signed on for five years in the army.",
                        "vi": "Anh ấy đã ký hợp đồng trong 5 năm trong quân đội."
                    },
                    {
                        "en": "The company has signed up three top models for the fashion show.",
                        "vi": "Công ty đã đăng ký ba người mẫu hàng đầu cho buổi trình diễn thời trang."
                    }
                ]
            }
        ]
    }
]