[
    {
        "id": "5d096d4b35e44731a03c04d7067b2c57",
        "word": "design",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dɪˈzaɪn/",
            "us": "/dɪˈzaɪn/"
        },
        "nearby": [
            {
                "word": "desiccation",
                "pos": "noun"
            },
            {
                "word": "desideratum",
                "pos": "noun"
            },
            {
                "word": "design",
                "pos": "noun"
            },
            {
                "word": "design",
                "pos": "verb"
            },
            {
                "word": "designate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the general arrangement of the different parts of something that is made, such as a building, book, machine, etc.",
                    "vi": "sự sắp xếp chung của các bộ phận khác nhau của một cái gì đó được tạo ra, chẳng hạn như một tòa nhà, cuốn sách, máy móc, v.v."
                },
                "examples": [
                    {
                        "en": "The basic design of the car is very similar to that of earlier models.",
                        "vi": "Thiết kế cơ bản của xe rất giống với các mẫu xe trước đó."
                    },
                    {
                        "en": "special new design features",
                        "vi": "các tính năng thiết kế mới đặc biệt"
                    },
                    {
                        "en": "The system has a fundamental design flaw.",
                        "vi": "Hệ thống có một lỗ hổng thiết kế cơ bản."
                    },
                    {
                        "en": "The steel frame is left visible and is part of the overall design concept.",
                        "vi": "Khung thép có thể nhìn thấy được và là một phần của ý tưởng thiết kế tổng thể."
                    },
                    {
                        "en": "The magazine will appear in a new design from next month.",
                        "vi": "Tạp chí sẽ xuất hiện trong một thiết kế mới từ tháng tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the art or process of deciding how something will look, work, etc. by drawing plans, making computer models, etc.",
                    "vi": "nghệ thuật hoặc quá trình quyết định một thứ gì đó sẽ trông như thế nào, hoạt động như thế nào, v.v. bằng cách vẽ sơ đồ, tạo mô hình máy tính, v.v."
                },
                "examples": [
                    {
                        "en": "the design and development of new products",
                        "vi": "thiết kế và phát triển các sản phẩm mới"
                    },
                    {
                        "en": "I'm doing a course in art and design.",
                        "vi": "Tôi đang tham gia một khóa học về nghệ thuật và thiết kế."
                    },
                    {
                        "en": "web/set/product design",
                        "vi": "thiết kế web / bộ / sản phẩm"
                    },
                    {
                        "en": "a specialist in computer-aided design",
                        "vi": "một chuyên gia trong thiết kế có sự hỗ trợ của máy tính"
                    },
                    {
                        "en": "a design studio",
                        "vi": "một xưởng thiết kế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a drawing or plan from which something may be made",
                    "vi": "một bản vẽ hoặc kế hoạch mà từ đó một cái gì đó có thể được thực hiện"
                },
                "examples": [
                    {
                        "en": "He has created some new and original designs.",
                        "vi": "Anh ấy đã tạo ra một số thiết kế mới và độc đáo."
                    },
                    {
                        "en": "design for something designs for aircraft",
                        "vi": "thiết kế cho một cái gì đó thiết kế cho máy bay"
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement of lines and shapes as a decoration",
                    "vi": "sự sắp xếp các đường nét và hình dạng như một vật trang trí"
                },
                "examples": [
                    {
                        "en": "floral/abstract/geometric designs",
                        "vi": "thiết kế hoa / trừu tượng / hình học"
                    },
                    {
                        "en": "The tiles come in a huge range of colours and designs.",
                        "vi": "Gạch có rất nhiều màu sắc và kiểu dáng."
                    },
                    {
                        "en": "The building has intricate geometric designs on several of the walls.",
                        "vi": "Tòa nhà có thiết kế hình học phức tạp trên một số bức tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a plan or an intention",
                    "vi": "một kế hoạch hoặc một ý định"
                },
                "examples": [
                    {
                        "en": "It happened—whether by accident or design—that the two of them were left alone after all the others had gone.",
                        "vi": "Nó đã xảy ra - dù là do tình cờ hay do thiết kế - rằng hai người họ chỉ còn lại một mình sau khi tất cả những người khác đã đi hết."
                    },
                    {
                        "en": "It is all part of his grand design.",
                        "vi": "Tất cả đều là một phần trong thiết kế hoành tráng của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want to start a sexual relationship with somebody",
                    "vi": "muốn bắt đầu một mối quan hệ tình dục với ai đó"
                },
                "examples": [
                    {
                        "en": "He was quite aware of her marital designs on him.",
                        "vi": "Anh khá để ý đến những thiết kế hôn nhân của cô trên người anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be planning to get something for yourself, often in a way that other people do not approve of",
                    "vi": "lên kế hoạch để có được một cái gì đó cho chính mình, thường theo cách mà người khác không chấp thuận"
                },
                "examples": [
                    {
                        "en": "Rumours spread that the Duke had designs on the crown (= wanted to make himself king).",
                        "vi": "Tin đồn lan truyền rằng Công tước có thiết kế trên vương miện (= muốn tự mình trở thành vua)."
                    }
                ]
            }
        ]
    },
    {
        "id": "76bacebe14384880affe975b2e2d3a91",
        "word": "background",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbækɡraʊnd/",
            "us": "/ˈbækɡraʊnd/"
        },
        "nearby": [
            {
                "word": "back-formation",
                "pos": "noun"
            },
            {
                "word": "backgammon",
                "pos": "noun"
            },
            {
                "word": "background",
                "pos": "noun"
            },
            {
                "word": "backhand",
                "pos": "noun"
            },
            {
                "word": "backhanded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the details of a person’s family, education, experience, etc.",
                    "vi": "thông tin chi tiết về gia đình, học vấn, kinh nghiệm của một người, v.v."
                },
                "examples": [
                    {
                        "en": "somebody's ethnic/genetic/cultural background",
                        "vi": "nền tảng dân tộc / di truyền / văn hóa của ai đó"
                    },
                    {
                        "en": "somebody's family/educational background",
                        "vi": "gia đình / nền tảng giáo dục của ai đó"
                    },
                    {
                        "en": "The job would suit someone with a business background.",
                        "vi": "Công việc sẽ phù hợp với những người có nền tảng kinh doanh."
                    },
                    {
                        "en": "We come from very different backgrounds but we get on well.",
                        "vi": "Chúng tôi đến từ những hoàn cảnh rất khác nhau nhưng chúng tôi hòa hợp với nhau."
                    },
                    {
                        "en": "background in something She has a background in journalism.",
                        "vi": "background in something Cô ấy có kiến thức về báo chí."
                    },
                    {
                        "en": "In the future, we will require background checks on airport employees.",
                        "vi": "Trong tương lai, chúng tôi sẽ yêu cầu kiểm tra lý lịch đối với nhân viên sân bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the circumstances or past events that help explain why something is how it is; information about these",
                    "vi": "hoàn cảnh hoặc sự kiện trong quá khứ giúp giải thích tại sao một cái gì đó lại như thế nào; thông tin về những"
                },
                "examples": [
                    {
                        "en": "I'm including a little background information on the situation.",
                        "vi": "Tôi đang cung cấp một chút thông tin cơ bản về tình hình."
                    },
                    {
                        "en": "background to something The book explains the complex historical background to the war.",
                        "vi": "background to something Cuốn sách giải thích bối cảnh lịch sử phức tạp của cuộc chiến."
                    },
                    {
                        "en": "against a background of something The elections are taking place against a background of violence.",
                        "vi": "chống lại bối cảnh của một cái gì đó Các cuộc bầu cử đang diễn ra trên nền của bạo lực."
                    },
                    {
                        "en": "background on something Our reporter can now provide more background on this story.",
                        "vi": "thông tin cơ bản về điều gì đó Phóng viên của chúng tôi hiện có thể cung cấp thêm thông tin cơ bản về câu chuyện này."
                    },
                    {
                        "en": "Can you give me more background on the company?",
                        "vi": "Bạn có thể cho tôi biết thêm thông tin về công ty được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a picture, photograph or view behind the main objects, people, etc.",
                    "vi": "phần của một bức tranh, ảnh chụp hoặc khung cảnh phía sau các đối tượng chính, con người, v.v."
                },
                "examples": [
                    {
                        "en": "in the background a photograph with trees in the background",
                        "vi": "trong nền một bức ảnh với cây trong nền"
                    },
                    {
                        "en": "A shadowy figure is visible in the background of the scene.",
                        "vi": "Một hình bóng mờ có thể nhìn thấy trong nền của cảnh."
                    },
                    {
                        "en": "against the… background The areas of water stood out against the dark background.",
                        "vi": "chống lại nền… Các vùng nước nổi bật trên nền tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in which people are not paying attention to somebody/something or not as much attention as they are paying to somebody/something else",
                    "vi": "một vị trí trong đó mọi người không chú ý đến ai đó / điều gì đó hoặc không chú ý nhiều như họ đang chú ý đến ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "The camerawork, the background music and the locations all contribute to the mood of the film.",
                        "vi": "Cảnh quay, nhạc nền và địa điểm đều góp phần tạo nên tâm trạng của bộ phim."
                    },
                    {
                        "en": "There was a lot of background noise (= that you could hear, but were not listening to).",
                        "vi": "Có rất nhiều tiếng ồn xung quanh (= bạn có thể nghe thấy nhưng không nghe thấy)."
                    },
                    {
                        "en": "background radiation",
                        "vi": "bức xạ nền"
                    },
                    {
                        "en": "in the background He prefers to remain in the background and let his assistant talk to the press.",
                        "vi": "trong nền Anh ấy muốn ở trong nền và để trợ lý của mình nói chuyện với báo chí."
                    },
                    {
                        "en": "A piano was playing gently in the background.",
                        "vi": "Một cây đàn piano đang nhẹ nhàng chơi trong nền."
                    },
                    {
                        "en": "Danger was always lurking in the background.",
                        "vi": "Nguy hiểm luôn rình rập ở hậu cảnh."
                    },
                    {
                        "en": "The issue has recently faded into the background.",
                        "vi": "Vấn đề gần đây đã trở nên mờ nhạt."
                    },
                    {
                        "en": "After the first scene, his character is relegated to the background.",
                        "vi": "Sau cảnh đầu tiên, nhân vật của anh ấy được đưa xuống nền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a colour or design on which something is painted, drawn, etc.",
                    "vi": "một màu sắc hoặc thiết kế mà trên đó một cái gì đó được vẽ, vẽ, v.v."
                },
                "examples": [
                    {
                        "en": "on a… background The name of the company is written in red on a white background.",
                        "vi": "trên nền… Tên công ty được viết bằng màu đỏ trên nền trắng."
                    },
                    {
                        "en": "against a… background Most paintings look good against a neutral background colour.",
                        "vi": "chống lại nền… Hầu hết các bức tranh trông đẹp khi có màu nền trung tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to tasks or processes that the user is not actively working on at the present time",
                    "vi": "được sử dụng để chỉ các nhiệm vụ hoặc quy trình mà người dùng không tích cực làm việc tại thời điểm hiện tại"
                },
                "examples": [
                    {
                        "en": "in the background Programs can be left running in the background.",
                        "vi": "trong nền Các chương trình có thể được để chạy trong nền."
                    },
                    {
                        "en": "Find and kill unwanted background processes like viruses and trojans.",
                        "vi": "Tìm và diệt các tiến trình nền không mong muốn như vi rút và trojan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave quietly when you are with a group of people so that they do not notice you",
                    "vi": "cư xử nhẹ nhàng khi bạn ở với một nhóm người để họ không chú ý đến bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f044d0f1df244938bef894d8e204735e",
        "word": "detail",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈdiːteɪl/",
            "us": "/ˈdiːteɪl/"
        },
        "nearby": [
            {
                "word": "detached",
                "pos": "adjective"
            },
            {
                "word": "detachment",
                "pos": "noun"
            },
            {
                "word": "detail",
                "pos": "noun"
            },
            {
                "word": "detail",
                "pos": "verb"
            },
            {
                "word": "detailed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small individual fact or item; a less important fact or item",
                    "vi": "một sự kiện hoặc mục cá nhân nhỏ; một thực tế hoặc mục ít quan trọng hơn"
                },
                "examples": [
                    {
                        "en": "an expedition planned down to the last detail",
                        "vi": "một cuộc thám hiểm đã lên kế hoạch đến từng chi tiết cuối cùng"
                    },
                    {
                        "en": "The Ministry refused to reveal any more details of the attack.",
                        "vi": "Bộ từ chối tiết lộ thêm bất kỳ chi tiết nào về vụ tấn công."
                    },
                    {
                        "en": "Tell me the main points now; leave the details till later.",
                        "vi": "Hãy cho tôi biết những điểm chính bây giờ; để lại chi tiết cho đến sau."
                    },
                    {
                        "en": "The finer details of the plan have still to be worked out.",
                        "vi": "Các chi tiết tốt hơn của kế hoạch vẫn còn phải được tính toán."
                    },
                    {
                        "en": "These are all relatively minor details.",
                        "vi": "Đây đều là những chi tiết tương đối nhỏ."
                    },
                    {
                        "en": "‘We had a terrible time—’ ‘Oh, spare me the details (= don't tell me any more).’",
                        "vi": "Chúng tôi đã có một khoảng thời gian khủng khiếp -' 'Ồ, hãy để tôi biết chi tiết (= đừng nói cho tôi biết nữa).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "the small facts or features of something, when you consider them all together",
                    "vi": "sự thật nhỏ hoặc tính năng của một cái gì đó, khi bạn xem xét tất cả chúng cùng nhau"
                },
                "examples": [
                    {
                        "en": "The report was criticized for its lack of detail.",
                        "vi": "Báo cáo đã bị chỉ trích vì thiếu chi tiết."
                    },
                    {
                        "en": "Ensure that your diagrams contain the appropriate level of detail.",
                        "vi": "Đảm bảo rằng sơ đồ của bạn có mức độ chi tiết thích hợp."
                    },
                    {
                        "en": "in detail This issue will be discussed in more detail in the next chapter.",
                        "vi": "chi tiết Vấn đề này sẽ được thảo luận chi tiết hơn trong chương tiếp theo."
                    },
                    {
                        "en": "The making of the movie is explored in minute detail.",
                        "vi": "Quá trình làm phim được khám phá chi tiết từng phút."
                    },
                    {
                        "en": "The research has been carried out with scrupulous attention to detail.",
                        "vi": "Nghiên cứu đã được thực hiện với sự chú ý cẩn thận đến từng chi tiết."
                    },
                    {
                        "en": "He had an eye for detail (= noticed and remembered small details).",
                        "vi": "Anh ta có một con mắt để biết chi tiết (= chú ý và ghi nhớ những chi tiết nhỏ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "information about something",
                    "vi": "thông tin về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Please provide the following details: name, age and sex.",
                        "vi": "Vui lòng cung cấp các thông tin chi tiết sau: tên, tuổi và giới tính."
                    },
                    {
                        "en": "Can you send me your contact details?",
                        "vi": "Bạn có thể gửi cho tôi thông tin liên lạc của bạn được không?"
                    },
                    {
                        "en": "For further details visit our website.",
                        "vi": "Để biết thêm chi tiết, hãy truy cập trang web của chúng tôi."
                    },
                    {
                        "en": "details about something They didn't give any details about the game.",
                        "vi": "chi tiết về điều gì đó Họ không đưa ra bất kỳ chi tiết nào về trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small part of a picture or painting; the smaller or less important parts of a picture, pattern, etc. when you consider them all together",
                    "vi": "một phần nhỏ của bức tranh hoặc bức tranh; các phần nhỏ hơn hoặc ít quan trọng hơn của một bức tranh, mẫu, v.v. khi bạn xem xét tất cả chúng cùng nhau"
                },
                "examples": [
                    {
                        "en": "This is a detail from the 1844 Turner painting.",
                        "vi": "Đây là một chi tiết từ bức tranh năm 1844 Turner."
                    },
                    {
                        "en": "a huge picture with a lot of fine detail in it",
                        "vi": "một bức tranh khổng lồ với rất nhiều chi tiết đẹp trong đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of soldiers given special duties",
                    "vi": "một nhóm binh lính được giao nhiệm vụ đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to explain something fully",
                    "vi": "để giải thích một cái gì đó đầy đủ"
                },
                "examples": [
                    {
                        "en": "I can't go into details now; it would take too long.",
                        "vi": "Tôi không thể đi vào chi tiết bây giờ; nó sẽ mất quá nhiều thời gian."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd24004b13db473e9638cc1819a0651e",
        "word": "scene",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/siːn/",
            "us": "/siːn/"
        },
        "nearby": [
            {
                "word": "SCE",
                "pos": "abbreviation"
            },
            {
                "word": "scenario",
                "pos": "noun"
            },
            {
                "word": "scene",
                "pos": "noun"
            },
            {
                "word": "scene-of-crime",
                "pos": "adjective"
            },
            {
                "word": "scenery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where something happens, especially something unpleasant",
                    "vi": "nơi mà một cái gì đó xảy ra, đặc biệt là một cái gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "the scene of the accident/crime/crash",
                        "vi": "hiện trường của vụ tai nạn / tội phạm / vụ tai nạn"
                    },
                    {
                        "en": "The attacker fled the scene.",
                        "vi": "Kẻ tấn công đã bỏ trốn khỏi hiện trường."
                    },
                    {
                        "en": "Italy was the scene of many demonstrations at that time.",
                        "vi": "Ý là nơi diễn ra nhiều cuộc biểu tình lúc bấy giờ."
                    },
                    {
                        "en": "on the scene Firefighters arrived on the scene within minutes.",
                        "vi": "tại hiện trường Các nhân viên cứu hỏa đã đến hiện trường trong vòng vài phút."
                    },
                    {
                        "en": "at the scene Sadly the man died at the scene.",
                        "vi": "tại hiện trường Đáng buồn là người đàn ông đã chết tại hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or a situation that you see, especially one of a particular type",
                    "vi": "một sự kiện hoặc một tình huống mà bạn thấy, đặc biệt là một trong những loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The team's victory produced scenes of jubilation all over the country.",
                        "vi": "Chiến thắng của đội đã tạo ra những cảnh tượng tưng bừng trên khắp đất nước."
                    },
                    {
                        "en": "a scene of devastation/carnage",
                        "vi": "một cảnh tượng tàn phá / tàn sát"
                    },
                    {
                        "en": "She witnessed some very distressing scenes.",
                        "vi": "Cô đã chứng kiến một số cảnh rất đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a film, play or book in which the action happens in one place or is of one particular type",
                    "vi": "một phần của phim, vở kịch hoặc cuốn sách trong đó hành động xảy ra ở một nơi hoặc thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "sex/fight/action/battle scenes",
                        "vi": "cảnh quan hệ tình dục / chiến đấu / hành động / chiến đấu"
                    },
                    {
                        "en": "deleted scenes (= ones that were not included in the final version)",
                        "vi": "những cảnh đã xóa (= những cảnh không có trong phiên bản cuối cùng)"
                    },
                    {
                        "en": "to film/shoot a scene",
                        "vi": "quay phim / quay một cảnh"
                    },
                    {
                        "en": "They shot the opening scene 15 times.",
                        "vi": "Họ đã quay cảnh mở đầu 15 lần."
                    },
                    {
                        "en": "I got very nervous before my big scene (= the one where I have a very important part).",
                        "vi": "Tôi đã rất lo lắng trước cảnh quay lớn của mình (= cảnh mà tôi có một phần rất quan trọng)."
                    },
                    {
                        "en": "The scene where he arrives at the factory is the turning point in the book.",
                        "vi": "Cảnh anh đến nhà máy là bước ngoặt của cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the small sections that a play or an opera is divided into",
                    "vi": "một trong những phần nhỏ mà vở kịch hoặc một vở opera được chia thành"
                },
                "examples": [
                    {
                        "en": "Act I, Scene 2 of ‘Macbeth’",
                        "vi": "Act I, Scene 2 of 'Macbeth'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area of activity or way of life and the people who are part of it",
                    "vi": "một lĩnh vực hoạt động hoặc cách sống cụ thể và những người là một phần của nó"
                },
                "examples": [
                    {
                        "en": "the art/club/punk scene",
                        "vi": "bối cảnh nghệ thuật / câu lạc bộ / punk"
                    },
                    {
                        "en": "on the… scene a newcomer on the music scene",
                        "vi": "trên sân khấu… một người mới trên sân khấu âm nhạc"
                    },
                    {
                        "en": "British players were finding it increasingly difficult to compete on the international scene.",
                        "vi": "Các cầu thủ Anh ngày càng gặp khó khăn khi thi đấu trên đấu trường quốc tế."
                    },
                    {
                        "en": "Tarantino burst onto the cinema scene in the ’90s.",
                        "vi": "Tarantino bùng nổ trên sân khấu điện ảnh vào những năm 90."
                    },
                    {
                        "en": "After years at the top, she just vanished from the scene.",
                        "vi": "Sau nhiều năm ở đỉnh cao, cô ấy biến mất khỏi hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a view that you see",
                    "vi": "một cái nhìn mà bạn thấy"
                },
                "examples": [
                    {
                        "en": "a delightful rural scene",
                        "vi": "một cảnh nông thôn thú vị"
                    },
                    {
                        "en": "They went abroad for a change of scene (= to see and experience new surroundings).",
                        "vi": "Họ ra nước ngoài để thay đổi bối cảnh (= để xem và trải nghiệm môi trường xung quanh mới)."
                    },
                    {
                        "en": "We stood and surveyed the scene.",
                        "vi": "Chúng tôi đã đứng và khảo sát hiện trường."
                    },
                    {
                        "en": "I stared out of the window of the train on the ever-changing scene.",
                        "vi": "Tôi nhìn chằm chằm ra ngoài cửa sổ của toa tàu về khung cảnh luôn thay đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a painting, drawing, or photograph of a place and the things that are happening there",
                    "vi": "một bức tranh, bản vẽ hoặc ảnh chụp một địa điểm và những điều đang diễn ra ở đó"
                },
                "examples": [
                    {
                        "en": "an exhibition of Parisian street scenes",
                        "vi": "triển lãm cảnh đường phố Paris"
                    },
                    {
                        "en": "He painted scenes of country life.",
                        "vi": "Anh vẽ những cảnh sinh hoạt đồng quê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a loud, angry argument, especially one that happens in public and is embarrassing",
                    "vi": "một cuộc tranh cãi ồn ào và tức giận, đặc biệt là một cuộc tranh cãi xảy ra ở nơi công cộng và đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "She had made a scene in the middle of the party.",
                        "vi": "Cô ấy đã thực hiện một cảnh ở giữa bữa tiệc."
                    },
                    {
                        "en": "‘Please leave,’ he said. ‘I don't want a scene.’",
                        "vi": "“Xin hãy rời khỏi đây,” anh ta nói. 'Tôi không muốn một cảnh.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "in the part of a theatre, etc. that the public does not usually see",
                    "vi": "trong một phần của nhà hát, v.v. mà công chúng thường không nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The students were able to go behind the scenes to see how programmes are made.",
                        "vi": "Các sinh viên có thể đến hậu trường để xem các chương trình được thực hiện như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that people in general are not aware of",
                    "vi": "theo cách mà mọi người nói chung không nhận thức được"
                },
                "examples": [
                    {
                        "en": "A lot of negotiating has been going on behind the scenes.",
                        "vi": "Rất nhiều cuộc đàm phán đã được diễn ra ở hậu trường."
                    },
                    {
                        "en": "behind-the-scenes work",
                        "vi": "công việc hậu trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "not the type of thing that somebody likes or enjoys doing",
                    "vi": "không phải kiểu mà ai đó thích hoặc thích làm"
                },
                "examples": [
                    {
                        "en": "Hillwalking is not my scene, so I stayed at home.",
                        "vi": "Trượt đồi không phải là cảnh của tôi, vì vậy tôi đã ở nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a situation in which something can easily happen or develop",
                    "vi": "để tạo ra một tình huống trong đó điều gì đó có thể dễ dàng xảy ra hoặc phát triển"
                },
                "examples": [
                    {
                        "en": "His arrival set the scene for another argument.",
                        "vi": "Sự xuất hiện của anh ta đã tạo ra bối cảnh cho một cuộc tranh cãi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the information and details they need in order to understand what comes next",
                    "vi": "cung cấp cho ai đó thông tin và chi tiết họ cần để hiểu điều gì xảy ra tiếp theo"
                },
                "examples": [
                    {
                        "en": "The first part of the programme was just setting the scene.",
                        "vi": "Phần đầu tiên của chương trình chỉ là dựng cảnh."
                    },
                    {
                        "en": "The scene is set in the first paragraph with an account of Sally's childhood.",
                        "vi": "Bối cảnh được đặt ở đoạn đầu tiên kể về thời thơ ấu của Sally."
                    }
                ]
            }
        ]
    },
    {
        "id": "862041aef9a7485380bf947f37742a99",
        "word": "style",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/staɪl/",
            "us": "/staɪl/"
        },
        "nearby": [
            {
                "word": "sty",
                "pos": "noun"
            },
            {
                "word": "Stygian",
                "pos": "adjective"
            },
            {
                "word": "style",
                "pos": "noun"
            },
            {
                "word": "style",
                "pos": "verb"
            },
            {
                "word": "style on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the particular way in which something is done",
                    "vi": "cách cụ thể trong đó một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "a wide range of musical styles",
                        "vi": "một loạt các phong cách âm nhạc"
                    },
                    {
                        "en": "They want a wide range of learning resources to suit different learning styles.",
                        "vi": "Họ muốn có nhiều nguồn tài liệu học tập để phù hợp với các phong cách học tập khác nhau."
                    },
                    {
                        "en": "a management style",
                        "vi": "một phong cách quản lý"
                    },
                    {
                        "en": "style of something a style of management",
                        "vi": "phong cách của một cái gì đó một phong cách quản lý"
                    },
                    {
                        "en": "furniture to suit your style of living",
                        "vi": "đồ nội thất phù hợp với phong cách sống của bạn"
                    },
                    {
                        "en": "His aggressive style of play sometimes gets him in trouble.",
                        "vi": "Phong cách thi đấu hung hãn của anh ấy đôi khi khiến anh ấy gặp rắc rối."
                    },
                    {
                        "en": "I really enjoy playing this style of music.",
                        "vi": "Tôi thực sự thích chơi phong cách âm nhạc này."
                    },
                    {
                        "en": "I like your style (= I like the way you do things).",
                        "vi": "I like your style (= Tôi thích cách bạn làm mọi việc)."
                    },
                    {
                        "en": "Caution was not her style (= not the way she usually behaved).",
                        "vi": "Thận trọng không phải là phong cách của cô ấy (= không phải cách cô ấy thường cư xử)."
                    },
                    {
                        "en": "I'm surprised he rides a motorbike—I'd have thought big cars were more his style (= what suited him).",
                        "vi": "Tôi ngạc nhiên khi anh ấy đi xe máy - Tôi đã nghĩ rằng những chiếc xe lớn phù hợp với phong cách của anh ấy hơn (= những gì phù hợp với anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular design of something, especially clothes",
                    "vi": "một thiết kế cụ thể của một cái gì đó, đặc biệt là quần áo"
                },
                "examples": [
                    {
                        "en": "We stock a wide variety of styles and sizes.",
                        "vi": "Chúng tôi có rất nhiều kiểu dáng và kích cỡ khác nhau."
                    },
                    {
                        "en": "Have you thought about having your hair in a shorter style?",
                        "vi": "Bạn đã nghĩ đến việc để tóc theo kiểu ngắn hơn chưa?"
                    },
                    {
                        "en": "a style that was popular in the 1950s",
                        "vi": "một phong cách phổ biến vào những năm 1950"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being fashionable in the clothes that you wear",
                    "vi": "chất lượng thời trang của quần áo bạn mặc"
                },
                "examples": [
                    {
                        "en": "style-conscious teenagers",
                        "vi": "thanh thiếu niên có ý thức về phong cách"
                    },
                    {
                        "en": "Some people have no sense of style.",
                        "vi": "Một số người không có ý thức về phong cách."
                    },
                    {
                        "en": "in style Short skirts are back in style (= fashionable).",
                        "vi": "theo phong cách Váy ngắn đã trở lại trong phong cách (= thời trang)."
                    },
                    {
                        "en": "They still refer to her as a style guru and a trend-setter.",
                        "vi": "Họ vẫn coi cô ấy là một phong cách sành điệu và một người bắt kịp xu hướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being attractive and made or done to a high standard",
                    "vi": "chất lượng hấp dẫn và được thực hiện hoặc thực hiện với tiêu chuẩn cao"
                },
                "examples": [
                    {
                        "en": "The hotel has been redecorated but it's lost a lot of its style.",
                        "vi": "Khách sạn đã được trang trí lại nhưng nó đã mất đi rất nhiều phong cách."
                    },
                    {
                        "en": "This movie is all surface style and no substance.",
                        "vi": "Phim này toàn là phong cách bề nổi và không có thực chất."
                    },
                    {
                        "en": "She does everything with style and grace.",
                        "vi": "Cô ấy làm mọi thứ với phong cách và sự duyên dáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the features of a book, painting, building, etc. that make it typical of a particular author, artist, historical period, etc.",
                    "vi": "các tính năng của một cuốn sách, bức tranh, tòa nhà, v.v. làm cho cuốn sách đó trở thành tiêu biểu của một tác giả, nghệ sĩ cụ thể, giai đoạn lịch sử, v.v."
                },
                "examples": [
                    {
                        "en": "style (of something) a style of architecture",
                        "vi": "phong cách (của cái gì đó) một phong cách kiến trúc"
                    },
                    {
                        "en": "a fine example of Gothic style",
                        "vi": "một ví dụ điển hình về phong cách Gothic"
                    },
                    {
                        "en": "The film has a unique visual style.",
                        "vi": "Bộ phim có một phong cách hình ảnh độc đáo."
                    },
                    {
                        "en": "He developed a distinctive style of painting.",
                        "vi": "Ông đã phát triển một phong cách hội họa đặc biệt."
                    },
                    {
                        "en": "in the style of somebody/something a parody written in the style of Molière",
                        "vi": "theo phong cách của ai đó / một thứ gì đó nhại được viết theo phong cách của Molière"
                    },
                    {
                        "en": "The palace was rebuilt in the same style.",
                        "vi": "Cung điện được xây dựng lại theo cùng một phong cách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the correct use of language",
                    "vi": "sử dụng đúng ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "It's not considered good style to start a sentence with ‘but’.",
                        "vi": "Nó không được coi là phong cách tốt để bắt đầu một câu bằng 'nhưng'."
                    },
                    {
                        "en": "Please follow house style (= the rules of spelling, etc. used by a particular publishing company).",
                        "vi": "Vui lòng tuân theo kiểu nội dung (= quy tắc chính tả, v.v. được sử dụng bởi một công ty xuất bản cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of style mentioned",
                    "vi": "có loại phong cách được đề cập"
                },
                "examples": [
                    {
                        "en": "Italian-style gardens",
                        "vi": "Khu vườn kiểu Ý"
                    },
                    {
                        "en": "a buffet-style breakfast",
                        "vi": "bữa sáng kiểu tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the long, thin part of a flower that carries the stigma",
                    "vi": "phần dài, mỏng của hoa mang đầu nhụy."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop somebody from behaving in the way they want to",
                    "vi": "để ngăn ai đó cư xử theo cách họ muốn"
                },
                "examples": [
                    {
                        "en": "She didn’t want me to go with her to the party in case I cramped her style.",
                        "vi": "Cô ấy không muốn tôi đi cùng cô ấy đến bữa tiệc trong trường hợp tôi hạn chế phong cách của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in an impressive way",
                    "vi": "theo một cách ấn tượng"
                },
                "examples": [
                    {
                        "en": "She always celebrates her birthday in style.",
                        "vi": "Cô ấy luôn tổ chức sinh nhật theo phong cách riêng."
                    },
                    {
                        "en": "He won the championship in great style.",
                        "vi": "Anh ấy đã giành chức vô địch bằng phong cách tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "1fc0e9a9346c403b8d0b724b291ef208",
        "word": "fake",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/feɪk/",
            "us": "/feɪk/"
        },
        "nearby": [
            {
                "word": "fajitas",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "adjective"
            },
            {
                "word": "fake",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "verb"
            },
            {
                "word": "fake news",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object such as a work of art, a coin or a piece of jewellery that is not what somebody claims it is but has been made to look as if it is",
                    "vi": "một vật thể chẳng hạn như một tác phẩm nghệ thuật, một đồng xu hoặc một món đồ trang sức không phải như những gì ai đó tuyên bố về nó nhưng đã được tạo ra để trông như thể nó là"
                },
                "examples": [
                    {
                        "en": "All the paintings proved to be fakes.",
                        "vi": "Tất cả các bức tranh được chứng minh là hàng giả."
                    },
                    {
                        "en": "She had long ago sold the diamonds and replaced them with fakes.",
                        "vi": "Cô đã bán kim cương từ lâu và thay thế bằng hàng giả."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who pretends to be what they are not in order to cheat people",
                    "vi": "một người giả vờ như những gì họ không phải là để lừa dối mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "37c557ec37f54c2faecc9df13afd8a5f",
        "word": "represent",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌreprɪˈzent/",
            "us": "/ˌreprɪˈzent/"
        },
        "nearby": [
            {
                "word": "repossession",
                "pos": "noun"
            },
            {
                "word": "reprehensible",
                "pos": "adjective"
            },
            {
                "word": "represent",
                "pos": "verb"
            },
            {
                "word": "re-present",
                "pos": "verb"
            },
            {
                "word": "representation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be a member of a group of people and act or speak for them at an event, a meeting, etc.",
                    "vi": "trở thành thành viên của một nhóm người và hành động hoặc phát biểu cho họ tại một sự kiện, một cuộc họp, v.v."
                },
                "examples": [
                    {
                        "en": "The competition attracted over 500 contestants representing eight different countries.",
                        "vi": "Cuộc thi thu hút hơn 500 thí sinh đại diện cho tám quốc gia khác nhau."
                    },
                    {
                        "en": "Local businesses are well represented on the committee (= there are a lot of people from them on the committee).",
                        "vi": "Các doanh nghiệp địa phương được đại diện tốt trong ủy ban (= có rất nhiều người từ họ trong ủy ban)."
                    },
                    {
                        "en": "The opening speech was by Bob Alan representing Amnesty International.",
                        "vi": "Bài phát biểu khai mạc là Bob Alan đại diện cho Tổ chức Ân xá Quốc tế."
                    },
                    {
                        "en": "The President was represented at the ceremony by the Vice-President.",
                        "vi": "Phó Chủ tịch nước đại diện tại buổi lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act or speak officially for somebody and defend their interests",
                    "vi": "hành động hoặc nói chuyện chính thức cho ai đó và bảo vệ lợi ích của họ"
                },
                "examples": [
                    {
                        "en": "The union represents over 200 000 teachers.",
                        "vi": "Công đoàn đại diện cho hơn 200 000 giáo viên."
                    },
                    {
                        "en": "The association was formed to represent the interests of women artists.",
                        "vi": "Hiệp hội được thành lập để đại diện cho quyền lợi của các nữ nghệ sĩ."
                    },
                    {
                        "en": "Ms Dale is representing the defendant (= is his/her lawyer) in the case.",
                        "vi": "Cô Dale đang đại diện cho bị đơn (= là luật sư của anh ấy / cô ấy) trong vụ án."
                    },
                    {
                        "en": "As an MP, it is my duty to represent my constituents.",
                        "vi": "Là một nghị sĩ, tôi có nhiệm vụ đại diện cho các cử tri của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take part in a sports event for a particular country, city, etc.",
                    "vi": "tham gia một sự kiện thể thao cho một quốc gia, thành phố cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "He's been chosen to represent Scotland in next year's World Cup Finals.",
                        "vi": "Anh ấy đã được chọn để đại diện cho Scotland trong Vòng chung kết World Cup năm sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a symbol of something",
                    "vi": "trở thành biểu tượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Each colour on the chart represents a different department.",
                        "vi": "Mỗi màu trên biểu đồ đại diện cho một bộ phận khác nhau."
                    },
                    {
                        "en": "Wind direction is represented by arrows.",
                        "vi": "Hướng gió được biểu diễn bằng các mũi tên."
                    },
                    {
                        "en": "The artist uses doves to represent peace.",
                        "vi": "Người nghệ sĩ sử dụng chim bồ câu để đại diện cho hòa bình."
                    },
                    {
                        "en": "It is not clear what these symbols were intended to represent.",
                        "vi": "Không rõ những biểu tượng này được dùng để đại diện cho điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something",
                    "vi": "trở thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "This contract represents 20% of the company's annual revenue.",
                        "vi": "Hợp đồng này chiếm 20% doanh thu hàng năm của công ty."
                    },
                    {
                        "en": "The final figure represents a 12% increase on the number of new jobs created the previous year.",
                        "vi": "Con số cuối cùng thể hiện mức tăng 12% về số lượng việc làm mới được tạo ra trong năm trước."
                    },
                    {
                        "en": "They're investing in low-carbon technologies that represent value for money.",
                        "vi": "Họ đang đầu tư vào các công nghệ carbon thấp thể hiện giá trị đồng tiền."
                    },
                    {
                        "en": "He got rid of anyone who represented a threat to his authority.",
                        "vi": "Anh ta loại bỏ bất cứ ai đại diện cho một mối đe dọa đối với quyền lực của anh ta."
                    },
                    {
                        "en": "This role represents a unique opportunity to further your career in healthcare.",
                        "vi": "Vai trò này đại diện cho một cơ hội duy nhất để phát triển sự nghiệp của bạn trong lĩnh vực chăm sóc sức khỏe."
                    },
                    {
                        "en": "The peace plan represents (= is the result of) weeks of negotiation.",
                        "vi": "Kế hoạch hòa bình thể hiện (= là kết quả của) nhiều tuần thương lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be present in something to a particular degree",
                    "vi": "hiện diện trong một cái gì đó ở một mức độ cụ thể"
                },
                "examples": [
                    {
                        "en": "Women and men were represented equally on the teams.",
                        "vi": "Phụ nữ và nam giới được đại diện như nhau trong các đội."
                    },
                    {
                        "en": "Women are disproportionately represented among welfare recipients.",
                        "vi": "Phụ nữ được đại diện một cách không cân đối giữa những người nhận phúc lợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be an example or expression of something",
                    "vi": "để trở thành một ví dụ hoặc biểu hiện của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The project represents all that is good in the community.",
                        "vi": "Dự án đại diện cho tất cả những gì tốt đẹp trong cộng đồng."
                    },
                    {
                        "en": "Those comments do not represent the views of us all.",
                        "vi": "Những nhận xét đó không đại diện cho quan điểm của tất cả chúng tôi."
                    },
                    {
                        "en": "The book purported to represent the lives of ordinary people.",
                        "vi": "Cuốn sách có mục đích đại diện cho cuộc sống của những người bình thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show somebody/something, especially in a picture",
                    "vi": "để chỉ cho ai đó / cái gì đó, đặc biệt là trong một bức tranh"
                },
                "examples": [
                    {
                        "en": "represent somebody/something The carvings represent a hunting scene.",
                        "vi": "đại diện cho ai đó / cái gì đó Các hình chạm khắc đại diện cho một cảnh săn bắn."
                    },
                    {
                        "en": "The map represents Italy in the 12th century.",
                        "vi": "Bản đồ đại diện cho Ý vào thế kỷ 12."
                    },
                    {
                        "en": "The results are represented in fig. 3 below.",
                        "vi": "Các kết quả được trình bày trong hình. 3 bên dưới."
                    },
                    {
                        "en": "represent somebody/something as somebody/something The Egyptian goddess is represented as a woman with cow's horns.",
                        "vi": "đại diện cho ai đó / cái gì đó với tư cách là ai đó / cái gì đó Nữ thần Ai Cập được biểu thị như một người phụ nữ có sừng bò."
                    }
                ]
            },
            {
                "define": {
                    "en": "to present or describe somebody/something in a particular way, especially when this may not be fair",
                    "vi": "để trình bày hoặc mô tả ai đó / điều gì đó theo một cách cụ thể, đặc biệt khi điều này có thể không công bằng"
                },
                "examples": [
                    {
                        "en": "represent somebody/something as something The king is represented as a villain in the play.",
                        "vi": "đại diện cho ai đó / cái gì đó như một cái gì đó Nhà vua được thể hiện như một nhân vật phản diện trong vở kịch."
                    },
                    {
                        "en": "The risks were represented as negligible.",
                        "vi": "Rủi ro được cho là không đáng kể."
                    },
                    {
                        "en": "The film represents us as helpless victims.",
                        "vi": "Bộ phim thể hiện chúng ta là những nạn nhân bất lực."
                    },
                    {
                        "en": "represent somebody/something The film accurately represents the atmosphere of the post-war period.",
                        "vi": "đại diện cho ai đó / cái gì đó Bộ phim thể hiện chính xác không khí của thời kỳ hậu chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a formal statement to somebody in authority to make your opinions known or to protest",
                    "vi": "tuyên bố chính thức với ai đó có thẩm quyền để làm cho ý kiến của bạn được biết hoặc để phản đối"
                },
                "examples": [
                    {
                        "en": "represent something to somebody They represented their concerns to the authorities.",
                        "vi": "đại diện cho một cái gì đó cho ai đó Họ đại diện cho mối quan tâm của họ với các cơ quan chức năng."
                    },
                    {
                        "en": "represent (to somebody) that… He admitted falsely representing to police officers that the car had been stolen.",
                        "vi": "đại diện (với ai đó) rằng… Anh ta thừa nhận sai khi đại diện cho các sĩ quan cảnh sát rằng chiếc xe đã bị đánh cắp."
                    }
                ]
            }
        ]
    },
    {
        "id": "8fe4aa18214a4bb69cf33ba4baa040d0",
        "word": "abstract",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈæbstrækt/",
            "us": "/ˈæbstrækt/"
        },
        "nearby": [
            {
                "word": "abstinence",
                "pos": "noun"
            },
            {
                "word": "abstinent",
                "pos": "adjective"
            },
            {
                "word": "abstract",
                "pos": "adjective"
            },
            {
                "word": "abstract",
                "pos": "noun"
            },
            {
                "word": "abstract",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on general ideas and not on any particular real person, thing or situation",
                    "vi": "dựa trên những ý tưởng chung chứ không dựa trên bất kỳ người, sự vật hoặc tình huống thực tế cụ thể nào"
                },
                "examples": [
                    {
                        "en": "abstract knowledge/principles",
                        "vi": "kiến thức / nguyên tắc trừu tượng"
                    },
                    {
                        "en": "The research shows that pre-school children are capable of thinking in abstract terms.",
                        "vi": "Nghiên cứu chỉ ra rằng trẻ em trước tuổi đi học có khả năng suy nghĩ về các thuật ngữ trừu tượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "existing in thought or as an idea but not having a physical reality",
                    "vi": "tồn tại trong suy nghĩ hoặc như một ý tưởng nhưng không tồn tại trong thực tế vật lý"
                },
                "examples": [
                    {
                        "en": "We may talk of beautiful things but beauty itself is abstract.",
                        "vi": "Chúng ta có thể nói về những điều đẹp đẽ nhưng vẻ đẹp tự nó là trừu tượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not representing people or things in a realistic way, but expressing the artist’s ideas about them",
                    "vi": "không đại diện cho con người hoặc sự vật theo cách thực tế, nhưng thể hiện ý tưởng của nghệ sĩ về chúng"
                },
                "examples": [
                    {
                        "en": "the work of American abstract expressionists like Mark Rothko",
                        "vi": "tác phẩm của các nhà biểu hiện trừu tượng người Mỹ như Mark Rothko"
                    }
                ]
            }
        ]
    },
    {
        "id": "b22c002760a3445ab37c4c2ef4e5622d",
        "word": "figure",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɪɡə(r)/",
            "us": "/ˈfɪɡjər/"
        },
        "nearby": [
            {
                "word": "figurative",
                "pos": "adjective"
            },
            {
                "word": "figuratively",
                "pos": "adverb"
            },
            {
                "word": "figure",
                "pos": "noun"
            },
            {
                "word": "figure",
                "pos": "verb"
            },
            {
                "word": "figured",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a number representing a particular amount, especially one given in official information",
                    "vi": "một số đại diện cho một số tiền cụ thể, đặc biệt là một số được đưa ra trong thông tin chính thức"
                },
                "examples": [
                    {
                        "en": "the latest sales/crime/unemployment figures",
                        "vi": "số liệu bán hàng / tội phạm / thất nghiệp mới nhất"
                    },
                    {
                        "en": "Official figures indicate that crime is falling.",
                        "vi": "Các số liệu chính thức cho thấy tội phạm đang giảm."
                    },
                    {
                        "en": "Figures for April show a slight improvement on previous months.",
                        "vi": "Số liệu của tháng 4 cho thấy sự cải thiện nhẹ so với các tháng trước."
                    },
                    {
                        "en": "By 2017, this figure had risen to 14 million.",
                        "vi": "Đến năm 2017, con số này đã tăng lên 14 triệu."
                    },
                    {
                        "en": "Viewing figures for the series have dropped dramatically.",
                        "vi": "Số lượt xem của bộ truyện đã giảm đáng kể."
                    },
                    {
                        "en": "Figures released by the hospital reveal a rise in the number of admissions.",
                        "vi": "Các số liệu do bệnh viện công bố cho thấy sự gia tăng số lượng bệnh nhân nhập viện."
                    },
                    {
                        "en": "Experts put the real figure at closer to 75%.",
                        "vi": "Các chuyên gia đưa ra con số thực gần 75%."
                    },
                    {
                        "en": "according to… figures According to government figures, 3.6 million children are living in poverty.",
                        "vi": "theo… số liệu Theo số liệu của chính phủ, 3,6 triệu trẻ em đang sống trong cảnh nghèo đói."
                    },
                    {
                        "en": "Her argument is backed up with plenty of facts and figures.",
                        "vi": "Lập luận của cô ấy được chứng minh với rất nhiều dữ kiện và số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a symbol rather than a word representing one of the numbers between 0 and 9",
                    "vi": "một biểu tượng thay vì một từ đại diện cho một trong các số từ 0 đến 9"
                },
                "examples": [
                    {
                        "en": "Write the figure ‘7’ on the board.",
                        "vi": "Viết hình '7' lên bảng."
                    },
                    {
                        "en": "paths built in the shape of a figure 8",
                        "vi": "đường dẫn được xây dựng theo hình số 8"
                    },
                    {
                        "en": "a six-figure salary (= over 100 000 pounds or dollars)",
                        "vi": "mức lương sáu con số (= hơn 100 000 bảng Anh hoặc đô la)"
                    },
                    {
                        "en": "in… figures Her salary is now in six figures.",
                        "vi": "bằng… con số Mức lương của cô ấy bây giờ là sáu con số."
                    },
                    {
                        "en": "My unread email was in triple figures (= more than 100).",
                        "vi": "Email chưa đọc của tôi có gấp ba con số (= hơn 100)."
                    },
                    {
                        "en": "Ticket prices for the show are likely to be into three figures (= at least 100 pounds or dollars).",
                        "vi": "Giá vé cho buổi biểu diễn có thể là ba con số (= ít nhất 100 bảng Anh hoặc đô la)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area of mathematics that deals with adding, multiplying, etc. numbers",
                    "vi": "lĩnh vực toán học liên quan đến các số cộng, nhân, v.v."
                },
                "examples": [
                    {
                        "en": "Are you any good at figures?",
                        "vi": "Bạn có giỏi về số liệu không?"
                    },
                    {
                        "en": "I'm afraid I don't have a head for figures (= I am not good at adding, etc.).",
                        "vi": "Tôi e rằng tôi không có đầu cho các số liệu (= Tôi không giỏi trong việc bổ sung, v.v.)."
                    },
                    {
                        "en": "I was never very good at figures.",
                        "vi": "Tôi không bao giờ giỏi về số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of the type mentioned",
                    "vi": "một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "a leading figure in the music industry",
                        "vi": "một nhân vật hàng đầu trong ngành công nghiệp âm nhạc"
                    },
                    {
                        "en": "a senior figure in the organization",
                        "vi": "một nhân vật cấp cao trong tổ chức"
                    },
                    {
                        "en": "a key/prominent/central figure",
                        "vi": "một nhân vật chính / nổi bật / trung tâm"
                    },
                    {
                        "en": "King's widow, Coretta Scott King, later became a public figure in her own right.",
                        "vi": "Bà góa của King, Coretta Scott King, sau đó đã trở thành người của công chúng theo cách riêng của bà."
                    },
                    {
                        "en": "teachers and other authority figures",
                        "vi": "giáo viên và các nhân vật chính quyền khác"
                    },
                    {
                        "en": "figure of something a figure of authority/ridicule",
                        "vi": "hình ảnh của một cái gì đó một hình ảnh của quyền lực / chế nhạo"
                    },
                    {
                        "en": "He was a well-known figure in London at that time.",
                        "vi": "Ông là một nhân vật nổi tiếng ở London vào thời điểm đó."
                    },
                    {
                        "en": "one of the most popular figures in athletics",
                        "vi": "một trong những nhân vật phổ biến nhất trong môn điền kinh"
                    },
                    {
                        "en": "When she last saw him, he was a sad figure—old and tired.",
                        "vi": "Khi cô nhìn thấy anh lần cuối, anh là một hình bóng buồn bã - già nua và mệt mỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of a person seen from a distance or not clearly",
                    "vi": "hình dạng của một người nhìn từ xa hoặc không rõ ràng"
                },
                "examples": [
                    {
                        "en": "There before him stood a tall figure in black.",
                        "vi": "Trước mặt anh là một bóng người cao lớn mặc đồ đen."
                    },
                    {
                        "en": "A shadowy figure can be seen through the window.",
                        "vi": "Một bóng người có thể được nhìn thấy qua cửa sổ."
                    },
                    {
                        "en": "The seated figure in the corner beckoned me over.",
                        "vi": "Người ngồi trong góc ra hiệu cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of the human body, especially a woman’s body that is attractive",
                    "vi": "hình dạng của cơ thể con người, đặc biệt là cơ thể phụ nữ hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She's always had a good figure.",
                        "vi": "Cô ấy luôn có một thân hình đẹp."
                    },
                    {
                        "en": "I'm watching my figure (= trying not to get fat).",
                        "vi": "Tôi đang xem hình dáng của mình (= cố gắng không béo lên)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an animal in a drawing, painting, etc., or in a story",
                    "vi": "một người hoặc một con vật trong bức vẽ, bức tranh, v.v., hoặc trong một câu chuyện"
                },
                "examples": [
                    {
                        "en": "The central figure in the painting is the artist's daughter.",
                        "vi": "Nhân vật trung tâm trong bức tranh là con gái của họa sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statue of a person or an animal",
                    "vi": "một bức tượng của một người hoặc một con vật"
                },
                "examples": [
                    {
                        "en": "a bronze figure of a horse",
                        "vi": "một con ngựa bằng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture, diagram, etc. in a book, that is referred to by a number or letter",
                    "vi": "một bức tranh, sơ đồ, v.v. trong sách, được đề cập đến bằng một số hoặc chữ cái"
                },
                "examples": [
                    {
                        "en": "The results are illustrated in figure 3 opposite.",
                        "vi": "Kết quả được minh họa trong hình 3 ngược lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular shape formed by lines or surfaces",
                    "vi": "một hình dạng cụ thể được tạo thành bởi các đường hoặc bề mặt"
                },
                "examples": [
                    {
                        "en": "a five-sided figure",
                        "vi": "một hình năm cạnh"
                    },
                    {
                        "en": "a solid figure",
                        "vi": "một con số rắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a pattern or series of movements performed on ice",
                    "vi": "một mô hình hoặc một loạt các chuyển động được thực hiện trên băng"
                },
                "examples": [
                    {
                        "en": "The skater executed a perfect set of figures.",
                        "vi": "Vận động viên trượt băng đã thực hiện một bộ số liệu hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become somebody that other people laugh at",
                    "vi": "trở thành / trở thành người mà người khác cười nhạo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a particular appearance",
                    "vi": "để có một ngoại hình cụ thể"
                },
                "examples": [
                    {
                        "en": "He cut a striking figure in his white dinner jacket.",
                        "vi": "Anh ấy tạo ra một thân hình nổi bật trong chiếc áo khoác dạ màu trắng của mình."
                    },
                    {
                        "en": "He cut a dashing figure in his uniform.",
                        "vi": "Anh ấy tạo ra một hình thể bảnh bao trong bộ đồng phục của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "accurate and detailed information",
                    "vi": "thông tin chính xác và chi tiết"
                },
                "examples": [
                    {
                        "en": "I've asked to see all the facts and figures before I make a decision.",
                        "vi": "Tôi đã yêu cầu xem tất cả các dữ kiện và số liệu trước khi đưa ra quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say the exact price or number of something",
                    "vi": "để nói giá hoặc số lượng chính xác của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It’s impossible to put a figure on the number of homeless people in London.",
                        "vi": "Không thể đặt một con số về số lượng người vô gia cư ở London."
                    },
                    {
                        "en": "You can't put a dollar figure on the lives ruined by the hurricane.",
                        "vi": "Bạn không thể đặt một con số đô la cho những cuộc đời bị hủy hoại bởi cơn bão."
                    }
                ]
            }
        ]
    },
    {
        "id": "08d049f51b13467ab38b13c915a6c21f",
        "word": "foreground",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɔːɡraʊnd/",
            "us": "/ˈfɔːrɡraʊnd/"
        },
        "nearby": [
            {
                "word": "foregoing",
                "pos": "adjective"
            },
            {
                "word": "foregone",
                "pos": "adjective"
            },
            {
                "word": "foreground",
                "pos": "noun"
            },
            {
                "word": "foreground",
                "pos": "verb"
            },
            {
                "word": "forehand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a view, picture, etc. that is nearest to you when you look at it",
                    "vi": "phần của một chế độ xem, hình ảnh, v.v. gần bạn nhất khi bạn nhìn vào nó"
                },
                "examples": [
                    {
                        "en": "The figure in the foreground is the artist's mother.",
                        "vi": "Hình ảnh ở phía trước là mẹ của nghệ sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important position that is noticed by people",
                    "vi": "một vị trí quan trọng được mọi người chú ý"
                },
                "examples": [
                    {
                        "en": "Inflation and interest rates will be very much in the foreground of their election campaign.",
                        "vi": "Lạm phát và lãi suất sẽ ảnh hưởng rất nhiều đến chiến dịch tranh cử của họ."
                    },
                    {
                        "en": "This issue is very much in the foreground.",
                        "vi": "Vấn đề này còn rất nhiều ở phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to tasks or processes that the user is actively working on at the present time",
                    "vi": "được sử dụng để chỉ các tác vụ hoặc quy trình mà người dùng đang tích cực thực hiện tại thời điểm hiện tại"
                },
                "examples": [
                    {
                        "en": "Normally, the user runs the program in the foreground.",
                        "vi": "Thông thường, người dùng chạy chương trình ở chế độ nền trước."
                    },
                    {
                        "en": "With this program, users can easily take control of foreground processes.",
                        "vi": "Với chương trình này, người dùng có thể dễ dàng kiểm soát các quy trình nền trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac8c369112ad4ece8692b9ef0af9c961",
        "word": "inspire",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪnˈspaɪə(r)/",
            "us": "/ɪnˈspaɪər/"
        },
        "nearby": [
            {
                "word": "inspiration",
                "pos": "noun"
            },
            {
                "word": "inspirational",
                "pos": "adjective"
            },
            {
                "word": "inspire",
                "pos": "verb"
            },
            {
                "word": "inspired",
                "pos": "adjective"
            },
            {
                "word": "inspiring",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody the desire, confidence or enthusiasm to do something well",
                    "vi": "để cung cấp cho ai đó mong muốn, sự tự tin hoặc sự nhiệt tình để làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "inspire somebody The actors' enthusiasm inspired the kids.",
                        "vi": "truyền cảm hứng cho ai đó Sự nhiệt tình của các diễn viên đã truyền cảm hứng cho lũ trẻ."
                    },
                    {
                        "en": "inspire somebody with something The actors inspired the kids with their enthusiasm.",
                        "vi": "truyền cảm hứng cho ai đó bằng điều gì đó Các diễn viên đã truyền cảm hứng cho lũ trẻ bằng sự nhiệt tình của họ."
                    },
                    {
                        "en": "inspire somebody to something His superb play inspired the team to a thrilling 5–0 win.",
                        "vi": "truyền cảm hứng cho ai đó về điều gì đó. Lối chơi tuyệt vời của anh ấy đã truyền cảm hứng cho đội giành chiến thắng 5–0 đầy gay cấn."
                    },
                    {
                        "en": "inspire somebody to do something By visiting schools, the actors hope to inspire children to put on their own productions.",
                        "vi": "truyền cảm hứng cho ai đó làm điều gì đó Bằng cách đến thăm các trường học, các diễn viên hy vọng sẽ truyền cảm hứng cho trẻ em để tạo ra các sản phẩm của riêng họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the idea for something, especially something artistic or that shows imagination",
                    "vi": "để cung cấp cho ai đó ý tưởng cho một cái gì đó, đặc biệt là cái gì đó nghệ thuật hoặc thể hiện trí tưởng tượng"
                },
                "examples": [
                    {
                        "en": "The choice of decor was inspired by a trip to India.",
                        "vi": "Sự lựa chọn trang trí được lấy cảm hứng từ một chuyến đi đến Ấn Độ."
                    },
                    {
                        "en": "His tragic story later inspired a Hollywood film.",
                        "vi": "Câu chuyện bi thảm của anh sau này đã truyền cảm hứng cho một bộ phim Hollywood."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody have a particular feeling or emotion",
                    "vi": "để làm cho ai đó có một cảm giác hoặc cảm xúc cụ thể"
                },
                "examples": [
                    {
                        "en": "Henry did not inspire confidence as a figure of authority.",
                        "vi": "Henry không truyền cảm hứng cho sự tự tin như một nhân vật có uy quyền."
                    },
                    {
                        "en": "inspire somebody with something Her work didn't exactly inspire me with confidence.",
                        "vi": "truyền cảm hứng cho ai đó bằng điều gì đó Công việc của cô ấy không chính xác truyền cho tôi sự tự tin."
                    },
                    {
                        "en": "inspire something in somebody As a general, he inspired great loyalty in his troops.",
                        "vi": "truyền cảm hứng cho ai đó Với tư cách là một vị tướng, ông đã truyền cảm hứng cho lòng trung thành tuyệt vời trong quân đội của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "db4e1be69ba041b19205e5f0475fc06b",
        "word": "masterpiece",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɑːstəpiːs/",
            "us": "/ˈmæstərpiːs/"
        },
        "nearby": [
            {
                "word": "Master of the Queen's Music",
                "pos": ""
            },
            {
                "word": "Master of the Rolls",
                "pos": ""
            },
            {
                "word": "masterpiece",
                "pos": "noun"
            },
            {
                "word": "Masterpiece",
                "pos": ""
            },
            {
                "word": "master plan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a work of art such as a painting, film, book, etc. that is an excellent, or the best, example of the artist’s work",
                    "vi": "một tác phẩm nghệ thuật như tranh vẽ, phim, sách, v.v. là một ví dụ xuất sắc hoặc hay nhất về tác phẩm của nghệ sĩ"
                },
                "examples": [
                    {
                        "en": "The museum houses several of his Cubist masterpieces.",
                        "vi": "Bảo tàng lưu giữ một số kiệt tác Lập thể của ông."
                    },
                    {
                        "en": "Her work is a masterpiece of (= an excellent example of) simplicity.",
                        "vi": "Công việc của cô ấy là một kiệt tác về (= một ví dụ xuất sắc về) sự đơn giản."
                    }
                ]
            }
        ]
    },
    {
        "id": "b68ddd9c7477471a8759af173bf7597e",
        "word": "realistic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌriːəˈlɪstɪk/",
            "us": "/ˌriːəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "realism",
                "pos": "noun"
            },
            {
                "word": "realist",
                "pos": "noun"
            },
            {
                "word": "realistic",
                "pos": "adjective"
            },
            {
                "word": "realistically",
                "pos": "adverb"
            },
            {
                "word": "reality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "accepting in a sensible way what it is actually possible to do or achieve in a particular situation",
                    "vi": "chấp nhận một cách hợp lý những gì nó thực sự có thể làm hoặc đạt được trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "a realistic assessment/approach/view",
                        "vi": "một đánh giá / cách tiếp cận / quan điểm thực tế"
                    },
                    {
                        "en": "realistic about something We have to be realistic about our chances of winning.",
                        "vi": "thực tế về điều gì đó Chúng ta phải thực tế về cơ hội chiến thắng của mình."
                    },
                    {
                        "en": "it is realistic (for somebody) to do something It is not realistic to expect people to spend so much money.",
                        "vi": "nó là thực tế (đối với ai đó) để làm điều gì đó Không thực tế khi mong đợi mọi người chi nhiều tiền như vậy."
                    },
                    {
                        "en": "It would not be realistic for the Government to demand a pay freeze in the sector at this point.",
                        "vi": "Sẽ không thực tế nếu Chính phủ yêu cầu đóng băng lương trong lĩnh vực này vào thời điểm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible and appropriate; possible to achieve",
                    "vi": "hợp lý và thích hợp; có thể đạt được"
                },
                "examples": [
                    {
                        "en": "a realistic prospect/chance/possibility",
                        "vi": "một triển vọng / cơ hội / khả năng thực tế"
                    },
                    {
                        "en": "a realistic alternative/option",
                        "vi": "một lựa chọn / thay thế thực tế"
                    },
                    {
                        "en": "The important thing is to have realistic expectations about what you can and can't accomplish.",
                        "vi": "Điều quan trọng là có những kỳ vọng thực tế về những gì bạn có thể và không thể hoàn thành."
                    },
                    {
                        "en": "We must set realistic goals.",
                        "vi": "Chúng ta phải đặt ra những mục tiêu thực tế."
                    },
                    {
                        "en": "a realistic target",
                        "vi": "một mục tiêu thực tế"
                    },
                    {
                        "en": "If you want to retain good employees, you have to pay a realistic salary.",
                        "vi": "Nếu bạn muốn giữ chân những nhân viên giỏi, bạn phải trả một mức lương thực tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "representing things as they are in real life",
                    "vi": "đại diện cho mọi thứ như trong cuộc sống thực"
                },
                "examples": [
                    {
                        "en": "a realistic portrayal/depiction/picture",
                        "vi": "một bức chân dung / mô tả / bức tranh thực tế"
                    },
                    {
                        "en": "She made a very realistic drawing of a horse.",
                        "vi": "Cô ấy đã vẽ một con ngựa rất giống thật."
                    },
                    {
                        "en": "We try to make these training courses as realistic as possible.",
                        "vi": "Chúng tôi cố gắng làm cho các khóa đào tạo này trở nên thực tế nhất có thể."
                    },
                    {
                        "en": "The realistic graphics really bring the game to life.",
                        "vi": "Đồ họa chân thực thực sự làm cho trò chơi trở nên sống động."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5a7edad69c94fc0b3003dde7e602768",
        "word": "subject matter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌbdʒɪkt mætə(r)/",
            "us": "/ˈsʌbdʒɪkt mætər/"
        },
        "nearby": [
            {
                "word": "subjectivity",
                "pos": "noun"
            },
            {
                "word": "subject line",
                "pos": "noun"
            },
            {
                "word": "subject matter",
                "pos": "noun"
            },
            {
                "word": "subject to",
                "pos": "phrasal verb"
            },
            {
                "word": "sub judice",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ideas or information contained in a book, speech, painting, etc.",
                    "vi": "những ý tưởng hoặc thông tin có trong một cuốn sách, bài phát biểu, bức tranh, v.v."
                },
                "examples": [
                    {
                        "en": "The artist was revolutionary in both subject matter and technique.",
                        "vi": "Người nghệ sĩ đã cách mạng cả về chủ đề và kỹ thuật."
                    },
                    {
                        "en": "She's searching for subject matter for her new book.",
                        "vi": "Cô ấy đang tìm kiếm chủ đề cho cuốn sách mới của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "451a842e448f429894d0b387859ae7ef",
        "word": "vivid",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɪvɪd/",
            "us": "/ˈvɪvɪd/"
        },
        "nearby": [
            {
                "word": "vive la difference",
                "pos": "exclamation"
            },
            {
                "word": "Vivian",
                "pos": ""
            },
            {
                "word": "vivid",
                "pos": "adjective"
            },
            {
                "word": "vividly",
                "pos": "adverb"
            },
            {
                "word": "vividness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "producing very clear pictures in your mind",
                    "vi": "tạo ra những hình ảnh rất rõ ràng trong tâm trí bạn"
                },
                "examples": [
                    {
                        "en": "vivid memories",
                        "vi": "ký ức sống động"
                    },
                    {
                        "en": "He gave a vivid account of his life as a fighter pilot.",
                        "vi": "Ông đã kể lại một cách sống động về cuộc đời của mình với tư cách là một phi công chiến đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very bright",
                    "vi": "rất sáng"
                },
                "examples": [
                    {
                        "en": "vivid blue eyes",
                        "vi": "đôi mắt xanh sống động"
                    },
                    {
                        "en": "The colours are vivid, which helps bring the game to life.",
                        "vi": "Màu sắc sống động, giúp làm cho trò chơi trở nên sống động."
                    },
                    {
                        "en": "His eyes were a vivid green.",
                        "vi": "Đôi mắt anh ta có một màu xanh lá cây sống động."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to form pictures of ideas, situations, etc. easily in the mind",
                    "vi": "có thể hình thành các hình ảnh về ý tưởng, tình huống, v.v. một cách dễ dàng trong tâm trí"
                },
                "examples": [
                    {
                        "en": "a wonderfully vivid imagination",
                        "vi": "một trí tưởng tượng sống động tuyệt vời"
                    }
                ]
            }
        ]
    },
    {
        "id": "31b6ca21907944bfa0e25d14fdd54a15",
        "word": "classical",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈklæsɪkl/",
            "us": "/ˈklæsɪkl/"
        },
        "nearby": [
            {
                "word": "classic",
                "pos": "adjective"
            },
            {
                "word": "classic",
                "pos": "noun"
            },
            {
                "word": "classical",
                "pos": "adjective"
            },
            {
                "word": "classically",
                "pos": "adverb"
            },
            {
                "word": "classical music",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to classical music",
                    "vi": "liên quan đến âm nhạc cổ điển"
                },
                "examples": [
                    {
                        "en": "a classical composer/musician/pianist",
                        "vi": "một nhà soạn nhạc / nhạc sĩ / nghệ sĩ dương cầm cổ điển"
                    },
                    {
                        "en": "a classical concert",
                        "vi": "một buổi hòa nhạc cổ điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "widely accepted and used for a long time; traditional in style or idea",
                    "vi": "được chấp nhận rộng rãi và sử dụng trong thời gian dài; truyền thống trong phong cách hoặc ý tưởng"
                },
                "examples": [
                    {
                        "en": "the classical economics of Smith and Ricardo",
                        "vi": "kinh tế học cổ điển của Smith và Ricardo"
                    },
                    {
                        "en": "the classical theory of unemployment",
                        "vi": "lý thuyết cổ điển về thất nghiệp"
                    },
                    {
                        "en": "classical and modern ballet/dance",
                        "vi": "múa ba lê / khiêu vũ cổ điển và hiện đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with or influenced by the culture of ancient Greece and Rome",
                    "vi": "kết nối với hoặc chịu ảnh hưởng của văn hóa Hy Lạp và La Mã cổ đại"
                },
                "examples": [
                    {
                        "en": "classical studies",
                        "vi": "nghiên cứu cổ điển"
                    },
                    {
                        "en": "a classical scholar (= an expert in Latin and Greek)",
                        "vi": "một học giả cổ điển (= một chuyên gia về tiếng Latinh và tiếng Hy Lạp)"
                    },
                    {
                        "en": "classical architecture",
                        "vi": "kiến trúc cổ điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "with all the features you would expect to find; very typical",
                    "vi": "với tất cả các tính năng bạn muốn tìm thấy; rất điển hình"
                },
                "examples": [
                    {
                        "en": "These are classical examples of food allergy.",
                        "vi": "Đây là những ví dụ điển hình về dị ứng thực phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "ancient in its form and no longer used in a spoken form",
                    "vi": "ở dạng cổ xưa và không còn được sử dụng ở dạng nói"
                },
                "examples": [
                    {
                        "en": "classical Arabic",
                        "vi": "tiếng Ả Rập cổ điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "simple and attractive",
                    "vi": "đơn giản và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "the classical elegance of the design",
                        "vi": "sự sang trọng cổ điển của thiết kế"
                    }
                ]
            }
        ]
    },
    {
        "id": "a479178988b84167b94fbd2e28686651",
        "word": "decorative",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdekərətɪv/",
            "us": "/ˈdekəreɪtɪv/"
        },
        "nearby": [
            {
                "word": "decorating",
                "pos": "noun"
            },
            {
                "word": "decoration",
                "pos": "noun"
            },
            {
                "word": "decorative",
                "pos": "adjective"
            },
            {
                "word": "decorative arts",
                "pos": "noun"
            },
            {
                "word": "decorator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "decorated in a way that makes it attractive; intended to look attractive or pretty",
                    "vi": "được trang trí theo cách làm cho nó hấp dẫn; dự định trông hấp dẫn hoặc xinh đẹp"
                },
                "examples": [
                    {
                        "en": "The mirror is functional yet decorative.",
                        "vi": "Gương có chức năng nhưng vẫn là vật trang trí."
                    },
                    {
                        "en": "These are purely decorative arches.",
                        "vi": "Đây hoàn toàn là những mái vòm trang trí."
                    },
                    {
                        "en": "The decorative touches have made this house a warm and welcoming home.",
                        "vi": "Những nét trang trí đã làm cho ngôi nhà này trở thành một ngôi nhà ấm áp và thân thiện."
                    },
                    {
                        "en": "The style is ornate and highly decorative.",
                        "vi": "Phong cách được trang trí công phu và mang tính trang trí cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "1628e140f527407e9dc30f3cdb9acead",
        "word": "depict",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈpɪkt/",
            "us": "/dɪˈpɪkt/"
        },
        "nearby": [
            {
                "word": "depersonalization",
                "pos": "noun"
            },
            {
                "word": "depersonalize",
                "pos": "verb"
            },
            {
                "word": "depict",
                "pos": "verb"
            },
            {
                "word": "depiction",
                "pos": "noun"
            },
            {
                "word": "depilator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show an image of somebody/something in a picture",
                    "vi": "để hiển thị hình ảnh của ai đó / cái gì đó trong một bức tranh"
                },
                "examples": [
                    {
                        "en": "depict somebody/something (as somebody/something) a painting depicting the Virgin and Child",
                        "vi": "mô tả ai đó / cái gì đó (như ai đó / cái gì đó) một bức tranh mô tả Đức mẹ Đồng trinh và Đứa trẻ"
                    },
                    {
                        "en": "depict somebody/something doing something The artist had depicted her lying on a bed.",
                        "vi": "mô tả ai đó / điều gì đó đang làm điều gì đó Người nghệ sĩ đã mô tả cô ấy đang nằm trên giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe something in words, or give an impression of something in words or with a picture",
                    "vi": "để mô tả điều gì đó bằng lời hoặc tạo ấn tượng về điều gì đó bằng lời hoặc bằng hình ảnh"
                },
                "examples": [
                    {
                        "en": "depict somebody/something The novel depicts French society in the 1930s.",
                        "vi": "mô tả ai đó / cái gì đó Cuốn tiểu thuyết mô tả xã hội Pháp những năm 1930."
                    },
                    {
                        "en": "depict somebody/something as somebody/something The advertisements depicted smoking as glamorous and attractive.",
                        "vi": "mô tả ai đó / cái gì đó là ai đó / cái gì đó Các quảng cáo mô tả việc hút thuốc là quyến rũ và hấp dẫn."
                    }
                ]
            }
        ]
    },
    {
        "id": "a1983ead27c24a27a9d10f2635a62450",
        "word": "depth",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/depθ/",
            "us": "/depθ/"
        },
        "nearby": [
            {
                "word": "De Profundis",
                "pos": ""
            },
            {
                "word": "Dept",
                "pos": "abbreviation"
            },
            {
                "word": "depth",
                "pos": "noun"
            },
            {
                "word": "depth charge",
                "pos": "noun"
            },
            {
                "word": "depth of field",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the distance from the top or surface to the bottom of something; a particular distance down from the surface of something",
                    "vi": "khoảng cách từ đỉnh hoặc bề mặt đến đáy của một thứ gì đó; một khoảng cách cụ thể xuống từ bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "depth of something What's the depth of the water here?",
                        "vi": "độ sâu của cái gì Độ sâu của nước ở đây là gì?"
                    },
                    {
                        "en": "the depth of a cut/wound/crack",
                        "vi": "độ sâu của một vết cắt / vết thương / vết nứt"
                    },
                    {
                        "en": "at a depth of something Water was found at a depth of 30 metres.",
                        "vi": "ở độ sâu của vật gì đó Nước được tìm thấy ở độ sâu 30 mét."
                    },
                    {
                        "en": "to a depth of something They dug down to a depth of two metres.",
                        "vi": "đến độ sâu của cái gì đó Họ đào xuống độ sâu hai mét."
                    },
                    {
                        "en": "Many dolphins can dive to depths of 200 metres.",
                        "vi": "Nhiều loài cá heo có thể lặn xuống độ sâu 200 mét."
                    },
                    {
                        "en": "in depth The oil well extended several hundreds of feet in depth.",
                        "vi": "độ sâu Giếng dầu kéo dài hàng trăm mét sâu."
                    },
                    {
                        "en": "at depth The camera must be strong enough to resist the immense water pressure at depth.",
                        "vi": "ở độ sâu Máy ảnh phải đủ mạnh để chống lại áp lực nước lớn ở độ sâu."
                    },
                    {
                        "en": "Most earthquakes occur at much shallower depths, usually less than 30 kilometres.",
                        "vi": "Hầu hết các trận động đất xảy ra ở độ sâu nông hơn nhiều, thường dưới 30 km."
                    }
                ]
            },
            {
                "define": {
                    "en": "the distance from the front to the back of something",
                    "vi": "khoảng cách từ phía trước đến phía sau của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The depth of the shelves is 30 centimetres.",
                        "vi": "Chiều sâu của kệ là 30 cm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the strength and power of feelings",
                    "vi": "sức mạnh và sức mạnh của cảm xúc"
                },
                "examples": [
                    {
                        "en": "the depth of her love",
                        "vi": "chiều sâu của tình yêu của cô ấy"
                    },
                    {
                        "en": "music of great emotional depth",
                        "vi": "âm nhạc có chiều sâu cảm xúc tuyệt vời"
                    }
                ]
            },
            {
                "define": {
                    "en": "qualities that give somebody/something extra character and make them/it interesting",
                    "vi": "những phẩm chất mang lại cho ai đó / điều gì đó đặc biệt hơn và khiến họ / điều đó trở nên thú vị"
                },
                "examples": [
                    {
                        "en": "The separate storylines really add depth and personality to the characters.",
                        "vi": "Các cốt truyện riêng biệt thực sự tạo thêm chiều sâu và cá tính cho các nhân vật."
                    },
                    {
                        "en": "This film lacks the complexity or depth of his best movies.",
                        "vi": "Bộ phim này thiếu sự phức tạp hay chiều sâu như những bộ phim hay nhất của anh ấy."
                    },
                    {
                        "en": "Her paintings reveal hidden depths (= unknown and interesting things about her character).",
                        "vi": "Những bức tranh của cô ấy tiết lộ những chiều sâu tiềm ẩn (= những điều chưa biết và thú vị về nhân vật của cô ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of knowing or understanding a lot of details about something; the ability to provide and explain these details",
                    "vi": "chất lượng của việc biết hoặc hiểu rất nhiều chi tiết về điều gì đó; khả năng cung cấp và giải thích những chi tiết này"
                },
                "examples": [
                    {
                        "en": "a writer of great wisdom and depth",
                        "vi": "một nhà văn của trí tuệ tuyệt vời và chiều sâu"
                    },
                    {
                        "en": "His ideas lack depth.",
                        "vi": "Ý tưởng của anh ấy thiếu chiều sâu."
                    },
                    {
                        "en": "She has the ability to treat big subjects with breadth and depth.",
                        "vi": "Cô ấy có khả năng xử lý các đối tượng lớn với chiều rộng và chiều sâu."
                    },
                    {
                        "en": "depth of something a job that doesn’t require any great depth of knowledge",
                        "vi": "độ sâu của một cái gì đó một công việc không đòi hỏi bất kỳ chiều sâu kiến thức nào"
                    },
                    {
                        "en": "Younger students cannot be expected to have great depth of understanding.",
                        "vi": "Học sinh nhỏ tuổi hơn không thể được mong đợi để có hiểu biết sâu rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the deepest, most extreme or serious part of something",
                    "vi": "phần sâu nhất, cực đoan nhất hoặc nghiêm trọng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the depths of the ocean",
                        "vi": "độ sâu của đại dương"
                    },
                    {
                        "en": "to live in the depths of the country (= a long way from a town)",
                        "vi": "sống ở vùng sâu của đất nước (= một chặng đường dài từ một thị trấn)"
                    },
                    {
                        "en": "in the depths of winter (= when it is coldest)",
                        "vi": "ở sâu trong mùa đông (= khi trời lạnh nhất)"
                    },
                    {
                        "en": "She was in the depths of despair.",
                        "vi": "Cô chìm trong hố sâu của sự tuyệt vọng."
                    },
                    {
                        "en": "He gazed into the depths of her eyes.",
                        "vi": "Anh nhìn vào sâu trong mắt cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "the strength of a colour",
                    "vi": "sức mạnh của một màu"
                },
                "examples": [
                    {
                        "en": "Strong light will affect the depth of colour of your carpets and curtains.",
                        "vi": "Ánh sáng mạnh sẽ ảnh hưởng đến độ sâu của màu sắc của thảm và rèm cửa của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality in a work of art or a photograph that makes it appear not to be flat",
                    "vi": "chất lượng của một tác phẩm nghệ thuật hoặc một bức ảnh làm cho nó có vẻ không bằng phẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in water that is too deep to stand in with your head above water",
                    "vi": "ở trong nước quá sâu để có thể đứng với đầu trên mặt nước"
                },
                "examples": [
                    {
                        "en": "If you can't swim, don't go out of your depth.",
                        "vi": "Nếu bạn không thể bơi, đừng đi ra khỏi độ sâu của bạn."
                    },
                    {
                        "en": "I don't like going out of my depth in the sea.",
                        "vi": "Tôi không thích đi ra khỏi độ sâu của mình trong biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to understand something because it is too difficult; to be in a situation that you cannot control",
                    "vi": "không thể hiểu điều gì đó vì nó quá khó; ở trong một tình huống mà bạn không thể kiểm soát"
                },
                "examples": [
                    {
                        "en": "He felt totally out of his depth in his new job.",
                        "vi": "Anh ấy cảm thấy hoàn toàn không có chiều sâu trong công việc mới của mình."
                    },
                    {
                        "en": "The writer seems a little out of her depth when dealing with the emotional issue involved.",
                        "vi": "Người viết có vẻ hơi thiếu chiều sâu khi giải quyết vấn đề tình cảm liên quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a detailed, careful and complete way",
                    "vi": "một cách chi tiết, cẩn thận và đầy đủ"
                },
                "examples": [
                    {
                        "en": "I haven't looked at the report in depth yet.",
                        "vi": "Tôi vẫn chưa xem xét báo cáo một cách sâu sắc."
                    },
                    {
                        "en": "an in-depth study",
                        "vi": "một nghiên cứu chuyên sâu"
                    },
                    {
                        "en": "I studied phonology in depth at college.",
                        "vi": "Tôi đã học chuyên sâu về âm vị học tại trường đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or to experience an extreme example of something unpleasant",
                    "vi": "trở thành hoặc trải nghiệm một ví dụ cực đoan về điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "His latest novel plumbs the depths of horror and violence.",
                        "vi": "Cuốn tiểu thuyết mới nhất của ông nhấn mạnh vào chiều sâu của kinh dị và bạo lực."
                    },
                    {
                        "en": "It was at that stage in her life when she plumbed the depths of despair.",
                        "vi": "Đó là giai đoạn trong cuộc đời cô khi cô rơi xuống vực sâu của sự tuyệt vọng."
                    },
                    {
                        "en": "The team's poor performances plumbed new depths last night when they lost 10–2.",
                        "vi": "Màn trình diễn tệ hại của đội đã giảm sâu vào đêm qua khi họ thua 10–2."
                    },
                    {
                        "en": "The story plumbed the depths of tabloid journalism.",
                        "vi": "Câu chuyện làm sụt giảm độ sâu của báo chí lá cải."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being strong because you have a great variety of good people, ideas, etc. that can contribute to the success of something",
                    "vi": "phẩm chất của sự mạnh mẽ bởi vì bạn có rất nhiều người tốt, ý tưởng, v.v. có thể đóng góp vào sự thành công của điều gì đó"
                },
                "examples": [
                    {
                        "en": "The French team does not have the strength in depth that the Australians have.",
                        "vi": "Đội tuyển Pháp không có thế mạnh về chiều sâu như đội tuyển Úc."
                    }
                ]
            }
        ]
    },
    {
        "id": "59b0ea3d681b456abef84768eb352b4b",
        "word": "finish",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɪnɪʃ/",
            "us": "/ˈfɪnɪʃ/"
        },
        "nearby": [
            {
                "word": "finings",
                "pos": "noun"
            },
            {
                "word": "finish",
                "pos": "verb"
            },
            {
                "word": "finish",
                "pos": "noun"
            },
            {
                "word": "finished",
                "pos": "adjective"
            },
            {
                "word": "finisher",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the last part or the end of something",
                    "vi": "phần cuối cùng hoặc phần cuối của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It was a close finish as they had predicted.",
                        "vi": "Đó là một kết thúc gần như họ đã dự đoán."
                    },
                    {
                        "en": "They won in the end but it was a tight finish.",
                        "vi": "Cuối cùng thì họ cũng thắng nhưng đó là một pha kết thúc không chặt chẽ."
                    },
                    {
                        "en": "finish to something a dramatic finish to the race",
                        "vi": "hoàn thành một cái gì đó một kết thúc ấn tượng cho cuộc đua"
                    },
                    {
                        "en": "The story was a lie from start to finish.",
                        "vi": "Câu chuyện là một lời nói dối từ đầu đến cuối."
                    },
                    {
                        "en": "to the finish I want to see the job through to the finish.",
                        "vi": "để hoàn thành tôi muốn xem công việc cho đến khi kết thúc."
                    },
                    {
                        "en": "at the finish Several runners needed medical attention at the finish.",
                        "vi": "về đích Một số vận động viên chạy cần được chăm sóc y tế khi về đích."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position in which a person or team finishes a competition",
                    "vi": "vị trí mà một người hoặc một đội kết thúc cuộc thi"
                },
                "examples": [
                    {
                        "en": "a second-/third-/fourth-place finish",
                        "vi": "về đích ở vị trí thứ hai / thứ ba- / thứ tư"
                    },
                    {
                        "en": "The team are aiming for a top-five finish.",
                        "vi": "Đội đang hướng tới mục tiêu lọt vào top 5."
                    }
                ]
            },
            {
                "define": {
                    "en": "the last layer of paint, polish, etc. that is put onto the surface of something; the condition of the surface",
                    "vi": "lớp cuối cùng của sơn, chất đánh bóng, v.v. được phủ lên bề mặt của một thứ gì đó; tình trạng của bề mặt"
                },
                "examples": [
                    {
                        "en": "a gloss/matt finish",
                        "vi": "một lớp hoàn thiện bóng / mờ"
                    },
                    {
                        "en": "furniture available in a range of finishes",
                        "vi": "đồ nội thất có sẵn trong một loạt các hoàn thiện"
                    },
                    {
                        "en": "to apply extra coats of finish",
                        "vi": "phủ thêm lớp hoàn thiện"
                    }
                ]
            },
            {
                "define": {
                    "en": "the final details that are added to something to make it complete",
                    "vi": "các chi tiết cuối cùng được thêm vào một cái gì đó để làm cho nó hoàn chỉnh"
                },
                "examples": [
                    {
                        "en": "The bows will give a feminine finish to the curtains.",
                        "vi": "Những chiếc nơ sẽ mang lại vẻ nữ tính cho rèm cửa."
                    },
                    {
                        "en": "This trim really does give the garment a professional finish.",
                        "vi": "Phần trang trí này thực sự mang lại cho trang phục một sự hoàn thiện chuyên nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sports competition, election, etc. between sides that are so equal in ability that they continue fighting very hard until the end",
                    "vi": "một cuộc thi đấu thể thao, bầu cử, v.v. giữa các bên ngang nhau về khả năng đến nỗi họ tiếp tục chiến đấu hết mình cho đến cuối cùng"
                },
                "examples": [
                    {
                        "en": "Six teams are bitter rivals in what will be a fight to the finish.",
                        "vi": "Sáu đội là những đối thủ khó chịu trong cuộc chiến đến cùng."
                    },
                    {
                        "en": "If the polls are wrong and it's a fight to the finish, the result may not be known until all the votes have been counted.",
                        "vi": "Nếu các cuộc thăm dò sai và đó là một cuộc chiến đến cùng, kết quả có thể không được biết cho đến khi tất cả các phiếu bầu đã được kiểm tra."
                    }
                ]
            }
        ]
    },
    {
        "id": "166f901512544d4c89417ab79d0e9bdc",
        "word": "harmony",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːməni/",
            "us": "/ˈhɑːrməni/"
        },
        "nearby": [
            {
                "word": "harmonize",
                "pos": "verb"
            },
            {
                "word": "Harmonized Sales Tax",
                "pos": "noun"
            },
            {
                "word": "harmony",
                "pos": "noun"
            },
            {
                "word": "Harmsworth",
                "pos": ""
            },
            {
                "word": "harness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state of peaceful existence and agreement",
                    "vi": "một trạng thái tồn tại hòa bình và thỏa thuận"
                },
                "examples": [
                    {
                        "en": "social/racial harmony",
                        "vi": "hòa hợp xã hội / chủng tộc"
                    },
                    {
                        "en": "in harmony They lived together in perfect harmony.",
                        "vi": "trong sự hòa hợp Họ đã sống với nhau trong sự hòa hợp hoàn hảo."
                    },
                    {
                        "en": "in harmony with something the need to be in harmony with our environment",
                        "vi": "hài hòa với một cái gì đó cần phải hài hòa với môi trường của chúng ta"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which different notes that are played or sung together combine to make a pleasant sound",
                    "vi": "cách mà các nốt nhạc khác nhau được chơi hoặc hát cùng nhau kết hợp để tạo ra âm thanh vui tai"
                },
                "examples": [
                    {
                        "en": "in harmony to sing in harmony",
                        "vi": "hòa hợp để hát trong hòa âm"
                    },
                    {
                        "en": "They began to sing in perfect four-part harmony.",
                        "vi": "Họ bắt đầu hát trong bốn phần hòa âm hoàn hảo."
                    },
                    {
                        "en": "passionate lyrics and stunning vocal harmonies",
                        "vi": "lời bài hát nồng nàn và hòa âm giọng hát tuyệt vời"
                    }
                ]
            },
            {
                "define": {
                    "en": "an attractive combination of related things",
                    "vi": "một sự kết hợp hấp dẫn của những thứ liên quan"
                },
                "examples": [
                    {
                        "en": "the harmony of colour in nature",
                        "vi": "sự hài hòa của màu sắc trong tự nhiên"
                    },
                    {
                        "en": "The designer’s aim is to produce a harmony of shape and texture.",
                        "vi": "Mục đích của nhà thiết kế là tạo ra sự hài hòa về hình dạng và kết cấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "39aff4226fe9429da9936b816d49d282",
        "word": "inspiration",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnspəˈreɪʃn/",
            "us": "/ˌɪnspəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "Inspector Morse",
                "pos": ""
            },
            {
                "word": "inspector of taxes",
                "pos": "noun"
            },
            {
                "word": "inspiration",
                "pos": "noun"
            },
            {
                "word": "inspirational",
                "pos": "adjective"
            },
            {
                "word": "inspire",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process that takes place when somebody sees or hears something that causes them to have exciting new ideas or makes them want to create something, especially in art, music or literature",
                    "vi": "quá trình diễn ra khi ai đó nhìn thấy hoặc nghe thấy điều gì đó khiến họ có những ý tưởng mới thú vị hoặc khiến họ muốn tạo ra thứ gì đó, đặc biệt là trong nghệ thuật, âm nhạc hoặc văn học"
                },
                "examples": [
                    {
                        "en": "Dreams can be a rich source of inspiration for an artist.",
                        "vi": "Ước mơ có thể là nguồn cảm hứng dồi dào cho một nghệ sĩ."
                    },
                    {
                        "en": "Both poets drew their inspiration from the countryside.",
                        "vi": "Cả hai nhà thơ đều lấy cảm hứng từ nông thôn."
                    },
                    {
                        "en": "Her work lacks inspiration (= it does not contain any exciting new ideas).",
                        "vi": "Công việc của cô ấy thiếu cảm hứng (= nó không chứa bất kỳ ý tưởng mới thú vị nào)."
                    },
                    {
                        "en": "inspiration for something Looking for inspiration for a new dessert? Try this recipe.",
                        "vi": "cảm hứng cho một cái gì đó Tìm kiếm cảm hứng cho một món tráng miệng mới? Hãy thử công thức này."
                    },
                    {
                        "en": "inspiration to do something She had the time and the inspiration to develop her talent.",
                        "vi": "cảm hứng để làm điều gì đó Cô ấy có thời gian và cảm hứng để phát triển tài năng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the reason why somebody creates or does something",
                    "vi": "một người hoặc một vật là lý do tại sao ai đó tạo ra hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "inspiration (for something) He says my sister was the inspiration for his heroine.",
                        "vi": "nguồn cảm hứng (cho một cái gì đó) Anh ấy nói rằng em gái tôi là nguồn cảm hứng cho nữ anh hùng của anh ấy."
                    },
                    {
                        "en": "inspiration behind something Clark was the inspiration behind Saturday's victory.",
                        "vi": "nguồn cảm hứng đằng sau điều gì đó Clark là nguồn cảm hứng đằng sau chiến thắng hôm thứ Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that makes you want to be better, more successful, etc.",
                    "vi": "một người hoặc điều khiến bạn muốn trở nên tốt hơn, thành công hơn, v.v."
                },
                "examples": [
                    {
                        "en": "inspiration to somebody Her charity work is an inspiration to us all.",
                        "vi": "nguồn cảm hứng cho ai đó Công việc từ thiện của cô ấy là nguồn cảm hứng cho tất cả chúng ta."
                    },
                    {
                        "en": "inspiration for somebody She became an inspiration and a role model for a new generation of women.",
                        "vi": "nguồn cảm hứng cho ai đó Cô ấy đã trở thành nguồn cảm hứng và hình mẫu cho thế hệ phụ nữ mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden good idea",
                    "vi": "một ý tưởng hay đột ngột"
                },
                "examples": [
                    {
                        "en": "He had an inspiration: he'd give her a dog for her birthday.",
                        "vi": "Anh có một nguồn cảm hứng: anh sẽ tặng cô một con chó nhân ngày sinh nhật của cô."
                    },
                    {
                        "en": "It came to me in a flash of inspiration.",
                        "vi": "Nó đến với tôi trong một khoảnh khắc đầy cảm hứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ef77936ed58477da988b0e498fdcb93",
        "word": "reproduction",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːprəˈdʌkʃn/",
            "us": "/ˌriːprəˈdʌkʃn/"
        },
        "nearby": [
            {
                "word": "reproduce",
                "pos": "verb"
            },
            {
                "word": "reproducible",
                "pos": "adjective"
            },
            {
                "word": "reproduction",
                "pos": "noun"
            },
            {
                "word": "reproductive",
                "pos": "adjective"
            },
            {
                "word": "reprographics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of producing babies, young animals or plants",
                    "vi": "hành động hoặc quá trình sinh ra trẻ sơ sinh, động vật non hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "sexual reproduction",
                        "vi": "sinh sản hữu tính"
                    },
                    {
                        "en": "They are studying reproduction in shellfish.",
                        "vi": "Họ đang nghiên cứu sự sinh sản ở động vật có vỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of producing copies of a document, book, picture, etc.",
                    "vi": "hành động hoặc quá trình tạo ra các bản sao của tài liệu, sách, hình ảnh, v.v."
                },
                "examples": [
                    {
                        "en": "Use a black pen on white paper to ensure good reproduction.",
                        "vi": "Sử dụng bút đen trên giấy trắng để đảm bảo tái tạo tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of recorded sound",
                    "vi": "chất lượng của âm thanh được ghi lại"
                },
                "examples": [
                    {
                        "en": "Digital recording gives excellent sound reproduction.",
                        "vi": "Ghi âm kỹ thuật số cho khả năng tái tạo âm thanh tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that has been reproduced, especially a copy of a work of art",
                    "vi": "một thứ đã được sao chép, đặc biệt là bản sao của một tác phẩm nghệ thuật"
                },
                "examples": [
                    {
                        "en": "They have a catalogue with colour reproductions of the paintings for sale.",
                        "vi": "Họ có một danh mục với các bản sao chép màu sắc của các bức tranh để bán."
                    },
                    {
                        "en": "reproduction furniture (= furniture made as a copy of an earlier style)",
                        "vi": "đồ nội thất tái tạo (= đồ nội thất được làm như một bản sao của phong cách trước đó)"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9820d3553f1498691801a3d3b35788d",
        "word": "shading",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃeɪdɪŋ/",
            "us": "/ˈʃeɪdɪŋ/"
        },
        "nearby": [
            {
                "word": "shade into",
                "pos": "phrasal verb"
            },
            {
                "word": "shade tree",
                "pos": "noun"
            },
            {
                "word": "shading",
                "pos": "noun"
            },
            {
                "word": "shadow",
                "pos": "noun"
            },
            {
                "word": "shadow",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the use of colour, pencil lines, etc. to give an impression of light and shade in a picture or to emphasize areas of a map, diagram, etc.",
                    "vi": "việc sử dụng màu sắc, đường kẻ chì, v.v. để tạo ấn tượng về ánh sáng và bóng râm trong một bức tranh hoặc để nhấn mạnh các khu vực của bản đồ, sơ đồ, v.v."
                },
                "examples": [
                    {
                        "en": "an effect that is achieved with subtle shading",
                        "vi": "một hiệu ứng đạt được với bóng mờ tinh tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "slight differences that exist between different aspects of the same thing",
                    "vi": "sự khác biệt nhỏ tồn tại giữa các khía cạnh khác nhau của cùng một thứ"
                },
                "examples": [
                    {
                        "en": "the shadings of opinion found among church leaders",
                        "vi": "bóng mờ của quan điểm được tìm thấy giữa các nhà lãnh đạo nhà thờ"
                    }
                ]
            }
        ]
    },
    {
        "id": "bdda7e30520c4dbdbe88cc64364b4c37",
        "word": "stylistic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/staɪˈlɪstɪk/",
            "us": "/staɪˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "stylishness",
                "pos": "noun"
            },
            {
                "word": "stylist",
                "pos": "noun"
            },
            {
                "word": "stylistic",
                "pos": "adjective"
            },
            {
                "word": "stylistically",
                "pos": "adverb"
            },
            {
                "word": "stylistics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the style an artist uses in a particular piece of art, writing or music",
                    "vi": "được kết nối với phong cách mà một nghệ sĩ sử dụng trong một tác phẩm nghệ thuật, văn bản hoặc âm nhạc cụ thể"
                },
                "examples": [
                    {
                        "en": "stylistic analysis",
                        "vi": "phân tích phong cách"
                    },
                    {
                        "en": "stylistic features",
                        "vi": "các tính năng phong cách"
                    }
                ]
            }
        ]
    },
    {
        "id": "91f3084c26d04d7086bdd2f8bedd117c",
        "word": "surreal",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈriːəl/",
            "us": "/səˈriːəl/"
        },
        "nearby": [
            {
                "word": "surprising",
                "pos": "adjective"
            },
            {
                "word": "surprisingly",
                "pos": "adverb"
            },
            {
                "word": "surreal",
                "pos": "adjective"
            },
            {
                "word": "surrealism",
                "pos": "noun"
            },
            {
                "word": "surrealist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very strange; more like a dream than reality, with ideas and images mixed together in a strange way",
                    "vi": "rất lạ; giống một giấc mơ hơn là thực tế, với những ý tưởng và hình ảnh được trộn lẫn với nhau một cách kỳ lạ"
                },
                "examples": [
                    {
                        "en": "surreal images",
                        "vi": "hình ảnh siêu thực"
                    },
                    {
                        "en": "The play was a surreal mix of fact and fantasy.",
                        "vi": "Vở kịch là sự pha trộn kỳ quái giữa thực tế và giả tưởng."
                    }
                ]
            }
        ]
    },
    {
        "id": "523b2e7cb6ec4a00a00d9720c1ee0e62",
        "word": "symbolic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/sɪmˈbɒlɪk/",
            "us": "/sɪmˈbɑːlɪk/"
        },
        "nearby": [
            {
                "word": "symbiotically",
                "pos": "adverb"
            },
            {
                "word": "symbol",
                "pos": "noun"
            },
            {
                "word": "symbolic",
                "pos": "adjective"
            },
            {
                "word": "symbolically",
                "pos": "adverb"
            },
            {
                "word": "symbolism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing symbols, or being used as a symbol",
                    "vi": "chứa các ký hiệu hoặc được sử dụng như một biểu tượng"
                },
                "examples": [
                    {
                        "en": "He shook his fist in a symbolic gesture of defiance.",
                        "vi": "Anh ta lắc nắm tay trong một cử chỉ biểu tượng của sự thách thức."
                    },
                    {
                        "en": "The ceremony has a deep symbolic meaning.",
                        "vi": "Buổi lễ mang ý nghĩa biểu tượng sâu sắc."
                    },
                    {
                        "en": "The new regulations are largely symbolic (= they will not have any real effect).",
                        "vi": "Các quy định mới phần lớn chỉ mang tính biểu tượng (= chúng sẽ không có bất kỳ hiệu lực thực sự nào)."
                    },
                    {
                        "en": "symbolic of something The dove is symbolic of peace.",
                        "vi": "biểu tượng của một cái gì đó Chim bồ câu là biểu tượng của hòa bình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ef36ca091f664262a1743948cc2b4bd3",
        "word": "viewpoint",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvjuːpɔɪnt/",
            "us": "/ˈvjuːpɔɪnt/"
        },
        "nearby": [
            {
                "word": "viewership",
                "pos": "noun"
            },
            {
                "word": "viewfinder",
                "pos": "noun"
            },
            {
                "word": "viewpoint",
                "pos": "noun"
            },
            {
                "word": "viewport",
                "pos": "noun"
            },
            {
                "word": "vigil",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of thinking about a subject",
                    "vi": "một cách suy nghĩ về một chủ đề"
                },
                "examples": [
                    {
                        "en": "from a… viewpoint Try looking at things from a different viewpoint.",
                        "vi": "từ một… quan điểm Hãy thử nhìn mọi thứ từ một quan điểm khác."
                    },
                    {
                        "en": "From a practical viewpoint, I'd advise you not to go.",
                        "vi": "Từ quan điểm thực tế, tôi khuyên bạn không nên đi."
                    },
                    {
                        "en": "viewpoint on something She will have her own viewpoint on the matter.",
                        "vi": "quan điểm về điều gì đó Cô ấy sẽ có quan điểm riêng của mình về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a direction or place from which you look at something",
                    "vi": "một hướng hoặc địa điểm mà từ đó bạn nhìn vào thứ gì đó"
                },
                "examples": [
                    {
                        "en": "from a… viewpoint The artist has painted the scene from various viewpoints.",
                        "vi": "từ một… góc nhìn Người nghệ sĩ đã vẽ cảnh từ nhiều góc nhìn khác nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "035594c1625848b08ce1db3051df4eaa",
        "word": "cityscape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪtiskeɪp/",
            "us": "/ˈsɪtiskeɪp/"
        },
        "nearby": [
            {
                "word": "city planner",
                "pos": "noun"
            },
            {
                "word": "city planning",
                "pos": "noun"
            },
            {
                "word": "cityscape",
                "pos": "noun"
            },
            {
                "word": "city slicker",
                "pos": "noun"
            },
            {
                "word": "city state",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance of a city or urban area, especially in a picture; a picture of a city",
                    "vi": "sự xuất hiện của một thành phố hoặc khu vực đô thị, đặc biệt là trong một bức tranh; một bức tranh của một thành phố"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43b82bab58954948b122da501c8ae27e",
        "word": "execute",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeksɪkjuːt/",
            "us": "/ˈeksɪkjuːt/"
        },
        "nearby": [
            {
                "word": "execrable",
                "pos": "adjective"
            },
            {
                "word": "executable",
                "pos": "adjective"
            },
            {
                "word": "execute",
                "pos": "verb"
            },
            {
                "word": "execution",
                "pos": "noun"
            },
            {
                "word": "executioner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to kill somebody, especially as a legal punishment",
                    "vi": "giết ai đó, đặc biệt là như một hình phạt pháp lý"
                },
                "examples": [
                    {
                        "en": "be executed (for something) He was executed for treason.",
                        "vi": "bị xử tử (vì điều gì đó) Anh ta bị xử tử vì tội phản quốc."
                    },
                    {
                        "en": "be executed by something The prisoners were executed by firing squad.",
                        "vi": "bị hành quyết bởi một cái gì đó Các tù nhân bị hành quyết bằng cách xử bắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do a piece of work, perform a duty, put a plan into action, etc.",
                    "vi": "để thực hiện một phần công việc, thực hiện một nhiệm vụ, đưa một kế hoạch vào hành động, v.v."
                },
                "examples": [
                    {
                        "en": "They drew up and executed a plan to reduce fuel consumption.",
                        "vi": "Họ đã lập ra và thực hiện một kế hoạch để giảm mức tiêu thụ nhiên liệu."
                    },
                    {
                        "en": "The crime was very cleverly executed.",
                        "vi": "Tội ác được thực hiện rất khôn khéo."
                    },
                    {
                        "en": "Check that the computer has executed your commands.",
                        "vi": "Kiểm tra xem máy tính đã thực thi các lệnh của bạn chưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to successfully perform an action or movement that requires skill",
                    "vi": "để thực hiện thành công một hành động hoặc chuyển động đòi hỏi kỹ năng"
                },
                "examples": [
                    {
                        "en": "The pilot executed a perfect landing.",
                        "vi": "Phi công đã thực hiện một cú hạ cánh hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make or produce a work of art",
                    "vi": "để làm hoặc sản xuất một tác phẩm nghệ thuật"
                },
                "examples": [
                    {
                        "en": "Picasso also executed several landscapes at Horta de San Juan.",
                        "vi": "Picasso cũng đã thực hiện một số phong cảnh tại Horta de San Juan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to follow the instructions in a legal document; to make a document legally acceptable",
                    "vi": "để làm theo các hướng dẫn trong một văn bản pháp lý; để làm cho một tài liệu được chấp nhận về mặt pháp lý"
                },
                "examples": [
                    {
                        "en": "His will was executed by his lawyers in 2008.",
                        "vi": "Di chúc của ông đã được các luật sư của ông thực hiện vào năm 2008."
                    },
                    {
                        "en": "The agreement had been duly executed.",
                        "vi": "Thỏa thuận đã được thực hiện một cách hợp lệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "65a02161122040efa910dcbb4bfbbb4c",
        "word": "figurative",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪɡərətɪv/",
            "us": "/ˈfɪɡjərətɪv/"
        },
        "nearby": [
            {
                "word": "fig leaf",
                "pos": "noun"
            },
            {
                "word": "figment",
                "pos": "noun"
            },
            {
                "word": "figurative",
                "pos": "adjective"
            },
            {
                "word": "figuratively",
                "pos": "adverb"
            },
            {
                "word": "figure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used in a way that is different from the usual meaning, in order to create a particular mental picture. For example, ‘He exploded with rage’ shows a figurative use of the verb ‘explode’.",
                    "vi": "được sử dụng theo cách khác với ý nghĩa thông thường, nhằm tạo ra một bức tranh tinh thần cụ thể. Ví dụ, 'Anh ấy bùng nổ với cơn thịnh nộ' cho thấy cách sử dụng động từ 'bùng nổ' theo nghĩa bóng."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "showing people, animals and objects as they really look",
                    "vi": "hiển thị con người, động vật và đồ vật như chúng thực sự trông"
                },
                "examples": [
                    {
                        "en": "a figurative artist",
                        "vi": "một nghệ sĩ tượng hình"
                    }
                ]
            }
        ]
    },
    {
        "id": "95d9046ffe4d46c0beabeb17ce9043aa",
        "word": "highbrow",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaɪbraʊ/",
            "us": "/ˈhaɪbraʊ/"
        },
        "nearby": [
            {
                "word": "high-born",
                "pos": "adjective"
            },
            {
                "word": "highboy",
                "pos": "noun"
            },
            {
                "word": "highbrow",
                "pos": "adjective"
            },
            {
                "word": "high chair",
                "pos": "noun"
            },
            {
                "word": "High Church",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "interested in serious artistic or cultural ideas",
                    "vi": "quan tâm đến các ý tưởng nghệ thuật hoặc văn hóa nghiêm túc"
                },
                "examples": [
                    {
                        "en": "highbrow newspapers",
                        "vi": "báo cao"
                    },
                    {
                        "en": "highbrow readers",
                        "vi": "độc giả cao"
                    },
                    {
                        "en": "Highbrow critics generally disapprove of this type of novel.",
                        "vi": "Các nhà phê bình Highbrow thường không tán thành loại tiểu thuyết này."
                    },
                    {
                        "en": "The journal is aimed at a highbrow readership.",
                        "vi": "Tạp chí hướng đến lượng độc giả cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ec265889b7b45468568c6ad6fdd62a6",
        "word": "kitsch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɪtʃ/",
            "us": "/kɪtʃ/"
        },
        "nearby": [
            {
                "word": "Kit Kat",
                "pos": "noun"
            },
            {
                "word": "kit out",
                "pos": "phrasal verb"
            },
            {
                "word": "kitsch",
                "pos": "noun"
            },
            {
                "word": "kitsch",
                "pos": "adjective"
            },
            {
                "word": "kitten",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "works of art or objects that are popular but that are considered to have no real artistic value or not to be in good taste, for example because they are sentimental",
                    "vi": "tác phẩm nghệ thuật hoặc đồ vật phổ biến nhưng được coi là không có giá trị nghệ thuật thực sự hoặc không có tính thẩm mỹ cao, chẳng hạn vì chúng mang tính chất ủy mị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "775a9c4dce4b4288a1791a80bb6977d2",
        "word": "likeness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪknəs/",
            "us": "/ˈlaɪknəs/"
        },
        "nearby": [
            {
                "word": "like-minded",
                "pos": "adjective"
            },
            {
                "word": "liken",
                "pos": "verb"
            },
            {
                "word": "likeness",
                "pos": "noun"
            },
            {
                "word": "liken to",
                "pos": "phrasal verb"
            },
            {
                "word": "likes",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being similar to another person or thing, especially in appearance; an example of this",
                    "vi": "thực tế là giống với người hoặc vật khác, đặc biệt là về ngoại hình; một ví dụ về điều này"
                },
                "examples": [
                    {
                        "en": "Joanna bears a strong likeness to her father.",
                        "vi": "Joanna rất giống cha mình."
                    },
                    {
                        "en": "Do you notice any family likeness between them?",
                        "vi": "Bạn có nhận thấy bất kỳ tình cảm gia đình nào giữa họ không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a painting, drawing, etc. of a person, especially one that looks very like them",
                    "vi": "một bức tranh, bản vẽ, v.v. của một người, đặc biệt là một người trông rất giống họ"
                },
                "examples": [
                    {
                        "en": "The drawing is said to be a good likeness of the girl's attacker.",
                        "vi": "Bức vẽ được cho là một nét đẹp của kẻ tấn công cô gái."
                    },
                    {
                        "en": "As a painter, he had the ability to produce a likeness in a single one-hour sitting.",
                        "vi": "Là một họa sĩ, anh ấy có khả năng tạo ra một bức tranh đáng yêu chỉ trong một giờ ngồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "5aac0874015447b5929f7d2cc2a4b517",
        "word": "lowbrow",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈləʊbraʊ/",
            "us": "/ˈləʊbraʊ/"
        },
        "nearby": [
            {
                "word": "low beams",
                "pos": "noun"
            },
            {
                "word": "low-born",
                "pos": "adjective"
            },
            {
                "word": "lowbrow",
                "pos": "adjective"
            },
            {
                "word": "low-budget",
                "pos": "adjective"
            },
            {
                "word": "low-cal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having no connection with or interest in serious artistic or cultural ideas",
                    "vi": "không có liên hệ hoặc quan tâm đến các ý tưởng nghệ thuật hoặc văn hóa nghiêm túc"
                },
                "examples": [
                    {
                        "en": "lowbrow newspapers",
                        "vi": "báo lowbrow"
                    },
                    {
                        "en": "He has very lowbrow tastes.",
                        "vi": "Anh ấy có thị hiếu rất thấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "6694735007174d07b231e89dfe7f1795",
        "word": "magnum opus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmæɡnəm ˈəʊpəs/",
            "us": "/ˌmæɡnəm ˈəʊpəs/"
        },
        "nearby": [
            {
                "word": "magnolia",
                "pos": "noun"
            },
            {
                "word": "magnum",
                "pos": "noun"
            },
            {
                "word": "magnum opus",
                "pos": "noun"
            },
            {
                "word": "Magnus Magnusson",
                "pos": ""
            },
            {
                "word": "magpie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large and important work of art, literature or music, especially one that people think is the best work ever produced by that artist, writer, etc.",
                    "vi": "một tác phẩm nghệ thuật, văn học hoặc âm nhạc lớn và quan trọng, đặc biệt là tác phẩm mà mọi người nghĩ là tác phẩm hay nhất từng được sản xuất bởi nghệ sĩ, nhà văn, v.v."
                },
                "examples": [
                    {
                        "en": "The author produced his magnum opus just before he died.",
                        "vi": "Tác giả đã sản xuất magnum opus của mình ngay trước khi chết."
                    }
                ]
            }
        ]
    },
    {
        "id": "b6da8aee3bb94fb4b252eb5dbcecadd5",
        "word": "masterwork",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːstəwɜːk/",
            "us": "/ˈmæstərwɜːrk/"
        },
        "nearby": [
            {
                "word": "masterstroke",
                "pos": "noun"
            },
            {
                "word": "master warrant officer",
                "pos": "noun"
            },
            {
                "word": "masterwork",
                "pos": "noun"
            },
            {
                "word": "mastery",
                "pos": "noun"
            },
            {
                "word": "masthead",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a work of art such as a painting, film, book, etc. that is an excellent, or the best, example of the artist’s work",
                    "vi": "một tác phẩm nghệ thuật như tranh vẽ, phim, sách, v.v. là một ví dụ xuất sắc hoặc hay nhất về tác phẩm của nghệ sĩ"
                },
                "examples": [
                    {
                        "en": "a literary/musical/cinematic masterwork",
                        "vi": "một tác phẩm văn học / âm nhạc / điện ảnh"
                    },
                    {
                        "en": "The group will perform three of the composer's late masterworks.",
                        "vi": "Nhóm sẽ biểu diễn ba trong số những tác phẩm cuối cùng của nhà soạn nhạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b47222ae4cd4b5d85055a2eea703ce9",
        "word": "minimalism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪnɪməlɪzəm/",
            "us": "/ˈmɪnɪməlɪzəm/"
        },
        "nearby": [
            {
                "word": "minim",
                "pos": "noun"
            },
            {
                "word": "minimal",
                "pos": "adjective"
            },
            {
                "word": "minimalism",
                "pos": "noun"
            },
            {
                "word": "minimalist",
                "pos": "adjective"
            },
            {
                "word": "minimalist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a style of art, music or design that uses very simple ideas or a very small number of simple elements",
                    "vi": "một phong cách nghệ thuật, âm nhạc hoặc thiết kế sử dụng những ý tưởng rất đơn giản hoặc một số lượng rất nhỏ các yếu tố đơn giản"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73ec8adcd38f475a9e875a9c62818fe2",
        "word": "minimalist",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪnɪməlɪst/",
            "us": "/ˈmɪnɪməlɪst/"
        },
        "nearby": [
            {
                "word": "minimal",
                "pos": "adjective"
            },
            {
                "word": "minimalism",
                "pos": "noun"
            },
            {
                "word": "minimalist",
                "pos": "adjective"
            },
            {
                "word": "minimalist",
                "pos": "noun"
            },
            {
                "word": "minimally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using very simple ideas or a very small number of simple elements",
                    "vi": "sử dụng những ý tưởng rất đơn giản hoặc một số lượng rất nhỏ các yếu tố đơn giản"
                },
                "examples": [
                    {
                        "en": "a minimalist style",
                        "vi": "một phong cách tối giản"
                    },
                    {
                        "en": "minimalist paintings/sculptures",
                        "vi": "tranh / điêu khắc tối giản"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f76550733df47d69f13bb348caaa5d0",
        "word": "monochrome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəkrəʊm/",
            "us": "/ˈmɑːnəkrəʊm/"
        },
        "nearby": [
            {
                "word": "mono-",
                "pos": "combining form"
            },
            {
                "word": "monochromatic",
                "pos": "adjective"
            },
            {
                "word": "monochrome",
                "pos": "adjective"
            },
            {
                "word": "monochrome",
                "pos": "noun"
            },
            {
                "word": "monocle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using only black, white and shades of grey",
                    "vi": "chỉ sử dụng màu đen, trắng và các sắc thái của xám"
                },
                "examples": [
                    {
                        "en": "monochrome illustrations/images",
                        "vi": "minh họa / hình ảnh đơn sắc"
                    },
                    {
                        "en": "(figurative) a dull monochrome life",
                        "vi": "(nghĩa bóng) một cuộc sống đơn sắc buồn tẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "using different shades of one colour",
                    "vi": "sử dụng các sắc thái khác nhau của một màu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d55cef7df84e45e2becff27fb98d6c41",
        "word": "muse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mjuːz/",
            "us": "/mjuːz/"
        },
        "nearby": [
            {
                "word": "muscular dystrophy",
                "pos": "noun"
            },
            {
                "word": "musculature",
                "pos": "noun"
            },
            {
                "word": "muse",
                "pos": "noun"
            },
            {
                "word": "muse",
                "pos": "verb"
            },
            {
                "word": "museum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or spirit that gives a writer, painter, etc. ideas and the desire to create things",
                    "vi": "một người hoặc tinh thần mang lại cho nhà văn, họa sĩ, v.v. những ý tưởng và mong muốn tạo ra mọi thứ"
                },
                "examples": [
                    {
                        "en": "He felt that his muse had deserted him (= that he could no longer write, paint, etc.).",
                        "vi": "Anh cảm thấy rằng nàng thơ của anh đã bỏ rơi anh (= rằng anh không còn có thể viết, vẽ, v.v.)."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in ancient Greek and Roman stories) one of the nine goddesses who encouraged poetry, music and other branches of art and literature",
                    "vi": "(trong các câu chuyện cổ đại Hy Lạp và La Mã) một trong chín nữ thần khuyến khích thơ ca, âm nhạc và các ngành nghệ thuật và văn học khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a53a263682354c50ac79bbb8a5121f47",
        "word": "nude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/njuːd/",
            "us": "/nuːd/"
        },
        "nearby": [
            {
                "word": "nucleus",
                "pos": "noun"
            },
            {
                "word": "nude",
                "pos": "adjective"
            },
            {
                "word": "nude",
                "pos": "noun"
            },
            {
                "word": "nudge",
                "pos": "verb"
            },
            {
                "word": "nudge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a work of art consisting of a naked human figure; a naked human figure in art",
                    "vi": "một tác phẩm nghệ thuật có hình người trần trụi; một nhân vật khỏa thân trong nghệ thuật"
                },
                "examples": [
                    {
                        "en": "a bronze nude by Rodin",
                        "vi": "một khỏa thân bằng đồng của Rodin"
                    },
                    {
                        "en": "a reclining nude",
                        "vi": "khỏa thân nằm nghiêng"
                    }
                ]
            },
            {
                "define": {
                    "en": "not wearing any clothes",
                    "vi": "không mặc quần áo"
                },
                "examples": [
                    {
                        "en": "She refuses to be photographed in the nude.",
                        "vi": "Cô từ chối bị chụp ảnh khỏa thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c3f450338664c75a9a7043adccfb4fe",
        "word": "representational",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌreprɪzenˈteɪʃənl/",
            "us": "/ˌreprɪzenˈteɪʃənl/"
        },
        "nearby": [
            {
                "word": "re-present",
                "pos": "verb"
            },
            {
                "word": "representation",
                "pos": "noun"
            },
            {
                "word": "representational",
                "pos": "adjective"
            },
            {
                "word": "representative",
                "pos": "noun"
            },
            {
                "word": "representative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trying to show things as they really are",
                    "vi": "cố gắng thể hiện mọi thứ như chúng thực sự là"
                },
                "examples": [
                    {
                        "en": "It is on pottery that representational art first appeared in ancient Greece.",
                        "vi": "Trên đồ gốm, nghệ thuật đại diện lần đầu tiên xuất hiện ở Hy Lạp cổ đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving the act of representing somebody/something",
                    "vi": "liên quan đến hành động đại diện cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "local representational democracy",
                        "vi": "dân chủ đại diện địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "b579a5776a83443e937e18cc5401bde4",
        "word": "sepia",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːpiə/",
            "us": "/ˈsiːpiə/"
        },
        "nearby": [
            {
                "word": "Sephardic",
                "pos": "adjective"
            },
            {
                "word": "sepia",
                "pos": "adjective"
            },
            {
                "word": "sepia",
                "pos": "noun"
            },
            {
                "word": "sepoy",
                "pos": "noun"
            },
            {
                "word": "sepsis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a brown substance used in inks and paints and used in the past for printing photographs",
                    "vi": "một chất màu nâu được sử dụng trong mực và sơn và được sử dụng trong quá khứ để in ảnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a red-brown colour",
                    "vi": "một màu nâu đỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d44e6dc322744292926b138698051f47",
        "word": "sombre",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒmbə(r)/",
            "us": "/ˈsɑːmbər/"
        },
        "nearby": [
            {
                "word": "Somali",
                "pos": "noun, adjective"
            },
            {
                "word": "Somalia",
                "pos": "noun"
            },
            {
                "word": "sombre",
                "pos": "adjective"
            },
            {
                "word": "sombrely",
                "pos": "adverb"
            },
            {
                "word": "sombreness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dark in colour",
                    "vi": "màu tối"
                },
                "examples": [
                    {
                        "en": "dressed in sombre shades of grey and black",
                        "vi": "mặc quần áo màu xám và đen u ám"
                    }
                ]
            },
            {
                "define": {
                    "en": "sad and serious",
                    "vi": "buồn và nghiêm túc"
                },
                "examples": [
                    {
                        "en": "Paul was in a sombre mood.",
                        "vi": "Paul đang ở trong một tâm trạng u ám."
                    },
                    {
                        "en": "The year ended on a sombre note.",
                        "vi": "Năm kết thúc trong một nốt trầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e00647a0270422aab52ccee8204a320",
        "word": "study",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstʌdi/",
            "us": "/ˈstʌdi/"
        },
        "nearby": [
            {
                "word": "studiously",
                "pos": "adverb"
            },
            {
                "word": "studmuffin",
                "pos": "noun"
            },
            {
                "word": "study",
                "pos": "noun"
            },
            {
                "word": "study",
                "pos": "verb"
            },
            {
                "word": "study bedroom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of learning or gaining knowledge, either from books or by examining things in the world",
                    "vi": "hoạt động học hỏi hoặc thu thập kiến thức, từ sách hoặc bằng cách xem xét mọi thứ trên thế giới"
                },
                "examples": [
                    {
                        "en": "a room set aside for private study",
                        "vi": "một phòng dành riêng cho việc học tập riêng"
                    },
                    {
                        "en": "academic/literary/scientific study",
                        "vi": "nghiên cứu học thuật / văn học / khoa học"
                    },
                    {
                        "en": "It is important to develop good study skills.",
                        "vi": "Điều quan trọng là phát triển các kỹ năng học tập tốt."
                    },
                    {
                        "en": "Physiology is the study of how living things work.",
                        "vi": "Sinh lý học là nghiên cứu về cách thức hoạt động của các sinh vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular person’s learning activities, for example at a college or university",
                    "vi": "các hoạt động học tập của một người cụ thể, ví dụ như tại một trường cao đẳng hoặc đại học"
                },
                "examples": [
                    {
                        "en": "to continue your studies",
                        "vi": "để tiếp tục việc học của bạn"
                    },
                    {
                        "en": "Many undertake further studies after college.",
                        "vi": "Nhiều người thực hiện các nghiên cứu tiếp theo sau đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some academic subjects",
                    "vi": "được sử dụng trong tên của một số môn học"
                },
                "examples": [
                    {
                        "en": "business/media/American studies",
                        "vi": "kinh doanh / truyền thông / nghiên cứu Hoa Kỳ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of research that examines a subject or question in detail",
                    "vi": "một phần của nghiên cứu kiểm tra một chủ đề hoặc câu hỏi chi tiết"
                },
                "examples": [
                    {
                        "en": "to conduct/undertake a study",
                        "vi": "để tiến hành / thực hiện một nghiên cứu"
                    },
                    {
                        "en": "Research studies carried out in Italy confirmed the theory.",
                        "vi": "Các nghiên cứu được thực hiện ở Ý đã xác nhận lý thuyết này."
                    },
                    {
                        "en": "study on something He has recently done a study on the effects of traffic and aircraft noise.",
                        "vi": "Nghiên cứu về điều gì đó Gần đây ông đã thực hiện một nghiên cứu về ảnh hưởng của giao thông và tiếng ồn của máy bay."
                    },
                    {
                        "en": "study of something a detailed study of how animals adapt to their environment",
                        "vi": "nghiên cứu về điều gì đó nghiên cứu chi tiết về cách động vật thích nghi với môi trường của chúng"
                    },
                    {
                        "en": "scientific studies of fishing grounds and methods of fishing",
                        "vi": "nghiên cứu khoa học về ngư trường và phương pháp đánh bắt"
                    },
                    {
                        "en": "This study shows/finds/suggests that…",
                        "vi": "Nghiên cứu này cho thấy / phát hiện / gợi ý rằng…"
                    },
                    {
                        "en": "the purpose/aim of a study",
                        "vi": "mục đích / mục tiêu của một nghiên cứu"
                    },
                    {
                        "en": "the results/findings of a study",
                        "vi": "kết quả / phát hiện của một nghiên cứu"
                    },
                    {
                        "en": "in a study the methods used in the present study",
                        "vi": "trong một nghiên cứu, các phương pháp được sử dụng trong nghiên cứu này"
                    },
                    {
                        "en": "in previous/earlier studies",
                        "vi": "trong các nghiên cứu trước đó / trước đó"
                    },
                    {
                        "en": "according to a study According to a recent study published in the Journal of Sleep Research…",
                        "vi": "Theo một nghiên cứu Theo một nghiên cứu gần đây được công bố trên Tạp chí Nghiên cứu Giấc ngủ…"
                    }
                ]
            },
            {
                "define": {
                    "en": "an academic book or article on a particular topic",
                    "vi": "một cuốn sách hoặc bài báo học thuật về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "a study of Jane Austen's novels",
                        "vi": "một nghiên cứu về tiểu thuyết của Jane Austen"
                    },
                    {
                        "en": "Shakespeare is the subject of a new study by Anthony Bryan.",
                        "vi": "Shakespeare là chủ đề của một nghiên cứu mới của Anthony Bryan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of considering or examining something in detail",
                    "vi": "hành động xem xét hoặc kiểm tra chi tiết một cái gì đó"
                },
                "examples": [
                    {
                        "en": "These proposals deserve careful study.",
                        "vi": "Những đề xuất này đáng được nghiên cứu cẩn thận."
                    },
                    {
                        "en": "under study the biochemical process under study",
                        "vi": "đang nghiên cứu quá trình sinh hóa đang nghiên cứu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a room, especially in somebody’s home, used for reading and writing",
                    "vi": "một căn phòng, đặc biệt là trong nhà của ai đó, dùng để đọc và viết"
                },
                "examples": [
                    {
                        "en": "She crossed the hallway and opened the door to her private study.",
                        "vi": "Cô băng qua hành lang và mở cửa phòng làm việc riêng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a drawing or painting of something, especially one done for practice or before doing a larger picture",
                    "vi": "một bản vẽ hoặc bức tranh của một cái gì đó, đặc biệt là một bức vẽ được thực hành hoặc trước khi vẽ một bức tranh lớn hơn"
                },
                "examples": [
                    {
                        "en": "a study of Chartres Cathedral",
                        "vi": "một nghiên cứu về Nhà thờ Chartres"
                    },
                    {
                        "en": "a nude study",
                        "vi": "một nghiên cứu khỏa thân"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of showing or describing somebody/something in literature or another art form, especially a character or an aspect of behaviour",
                    "vi": "hành động thể hiện hoặc mô tả ai đó / điều gì đó trong văn học hoặc hình thức nghệ thuật khác, đặc biệt là một nhân vật hoặc một khía cạnh của hành vi"
                },
                "examples": [
                    {
                        "en": "The novel is a character study of a city and its people.",
                        "vi": "Cuốn tiểu thuyết là một nghiên cứu nhân vật của một thành phố và con người của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of music designed to give a player practice in technical skills",
                    "vi": "một bản nhạc được thiết kế để giúp người chơi luyện tập các kỹ năng kỹ thuật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a perfect example of something",
                    "vi": "một ví dụ hoàn hảo về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His face was a study in concentration.",
                        "vi": "Khuôn mặt của anh ấy là một nghiên cứu trong sự tập trung."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking deeply so that you do not notice what is happening around you",
                    "vi": "suy nghĩ sâu sắc để bạn không nhận thấy những gì đang xảy ra xung quanh bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "151c9fed1af04fa5b376a067b7784faa",
        "word": "tableau",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtæbləʊ/",
            "us": "/ˈtæbləʊ/"
        },
        "nearby": [
            {
                "word": "table",
                "pos": "noun"
            },
            {
                "word": "table",
                "pos": "verb"
            },
            {
                "word": "tableau",
                "pos": "noun"
            },
            {
                "word": "tablecloth",
                "pos": "noun"
            },
            {
                "word": "table dancing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a scene showing, for example, events and people from history, that is presented by a group of actors who do not move or speak",
                    "vi": "một cảnh cho thấy, ví dụ, các sự kiện và con người trong lịch sử, được trình bày bởi một nhóm diễn viên không cử động hoặc nói"
                },
                "examples": [
                    {
                        "en": "The procession included a tableau of the Battle of Hastings.",
                        "vi": "Đám rước bao gồm một hoạt cảnh về Trận chiến Hastings."
                    },
                    {
                        "en": "(figurative) She stood at the door observing the peaceful domestic tableau around the fire.",
                        "vi": "(nghĩa bóng) Cô đứng ở cửa quan sát hoạt cảnh trong nhà yên bình xung quanh bếp lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a work of art, especially a set of statues, showing a group of people, animals, etc.",
                    "vi": "một tác phẩm nghệ thuật, đặc biệt là một bộ tượng, thể hiện một nhóm người, động vật, v.v."
                },
                "examples": []
            }
        ]
    }
]