[
    {
        "id": "8c3710d3308b4564a178dd167e9f0836",
        "word": "garden",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈɡɑːdn/",
            "us": "/ˈɡɑːrdn/"
        },
        "nearby": [
            {
                "word": "Garda",
                "pos": "noun"
            },
            {
                "word": "garden",
                "pos": "noun"
            },
            {
                "word": "garden",
                "pos": "verb"
            },
            {
                "word": "garden centre",
                "pos": "noun"
            },
            {
                "word": "garden city",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to work in a garden",
                    "vi": "làm việc trong vườn"
                },
                "examples": [
                    {
                        "en": "More people are choosing to garden organically.",
                        "vi": "Nhiều người đang chọn làm vườn hữu cơ."
                    }
                ]
            }
        ]
    },
    {
        "id": "d4c89a46c6c7438e99af40258b2be8b8",
        "word": "grow",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡrəʊ/",
            "us": "/ɡrəʊ/"
        },
        "nearby": [
            {
                "word": "grovel",
                "pos": "verb"
            },
            {
                "word": "grovelling",
                "pos": "adjective"
            },
            {
                "word": "grow",
                "pos": "verb"
            },
            {
                "word": "grow apart",
                "pos": "phrasal verb"
            },
            {
                "word": "grow away from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to increase in size, number, strength or quality",
                    "vi": "để tăng kích thước, số lượng, sức mạnh hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "The sector is growing at a phenomenal rate.",
                        "vi": "Lĩnh vực này đang phát triển với tốc độ phi thường."
                    },
                    {
                        "en": "The performance improved as their confidence grew.",
                        "vi": "Hiệu suất được cải thiện khi sự tự tin của họ tăng lên."
                    },
                    {
                        "en": "Opposition to the latest proposals is growing steadily.",
                        "vi": "Sự phản đối các đề xuất mới nhất đang tăng lên một cách đều đặn."
                    },
                    {
                        "en": "The market is growing rapidly.",
                        "vi": "Thị trường đang phát triển nhanh chóng."
                    },
                    {
                        "en": "Sales are growing fast.",
                        "vi": "Doanh số bán hàng đang tăng nhanh."
                    },
                    {
                        "en": "The business has grown exponentially over the past ten years.",
                        "vi": "Việc kinh doanh đã phát triển theo cấp số nhân trong mười năm qua."
                    },
                    {
                        "en": "Fears are growing for the safety of a teenager who disappeared a week ago.",
                        "vi": "Nỗi sợ hãi ngày càng lớn đối với sự an toàn của một thiếu niên đã mất tích một tuần trước."
                    },
                    {
                        "en": "grow by something The economy is growing by roughly 2 per cent a year.",
                        "vi": "tăng trưởng bởi cái gì đó Nền kinh tế đang tăng trưởng khoảng 2% một năm."
                    },
                    {
                        "en": "The company profits grew by 5 per cent last year.",
                        "vi": "Lợi nhuận của công ty đã tăng 5% trong năm ngoái."
                    },
                    {
                        "en": "grow in something The family has grown in size recently.",
                        "vi": "phát triển trong một cái gì đó Gia đình đã phát triển về quy mô gần đây."
                    },
                    {
                        "en": "This approach is growing in popularity.",
                        "vi": "Cách tiếp cận này đang ngày càng phổ biến."
                    },
                    {
                        "en": "She is growing in confidence all the time.",
                        "vi": "Cô ấy ngày càng tự tin hơn mọi lúc."
                    },
                    {
                        "en": "grow from something Her media empire grew from quite small beginnings.",
                        "vi": "phát triển từ một cái gì đó Đế chế truyền thông của cô ấy phát triển từ những ngày đầu còn khá nhỏ."
                    },
                    {
                        "en": "grow to something That number will grow to two billion users in 2025.",
                        "vi": "phát triển thành một thứ gì đó Con số đó sẽ tăng lên hai tỷ người dùng vào năm 2025."
                    },
                    {
                        "en": "grow from something to something The city's population has grown from about 50 000 to over a million in 20 years.",
                        "vi": "phát triển từ thứ gì đó thành thứ gì đó Dân số của thành phố đã tăng từ khoảng 50.000 người lên hơn một triệu người trong 20 năm."
                    },
                    {
                        "en": "+ adj. to grow larger/stronger",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The company is growing bigger all the time.",
                        "vi": "Công ty đang phát triển lớn mạnh hơn mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become bigger or taller and develop into an adult",
                    "vi": "trở nên lớn hơn hoặc cao hơn và phát triển thành người lớn"
                },
                "examples": [
                    {
                        "en": "You've grown since the last time I saw you!",
                        "vi": "Bạn đã trưởng thành kể từ lần cuối cùng tôi nhìn thấy bạn!"
                    },
                    {
                        "en": "The puppies grow quickly during the first six months.",
                        "vi": "Những chú chó con phát triển nhanh chóng trong sáu tháng đầu tiên."
                    },
                    {
                        "en": "+ noun Nick's grown almost an inch in the last month.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ adj. to grow bigger/taller/older",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to exist and develop in a particular place; to make plants grow",
                    "vi": "để tồn tại và phát triển ở một nơi cụ thể; để làm cho cây cối phát triển"
                },
                "examples": [
                    {
                        "en": "The region is too dry for plants to grow.",
                        "vi": "Khu vực này quá khô để thực vật phát triển."
                    },
                    {
                        "en": "Tomatoes grow best in direct sunlight.",
                        "vi": "Cà chua phát triển tốt nhất dưới ánh nắng trực tiếp."
                    },
                    {
                        "en": "grow to something These roses grow to a height of 6 feet.",
                        "vi": "phát triển đến một cái gì đó Những bông hồng này phát triển đến chiều cao 6 feet."
                    },
                    {
                        "en": "grow from something This is a tree that grows well from cuttings.",
                        "vi": "mọc từ cái gì Đây là cây phát triển tốt từ giâm cành."
                    },
                    {
                        "en": "grow something The land is used to grow crops.",
                        "vi": "trồng cái gì đó Đất được sử dụng để trồng trọt."
                    },
                    {
                        "en": "We need to grow our food more efficiently.",
                        "vi": "Chúng ta cần trồng thực phẩm hiệu quả hơn."
                    },
                    {
                        "en": "I didn't know they grew rice in France.",
                        "vi": "Tôi không biết họ trồng lúa ở Pháp."
                    },
                    {
                        "en": "The plants were grown in controlled conditions.",
                        "vi": "Các cây được trồng trong điều kiện có kiểm soát."
                    },
                    {
                        "en": "grow something from something I grew all these flowers from one packet of seeds.",
                        "vi": "trồng một cái gì đó từ một cái gì đó Tôi đã trồng tất cả những bông hoa này từ một gói hạt giống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become longer; to allow something to become longer by not cutting it",
                    "vi": "trở nên dài hơn; để cho phép một cái gì đó trở nên dài hơn bằng cách không cắt nó"
                },
                "examples": [
                    {
                        "en": "I've decided to let my hair grow.",
                        "vi": "Tôi đã quyết định để tóc của mình phát triển."
                    },
                    {
                        "en": "grow something I've decided to grow my hair.",
                        "vi": "phát triển một cái gì đó Tôi đã quyết định để phát triển tóc của tôi."
                    },
                    {
                        "en": "I didn't recognize him—he's grown a beard.",
                        "vi": "Tôi không nhận ra anh ta - anh ta mọc râu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have a particular quality or feeling over a period of time",
                    "vi": "bắt đầu có chất lượng hoặc cảm giác cụ thể trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "He had grown old and fat.",
                        "vi": "Anh ấy đã già đi và béo lên."
                    },
                    {
                        "en": "They were growing tired of her unreasonable behaviour.",
                        "vi": "Họ ngày càng mệt mỏi vì hành vi vô lý của cô ấy."
                    },
                    {
                        "en": "My eyes soon grew accustomed to the darkness.",
                        "vi": "Đôi mắt của tôi đã sớm quen với bóng tối."
                    },
                    {
                        "en": "Mark and Jenny were growing closer every day.",
                        "vi": "Mark và Jenny ngày càng thân thiết hơn."
                    },
                    {
                        "en": "As time went on he grew more and more impatient.",
                        "vi": "Thời gian trôi qua anh ấy càng ngày càng mất kiên nhẫn."
                    },
                    {
                        "en": "The skies grew dark and it began to rain.",
                        "vi": "Bầu trời tối dần và trời bắt đầu mưa."
                    },
                    {
                        "en": "She grew braver with time.",
                        "vi": "Cô ấy trở nên dũng cảm hơn theo thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gradually begin to do something",
                    "vi": "dần dần bắt đầu làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'm sure you'll grow to like her in time.",
                        "vi": "Tôi chắc rằng bạn sẽ thích cô ấy theo thời gian."
                    },
                    {
                        "en": "He grew to understand her reasons for leaving.",
                        "vi": "Anh càng ngày càng hiểu lý do ra đi của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop and improve particular qualities or skills",
                    "vi": "để phát triển và cải thiện các phẩm chất hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "She continues to grow as an artist.",
                        "vi": "Cô ấy tiếp tục phát triển như một nghệ sĩ."
                    },
                    {
                        "en": "A secure background will help a child to grow emotionally.",
                        "vi": "Một nền tảng vững chắc sẽ giúp một đứa trẻ phát triển về mặt tình cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the size, quality or number of something",
                    "vi": "để tăng kích thước, chất lượng hoặc số lượng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "We are trying to grow the business.",
                        "vi": "Chúng tôi đang cố gắng phát triển doanh nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something large and successful often begins in a very small way",
                    "vi": "một cái gì đó lớn và thành công thường bắt đầu từ một cách rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody not to use something or spend money carelessly because you do not have a lot of it",
                    "vi": "được sử dụng để nói với ai đó không sử dụng một cái gì đó hoặc tiêu tiền một cách bất cẩn bởi vì bạn không có nhiều tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not delay in getting things done",
                    "vi": "để không bị trì hoãn trong việc hoàn thành công việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c948c28b23d04a7ab7a1a176c591204e",
        "word": "plant",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/plɑːnt/",
            "us": "/plænt/"
        },
        "nearby": [
            {
                "word": "plan out",
                "pos": "phrasal verb"
            },
            {
                "word": "plant",
                "pos": "noun"
            },
            {
                "word": "plant",
                "pos": "verb"
            },
            {
                "word": "Plantagenet",
                "pos": ""
            },
            {
                "word": "plantain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put plants, seeds, etc. in the ground to grow",
                    "vi": "để cây, hạt giống, v.v. xuống đất để phát triển"
                },
                "examples": [
                    {
                        "en": "to plant a tree/seed/crop",
                        "vi": "trồng cây / hạt giống / cây trồng"
                    },
                    {
                        "en": "to plant and harvest rice",
                        "vi": "trồng và thu hoạch lúa"
                    },
                    {
                        "en": "Plant the bulbs in pots for a spring display.",
                        "vi": "Trồng củ vào chậu để trưng bày vào mùa xuân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover or supply a garden, area of land, etc. with plants",
                    "vi": "để che phủ hoặc cung cấp cho một khu vườn, diện tích đất, v.v. bằng các loại thực vật"
                },
                "examples": [
                    {
                        "en": "plant something The children are planting a garden next to the school.",
                        "vi": "trồng cây gì Các em nhỏ đang trồng một khu vườn bên cạnh trường học."
                    },
                    {
                        "en": "They have planted five acres of vines.",
                        "vi": "Họ đã trồng 5 mẫu cây nho."
                    },
                    {
                        "en": "a densely planted orange grove",
                        "vi": "một vườn cam trồng dày đặc"
                    },
                    {
                        "en": "be planted with something The field had been ploughed and planted with corn.",
                        "vi": "được trồng với một cái gì đó Cánh đồng đã được cày và được trồng bằng ngô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to place something or yourself in a particular place or position",
                    "vi": "để đặt một cái gì đó hoặc chính bạn ở một vị trí hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "They planted a flag on the summit.",
                        "vi": "Họ đã cắm một lá cờ trên đỉnh núi."
                    },
                    {
                        "en": "He planted himself squarely in front of us.",
                        "vi": "Anh ấy đã gieo mình ngay trước mặt chúng tôi."
                    },
                    {
                        "en": "She was determined to keep both feet firmly planted on dry land.",
                        "vi": "Cô quyết tâm giữ vững cả hai chân trồng trên mảnh đất khô cằn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide something such as a bomb in a place where it will not be found",
                    "vi": "giấu thứ gì đó chẳng hạn như một quả bom ở một nơi mà nó sẽ không được tìm thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hide something, especially something illegal, in somebody’s clothing, possessions, etc. so that when it is found it will look as though they committed a crime",
                    "vi": "giấu thứ gì đó, đặc biệt là thứ gì đó bất hợp pháp, trong quần áo, tài sản của ai đó, v.v. để khi bị phát hiện sẽ trông như thể họ đã phạm tội"
                },
                "examples": [
                    {
                        "en": "He claims that the drugs were planted on him.",
                        "vi": "Anh ta tuyên bố rằng ma túy đã được gieo vào người anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send somebody to join a group, etc., especially in order to make secret reports on its members",
                    "vi": "để cử ai đó tham gia nhóm, v.v., đặc biệt là để báo cáo bí mật về các thành viên của nhóm đó"
                },
                "examples": [
                    {
                        "en": "The police had planted an informer in the gang.",
                        "vi": "Cảnh sát đã đưa một người cung cấp thông tin trong băng nhóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody think or believe something, especially without them realizing that you gave them the idea",
                    "vi": "để khiến ai đó nghĩ hoặc tin vào điều gì đó, đặc biệt là họ không nhận ra rằng bạn đã cho họ ý tưởng"
                },
                "examples": [
                    {
                        "en": "He planted the first seeds of doubt in my mind.",
                        "vi": "Anh ấy đã gieo những hạt giống nghi ngờ đầu tiên vào tâm trí tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "08e548a96995461a81ef17bcaf9d7510",
        "word": "gardener",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡɑːdnə(r)/",
            "us": "/ˈɡɑːrdnər/"
        },
        "nearby": [
            {
                "word": "garden city",
                "pos": "noun"
            },
            {
                "word": "garden egg",
                "pos": "noun"
            },
            {
                "word": "gardener",
                "pos": "noun"
            },
            {
                "word": "Gardeners' Question Time",
                "pos": ""
            },
            {
                "word": "Gardeners' World",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to work in a garden",
                    "vi": "một người có công việc là làm vườn"
                },
                "examples": [
                    {
                        "en": "We employ a gardener two days a week.",
                        "vi": "Chúng tôi thuê một người làm vườn hai ngày một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who enjoys working in a garden",
                    "vi": "một người thích làm việc trong vườn"
                },
                "examples": [
                    {
                        "en": "My wife's a keen gardener.",
                        "vi": "Vợ tôi là một người làm vườn nhiệt tình."
                    }
                ]
            }
        ]
    },
    {
        "id": "8fa5b73456f644c2a71a3526e4be3256",
        "word": "pot",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pɒt/",
            "us": "/pɑːt/"
        },
        "nearby": [
            {
                "word": "postwoman",
                "pos": "noun"
            },
            {
                "word": "posy",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "verb"
            },
            {
                "word": "potable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deep round container used for cooking things in",
                    "vi": "một thùng tròn sâu được sử dụng để nấu những thứ trong"
                },
                "examples": [
                    {
                        "en": "pots and pans",
                        "vi": "nồi và chảo"
                    },
                    {
                        "en": "You'll need a large cooking pot with a tight-fitting lid.",
                        "vi": "Bạn sẽ cần một nồi nấu lớn có nắp đậy kín."
                    }
                ]
            },
            {
                "define": {
                    "en": "a container made of glass, clay or plastic, used for storing food in",
                    "vi": "hộp đựng bằng thủy tinh, đất sét hoặc nhựa, được sử dụng để đựng thực phẩm trong"
                },
                "examples": [
                    {
                        "en": "a pot of jam",
                        "vi": "một nồi mứt"
                    },
                    {
                        "en": "a yoghurt pot",
                        "vi": "một nồi sữa chua"
                    }
                ]
            },
            {
                "define": {
                    "en": "a container of various kinds, made for a particular purpose",
                    "vi": "một thùng chứa nhiều loại khác nhau, được làm cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a coffee pot",
                        "vi": "một bình cà phê"
                    },
                    {
                        "en": "a pencil pot",
                        "vi": "một chậu bút chì"
                    },
                    {
                        "en": "Is there any more tea in the pot?",
                        "vi": "Còn trà nào trong bình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount contained in a pot",
                    "vi": "số lượng chứa trong một cái chậu"
                },
                "examples": [
                    {
                        "en": "They drank a pot of coffee.",
                        "vi": "Họ uống một tách cà phê."
                    },
                    {
                        "en": "I had such a craving for marmalade when I was pregnant that I ate a whole pot in one day.",
                        "vi": "Tôi đã rất thèm mứt cam khi mang thai đến nỗi tôi đã ăn hết một nồi trong một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bowl, etc. that is made by a potter",
                    "vi": "một cái bát, v.v. được làm bởi một người thợ gốm"
                },
                "examples": [
                    {
                        "en": "The newly made pots are glazed when they are completely dry.",
                        "vi": "Chậu mới làm xong được tráng men khi chúng khô hoàn toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the total amount of money that is bet in a card game",
                    "vi": "tổng số tiền được đặt cược trong một trò chơi bài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the money given by a group of people in order to do something together, for example to buy food, or available for a particular purpose",
                    "vi": "tất cả số tiền do một nhóm người đưa ra để làm điều gì đó cùng nhau, chẳng hạn như mua thức ăn hoặc sẵn sàng cho một mục đích cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "cannabis (= a drug (illegal in many countries) made from the dried leaves and flowers of the hemp plant, which gives the person smoking it a feeling of being relaxed)",
                    "vi": "Cần sa (= một loại thuốc (bất hợp pháp ở nhiều quốc gia) được làm từ lá và hoa khô của cây gai dầu, mang lại cho người hút cảm giác thư thái)"
                },
                "examples": [
                    {
                        "en": "pot smoking",
                        "vi": "hút thuốc lá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a shot that somebody fires without aiming carefully",
                    "vi": "một phát súng mà ai đó bắn mà không nhắm cẩn thận"
                },
                "examples": [
                    {
                        "en": "He took a pot at the neighbour's cat with his air rifle.",
                        "vi": "Anh ta lấy khẩu súng hơi bắn vào con mèo của hàng xóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of hitting a ball into one of the pockets around the edge of the table",
                    "vi": "hành động đánh bóng vào một trong các túi xung quanh mép bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a pot belly (= a large stomach that sticks out)",
                    "vi": "một cái bụng nồi (= một cái bụng lớn nhô ra ngoài)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large prize or reward that somebody hopes for but is unlikely to get",
                    "vi": "một giải thưởng lớn hoặc phần thưởng mà ai đó hy vọng nhưng không chắc sẽ nhận được"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become much less good because people are not working hard or taking care of things",
                    "vi": "trở nên kém tốt hơn nhiều bởi vì mọi người không làm việc chăm chỉ hoặc không quan tâm đến mọi thứ"
                },
                "examples": [
                    {
                        "en": "Her handwriting's gone to pot since she started using a computer all the time.",
                        "vi": "Chữ viết tay của cô ấy đã biến mất kể từ khi cô ấy bắt đầu sử dụng máy tính mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to change; in the process of changing",
                    "vi": "có khả năng thay đổi; trong quá trình thay đổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you should not criticize somebody for a fault that you have yourself",
                    "vi": "đã từng nói rằng bạn không nên chỉ trích ai đó vì lỗi mà bản thân bạn mắc phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when you take pot luck, you choose something or go somewhere without knowing very much about it, but hope that it will be good, pleasant, etc.",
                    "vi": "khi bạn lấy may mắn, bạn chọn một cái gì đó hoặc đi đâu đó mà không biết nhiều về nó, nhưng hy vọng rằng nó sẽ tốt, vừa ý, v.v."
                },
                "examples": [
                    {
                        "en": "It's pot luck whether you get good advice or not.",
                        "vi": "Thật may mắn cho dù bạn có nhận được lời khuyên tốt hay không."
                    },
                    {
                        "en": "You're welcome to stay to supper, but you'll have to take pot luck (= eat whatever is available).",
                        "vi": "Bạn có thể ở lại để ăn tối, nhưng bạn sẽ phải mất một chút may mắn (= ăn bất cứ thứ gì có sẵn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large amount of money",
                    "vi": "một số tiền rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put something into a space that is too small for it",
                    "vi": "đặt một cái gì đó vào một không gian quá nhỏ cho nó"
                },
                "examples": [
                    {
                        "en": "Writing a history of the world in a single volume is like putting a quart into a pint pot.",
                        "vi": "Viết lịch sử thế giới trong một tập cũng giống như bỏ một quart vào một cái nồi nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are impatient for something to happen, time seems to pass very slowly",
                    "vi": "Người ta thường nói rằng khi bạn thiếu kiên nhẫn cho một điều gì đó xảy ra, thời gian dường như trôi qua rất chậm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "da9e1686194e45118a867e68267faef7",
        "word": "seed",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/siːd/",
            "us": "/siːd/"
        },
        "nearby": [
            {
                "word": "see",
                "pos": "noun"
            },
            {
                "word": "see about",
                "pos": "phrasal verb"
            },
            {
                "word": "seed",
                "pos": "noun"
            },
            {
                "word": "seed",
                "pos": "verb"
            },
            {
                "word": "seedbed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the small hard part produced by a plant, from which a new plant can grow",
                    "vi": "phần cứng nhỏ do cây tạo ra, từ đó cây mới có thể phát triển"
                },
                "examples": [
                    {
                        "en": "a packet of wild flower seeds",
                        "vi": "một gói hạt giống hoa dại"
                    },
                    {
                        "en": "sesame seeds",
                        "vi": "Hạt mè"
                    },
                    {
                        "en": "Sow the seeds outdoors in spring.",
                        "vi": "Gieo hạt ngoài trời vào mùa xuân."
                    },
                    {
                        "en": "Plant the seeds 10cm apart.",
                        "vi": "Trồng các hạt cách nhau 10cm."
                    },
                    {
                        "en": "These vegetables can be grown from seed.",
                        "vi": "Những loại rau này có thể được trồng từ hạt giống."
                    },
                    {
                        "en": "seed potatoes (= used for planting)",
                        "vi": "khoai tây hạt (= dùng để trồng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the small hard seed that is found in some types of fruit",
                    "vi": "hạt cứng nhỏ được tìm thấy trong một số loại trái cây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the beginning of a feeling or development that continues to grow",
                    "vi": "sự khởi đầu của một cảm giác hoặc sự phát triển tiếp tục phát triển"
                },
                "examples": [
                    {
                        "en": "the seeds of rebellion",
                        "vi": "mầm mống của sự nổi loạn"
                    },
                    {
                        "en": "This planted the seeds of doubt in my mind.",
                        "vi": "Điều này đã gieo mầm nghi ngờ trong tâm trí tôi."
                    },
                    {
                        "en": "He argued that capitalism contained the seeds of its own destruction.",
                        "vi": "Ông cho rằng chủ nghĩa tư bản chứa đựng mầm mống của sự hủy diệt của chính nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the best players in a competition. The seeds are given a position in a list to try and make sure that they do not play each other in the early parts of the competition.",
                    "vi": "một trong những người chơi giỏi nhất trong một cuộc thi. Các hạt giống được đưa ra một vị trí trong danh sách để thử và đảm bảo rằng chúng không chơi lẫn nhau trong những phần đầu của cuộc thi."
                },
                "examples": [
                    {
                        "en": "The top seed won comfortably.",
                        "vi": "Hạt giống hàng đầu chiến thắng một cách thoải mái."
                    },
                    {
                        "en": "the number one seed",
                        "vi": "hạt giống số một"
                    },
                    {
                        "en": "She was the top seed at the US Open this year.",
                        "vi": "Cô là hạt giống hàng đầu tại US Open năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "semen",
                    "vi": "tinh dịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the people who are the children, grandchildren, etc. of one man",
                    "vi": "tất cả những người là con, cháu, v.v. của một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce flowers and seeds as well as leaves",
                    "vi": "để tạo ra hoa và hạt cũng như lá"
                },
                "examples": [
                    {
                        "en": "The lettuces had all run to seed.",
                        "vi": "Tất cả các lettuces đã chạy để gieo hạt."
                    },
                    {
                        "en": "Cutting weeds before they go to seed will greatly reduce future weed problems.",
                        "vi": "Cắt cỏ dại trước khi gieo hạt sẽ làm giảm đáng kể các vấn đề về cỏ dại trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become much less attractive or good because of lack of attention",
                    "vi": "trở nên kém hấp dẫn hoặc kém hấp dẫn hơn nhiều vì thiếu sự chú ý"
                },
                "examples": [
                    {
                        "en": "After his divorce, he let himself go to seed.",
                        "vi": "Sau khi ly hôn, anh ta thả mình đi gieo hạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start the process that leads to a particular situation or result",
                    "vi": "để bắt đầu quá trình dẫn đến một tình huống hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "In this way he sowed the seeds of his own success.",
                        "vi": "Bằng cách này, anh đã gieo những hạt giống thành công của chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "33ad77fadc354a0fbd53ab4e393e3d4a",
        "word": "soil",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/sɔɪl/",
            "us": "/sɔɪl/"
        },
        "nearby": [
            {
                "word": "soi-disant",
                "pos": "adjective"
            },
            {
                "word": "soignée",
                "pos": "adjective"
            },
            {
                "word": "soil",
                "pos": "noun"
            },
            {
                "word": "soil",
                "pos": "verb"
            },
            {
                "word": "the Soil Association",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top layer of the earth in which plants, trees, etc. grow",
                    "vi": "lớp trên cùng của trái đất, nơi thực vật, cây cối, v.v. phát triển"
                },
                "examples": [
                    {
                        "en": "instruments for measuring soil moisture",
                        "vi": "dụng cụ đo độ ẩm của đất"
                    },
                    {
                        "en": "soil erosion",
                        "vi": "xói mòn đất"
                    },
                    {
                        "en": "the study of rocks and soils",
                        "vi": "nghiên cứu về đá và đất"
                    },
                    {
                        "en": "sandy/fertile soil",
                        "vi": "đất cát / màu mỡ"
                    },
                    {
                        "en": "rich/poor/dry/wet soil",
                        "vi": "đất giàu / nghèo / khô / ướt"
                    },
                    {
                        "en": "acid/alkaline soil",
                        "vi": "đất chua / kiềm"
                    },
                    {
                        "en": "clay soil",
                        "vi": "đất sét"
                    },
                    {
                        "en": "moisture in the soil",
                        "vi": "độ ẩm trong đất"
                    },
                    {
                        "en": "She dug the compost into the soil.",
                        "vi": "Cô đào phân trộn vào đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a country; an area of land",
                    "vi": "một đất nước; một khu đất"
                },
                "examples": [
                    {
                        "en": "It was the first time I had set foot on African soil.",
                        "vi": "Đó là lần đầu tiên tôi đặt chân lên đất Châu Phi."
                    },
                    {
                        "en": "protests over the siting of nuclear weapons on British soil",
                        "vi": "biểu tình phản đối việc bố trí vũ khí hạt nhân trên đất Anh"
                    },
                    {
                        "en": "He was the first Canadian to win on home/native soil (= in Canada).",
                        "vi": "Anh ấy là người Canada đầu tiên giành chiến thắng trên sân nhà / đất bản địa (= ở Canada)."
                    }
                ]
            }
        ]
    },
    {
        "id": "acdab63db49d405a80f0ce4a881ab232",
        "word": "water",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwɔːtə(r)/",
            "us": "/ˈwɔːtər/"
        },
        "nearby": [
            {
                "word": "watchword",
                "pos": "noun"
            },
            {
                "word": "water",
                "pos": "noun"
            },
            {
                "word": "water",
                "pos": "verb"
            },
            {
                "word": "The Water-Babies",
                "pos": ""
            },
            {
                "word": "the Water Bearer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pour water on plants, etc.",
                    "vi": "đổ nước lên cây, v.v."
                },
                "examples": [
                    {
                        "en": "to water the plants/garden",
                        "vi": "tưới cây / vườn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become full of tears",
                    "vi": "trở nên đầy nước mắt"
                },
                "examples": [
                    {
                        "en": "The smoke made my eyes water.",
                        "vi": "Làn khói làm mắt tôi ngấn nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce saliva",
                    "vi": "tiết ra nước bọt"
                },
                "examples": [
                    {
                        "en": "The smells from the kitchen made our mouths water.",
                        "vi": "Mùi từ nhà bếp làm cho miệng chúng tôi chảy nước."
                    },
                    {
                        "en": "The smell of the meat made her mouth water.",
                        "vi": "Mùi thịt khiến miệng cô ứa nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give water to an animal to drink",
                    "vi": "cho một con vật uống nước"
                },
                "examples": [
                    {
                        "en": "to water the horses",
                        "vi": "tưới nước cho ngựa"
                    },
                    {
                        "en": "(humorous) After a tour of the grounds, the guests were fed and watered.",
                        "vi": "(hài hước) Sau khi tham quan khu đất, các vị khách đã được cho ăn và uống nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide an area of land with water",
                    "vi": "cung cấp nước cho một khu vực đất"
                },
                "examples": [
                    {
                        "en": "be watered by something The valley is watered by a stream.",
                        "vi": "được tưới bởi một cái gì đó Thung lũng được tưới bởi một dòng suối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add water to an alcoholic drink",
                    "vi": "thêm nước vào đồ uống có cồn"
                },
                "examples": [
                    {
                        "en": "watered wine",
                        "vi": "rượu nước"
                    }
                ]
            }
        ]
    },
    {
        "id": "f12d652eaf954b5596f3a7d6844d71f7",
        "word": "cut down",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "cut back",
                "pos": "phrasal verb"
            },
            {
                "word": "cutback",
                "pos": "noun"
            },
            {
                "word": "cut down",
                "pos": "phrasal verb"
            },
            {
                "word": "cut-down",
                "pos": "adjective"
            },
            {
                "word": "cute",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to kill somebody",
                    "vi": "giết ai đó"
                },
                "examples": [
                    {
                        "en": "He was cut down by an assassin's bullet.",
                        "vi": "Anh ta đã bị chém gục bởi viên đạn của một sát thủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something fall down by cutting it at the base",
                    "vi": "để làm cho một cái gì đó rơi xuống bằng cách cắt nó ở gốc"
                },
                "examples": [
                    {
                        "en": "Some trees had been cut down.",
                        "vi": "Một số cây đã bị chặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reduce the size, amount or number of something",
                    "vi": "để giảm kích thước, số lượng hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need to cut the article down to 1 000 words.",
                        "vi": "Chúng ta cần cắt bài báo xuống còn 1 000 từ."
                    },
                    {
                        "en": "The doctor told him to cut down on his drinking.",
                        "vi": "Bác sĩ bảo anh ấy nên cắt giảm lượng rượu của mình."
                    },
                    {
                        "en": "I won't have a coffee thanks—I'm trying to cut down (= drink less coffee).",
                        "vi": "Cảm ơn tôi sẽ không uống cà phê — tôi đang cố gắng cắt giảm (= uống ít cà phê hơn)."
                    },
                    {
                        "en": "I'm trying to cut down on fatty foods.",
                        "vi": "Tôi đang cố gắng cắt giảm thức ăn béo."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ebd5c79fb1f4c5c9717a9d52a5d4c51",
        "word": "dig",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪɡ/",
            "us": "/dɪɡ/"
        },
        "nearby": [
            {
                "word": "diffuser",
                "pos": "noun"
            },
            {
                "word": "diffusion",
                "pos": "noun"
            },
            {
                "word": "dig",
                "pos": "verb"
            },
            {
                "word": "dig",
                "pos": "noun"
            },
            {
                "word": "the digerati",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a hole in the ground or to move soil from one place to another using your hands, a tool or a machine",
                    "vi": "tạo lỗ trên mặt đất hoặc di chuyển đất từ nơi này sang nơi khác bằng tay, công cụ hoặc máy"
                },
                "examples": [
                    {
                        "en": "I think I'll do some digging in the garden.",
                        "vi": "Tôi nghĩ tôi sẽ đào trong vườn."
                    },
                    {
                        "en": "dig + adv./prep. They dug deeper and deeper but still found nothing.",
                        "vi": "đào + adv./prep. Họ càng ngày càng đào sâu hơn nhưng vẫn không tìm thấy gì."
                    },
                    {
                        "en": "We could only dig down a few feet.",
                        "vi": "Chúng tôi chỉ có thể đào xuống một vài feet."
                    },
                    {
                        "en": "dig for something to dig for gold/treasure",
                        "vi": "đào cái gì đó để đào vàng / kho báu"
                    },
                    {
                        "en": "dig something to dig a hole/trench/grave",
                        "vi": "đào cái gì đó để đào một cái hố / rãnh / mộ"
                    },
                    {
                        "en": "(British English) I've been digging the garden.",
                        "vi": "(Anh Anh) Tôi đang đào khu vườn."
                    },
                    {
                        "en": "dig something + adv./prep. They had obviously dug special tunnels beneath the city.",
                        "vi": "đào cái gì đó + adv./prep. Rõ ràng là họ đã đào những đường hầm đặc biệt bên dưới thành phố."
                    },
                    {
                        "en": "The present entrance was dug through the soft limestone.",
                        "vi": "Lối vào hiện tại được đào xuyên qua lớp đá vôi mềm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something from the ground with a tool",
                    "vi": "để loại bỏ một cái gì đó khỏi mặt đất bằng một công cụ"
                },
                "examples": [
                    {
                        "en": "I'll dig some potatoes for lunch.",
                        "vi": "Tôi sẽ đào một ít khoai tây cho bữa trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to search in something in order to find an object in something",
                    "vi": "tìm kiếm trong một cái gì đó để tìm một đối tượng trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I dug around in my bag for a pen.",
                        "vi": "Tôi lục trong túi để lấy một chiếc bút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to approve of or like something very much",
                    "vi": "chấp thuận hoặc thích một cái gì đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to search for information in a careful and detailed way",
                    "vi": "để tìm kiếm thông tin một cách cẩn thận và chi tiết"
                },
                "examples": [
                    {
                        "en": "You'll need to dig deep into the records to find the figures you want.",
                        "vi": "Bạn sẽ cần phải đào sâu vào hồ sơ để tìm ra những số liệu bạn muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try hard to provide the money, equipment, etc. that is needed",
                    "vi": "cố gắng hết sức để cung cấp tiền, thiết bị, v.v. cần thiết"
                },
                "examples": [
                    {
                        "en": "We're asking you to dig deep for the earthquake victims.",
                        "vi": "Chúng tôi yêu cầu bạn đào sâu tìm kiếm các nạn nhân của trận động đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to discover and reveal information about somebody that could damage them",
                    "vi": "để khám phá và tiết lộ thông tin về ai đó có thể làm hỏng họ"
                },
                "examples": [
                    {
                        "en": "They hired private investigators to dig up dirt on their political opponents.",
                        "vi": "Họ thuê các nhà điều tra tư nhân để đào bới các đối thủ chính trị của họ."
                    },
                    {
                        "en": "She has come to dig the dirt on her old rival.",
                        "vi": "Cô ấy đã đến để đào bới vết bẩn trên đối thủ cũ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to do something or to change your mind about something",
                    "vi": "từ chối làm điều gì đó hoặc thay đổi ý định của bạn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "They dug in their heels and would not lower the price.",
                        "vi": "Họ bám sát vào gót chân của họ và sẽ không hạ giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend a lot of your own money on something",
                    "vi": "tiêu nhiều tiền của riêng bạn vào một thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to push your finger or your elbow into somebody’s side, especially to attract their attention",
                    "vi": "đẩy ngón tay hoặc khuỷu tay của bạn vào phía người nào đó, đặc biệt là để thu hút sự chú ý của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something that will have very harmful results for you",
                    "vi": "làm điều gì đó sẽ có kết quả rất có hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get yourself into a bad situation that will be very difficult to get out of",
                    "vi": "để đưa mình vào một tình huống xấu sẽ rất khó thoát ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d9212a0bc4b742ea8074ed76909443d2",
        "word": "fork",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/fɔːk/",
            "us": "/fɔːrk/"
        },
        "nearby": [
            {
                "word": "forgotten",
                "pos": "verb"
            },
            {
                "word": "For He's a Jolly Good Fellow",
                "pos": ""
            },
            {
                "word": "fork",
                "pos": "noun"
            },
            {
                "word": "fork",
                "pos": "verb"
            },
            {
                "word": "forkball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool with a handle and three or four sharp points (called prongs), used for picking up and eating food",
                    "vi": "một công cụ có tay cầm và ba hoặc bốn đầu nhọn (gọi là ngạnh), dùng để gắp và ăn thức ăn"
                },
                "examples": [
                    {
                        "en": "to eat with a knife and fork",
                        "vi": "ăn bằng dao và nĩa"
                    },
                    {
                        "en": "with a fork Mash the mixture with a fork.",
                        "vi": "bằng nĩa Nghiền hỗn hợp bằng nĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a garden tool with a long or short handle and three or four sharp metal points, used for digging",
                    "vi": "một dụng cụ làm vườn có tay cầm dài hoặc ngắn và ba hoặc bốn đầu nhọn bằng kim loại, dùng để đào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place where a road, river, etc. divides into two parts; either of these two parts",
                    "vi": "một nơi mà một con đường, một con sông, vv chia thành hai phần; một trong hai phần này"
                },
                "examples": [
                    {
                        "en": "Take the right fork.",
                        "vi": "Đi đúng ngã ba."
                    },
                    {
                        "en": "Shortly before dusk they reached a fork and took the left-hand track.",
                        "vi": "Không lâu trước khi chạng vạng, họ đến một ngã ba và rẽ trái."
                    },
                    {
                        "en": "fork in something Bear left at the fork in the road.",
                        "vi": "Ngã ba cái gì Gấu bỏ lại ở ngã ba đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a fork in shape, with two or more long parts",
                    "vi": "một thứ giống như một cái nĩa, có hai hoặc nhiều phần dài"
                },
                "examples": [
                    {
                        "en": "a jagged fork of lightning",
                        "vi": "một ngã ba răng cưa của tia sét"
                    },
                    {
                        "en": "a monkey sitting in the fork of the tree",
                        "vi": "con khỉ ngồi ở ngã ba cây"
                    }
                ]
            },
            {
                "define": {
                    "en": "either of two metal supporting pieces into which a wheel on a bicycle or motorcycle is fitted",
                    "vi": "một trong hai miếng đỡ bằng kim loại để lắp bánh xe đạp hoặc xe máy vào đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3545a27c0ad1451a87ef321c48d78928",
        "word": "snail",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/sneɪl/",
            "us": "/sneɪl/"
        },
        "nearby": [
            {
                "word": "snaggle-tooth",
                "pos": "noun"
            },
            {
                "word": "snaggle-toothed",
                "pos": "adjective"
            },
            {
                "word": "snail",
                "pos": "noun"
            },
            {
                "word": "snail mail",
                "pos": "noun"
            },
            {
                "word": "snake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, soft creature with a hard, round shell on its back, that moves very slowly and often eats garden plants. Some types of snail can be eaten.",
                    "vi": "một sinh vật nhỏ, mềm, có vỏ cứng, tròn trên lưng, di chuyển rất chậm và thường ăn các loại cây trong vườn. Một số loại ốc có thể ăn được."
                },
                "examples": [
                    {
                        "en": "the war with the slugs and snails in my garden",
                        "vi": "cuộc chiến với sên và ốc sên trong vườn của tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "very slowly",
                    "vi": "rất chậm"
                },
                "examples": [
                    {
                        "en": "Traffic had slowed to a snail’s pace.",
                        "vi": "Giao thông đã chậm lại như một con ốc sên."
                    }
                ]
            }
        ]
    },
    {
        "id": "02cb6dbe8de540fd87573176acc30265",
        "word": "axe",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/æks/",
            "us": "/æks/"
        },
        "nearby": [
            {
                "word": "awry",
                "pos": "adverb, adjective"
            },
            {
                "word": "aww",
                "pos": "exclamation"
            },
            {
                "word": "axe",
                "pos": "noun"
            },
            {
                "word": "axe",
                "pos": "verb"
            },
            {
                "word": "axel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool with a wooden handle and a heavy metal blade, used for cutting up wood, cutting down trees, etc.",
                    "vi": "một công cụ có tay cầm bằng gỗ và một lưỡi kim loại nặng, được sử dụng để chặt gỗ, chặt cây, v.v."
                },
                "examples": [
                    {
                        "en": "to chop a tree down with an axe",
                        "vi": "chặt cây bằng rìu"
                    },
                    {
                        "en": "The executioner's axe fell.",
                        "vi": "Chiếc rìu của đao phủ rơi xuống."
                    },
                    {
                        "en": "With a few swift blows of the axe, she severed the cable.",
                        "vi": "Với một vài nhát búa nhanh chóng của chiếc rìu, cô ấy đã cắt đứt dây cáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody gets the axe, they lose their job; if an institution or a project gets the axe, it is closed or stopped, usually because of a lack of money",
                    "vi": "nếu ai đó lấy được rìu, họ sẽ mất việc; nếu một tổ chức hoặc một dự án bị ảnh hưởng, nó sẽ bị đóng cửa hoặc ngừng hoạt động, thường là vì thiếu tiền"
                },
                "examples": [
                    {
                        "en": "Up to 300 workers are facing the axe at a struggling Merseyside firm.",
                        "vi": "Có tới 300 công nhân đang phải đối mặt với búa rìu dư luận tại một công ty đang gặp khó khăn ở Merseyside."
                    },
                    {
                        "en": "Patients are delighted their local hospital has been saved from the axe.",
                        "vi": "Bệnh nhân vui mừng vì bệnh viện địa phương của họ đã được cứu khỏi búa rìu dư luận."
                    },
                    {
                        "en": "Protesters, anxious over the spending cuts, urged councillors to think again before wielding the axe.",
                        "vi": "Những người biểu tình, lo lắng về việc cắt giảm chi tiêu, đã kêu gọi các ủy viên hội đồng suy nghĩ lại trước khi cầm rìu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have private reasons for being involved in something or for arguing for a particular cause",
                    "vi": "có lý do riêng tư để liên quan đến một cái gì đó hoặc để tranh cãi vì một lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "She had no axe to grind and was only acting out of concern for their safety.",
                        "vi": "Cô không có rìu để mài giũa và chỉ hành động vì lo lắng cho sự an toàn của họ."
                    },
                    {
                        "en": "These criticisms are commonly voiced by those who have some political axe to grind.",
                        "vi": "Những lời chỉ trích này thường được lên tiếng bởi những người có búa rìu chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb34eed44da64d5c806e0b2d37b2f6f7",
        "word": "compost",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒmpɒst/",
            "us": "/ˈkɑːmpəʊst/"
        },
        "nearby": [
            {
                "word": "compositor",
                "pos": "noun"
            },
            {
                "word": "compos mentis",
                "pos": "adjective"
            },
            {
                "word": "compost",
                "pos": "noun"
            },
            {
                "word": "compost",
                "pos": "verb"
            },
            {
                "word": "compostable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mixture of decayed (= destroyed by natural processes) plants, food, etc. that can be added to soil to help plants grow",
                    "vi": "một hỗn hợp các loại thực vật, thực phẩm, v.v. bị mục nát (= bị phá hủy bởi các quá trình tự nhiên) có thể được thêm vào đất để giúp cây phát triển"
                },
                "examples": [
                    {
                        "en": "potting compost (= a mixture of soil and compost that you can buy to grow new plants in)",
                        "vi": "phân trộn trong bầu (= hỗn hợp đất và phân trộn mà bạn có thể mua để trồng cây mới)"
                    }
                ]
            }
        ]
    },
    {
        "id": "f5a215f41ad54e87aba4aedc9c374d2e",
        "word": "compost bin",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒmpɒst bɪn/",
            "us": "/ˈkɑːmpəʊst bɪn/"
        },
        "nearby": [
            {
                "word": "compost",
                "pos": "verb"
            },
            {
                "word": "compostable",
                "pos": "adjective"
            },
            {
                "word": "compost bin",
                "pos": "noun"
            },
            {
                "word": "compost heap",
                "pos": "noun"
            },
            {
                "word": "composure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container in the garden where leaves, plants, etc. are put to make compost",
                    "vi": "một thùng chứa trong vườn, nơi lá, cây cối, v.v. được đặt để làm phân trộn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b3ad5eaa89a646eda65a1373d85c0121",
        "word": "fertilizer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɜːtəlaɪzə(r)/",
            "us": "/ˈfɜːrtəlaɪzər/"
        },
        "nearby": [
            {
                "word": "fertilization",
                "pos": "noun"
            },
            {
                "word": "fertilize",
                "pos": "verb"
            },
            {
                "word": "fertilizer",
                "pos": "noun"
            },
            {
                "word": "fervent",
                "pos": "adjective"
            },
            {
                "word": "fervently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance added to soil to make plants grow more successfully",
                    "vi": "một chất được thêm vào đất để làm cho cây phát triển thành công hơn"
                },
                "examples": [
                    {
                        "en": "artificial/chemical fertilizers",
                        "vi": "phân bón nhân tạo / hóa học"
                    },
                    {
                        "en": "liquid fertilizer",
                        "vi": "phân bón lỏng"
                    },
                    {
                        "en": "a bag of fertilizer",
                        "vi": "một bao phân bón"
                    },
                    {
                        "en": "He spread fertilizer on the field with a rake.",
                        "vi": "Anh rải phân trên ruộng bằng một cái cào."
                    }
                ]
            }
        ]
    },
    {
        "id": "993b8ee601674a3f9f6c2f8f3414be15",
        "word": "lawnmower",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlɔːnməʊə(r)/",
            "us": "/ˈlɔːnməʊər/"
        },
        "nearby": [
            {
                "word": "lawn bowling",
                "pos": "noun"
            },
            {
                "word": "lawn chair",
                "pos": "noun"
            },
            {
                "word": "lawnmower",
                "pos": "noun"
            },
            {
                "word": "lawn sign",
                "pos": "noun"
            },
            {
                "word": "lawn tennis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine for cutting the grass on lawns",
                    "vi": "máy cắt cỏ trên bãi cỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "86dce75fd9ed454eab716113df4084ce",
        "word": "mow",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/məʊ/",
            "us": "/məʊ/"
        },
        "nearby": [
            {
                "word": "movingly",
                "pos": "adverb"
            },
            {
                "word": "moving van",
                "pos": "noun"
            },
            {
                "word": "mow",
                "pos": "verb"
            },
            {
                "word": "mow down",
                "pos": "phrasal verb"
            },
            {
                "word": "mower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut grass, etc. using a machine or tool with a special blade (= sharp cutting edge) or blades",
                    "vi": "để cắt cỏ, v.v. bằng máy hoặc công cụ có lưỡi đặc biệt (= lưỡi cắt sắc) hoặc các lưỡi"
                },
                "examples": [
                    {
                        "en": "I mow the lawn every week in summer.",
                        "vi": "Tôi cắt cỏ hàng tuần vào mùa hè."
                    },
                    {
                        "en": "the smell of new-mown hay",
                        "vi": "mùi cỏ khô mới cắt"
                    },
                    {
                        "en": "the smell of freshly mown grass",
                        "vi": "mùi cỏ mới cắt"
                    },
                    {
                        "en": "The lawn needs mowing every week in summer.",
                        "vi": "Bãi cỏ cần được cắt hàng tuần vào mùa hè."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cfa555e0c2c475c9a7644ac2cc17ddf",
        "word": "mower",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈməʊə(r)/",
            "us": "/ˈməʊər/"
        },
        "nearby": [
            {
                "word": "mow",
                "pos": "verb"
            },
            {
                "word": "mow down",
                "pos": "phrasal verb"
            },
            {
                "word": "mower",
                "pos": "noun"
            },
            {
                "word": "Mowgli",
                "pos": ""
            },
            {
                "word": "Mo Mowlam",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine that cuts grass",
                    "vi": "máy cắt cỏ"
                },
                "examples": [
                    {
                        "en": "You should clean your mower each time you use it.",
                        "vi": "Bạn nên vệ sinh máy cắt của mình mỗi lần sử dụng."
                    },
                    {
                        "en": "a lawnmower",
                        "vi": "một máy cắt cỏ"
                    },
                    {
                        "en": "a motor/rotary mower",
                        "vi": "một động cơ / máy cắt quay"
                    }
                ]
            }
        ]
    },
    {
        "id": "6eeeb59e045f4f04b2905492414e8de7",
        "word": "pot",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/pɒt/",
            "us": "/pɑːt/"
        },
        "nearby": [
            {
                "word": "posy",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "verb"
            },
            {
                "word": "potable",
                "pos": "adjective"
            },
            {
                "word": "potash",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put a plant into a flowerpot filled with soil",
                    "vi": "đặt cây vào lọ hoa đầy đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hit a ball into one of the pockets (= holes at the corners and edges of the table)",
                    "vi": "đánh bóng vào một trong các ô (= lỗ ở các góc và cạnh của bàn)"
                },
                "examples": [
                    {
                        "en": "He potted the black to take a 7–3 lead.",
                        "vi": "Anh ta bỏ quân đen dẫn trước 7–3."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill an animal or a bird by shooting it",
                    "vi": "giết một con vật hoặc một con chim bằng cách bắn nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf0c925f3d564829a7723c1785b5c3d3",
        "word": "shovel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃʌvl/",
            "us": "/ˈʃʌvl/"
        },
        "nearby": [
            {
                "word": "shove",
                "pos": "noun"
            },
            {
                "word": "shove-halfpenny",
                "pos": "noun"
            },
            {
                "word": "shovel",
                "pos": "noun"
            },
            {
                "word": "shovel",
                "pos": "verb"
            },
            {
                "word": "shovelful",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool like a spade with a long handle and a broad metal part with curved edges, used for moving earth, snow, sand, etc.",
                    "vi": "một công cụ như thuổng có cán dài và phần kim loại rộng với các cạnh cong, được sử dụng để di chuyển đất, tuyết, cát, v.v."
                },
                "examples": [
                    {
                        "en": "workmen with picks and shovels",
                        "vi": "công nhân cầm cuốc xẻng"
                    },
                    {
                        "en": "(North American English) The children took their pails and shovels to the beach.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Những đứa trẻ mang thùng và xẻng ra bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a large machine or vehicle that digs or moves earth",
                    "vi": "bộ phận của một cỗ máy hoặc phương tiện lớn đào hoặc di chuyển trái đất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41b7639ab300471aa19249a8b355e65a",
        "word": "shovel",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃʌvl/",
            "us": "/ˈʃʌvl/"
        },
        "nearby": [
            {
                "word": "shove-halfpenny",
                "pos": "noun"
            },
            {
                "word": "shovel",
                "pos": "noun"
            },
            {
                "word": "shovel",
                "pos": "verb"
            },
            {
                "word": "shovelful",
                "pos": "noun"
            },
            {
                "word": "shovel-ready",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to lift and move earth, stones, coal, etc. with a shovel",
                    "vi": "để nâng và di chuyển đất, đá, than, v.v. bằng xẻng"
                },
                "examples": [
                    {
                        "en": "A gang of workmen were shovelling rubble onto a truck.",
                        "vi": "Một nhóm công nhân đang xúc đống đổ nát lên một chiếc xe tải."
                    },
                    {
                        "en": "They went out in freezing conditions to shovel snow.",
                        "vi": "Họ đi ra ngoài trong điều kiện băng giá để xúc tuyết."
                    },
                    {
                        "en": "(North American English) to shovel the sidewalk/driveway (= to remove snow)",
                        "vi": "(Tiếng Anh Bắc Mỹ) để xúc vỉa hè / đường lái xe (= để loại bỏ tuyết)"
                    },
                    {
                        "en": "(figurative) He sat at the table, shovelling food into his mouth.",
                        "vi": "(nghĩa bóng) Anh ấy ngồi vào bàn, xúc thức ăn vào miệng."
                    }
                ]
            }
        ]
    },
    {
        "id": "bdf3cf61fdbb4bcfb8abcc0f191b58e6",
        "word": "spade",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/speɪd/",
            "us": "/speɪd/"
        },
        "nearby": [
            {
                "word": "spaciously",
                "pos": "adverb"
            },
            {
                "word": "spaciousness",
                "pos": "noun"
            },
            {
                "word": "spade",
                "pos": "noun"
            },
            {
                "word": "Sam Spade",
                "pos": ""
            },
            {
                "word": "spadework",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a garden tool with a broad metal part and a long handle, used for digging",
                    "vi": "một dụng cụ làm vườn với một phần kim loại rộng và một tay cầm dài, được sử dụng để đào"
                },
                "examples": [
                    {
                        "en": "Turn the soil over with a spade.",
                        "vi": "Lật đất bằng thuổng."
                    },
                    {
                        "en": "(British English) The children took their buckets and spades to the beach.",
                        "vi": "(Tiếng Anh Anh) Những đứa trẻ lấy xô và thuổng đến bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the four suits (= sets) in a pack of cards. The cards have a black design with shapes like pointed leaves with short stems.",
                    "vi": "một trong bốn bộ (= bộ) trong một gói thẻ. Các lá bài có thiết kế màu đen với hình dạng như những chiếc lá nhọn với thân ngắn."
                },
                "examples": [
                    {
                        "en": "the five/queen/ace of spades",
                        "vi": "năm / nữ hoàng / quân át chủ bài"
                    }
                ]
            },
            {
                "define": {
                    "en": "one card from the suit called spades",
                    "vi": "một thẻ từ bộ đồ được gọi là spades"
                },
                "examples": [
                    {
                        "en": "You must play a spade if you have one.",
                        "vi": "Bạn phải chơi một thuổng nếu bạn có một."
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word for a black person",
                    "vi": "một từ xúc phạm cho một người da đen"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say exactly what you think without trying to hide your opinion",
                    "vi": "nói chính xác những gì bạn nghĩ mà không cố gắng che giấu ý kiến của bạn"
                },
                "examples": [
                    {
                        "en": "I believe in calling a spade a spade.",
                        "vi": "Tôi tin vào việc gọi một thuổng là một thuổng."
                    }
                ]
            },
            {
                "define": {
                    "en": "in large amounts or to a great degree",
                    "vi": "với số lượng lớn hoặc ở mức độ lớn"
                },
                "examples": [
                    {
                        "en": "He'd got his revenge now, and in spades.",
                        "vi": "Anh ta đã trả thù ngay bây giờ, và rất ít."
                    }
                ]
            }
        ]
    },
    {
        "id": "6b6aadbeef1245f49a5fddd109d449c6",
        "word": "transplant",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/trænsˈplɑːnt/",
            "us": "/trænsˈplænt/"
        },
        "nearby": [
            {
                "word": "transpiration",
                "pos": "noun"
            },
            {
                "word": "transpire",
                "pos": "verb"
            },
            {
                "word": "transplant",
                "pos": "verb"
            },
            {
                "word": "transplant",
                "pos": "noun"
            },
            {
                "word": "transplantation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take an organ, skin, etc. from one person, animal, part of the body, etc. and put it into or onto another",
                    "vi": "lấy nội tạng, da, v.v. của người, động vật, bộ phận của cơ thể, v.v. và đưa vào hoặc lên người khác"
                },
                "examples": [
                    {
                        "en": "Surgeons have successfully transplanted a liver into a four-year-old boy.",
                        "vi": "Các bác sĩ phẫu thuật đã ghép gan thành công cho một cậu bé bốn tuổi."
                    },
                    {
                        "en": "Patients often reject transplanted organs.",
                        "vi": "Bệnh nhân thường từ chối các cơ quan được cấy ghép."
                    },
                    {
                        "en": "Organs are transplanted from donors into patients who need them.",
                        "vi": "Nội tạng được cấy ghép từ những người hiến tặng cho những bệnh nhân cần chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move a growing plant and plant it somewhere else",
                    "vi": "di chuyển một cây đang phát triển và trồng nó ở một nơi khác"
                },
                "examples": [
                    {
                        "en": "The Dutch successfully transplanted trees to the East Indies.",
                        "vi": "Người Hà Lan đã cấy ghép thành công cây sang Đông Ấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somebody/something to a different place or environment",
                    "vi": "để di chuyển ai đó / cái gì đó đến một nơi hoặc môi trường khác"
                },
                "examples": [
                    {
                        "en": "Japanese production methods have been transplanted into some British factories.",
                        "vi": "Phương pháp sản xuất của Nhật Bản đã được cấy ghép vào một số nhà máy của Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "d762c7c834ac4c3ba6d1ff08c8d27d2e",
        "word": "weed",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/wiːd/",
            "us": "/wiːd/"
        },
        "nearby": [
            {
                "word": "wee",
                "pos": "noun"
            },
            {
                "word": "wee",
                "pos": "verb"
            },
            {
                "word": "weed",
                "pos": "noun"
            },
            {
                "word": "weed",
                "pos": "verb"
            },
            {
                "word": "weedkiller",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wild plant growing where it is not wanted, especially among crops or garden plants",
                    "vi": "một loại cây dại mọc ở nơi không muốn, đặc biệt là giữa các loại cây trồng hoặc vườn cây"
                },
                "examples": [
                    {
                        "en": "The yard was overgrown with weeds.",
                        "vi": "Khoảng sân cỏ dại mọc um tùm."
                    },
                    {
                        "en": "Routine maintenance of the garden consists of keeping weeds under control.",
                        "vi": "Bảo dưỡng định kỳ khu vườn bao gồm kiểm soát cỏ dại."
                    },
                    {
                        "en": "There were weeds pushing up through the gravel.",
                        "vi": "Có cỏ dại chen lấn qua lớp sỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "any wild plant without flowers that grows in water and forms a green floating mass",
                    "vi": "bất kỳ loài thực vật hoang dã nào không có hoa mọc trong nước và tạo thành một khối nổi màu xanh lục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "tobacco or cigarettes",
                    "vi": "thuốc lá điếu hoặc thuốc lá"
                },
                "examples": [
                    {
                        "en": "I wish I could give up the weed (= stop smoking).",
                        "vi": "Tôi ước tôi có thể từ bỏ cỏ dại (= ngừng hút thuốc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the drug cannabis",
                    "vi": "thuốc cần sa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person with a weak character or body",
                    "vi": "một người có tính cách hoặc cơ thể yếu ớt"
                },
                "examples": [
                    {
                        "en": "Don’t be such a weed!",
                        "vi": "Đừng là một loài cỏ dại như vậy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "with more problems, work or commitments than you can manage",
                    "vi": "với nhiều vấn đề, công việc hoặc cam kết hơn bạn có thể quản lý"
                },
                "examples": [
                    {
                        "en": "The bartender was alone and in the weeds, so we had to wait twenty minutes to order.",
                        "vi": "Người pha chế ở một mình và trong đám cỏ dại, vì vậy chúng tôi phải đợi hai mươi phút để gọi món."
                    }
                ]
            },
            {
                "define": {
                    "en": "too concerned with the details of something",
                    "vi": "quá quan tâm đến các chi tiết của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I don't want to get too deep in the weeds here, but here's the short version:…",
                        "vi": "Tôi không muốn đi quá sâu vào đám cỏ dại ở đây, nhưng đây là phiên bản ngắn:…"
                    }
                ]
            }
        ]
    },
    {
        "id": "4d6ce99356624b99b6a2c73d9201080f",
        "word": "weed",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/wiːd/",
            "us": "/wiːd/"
        },
        "nearby": [
            {
                "word": "wee",
                "pos": "verb"
            },
            {
                "word": "weed",
                "pos": "noun"
            },
            {
                "word": "weed",
                "pos": "verb"
            },
            {
                "word": "weedkiller",
                "pos": "noun"
            },
            {
                "word": "weed out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take out weeds from the ground",
                    "vi": "nhổ cỏ khỏi mặt đất"
                },
                "examples": [
                    {
                        "en": "I've been weeding the flower beds.",
                        "vi": "Tôi đang làm cỏ những luống hoa."
                    }
                ]
            }
        ]
    },
    {
        "id": "a40580f8d6424045ad2c24d232192888",
        "word": "allotment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈlɒtmənt/",
            "us": "/əˈlɑːtmənt/"
        },
        "nearby": [
            {
                "word": "allosaurus",
                "pos": "noun"
            },
            {
                "word": "allot",
                "pos": "verb"
            },
            {
                "word": "allotment",
                "pos": "noun"
            },
            {
                "word": "allotrope",
                "pos": "noun"
            },
            {
                "word": "allotropy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small area of land in a town that a person can rent in order to grow fruit and vegetables on it",
                    "vi": "một khu đất nhỏ trong thị trấn mà một người có thể thuê để trồng rau quả trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an amount of something that somebody is given or allowed to have; the process of giving something to somebody",
                    "vi": "một số thứ mà ai đó được cho hoặc được phép có; quá trình trao một thứ gì đó cho ai đó"
                },
                "examples": [
                    {
                        "en": "Water allotments to farmers were cut back in the drought.",
                        "vi": "Việc phân bổ nước cho nông dân bị cắt giảm do hạn hán."
                    },
                    {
                        "en": "the allotment of shares to company employees",
                        "vi": "phân bổ cổ phần cho nhân viên công ty"
                    }
                ]
            }
        ]
    },
    {
        "id": "5c103bec661e4e059070f7e6167155b2",
        "word": "cane",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/keɪn/",
            "us": "/keɪn/"
        },
        "nearby": [
            {
                "word": "candy-striped",
                "pos": "adjective"
            },
            {
                "word": "candy striper",
                "pos": "noun"
            },
            {
                "word": "cane",
                "pos": "noun"
            },
            {
                "word": "cane",
                "pos": "verb"
            },
            {
                "word": "cane rat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard hollow stem of some plants, for example bamboo or sugar",
                    "vi": "thân rỗng cứng của một số cây, ví dụ như tre hoặc đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "these stems used as a material for making furniture, etc.",
                    "vi": "những thân cây này được sử dụng như một vật liệu để làm đồ nội thất, v.v."
                },
                "examples": [
                    {
                        "en": "a cane chair",
                        "vi": "một chiếc ghế chống gậy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of cane or a thin stick, used as a support for plants",
                    "vi": "một đoạn mía hoặc một thanh mảnh, dùng làm giá đỡ cho cây"
                },
                "examples": [
                    {
                        "en": "bean plants supported by long canes",
                        "vi": "cây đậu được hỗ trợ bởi những cây gậy dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of cane or a thin stick, used to help somebody to walk",
                    "vi": "một khúc mía hoặc một chiếc gậy mỏng, dùng để giúp ai đó đi lại"
                },
                "examples": [
                    {
                        "en": "He clutched a top hat and a silver-topped cane.",
                        "vi": "Anh ta nắm chặt một chiếc mũ chóp và một cây gậy đầu bạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of cane or a thin stick, used in the past in some schools for beating children as a punishment",
                    "vi": "Một đoạn gậy hoặc một cây gậy mỏng, được sử dụng trong quá khứ ở một số trường học để đánh trẻ em như một hình phạt"
                },
                "examples": [
                    {
                        "en": "to get the cane (= be punished with a cane)",
                        "vi": "để lấy cây gậy (= bị phạt bằng cây gậy)"
                    }
                ]
            }
        ]
    },
    {
        "id": "5b83f930126b44e99620950f1744fbd2",
        "word": "compost",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmpɒst/",
            "us": "/ˈkɑːmpəʊst/"
        },
        "nearby": [
            {
                "word": "compos mentis",
                "pos": "adjective"
            },
            {
                "word": "compost",
                "pos": "noun"
            },
            {
                "word": "compost",
                "pos": "verb"
            },
            {
                "word": "compostable",
                "pos": "adjective"
            },
            {
                "word": "compost bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something into compost",
                    "vi": "để làm một cái gì đó thành phân trộn"
                },
                "examples": [
                    {
                        "en": "Cover the area with composted bark or peat.",
                        "vi": "Che khu vực bằng vỏ cây đã ủ hoặc than bùn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put compost on or in something",
                    "vi": "để phân trộn trên hoặc trong một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "942360f4523e48089153e0a3f72e1cf2",
        "word": "compostable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəmˈpɒstəbl/",
            "us": "/kəmˈpəʊstəbl/"
        },
        "nearby": [
            {
                "word": "compost",
                "pos": "noun"
            },
            {
                "word": "compost",
                "pos": "verb"
            },
            {
                "word": "compostable",
                "pos": "adjective"
            },
            {
                "word": "compost bin",
                "pos": "noun"
            },
            {
                "word": "compost heap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that can be made into compost",
                    "vi": "có thể được làm thành phân trộn"
                },
                "examples": [
                    {
                        "en": "The green bin scheme collects compostable waste, including cardboard.",
                        "vi": "Kế hoạch thùng màu xanh lá cây thu gom chất thải có thể phân hủy được, bao gồm cả bìa cứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f0f41d590f24d8081c7215a009efa57",
        "word": "cut back",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "cutaway",
                "pos": "adjective"
            },
            {
                "word": "cutaway",
                "pos": "noun"
            },
            {
                "word": "cut back",
                "pos": "phrasal verb"
            },
            {
                "word": "cutback",
                "pos": "noun"
            },
            {
                "word": "cut down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to reduce something",
                    "vi": "để giảm bớt thứ gì đó"
                },
                "examples": [
                    {
                        "en": "If we don't sell more we'll have to cut back production.",
                        "vi": "Nếu chúng tôi không bán được nhiều hơn nữa, chúng tôi sẽ phải cắt giảm sản lượng."
                    },
                    {
                        "en": "to cut back on spending",
                        "vi": "cắt giảm chi tiêu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a bush, etc. smaller by cutting branches off",
                    "vi": "để làm cho một bụi cây, v.v. nhỏ hơn bằng cách cắt bỏ các nhánh"
                },
                "examples": [
                    {
                        "en": "to cut back a rose bush",
                        "vi": "cắt bỏ một bụi hoa hồng"
                    }
                ]
            }
        ]
    },
    {
        "id": "ca3f2030392a4fddad6beabd9588993d",
        "word": "graft",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrɑːft/",
            "us": "/ɡræft/"
        },
        "nearby": [
            {
                "word": "graffiti",
                "pos": "noun"
            },
            {
                "word": "graft",
                "pos": "noun"
            },
            {
                "word": "graft",
                "pos": "verb"
            },
            {
                "word": "Graham",
                "pos": ""
            },
            {
                "word": "Billy Graham",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take a piece of skin, bone, etc. from a living body and attach it to a damaged part",
                    "vi": "để lấy một phần da, xương, v.v. từ cơ thể sống và gắn nó vào bộ phận bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "newly grafted tissue",
                        "vi": "mô mới ghép"
                    },
                    {
                        "en": "New skin had to be grafted on from his back.",
                        "vi": "Da mới phải được ghép từ lưng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut a piece from a living plant and attach it to another plant",
                    "vi": "cắt một mảnh từ một cây sống và gắn nó vào một cây khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make one idea, system, etc. become part of another one",
                    "vi": "để biến một ý tưởng, hệ thống, v.v. trở thành một phần của một ý tưởng khác"
                },
                "examples": [
                    {
                        "en": "Old values are being grafted onto a new social class.",
                        "vi": "Những giá trị cũ đang được ghép vào một giai cấp xã hội mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work hard",
                    "vi": "làm việc chăm chỉ"
                },
                "examples": [
                    {
                        "en": "She’s been grafting all day.",
                        "vi": "Cô ấy đã ghép cả ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ce5d697a6ec495b89f1a89020732c19",
        "word": "growbag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrəʊbæɡ/",
            "us": "/ˈɡrəʊbæɡ/"
        },
        "nearby": [
            {
                "word": "grow away from",
                "pos": "phrasal verb"
            },
            {
                "word": "grow back",
                "pos": "phrasal verb"
            },
            {
                "word": "growbag",
                "pos": "noun"
            },
            {
                "word": "grower",
                "pos": "noun"
            },
            {
                "word": "growing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large plastic bag full of soil, used for growing plants in",
                    "vi": "một túi nhựa lớn chứa đầy đất, được sử dụng để trồng cây trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "061c034ded5b44c6b69aac684bb82d60",
        "word": "hedge trimmer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhedʒ trɪmə(r)/",
            "us": "/ˈhedʒ trɪmər/"
        },
        "nearby": [
            {
                "word": "hedge in",
                "pos": "phrasal verb"
            },
            {
                "word": "hedgerow",
                "pos": "noun"
            },
            {
                "word": "hedge trimmer",
                "pos": "noun"
            },
            {
                "word": "hedonism",
                "pos": "noun"
            },
            {
                "word": "hedonist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment used for cutting hedges",
                    "vi": "một phần của thiết bị được sử dụng để cắt hàng rào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0d2d87f6648b47c1aedf30bd2104491d",
        "word": "hoe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/həʊ/",
            "us": "/həʊ/"
        },
        "nearby": [
            {
                "word": "Dorothy Hodgkin",
                "pos": ""
            },
            {
                "word": "Hodgkin lymphoma",
                "pos": "noun"
            },
            {
                "word": "hoe",
                "pos": "noun"
            },
            {
                "word": "hoe",
                "pos": "verb"
            },
            {
                "word": "hoedown",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a garden tool with a long handle and a thin metal blade, used for breaking up soil and removing weeds (= plants growing where they are not wanted)",
                    "vi": "một dụng cụ làm vườn có tay cầm dài và một lưỡi kim loại mỏng, dùng để xới đất và loại bỏ cỏ dại (= cây mọc ở nơi chúng không mong muốn)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fe1778e8151f4eb685a0ebe2da536905",
        "word": "hoe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/həʊ/",
            "us": "/həʊ/"
        },
        "nearby": [
            {
                "word": "Hodgkin lymphoma",
                "pos": "noun"
            },
            {
                "word": "hoe",
                "pos": "noun"
            },
            {
                "word": "hoe",
                "pos": "verb"
            },
            {
                "word": "hoedown",
                "pos": "noun"
            },
            {
                "word": "hoe in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to break up soil, remove plants, etc. with a hoe",
                    "vi": "xới đất, loại bỏ cây trồng, v.v. bằng cuốc"
                },
                "examples": [
                    {
                        "en": "to hoe the flower beds",
                        "vi": "cuốc những luống hoa"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9a36455e12048cfb15d6f987da3dfe8",
        "word": "horticulture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːtɪkʌltʃə(r)/",
            "us": "/ˈhɔːrtɪkʌltʃər/"
        },
        "nearby": [
            {
                "word": "horticultural",
                "pos": "adjective"
            },
            {
                "word": "horticulturalist",
                "pos": "noun"
            },
            {
                "word": "horticulture",
                "pos": "noun"
            },
            {
                "word": "horticulturist",
                "pos": "noun"
            },
            {
                "word": "hosanna",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study or practice of growing flowers, fruit and vegetables",
                    "vi": "nghiên cứu hoặc thực hành trồng hoa, trái cây và rau"
                },
                "examples": [
                    {
                        "en": "a college of agriculture and horticulture",
                        "vi": "trường cao đẳng nông nghiệp và làm vườn"
                    }
                ]
            }
        ]
    },
    {
        "id": "27a795505bbe4c8aaabec1cae52548e3",
        "word": "manure",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈnjʊə(r)/",
            "us": "/məˈnʊr/"
        },
        "nearby": [
            {
                "word": "manumission",
                "pos": "noun"
            },
            {
                "word": "man up",
                "pos": "phrasal verb"
            },
            {
                "word": "manure",
                "pos": "noun"
            },
            {
                "word": "manure",
                "pos": "verb"
            },
            {
                "word": "manuscript",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the waste matter from animals that is spread over or mixed with the soil to help plants and crops grow",
                    "vi": "chất thải từ động vật được rải hoặc trộn với đất để giúp cây cối và hoa màu phát triển"
                },
                "examples": [
                    {
                        "en": "Dig plenty of well-rotted manure into the soil.",
                        "vi": "Đào nhiều phân chuồng hoai mục vào đất."
                    },
                    {
                        "en": "the best time to spread manure on the fields",
                        "vi": "thời điểm tốt nhất để rải phân trên ruộng"
                    }
                ]
            }
        ]
    },
    {
        "id": "cf4dd654e8fe41b39318e7ea7f9fd3b9",
        "word": "manure",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈnjʊə(r)/",
            "us": "/məˈnʊr/"
        },
        "nearby": [
            {
                "word": "man up",
                "pos": "phrasal verb"
            },
            {
                "word": "manure",
                "pos": "noun"
            },
            {
                "word": "manure",
                "pos": "verb"
            },
            {
                "word": "manuscript",
                "pos": "noun"
            },
            {
                "word": "manuscript paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put manure on or in soil to help plants grow",
                    "vi": "bỏ phân vào hoặc trong đất để giúp cây phát triển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9806e8fe4db44164b56eb9aec02d608c",
        "word": "mulch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mʌltʃ/",
            "us": "/mʌltʃ/"
        },
        "nearby": [
            {
                "word": "mulberry",
                "pos": "noun"
            },
            {
                "word": "the Mulberry harbours",
                "pos": ""
            },
            {
                "word": "mulch",
                "pos": "noun"
            },
            {
                "word": "mulch",
                "pos": "verb"
            },
            {
                "word": "mule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "material, for example, decaying leaves, that you put around a plant to protect its base and its roots, to improve the quality of the soil or to stop weeds growing",
                    "vi": "vật liệu, ví dụ, lá mục mà bạn đặt xung quanh cây để bảo vệ gốc và rễ của nó, để cải thiện chất lượng đất hoặc ngăn cỏ dại mọc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e6d4472e0b8f4963bb788cb03fa65957",
        "word": "mulch",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/mʌltʃ/",
            "us": "/mʌltʃ/"
        },
        "nearby": [
            {
                "word": "the Mulberry harbours",
                "pos": ""
            },
            {
                "word": "mulch",
                "pos": "noun"
            },
            {
                "word": "mulch",
                "pos": "verb"
            },
            {
                "word": "mule",
                "pos": "noun"
            },
            {
                "word": "muleteer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cover the soil or the roots of a plant with a mulch",
                    "vi": "phủ lớp phủ lên đất hoặc rễ cây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "289b45c5e4a645da80638de0a1c593e1",
        "word": "overgrown",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvəˈɡrəʊn/",
            "us": "/ˌəʊvərˈɡrəʊn/"
        },
        "nearby": [
            {
                "word": "overground",
                "pos": "adjective"
            },
            {
                "word": "overground",
                "pos": "adverb"
            },
            {
                "word": "overgrown",
                "pos": "adjective"
            },
            {
                "word": "overgrowth",
                "pos": "noun"
            },
            {
                "word": "overhand",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "covered with plants that have been allowed to grow wild and have not been controlled",
                    "vi": "được bao phủ bởi các loại thực vật được phép mọc hoang và chưa được kiểm soát"
                },
                "examples": [
                    {
                        "en": "an overgrown path",
                        "vi": "một con đường mọc um tùm"
                    },
                    {
                        "en": "The path was completely overgrown.",
                        "vi": "Đường đi đã hoàn toàn mọc um tùm."
                    },
                    {
                        "en": "overgrown with something The garden's completely overgrown with weeds.",
                        "vi": "mọc um tùm với thứ gì đó Khu vườn hoàn toàn bị cỏ dại mọc um tùm."
                    },
                    {
                        "en": "The canal bank was thickly overgrown with last year’s brambles.",
                        "vi": "Bờ kênh đã mọc um tùm với những lùm xùm năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "that has grown too large",
                    "vi": "nó đã phát triển quá lớn"
                },
                "examples": [
                    {
                        "en": "an overgrown village",
                        "vi": "một ngôi làng mọc um tùm"
                    },
                    {
                        "en": "They act like a pair of overgrown children (= they are adults but they behave like children).",
                        "vi": "Họ hành động như một cặp trẻ con quá lứa (= họ là người lớn nhưng họ cư xử như một đứa trẻ)."
                    }
                ]
            }
        ]
    },
    {
        "id": "49e2b377666c427fb86feca35caa2107",
        "word": "peat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/piːt/",
            "us": "/piːt/"
        },
        "nearby": [
            {
                "word": "pea-shooter",
                "pos": "noun"
            },
            {
                "word": "pea-souper",
                "pos": "noun"
            },
            {
                "word": "peat",
                "pos": "noun"
            },
            {
                "word": "peatland",
                "pos": "noun"
            },
            {
                "word": "peat moss",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soft black or brown substance formed from old or dying plants just under the surface of the ground, especially in cool wet areas. It is burned as a fuel or used to improve garden soil.",
                    "vi": "một chất mềm màu đen hoặc nâu được hình thành từ những cây già hoặc chết ngay dưới bề mặt của mặt đất, đặc biệt là ở những khu vực ẩm ướt. Nó được đốt cháy làm chất đốt hoặc dùng để cải tạo đất vườn."
                },
                "examples": [
                    {
                        "en": "peat bogs",
                        "vi": "vũng lầy than bùn"
                    },
                    {
                        "en": "peat extraction",
                        "vi": "khai thác than bùn"
                    },
                    {
                        "en": "a peat fire (= one in which cut pieces of peat are burned)",
                        "vi": "một đám cháy than bùn (= một đám cháy trong đó những mảnh than bùn đã cắt được đốt cháy)"
                    }
                ]
            }
        ]
    },
    {
        "id": "680b97f1141a4b3b85689c2f6c1cf155",
        "word": "peaty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpiːti/",
            "us": "/ˈpiːti/"
        },
        "nearby": [
            {
                "word": "peatland",
                "pos": "noun"
            },
            {
                "word": "peat moss",
                "pos": "noun"
            },
            {
                "word": "peaty",
                "pos": "adjective"
            },
            {
                "word": "pebble",
                "pos": "noun"
            },
            {
                "word": "pebble-dash",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing or similar to peat",
                    "vi": "có chứa hoặc tương tự như than bùn"
                },
                "examples": [
                    {
                        "en": "peaty soils",
                        "vi": "đất than bùn"
                    }
                ]
            }
        ]
    },
    {
        "id": "e47dd61b95114ac2a73ca0624eb51dce",
        "word": "prune",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pruːn/",
            "us": "/pruːn/"
        },
        "nearby": [
            {
                "word": "prudishness",
                "pos": "noun"
            },
            {
                "word": "prune",
                "pos": "noun"
            },
            {
                "word": "prune",
                "pos": "verb"
            },
            {
                "word": "pruning",
                "pos": "noun"
            },
            {
                "word": "pruning shears",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut off some of the branches from a tree, bush, etc. so that it will grow better and stronger",
                    "vi": "cắt bỏ một số cành trên cây, bụi rậm, v.v. để nó phát triển tốt hơn và khỏe hơn"
                },
                "examples": [
                    {
                        "en": "prune something When should you prune apple trees?",
                        "vi": "Cắt tỉa cái gì Khi nào bạn nên cắt tỉa cây táo?"
                    },
                    {
                        "en": "He pruned the longer branches off the tree.",
                        "vi": "Anh cắt tỉa những cành dài ra khỏi cây."
                    },
                    {
                        "en": "prune something back The hedge needs pruning back.",
                        "vi": "tỉa lại cái gì đó Hàng rào cần tỉa lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something smaller by removing parts; to cut out parts of something",
                    "vi": "để làm cho một cái gì đó nhỏ hơn bằng cách loại bỏ các bộ phận; để cắt bỏ các phần của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Staff numbers have been pruned back to 175.",
                        "vi": "Số lượng nhân viên đã được cắt giảm xuống còn 175."
                    },
                    {
                        "en": "The railway companies have pruned their timetables (= there are fewer trains).",
                        "vi": "Các công ty đường sắt đã cắt bớt lịch trình của họ (= có ít chuyến tàu hơn)."
                    },
                    {
                        "en": "Prune out any unnecessary details.",
                        "vi": "Cắt bỏ những chi tiết không cần thiết."
                    },
                    {
                        "en": "Their budgets have been drastically pruned.",
                        "vi": "Ngân sách của họ đã được cắt giảm mạnh mẽ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a1041be6b5e4c359f8722886b45650d",
        "word": "raised bed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌreɪzd ˈbed/",
            "us": "/ˌreɪzd ˈbed/"
        },
        "nearby": [
            {
                "word": "raise",
                "pos": "noun"
            },
            {
                "word": "raised",
                "pos": "adjective"
            },
            {
                "word": "raised bed",
                "pos": "noun"
            },
            {
                "word": "raise to",
                "pos": "phrasal verb"
            },
            {
                "word": "raisin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in a garden that is higher than the ground around it and is usually surrounded by a frame made of wood or stone",
                    "vi": "khu vực trong vườn cao hơn mặt đất xung quanh và thường được bao quanh bởi khung làm bằng gỗ hoặc đá"
                },
                "examples": [
                    {
                        "en": "Vegetables and herbs were grown in a raised bed.",
                        "vi": "Rau và các loại thảo mộc được trồng trên luống cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2923f637dd642558aa636eca5e0caf1",
        "word": "rake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪk/",
            "us": "/reɪk/"
        },
        "nearby": [
            {
                "word": "raja",
                "pos": "noun"
            },
            {
                "word": "The Raj Quartet",
                "pos": ""
            },
            {
                "word": "rake",
                "pos": "noun"
            },
            {
                "word": "rake",
                "pos": "verb"
            },
            {
                "word": "raked",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a garden tool with a long handle and a row of metal points at the end, used for gathering fallen leaves and making soil smooth",
                    "vi": "một dụng cụ làm vườn có tay cầm dài và một hàng kim loại ở cuối, được sử dụng để thu gom lá rụng và làm cho đất mịn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man, especially a rich and fashionable one, who was thought to have low moral standards, for example because he drank or gambled a lot or had sex with a lot of women",
                    "vi": "một người đàn ông, đặc biệt là một người giàu có và thời trang, người được cho là có tiêu chuẩn đạo đức thấp, chẳng hạn như vì anh ta uống rượu, đánh bạc nhiều hoặc quan hệ tình dục với nhiều phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the amount by which something, especially the stage in a theatre, slopes",
                    "vi": "số lượng mà thứ gì đó, đặc biệt là sân khấu trong nhà hát, dốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9456fd7226f5496eb1df65db89b71bfb",
        "word": "rake",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪk/",
            "us": "/reɪk/"
        },
        "nearby": [
            {
                "word": "The Raj Quartet",
                "pos": ""
            },
            {
                "word": "rake",
                "pos": "noun"
            },
            {
                "word": "rake",
                "pos": "verb"
            },
            {
                "word": "raked",
                "pos": "adjective"
            },
            {
                "word": "rake in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pull a rake over a surface in order to make it level or to remove something",
                    "vi": "kéo một cái cào trên một bề mặt để làm cho nó bằng phẳng hoặc để loại bỏ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "rake (something) (+ adv./prep.) The leaves had been raked into a pile.",
                        "vi": "rake (cái gì đó) (+ adv./prep.) Những chiếc lá đã được cào thành một đống."
                    },
                    {
                        "en": "(figurative) She raked a comb through her hair.",
                        "vi": "(nghĩa bóng) Cô ấy cào một chiếc lược trên tóc."
                    },
                    {
                        "en": "rake something + adj. First rake the soil smooth.",
                        "vi": "cào cái gì đó + adj. Đầu tiên xới đất cho mịn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to point a camera, light, gun, etc. at somebody/something and move it slowly from one side to the other",
                    "vi": "để chĩa máy ảnh, ánh sáng, súng, v.v. vào ai đó / cái gì đó và di chuyển từ từ bên này sang bên kia"
                },
                "examples": [
                    {
                        "en": "They raked the streets with machine-gun fire.",
                        "vi": "Họ cướp phá đường phố bằng súng máy."
                    },
                    {
                        "en": "Searchlights raked the grounds.",
                        "vi": "Đèn rọi vào mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to search a place carefully for something",
                    "vi": "để tìm kiếm một nơi cẩn thận cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She raked around in her bag for her keys.",
                        "vi": "Cô lục tung túi xách để tìm chìa khóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to scratch the surface of something with a sharp object, especially your nails",
                    "vi": "để làm xước bề mặt của một cái gì đó bằng một vật sắc nhọn, đặc biệt là móng tay của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody severely because they have done something wrong",
                    "vi": "chỉ trích ai đó nghiêm khắc bởi vì họ đã làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "I was raked over the coals by my boss for being late.",
                        "vi": "Tôi đã bị ông chủ của mình cào than vì đến muộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0df6c6bd152a4e2da89cd4323966a407",
        "word": "scythe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/saɪð/",
            "us": "/saɪð/"
        },
        "nearby": [
            {
                "word": "scuzzy",
                "pos": "adjective"
            },
            {
                "word": "Scylla and Charybdis",
                "pos": "noun"
            },
            {
                "word": "scythe",
                "pos": "noun"
            },
            {
                "word": "scythe",
                "pos": "verb"
            },
            {
                "word": "SD",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool with a long handle and a slightly curved blade (= sharp metal cutting edge), held in two hands and used for cutting long grass, etc.",
                    "vi": "một công cụ có tay cầm dài và lưỡi hơi cong (= lưỡi cắt kim loại sắc), được cầm bằng hai tay và được sử dụng để cắt cỏ dài, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "697b262d1ffa4876b55870b380cab824",
        "word": "secateurs",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsekəˈtɜːz/",
            "us": "/ˌsekəˈtɜːrz/"
        },
        "nearby": [
            {
                "word": "Sec.",
                "pos": "abbreviation"
            },
            {
                "word": "SECAM",
                "pos": "noun"
            },
            {
                "word": "secateurs",
                "pos": "noun"
            },
            {
                "word": "secede",
                "pos": "verb"
            },
            {
                "word": "secession",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a garden tool like a pair of strong scissors, used for cutting plant stems and small branches",
                    "vi": "một công cụ làm vườn như một chiếc kéo mạnh, được sử dụng để cắt thân cây và cành nhỏ"
                },
                "examples": [
                    {
                        "en": "a pair of secateurs",
                        "vi": "một cặp vợ chồng"
                    }
                ]
            }
        ]
    },
    {
        "id": "ec539f809267467cb7cb0f430bceb200",
        "word": "seedbed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːdbed/",
            "us": "/ˈsiːdbed/"
        },
        "nearby": [
            {
                "word": "seed",
                "pos": "noun"
            },
            {
                "word": "seed",
                "pos": "verb"
            },
            {
                "word": "seedbed",
                "pos": "noun"
            },
            {
                "word": "seed cake",
                "pos": "noun"
            },
            {
                "word": "seed coat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of soil which has been specially prepared for planting seeds in",
                    "vi": "một khu vực đất đã được chuẩn bị đặc biệt để gieo hạt ở"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place or situation in which something can develop",
                    "vi": "một địa điểm hoặc tình huống mà thứ gì đó có thể phát triển"
                },
                "examples": [
                    {
                        "en": "a seedbed for ideas",
                        "vi": "một lớp mầm cho những ý tưởng"
                    },
                    {
                        "en": "A secure environment is the seedbed of emotional growth.",
                        "vi": "Một môi trường an toàn là mầm mống của sự phát triển cảm xúc."
                    }
                ]
            }
        ]
    },
    {
        "id": "2d447da60fa5475fb91bb1001d121008",
        "word": "shears",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃɪəz/",
            "us": "/ʃɪrz/"
        },
        "nearby": [
            {
                "word": "shear",
                "pos": "verb"
            },
            {
                "word": "George Shearing",
                "pos": ""
            },
            {
                "word": "shears",
                "pos": "noun"
            },
            {
                "word": "shearwater",
                "pos": "noun"
            },
            {
                "word": "sheath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a garden tool like a very large pair of scissors, used for cutting bushes and hedges",
                    "vi": "một công cụ làm vườn như một chiếc kéo rất lớn, được sử dụng để cắt bụi rậm và hàng rào"
                },
                "examples": [
                    {
                        "en": "a pair of garden shears",
                        "vi": "một cặp kéo cắt vườn"
                    }
                ]
            }
        ]
    },
    {
        "id": "36b36adf2ebc4b4ebf674f587af84d01",
        "word": "slug",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slʌɡ/",
            "us": "/slʌɡ/"
        },
        "nearby": [
            {
                "word": "slubbed",
                "pos": "adjective"
            },
            {
                "word": "sludge",
                "pos": "noun"
            },
            {
                "word": "slug",
                "pos": "noun"
            },
            {
                "word": "slug",
                "pos": "verb"
            },
            {
                "word": "slugfest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, soft creature, like a snail without a shell, that moves very slowly and often eats garden plants",
                    "vi": "một sinh vật nhỏ, mềm, giống như một con ốc không có vỏ, di chuyển rất chậm và thường ăn các loại cây trong vườn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small amount of a strong alcoholic drink",
                    "vi": "một lượng nhỏ đồ uống có cồn mạnh"
                },
                "examples": [
                    {
                        "en": "He took another slug of whisky.",
                        "vi": "Anh ta uống một ly rượu whisky khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bullet",
                    "vi": "viên đạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of metal like a coin in shape used to get things from machines, etc., sometimes illegally",
                    "vi": "một miếng kim loại có hình dạng giống như đồng xu được sử dụng để lấy đồ từ máy móc, v.v., đôi khi là bất hợp pháp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a07b14e3a8aa430cbffa0457aeea4eb2",
        "word": "sow",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/səʊ/",
            "us": "/səʊ/"
        },
        "nearby": [
            {
                "word": "soviet",
                "pos": "noun"
            },
            {
                "word": "Soviet",
                "pos": "adjective"
            },
            {
                "word": "sow1",
                "pos": "verb"
            },
            {
                "word": "sow2",
                "pos": "noun"
            },
            {
                "word": "sower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to plant or spread seeds in or on the ground",
                    "vi": "để gieo hoặc rải hạt trong hoặc trên mặt đất"
                },
                "examples": [
                    {
                        "en": "sow (something) Sow the seeds in rows.",
                        "vi": "gieo (cái gì đó) Gieo hạt theo hàng."
                    },
                    {
                        "en": "Sow the seeds quite thinly.",
                        "vi": "Gieo hạt mỏng."
                    },
                    {
                        "en": "Water well after sowing.",
                        "vi": "Tưới nước đầy đủ sau khi gieo hạt."
                    },
                    {
                        "en": "Sow rows of lettuces between other vegetables.",
                        "vi": "Gieo các hàng ô li giữa các loại rau khác."
                    },
                    {
                        "en": "sow something with something The fields around had been sown with wheat.",
                        "vi": "gieo một cái gì đó với một cái gì đó Những cánh đồng xung quanh đã được gieo bằng lúa mì."
                    },
                    {
                        "en": "We’ve sown that field with wheat.",
                        "vi": "Chúng tôi đã gieo hạt lúa mì trên cánh đồng đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to introduce or spread feelings or ideas, especially ones that cause trouble",
                    "vi": "để giới thiệu hoặc truyền bá cảm xúc hoặc ý tưởng, đặc biệt là những ý tưởng gây rắc rối"
                },
                "examples": [
                    {
                        "en": "to sow doubt in somebody’s mind",
                        "vi": "gieo nghi ngờ trong tâm trí ai đó"
                    },
                    {
                        "en": "to sow confusion",
                        "vi": "gieo rắc rối"
                    }
                ]
            },
            {
                "define": {
                    "en": "to start the process that leads to a particular situation or result",
                    "vi": "để bắt đầu quá trình dẫn đến một tình huống hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "In this way he sowed the seeds of his own success.",
                        "vi": "Bằng cách này, anh đã gieo những hạt giống thành công của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go through a period of wild behaviour while young, especially having a lot of romantic or sexual relationships",
                    "vi": "trải qua thời kỳ có những hành vi hoang dã khi còn trẻ, đặc biệt là có nhiều mối quan hệ lãng mạn hoặc tình dục"
                },
                "examples": [
                    {
                        "en": "He wants to leave home, sow his wild oats and learn about life.",
                        "vi": "Anh ấy muốn rời khỏi nhà, gieo những tổ yến hoang dã của mình và tìm hiểu về cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "you have to deal with the bad effects or results of something that you originally started",
                    "vi": "bạn phải đối phó với những tác động xấu hoặc kết quả của điều gì đó mà bạn đã bắt đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0f3a64e4322a4e90948805d739d85e5f",
        "word": "sprinkler",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsprɪŋklə(r)/",
            "us": "/ˈsprɪŋklər/"
        },
        "nearby": [
            {
                "word": "sprinkle",
                "pos": "verb"
            },
            {
                "word": "sprinkle",
                "pos": "noun"
            },
            {
                "word": "sprinkler",
                "pos": "noun"
            },
            {
                "word": "sprinkles",
                "pos": "noun"
            },
            {
                "word": "sprinkling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device with holes in that is used to spray water in drops onto plants, soil or grass",
                    "vi": "một thiết bị có lỗ được sử dụng để phun nước nhỏ giọt lên cây, đất hoặc cỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a device inside a building that sprays out water if it detects a rise in temperature because of a fire",
                    "vi": "một thiết bị bên trong một tòa nhà phun ra nước nếu nó phát hiện thấy nhiệt độ tăng lên do hỏa hoạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e265039c087142aea11849d9be5b1711",
        "word": "Strimmer™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstrɪmə(r)/",
            "us": "/ˈstrɪmər/"
        },
        "nearby": [
            {
                "word": "striking circle",
                "pos": "noun"
            },
            {
                "word": "strikingly",
                "pos": "adverb"
            },
            {
                "word": "Strimmer",
                "pos": "noun"
            },
            {
                "word": "Strine",
                "pos": "noun"
            },
            {
                "word": "Strine",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electric garden tool held in the hands and used for cutting grass that is difficult to cut with a larger machine",
                    "vi": "một dụng cụ điện làm vườn cầm trên tay và được sử dụng để cắt cỏ khó cắt bằng máy lớn hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5043efb29cc04a4dab28588338a94d2f",
        "word": "trim",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/trɪm/",
            "us": "/trɪm/"
        },
        "nearby": [
            {
                "word": "trilobite",
                "pos": "noun"
            },
            {
                "word": "trilogy",
                "pos": "noun"
            },
            {
                "word": "trim",
                "pos": "verb"
            },
            {
                "word": "trim",
                "pos": "noun"
            },
            {
                "word": "trim",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something neater, smaller, better, etc., by cutting parts from it",
                    "vi": "để làm cho thứ gì đó gọn gàng hơn, nhỏ hơn, tốt hơn, v.v., bằng cách cắt các bộ phận từ nó"
                },
                "examples": [
                    {
                        "en": "to trim your hair",
                        "vi": "tỉa tóc của bạn"
                    },
                    {
                        "en": "to trim a hedge (back)",
                        "vi": "để cắt tỉa một hàng rào (trở lại)"
                    },
                    {
                        "en": "(figurative) The training budget had been trimmed by £10 000.",
                        "vi": "(nghĩa bóng) Ngân sách đào tạo đã bị cắt bớt £ 10 000."
                    },
                    {
                        "en": "a neatly-trimmed beard",
                        "vi": "bộ râu được cắt tỉa gọn gàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut away unnecessary parts from something",
                    "vi": "để cắt bỏ những phần không cần thiết khỏi thứ gì đó"
                },
                "examples": [
                    {
                        "en": "trim something (off something) Trim any excess fat off the meat.",
                        "vi": "Cắt bỏ một thứ gì đó (cắt bỏ một thứ gì đó) Cắt bỏ phần mỡ thừa ra khỏi thịt."
                    },
                    {
                        "en": "I trimmed two centimetres off the hem of the skirt.",
                        "vi": "Tôi cắt bớt hai cm ở gấu váy."
                    },
                    {
                        "en": "trim something away/off Trim away the lower leaves.",
                        "vi": "tỉa bớt một thứ gì đó đi / bớt Cắt tỉa những lá phía dưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decorate something, especially around its edges",
                    "vi": "để trang trí một cái gì đó, đặc biệt là xung quanh các cạnh của nó"
                },
                "examples": [
                    {
                        "en": "gloves trimmed with fur",
                        "vi": "găng tay tỉa lông"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange the sails of a boat to suit the wind so that the boat moves faster",
                    "vi": "sắp xếp buồm của thuyền cho phù hợp với gió để thuyền chuyển động nhanh hơn."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reduce your costs",
                    "vi": "để giảm chi phí của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cd6f02c982d945338923574a61c7826b",
        "word": "trowel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtraʊəl/",
            "us": "/ˈtraʊəl/"
        },
        "nearby": [
            {
                "word": "trout",
                "pos": "noun"
            },
            {
                "word": "trove",
                "pos": "noun"
            },
            {
                "word": "trowel",
                "pos": "noun"
            },
            {
                "word": "troy",
                "pos": "noun"
            },
            {
                "word": "truancy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small garden tool with a curved metal part for lifting plants and digging holes",
                    "vi": "một dụng cụ làm vườn nhỏ có phần kim loại cong để nâng cây và đào hố"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small tool with a flat metal part, used in building for spreading cement or plaster",
                    "vi": "một công cụ nhỏ với một phần kim loại phẳng, được sử dụng trong xây dựng để trét xi măng hoặc thạch cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk about somebody/something in a way that makes them or it seem much better or much worse than they really are; to exaggerate something",
                    "vi": "nói về ai đó / điều gì đó theo cách khiến họ hoặc có vẻ tốt hơn hoặc tệ hơn nhiều so với thực tế; phóng đại cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was laying the flattery on with a trowel.",
                        "vi": "Anh ta đang dùng một cái bay để tâng bốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "abfe989f9127496180222884e8903101",
        "word": "watering can",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːtərɪŋ kæn/",
            "us": "/ˈwɔːtərɪŋ kæn/"
        },
        "nearby": [
            {
                "word": "waterhole",
                "pos": "noun"
            },
            {
                "word": "water ice",
                "pos": "noun"
            },
            {
                "word": "watering can",
                "pos": "noun"
            },
            {
                "word": "watering hole",
                "pos": "noun"
            },
            {
                "word": "watering place",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal or plastic container with a handle and a long spout, used for pouring water on plants",
                    "vi": "một thùng kim loại hoặc nhựa có tay cầm và vòi dài, dùng để đổ nước lên cây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "697296d8db9d4ddf837776b5fb259906",
        "word": "wheelbarrow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwiːlbærəʊ/",
            "us": "/ˈwiːlbærəʊ/"
        },
        "nearby": [
            {
                "word": "wheel",
                "pos": "verb"
            },
            {
                "word": "wheel arch",
                "pos": "noun"
            },
            {
                "word": "wheelbarrow",
                "pos": "noun"
            },
            {
                "word": "wheelbase",
                "pos": "noun"
            },
            {
                "word": "wheelchair",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large open container with a wheel and two handles that you use outside to carry things",
                    "vi": "một thùng mở lớn có bánh xe và hai tay cầm mà bạn sử dụng bên ngoài để đựng đồ"
                },
                "examples": [
                    {
                        "en": "She took the chest home in a wheelbarrow.",
                        "vi": "Cô mang chiếc rương về nhà bằng xe cút kít."
                    },
                    {
                        "en": "We loaded the wheelbarrows with sand.",
                        "vi": "Chúng tôi chất đầy cát lên xe cút kít."
                    }
                ]
            }
        ]
    }
]