[
    {
        "id": "e4eb54b2b68b409c8b43150c4686ca69",
        "word": "paint",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/peɪnt/",
            "us": "/peɪnt/"
        },
        "nearby": [
            {
                "word": "painstaking",
                "pos": "adjective"
            },
            {
                "word": "painstakingly",
                "pos": "adverb"
            },
            {
                "word": "paint",
                "pos": "noun"
            },
            {
                "word": "paint",
                "pos": "verb"
            },
            {
                "word": "paintball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a liquid that is put on surfaces to give them a particular colour; a layer of this liquid when it has dried on a surface",
                    "vi": "một chất lỏng được đặt trên các bề mặt để tạo cho chúng một màu cụ thể; một lớp chất lỏng này khi nó đã khô trên bề mặt"
                },
                "examples": [
                    {
                        "en": "white paint",
                        "vi": "Sơn trắng"
                    },
                    {
                        "en": "gloss/matt/acrylic paint",
                        "vi": "sơn bóng / mờ / acrylic"
                    },
                    {
                        "en": "The woodwork has recently been given a fresh coat of paint.",
                        "vi": "Đồ gỗ gần đây đã được sơn một lớp sơn mới."
                    },
                    {
                        "en": "Wet paint! (= used as a sign)",
                        "vi": "Sơn ướt! (= dùng làm dấu hiệu)"
                    },
                    {
                        "en": "The paint is starting to peel off.",
                        "vi": "Lớp sơn bắt đầu bong ra."
                    },
                    {
                        "en": "The house is desperately in need of a lick of paint (= a new coat of paint).",
                        "vi": "Nhà đang rất cần sơn lại (= sơn áo mới)."
                    },
                    {
                        "en": "We did a quick paint job on the car (= a new coat of paint to make it look better) and hoped the damage wasn't noticeable.",
                        "vi": "Chúng tôi đã sơn nhanh chiếc xe (= một lớp sơn mới để trông đẹp hơn) và hy vọng hư hỏng không đáng kể."
                    },
                    {
                        "en": "a can/pot/tin of paint",
                        "vi": "một lon / nồi / hộp sơn"
                    }
                ]
            },
            {
                "define": {
                    "en": "tubes or blocks of paint used for painting pictures",
                    "vi": "ống hoặc khối sơn dùng để vẽ tranh"
                },
                "examples": [
                    {
                        "en": "oil paints",
                        "vi": "Sơn dầu"
                    },
                    {
                        "en": "an artist working with acrylic paints",
                        "vi": "một nghệ sĩ làm việc với sơn acrylic"
                    }
                ]
            }
        ]
    },
    {
        "id": "aee82552e4e2496a902b34e52f535782",
        "word": "paint",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/peɪnt/",
            "us": "/peɪnt/"
        },
        "nearby": [
            {
                "word": "painstakingly",
                "pos": "adverb"
            },
            {
                "word": "paint",
                "pos": "noun"
            },
            {
                "word": "paint",
                "pos": "verb"
            },
            {
                "word": "paintball",
                "pos": "noun"
            },
            {
                "word": "paintbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cover a surface or object with paint",
                    "vi": "phủ sơn lên bề mặt hoặc vật thể"
                },
                "examples": [
                    {
                        "en": "paint something with something Paint the shed with weather-resistant paint.",
                        "vi": "sơn một cái gì đó với một cái gì đó Sơn nhà kho bằng sơn chịu được thời tiết."
                    },
                    {
                        "en": "paint something a brightly painted barge",
                        "vi": "sơn cái gì đó một chiếc sà lan được sơn sáng màu"
                    },
                    {
                        "en": "a freshly painted fence",
                        "vi": "hàng rào mới sơn"
                    },
                    {
                        "en": "have something painted We've had the house painted.",
                        "vi": "có một cái gì đó được sơn Chúng tôi đã sơn ngôi nhà."
                    },
                    {
                        "en": "paint something + adj. The walls were painted yellow.",
                        "vi": "sơn cái gì đó + adj. Các bức tường được sơn màu vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a picture or design using paints",
                    "vi": "để tạo một bức tranh hoặc thiết kế bằng sơn"
                },
                "examples": [
                    {
                        "en": "paint something/somebody to paint portraits/pictures",
                        "vi": "vẽ một cái gì đó / ai đó để vẽ chân dung / hình ảnh"
                    },
                    {
                        "en": "A friend painted the children for me (= painted a picture of the children).",
                        "vi": "Một người bạn đã vẽ những đứa trẻ cho tôi (= đã vẽ một bức tranh của những đứa trẻ)."
                    },
                    {
                        "en": "paint something on something Slogans had been painted on the walls.",
                        "vi": "sơn một cái gì đó lên một cái gì đó Khẩu hiệu đã được vẽ trên tường."
                    },
                    {
                        "en": "paint in something She paints in oils.",
                        "vi": "sơn trong một cái gì đó Cô ấy sơn trong các loại dầu."
                    },
                    {
                        "en": "paint something in something a portrait painted in oils",
                        "vi": "vẽ một cái gì đó trong một cái gì đó một bức chân dung được vẽ bằng dầu"
                    },
                    {
                        "en": "My mother paints well.",
                        "vi": "Mẹ tôi vẽ đẹp."
                    },
                    {
                        "en": "He taught himself to draw and paint.",
                        "vi": "Anh tự học vẽ và vẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a particular impression of somebody/something",
                    "vi": "để tạo ấn tượng cụ thể về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "paint somebody/something as something The article paints them as a bunch of petty criminals.",
                        "vi": "sơn ai đó / cái gì đó như một cái gì đó Bài báo vẽ họ như một lũ tội phạm nhỏ."
                    },
                    {
                        "en": "paint somebody/something in… The documentary painted her in a bad light.",
                        "vi": "vẽ ai đó / cái gì đó trong… Bộ phim tài liệu đã vẽ cô ấy trong một ánh sáng tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put coloured make-up on your nails, lips, etc.",
                    "vi": "để trang điểm màu trên móng tay, môi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not as bad as people say he/she/it is",
                    "vi": "không tệ như mọi người nói anh ấy / cô ấy / nó là"
                },
                "examples": [
                    {
                        "en": "He's not very friendly, but he's not as black as he's painted.",
                        "vi": "Anh ấy không thân thiện cho lắm, nhưng anh ấy không đen như vẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe somebody/something in a particular way; to give a particular impression of somebody/something",
                    "vi": "để mô tả ai đó / cái gì đó theo một cách cụ thể; để tạo ấn tượng cụ thể về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The report paints a vivid picture of life in the city.",
                        "vi": "Phóng sự đã vẽ nên một bức tranh sinh động về cuộc sống ở thành phố."
                    },
                    {
                        "en": "Journalists paint a grim picture of conditions in the camps.",
                        "vi": "Các nhà báo vẽ lên một bức tranh khắc nghiệt về điều kiện sống trong các trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a lot of different bars, clubs, etc. and enjoy yourself",
                    "vi": "đi đến nhiều quán bar, câu lạc bộ, v.v. và tận hưởng bản thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to describe something in a general way, ignoring the details",
                    "vi": "để mô tả một cái gì đó một cách chung chung, bỏ qua các chi tiết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4cc70a63127e4a6b86febabafe88379e",
        "word": "picture",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpɪktʃə(r)/",
            "us": "/ˈpɪktʃər/"
        },
        "nearby": [
            {
                "word": "pictorial",
                "pos": "adjective"
            },
            {
                "word": "pictorially",
                "pos": "adverb"
            },
            {
                "word": "picture",
                "pos": "noun"
            },
            {
                "word": "picture",
                "pos": "verb"
            },
            {
                "word": "picture book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a painting or drawing, etc. that shows a scene, a person or thing",
                    "vi": "một bức tranh hoặc bản vẽ, v.v. thể hiện một cảnh, một người hoặc một sự vật"
                },
                "examples": [
                    {
                        "en": "He likes books with lots of pictures in them.",
                        "vi": "Anh ấy thích những cuốn sách có nhiều hình ảnh trong đó."
                    },
                    {
                        "en": "picture of somebody/something A picture of flowers hung on the wall.",
                        "vi": "bức tranh của ai đó / cái gì đó Một bức tranh hoa treo trên tường."
                    },
                    {
                        "en": "The children were drawing pictures of their pets.",
                        "vi": "Những đứa trẻ đang vẽ những bức tranh về vật nuôi của chúng."
                    },
                    {
                        "en": "She wanted a famous artist to paint her picture (= a picture of herself).",
                        "vi": "Cô ấy muốn một nghệ sĩ nổi tiếng vẽ bức tranh của mình (= một bức tranh của chính cô ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a photograph",
                    "vi": "một bức hình"
                },
                "examples": [
                    {
                        "en": "to take a picture",
                        "vi": "chụp một bức ảnh"
                    },
                    {
                        "en": "We had our picture taken in front of the hotel.",
                        "vi": "Chúng tôi đã chụp ảnh trước khách sạn."
                    },
                    {
                        "en": "The picture shows the couple together on their yacht.",
                        "vi": "Hình ảnh cho thấy cặp đôi cùng nhau trên du thuyền của họ."
                    },
                    {
                        "en": "picture of somebody/something She posted a picture of the two of them on her Facebook page.",
                        "vi": "hình ảnh của ai đó / cái gì đó Cô ấy đã đăng một bức ảnh của hai người họ trên trang Facebook của cô ấy."
                    },
                    {
                        "en": "Have you got any pictures of your trip?",
                        "vi": "Bạn đã có hình ảnh nào về chuyến đi của mình chưa?"
                    },
                    {
                        "en": "The star shared the picture on Twitter.",
                        "vi": "Ngôi sao đã chia sẻ bức ảnh trên Twitter."
                    },
                    {
                        "en": "to upload/send/tweet a picture",
                        "vi": "để tải lên / gửi / tweet một bức ảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "an image on a television screen",
                    "vi": "một hình ảnh trên màn hình tivi"
                },
                "examples": [
                    {
                        "en": "harrowing television pictures of the famine",
                        "vi": "hình ảnh truyền hình đáng tiếc về nạn đói"
                    },
                    {
                        "en": "You are looking at live pictures of midtown Manhattan.",
                        "vi": "Bạn đang xem hình ảnh trực tiếp của khu trung tâm Manhattan."
                    },
                    {
                        "en": "poor picture quality",
                        "vi": "chất lượng hình ảnh kém"
                    }
                ]
            },
            {
                "define": {
                    "en": "a description that gives you an idea in your mind of what something is like",
                    "vi": "mô tả cung cấp cho bạn ý tưởng trong tâm trí của bạn về một cái gì đó như thế nào"
                },
                "examples": [
                    {
                        "en": "We've only got scraps of information, not the full picture.",
                        "vi": "Chúng tôi chỉ có thông tin vụn vặt, không phải toàn bộ bức tranh."
                    },
                    {
                        "en": "picture of something The writer paints a gloomy picture of the economy.",
                        "vi": "bức tranh của cái gì Người viết vẽ ra một bức tranh ảm đạm của nền kinh tế."
                    },
                    {
                        "en": "a bleak/grim picture of the future",
                        "vi": "một bức tranh ảm đạm / nghiệt ngã về tương lai"
                    },
                    {
                        "en": "a clear/an accurate/a complete picture of these events",
                        "vi": "một bức tranh rõ ràng / chính xác / đầy đủ về những sự kiện này"
                    },
                    {
                        "en": "The police are trying to build up a picture of what happened.",
                        "vi": "Cảnh sát đang cố gắng dựng lên một bức tranh về những gì đã xảy ra."
                    },
                    {
                        "en": "From news reports a picture emerges of a country in crisis.",
                        "vi": "Từ các báo cáo tin tức, một bức tranh hiện ra về một đất nước đang gặp khủng hoảng."
                    },
                    {
                        "en": "The TV report painted a much rosier picture of the employment situation than research shows to be the case.",
                        "vi": "Phóng sự truyền hình đã vẽ nên một bức tranh về tình hình việc làm tươi sáng hơn nhiều so với các nghiên cứu về trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mental image or memory of something",
                    "vi": "một hình ảnh tinh thần hoặc ký ức về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I have a vivid picture of my grandfather smiling down at me when I was very small.",
                        "vi": "Tôi có một bức tranh sống động về ông của tôi đang mỉm cười với tôi khi tôi còn rất nhỏ."
                    },
                    {
                        "en": "He uses imagery to form mental pictures within the mind of the reader.",
                        "vi": "Anh ấy sử dụng hình ảnh để tạo thành những bức tranh tinh thần trong tâm trí người đọc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general situation relating to somebody/something",
                    "vi": "tình hình chung liên quan đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Just a few years ago the picture was very different.",
                        "vi": "Chỉ vài năm trước đây, bức tranh đã rất khác."
                    },
                    {
                        "en": "The overall picture for farming is encouraging.",
                        "vi": "Bức tranh tổng thể cho nông nghiệp là đáng khích lệ."
                    },
                    {
                        "en": "The documentary was interesting but it didn't give the full picture.",
                        "vi": "Bộ phim tài liệu rất thú vị nhưng nó không đưa ra bức tranh đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film",
                    "vi": "một bộ phim"
                },
                "examples": [
                    {
                        "en": "The movie won nine Academy Awards, including Best Picture.",
                        "vi": "Bộ phim đã giành được chín giải Oscar, bao gồm cả Phim hay nhất."
                    },
                    {
                        "en": "in pictures (especially North American English) I believe her husband's in pictures (= he acts in movies or works in the movie industry).",
                        "vi": "trong tranh (đặc biệt là tiếng Anh Bắc Mỹ) Tôi tin chồng cô ấy trong ảnh (= anh ấy đóng phim hoặc làm việc trong ngành điện ảnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cinema",
                    "vi": "Rạp chiếu phim"
                },
                "examples": [
                    {
                        "en": "Shall we go to the pictures tonight?",
                        "vi": "Tối nay chúng ta đi xem ảnh nhé?"
                    }
                ]
            },
            {
                "define": {
                    "en": "very pretty",
                    "vi": "rất đẹp"
                },
                "examples": [
                    {
                        "en": "She’s as pretty as a picture.",
                        "vi": "Cô ấy xinh như một bức tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very beautiful or special",
                    "vi": "trông rất đẹp hoặc đặc biệt"
                },
                "examples": [
                    {
                        "en": "The garden looks a picture in the summer.",
                        "vi": "Khu vườn trông như một bức tranh vào mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look extremely healthy, guilty, unhappy, etc.",
                    "vi": "để trông cực kỳ khỏe mạnh, mặc cảm, không hạnh phúc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the situation as a whole",
                    "vi": "tình hình nói chung"
                },
                "examples": [
                    {
                        "en": "Right now forget the details and take a look at the big picture.",
                        "vi": "Ngay bây giờ hãy quên các chi tiết và nhìn vào bức tranh lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to understand a situation, especially one that somebody is describing to you",
                    "vi": "để hiểu một tình huống, đặc biệt là một tình huống mà ai đó đang mô tả cho bạn"
                },
                "examples": [
                    {
                        "en": "‘I pretended that I hadn't heard.’ ‘I get the picture.’",
                        "vi": "Tôi giả vờ rằng tôi không nghe thấy. 'Tôi nhận được bức tranh.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "involved/not involved in a situation",
                    "vi": "tham gia / không tham gia vào một tình huống"
                },
                "examples": [
                    {
                        "en": "Morris is likely to win, with Jones out of the picture now.",
                        "vi": "Morris có khả năng giành chiến thắng, với Jones bây giờ đã ra khỏi bức tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe somebody/something in a particular way; to give a particular impression of somebody/something",
                    "vi": "để mô tả ai đó / cái gì đó theo một cách cụ thể; để tạo ấn tượng cụ thể về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The report paints a vivid picture of life in the city.",
                        "vi": "Phóng sự đã vẽ nên một bức tranh sinh động về cuộc sống ở thành phố."
                    },
                    {
                        "en": "Journalists paint a grim picture of conditions in the camps.",
                        "vi": "Các nhà báo vẽ lên một bức tranh khắc nghiệt về điều kiện sống trong các trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the information they need in order to understand a situation",
                    "vi": "cung cấp cho ai đó thông tin họ cần để hiểu một tình huống"
                },
                "examples": [
                    {
                        "en": "Just to put you in the picture—there have been a number of changes here recently.",
                        "vi": "Chỉ để bạn thấy rõ — gần đây đã có một số thay đổi ở đây."
                    }
                ]
            }
        ]
    },
    {
        "id": "06fab542e09740b19edb80577fe219ce",
        "word": "curtain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɜːtn/",
            "us": "/ˈkɜːrtn/"
        },
        "nearby": [
            {
                "word": "curtail",
                "pos": "verb"
            },
            {
                "word": "curtailment",
                "pos": "noun"
            },
            {
                "word": "curtain",
                "pos": "noun"
            },
            {
                "word": "curtain",
                "pos": "verb"
            },
            {
                "word": "curtain call",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of cloth that is hung to cover a window",
                    "vi": "một mảnh vải được treo để che cửa sổ"
                },
                "examples": [
                    {
                        "en": "to draw/pull/close the curtains (= to pull them across the window so they cover it)",
                        "vi": "để kéo / kéo / đóng rèm (= kéo qua cửa sổ để chúng che lại)"
                    },
                    {
                        "en": "She opened her curtains and looked out.",
                        "vi": "Cô mở rèm cửa và nhìn ra ngoài."
                    },
                    {
                        "en": "It was ten in the morning but the curtains were still drawn (= closed).",
                        "vi": "Đã mười giờ sáng nhưng rèm cửa vẫn được kéo ra (= đóng lại)."
                    },
                    {
                        "en": "a pair of curtains",
                        "vi": "một đôi rèm"
                    },
                    {
                        "en": "She looked up and saw a face peering through the curtains.",
                        "vi": "Cô nhìn lên và thấy một khuôn mặt đang nhìn qua rèm cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very thin piece of cloth that you hang at a window and that allows light to enter but stops people outside from being able to see inside",
                    "vi": "một mảnh vải rất mỏng mà bạn treo ở cửa sổ cho phép ánh sáng chiếu vào nhưng ngăn những người bên ngoài không thể nhìn thấy bên trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of cloth that is hung up as a screen in a room or around a bed, for example",
                    "vi": "Ví dụ như một mảnh vải được treo lên như một tấm bình phong trong phòng hoặc xung quanh giường"
                },
                "examples": [
                    {
                        "en": "a shower curtain",
                        "vi": "rèm tắm"
                    },
                    {
                        "en": "He took a bag from a shelf behind some curtains.",
                        "vi": "Anh ta lấy một chiếc túi từ kệ sau rèm cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of thick, heavy cloth that hangs in front of the stage in the theatre",
                    "vi": "một mảnh vải dày và nặng treo trước sân khấu trong rạp hát"
                },
                "examples": [
                    {
                        "en": "The audience was waiting for the curtain to rise (= for the play to begin).",
                        "vi": "Khán giả đang chờ hạ màn (= vở kịch bắt đầu)."
                    },
                    {
                        "en": "The curtain goes up to reveal a grand piano at the back of the stage.",
                        "vi": "Bức màn kéo lên để lộ một cây đàn piano lớn ở phía sau sân khấu."
                    },
                    {
                        "en": "There was tremendous applause when the curtain came down (= the play ended).",
                        "vi": "Có một tràng pháo tay vang dội khi bức màn hạ xuống (= vở kịch kết thúc)."
                    },
                    {
                        "en": "We left just before the final curtain (= the end of a play).",
                        "vi": "Chúng tôi rời đi ngay trước bức màn cuối cùng (= kết thúc một vở kịch)."
                    },
                    {
                        "en": "(figurative) It's time to face the final curtain (= the end; death).",
                        "vi": "(nghĩa bóng) Đã đến lúc phải đối mặt với bức màn cuối cùng (= sự kết thúc; cái chết)."
                    },
                    {
                        "en": "(figurative) The curtain has fallen on her long and distinguished career (= her career has ended).",
                        "vi": "(nghĩa bóng) Bức màn đã phủ xuống sự nghiệp lâu dài và lẫy lừng của cô ấy (= sự nghiệp của cô ấy đã kết thúc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that covers, hides or protects something",
                    "vi": "một thứ bao gồm, che giấu hoặc bảo vệ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a curtain of rain/smoke",
                        "vi": "màn mưa / khói"
                    },
                    {
                        "en": "She pushed back the curtain of brown hair from her eyes.",
                        "vi": "Cô vén rèm tóc nâu ra khỏi mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a situation without hope or that you cannot escape from",
                    "vi": "trở thành một tình huống không có hy vọng hoặc bạn không thể thoát khỏi"
                },
                "examples": [
                    {
                        "en": "When I saw he had a gun, I thought it was curtains for me.",
                        "vi": "Khi tôi nhìn thấy anh ta có một khẩu súng, tôi nghĩ đó là những tấm màn che cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish or mark the end of something",
                    "vi": "để kết thúc hoặc đánh dấu sự kết thúc của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His sudden decision to retire brought down the curtain on a distinguished career.",
                        "vi": "Quyết định giải nghệ đột ngột của anh ấy đã hạ màn cho một sự nghiệp lẫy lừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "60fc68434b464f22bc729e218c7da028",
        "word": "decorate",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdekəreɪt/",
            "us": "/ˈdekəreɪt/"
        },
        "nearby": [
            {
                "word": "decontrol",
                "pos": "verb"
            },
            {
                "word": "decor",
                "pos": "noun"
            },
            {
                "word": "decorate",
                "pos": "verb"
            },
            {
                "word": "Decorated style",
                "pos": ""
            },
            {
                "word": "decorating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something look more attractive by putting things on it",
                    "vi": "để làm cho thứ gì đó trông hấp dẫn hơn bằng cách đặt mọi thứ lên đó"
                },
                "examples": [
                    {
                        "en": "decorate something with something They decorated the room with flowers and balloons.",
                        "vi": "trang trí một cái gì đó với một cái gì đó Họ đã trang trí căn phòng với hoa và bóng bay."
                    },
                    {
                        "en": "decorate something The cake was decorated to look like a car.",
                        "vi": "trang trí một cái gì đó Chiếc bánh đã được trang trí để trông giống như một chiếc xe hơi."
                    },
                    {
                        "en": "The family gets together on Christmas Eve to decorate the tree.",
                        "vi": "Gia đình quây quần bên nhau trong đêm Giáng sinh để trang trí cây thông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put paint, wallpaper, etc. on the walls and ceilings of a room or house",
                    "vi": "sơn, giấy dán tường, v.v. trên tường và trần của một căn phòng hoặc ngôi nhà"
                },
                "examples": [
                    {
                        "en": "I hate decorating.",
                        "vi": "Tôi ghét trang trí."
                    },
                    {
                        "en": "decorate something to decorate a room/a wall/a house/an apartment",
                        "vi": "trang trí một cái gì đó để trang trí một căn phòng / một bức tường / một ngôi nhà / một căn hộ"
                    },
                    {
                        "en": "We need to decorate the sitting room.",
                        "vi": "Chúng ta cần trang trí phòng khách."
                    },
                    {
                        "en": "The sitting room needs decorating.",
                        "vi": "Phòng khách cần trang trí."
                    },
                    {
                        "en": "These villas come fully furnished and decorated.",
                        "vi": "Các biệt thự này được trang bị và trang trí đầy đủ."
                    },
                    {
                        "en": "The bedrooms are tastefully decorated.",
                        "vi": "Các phòng ngủ được trang trí trang nhã."
                    },
                    {
                        "en": "decorate something in something The room is decorated in pale blues and greens.",
                        "vi": "trang trí một cái gì đó trong một cái gì đó Căn phòng được trang trí với màu xanh lam nhạt và xanh lá cây."
                    },
                    {
                        "en": "The dining room is decorated in a modern style.",
                        "vi": "Phòng ăn được trang trí theo phong cách hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be placed on something in order to make it look more attractive",
                    "vi": "được đặt trên một cái gì đó để làm cho nó trông hấp dẫn hơn"
                },
                "examples": [
                    {
                        "en": "Photographs of actors decorated the walls of the restaurant.",
                        "vi": "Hình ảnh các diễn viên trang trí các bức tường của nhà hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody an award or medal as a sign of respect for something they have done",
                    "vi": "trao cho ai đó một giải thưởng hoặc huy chương như một dấu hiệu của sự tôn trọng đối với những gì họ đã làm"
                },
                "examples": [
                    {
                        "en": "be decorated (for something) She was decorated for her efforts during the war.",
                        "vi": "được trang trí (cho một cái gì đó) Cô ấy đã được trang trí cho những nỗ lực của cô ấy trong chiến tranh."
                    },
                    {
                        "en": "decorated war heroes/veterans",
                        "vi": "trang trí anh hùng chiến tranh / cựu chiến binh"
                    }
                ]
            }
        ]
    },
    {
        "id": "c276b49f98cb4922a4fe72bd2320adb1",
        "word": "pattern",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpætn/",
            "us": "/ˈpætərn/"
        },
        "nearby": [
            {
                "word": "patter",
                "pos": "noun"
            },
            {
                "word": "patter",
                "pos": "verb"
            },
            {
                "word": "pattern",
                "pos": "noun"
            },
            {
                "word": "pattern",
                "pos": "verb"
            },
            {
                "word": "patterned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the regular way in which something happens or is done",
                    "vi": "cách thường xuyên mà một cái gì đó xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "changing patterns of urban life",
                        "vi": "thay đổi mô hình cuộc sống đô thị"
                    },
                    {
                        "en": "We have no way of predicting next year's weather patterns.",
                        "vi": "Chúng tôi không có cách nào để dự đoán các kiểu thời tiết của năm tới."
                    },
                    {
                        "en": "behaviour/sleep/growth patterns",
                        "vi": "hành vi / giấc ngủ / mô hình tăng trưởng"
                    },
                    {
                        "en": "stress/intonation/speech patterns",
                        "vi": "trọng âm / ngữ điệu / mẫu giọng nói"
                    },
                    {
                        "en": "Wages in both sectors have followed a similar pattern.",
                        "vi": "Tiền lương trong cả hai lĩnh vực đều diễn ra theo một mô hình tương tự."
                    },
                    {
                        "en": "The studies show different patterns of distribution.",
                        "vi": "Các nghiên cứu cho thấy các mô hình phân phối khác nhau."
                    },
                    {
                        "en": "The music contains repeated rhythmic patterns.",
                        "vi": "Âm nhạc chứa các mẫu nhịp điệu lặp đi lặp lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "an excellent example to copy",
                    "vi": "một ví dụ tuyệt vời để sao chép"
                },
                "examples": [
                    {
                        "en": "This system sets the pattern for others to follow.",
                        "vi": "Hệ thống này đặt ra khuôn mẫu để những người khác làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a regular arrangement of lines, shapes, colours, etc. for example as a design on material, carpets, etc.",
                    "vi": "sự sắp xếp đều đặn của các đường nét, hình dạng, màu sắc, v.v., ví dụ như thiết kế trên chất liệu, thảm, v.v."
                },
                "examples": [
                    {
                        "en": "a pattern of diamonds and squares",
                        "vi": "một mô hình kim cương và hình vuông"
                    },
                    {
                        "en": "a shirt with a floral pattern",
                        "vi": "áo sơ mi họa tiết hoa"
                    },
                    {
                        "en": "complex geometric patterns",
                        "vi": "mô hình hình học phức tạp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a design, set of instructions or shape to cut around that you use in order to make something",
                    "vi": "một thiết kế, tập hợp các hướng dẫn hoặc hình dạng để cắt xung quanh mà bạn sử dụng để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a knitting pattern",
                        "vi": "một mẫu đan"
                    },
                    {
                        "en": "She bought a dress pattern and some material.",
                        "vi": "Cô ấy đã mua một mẫu váy và một số chất liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of material, paper, etc. that helps you choose the design of something",
                    "vi": "một mẩu vật liệu nhỏ, giấy, v.v. giúp bạn chọn thiết kế của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "wallpaper patterns",
                        "vi": "các mẫu giấy dán tường"
                    }
                ]
            }
        ]
    },
    {
        "id": "42ab4022ebdc466a9a64932f5594a974",
        "word": "vase",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/vɑːz/",
            "us": "/veɪs/"
        },
        "nearby": [
            {
                "word": "vascular",
                "pos": "adjective"
            },
            {
                "word": "vas deferens",
                "pos": "noun"
            },
            {
                "word": "vase",
                "pos": "noun"
            },
            {
                "word": "vasectomy",
                "pos": "noun"
            },
            {
                "word": "Vaseline",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container made of glass, etc., used for holding cut flowers or as an attractive object",
                    "vi": "một hộp đựng bằng thủy tinh, v.v., được sử dụng để đựng hoa đã cắt hoặc như một vật hấp dẫn"
                },
                "examples": [
                    {
                        "en": "a vase of flowers",
                        "vi": "một bình hoa"
                    }
                ]
            }
        ]
    },
    {
        "id": "cb14d598bb5e4682817263b11e4783a1",
        "word": "decoration",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌdekəˈreɪʃn/",
            "us": "/ˌdekəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "Decorated style",
                "pos": ""
            },
            {
                "word": "decorating",
                "pos": "noun"
            },
            {
                "word": "decoration",
                "pos": "noun"
            },
            {
                "word": "decorative",
                "pos": "adjective"
            },
            {
                "word": "decorative arts",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that makes something look more attractive on special occasions",
                    "vi": "một thứ làm cho thứ gì đó trông hấp dẫn hơn vào những dịp đặc biệt"
                },
                "examples": [
                    {
                        "en": "Christmas/festive decorations",
                        "vi": "Đồ trang trí lễ hội / giáng sinh"
                    },
                    {
                        "en": "Halloween decorations hung from every corner.",
                        "vi": "Đồ trang trí Halloween treo khắp mọi ngóc ngách."
                    },
                    {
                        "en": "cake/table decorations",
                        "vi": "trang trí bánh / bàn"
                    },
                    {
                        "en": "We made our own decorations.",
                        "vi": "Chúng tôi tự làm đồ trang trí."
                    },
                    {
                        "en": "Floral decorations adorned the church.",
                        "vi": "Trang trí hoa trang trí nhà thờ."
                    },
                    {
                        "en": "The decorations were taken down and put away for another year.",
                        "vi": "Các đồ trang trí đã được gỡ xuống và cất đi trong một năm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a pattern, etc. that is added to something and that stops it from being plain",
                    "vi": "một mẫu, v.v. được thêm vào một thứ gì đó và điều đó khiến nó trở nên đơn giản"
                },
                "examples": [
                    {
                        "en": "the elaborate decoration on the carved wooden door",
                        "vi": "trang trí tinh xảo trên cánh cửa gỗ chạm khắc"
                    },
                    {
                        "en": "Decoration is applied to the plates before the final firing.",
                        "vi": "Trang trí được áp dụng cho các tấm trước khi nung cuối cùng."
                    },
                    {
                        "en": "Ornate decorations embellish the statues.",
                        "vi": "Các đồ trang trí công phu tôn tạo các bức tượng."
                    },
                    {
                        "en": "for decoration Rings are worn both for decoration and also as signs of status.",
                        "vi": "để trang trí Nhẫn được đeo vừa để trang trí vừa là dấu hiệu của địa vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the style in which something is decorated",
                    "vi": "phong cách trang trí thứ gì đó"
                },
                "examples": [
                    {
                        "en": "An Oscar was given for the art direction and set decoration.",
                        "vi": "Một giải Oscar đã được trao cho chỉ đạo nghệ thuật và trang trí bối cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of decorating something such as the inside of a house by painting it, etc.",
                    "vi": "hành động hoặc quá trình trang trí một cái gì đó chẳng hạn như bên trong ngôi nhà bằng cách sơn nó, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an award or medal that is given to somebody as an honour",
                    "vi": "một giải thưởng hoặc huy chương được trao cho ai đó như một vinh dự"
                },
                "examples": [
                    {
                        "en": "His jacket was heavy with military decorations.",
                        "vi": "Áo khoác của anh ta rất nặng với những đồ trang trí của quân đội."
                    },
                    {
                        "en": "decoration for something the country's highest decoration for bravery",
                        "vi": "trang trí cho một cái gì đó trang trí cao nhất của đất nước cho sự dũng cảm"
                    },
                    {
                        "en": "a decoration for valour/gallantry",
                        "vi": "một trang trí cho dũng cảm / dũng cảm"
                    }
                ]
            }
        ]
    },
    {
        "id": "1710c81b9a6c439481811a5099e2d6f8",
        "word": "DIY",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌdiː aɪ ˈwaɪ/",
            "us": "/ˌdiː aɪ ˈwaɪ/"
        },
        "nearby": [
            {
                "word": "Dixieland",
                "pos": "noun"
            },
            {
                "word": "Dixons",
                "pos": ""
            },
            {
                "word": "DIY",
                "pos": "noun"
            },
            {
                "word": "diya",
                "pos": "noun"
            },
            {
                "word": "DIYer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of making, repairing or decorating things in the home yourself, instead of paying somebody to do it (the abbreviation for ‘do-it-yourself’)",
                    "vi": "hoạt động tự làm, sửa chữa hoặc trang trí mọi thứ trong nhà, thay vì trả tiền cho ai đó làm việc đó (chữ viết tắt của 'do-it-yourself')"
                },
                "examples": [
                    {
                        "en": "a DIY store",
                        "vi": "một cửa hàng tự làm"
                    },
                    {
                        "en": "My brother is a real DIY enthusiast.",
                        "vi": "Anh trai tôi là một người đam mê DIY thực sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2fa3e40b82a4fcd9f0caf546205971f",
        "word": "plain",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/pleɪn/",
            "us": "/pleɪn/"
        },
        "nearby": [
            {
                "word": "plaid",
                "pos": "noun"
            },
            {
                "word": "Plaid Cymru",
                "pos": "noun"
            },
            {
                "word": "plain",
                "pos": "adjective"
            },
            {
                "word": "plain",
                "pos": "noun"
            },
            {
                "word": "plain",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not decorated or complicated; simple",
                    "vi": "không trang trí hoặc phức tạp; giản dị"
                },
                "examples": [
                    {
                        "en": "a plain but elegant dress",
                        "vi": "một chiếc váy đơn giản nhưng thanh lịch"
                    },
                    {
                        "en": "plain food",
                        "vi": "thức ăn đạm bạc"
                    },
                    {
                        "en": "The interior of the church was plain and simple.",
                        "vi": "Nội thất của nhà thờ rất đơn sơ và giản dị."
                    },
                    {
                        "en": "plain yogurt (= without sugar or fruit)",
                        "vi": "sữa chua nguyên chất (= không đường hoặc trái cây)"
                    }
                ]
            },
            {
                "define": {
                    "en": "without marks or a pattern on it",
                    "vi": "không có dấu hoặc hoa văn trên đó"
                },
                "examples": [
                    {
                        "en": "covers in plain or printed cotton",
                        "vi": "bìa bằng vải cotton trơn hoặc in"
                    },
                    {
                        "en": "Write on plain paper (= without lines).",
                        "vi": "Viết trên giấy thường (= không có dòng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to see or understand",
                    "vi": "dễ nhìn hoặc dễ hiểu"
                },
                "examples": [
                    {
                        "en": "He made it plain that we should leave.",
                        "vi": "Anh ấy đã nói rõ rằng chúng ta nên rời đi."
                    },
                    {
                        "en": "She made her annoyance plain.",
                        "vi": "Cô ấy làm rõ sự khó chịu của mình."
                    },
                    {
                        "en": "The facts were plain to see.",
                        "vi": "Sự thật rõ ràng để thấy."
                    },
                    {
                        "en": "It was a rip-off, plain and simple.",
                        "vi": "Đó là một bản rip-off, đơn giản và dễ hiểu."
                    },
                    {
                        "en": "plain to somebody It is all very plain to me.",
                        "vi": "rõ ràng với ai đó Tất cả đều rất đơn giản với tôi."
                    },
                    {
                        "en": "it is plain (to somebody) that… It was plain that she wanted to leave.",
                        "vi": "rõ ràng là (với ai đó) rằng… Rõ ràng là cô ấy muốn rời đi."
                    },
                    {
                        "en": "it is plain (to somebody) how, what, etc…. It was plain to everyone just how dangerous the site could be.",
                        "vi": "nó đơn giản (với ai đó) như thế nào, cái gì, v.v.…. Mọi người đều hiểu rõ về mức độ nguy hiểm của trang web."
                    },
                    {
                        "en": "plain from something (that…) What is quite plain from the evidence before me is (that) the figures are false.",
                        "vi": "rõ ràng từ một cái gì đó (cái đó…) Điều khá rõ ràng từ bằng chứng trước tôi là (cái đó) các số liệu là sai."
                    }
                ]
            },
            {
                "define": {
                    "en": "not trying to trick anyone; honest and direct",
                    "vi": "không cố gắng lừa bất cứ ai; trung thực và trực tiếp"
                },
                "examples": [
                    {
                        "en": "The plain fact is that nobody really knows.",
                        "vi": "Sự thật rõ ràng là không ai thực sự biết."
                    },
                    {
                        "en": "a politician with a reputation for plain speaking",
                        "vi": "một chính trị gia nổi tiếng là nói năng đơn giản"
                    },
                    {
                        "en": "(especially North American English) a plain, straightforward sort of man",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) một kiểu người đơn giản, thẳng thắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that something is very ordinary, not special in any way",
                    "vi": "được sử dụng để nhấn mạnh rằng một cái gì đó rất bình thường, không đặc biệt theo bất kỳ cách nào"
                },
                "examples": [
                    {
                        "en": "You don't need any special skills for this job, just plain common sense.",
                        "vi": "Bạn không cần bất kỳ kỹ năng đặc biệt nào cho công việc này, chỉ cần ý thức chung đơn giản."
                    },
                    {
                        "en": "The situation thrives on half-truths and plain ignorance.",
                        "vi": "Tình hình phát triển mạnh dựa trên sự thật nửa vời và sự thiếu hiểu biết rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not beautiful or attractive",
                    "vi": "không đẹp hay hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She looked very plain and dowdy.",
                        "vi": "Cô ấy trông rất giản dị và xuống dốc."
                    },
                    {
                        "en": "a rather plain woman",
                        "vi": "một người phụ nữ khá giản dị"
                    },
                    {
                        "en": "As a child she was rather plain.",
                        "vi": "Khi còn là một đứa trẻ, cô ấy khá đơn giản."
                    }
                ]
            },
            {
                "define": {
                    "en": "describing a simple stitch used in knitting",
                    "vi": "mô tả một mũi khâu đơn giản được sử dụng trong dệt kim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be simple and free from trouble",
                    "vi": "trở nên đơn giản và không gặp rắc rối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "simply and clearly expressed, without using technical language",
                    "vi": "được diễn đạt đơn giản và rõ ràng, không sử dụng ngôn ngữ kỹ thuật"
                },
                "examples": [
                    {
                        "en": "a document written in plain English",
                        "vi": "một tài liệu được viết bằng tiếng Anh đơn giản"
                    },
                    {
                        "en": "If you could put it in plain English I might be able to understand.",
                        "vi": "Nếu bạn có thể viết nó bằng tiếng Anh đơn giản, tôi có thể hiểu được."
                    },
                    {
                        "en": "Teachers should encourage students to write in plain English.",
                        "vi": "Giáo viên nên khuyến khích học sinh viết bằng tiếng Anh đơn giản."
                    }
                ]
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "96b479258e924ff79af7bb8a10b57fb9",
        "word": "built-in",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbɪlt ˈɪn/",
            "us": "/ˌbɪlt ˈɪn/"
        },
        "nearby": [
            {
                "word": "build up to",
                "pos": "phrasal verb"
            },
            {
                "word": "built",
                "pos": "combining form"
            },
            {
                "word": "built-in",
                "pos": "adjective"
            },
            {
                "word": "built-up",
                "pos": "adjective"
            },
            {
                "word": "bulb",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "included as part of something and not separate from it",
                    "vi": "được bao gồm như một phần của cái gì đó và không tách biệt khỏi nó"
                },
                "examples": [
                    {
                        "en": "(British English) Both bedrooms have built-in wardrobes.",
                        "vi": "(Anh Anh) Cả hai phòng ngủ đều có tủ quần áo âm tường."
                    },
                    {
                        "en": "The device has a built-in microphone and speakers.",
                        "vi": "Thiết bị được tích hợp micrô và loa."
                    }
                ]
            },
            {
                "define": {
                    "en": "existing as an essential part of something",
                    "vi": "tồn tại như một phần thiết yếu của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The system has a built-in resistance to change.",
                        "vi": "Hệ thống có khả năng chống thay đổi được tích hợp sẵn."
                    }
                ]
            }
        ]
    },
    {
        "id": "49c01fa28acf4d71bd36fd6000f7e8ca",
        "word": "cushion",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkʊʃn/",
            "us": "/ˈkʊʃn/"
        },
        "nearby": [
            {
                "word": "curvy",
                "pos": "adjective"
            },
            {
                "word": "Lord Curzon",
                "pos": ""
            },
            {
                "word": "cushion",
                "pos": "noun"
            },
            {
                "word": "cushion",
                "pos": "verb"
            },
            {
                "word": "cushioned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cloth bag filled with soft material or feathers that is used, for example, to make a seat more comfortable",
                    "vi": "Ví dụ, một túi vải chứa đầy vật liệu mềm hoặc lông vũ được sử dụng để làm cho một chỗ ngồi thoải mái hơn"
                },
                "examples": [
                    {
                        "en": "matching curtains and cushions",
                        "vi": "phù hợp với rèm cửa và đệm"
                    },
                    {
                        "en": "a floor cushion (= a large cushion that you put on the floor to sit on)",
                        "vi": "đệm sàn (= đệm lớn mà bạn đặt trên sàn để ngồi)"
                    },
                    {
                        "en": "(figurative) a cushion of moss on a rock",
                        "vi": "(nghĩa bóng) một lớp rêu trên đá"
                    },
                    {
                        "en": "I rested my elbow on a cushion.",
                        "vi": "Tôi tựa khuỷu tay lên đệm."
                    },
                    {
                        "en": "She plumped up the sofa cushions before the guests arrived.",
                        "vi": "Cô thu dọn đệm ghế sofa trước khi khách đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer of something between two surfaces that keeps them apart",
                    "vi": "một lớp thứ gì đó giữa hai bề mặt giúp chúng tách rời nhau"
                },
                "examples": [
                    {
                        "en": "A hovercraft rides on a cushion of air.",
                        "vi": "Một thủy phi cơ cưỡi trên đệm khí."
                    },
                    {
                        "en": "Underlay forms a cushion between the carpet and the floor, to minimize wear.",
                        "vi": "Lớp lót tạo thành một lớp đệm giữa thảm và sàn, để giảm thiểu mài mòn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that protects you against something unpleasant that might happen",
                    "vi": "thứ gì đó bảo vệ bạn chống lại điều gì đó khó chịu có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "His savings were a comfortable cushion against financial problems.",
                        "vi": "Khoản tiết kiệm của anh ấy là một tấm đệm thoải mái chống lại các vấn đề tài chính."
                    },
                    {
                        "en": "The team built up a safe cushion of two goals in the first half.",
                        "vi": "Đội khách đã ghi được bàn thắng dẫn trước hai bàn trong hiệp một."
                    }
                ]
            },
            {
                "define": {
                    "en": "the soft inside edge along each side of the table that the balls bounce off",
                    "vi": "mép trong mềm dọc theo mỗi cạnh của bàn mà các quả bóng bật ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "72b0eb3f522b449a927ecfed47dd04fe",
        "word": "decor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdeɪkɔː(r)/",
            "us": "/deɪˈkɔːr/"
        },
        "nearby": [
            {
                "word": "decontrol",
                "pos": "noun"
            },
            {
                "word": "decontrol",
                "pos": "verb"
            },
            {
                "word": "decor",
                "pos": "noun"
            },
            {
                "word": "decorate",
                "pos": "verb"
            },
            {
                "word": "Decorated style",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the style in which the inside of a building is decorated",
                    "vi": "phong cách trang trí bên trong tòa nhà"
                },
                "examples": [
                    {
                        "en": "interior decor",
                        "vi": "trang trí nội thất"
                    },
                    {
                        "en": "the restaurant’s elegant new decor",
                        "vi": "trang trí mới trang nhã của nhà hàng"
                    },
                    {
                        "en": "Choosing the furniture and decor for their new home was an exciting project.",
                        "vi": "Chọn đồ nội thất và trang trí cho ngôi nhà mới của họ là một dự án thú vị."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c0861a7d72e47b1aa361b477ed9ae2b",
        "word": "fixture",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɪkstʃə(r)/",
            "us": "/ˈfɪkstʃər/"
        },
        "nearby": [
            {
                "word": "fixity",
                "pos": "noun"
            },
            {
                "word": "fix on",
                "pos": "phrasal verb"
            },
            {
                "word": "fixture",
                "pos": "noun"
            },
            {
                "word": "fix up",
                "pos": "phrasal verb"
            },
            {
                "word": "fizz",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sports event that has been arranged to take place on a particular date and at a particular place",
                    "vi": "một sự kiện thể thao đã được sắp xếp để diễn ra vào một ngày cụ thể và tại một địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "There are plans to make the race an annual fixture.",
                        "vi": "Có kế hoạch biến cuộc đua trở thành lịch thi đấu hàng năm."
                    },
                    {
                        "en": "Saturday’s fixture against Liverpool",
                        "vi": "Lịch thi đấu hôm thứ Bảy với Liverpool"
                    },
                    {
                        "en": "the season’s fixture list",
                        "vi": "danh sách lịch thi đấu của mùa giải"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing such as a bath or toilet that is fixed in a house and that you do not take with you when you move house",
                    "vi": "một thứ chẳng hạn như bồn tắm hoặc nhà vệ sinh được cố định trong nhà và bạn không mang theo khi chuyển nhà"
                },
                "examples": [
                    {
                        "en": "(British English) The price of the house includes fixtures and fittings.",
                        "vi": "(Tiếng Anh Anh) Giá của ngôi nhà bao gồm đồ đạc và phụ kiện."
                    },
                    {
                        "en": "(figurative) He has stayed with us so long he seems to have become a permanent fixture.",
                        "vi": "(nghĩa bóng) Anh ấy đã ở với chúng tôi quá lâu, anh ấy dường như đã trở thành một vật cố định vĩnh viễn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f96be2f3a28148c4beab283445208651",
        "word": "home improvement",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhəʊm ɪmˈpruːvmənt/",
            "us": "/ˌhəʊm ɪmˈpruːvmənt/"
        },
        "nearby": [
            {
                "word": "the Home Guard",
                "pos": ""
            },
            {
                "word": "home help",
                "pos": "noun"
            },
            {
                "word": "home improvement",
                "pos": "noun"
            },
            {
                "word": "home in on",
                "pos": "phrasal verb"
            },
            {
                "word": "homeland",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "changes that are made to a house that increase its value; the activity of making these changes",
                    "vi": "những thay đổi được thực hiện đối với một ngôi nhà làm tăng giá trị của nó; hoạt động thực hiện những thay đổi này"
                },
                "examples": [
                    {
                        "en": "They've spent a lot of money on home improvements.",
                        "vi": "Họ đã chi rất nhiều tiền để cải tạo nhà."
                    },
                    {
                        "en": "home improvement products",
                        "vi": "sản phẩm cải thiện nhà"
                    }
                ]
            }
        ]
    },
    {
        "id": "040c759db7b647e8b4b207a9ccda3559",
        "word": "interior",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈtɪəriə(r)/",
            "us": "/ɪnˈtɪriər/"
        },
        "nearby": [
            {
                "word": "interim",
                "pos": "noun"
            },
            {
                "word": "interior",
                "pos": "noun"
            },
            {
                "word": "interior",
                "pos": "adjective"
            },
            {
                "word": "interior angle",
                "pos": "noun"
            },
            {
                "word": "interior decoration",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the inside part of something",
                    "vi": "kết nối với phần bên trong của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "interior walls",
                        "vi": "tường nội thất"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the central part of a country or continent that is a long way from the coast",
                    "vi": "kết nối với phần trung tâm của một quốc gia hoặc lục địa cách bờ biển một quãng đường dài"
                },
                "examples": [
                    {
                        "en": "the interior jungle regions",
                        "vi": "các khu vực rừng rậm bên trong"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with a country's own affairs rather than those that involve other countries",
                    "vi": "liên quan đến các vấn đề riêng của một quốc gia hơn là những vấn đề liên quan đến các quốc gia khác"
                },
                "examples": [
                    {
                        "en": "the interior minister",
                        "vi": "bộ trưởng nội vụ"
                    }
                ]
            }
        ]
    },
    {
        "id": "30d4c5e96e234cef96d73f39bb189515",
        "word": "mural",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmjʊərəl/",
            "us": "/ˈmjʊrəl/"
        },
        "nearby": [
            {
                "word": "The Muppet Show",
                "pos": ""
            },
            {
                "word": "mural",
                "pos": "adjective"
            },
            {
                "word": "mural",
                "pos": "noun"
            },
            {
                "word": "Murder, Inc",
                "pos": ""
            },
            {
                "word": "murder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a painting, usually a large one, done on a wall, sometimes on an outside wall of a building",
                    "vi": "một bức tranh, thường là một bức lớn, được thực hiện trên tường, đôi khi trên bức tường bên ngoài của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "murals depicting Aesop’s fables",
                        "vi": "những bức tranh tường mô tả truyện ngụ ngôn của Aesop"
                    }
                ]
            }
        ]
    },
    {
        "id": "ba0017bdab1c4e43b3ef03b56e82b295",
        "word": "patterned",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpætənd/",
            "us": "/ˈpætərnd/"
        },
        "nearby": [
            {
                "word": "pattern",
                "pos": "noun"
            },
            {
                "word": "pattern",
                "pos": "verb"
            },
            {
                "word": "patterned",
                "pos": "adjective"
            },
            {
                "word": "patterning",
                "pos": "noun"
            },
            {
                "word": "pattern on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "decorated with a pattern",
                    "vi": "được trang trí với một mô hình"
                },
                "examples": [
                    {
                        "en": "patterned wallpaper",
                        "vi": "hình nền hoa văn"
                    },
                    {
                        "en": "a highly patterned fabric",
                        "vi": "một loại vải có hoa văn cao"
                    },
                    {
                        "en": "patterned with something cups patterned with yellow flowers",
                        "vi": "có hoa văn với cái cốc có hoa văn màu vàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "bfa1be31b561446c8d5b2c855540d3a3",
        "word": "redecorate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːˈdekəreɪt/",
            "us": "/ˌriːˈdekəreɪt/"
        },
        "nearby": [
            {
                "word": "reddish",
                "pos": "adjective"
            },
            {
                "word": "red dwarf",
                "pos": "noun"
            },
            {
                "word": "redecorate",
                "pos": "verb"
            },
            {
                "word": "redecoration",
                "pos": "noun"
            },
            {
                "word": "redeem",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put new paint and/or paper on the walls of a room or house",
                    "vi": "sơn mới và / hoặc giấy lên tường của một căn phòng hoặc ngôi nhà"
                },
                "examples": [
                    {
                        "en": "We've just redecorated.",
                        "vi": "Chúng tôi vừa được trang trí lại."
                    },
                    {
                        "en": "redecorate something The house has been fully redecorated.",
                        "vi": "trang trí lại một cái gì đó Ngôi nhà đã được trang trí lại hoàn toàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c123b11151a4665b44e697f3371ba44",
        "word": "strip",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/strɪp/",
            "us": "/strɪp/"
        },
        "nearby": [
            {
                "word": "stringy",
                "pos": "adjective"
            },
            {
                "word": "strip",
                "pos": "noun"
            },
            {
                "word": "strip",
                "pos": "verb"
            },
            {
                "word": "the Strip",
                "pos": ""
            },
            {
                "word": "strip cartoon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take off all or most of your clothes or another person’s clothes",
                    "vi": "cởi bỏ tất cả hoặc hầu hết quần áo của bạn hoặc quần áo của người khác"
                },
                "examples": [
                    {
                        "en": "I stripped and washed myself all over.",
                        "vi": "Tôi tự lột quần áo và tắm rửa sạch sẽ."
                    },
                    {
                        "en": "They ordered us to strip and lie down on the grass.",
                        "vi": "Họ ra lệnh cho chúng tôi cởi đồ và nằm xuống bãi cỏ."
                    },
                    {
                        "en": "strip down to something She stripped down to her underwear.",
                        "vi": "lột xuống cái gì đó Cô ấy lột xuống đồ lót của mình."
                    },
                    {
                        "en": "strip (something) off We stripped off and ran down to the water.",
                        "vi": "lột (cái gì đó) ra Chúng tôi cởi bỏ và chạy xuống nước."
                    },
                    {
                        "en": "She stripped off her clothes and got into bed.",
                        "vi": "Cô lột sạch quần áo và lên giường."
                    },
                    {
                        "en": "strip somebody (to something) He stood there stripped to the waist (= he had no clothes on the upper part of his body).",
                        "vi": "lột quần áo ai đó (đến cái gì đó) Anh ta đứng đó lột quần áo đến thắt lưng (= anh ta không có quần áo ở phần trên của cơ thể của mình)."
                    },
                    {
                        "en": "strip somebody + adj. He was stripped naked and left in a cell.",
                        "vi": "tước bỏ ai đó + adj. Anh ta bị lột trần và bị bỏ lại trong phòng giam."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take off your clothes as a form of entertainment; to perform a striptease",
                    "vi": "cởi quần áo như một hình thức giải trí; biểu diễn thoát y"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove a layer from something, especially so that it is completely exposed",
                    "vi": "để loại bỏ một lớp khỏi thứ gì đó, đặc biệt là để nó hoàn toàn lộ ra ngoài"
                },
                "examples": [
                    {
                        "en": "strip something (off) Strip off all the existing paint.",
                        "vi": "dải một cái gì đó (tắt) Dải bỏ tất cả các sơn hiện có."
                    },
                    {
                        "en": "After the guests had gone, I stripped all the beds (= removed all the sheets in order to wash them).",
                        "vi": "Sau khi khách đi hết, tôi lột hết ga giường (= cởi bỏ tất cả ga trải giường để giặt)."
                    },
                    {
                        "en": "strip A off/from B Deer had stripped all the bark off the tree.",
                        "vi": "tước A / khỏi B Hươu đã lột hết vỏ cây."
                    },
                    {
                        "en": "strip B of A Deer had stripped the tree of its bark.",
                        "vi": "dải B của A Deer đã tước vỏ cây của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove all the things from a place and leave it empty",
                    "vi": "để loại bỏ tất cả những thứ khỏi một nơi và để trống"
                },
                "examples": [
                    {
                        "en": "strip something (out) We had to strip out all the old wiring and start again.",
                        "vi": "dải một cái gì đó (ra) Chúng tôi phải loại bỏ tất cả các dây cũ và bắt đầu lại."
                    },
                    {
                        "en": "strip something away First, you need to strip away all the old plaster.",
                        "vi": "tước một thứ gì đó đi Đầu tiên, bạn cần tước bỏ tất cả các lớp thạch cao cũ."
                    },
                    {
                        "en": "(figurative) The movie aims to strip away the lies surrounding Kennedy's life.",
                        "vi": "(nghĩa bóng) Bộ phim nhằm lật tẩy những dối trá xung quanh cuộc đời Kennedy."
                    },
                    {
                        "en": "strip something + adj. Thieves had stripped the house bare.",
                        "vi": "tước cái gì đó + adj. Những tên trộm đã lột trần ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to separate a machine, etc. into parts so that they can be cleaned or repaired",
                    "vi": "tách máy, v.v. thành các bộ phận để chúng có thể được làm sạch hoặc sửa chữa"
                },
                "examples": [
                    {
                        "en": "He strips and cleans his rifle every morning.",
                        "vi": "Anh ta tháo và làm sạch khẩu súng mỗi sáng."
                    },
                    {
                        "en": "They taught us how to strip down a car engine and put it back together again.",
                        "vi": "Họ dạy chúng tôi cách tháo động cơ ô tô và lắp chúng lại với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take away property or honours from somebody, as a punishment",
                    "vi": "lấy đi tài sản hoặc danh dự của ai đó, như một hình phạt"
                },
                "examples": [
                    {
                        "en": "He was disgraced and stripped of his title.",
                        "vi": "Ông bị thất sủng và bị tước bỏ danh hiệu."
                    },
                    {
                        "en": "The president had been completely stripped of power.",
                        "vi": "Tổng thống đã hoàn toàn bị tước bỏ quyền lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b758e888a92417f9a3b943c0981d196",
        "word": "baseboard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbeɪsbɔːd/",
            "us": "/ˈbeɪsbɔːrd/"
        },
        "nearby": [
            {
                "word": "baseball",
                "pos": "noun"
            },
            {
                "word": "baseball cap",
                "pos": "noun"
            },
            {
                "word": "baseboard",
                "pos": "noun"
            },
            {
                "word": "base camp",
                "pos": "noun"
            },
            {
                "word": "based",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of wood that is fixed along the bottom of the walls in a house",
                    "vi": "một mảnh gỗ hẹp được cố định dọc theo đáy tường trong một ngôi nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "157a0178e4e2458fa11aedda5e7ae7e7",
        "word": "chintz",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɪnts/",
            "us": "/tʃɪnts/"
        },
        "nearby": [
            {
                "word": "chinook",
                "pos": "noun"
            },
            {
                "word": "chinos",
                "pos": "noun"
            },
            {
                "word": "chintz",
                "pos": "noun"
            },
            {
                "word": "chintzy",
                "pos": "adjective"
            },
            {
                "word": "chin-up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of shiny cotton cloth with a printed design, especially of flowers, used for making curtains, covering furniture, etc.",
                    "vi": "một loại vải cotton bóng có thiết kế in hoa, đặc biệt là hoa, dùng để làm rèm, che đồ đạc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c39a4bf203446578e4358b3bad909ad",
        "word": "cornice",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːnɪs/",
            "us": "/ˈkɔːrnɪs/"
        },
        "nearby": [
            {
                "word": "cornflower",
                "pos": "noun"
            },
            {
                "word": "cornhusk doll",
                "pos": "noun"
            },
            {
                "word": "cornice",
                "pos": "noun"
            },
            {
                "word": "Corning Ware",
                "pos": "noun"
            },
            {
                "word": "Cornish",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a border around the top of the walls in a room or on the outside walls of a building",
                    "vi": "một đường viền xung quanh đỉnh của các bức tường trong một căn phòng hoặc trên các bức tường bên ngoài của một tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "efc068f909eb45f2a139444b40166b6a",
        "word": "detailing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdiːteɪlɪŋ/",
            "us": "/ˈdiːteɪlɪŋ/"
        },
        "nearby": [
            {
                "word": "detail",
                "pos": "verb"
            },
            {
                "word": "detailed",
                "pos": "adjective"
            },
            {
                "word": "detailing",
                "pos": "noun"
            },
            {
                "word": "detain",
                "pos": "verb"
            },
            {
                "word": "detainee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small details put on a building, piece of clothing, etc., especially for decoration",
                    "vi": "các chi tiết nhỏ trên một tòa nhà, quần áo, v.v., đặc biệt là để trang trí"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7df896b330bd4b69a7f6f819279cd046",
        "word": "drape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dreɪp/",
            "us": "/dreɪp/"
        },
        "nearby": [
            {
                "word": "Drano",
                "pos": "noun"
            },
            {
                "word": "drape",
                "pos": "verb"
            },
            {
                "word": "drape",
                "pos": "noun"
            },
            {
                "word": "draper",
                "pos": "noun"
            },
            {
                "word": "drapery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thick curtain",
                    "vi": "một tấm rèm dài dày"
                },
                "examples": [
                    {
                        "en": "blue velvet drapes",
                        "vi": "màn nhung xanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "c1ddf35eb50749eca017356c799fef8b",
        "word": "fitting",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪtɪŋ/",
            "us": "/ˈfɪtɪŋ/"
        },
        "nearby": [
            {
                "word": "fitter",
                "pos": "noun"
            },
            {
                "word": "fitting",
                "pos": "adjective"
            },
            {
                "word": "fitting",
                "pos": "noun"
            },
            {
                "word": "fitting room",
                "pos": "noun"
            },
            {
                "word": "fit up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small part on a piece of equipment or furniture",
                    "vi": "một phần nhỏ trên một thiết bị hoặc đồ nội thất"
                },
                "examples": [
                    {
                        "en": "light fittings",
                        "vi": "phụ kiện ánh sáng"
                    },
                    {
                        "en": "a pine cupboard with brass fittings",
                        "vi": "tủ thông với phụ kiện bằng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "items in a house such as a cooker, lights or shelves that are usually fixed but that you can take with you when you move to a new house",
                    "vi": "các vật dụng trong nhà như bếp nấu, đèn hoặc kệ thường cố định nhưng bạn có thể mang theo khi chuyển đến nhà mới"
                },
                "examples": [
                    {
                        "en": "The room still has the original fixtures and fittings.",
                        "vi": "Căn phòng vẫn còn nguyên bản và đồ đạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when you try on a piece of clothing that is being made for you to see if it fits",
                    "vi": "một dịp khi bạn thử một bộ quần áo được may cho bạn để xem nó có vừa vặn không"
                },
                "examples": [
                    {
                        "en": "to have a fitting for a wedding dress",
                        "vi": "để có một chiếc váy cưới vừa vặn"
                    }
                ]
            }
        ]
    },
    {
        "id": "1176ebec996b4472b7a9be1c1a0b3c2a",
        "word": "frieze",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/friːz/",
            "us": "/friːz/"
        },
        "nearby": [
            {
                "word": "frier",
                "pos": "noun"
            },
            {
                "word": "Friesian",
                "pos": "noun"
            },
            {
                "word": "frieze",
                "pos": "noun"
            },
            {
                "word": "frigate",
                "pos": "noun"
            },
            {
                "word": "frigate bird",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a border that goes around the top of a room or building with pictures or carvings on it",
                    "vi": "một đường viền bao quanh đầu phòng hoặc tòa nhà với hình ảnh hoặc chạm khắc trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long narrow picture, usually put up in a school, that children have made or that teaches them something",
                    "vi": "một bức tranh dài hẹp, thường được treo trong trường học mà trẻ em đã làm hoặc dạy chúng điều gì đó"
                },
                "examples": [
                    {
                        "en": "The children made a frieze showing traders and their camels crossing the desert.",
                        "vi": "Những đứa trẻ làm một bức phù điêu cho thấy những người buôn bán và những con lạc đà của họ băng qua sa mạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "c534c116a38342c489200c960c580be9",
        "word": "hang",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/hæŋ/",
            "us": "/hæŋ/"
        },
        "nearby": [
            {
                "word": "handy-dandy",
                "pos": "adjective"
            },
            {
                "word": "handyman",
                "pos": "noun"
            },
            {
                "word": "hang",
                "pos": "verb"
            },
            {
                "word": "hang",
                "pos": "noun"
            },
            {
                "word": "hang about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to attach something, or to be attached, at the top so that the lower part is free or loose",
                    "vi": "để gắn một thứ gì đó, hoặc gắn vào, ở trên cùng để phần dưới được tự do hoặc lỏng lẻo"
                },
                "examples": [
                    {
                        "en": "hang something + adv./prep. Hang your coat on the hook.",
                        "vi": "treo cái gì đó + adv./prep. Treo áo khoác của bạn trên móc."
                    },
                    {
                        "en": "Activists hung a banner from the roof of the building.",
                        "vi": "Các nhà hoạt động đã treo một biểu ngữ từ nóc tòa nhà."
                    },
                    {
                        "en": "hang something up Shall I hang your coat up?",
                        "vi": "treo cái gì đó lên Tôi sẽ treo áo khoác của bạn lên?"
                    },
                    {
                        "en": "hang something (out) (British English) Have you hung out the washing?",
                        "vi": "treo cái gì đó (ra ngoài) (tiếng Anh Anh) Bạn đã đi ra ngoài giặt chưa?"
                    },
                    {
                        "en": "(North American English) Have you hung the wash?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn đã treo máy giặt chưa?"
                    },
                    {
                        "en": "hang adv./prep. There were several expensive suits hanging in the wardrobe.",
                        "vi": "hang adv./prep. Có vài bộ đồ đắt tiền treo trong tủ quần áo."
                    },
                    {
                        "en": "Clothes hung from hooks on the walls.",
                        "vi": "Quần áo treo trên móc trên tường."
                    },
                    {
                        "en": "His school bag was still hanging on the back of the door.",
                        "vi": "Chiếc cặp đi học của anh vẫn treo sau cánh cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "when something hangs in a particular way, it falls in that way",
                    "vi": "khi một cái gì đó bị treo theo một cách cụ thể, nó rơi theo cách đó"
                },
                "examples": [
                    {
                        "en": "Her hair hung down to her waist.",
                        "vi": "Tóc cô xõa dài đến thắt lưng."
                    },
                    {
                        "en": "He had lost weight and the suit hung loosely on him.",
                        "vi": "Anh ấy đã giảm cân và bộ đồ lơ lửng trên người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bend or let something bend downwards",
                    "vi": "uốn cong hoặc để một cái gì đó uốn cong xuống dưới"
                },
                "examples": [
                    {
                        "en": "hang adv./prep. The dog's tongue was hanging out.",
                        "vi": "hang adv./prep. Lưỡi con chó thè ra."
                    },
                    {
                        "en": "Children hung (= were leaning) over the gate.",
                        "vi": "Trẻ em bị treo (= đang nghiêng mình) trên cổng."
                    },
                    {
                        "en": "A cigarette hung from her lips.",
                        "vi": "Trên môi cô ấy có một điếu thuốc lá."
                    },
                    {
                        "en": "hang something She hung her head in shame.",
                        "vi": "treo một cái gì đó Cô gục đầu xấu hổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill somebody by tying a rope around their neck and allowing them to drop; to be killed in this way",
                    "vi": "giết ai đó bằng cách buộc một sợi dây quanh cổ họ và thả họ xuống; bị giết theo cách này"
                },
                "examples": [
                    {
                        "en": "He was the last man to be hanged for murder in this country.",
                        "vi": "Anh ta là người đàn ông cuối cùng bị treo cổ vì tội giết người ở đất nước này."
                    },
                    {
                        "en": "She had tried to hang herself.",
                        "vi": "Cô ấy đã cố gắng treo cổ tự tử."
                    },
                    {
                        "en": "At that time you could hang for stealing.",
                        "vi": "Lúc đó bạn có thể bị treo cổ vì tội ăn trộm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time relaxing or enjoying yourself",
                    "vi": "dành thời gian thư giãn hoặc tận hưởng bản thân"
                },
                "examples": [
                    {
                        "en": "‘What are you all doing?’ ‘Just hanging.’",
                        "vi": "Các bạn đang làm gì vậy?' \"Chỉ treo cổ.\""
                    },
                    {
                        "en": "hang with somebody Do you wanna come hang with us?",
                        "vi": "đi chơi với ai đó Bạn có muốn đến chơi với chúng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to attach something, especially a picture, to a hook (= a curved piece of metal) on a wall; to be attached in this way",
                    "vi": "để gắn một thứ gì đó, đặc biệt là một bức tranh, vào một cái móc (= một miếng kim loại cong) trên tường; được đính kèm theo cách này"
                },
                "examples": [
                    {
                        "en": "We hung her portrait above the fireplace.",
                        "vi": "Chúng tôi treo bức chân dung của cô ấy phía trên lò sưởi."
                    },
                    {
                        "en": "Several of his paintings hang in the Tate Gallery.",
                        "vi": "Một số bức tranh của ông được treo trong Phòng trưng bày Tate."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decorate a place by placing paintings, etc. on a wall",
                    "vi": "để trang trí một nơi bằng cách đặt các bức tranh, v.v. trên tường"
                },
                "examples": [
                    {
                        "en": "be hung with something The rooms were hung with tapestries.",
                        "vi": "được treo với một cái gì đó Các phòng được treo bằng những tấm thảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stick wallpaper to a wall",
                    "vi": "dán giấy dán tường vào tường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to attach a door or gate to a post so that it moves freely",
                    "vi": "để gắn cửa hoặc cổng vào cột để nó di chuyển tự do"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stay in the air",
                    "vi": "ở trong không khí"
                },
                "examples": [
                    {
                        "en": "Smoke hung in the air above the city.",
                        "vi": "Khói bay lơ lửng trên không trung thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are not going to worry about something",
                    "vi": "từng nói rằng bạn sẽ không lo lắng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Oh, let's get two and hang the expense!",
                        "vi": "Ồ, chúng ta hãy lấy hai và treo chi phí!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in great danger",
                    "vi": "gặp nguy hiểm lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to delay or be delayed in taking action",
                    "vi": "trì hoãn hoặc trì hoãn hành động"
                },
                "examples": [
                    {
                        "en": "The project had hung fire for several years for lack of funds.",
                        "vi": "Dự án đã bị treo trong vài năm vì thiếu vốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to live in a particular place",
                    "vi": "sống ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "These multimillion-dollar homes are more than just a place to hang your hat.",
                        "vi": "Những ngôi nhà trị giá hàng triệu đô la này không chỉ là một nơi để treo mũ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to depend or rely on something",
                    "vi": "phụ thuộc hoặc dựa vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The research is interesting, but you cannot hang your hat on it.",
                        "vi": "Nghiên cứu này rất thú vị, nhưng bạn không thể coi thường nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very easy to notice in a particular place in a way that is unpleasant",
                    "vi": "rất dễ nhận thấy ở một nơi cụ thể theo cách khó chịu"
                },
                "examples": [
                    {
                        "en": "Smoke lay heavy on the far side of the water.",
                        "vi": "Khói dày đặc ở phía xa của mặt nước."
                    },
                    {
                        "en": "Despair hangs heavy in the stifling air.",
                        "vi": "Sự tuyệt vọng cứ trĩu nặng trong bầu không khí ngột ngạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/something to feel uncomfortable or anxious",
                    "vi": "khiến ai đó / điều gì đó cảm thấy khó chịu hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "The crime lay heavy on her conscience.",
                        "vi": "Tội ác đè nặng lên lương tâm cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remain determined to succeed even when a situation is difficult",
                    "vi": "vẫn quyết tâm thành công ngay cả khi hoàn cảnh khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take a left/right turn",
                    "vi": "rẽ trái / phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remain calm; to not worry",
                    "vi": "giữ bình tĩnh; đừng lo lắng"
                },
                "examples": [
                    {
                        "en": "It's OK—hang loose and stay cool.",
                        "vi": "Không sao đâu — thả lỏng và giữ bình tĩnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold somebody/something very tightly or keep something in a very determined way because you are afraid",
                    "vi": "giữ ai đó / cái gì đó thật chặt hoặc giữ một cái gì đó một cách rất kiên quyết bởi vì bạn sợ"
                },
                "examples": [
                    {
                        "en": "You get a job, then you get a mortgage and then you hang on like grim death to your job to pay off the mortgage.",
                        "vi": "Bạn kiếm được một công việc, sau đó bạn nhận được một khoản thế chấp và sau đó bạn cứ như chết đi sống lại với công việc của mình để trả nợ thế chấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen with great attention to somebody you admire",
                    "vi": "lắng nghe một cách hết sức quan tâm đến người mà bạn ngưỡng mộ"
                },
                "examples": [
                    {
                        "en": "The journalists hung on his every word as he spoke of his ordeal.",
                        "vi": "Các nhà báo chăm chú vào từng lời nói của anh ấy khi anh ấy nói về thử thách của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody in a difficult situation",
                    "vi": "đặt ai đó vào một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She is being hung out to dry for one silly mistake.",
                        "vi": "Cô ấy đang bị phơi khô vì một sai lầm ngớ ngẩn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined and refuse to change your attitude or ideas",
                    "vi": "kiên quyết và từ chối thay đổi thái độ hoặc ý tưởng của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if the future of something/somebody, or the result of something is/hangs in the balance, it is not certain",
                    "vi": "nếu tương lai của một cái gì đó / ai đó, hoặc kết quả của một cái gì đó là / bị treo trong sự cân bằng, nó không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The long-term future of the space programme hangs in the balance.",
                        "vi": "Tương lai dài hạn của chương trình không gian treo trong sự cân bằng."
                    },
                    {
                        "en": "Tom’s life hung in the balance for two weeks as he lay in a coma.",
                        "vi": "Cuộc sống của Tom thăng bằng trong hai tuần khi anh hôn mê."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express your feelings freely",
                    "vi": "thể hiện cảm xúc của bạn một cách tự do"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you are going to be punished for doing something wrong, whether it is a big or small thing, you may as well do the big thing",
                    "vi": "Nếu bạn sẽ bị trừng phạt vì làm điều gì đó sai trái, dù đó là việc lớn hay việc nhỏ, bạn cũng có thể làm được việc lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that gives you an excuse or opportunity to discuss or explain something",
                    "vi": "điều gì đó cho bạn cái cớ hoặc cơ hội để thảo luận hoặc giải thích điều gì đó"
                },
                "examples": [
                    {
                        "en": "The character provides a peg to hang the writer’s political ideas on.",
                        "vi": "Nhân vật cung cấp một chốt để treo các ý tưởng chính trị của nhà văn vào."
                    }
                ]
            }
        ]
    },
    {
        "id": "7de51ab5cab24a9eb3eea8fea2a1e357",
        "word": "hanging",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæŋɪŋ/",
            "us": "/ˈhæŋɪŋ/"
        },
        "nearby": [
            {
                "word": "hang-glider",
                "pos": "noun"
            },
            {
                "word": "hang-gliding",
                "pos": "noun"
            },
            {
                "word": "hanging",
                "pos": "noun"
            },
            {
                "word": "hanging basket",
                "pos": "noun"
            },
            {
                "word": "hanging valley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of killing somebody as a punishment by tying a rope around their neck and allowing them to drop from a high place; an occasion when this happens",
                    "vi": "Thực hành giết ai đó như một hình phạt bằng cách buộc một sợi dây quanh cổ họ và thả họ từ một nơi cao; một dịp khi điều này xảy ra"
                },
                "examples": [
                    {
                        "en": "to sentence somebody to death by hanging",
                        "vi": "kết án tử hình ai đó bằng cách treo cổ"
                    },
                    {
                        "en": "public hangings",
                        "vi": "nơi công cộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large piece of material that is hung on a wall or around a bed for decoration",
                    "vi": "một mảnh vật liệu lớn được treo trên tường hoặc xung quanh giường để trang trí"
                },
                "examples": [
                    {
                        "en": "wall hangings",
                        "vi": "treo tường"
                    }
                ]
            }
        ]
    },
    {
        "id": "aae4041bd28d4a15965de29c72dad682",
        "word": "knick-knack",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnɪk næk/",
            "us": "/ˈnɪk næk/"
        },
        "nearby": [
            {
                "word": "knickerbockers",
                "pos": "noun"
            },
            {
                "word": "knickers",
                "pos": "noun"
            },
            {
                "word": "knick-knack",
                "pos": "noun"
            },
            {
                "word": "knife",
                "pos": "noun"
            },
            {
                "word": "knife",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small object of little worth that is used for decoration in a house",
                    "vi": "một vật nhỏ có giá trị nhỏ được sử dụng để trang trí trong nhà"
                },
                "examples": [
                    {
                        "en": "a collection of knick-knacks",
                        "vi": "một bộ sưu tập các món đồ đan"
                    },
                    {
                        "en": "There were no photographs, no knick-knacks: just a simple table and chairs.",
                        "vi": "Không có bức ảnh, không có đồ dùng đan móc: chỉ là một chiếc bàn và những chiếc ghế đơn giản."
                    }
                ]
            }
        ]
    },
    {
        "id": "2fd8d92f8e1f427ca339192b3c929080",
        "word": "lino",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪnəʊ/",
            "us": "/ˈlaɪnəʊ/"
        },
        "nearby": [
            {
                "word": "the Linnean Society",
                "pos": ""
            },
            {
                "word": "linnet",
                "pos": "noun"
            },
            {
                "word": "lino",
                "pos": "noun"
            },
            {
                "word": "linocut",
                "pos": "noun"
            },
            {
                "word": "linoleum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "linoleum (= a type of strong material with a hard shiny surface, used for covering floors)",
                    "vi": "linoleum (= một loại vật liệu bền với bề mặt cứng sáng bóng, được sử dụng để trải sàn)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ff93ee10e5346e3af1b4bdb9a87cd8d",
        "word": "linoleum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪˈnəʊliəm/",
            "us": "/lɪˈnəʊliəm/"
        },
        "nearby": [
            {
                "word": "lino",
                "pos": "noun"
            },
            {
                "word": "linocut",
                "pos": "noun"
            },
            {
                "word": "linoleum",
                "pos": "noun"
            },
            {
                "word": "Linotype",
                "pos": "noun"
            },
            {
                "word": "linseed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of strong material with a hard shiny surface, used for covering floors",
                    "vi": "một loại vật liệu chắc chắn với bề mặt sáng bóng cứng, được sử dụng để trải sàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d211d8aa4f84dcebf940172da0d6cbb",
        "word": "moulding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈməʊldɪŋ/",
            "us": "/ˈməʊldɪŋ/"
        },
        "nearby": [
            {
                "word": "mould",
                "pos": "verb"
            },
            {
                "word": "moulder",
                "pos": "verb"
            },
            {
                "word": "moulding",
                "pos": "noun"
            },
            {
                "word": "mouldy",
                "pos": "adjective"
            },
            {
                "word": "moult",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of plastic, stone, wood, etc. around the top edge of a wall, on a door, etc., usually for decoration",
                    "vi": "một mảnh nhựa, đá, gỗ, v.v. hẹp xung quanh mép trên cùng của tường, trên cửa, v.v., thường để trang trí"
                },
                "examples": [
                    {
                        "en": "There were elaborate plaster mouldings around the ceiling.",
                        "vi": "Xung quanh trần nhà có những đường gờ thạch cao cầu kỳ."
                    },
                    {
                        "en": "You can fit a strip of hardwood cove moulding into the corner.",
                        "vi": "Bạn có thể lắp một dải đúc cove bằng gỗ cứng vào trong góc."
                    }
                ]
            }
        ]
    },
    {
        "id": "991754dc848f4b859a001e309de2d25d",
        "word": "ornament",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːnəmənt/",
            "us": "/ˈɔːrnəmənt/"
        },
        "nearby": [
            {
                "word": "Orlando",
                "pos": ""
            },
            {
                "word": "ormolu",
                "pos": "noun"
            },
            {
                "word": "ornament",
                "pos": "noun"
            },
            {
                "word": "ornament",
                "pos": "verb"
            },
            {
                "word": "ornamental",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object that is used as decoration in a room, garden, etc. rather than for a particular purpose",
                    "vi": "một đồ vật được sử dụng làm vật trang trí trong phòng, sân vườn, v.v. hơn là cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a glass/silver ornament",
                        "vi": "một vật trang trí bằng thủy tinh / bạc"
                    },
                    {
                        "en": "(British English, North American English) Christmas tree ornaments",
                        "vi": "(Anh Anh, Anh Bắc Mỹ) Đồ trang trí cây thông Noel"
                    },
                    {
                        "en": "There were a few china ornaments on the shelf above the fireplace.",
                        "vi": "Có một vài đồ trang trí bằng sành sứ trên kệ phía trên lò sưởi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is worn as jewellery",
                    "vi": "một đồ vật được đeo như đồ trang sức"
                },
                "examples": [
                    {
                        "en": "Archaeologists have uncovered necklaces, pendants and other personal ornaments from the third century.",
                        "vi": "Các nhà khảo cổ học đã phát hiện ra những chiếc vòng cổ, mặt dây chuyền và đồ trang trí cá nhân khác từ thế kỷ thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of objects, designs, etc. as decoration",
                    "vi": "việc sử dụng các đồ vật, kiểu dáng, v.v. làm vật trang trí"
                },
                "examples": [
                    {
                        "en": "The clock is simply for ornament; it doesn't work any more.",
                        "vi": "Đồng hồ chỉ đơn giản là để trang trí; nó không hoạt động nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing whose good qualities improve something",
                    "vi": "một người hoặc vật có phẩm chất tốt cải thiện điều gì đó"
                },
                "examples": [
                    {
                        "en": "The building is an ornament to the city.",
                        "vi": "Tòa nhà là một vật trang trí cho thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "features that are added when playing individual notes to make them more beautiful or interesting",
                    "vi": "các tính năng được thêm vào khi chơi các nốt riêng lẻ để làm cho chúng đẹp hơn hoặc thú vị hơn"
                },
                "examples": [
                    {
                        "en": "ornaments such as trills and mordents",
                        "vi": "đồ trang trí như trills và mordents"
                    },
                    {
                        "en": "Ornaments are a crucial part of the baroque style.",
                        "vi": "Đồ trang trí là một phần quan trọng của phong cách baroque."
                    }
                ]
            }
        ]
    },
    {
        "id": "bde1428fe163480690829a91714bf543",
        "word": "ornament",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːnəment/",
            "us": "/ˈɔːrnəment/"
        },
        "nearby": [
            {
                "word": "ormolu",
                "pos": "noun"
            },
            {
                "word": "ornament",
                "pos": "noun"
            },
            {
                "word": "ornament",
                "pos": "verb"
            },
            {
                "word": "ornamental",
                "pos": "adjective"
            },
            {
                "word": "ornamentation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to add decoration to something",
                    "vi": "để thêm trang trí cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a room richly ornamented with carving",
                        "vi": "một căn phòng được trang trí lộng lẫy bằng chạm khắc"
                    }
                ]
            }
        ]
    },
    {
        "id": "ea9137d087704ede825c4d49544201db",
        "word": "picture rail",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪktʃə reɪl/",
            "us": "/ˈpɪktʃər reɪl/"
        },
        "nearby": [
            {
                "word": "picture postcard",
                "pos": "noun"
            },
            {
                "word": "picture-postcard",
                "pos": "adjective"
            },
            {
                "word": "picture rail",
                "pos": "noun"
            },
            {
                "word": "picturesque",
                "pos": "adjective"
            },
            {
                "word": "picturesquely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of wood attached to the walls of a room below the ceiling and used for hanging pictures from",
                    "vi": "một mảnh gỗ hẹp gắn vào tường của căn phòng bên dưới trần nhà và được sử dụng để treo những bức tranh từ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56f42d8734474d47a11864933d6c4c3e",
        "word": "redecoration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˌdekəˈreɪʃn/",
            "us": "/ˌriːˌdekəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "red dwarf",
                "pos": "noun"
            },
            {
                "word": "redecorate",
                "pos": "verb"
            },
            {
                "word": "redecoration",
                "pos": "noun"
            },
            {
                "word": "redeem",
                "pos": "verb"
            },
            {
                "word": "redeemable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of putting new paint and/or paper on the walls of a room or house",
                    "vi": "hành động hoặc quy trình sơn mới và / hoặc giấy lên tường của một căn phòng hoặc ngôi nhà"
                },
                "examples": [
                    {
                        "en": "a major programme of restoration and redecoration at the palace",
                        "vi": "một chương trình lớn về trùng tu và trang trí lại cung điện"
                    }
                ]
            }
        ]
    },
    {
        "id": "6ca50d71bde2452d9138a91c0f6ec4a4",
        "word": "shabby chic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃæbi ˈʃiːk/",
            "us": "/ˌʃæbi ˈʃiːk/"
        },
        "nearby": [
            {
                "word": "shabbiness",
                "pos": "noun"
            },
            {
                "word": "shabby",
                "pos": "adjective"
            },
            {
                "word": "shabby chic",
                "pos": "noun"
            },
            {
                "word": "shabby chic",
                "pos": "adjective"
            },
            {
                "word": "shack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the use of pieces of furniture, curtains, etc. that are informal and romantic in style, especially ones that seem old and worn",
                    "vi": "việc sử dụng các món đồ nội thất, rèm cửa, v.v. theo phong cách trang trọng và lãng mạn, đặc biệt là những đồ có vẻ cũ và sờn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dee99a712a184f699858cbbd55b0dc0f",
        "word": "shabby chic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃæbi ˈʃiːk/",
            "us": "/ˌʃæbi ˈʃiːk/"
        },
        "nearby": [
            {
                "word": "shabby",
                "pos": "adjective"
            },
            {
                "word": "shabby chic",
                "pos": "noun"
            },
            {
                "word": "shabby chic",
                "pos": "adjective"
            },
            {
                "word": "shack",
                "pos": "noun"
            },
            {
                "word": "shack",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using pieces of furniture, curtains, etc. that are informal and romantic in style, especially ones that seem old or worn; (of furniture, curtains, etc.) informal and romantic in style, and usually seeming old or worn",
                    "vi": "sử dụng những món đồ nội thất, rèm cửa, v.v. theo phong cách trang trọng và lãng mạn, đặc biệt là những đồ có vẻ cũ hoặc sờn; (đồ nội thất, rèm cửa, v.v.) theo phong cách trang trọng và lãng mạn, và thường có vẻ cũ hoặc sờn"
                },
                "examples": [
                    {
                        "en": "The rooms in the hotel are all shabby chic with beautiful old furniture and decor.",
                        "vi": "Các phòng trong khách sạn đều sang trọng tồi tàn với đồ nội thất và lối trang trí cũ đẹp mắt."
                    },
                    {
                        "en": "That shabby chic chair will look fantastic with my new floral wallpaper.",
                        "vi": "Chiếc ghế sang trọng tồi tàn đó sẽ trông thật tuyệt với hình nền hoa mới của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3250acd1c87546f28871a16e84aea9d8",
        "word": "wallpaper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːlpeɪpə(r)/",
            "us": "/ˈwɔːlpeɪpər/"
        },
        "nearby": [
            {
                "word": "wallow",
                "pos": "noun"
            },
            {
                "word": "wall painting",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "verb"
            },
            {
                "word": "wall plug",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thick paper, often with a pattern on it, used for covering the walls and ceiling of a room",
                    "vi": "giấy dày, thường có hoa văn trên đó, được sử dụng để phủ các bức tường và trần của một căn phòng"
                },
                "examples": [
                    {
                        "en": "wallpaper paste",
                        "vi": "dán giấy dán tường"
                    },
                    {
                        "en": "a roll of wallpaper",
                        "vi": "một cuộn giấy dán tường"
                    },
                    {
                        "en": "to hang wallpaper",
                        "vi": "treo giấy dán tường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the background pattern or picture that you choose to have on the screen of your computer, mobile phone, etc.",
                    "vi": "hình nền hoặc hình ảnh mà bạn chọn để có trên màn hình máy tính, điện thoại di động, v.v."
                },
                "examples": [
                    {
                        "en": "You can download desktop wallpaper.",
                        "vi": "Bạn có thể tải hình nền máy tính để bàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab3c1b4349104af698883df8a936d1a0",
        "word": "wallpaper",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːlpeɪpə(r)/",
            "us": "/ˈwɔːlpeɪpər/"
        },
        "nearby": [
            {
                "word": "wall painting",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "verb"
            },
            {
                "word": "wall plug",
                "pos": "noun"
            },
            {
                "word": "Wall's",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put wallpaper onto the walls of a room",
                    "vi": "dán giấy dán tường lên tường phòng"
                },
                "examples": []
            }
        ]
    }
]