[
    {
        "id": "cf9f62ecd1234af5a7cce7488922337a",
        "word": "be expecting (a baby/child)",
        "pos": "idiom",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪkˈspekt/",
            "us": "/ɪkˈspekt/"
        },
        "nearby": [
            {
                "word": "expatriate",
                "pos": "noun"
            },
            {
                "word": "expatriate",
                "pos": "adjective"
            },
            {
                "word": "expect",
                "pos": "verb"
            },
            {
                "word": "expectancy",
                "pos": "noun"
            },
            {
                "word": "expectant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to think or believe that something will happen or that somebody will do something",
                    "vi": "nghĩ hoặc tin rằng điều gì đó sẽ xảy ra hoặc ai đó sẽ làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "expect something The company is expecting record sales this year.",
                        "vi": "mong đợi điều gì đó Công ty đang mong đợi doanh thu kỷ lục trong năm nay."
                    },
                    {
                        "en": "Change often happens when you least expect it.",
                        "vi": "Thay đổi thường xảy ra khi bạn ít mong đợi nhất."
                    },
                    {
                        "en": "expect something from somebody/something Don't expect sympathy from me!",
                        "vi": "Mong đợi điều gì đó từ ai đó / điều gì đó Đừng mong đợi sự thông cảm từ tôi!"
                    },
                    {
                        "en": "expect something of somebody/something That's not the sort of behaviour I expect of you!",
                        "vi": "mong đợi điều gì đó của ai đó / điều gì đó Đó không phải là kiểu cư xử mà tôi mong đợi ở bạn!"
                    },
                    {
                        "en": "expect to do something They never expected to find their dream home.",
                        "vi": "mong đợi để làm điều gì đó Họ không bao giờ mong đợi để tìm thấy ngôi nhà mơ ước của họ."
                    },
                    {
                        "en": "I looked back, half expecting to see someone following me.",
                        "vi": "Tôi nhìn lại, nửa mong đợi sẽ thấy ai đó đang theo dõi mình."
                    },
                    {
                        "en": "expect somebody/something to do something Analysts expect the company to announce growth of at least 5 per cent.",
                        "vi": "mong đợi ai đó / điều gì đó làm điều gì đó Các nhà phân tích kỳ vọng công ty sẽ công bố mức tăng trưởng ít nhất 5%."
                    },
                    {
                        "en": "I fully expected her to refuse my offer.",
                        "vi": "Tôi hoàn toàn mong đợi cô ấy từ chối lời đề nghị của tôi."
                    },
                    {
                        "en": "House prices are expected to rise sharply.",
                        "vi": "Giá nhà dự kiến sẽ tăng mạnh."
                    },
                    {
                        "en": "Do you really expect me to believe you?",
                        "vi": "Bạn có thực sự mong đợi tôi tin bạn?"
                    },
                    {
                        "en": "expect (that)… Many people were expecting (that) the peace talks would break down.",
                        "vi": "mong đợi (điều đó)… Nhiều người đã mong đợi (rằng) cuộc đàm phán hòa bình sẽ đổ vỡ."
                    },
                    {
                        "en": "it is expected that… It is widely expected that interest rates will rise.",
                        "vi": "dự kiến rằng… Nhiều người cho rằng lãi suất sẽ tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be waiting for somebody/something to arrive, as this has been arranged",
                    "vi": "chờ ai đó / cái gì đó đến, vì điều này đã được sắp xếp"
                },
                "examples": [
                    {
                        "en": "expect somebody/something to expect a visit/call/letter from somebody",
                        "vi": "mong đợi ai đó / điều gì đó mong đợi một chuyến thăm / cuộc gọi / thư từ ai đó"
                    },
                    {
                        "en": "We were expecting him yesterday.",
                        "vi": "Chúng tôi đã mong đợi anh ấy ngày hôm qua."
                    },
                    {
                        "en": "They are not expected until tomorrow.",
                        "vi": "Họ không được mong đợi cho đến ngày mai."
                    },
                    {
                        "en": "Are you expecting visitors?",
                        "vi": "Bạn đang mong đợi khách truy cập?"
                    },
                    {
                        "en": "I'm expecting an important call.",
                        "vi": "Tôi đang chờ một cuộc gọi quan trọng."
                    },
                    {
                        "en": "expect somebody to do something We were expecting him to arrive yesterday.",
                        "vi": "mong ai đó làm điều gì đó. Chúng tôi đã mong đợi anh ấy đến ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to demand that somebody will do something because it is their duty or responsibility",
                    "vi": "yêu cầu ai đó sẽ làm điều gì đó vì đó là nghĩa vụ hoặc trách nhiệm của họ"
                },
                "examples": [
                    {
                        "en": "expect something It is reasonable to expect changes in the way we work.",
                        "vi": "mong đợi điều gì đó Thật hợp lý khi mong đợi những thay đổi trong cách chúng ta làm việc."
                    },
                    {
                        "en": "No one has a right to expect good results without working hard.",
                        "vi": "Không ai có quyền mong đợi kết quả tốt nếu không làm việc chăm chỉ."
                    },
                    {
                        "en": "These are the high standards that hotel guests have come to expect.",
                        "vi": "Đây là những tiêu chuẩn cao mà khách hàng mong đợi."
                    },
                    {
                        "en": "expect something from somebody He's still getting over his illness, so it's unrealistic to expect too much from him.",
                        "vi": "mong đợi điều gì đó từ ai đó Anh ấy vẫn đang vượt qua căn bệnh của mình, vì vậy việc trông đợi quá nhiều ở anh ấy là không thực tế."
                    },
                    {
                        "en": "expect something of somebody Are you clear what is expected of you?",
                        "vi": "mong đợi điều gì đó ở ai đó Bạn có rõ điều gì được mong đợi ở bạn không?"
                    },
                    {
                        "en": "expect somebody to do something You can't reasonably expect people to pay such high taxes.",
                        "vi": "mong đợi ai đó làm điều gì đó Bạn không thể mong đợi một cách hợp lý mọi người phải trả thuế cao như vậy."
                    },
                    {
                        "en": "We are expected to work on Saturdays.",
                        "vi": "Chúng tôi dự kiến sẽ làm việc vào các ngày thứ Bảy."
                    },
                    {
                        "en": "It would be unreasonable to expect them to do all that work for free.",
                        "vi": "Sẽ là không hợp lý nếu mong đợi họ làm tất cả những công việc đó miễn phí."
                    },
                    {
                        "en": "expect to do something I expect to be paid promptly for the work.",
                        "vi": "mong đợi để làm một cái gì đó mà tôi mong đợi để được trả công kịp thời cho công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you think something is probably true",
                    "vi": "được sử dụng khi bạn nghĩ điều gì đó có thể đúng"
                },
                "examples": [
                    {
                        "en": "‘Will you be late?’ ‘I expect so.’",
                        "vi": "Bạn sẽ đến muộn chứ?' 'Tôi mong đợi như vậy.'"
                    },
                    {
                        "en": "‘Are you going out tonight?’ ‘I don't expect so.’",
                        "vi": "Bạn có đi chơi tối nay không?' 'Tôi không mong đợi như vậy.'"
                    },
                    {
                        "en": "expect (that…) ‘Who’s eaten all the cake?’ ‘Tom, I expect/I expect it was Tom.’",
                        "vi": "mong đợi (rằng…) 'Ai đã ăn hết cái bánh?' 'Tom, tôi mong đợi / Tôi mong đợi đó là Tom.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be pregnant",
                    "vi": "có thai"
                },
                "examples": [
                    {
                        "en": "Ann's expecting a baby in June.",
                        "vi": "Ann đang mong chờ một em bé vào tháng Sáu."
                    },
                    {
                        "en": "I didn't know she was expecting!",
                        "vi": "Tôi không biết cô ấy đang mong đợi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be likely to happen; to be quite normal",
                    "vi": "có khả năng xảy ra; khá bình thường"
                },
                "examples": [
                    {
                        "en": "A little tiredness after taking these drugs is to be expected.",
                        "vi": "Dự kiến sẽ có một chút mệt mỏi sau khi dùng các loại thuốc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to be surprised by something",
                    "vi": "được sử dụng để nói với ai đó đừng ngạc nhiên bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "She swore at you? What do you expect when you treat her like that?",
                        "vi": "Cô ấy đã chửi thề với bạn? Bạn mong đợi điều gì khi đối xử với cô ấy như vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "0c6069f05c5c4a17afe4063f11c27954",
        "word": "pregnant",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpreɡnənt/",
            "us": "/ˈpreɡnənt/"
        },
        "nearby": [
            {
                "word": "preggers",
                "pos": "adjective"
            },
            {
                "word": "pregnancy",
                "pos": "noun"
            },
            {
                "word": "pregnant",
                "pos": "adjective"
            },
            {
                "word": "preheat",
                "pos": "verb"
            },
            {
                "word": "prehensile",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a baby or young animal developing inside her/its body",
                    "vi": "có một em bé hoặc động vật non đang phát triển bên trong cơ thể cô ấy / nó"
                },
                "examples": [
                    {
                        "en": "My wife is pregnant.",
                        "vi": "Vợ tôi đang mang thai."
                    },
                    {
                        "en": "pregnant with… I was pregnant with our third child at the time.",
                        "vi": "mang thai với… Tôi đang mang thai đứa con thứ ba của chúng tôi vào thời điểm đó."
                    },
                    {
                        "en": "a heavily pregnant woman (= one whose baby is nearly ready to be born)",
                        "vi": "một phụ nữ mang thai nặng (= một người có con gần như sắp chào đời)"
                    },
                    {
                        "en": "to get/become/fall pregnant",
                        "vi": "mang thai / mang thai"
                    },
                    {
                        "en": "He got his girlfriend pregnant and they're getting married.",
                        "vi": "Anh ta làm cho bạn gái của mình có thai và họ sắp kết hôn."
                    },
                    {
                        "en": "She's six months pregnant.",
                        "vi": "Cô ấy đang mang thai sáu tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of a quality or feeling",
                    "vi": "đầy chất lượng hoặc cảm giác"
                },
                "examples": [
                    {
                        "en": "Her silences were pregnant with criticism.",
                        "vi": "Sự im lặng của cô đang mang trong mình những lời chỉ trích."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when nobody speaks, although people are aware that there are feelings or thoughts to express",
                    "vi": "một dịp mà không ai nói, mặc dù mọi người biết rằng có những cảm xúc hoặc suy nghĩ muốn bày tỏ"
                },
                "examples": [
                    {
                        "en": "There was a pregnant pause before she replied.",
                        "vi": "Có một khoảng dừng mang thai trước khi cô ấy trả lời."
                    }
                ]
            }
        ]
    },
    {
        "id": "ad344792eefd421388e6b151d18ad3d3",
        "word": "scan",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/skæn/",
            "us": "/skæn/"
        },
        "nearby": [
            {
                "word": "scampi",
                "pos": "noun"
            },
            {
                "word": "scan",
                "pos": "verb"
            },
            {
                "word": "scan",
                "pos": "noun"
            },
            {
                "word": "scandal",
                "pos": "noun"
            },
            {
                "word": "scandalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a medical test in which a machine produces a picture of the inside of a person’s body, or a baby inside its mother's body, on a computer screen",
                    "vi": "một bài kiểm tra y tế trong đó máy tạo ra hình ảnh bên trong cơ thể một người hoặc một em bé bên trong cơ thể mẹ của nó trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "to have a brain scan",
                        "vi": "để được quét não"
                    },
                    {
                        "en": "At twenty weeks she had a scan and the midwife told her the baby looked fine.",
                        "vi": "Khi được hai mươi tuần, cô ấy đã được chụp cắt lớp và nữ hộ sinh nói với cô ấy rằng em bé trông vẫn ổn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of looking quickly through something written or printed, usually in order to find something",
                    "vi": "hành động nhìn nhanh qua một thứ gì đó được viết hoặc in ra, thường là để tìm thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a scan of the newspapers",
                        "vi": "quét các tờ báo"
                    },
                    {
                        "en": "I had a quick scan down the guest list but couldn’t see my name.",
                        "vi": "Tôi đã quét nhanh danh sách khách nhưng không thấy tên của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac4a0aefec194ca793c3b1079dbaa61f",
        "word": "abortion",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈbɔːʃn/",
            "us": "/əˈbɔːrʃn/"
        },
        "nearby": [
            {
                "word": "aborigine",
                "pos": "noun"
            },
            {
                "word": "abort",
                "pos": "verb"
            },
            {
                "word": "abortion",
                "pos": "noun"
            },
            {
                "word": "abortionist",
                "pos": "noun"
            },
            {
                "word": "abortive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the deliberate ending of a pregnancy at an early stage",
                    "vi": "cố ý kết thúc thai kỳ ở giai đoạn đầu"
                },
                "examples": [
                    {
                        "en": "to support/oppose abortion",
                        "vi": "ủng hộ / phản đối phá thai"
                    },
                    {
                        "en": "a woman’s right to abortion",
                        "vi": "quyền phá thai của phụ nữ"
                    },
                    {
                        "en": "the country's strict abortion laws",
                        "vi": "luật phá thai nghiêm ngặt của đất nước"
                    },
                    {
                        "en": "I've always been anti-abortion.",
                        "vi": "Tôi luôn chống phá thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a medical operation to end a pregnancy at an early stage",
                    "vi": "phẫu thuật y tế để chấm dứt thai kỳ ở giai đoạn đầu"
                },
                "examples": [
                    {
                        "en": "She decided to have an abortion.",
                        "vi": "Cô quyết định phá thai."
                    },
                    {
                        "en": "Some medical staff wanted the right to refuse to perform abortions.",
                        "vi": "Một số nhân viên y tế muốn có quyền từ chối thực hiện phá thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of giving birth to a baby before it is fully developed and able to survive",
                    "vi": "quá trình sinh ra một đứa trẻ trước khi nó được phát triển đầy đủ và có thể tồn tại"
                },
                "examples": [
                    {
                        "en": "Higher amounts of caffeine may be associated with increased rates of abortion and low birthweight.",
                        "vi": "Lượng caffeine cao hơn có thể làm tăng tỷ lệ phá thai và sinh con nhẹ cân."
                    }
                ]
            }
        ]
    },
    {
        "id": "c1cf1015996c484eb818cecd155a286c",
        "word": "conceive",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈsiːv/",
            "us": "/kənˈsiːv/"
        },
        "nearby": [
            {
                "word": "conceivable",
                "pos": "adjective"
            },
            {
                "word": "conceivably",
                "pos": "adverb"
            },
            {
                "word": "conceive",
                "pos": "verb"
            },
            {
                "word": "concentrate",
                "pos": "verb"
            },
            {
                "word": "concentrate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to form an idea, a plan, etc. in your mind",
                    "vi": "để hình thành một ý tưởng, một kế hoạch, v.v. trong tâm trí của bạn"
                },
                "examples": [
                    {
                        "en": "He conceived the idea of transforming the old power station into an arts centre.",
                        "vi": "Anh nảy sinh ý tưởng biến trạm điện cũ thành trung tâm nghệ thuật."
                    },
                    {
                        "en": "The dam project was originally conceived in 1977.",
                        "vi": "Dự án đập ban đầu được hình thành vào năm 1977."
                    }
                ]
            },
            {
                "define": {
                    "en": "to imagine something",
                    "vi": "để tưởng tượng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "conceive of somebody/something (as something) God is often conceived of as male.",
                        "vi": "quan niệm về ai đó / cái gì đó (như một cái gì đó) Thượng đế thường được quan niệm là nam giới."
                    },
                    {
                        "en": "conceive (that)… I cannot conceive (= I do not believe) (that) he would wish to harm us.",
                        "vi": "thụ thai (điều đó)… Tôi không thể thụ thai (= Tôi không tin) (điều đó) anh ta sẽ muốn làm hại chúng tôi."
                    },
                    {
                        "en": "conceive what/how, etc… I cannot conceive what it must be like.",
                        "vi": "khái niệm cái gì / như thế nào, vv… Tôi không thể hình dung nó phải như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a woman conceives or conceives a child, she becomes pregnant",
                    "vi": "Khi một người phụ nữ thụ thai hoặc thụ thai một đứa trẻ, thì cô ấy có thai"
                },
                "examples": [
                    {
                        "en": "She is unable to conceive.",
                        "vi": "Cô ấy không thể thụ thai."
                    },
                    {
                        "en": "conceive somebody Their first child was conceived on their wedding night.",
                        "vi": "thụ thai ai đó Đứa con đầu tiên của họ đã được thụ thai vào đêm tân hôn của họ."
                    },
                    {
                        "en": "She was unable to conceive a child naturally and was offered fertility treatment.",
                        "vi": "Cô không thể mang thai một cách tự nhiên và đã được điều trị hiếm muộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "03ddfc8e262f450aa09a0347b9803340",
        "word": "conception",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈsepʃn/",
            "us": "/kənˈsepʃn/"
        },
        "nearby": [
            {
                "word": "concept",
                "pos": "noun"
            },
            {
                "word": "concept album",
                "pos": "noun"
            },
            {
                "word": "conception",
                "pos": "noun"
            },
            {
                "word": "conceptual",
                "pos": "adjective"
            },
            {
                "word": "conceptual art",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an understanding or a belief of what something/somebody is or what something/somebody should be",
                    "vi": "sự hiểu biết hoặc niềm tin về cái gì đó / ai đó là gì hoặc cái gì đó / ai đó nên là gì"
                },
                "examples": [
                    {
                        "en": "conception of something Marx’s conception of social justice",
                        "vi": "quan niệm về điều gì đó Quan niệm của Mác về công bằng xã hội"
                    },
                    {
                        "en": "He has no conception of how difficult life is if you're unemployed.",
                        "vi": "Anh ấy không quan niệm cuộc sống sẽ khó khăn như thế nào nếu bạn thất nghiệp."
                    },
                    {
                        "en": "conception that… I had to reassess my conception that she was basically an honest person.",
                        "vi": "quan niệm rằng… Tôi phải đánh giá lại quan niệm của mình rằng cô ấy về cơ bản là một người trung thực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of forming an idea or a plan",
                    "vi": "quá trình hình thành một ý tưởng hoặc một kế hoạch"
                },
                "examples": [
                    {
                        "en": "The plan was brilliant in its conception but failed because of lack of money.",
                        "vi": "Kế hoạch tuyệt vời trong thời kỳ tưởng tượng của nó nhưng không thành công vì thiếu tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of an egg being fertilized inside a woman’s body so that she becomes pregnant",
                    "vi": "Quá trình trứng được thụ tinh bên trong cơ thể phụ nữ để mang thai"
                },
                "examples": [
                    {
                        "en": "the moment of conception",
                        "vi": "thời điểm thụ thai"
                    },
                    {
                        "en": "A child is born about 40 weeks after conception takes place.",
                        "vi": "Một đứa trẻ được sinh ra khoảng 40 tuần sau khi quá trình thụ thai diễn ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "a2b33609f5664fcfb781ffe70e50f554",
        "word": "maternity leave",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈtɜːnəti liːv/",
            "us": "/məˈtɜːrnəti liːv/"
        },
        "nearby": [
            {
                "word": "maternally",
                "pos": "adverb"
            },
            {
                "word": "maternity",
                "pos": "noun"
            },
            {
                "word": "maternity leave",
                "pos": "noun"
            },
            {
                "word": "mateship",
                "pos": "noun"
            },
            {
                "word": "matey",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time when a woman is allowed to be away from work before and after having a baby",
                    "vi": "Khoảng thời gian phụ nữ được phép nghỉ làm trước và sau khi sinh con"
                },
                "examples": [
                    {
                        "en": "on maternity leave Ellie is currently on maternity leave.",
                        "vi": "trong thời gian nghỉ sinh Ellie hiện đang trong thời gian nghỉ sinh."
                    }
                ]
            }
        ]
    },
    {
        "id": "5407145fd82143efad28a5a1e1808099",
        "word": "pregnancy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpreɡnənsi/",
            "us": "/ˈpreɡnənsi/"
        },
        "nearby": [
            {
                "word": "prefix",
                "pos": "verb"
            },
            {
                "word": "preggers",
                "pos": "adjective"
            },
            {
                "word": "pregnancy",
                "pos": "noun"
            },
            {
                "word": "pregnant",
                "pos": "adjective"
            },
            {
                "word": "preheat",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being pregnant",
                    "vi": "tình trạng mang thai"
                },
                "examples": [
                    {
                        "en": "a pregnancy test",
                        "vi": "thử thai"
                    },
                    {
                        "en": "during pregnancy Many women experience sickness during pregnancy.",
                        "vi": "Khi mang thai Nhiều phụ nữ bị ốm khi mang thai."
                    },
                    {
                        "en": "unplanned/unwanted pregnancies",
                        "vi": "mang thai ngoài ý muốn / ngoài ý muốn"
                    },
                    {
                        "en": "the increase in teenage pregnancies",
                        "vi": "sự gia tăng các trường hợp mang thai ở tuổi vị thành niên"
                    }
                ]
            }
        ]
    },
    {
        "id": "dab060bfa62e4d43ac8b56865aa05e9a",
        "word": "terminate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɜːmɪneɪt/",
            "us": "/ˈtɜːrmɪneɪt/"
        },
        "nearby": [
            {
                "word": "terminally",
                "pos": "adverb"
            },
            {
                "word": "terminal velocity",
                "pos": "noun"
            },
            {
                "word": "terminate",
                "pos": "verb"
            },
            {
                "word": "termination",
                "pos": "noun"
            },
            {
                "word": "terminological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to end; to make something end",
                    "vi": "kết thúc; để làm cho một cái gì đó kết thúc"
                },
                "examples": [
                    {
                        "en": "Your contract of employment terminates in December.",
                        "vi": "Hợp đồng lao động của bạn sẽ chấm dứt vào tháng 12."
                    },
                    {
                        "en": "terminate something The agreement was terminated immediately.",
                        "vi": "chấm dứt điều gì đó Thỏa thuận đã được chấm dứt ngay lập tức."
                    },
                    {
                        "en": "to terminate a pregnancy (= to perform or have an abortion)",
                        "vi": "để chấm dứt thai kỳ (= thực hiện hoặc phá thai)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a journey",
                    "vi": "kết thúc một cuộc hành trình"
                },
                "examples": [
                    {
                        "en": "This train terminates at London Victoria.",
                        "vi": "Chuyến tàu này kết thúc tại London Victoria."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c5a2f410b2d4be594e40fe0c44c8832",
        "word": "unborn",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌʌnˈbɔːn/",
            "us": "/ˌʌnˈbɔːrn/"
        },
        "nearby": [
            {
                "word": "unblinkingly",
                "pos": "adverb"
            },
            {
                "word": "unblock",
                "pos": "verb"
            },
            {
                "word": "unborn",
                "pos": "adjective"
            },
            {
                "word": "unbounded",
                "pos": "adjective"
            },
            {
                "word": "unbowed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not yet born",
                    "vi": "chưa được sinh ra"
                },
                "examples": [
                    {
                        "en": "her unborn baby",
                        "vi": "thai nhi của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "a64642213dcd4a57b68fd35eea364985",
        "word": "abort",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbɔːt/",
            "us": "/əˈbɔːrt/"
        },
        "nearby": [
            {
                "word": "aboriginal",
                "pos": "noun"
            },
            {
                "word": "aborigine",
                "pos": "noun"
            },
            {
                "word": "abort",
                "pos": "verb"
            },
            {
                "word": "abortion",
                "pos": "noun"
            },
            {
                "word": "abortionist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to end a pregnancy early in order to prevent a baby from developing and being born alive",
                    "vi": "kết thúc thai kỳ sớm để tránh thai nhi phát triển và sinh ra còn sống"
                },
                "examples": [
                    {
                        "en": "to abort a child/pregnancy/fetus",
                        "vi": "phá thai / mang thai / bào thai"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give birth to a child or young animal too early for it to survive",
                    "vi": "sinh con hoặc động vật non quá sớm để nó có thể sống sót"
                },
                "examples": [
                    {
                        "en": "The virus can cause pregnant animals to abort.",
                        "vi": "Vi rút có thể làm cho động vật mang thai bị sẩy thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end or cause something to end before it has been completed, especially because it is likely to fail",
                    "vi": "kết thúc hoặc khiến điều gì đó kết thúc trước khi nó được hoàn thành, đặc biệt là vì nó có khả năng thất bại"
                },
                "examples": [
                    {
                        "en": "(computing) If the wrong password is given the program aborts.",
                        "vi": "(máy tính) Nếu mật khẩu sai được cung cấp, chương trình sẽ ngừng hoạt động."
                    },
                    {
                        "en": "abort something We had no option but to abort the mission.",
                        "vi": "hủy bỏ một cái gì đó Chúng tôi không có lựa chọn nào khác ngoài việc hủy bỏ nhiệm vụ."
                    },
                    {
                        "en": "The plan was aborted at the last minute.",
                        "vi": "Kế hoạch bị hủy bỏ vào phút cuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "9472095b4d0f45b4bd6ad8b12ff7c998",
        "word": "antenatal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæntiˈneɪtl/",
            "us": "/ˌæntiˈneɪtl/"
        },
        "nearby": [
            {
                "word": "antediluvian",
                "pos": "adjective"
            },
            {
                "word": "antelope",
                "pos": "noun"
            },
            {
                "word": "antenatal",
                "pos": "adjective"
            },
            {
                "word": "antenna",
                "pos": "noun"
            },
            {
                "word": "antepenultimate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to the medical care given to pregnant women",
                    "vi": "liên quan đến chăm sóc y tế cho phụ nữ mang thai"
                },
                "examples": [
                    {
                        "en": "antenatal care/classes/screening",
                        "vi": "khám thai / lớp học / sàng lọc"
                    },
                    {
                        "en": "an antenatal clinic",
                        "vi": "phòng khám thai"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb21fd3937344d5ea8e3784fedc3096a",
        "word": "be with child",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃaɪld/",
            "us": "/tʃaɪld/"
        },
        "nearby": [
            {
                "word": "chikungunya",
                "pos": "noun"
            },
            {
                "word": "chilblain",
                "pos": "noun"
            },
            {
                "word": "child",
                "pos": "noun"
            },
            {
                "word": "child abuse",
                "pos": "noun"
            },
            {
                "word": "childbearing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a young human who is not yet an adult",
                    "vi": "một người trẻ chưa phải là một người lớn"
                },
                "examples": [
                    {
                        "en": "a child of 3/a 3-year-old child",
                        "vi": "một đứa trẻ 3 / một đứa trẻ 3 tuổi"
                    },
                    {
                        "en": "men, women and children",
                        "vi": "đàn ông, phụ nữ và trẻ em"
                    },
                    {
                        "en": "an organization that campaigns for the rights of the unborn child",
                        "vi": "một tổ chức vận động cho quyền của trẻ chưa sinh"
                    },
                    {
                        "en": "The film is not suitable for young children.",
                        "vi": "Phim không phù hợp với trẻ nhỏ."
                    },
                    {
                        "en": "I lived in London as a child.",
                        "vi": "Tôi sống ở London khi còn nhỏ."
                    },
                    {
                        "en": "She was a child star but never made it as an adult.",
                        "vi": "Cô ấy là một ngôi sao nhí nhưng chưa bao giờ thành danh khi trưởng thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "a son or daughter of any age",
                    "vi": "con trai hay con gái ở mọi lứa tuổi"
                },
                "examples": [
                    {
                        "en": "They have three grown-up children.",
                        "vi": "Họ có ba đứa con đã lớn."
                    },
                    {
                        "en": "a support group for adult children of alcoholics",
                        "vi": "một nhóm hỗ trợ cho con cái trưởng thành của những người nghiện rượu"
                    },
                    {
                        "en": "They can't have children.",
                        "vi": "Họ không thể có con."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is strongly influenced by the ideas and attitudes of a particular time or person",
                    "vi": "một người bị ảnh hưởng mạnh mẽ bởi những ý tưởng và thái độ của một thời điểm hoặc một người cụ thể"
                },
                "examples": [
                    {
                        "en": "a child of the 90s",
                        "vi": "một đứa trẻ của những năm 90"
                    }
                ]
            },
            {
                "define": {
                    "en": "an adult who behaves like a child and is not mature or responsible",
                    "vi": "một người lớn cư xử như một đứa trẻ và không trưởng thành hoặc không có trách nhiệm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very easy to do, so not even a child would find it difficult",
                    "vi": "rất dễ thực hiện, vì vậy ngay cả một đứa trẻ cũng không cảm thấy khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be pregnant",
                    "vi": "có thai"
                },
                "examples": [
                    {
                        "en": "big with child",
                        "vi": "lớn bằng đứa trẻ"
                    }
                ]
            }
        ]
    },
    {
        "id": "cd15f89db0914d008472327ef412c004",
        "word": "carry",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæri/",
            "us": "/ˈkæri/"
        },
        "nearby": [
            {
                "word": "carrot",
                "pos": "noun"
            },
            {
                "word": "carroty",
                "pos": "adjective"
            },
            {
                "word": "carry",
                "pos": "verb"
            },
            {
                "word": "carry",
                "pos": "noun"
            },
            {
                "word": "carryall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to support the weight of somebody/something and take them or it from place to place; to take somebody/something from one place to another",
                    "vi": "để hỗ trợ trọng lượng của ai đó / cái gì đó và đưa họ hoặc nó từ nơi này sang nơi khác; đưa ai đó / thứ gì đó từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "carry somebody/something He was carrying a large bag.",
                        "vi": "mang theo ai đó / cái gì đó Anh ấy đang mang một cái túi lớn."
                    },
                    {
                        "en": "to carry a sign/banner/flag",
                        "vi": "mang một dấu hiệu / biểu ngữ / cờ"
                    },
                    {
                        "en": "The plane was carrying 122 passengers and five crew.",
                        "vi": "Máy bay chở 122 hành khách và 5 phi hành đoàn."
                    },
                    {
                        "en": "carry somebody/something + adv./prep. She carried her baby in her arms.",
                        "vi": "mang theo ai đó / cái gì đó + adv./prep. Cô bế con trên tay."
                    },
                    {
                        "en": "The injured were carried away on stretchers.",
                        "vi": "Những người bị thương được khiêng đi trên cáng."
                    },
                    {
                        "en": "a train carrying commuters to work",
                        "vi": "một chuyến tàu chở người đi làm"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something with you and take it wherever you go",
                    "vi": "mang theo thứ gì đó bên mình và mang theo mọi lúc mọi nơi"
                },
                "examples": [
                    {
                        "en": "carry something to carry a weapon/knife",
                        "vi": "mang một cái gì đó để mang vũ khí / dao"
                    },
                    {
                        "en": "Police in many countries carry guns.",
                        "vi": "Cảnh sát nhiều nước mang theo súng."
                    },
                    {
                        "en": "carry something + adv./prep. I never carry much money on me.",
                        "vi": "mang gì đó + adv./prep. Tôi không bao giờ mang nhiều tiền trên người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to contain and direct the flow of water, electricity, etc.",
                    "vi": "để chứa và định hướng dòng chảy của nước, điện, v.v."
                },
                "examples": [
                    {
                        "en": "carry something a pipeline carrying oil",
                        "vi": "mang một cái gì đó một đường ống dẫn dầu"
                    },
                    {
                        "en": "carry something + adv./prep. The veins carry blood to the heart.",
                        "vi": "mang gì đó + adv./prep. Các tĩnh mạch đưa máu về tim."
                    },
                    {
                        "en": "Canals were built to carry water from the Snake River to Milner Dam in 1905.",
                        "vi": "Các kênh đào được xây dựng để dẫn nước từ sông Snake đến đập Milner vào năm 1905."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person, an insect, etc. carries a disease, they have already caught it and might spread it to others although they might not become ill themselves",
                    "vi": "Nếu một người, một con côn trùng, v.v. mang bệnh, họ đã mắc bệnh và có thể lây lan cho người khác mặc dù bản thân họ có thể không bị bệnh"
                },
                "examples": [
                    {
                        "en": "Ticks can carry a nasty disease which affects humans.",
                        "vi": "Bọ ve có thể mang một căn bệnh khó chịu ảnh hưởng đến con người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to remember something",
                    "vi": "để có thể nhớ một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to support the weight of something",
                    "vi": "để hỗ trợ trọng lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A road bridge has to carry a lot of traffic.",
                        "vi": "Một cây cầu đường bộ phải chở rất nhiều phương tiện qua lại."
                    },
                    {
                        "en": "The roof is designed to carry huge loads of snow.",
                        "vi": "Mái nhà được thiết kế để mang một lượng tuyết khổng lồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept responsibility for something; to suffer the results of something",
                    "vi": "để nhận trách nhiệm về một cái gì đó; hứng chịu kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He is carrying the department (= it is only working because of his efforts).",
                        "vi": "Anh ấy đang gánh bộ phận (= nó chỉ hoạt động nhờ những nỗ lực của anh ấy)."
                    },
                    {
                        "en": "Their group was targeted to carry the burden of job losses.",
                        "vi": "Nhóm của họ đã được nhắm mục tiêu để mang gánh nặng mất việc làm."
                    },
                    {
                        "en": "She carries a full load of classes while also serving as department head.",
                        "vi": "Cô ấy vừa gánh vác đầy đủ các lớp học vừa đảm nhiệm chức vụ trưởng bộ môn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something as a quality or feature",
                    "vi": "để có một cái gì đó như một chất lượng hoặc tính năng"
                },
                "examples": [
                    {
                        "en": "Her speech carried the ring of authority.",
                        "vi": "Bài phát biểu của cô ấy mang một vòng uy quyền."
                    },
                    {
                        "en": "Each bike carries a ten-year guarantee.",
                        "vi": "Mỗi chiếc xe đạp đều được bảo hành 10 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something as a result",
                    "vi": "kết quả là có một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Crimes of violence carry heavy penalties.",
                        "vi": "Tội bạo hành sẽ bị phạt nặng."
                    },
                    {
                        "en": "The charge carries a maximum sentence of ten years.",
                        "vi": "Án phí tối đa là mười năm."
                    },
                    {
                        "en": "Being a combat sport, karate carries with it the risk of injury.",
                        "vi": "Là một môn thể thao chiến đấu, karate mang trong mình nguy cơ chấn thương."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something that is thrown, kicked, etc. carries a particular distance, it travels that distance before stopping",
                    "vi": "nếu vật gì đó bị ném, đá, v.v. mang một quãng đường cụ thể, nó sẽ di chuyển quãng đường đó trước khi dừng lại"
                },
                "examples": [
                    {
                        "en": "The fullback's kick carried 50 metres into the crowd.",
                        "vi": "Cú đá của hậu vệ cánh này đã đưa bóng đi vọt xà 50 mét."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sound carries, it can be heard a long distance away",
                    "vi": "nếu một âm thanh mang theo, nó có thể được nghe thấy ở một khoảng cách xa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take something/somebody to a particular point or in a particular direction",
                    "vi": "để đưa một cái gì đó / ai đó đến một điểm cụ thể hoặc theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "The war was carried into enemy territory.",
                        "vi": "Cuộc chiến đã được thực hiện vào lãnh thổ của kẻ thù."
                    },
                    {
                        "en": "Her abilities carried her to the top of her profession.",
                        "vi": "Khả năng của cô ấy đã đưa cô ấy đến đỉnh cao trong nghề nghiệp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to approve of something by more people voting for it than against it",
                    "vi": "tán thành điều gì đó bởi nhiều người bỏ phiếu cho điều đó hơn là phản đối điều đó"
                },
                "examples": [
                    {
                        "en": "The resolution was carried by 340 votes to 210.",
                        "vi": "Nghị quyết đã được 340 phiếu bầu chọn đến 210 phiếu bầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win the support or sympathy of somebody; to persuade people to accept your argument",
                    "vi": "để giành được sự ủng hộ hoặc thông cảm của ai đó; thuyết phục mọi người chấp nhận lập luận của bạn"
                },
                "examples": [
                    {
                        "en": "carry somebody His moving speech was enough to carry the audience.",
                        "vi": "cõng ai đó Bài phát biểu cảm động của anh ấy đủ sức lôi cuốn khán giả."
                    },
                    {
                        "en": "carry something She nodded in agreement, and he saw he had carried his point.",
                        "vi": "mang theo một thứ gì đó Cô gật đầu đồng ý, và anh thấy anh đã làm đúng quan điểm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular label attached; to give a particular message or piece of information",
                    "vi": "để có một nhãn cụ thể được đính kèm; để đưa ra một thông điệp hoặc một phần thông tin cụ thể"
                },
                "examples": [
                    {
                        "en": "Cigarettes carry a health warning.",
                        "vi": "Thuốc lá mang theo một lời cảnh báo về sức khỏe."
                    },
                    {
                        "en": "All the marketing carries a consistent message of quality and reliability.",
                        "vi": "Tất cả các hoạt động tiếp thị đều mang một thông điệp nhất quán về chất lượng và độ tin cậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a newspaper, broadcast, etc. carries a particular story, it publishes or broadcasts it",
                    "vi": "nếu một tờ báo, chương trình phát sóng, v.v. có một câu chuyện cụ thể, nó sẽ xuất bản hoặc phát sóng nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a shop carries a particular item, it has it for sale",
                    "vi": "nếu một cửa hàng mang một mặt hàng cụ thể, nó có nó để bán"
                },
                "examples": [
                    {
                        "en": "We carry a range of educational software.",
                        "vi": "Chúng tôi cung cấp một loạt các phần mềm giáo dục."
                    },
                    {
                        "en": "We do carry green tea, but we don't have any (in stock) right now.",
                        "vi": "Chúng tôi có mang theo trà xanh, nhưng chúng tôi không có bất kỳ (trong kho) ngay bây giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be pregnant with somebody",
                    "vi": "mang thai với ai đó"
                },
                "examples": [
                    {
                        "en": "She was carrying twins.",
                        "vi": "Cô ấy đang mang song thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold or move your head or body in a particular way",
                    "vi": "để giữ hoặc di chuyển đầu hoặc cơ thể của bạn theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "to carry yourself well",
                        "vi": "giữ bản thân thật tốt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to add a number to the next column on the left when adding up numbers, for example when the numbers add up to more than ten",
                    "vi": "để thêm một số vào cột tiếp theo bên trái khi cộng các số, ví dụ: khi các số cộng lên đến hơn mười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "as quickly as you can",
                    "vi": "nhanh nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get very excited or lose control of your feelings",
                    "vi": "để trở nên rất phấn khích hoặc mất kiểm soát cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "I got carried away and started shouting at the television.",
                        "vi": "Tôi bị mang đi và bắt đầu hét vào ti vi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be completely successful",
                    "vi": "hoàn toàn thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take responsibility for getting something done",
                    "vi": "chịu trách nhiệm hoàn thành một việc gì đó"
                },
                "examples": [
                    {
                        "en": "My co-worker was sick, so I had to carry the ball.",
                        "vi": "Đồng nghiệp của tôi bị ốm nên tôi phải đi bế bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept the blame for something, especially when it is not your fault",
                    "vi": "chấp nhận đổ lỗi cho một cái gì đó, đặc biệt là khi nó không phải là lỗi của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be successful against somebody/something",
                    "vi": "để thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Despite strong opposition, the ruling party carried the day.",
                        "vi": "Bất chấp sự phản đối mạnh mẽ, đảng cầm quyền đã tiến hành ngày này."
                    },
                    {
                        "en": "Teamwork and persistence can still win the day.",
                        "vi": "Tinh thần đồng đội và sự bền bỉ vẫn có thể giành được chiến thắng trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue doing something beyond reasonable limits",
                    "vi": "để tiếp tục làm điều gì đó vượt quá giới hạn hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in love with somebody, especially somebody who does not love you in return",
                    "vi": "yêu ai đó, đặc biệt là ai đó không yêu bạn để đáp lại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have influence with somebody",
                    "vi": "có ảnh hưởng với ai đó"
                },
                "examples": [
                    {
                        "en": "My views don't carry much weight with the boss.",
                        "vi": "Quan điểm của tôi không có nhiều sức nặng với ông chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do a lot of little jobs for somebody as if you were their servant",
                    "vi": "làm rất nhiều việc nhỏ cho ai đó như thể bạn là người hầu của họ"
                },
                "examples": [
                    {
                        "en": "Most of her day was spent fetching and carrying for her family.",
                        "vi": "Phần lớn thời gian trong ngày của cô ấy dành cho việc tìm kiếm và mang vác cho gia đình."
                    },
                    {
                        "en": "She expected him to do all the fetching and carrying.",
                        "vi": "Cô mong anh làm tất cả việc tìm và mang."
                    }
                ]
            }
        ]
    },
    {
        "id": "00c0753c45624bb9a37ee24751ab511b",
        "word": "lying-in",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlaɪɪŋ ˈɪn/",
            "us": "/ˌlaɪɪŋ ˈɪn/"
        },
        "nearby": [
            {
                "word": "lye",
                "pos": "noun"
            },
            {
                "word": "lying",
                "pos": "verb"
            },
            {
                "word": "lying-in",
                "pos": "noun"
            },
            {
                "word": "lying-in-state",
                "pos": "noun"
            },
            {
                "word": "Lyme disease",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the period of time during which a woman in the past stayed in bed before and after giving birth to a child",
                    "vi": "khoảng thời gian mà một người phụ nữ trong quá khứ nằm trên giường trước và sau khi sinh con"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca3aadd81c9046e6891ef9eb7395a925",
        "word": "miscarriage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪskærɪdʒ/",
            "us": "/ˈmɪskærɪdʒ/"
        },
        "nearby": [
            {
                "word": "miscalculate",
                "pos": "verb"
            },
            {
                "word": "miscalculation",
                "pos": "noun"
            },
            {
                "word": "miscarriage",
                "pos": "noun"
            },
            {
                "word": "miscarriage of justice",
                "pos": "noun"
            },
            {
                "word": "miscarry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of giving birth to a baby before it is fully developed and able to survive; an occasion when this happens",
                    "vi": "quá trình sinh ra một đứa trẻ trước khi nó được phát triển đầy đủ và có thể tồn tại; một dịp khi điều này xảy ra"
                },
                "examples": [
                    {
                        "en": "to have a miscarriage",
                        "vi": "sẩy thai"
                    },
                    {
                        "en": "The pregnancy ended in miscarriage at 11 weeks.",
                        "vi": "Thai kỳ kết thúc bằng tình trạng sẩy thai ở tuần thứ 11."
                    },
                    {
                        "en": "This test carries a high risk of miscarriage.",
                        "vi": "Xét nghiệm này có nguy cơ sẩy thai cao."
                    },
                    {
                        "en": "She had suffered multiple miscarriages before trying the treatment.",
                        "vi": "Cô đã bị sẩy thai nhiều lần trước khi thử điều trị."
                    },
                    {
                        "en": "Smoking during pregnancy increases the risk of miscarriage.",
                        "vi": "Hút thuốc khi mang thai làm tăng nguy cơ sẩy thai."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7dc39e31e8f409e97a8ab46826da03a",
        "word": "miscarry",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪsˈkæri/",
            "us": "/ˌmɪsˈkæri/"
        },
        "nearby": [
            {
                "word": "miscarriage",
                "pos": "noun"
            },
            {
                "word": "miscarriage of justice",
                "pos": "noun"
            },
            {
                "word": "miscarry",
                "pos": "verb"
            },
            {
                "word": "miscast",
                "pos": "verb"
            },
            {
                "word": "miscegenation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give birth to a baby before it is fully developed and able to live",
                    "vi": "sinh ra một đứa trẻ trước khi nó được phát triển đầy đủ và có thể sống"
                },
                "examples": [
                    {
                        "en": "The shock caused her to miscarry.",
                        "vi": "Cú sốc khiến cô bị sảy thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail",
                    "vi": "thất bại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e7ea8388834949fea51b38a4e13d5954",
        "word": "morning sickness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːnɪŋ sɪknəs/",
            "us": "/ˈmɔːrnɪŋ sɪknəs/"
        },
        "nearby": [
            {
                "word": "morning glory",
                "pos": "noun"
            },
            {
                "word": "morning room",
                "pos": "noun"
            },
            {
                "word": "morning sickness",
                "pos": "noun"
            },
            {
                "word": "the Morning Star",
                "pos": ""
            },
            {
                "word": "the morning star",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the need to vomit that some women feel, often only in the morning, when they are pregnant, especially in the first months",
                    "vi": "nhu cầu nôn mửa mà một số phụ nữ cảm thấy, thường chỉ vào buổi sáng, khi họ mang thai, đặc biệt là trong những tháng đầu tiên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e08c4395859e4fc3a7246df6fa142660",
        "word": "mother-to-be",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmʌðə tə ˈbiː/",
            "us": "/ˌmʌðər tə ˈbiː/"
        },
        "nearby": [
            {
                "word": "the Mothers' Union",
                "pos": ""
            },
            {
                "word": "Mother Superior",
                "pos": "noun"
            },
            {
                "word": "mother-to-be",
                "pos": "noun"
            },
            {
                "word": "mother tongue",
                "pos": "noun"
            },
            {
                "word": "motif",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who is pregnant",
                    "vi": "một người phụ nữ đang mang thai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c9379059ddd7453eb56c0b8b55110384",
        "word": "prenatal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpriːˈneɪtl/",
            "us": "/ˌpriːˈneɪtl/"
        },
        "nearby": [
            {
                "word": "premonition",
                "pos": "noun"
            },
            {
                "word": "premonitory",
                "pos": "adjective"
            },
            {
                "word": "prenatal",
                "pos": "adjective"
            },
            {
                "word": "prenuptial agreement",
                "pos": "noun"
            },
            {
                "word": "preoccupation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to the medical care given to pregnant women",
                    "vi": "liên quan đến chăm sóc y tế cho phụ nữ mang thai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b7c406eb49974126aa717a1bce476c59",
        "word": "shower",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃaʊə(r)/",
            "us": "/ˈʃaʊər/"
        },
        "nearby": [
            {
                "word": "showcase",
                "pos": "verb"
            },
            {
                "word": "showdown",
                "pos": "noun"
            },
            {
                "word": "shower",
                "pos": "noun"
            },
            {
                "word": "shower",
                "pos": "verb"
            },
            {
                "word": "showery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment producing a flow of water that you stand under to wash yourself; the small room or part of a room that contains a shower",
                    "vi": "một thiết bị tạo ra dòng nước mà bạn đứng dưới để rửa mình; căn phòng nhỏ hoặc một phần của căn phòng có vòi hoa sen"
                },
                "examples": [
                    {
                        "en": "in the shower He's in the shower.",
                        "vi": "trong phòng tắm Anh ấy đang trong phòng tắm."
                    },
                    {
                        "en": "I've just got out of the shower.",
                        "vi": "Tôi vừa mới ra khỏi phòng tắm."
                    },
                    {
                        "en": "an en-suite shower room",
                        "vi": "phòng tắm riêng"
                    },
                    {
                        "en": "a shower cubicle/curtain",
                        "vi": "một buồng tắm / rèm"
                    },
                    {
                        "en": "an electric shower",
                        "vi": "vòi sen điện"
                    },
                    {
                        "en": "a hotel room with bath and shower",
                        "vi": "một phòng khách sạn có bồn tắm và vòi hoa sen"
                    },
                    {
                        "en": "She was getting into the shower when the doorbell rang.",
                        "vi": "Cô đang đi tắm thì chuông cửa vang lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of washing yourself with a shower",
                    "vi": "tắm rửa bằng vòi hoa sen"
                },
                "examples": [
                    {
                        "en": "a hot/cold shower",
                        "vi": "vòi sen nước nóng / lạnh"
                    },
                    {
                        "en": "(especially British English) to have a shower",
                        "vi": "(đặc biệt là tiếng Anh Anh) để tắm"
                    },
                    {
                        "en": "(especially North American English) to take a shower",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để đi tắm"
                    },
                    {
                        "en": "shower gel",
                        "vi": "sữa tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of rain or snow",
                    "vi": "mưa hoặc tuyết trong thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "scattered/heavy showers",
                        "vi": "mưa rào rải rác / nặng hạt"
                    },
                    {
                        "en": "April showers",
                        "vi": "Tháng tư mưa rào"
                    },
                    {
                        "en": "We were caught in a heavy shower.",
                        "vi": "Chúng tôi đã bị bắt gặp trong một trận mưa rào."
                    },
                    {
                        "en": "There's a chance of showers this afternoon.",
                        "vi": "Có thể có mưa rào vào chiều nay."
                    },
                    {
                        "en": "rain/snow showers",
                        "vi": "mưa / mưa tuyết"
                    },
                    {
                        "en": "wintry showers (= of snow)",
                        "vi": "mưa rào (= tuyết)"
                    },
                    {
                        "en": "shower of something a shower of rain/hail/hailstones",
                        "vi": "cơn mưa rào của cái gì đó một cơn mưa rào / mưa đá / mưa đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of things that arrive or fall together",
                    "vi": "một số lượng lớn những thứ đến hoặc rơi cùng nhau"
                },
                "examples": [
                    {
                        "en": "a meteor shower",
                        "vi": "mưa sao băng"
                    },
                    {
                        "en": "a shower of leaves",
                        "vi": "một cơn mưa lá"
                    },
                    {
                        "en": "a shower of sparks from the fire",
                        "vi": "một tia lửa từ ngọn lửa"
                    },
                    {
                        "en": "a shower of kisses",
                        "vi": "một nụ hôn mưa rào"
                    }
                ]
            },
            {
                "define": {
                    "en": "a party at which you give presents to a woman who is getting married or having a baby",
                    "vi": "một bữa tiệc mà bạn tặng quà cho một người phụ nữ sắp kết hôn hoặc sinh con"
                },
                "examples": [
                    {
                        "en": "a bridal/baby shower",
                        "vi": "tắm cho cô dâu / em bé"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb47cd7c4d5d4a6083ee09287f712c3e",
        "word": "sperm bank",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspɜːm bæŋk/",
            "us": "/ˈspɜːrm bæŋk/"
        },
        "nearby": [
            {
                "word": "sperm",
                "pos": "noun"
            },
            {
                "word": "spermatozoon",
                "pos": "noun"
            },
            {
                "word": "sperm bank",
                "pos": "noun"
            },
            {
                "word": "spermicidal",
                "pos": "adjective"
            },
            {
                "word": "spermicide",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where sperm is kept and then used to help women become pregnant artificially",
                    "vi": "nơi lưu giữ tinh trùng và sau đó được sử dụng để giúp phụ nữ mang thai nhân tạo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "501bda042f5844909f2a83efec195c7b",
        "word": "stretch marks",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstretʃ mɑːks/",
            "us": "/ˈstretʃ mɑːrks/"
        },
        "nearby": [
            {
                "word": "stretcher-bearer",
                "pos": "noun"
            },
            {
                "word": "stretch limo",
                "pos": "noun"
            },
            {
                "word": "stretch marks",
                "pos": "noun"
            },
            {
                "word": "stretch out",
                "pos": "phrasal verb"
            },
            {
                "word": "stretchy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the marks that are left on a person’s skin after it has been stretched, particularly after a woman has been pregnant",
                    "vi": "những dấu vết để lại trên da của một người sau khi da bị kéo căng ra, đặc biệt là sau khi phụ nữ mang thai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f4f78b1c48d479f8fd49539f6ec74ca",
        "word": "surrogacy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌrəɡəsi/",
            "us": "/ˈsɜːrəɡəsi/"
        },
        "nearby": [
            {
                "word": "surreptitiously",
                "pos": "adverb"
            },
            {
                "word": "Surrey",
                "pos": ""
            },
            {
                "word": "surrogacy",
                "pos": "noun"
            },
            {
                "word": "surrogate",
                "pos": "adjective"
            },
            {
                "word": "surrogate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of giving birth to a baby for another person or couple, usually because they are unable to have babies themselves",
                    "vi": "Thực hành sinh con cho một người hoặc một cặp vợ chồng khác, thường là do họ không thể sinh con"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "88ef4167e1ae4da88120d9ac712ff425",
        "word": "surrogate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌrəɡət/",
            "us": "/ˈsɜːrəɡət/"
        },
        "nearby": [
            {
                "word": "Surrey",
                "pos": ""
            },
            {
                "word": "surrogacy",
                "pos": "noun"
            },
            {
                "word": "surrogate",
                "pos": "adjective"
            },
            {
                "word": "surrogate",
                "pos": "noun"
            },
            {
                "word": "surrogate mother",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe a person or thing that takes the place of, or is used instead of, somebody/something else",
                    "vi": "được sử dụng để mô tả một người hoặc vật thay thế hoặc được sử dụng thay thế cho ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "She saw him as a sort of surrogate father.",
                        "vi": "Cô coi anh như một người cha đại diện."
                    },
                    {
                        "en": "For these people, television is a surrogate for real life.",
                        "vi": "Đối với những người này, truyền hình là vật thay thế cho cuộc sống thực."
                    }
                ]
            }
        ]
    },
    {
        "id": "d24d7d46bfa6481f93556baa04f27a0d",
        "word": "termination",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtɜːmɪˈneɪʃn/",
            "us": "/ˌtɜːrmɪˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "terminal velocity",
                "pos": "noun"
            },
            {
                "word": "terminate",
                "pos": "verb"
            },
            {
                "word": "termination",
                "pos": "noun"
            },
            {
                "word": "terminological",
                "pos": "adjective"
            },
            {
                "word": "terminology",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of ending something; the end of something",
                    "vi": "hành động kết thúc một cái gì đó; kết thúc của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Failure to comply with these conditions will result in termination of the contract.",
                        "vi": "Nếu không tuân thủ các điều kiện này sẽ dẫn đến việc chấm dứt hợp đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a medical operation to end a pregnancy at an early stage",
                    "vi": "phẫu thuật y tế để chấm dứt thai kỳ ở giai đoạn đầu"
                },
                "examples": [
                    {
                        "en": "She chose to have an early termination.",
                        "vi": "Cô ấy đã chọn kết thúc sớm."
                    }
                ]
            }
        ]
    },
    {
        "id": "659b7ae4704c42b7ada085df77c34f32",
        "word": "trimester",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪˈmestə(r)/",
            "us": "/traɪˈmestər/"
        },
        "nearby": [
            {
                "word": "trimaran",
                "pos": "noun"
            },
            {
                "word": "trim down",
                "pos": "phrasal verb"
            },
            {
                "word": "trimester",
                "pos": "noun"
            },
            {
                "word": "trimeter",
                "pos": "noun"
            },
            {
                "word": "trimmer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of three months during the time when a woman is pregnant",
                    "vi": "khoảng thời gian ba tháng khi một người phụ nữ mang thai"
                },
                "examples": [
                    {
                        "en": "the first trimester of pregnancy",
                        "vi": "ba tháng đầu của thai kỳ"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the three periods in the year during which classes are held in schools, universities, etc.",
                    "vi": "một trong ba kỳ trong năm mà các lớp học được tổ chức ở các trường học, trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "The school year is divided into three trimesters.",
                        "vi": "Năm học được chia thành ba kỳ học."
                    }
                ]
            }
        ]
    }
]