[
    {
        "id": "e7a734c10e2a42989b46bb84c23b20d5",
        "word": "quiz",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/kwɪz/",
            "us": "/kwɪz/"
        },
        "nearby": [
            {
                "word": "qui vive",
                "pos": "noun"
            },
            {
                "word": "quixotic",
                "pos": "adjective"
            },
            {
                "word": "quiz",
                "pos": "noun"
            },
            {
                "word": "quiz",
                "pos": "verb"
            },
            {
                "word": "quizmaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a competition or game in which people try to answer questions to test their knowledge",
                    "vi": "một cuộc thi hoặc trò chơi trong đó mọi người cố gắng trả lời các câu hỏi để kiểm tra kiến thức của họ"
                },
                "examples": [
                    {
                        "en": "a general knowledge quiz",
                        "vi": "một bài kiểm tra kiến thức chung"
                    },
                    {
                        "en": "a television quiz show",
                        "vi": "một chương trình đố vui trên truyền hình"
                    },
                    {
                        "en": "The quiz will be a team event organized by the local school.",
                        "vi": "Đố vui sẽ là một sự kiện đồng đội do trường học địa phương tổ chức."
                    },
                    {
                        "en": "The magazine publishes a quiz once a month.",
                        "vi": "Tạp chí xuất bản một bài kiểm tra mỗi tháng một lần."
                    },
                    {
                        "en": "The club has weekly quiz nights.",
                        "vi": "Câu lạc bộ có các đêm đố vui hàng tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an informal test given to students",
                    "vi": "một bài kiểm tra không chính thức cho sinh viên"
                },
                "examples": [
                    {
                        "en": "a reading comprehension quiz",
                        "vi": "một bài kiểm tra đọc hiểu"
                    },
                    {
                        "en": "Students should never miss a quiz or exam without notifying their class counselor.",
                        "vi": "Học sinh không bao giờ được bỏ lỡ một bài kiểm tra hoặc bài kiểm tra mà không thông báo cho cố vấn lớp của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6262f2e898fe45d2af944d61356a7c37",
        "word": "turn",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/tɜːn/",
            "us": "/tɜːrn/"
        },
        "nearby": [
            {
                "word": "turmoil",
                "pos": "noun"
            },
            {
                "word": "turn",
                "pos": "verb"
            },
            {
                "word": "turn",
                "pos": "noun"
            },
            {
                "word": "turnabout",
                "pos": "noun"
            },
            {
                "word": "turn against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when somebody in a group of people should or is allowed to do something",
                    "vi": "thời điểm ai đó trong một nhóm người nên hoặc được phép làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "When it's your turn, take another card.",
                        "vi": "Khi đến lượt của bạn, hãy lấy một thẻ khác."
                    },
                    {
                        "en": "Please wait your turn.",
                        "vi": "Vui lòng đợi đến lượt của bạn."
                    },
                    {
                        "en": "somebody's turn to do something Whose turn is it to cook?",
                        "vi": "Ai đó sẽ làm gì đó Đến lượt ai nấu?"
                    },
                    {
                        "en": "Steve took a turn driving while I slept.",
                        "vi": "Steve đã lái xe trong khi tôi ngủ."
                    },
                    {
                        "en": "If you can't put any cards down you have to miss a turn.",
                        "vi": "Nếu bạn không thể đặt bất kỳ thẻ nào xuống, bạn phải bỏ lỡ một lượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a change in direction in a vehicle",
                    "vi": "sự thay đổi hướng của một chiếc xe"
                },
                "examples": [
                    {
                        "en": "Make a left/right turn into West Street.",
                        "vi": "Rẽ trái / phải vào Phố Tây."
                    },
                    {
                        "en": "turn to the left/right He made a sudden turn to the right.",
                        "vi": "quay sang trái / phải Anh ta đột ngột rẽ sang phải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a road leads away from the one you are travelling on",
                    "vi": "nơi có con đường dẫn ra khỏi con đường bạn đang đi"
                },
                "examples": [
                    {
                        "en": "Take the next turn on the right.",
                        "vi": "Rẽ tiếp theo ở bên phải."
                    },
                    {
                        "en": "He took a wrong turn and ended up on the coast road.",
                        "vi": "Anh ta đã rẽ nhầm và kết thúc trên con đường ven biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bend or corner in a road",
                    "vi": "khúc cua hoặc khúc cua trên đường"
                },
                "examples": [
                    {
                        "en": "a lane full of twists and turns",
                        "vi": "một làn đường đầy ngoằn ngoèo"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of turning somebody/something around",
                    "vi": "một hành động xoay chuyển ai đó / cái gì đó xung quanh"
                },
                "examples": [
                    {
                        "en": "Give the handle a few turns.",
                        "vi": "Xoay tay cầm một vài vòng."
                    },
                    {
                        "en": "The engine started with the first turn of the key.",
                        "vi": "Động cơ khởi động bằng lần vặn chìa khóa đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unusual or unexpected change in what is happening",
                    "vi": "một thay đổi bất thường hoặc bất ngờ về những gì đang xảy ra"
                },
                "examples": [
                    {
                        "en": "a surprising turn of events",
                        "vi": "một sự thay đổi đáng ngạc nhiên"
                    },
                    {
                        "en": "His health has taken a turn for the worse (= suddenly got worse).",
                        "vi": "Sức khỏe của anh ấy đã trở nên tồi tệ hơn (= đột nhiên trở nên tồi tệ hơn)."
                    },
                    {
                        "en": "Events took a dramatic turn in the weeks that followed.",
                        "vi": "Các sự kiện diễn ra mạnh mẽ trong những tuần sau đó."
                    },
                    {
                        "en": "by turns The book is, by turns, funny and very sad.",
                        "vi": "Lần lượt Cuốn sách vừa buồn cười vừa rất buồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short performance or piece of entertainment such as a song, etc.",
                    "vi": "một buổi biểu diễn ngắn hoặc một phần giải trí chẳng hạn như một bài hát, v.v."
                },
                "examples": [
                    {
                        "en": "Everyone got up on stage to do a turn.",
                        "vi": "Mọi người đứng lên sân khấu để thực hiện một lượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short walk",
                    "vi": "cuộc đi bộ ngắn"
                },
                "examples": [
                    {
                        "en": "We took a turn around the park.",
                        "vi": "Chúng tôi đi một vòng quanh công viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of illness",
                    "vi": "một cảm giác bệnh tật"
                },
                "examples": [
                    {
                        "en": "a funny turn (= a feeling that you may faint)",
                        "vi": "một bước ngoặt hài hước (= cảm giác bạn có thể ngất xỉu)"
                    },
                    {
                        "en": "Grandma had one of her turns.",
                        "vi": "Bà đã có một trong những lượt của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "everywhere or every time you try and do something",
                    "vi": "mọi nơi hoặc mọi lúc bạn cố gắng và làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "At every turn I met with disappointment.",
                        "vi": "Ở mọi ngã rẽ, tôi đều gặp phải sự thất vọng."
                    },
                    {
                        "en": "Her ideas were blocked at every turn.",
                        "vi": "Ý tưởng của cô ấy đã bị chặn ở mọi ngã rẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "cooked for exactly the right amount of time",
                    "vi": "nấu trong khoảng thời gian chính xác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to frighten or shock somebody",
                    "vi": "để làm ai đó sợ hãi hoặc sốc"
                },
                "examples": [
                    {
                        "en": "You gave me quite a turn, creeping up on me like that!",
                        "vi": "Bạn đã cho tôi một lượt khá, leo lên trên tôi như thế!"
                    }
                ]
            },
            {
                "define": {
                    "en": "(to do) something that helps somebody",
                    "vi": "(để làm) điều gì đó giúp ai đó"
                },
                "examples": [
                    {
                        "en": "Well, that's my good turn for the day.",
                        "vi": "Chà, đó là lượt đi tốt của tôi trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "one after the other in a particular order",
                    "vi": "cái này đến cái khác theo một thứ tự cụ thể"
                },
                "examples": [
                    {
                        "en": "The children called out their names in turn.",
                        "vi": "Các em lần lượt gọi tên."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of something in a series of events",
                    "vi": "là kết quả của một cái gì đó trong một loạt các sự kiện"
                },
                "examples": [
                    {
                        "en": "Increased production will, in turn, lead to increased profits.",
                        "vi": "Do đó, sản lượng tăng lên sẽ dẫn đến tăng lợi nhuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do no work",
                    "vi": "không làm việc gì"
                },
                "examples": [
                    {
                        "en": "She hasn't done a hand's turn all week.",
                        "vi": "Cô ấy đã không làm một tay cả tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should help somebody who has helped you",
                    "vi": "bạn nên giúp ai đó đã giúp bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "going to change soon",
                    "vi": "sẽ sớm thay đổi"
                },
                "examples": [
                    {
                        "en": "His luck is on the turn.",
                        "vi": "Vận may của anh ấy đang đến lượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something out of turn, you do it when you are not supposed to be the next person to do something",
                    "vi": "nếu bạn làm điều gì đó đột xuất, bạn làm điều đó khi bạn không được cho là người tiếp theo làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Batista had batted out of turn.",
                        "vi": "Batista đã bị đánh bại."
                    },
                    {
                        "en": "I'm writing to you out of turn because I have some very important news.",
                        "vi": "Tôi đang viết thư cho bạn vì tôi có một số tin tức rất quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful for a particular purpose or period of time",
                    "vi": "hữu ích cho một mục đích hoặc khoảng thời gian cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something that you should not because it is the wrong situation or because it offends somebody",
                    "vi": "nói điều gì đó mà bạn không nên vì đó là tình huống sai hoặc vì nó xúc phạm ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if people take turns or take it in turns to do something, they do it one after the other to make sure it is done fairly",
                    "vi": "nếu mọi người thay phiên nhau hoặc thay phiên nhau làm điều gì đó, họ sẽ làm lần lượt để đảm bảo việc đó được thực hiện một cách công bằng"
                },
                "examples": [
                    {
                        "en": "The male and female birds take turns in sitting on the eggs.",
                        "vi": "Chim trống và chim mái thay phiên nhau ngồi ấp trứng."
                    },
                    {
                        "en": "We take it in turns to do the housework.",
                        "vi": "Chúng tôi thay phiên nhau làm việc nhà."
                    },
                    {
                        "en": "The kids took turns on the swing.",
                        "vi": "Các bạn nhỏ thay nhau chơi xích đu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time when a new century/year starts",
                    "vi": "thời điểm mà một thế kỷ / năm mới bắt đầu"
                },
                "examples": [
                    {
                        "en": "It was built at the turn of the century.",
                        "vi": "Nó được xây dựng vào thời điểm chuyển giao thế kỷ."
                    },
                    {
                        "en": "The team are unbeaten since the turn of the year.",
                        "vi": "Đội bất bại kể từ đầu năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of thinking about things",
                    "vi": "một cách suy nghĩ cụ thể về mọi thứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular way of describing something",
                    "vi": "một cách cụ thể để mô tả một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He is meticulous in his choice of words and turns of phrase.",
                        "vi": "Anh ấy rất tỉ mỉ trong việc lựa chọn từ và lượt của cụm từ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra amount of pressure, cruelty, etc. added to a situation that is already difficult to bear or understand",
                    "vi": "thêm một lượng áp lực, sự tàn nhẫn, v.v. đã thêm vào một tình huống vốn đã khó chịu đựng hoặc khó hiểu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sudden increase in your speed or rate of progress; the ability to suddenly increase your speed",
                    "vi": "sự gia tăng đột ngột về tốc độ hoặc tốc độ tiến bộ của bạn; khả năng đột ngột tăng tốc độ của bạn"
                },
                "examples": [
                    {
                        "en": "He put on an impressive turn of speed in the last lap.",
                        "vi": "Anh đã có một pha bứt tốc ấn tượng ở vòng đua cuối cùng."
                    },
                    {
                        "en": "The kangaroo has a fast turn of speed.",
                        "vi": "Con kangaroo có tốc độ quay đầu cực nhanh."
                    },
                    {
                        "en": "For a small car it has a good turn of speed.",
                        "vi": "Đối với một chiếc xe nhỏ, nó có một tốc độ quay vòng tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "7130f0a02d274853806a35447b544b9b",
        "word": "board",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bɔːd/",
            "us": "/bɔːrd/"
        },
        "nearby": [
            {
                "word": "Boadicea",
                "pos": ""
            },
            {
                "word": "boar",
                "pos": "noun"
            },
            {
                "word": "board",
                "pos": "noun"
            },
            {
                "word": "board",
                "pos": "verb"
            },
            {
                "word": "boarder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thin piece of strong hard material, especially wood, used, for example, for making floors, building walls and roofs and making boats",
                    "vi": "Ví dụ như một mảnh dài mỏng bằng vật liệu cứng chắc, đặc biệt là gỗ, được sử dụng để làm sàn, xây tường, mái nhà và làm thuyền"
                },
                "examples": [
                    {
                        "en": "He had ripped up the carpet, leaving only the bare boards.",
                        "vi": "Anh ta đã xé toạc tấm thảm, chỉ để lại những tấm ván trơ trọi."
                    },
                    {
                        "en": "She noticed a loose board in the fence.",
                        "vi": "Cô nhận thấy một tấm ván lỏng lẻo trong hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of wood, or other strong material, that is used for a special purpose",
                    "vi": "một mảnh gỗ, hoặc vật liệu chắc chắn khác, được sử dụng cho mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "a whiteboard",
                        "vi": "bảng trắng"
                    },
                    {
                        "en": "I'll write it up on the board.",
                        "vi": "Tôi sẽ viết nó lên bảng."
                    },
                    {
                        "en": "(British English) a noticeboard",
                        "vi": "(Tiếng Anh Anh) một bảng thông báo"
                    },
                    {
                        "en": "(North American English) a bulletin board",
                        "vi": "(Tiếng Anh Bắc Mỹ) một bảng thông báo"
                    },
                    {
                        "en": "The exam results went up on the board.",
                        "vi": "Kết quả kỳ thi được đưa lên bảng."
                    },
                    {
                        "en": "a diving board",
                        "vi": "bảng lặn"
                    },
                    {
                        "en": "She jumped off the top board.",
                        "vi": "Cô ấy đã nhảy khỏi bảng trên cùng."
                    },
                    {
                        "en": "a chessboard",
                        "vi": "một bàn cờ"
                    },
                    {
                        "en": "He removed the figure from the board.",
                        "vi": "Anh ta xóa hình người khỏi bàn cờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the piece of equipment on which somebody stands in various water sports and in snowboarding and skateboarding",
                    "vi": "phần thiết bị mà trên đó ai đó đứng trong các môn thể thao dưới nước khác nhau và trượt tuyết và trượt ván"
                },
                "examples": [
                    {
                        "en": "You kick-turn with both feet on the board.",
                        "vi": "Bạn đá-quay bằng cả hai chân trên bàn cờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have power to make decisions and control a company or other organization",
                    "vi": "một nhóm người có quyền ra quyết định và kiểm soát một công ty hoặc tổ chức khác"
                },
                "examples": [
                    {
                        "en": "The board is/are unhappy about falling sales.",
                        "vi": "Hội đồng quản trị đang / không hài lòng về doanh số bán hàng giảm."
                    },
                    {
                        "en": "members of the board",
                        "vi": "thành viên của hội đồng quản trị"
                    },
                    {
                        "en": "on the board She has a seat on the board of directors.",
                        "vi": "on the board Cô ấy có một ghế trong ban giám đốc."
                    },
                    {
                        "en": "He has served on the editorial boards of several scientific journals.",
                        "vi": "Ông đã phục vụ trong ban biên tập của một số tạp chí khoa học."
                    },
                    {
                        "en": "She sits on various advisory boards.",
                        "vi": "Cô ấy ngồi trong các ban cố vấn khác nhau."
                    },
                    {
                        "en": "a board member/meeting",
                        "vi": "một thành viên hội đồng / cuộc họp"
                    },
                    {
                        "en": "discussions at board level",
                        "vi": "thảo luận ở cấp hội đồng quản trị"
                    },
                    {
                        "en": "board of somebody/something The decision was approved by the museum's board of trustees.",
                        "vi": "hội đồng quản trị của ai đó / cái gì đó Quyết định đã được thông qua bởi hội đồng quản trị của bảo tàng."
                    },
                    {
                        "en": "(North American English) the Board of Education (= a group of elected officials who are in charge of all the public schools in a particular area)",
                        "vi": "(Tiếng Anh Bắc Mỹ) Hội đồng Giáo dục (= một nhóm các quan chức được bầu cử phụ trách tất cả các trường công lập trong một khu vực cụ thể)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the name of some organizations",
                    "vi": "được sử dụng trong tên của một số tổ chức"
                },
                "examples": [
                    {
                        "en": "the Welsh Tourist Board (= responsible for giving tourist information)",
                        "vi": "Ban du lịch xứ Wales (= chịu trách nhiệm cung cấp thông tin du lịch)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the meals that are provided when you stay in a hotel, guest house, etc.; what you pay for the meals",
                    "vi": "các bữa ăn được cung cấp khi bạn ở trong khách sạn, nhà khách, v.v.; những gì bạn trả cho các bữa ăn"
                },
                "examples": [
                    {
                        "en": "He pays £90 a week board and lodging.",
                        "vi": "Anh ta trả 90 bảng một tuần cho hội đồng và chỗ ở."
                    }
                ]
            },
            {
                "define": {
                    "en": "exams that you take when you apply to go to college in the US",
                    "vi": "kỳ thi mà bạn thực hiện khi đăng ký vào đại học ở Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the stage in a theatre",
                    "vi": "sân khấu trong nhà hát"
                },
                "examples": [
                    {
                        "en": "His play is on the boards on Broadway.",
                        "vi": "Vở kịch của anh ấy nằm trên bảng ở Broadway."
                    },
                    {
                        "en": "She's treading the boards (= working as an actress).",
                        "vi": "Cô ấy đang giẫm chân lên bảng (= làm diễn viên)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the low wooden wall surrounding the area where a game of ice hockey is played",
                    "vi": "bức tường gỗ thấp bao quanh khu vực chơi khúc côn cầu trên băng"
                },
                "examples": [
                    {
                        "en": "The puck went wide, hitting the boards.",
                        "vi": "Puck đi rộng, đập vào các tấm ván."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving everyone or everything in a company, an industry, etc.",
                    "vi": "liên quan đến mọi người hoặc mọi thứ trong một công ty, một ngành, v.v."
                },
                "examples": [
                    {
                        "en": "The industry needs more investment across the board.",
                        "vi": "Ngành công nghiệp này cần đầu tư nhiều hơn trên diện rộng."
                    },
                    {
                        "en": "an across-the-board wage increase",
                        "vi": "tăng lương trên diện rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be rejected or ignored; to be no longer possible",
                    "vi": "bị từ chối hoặc bị bỏ qua; không còn có thể"
                },
                "examples": [
                    {
                        "en": "All her efforts to be polite went by the board and she started to shout.",
                        "vi": "Tất cả những nỗ lực của cô ấy để trở nên lịch sự đã bị ban giám đốc và cô ấy bắt đầu hét lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "on or in a ship, an aircraft or a train",
                    "vi": "trên hoặc trong một con tàu, một chiếc máy bay hoặc một chuyến tàu"
                },
                "examples": [
                    {
                        "en": "Have the passengers gone on board yet?",
                        "vi": "Hành khách đã lên máy bay chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "giving your support to an idea or a project",
                    "vi": "hỗ trợ bạn cho một ý tưởng hoặc một dự án"
                },
                "examples": [
                    {
                        "en": "We must get more sponsors on board.",
                        "vi": "Chúng ta phải có thêm nhiều nhà tài trợ trên tàu."
                    },
                    {
                        "en": "You need to bring the whole staff on board.",
                        "vi": "Bạn cần đưa toàn bộ nhân viên lên máy bay."
                    },
                    {
                        "en": "It’s good to have you on board (= working with us) for this project.",
                        "vi": "Thật tốt khi bạn tham gia (= làm việc với chúng tôi) cho dự án này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win all the prizes, etc. in a competition",
                    "vi": "để giành được tất cả các giải thưởng, v.v. trong một cuộc thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to accept and understand an idea or a suggestion",
                    "vi": "để chấp nhận và hiểu một ý tưởng hoặc một đề xuất"
                },
                "examples": [
                    {
                        "en": "I told her what I thought, but she didn't take my advice on board.",
                        "vi": "Tôi đã nói với cô ấy những gì tôi nghĩ, nhưng cô ấy không nghe theo lời khuyên của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "72bf2e447c3f4ad590ff1d59253812e9",
        "word": "board game",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbɔːd ɡeɪm/",
            "us": "/ˈbɔːrd ɡeɪm/"
        },
        "nearby": [
            {
                "word": "board",
                "pos": "verb"
            },
            {
                "word": "boarder",
                "pos": "noun"
            },
            {
                "word": "board game",
                "pos": "noun"
            },
            {
                "word": "boarding",
                "pos": "noun"
            },
            {
                "word": "boarding card",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any game played on a board, often using dice and small pieces that are moved around",
                    "vi": "bất kỳ trò chơi nào được chơi trên bàn cờ, thường sử dụng xúc xắc và các mảnh nhỏ được di chuyển xung quanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "29478fc295d549369d51a45ef7253c06",
        "word": "chess",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃes/",
            "us": "/tʃes/"
        },
        "nearby": [
            {
                "word": "the Cheshire Cat",
                "pos": ""
            },
            {
                "word": "Cheshire cheese",
                "pos": "noun"
            },
            {
                "word": "chess",
                "pos": "noun"
            },
            {
                "word": "chessboard",
                "pos": "noun"
            },
            {
                "word": "chessman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two people played on a board marked with black and white squares on which each playing piece (representing a king, queen, castle, etc.) is moved according to special rules. The aim is to put the other player’s king in a position from which it cannot escape (= to checkmate it).",
                    "vi": "trò chơi dành cho hai người được chơi trên một bảng được đánh dấu bằng các ô vuông đen và trắng, trên đó mỗi quân chơi (tượng trưng cho vua, hoàng hậu, lâu đài, v.v.) được di chuyển theo các quy tắc đặc biệt. Mục đích là đặt vua của người chơi khác vào vị trí mà nó không thể thoát ra (= để kiểm tra nó)."
                },
                "examples": [
                    {
                        "en": "the position of the chess pieces on the board",
                        "vi": "vị trí của các quân cờ trên bàn cờ"
                    },
                    {
                        "en": "Alex plays chess as a hobby.",
                        "vi": "Alex chơi cờ như một sở thích."
                    }
                ]
            }
        ]
    },
    {
        "id": "f489eed1c67f4bcca073d2d3403123d5",
        "word": "crossword",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkrɒswɜːd/",
            "us": "/ˈkrɔːswɜːrd/"
        },
        "nearby": [
            {
                "word": "crosswind",
                "pos": "noun"
            },
            {
                "word": "crosswise",
                "pos": "adverb"
            },
            {
                "word": "crossword",
                "pos": "noun"
            },
            {
                "word": "crotales",
                "pos": "noun"
            },
            {
                "word": "crotch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which you have to fit words across and downwards into spaces with numbers in a square diagram. You find the words by solving clues.",
                    "vi": "một trò chơi trong đó bạn phải xếp các từ theo chiều ngang và xuống dưới vào khoảng trống có các số trong một sơ đồ hình vuông. Bạn tìm thấy các từ bằng cách giải quyết các manh mối."
                },
                "examples": [
                    {
                        "en": "to do a/the crossword",
                        "vi": "để làm một / ô chữ"
                    },
                    {
                        "en": "I've finished the crossword apart from 3 across and 10 down.",
                        "vi": "Tôi đã hoàn thành ô chữ ngoài 3 ô ngang và 10 ô chữ xuống."
                    }
                ]
            }
        ]
    },
    {
        "id": "b8291f22798b45d6b55453524679d7cb",
        "word": "go",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɡəʊ/",
            "us": "/ɡəʊ/"
        },
        "nearby": [
            {
                "word": "go-ahead",
                "pos": "adjective"
            },
            {
                "word": "go",
                "pos": "verb"
            },
            {
                "word": "go",
                "pos": "noun"
            },
            {
                "word": "go about",
                "pos": "phrasal verb"
            },
            {
                "word": "goad",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person’s turn to move or play in a game or an activity",
                    "vi": "đến lượt một người di chuyển hoặc chơi trong một trò chơi hoặc một hoạt động"
                },
                "examples": [
                    {
                        "en": "Whose go is it?",
                        "vi": "Lượt của ai vậy?"
                    },
                    {
                        "en": "It's your go.",
                        "vi": "Đến lượt của bạn."
                    },
                    {
                        "en": "‘How much is it to play?’ ‘It's 50p a go.’",
                        "vi": "Chơi bao nhiêu?' 'Đó là 50p một đi. \""
                    },
                    {
                        "en": "go on something Can I have a go on your new bike?",
                        "vi": "đi tiếp một cái gì đó Tôi có thể đi trên chiếc xe đạp mới của bạn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an attempt at doing something",
                    "vi": "một nỗ lực để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It took three goes to get it right.",
                        "vi": "Phải mất ba lần để làm đúng."
                    },
                    {
                        "en": "I doubt if he'll listen to advice from me, but I'll give it a go (= I'll try but I don't think I will succeed).",
                        "vi": "Tôi nghi ngờ liệu anh ấy có lắng nghe lời khuyên từ tôi không, nhưng tôi sẽ thử (= Tôi sẽ cố gắng nhưng tôi không nghĩ mình sẽ thành công)."
                    }
                ]
            },
            {
                "define": {
                    "en": "energy and enthusiasm",
                    "vi": "năng lượng và nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "Mary's always got plenty of go.",
                        "vi": "Mary luôn có nhiều việc phải đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in one single attempt or try",
                    "vi": "trong một lần thử hoặc thử"
                },
                "examples": [
                    {
                        "en": "She blew out the candles at one go.",
                        "vi": "Cô ấy đã thổi tắt những ngọn nến cùng một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very busy or full of activity",
                    "vi": "rất bận rộn hoặc đầy hoạt động"
                },
                "examples": [
                    {
                        "en": "It was all go in the office today.",
                        "vi": "Tất cả đã diễn ra trong văn phòng ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be planned and possible or allowed",
                    "vi": "được lên kế hoạch và có thể hoặc được phép"
                },
                "examples": [
                    {
                        "en": "I'm not sure if Friday's trip is a go.",
                        "vi": "Tôi không chắc liệu chuyến đi vào thứ Sáu có phải là một chuyến đi hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very active and busy",
                    "vi": "rất năng động và bận rộn"
                },
                "examples": [
                    {
                        "en": "I've been on the go all day.",
                        "vi": "Tôi đã đi suốt cả ngày."
                    },
                    {
                        "en": "Having four children keeps her on the go.",
                        "vi": "Có bốn đứa con khiến cô luôn nỗ lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to be reasonable",
                    "vi": "từng yêu cầu ai đó phải hợp lý"
                },
                "examples": [
                    {
                        "en": "I just wanted to say, ‘Hey mate, fair go!’",
                        "vi": "Tôi chỉ muốn nói, 'Này anh bạn, công bằng đi!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "(to give somebody/get) fair treatment that gives you the same chance as somebody else",
                    "vi": "(để cung cấp cho ai đó / nhận được) đối xử công bằng mang lại cho bạn cơ hội giống như người khác"
                },
                "examples": [
                    {
                        "en": "Are minority students getting a fair shake at college?",
                        "vi": "Học sinh thiểu số có được đánh giá cao ở trường đại học không?"
                    },
                    {
                        "en": "We need a government that cares about equity and a fair go for all.",
                        "vi": "Chúng ta cần một chính phủ quan tâm đến công bằng và công bằng cho tất cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the first, second, etc. attempt",
                    "vi": "ở lần thử đầu tiên, thứ hai, v.v."
                },
                "examples": [
                    {
                        "en": "I passed my driving test first go.",
                        "vi": "Tôi đã vượt qua bài kiểm tra lái xe đầu tiên của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attack somebody physically",
                    "vi": "tấn công ai đó về mặt thể chất"
                },
                "examples": [
                    {
                        "en": "There were about seven of them standing round him, all waiting to have a go.",
                        "vi": "Có khoảng bảy người trong số họ đứng xung quanh anh ta, tất cả đều chờ được ra sân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an attempt to do something",
                    "vi": "cố gắng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘I can't start the engine.’ ‘Let me have a go.’",
                        "vi": "Tôi không thể nổ máy.' 'Hãy để tôi đi một chút.'"
                    },
                    {
                        "en": "I'll have a go at fixing it tonight.",
                        "vi": "Tôi sẽ phải sửa nó tối nay."
                    },
                    {
                        "en": "You should have a go at answering all the questions.",
                        "vi": "Bạn nên trả lời tất cả các câu hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody or complain about somebody",
                    "vi": "chỉ trích ai đó hoặc phàn nàn về ai đó"
                },
                "examples": [
                    {
                        "en": "The boss had a go at me for being late for work.",
                        "vi": "Ông chủ đã bắt tôi vì đi làm muộn."
                    },
                    {
                        "en": "The government are always having a go at teachers.",
                        "vi": "Chính phủ luôn có động thái đối với giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in the middle of an activity or a project",
                    "vi": "ở giữa một hoạt động hoặc một dự án"
                },
                "examples": [
                    {
                        "en": "The award-winning novelist often has three or four books on the go at once.",
                        "vi": "Tiểu thuyết gia từng đoạt giải thưởng thường có ba hoặc bốn cuốn sách trên đường đi cùng một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "all together on one occasion",
                    "vi": "tất cả cùng nhau vào một dịp"
                },
                "examples": [
                    {
                        "en": "I'd rather do the journey in one go, and not stop on the way.",
                        "vi": "Tôi muốn thực hiện cuộc hành trình một lần, và không dừng lại trên đường đi."
                    },
                    {
                        "en": "They ate the packet of biscuits all in one go.",
                        "vi": "Họ ăn hết gói bánh quy trong một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding on to something",
                    "vi": "ngừng giữ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Leave go of my arm—you're hurting me!",
                        "vi": "Bỏ cánh tay tôi ra - bạn đang làm tôi bị thương!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding somebody/something",
                    "vi": "ngừng giữ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Don't let go of the rope.",
                        "vi": "Đừng buông dây."
                    },
                    {
                        "en": "Don't let the rope go.",
                        "vi": "Đừng để tuột dây."
                    },
                    {
                        "en": "Let go! You're hurting me!",
                        "vi": "Đi thôi! Bạn đang làm tổn thương tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give up an idea or an attitude, or control of something",
                    "vi": "từ bỏ một ý tưởng hoặc một thái độ, hoặc kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It's time to let go of the past.",
                        "vi": "Đã đến lúc buông bỏ quá khứ."
                    },
                    {
                        "en": "It's time to let the past go.",
                        "vi": "Đã đến lúc để quá khứ trôi qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding somebody/something",
                    "vi": "ngừng giữ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Don't let the rope go.",
                        "vi": "Đừng để tuột dây."
                    },
                    {
                        "en": "Don't let go of the rope.",
                        "vi": "Đừng buông dây."
                    },
                    {
                        "en": "Let go! You're hurting me!",
                        "vi": "Đi thôi! Bạn đang làm tổn thương tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give up an idea or an attitude, or control of something",
                    "vi": "từ bỏ một ý tưởng hoặc một thái độ, hoặc kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It's time to let the past go.",
                        "vi": "Đã đến lúc để quá khứ trôi qua."
                    },
                    {
                        "en": "It's time to let go of the past.",
                        "vi": "Đã đến lúc buông bỏ quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful in something",
                    "vi": "để thành công trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We've had a few problems in our marriage, but we're both determined to make a go of it.",
                        "vi": "Chúng tôi đã có một vài vấn đề trong cuộc hôn nhân của mình, nhưng cả hai chúng tôi đều quyết tâm vượt qua nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9223f9ed53b492b9b0302bcb5b578dd",
        "word": "move",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/muːv/",
            "us": "/muːv/"
        },
        "nearby": [
            {
                "word": "movable feast",
                "pos": "noun"
            },
            {
                "word": "move",
                "pos": "verb"
            },
            {
                "word": "move",
                "pos": "noun"
            },
            {
                "word": "moveable",
                "pos": "adjective"
            },
            {
                "word": "move along",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a change of place or position",
                    "vi": "thay đổi địa điểm hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "Don't make a move!",
                        "vi": "Đừng di chuyển!"
                    },
                    {
                        "en": "Every move was painful.",
                        "vi": "Mỗi lần di chuyển đều đau đớn."
                    },
                    {
                        "en": "She felt he was watching her every move.",
                        "vi": "Cô cảm thấy anh đang theo dõi từng cử động của cô."
                    },
                    {
                        "en": "He performed some energetic dance moves.",
                        "vi": "Anh ấy đã thực hiện một số động tác vũ đạo tràn đầy năng lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of changing the place where you live or work",
                    "vi": "một hành động thay đổi nơi bạn sống hoặc làm việc"
                },
                "examples": [
                    {
                        "en": "What's the date of your move?",
                        "vi": "Ngày chuyển nhà của bạn là gì?"
                    },
                    {
                        "en": "Her new job is just a sideways move.",
                        "vi": "Công việc mới của cô ấy chỉ là một bước đi ngang."
                    },
                    {
                        "en": "move (from…) (to…) Their move from Italy to the US has not been a success.",
                        "vi": "chuyển (từ…) (đến…) Việc chuyển từ Ý sang Mỹ của họ đã không thành công."
                    },
                    {
                        "en": "He’s performed well since his move from Manchester United to Liverpool.",
                        "vi": "Anh ấy đã thể hiện rất tốt kể từ khi chuyển từ Manchester United sang Liverpool."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of changing the position of a piece in chess or other games that are played on a board",
                    "vi": "hành động thay đổi vị trí của quân cờ trong cờ vua hoặc các trò chơi khác được chơi trên bàn cờ"
                },
                "examples": [
                    {
                        "en": "The game was over in only six moves.",
                        "vi": "Trò chơi đã kết thúc chỉ trong sáu nước đi."
                    },
                    {
                        "en": "It's your move.",
                        "vi": "Đó là nước đi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action in a sport or game",
                    "vi": "một hành động trong một môn thể thao hoặc trò chơi"
                },
                "examples": [
                    {
                        "en": "In probably the best move of the game, Moseley scored the important try.",
                        "vi": "Trong nước đi có lẽ là tốt nhất của trận đấu, Moseley đã ghi bàn thắng trong nỗ lực quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action that you do or need to do to achieve something",
                    "vi": "một hành động mà bạn làm hoặc cần làm để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "Getting a job in marketing was a good career move.",
                        "vi": "Kiếm được một công việc trong lĩnh vực tiếp thị là một bước đi tốt trong sự nghiệp."
                    },
                    {
                        "en": "‘I'll give you 30 per cent off the price.’ Good move, I thought.",
                        "vi": "Tôi sẽ giảm giá cho bạn 30%.' Tốt, tôi nghĩ."
                    },
                    {
                        "en": "Hiring Kate was the best move we ever made.",
                        "vi": "Thuê Kate là động thái tốt nhất mà chúng tôi từng làm."
                    },
                    {
                        "en": "The decision to diversify is a smart move.",
                        "vi": "Quyết định đa dạng hóa là một bước đi thông minh."
                    },
                    {
                        "en": "a wise/shrewd/surprise move",
                        "vi": "một bước đi khôn ngoan / khôn ngoan / bất ngờ"
                    },
                    {
                        "en": "an unprecedented/unusual move",
                        "vi": "một động thái chưa từng có / bất thường"
                    },
                    {
                        "en": "move by somebody/something This latest move by the government has aroused fierce opposition.",
                        "vi": "di chuyển của ai đó / cái gì đó Động thái mới nhất này của chính phủ đã làm dấy lên sự phản đối gay gắt."
                    },
                    {
                        "en": "This was a bold move by the design team.",
                        "vi": "Đây là một bước đi táo bạo của nhóm thiết kế."
                    },
                    {
                        "en": "move to do something The management have made no move to settle the strike.",
                        "vi": "di chuyển để làm gì đó Ban quản lý không có động thái nào để giải quyết cuộc đình công."
                    },
                    {
                        "en": "Most traders welcomed the move to cut regulations.",
                        "vi": "Hầu hết các nhà giao dịch hoan nghênh động thái cắt giảm quy định."
                    },
                    {
                        "en": "to oppose/criticize/condemn a move",
                        "vi": "phản đối / chỉ trích / lên án một động thái"
                    }
                ]
            },
            {
                "define": {
                    "en": "a change in ideas, attitudes or behaviour",
                    "vi": "sự thay đổi trong ý tưởng, thái độ hoặc hành vi"
                },
                "examples": [
                    {
                        "en": "move away from something There has been a move away from nuclear energy.",
                        "vi": "di chuyển khỏi một cái gì đó Đã có một sự di chuyển khỏi năng lượng hạt nhân."
                    },
                    {
                        "en": "move (back) to something The effects of the move back to written examinations are not known.",
                        "vi": "di chuyển (quay lại) một cái gì đó Tác động của việc di chuyển trở lại các kỳ thi viết không được biết đến."
                    },
                    {
                        "en": "The high milk price was a factor in our move to organic.",
                        "vi": "Giá sữa cao là một yếu tố khiến chúng tôi chuyển sang sản phẩm hữu cơ."
                    },
                    {
                        "en": "move towards something There are moves towards greater trade liberalization.",
                        "vi": "tiến tới một cái gì đó Có những động thái hướng tới tự do hóa thương mại nhiều hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be travelling from place to place",
                    "vi": "đi du lịch từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "His career as a petroleum engineer has kept him on the move.",
                        "vi": "Sự nghiệp của một kỹ sư dầu khí đã giúp anh luôn thăng tiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be moving; to be going somewhere",
                    "vi": "được di chuyển; đi đâu đó"
                },
                "examples": [
                    {
                        "en": "The car was already on the move.",
                        "vi": "Chiếc xe đã được di chuyển."
                    },
                    {
                        "en": "The firm is on the move to larger offices.",
                        "vi": "Công ty đang chuyển sang các văn phòng lớn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very active and busy",
                    "vi": "rất năng động và bận rộn"
                },
                "examples": [
                    {
                        "en": "I've been on the move all day.",
                        "vi": "Tôi đã di chuyển cả ngày."
                    },
                    {
                        "en": "Having four children keeps her on the move.",
                        "vi": "Có bốn đứa con giúp cô luôn di chuyển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dance",
                    "vi": "nhảy"
                },
                "examples": [
                    {
                        "en": "I'm the sort of guy who loves to bust out some moves at a party.",
                        "vi": "Tôi là loại người thích tung ra một số động tác trong một bữa tiệc."
                    },
                    {
                        "en": "The actress was seen busting a move with her friends in a London nightclub.",
                        "vi": "Nữ diễn viên bị bắt gặp đang tung tăng cùng bạn bè trong một hộp đêm ở London."
                    }
                ]
            },
            {
                "define": {
                    "en": "you tell somebody to get a move on when you want them to hurry",
                    "vi": "bạn bảo ai đó di chuyển khi bạn muốn họ nhanh lên"
                },
                "examples": [
                    {
                        "en": "We're leaving in five minutes so you'd better get a move on!",
                        "vi": "Chúng tôi sẽ rời đi trong năm phút nữa, vì vậy tốt hơn hết bạn nên đi tiếp!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something before somebody else, for example in order to end an argument or to begin something",
                    "vi": "để làm điều gì đó trước người khác, chẳng hạn như để kết thúc một cuộc tranh cãi hoặc để bắt đầu một điều gì đó"
                },
                "examples": [
                    {
                        "en": "If he wants to see me, he should make the first move.",
                        "vi": "Nếu anh ấy muốn gặp tôi, anh ấy nên ra tay trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin a journey or a task",
                    "vi": "để bắt đầu một cuộc hành trình hoặc một nhiệm vụ"
                },
                "examples": [
                    {
                        "en": "It's getting late—we'd better make a move.",
                        "vi": "Đã muộn rồi — tốt hơn là chúng ta nên di chuyển."
                    },
                    {
                        "en": "We should make a move — it's really late.",
                        "vi": "Chúng ta nên di chuyển - đã muộn lắm rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do the action that you intend to do or need to do in order to achieve something",
                    "vi": "thực hiện hành động mà bạn dự định làm hoặc cần làm để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The rebels waited until nightfall before they made their move.",
                        "vi": "Những người nổi dậy đã đợi cho đến khi màn đêm buông xuống trước khi họ ra tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to start a sexual relationship with somebody",
                    "vi": "cố gắng bắt đầu một mối quan hệ tình dục với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to pass somebody who is in front of you in a race",
                    "vi": "cố gắng vượt qua ai đó trước mặt bạn trong một cuộc đua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "51bd3e9202a0449da835cd0ea373d181",
        "word": "piece",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/piːs/",
            "us": "/piːs/"
        },
        "nearby": [
            {
                "word": "piebald",
                "pos": "noun"
            },
            {
                "word": "piebald",
                "pos": "adjective"
            },
            {
                "word": "piece",
                "pos": "noun"
            },
            {
                "word": "piece",
                "pos": "verb"
            },
            {
                "word": "pièce de résistance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of something that has been cut or separated from the rest of it; a standard amount of something",
                    "vi": "một lượng thứ gì đó đã bị cắt hoặc tách khỏi phần còn lại của nó; một lượng tiêu chuẩn của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "piece of something She wrote something on a small piece of paper.",
                        "vi": "mảnh gì đó Cô ấy viết gì đó trên một mảnh giấy nhỏ."
                    },
                    {
                        "en": "a piece of wood/metal",
                        "vi": "một mảnh gỗ / kim loại"
                    },
                    {
                        "en": "a large piece of land",
                        "vi": "một mảnh đất rộng lớn"
                    },
                    {
                        "en": "a piece of cake",
                        "vi": "một miếng bánh"
                    },
                    {
                        "en": "a piece of cheese/meat/bread",
                        "vi": "một miếng pho mát / thịt / bánh mì"
                    },
                    {
                        "en": "I've got a piece of grit in my eye.",
                        "vi": "Tôi có một mảnh vụn trong mắt."
                    },
                    {
                        "en": "a small/little/tiny piece of something",
                        "vi": "một mảnh nhỏ / nhỏ / nhỏ của thứ gì đó"
                    },
                    {
                        "en": "into pieces He cut the pizza into bite-sized pieces.",
                        "vi": "thành từng miếng Anh ấy cắt bánh pizza thành những miếng vừa ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the bits or parts that something breaks into",
                    "vi": "một trong những bit hoặc bộ phận mà thứ gì đó đột nhập vào"
                },
                "examples": [
                    {
                        "en": "piece of something There were tiny pieces of glass all over the road.",
                        "vi": "mảnh vỡ Có những mảnh kính nhỏ trên khắp con đường."
                    },
                    {
                        "en": "to pieces The boat had been smashed to pieces on the rocks.",
                        "vi": "thành từng mảnh Con thuyền đã bị đập thành từng mảnh trên đá."
                    },
                    {
                        "en": "The building was blown to pieces.",
                        "vi": "Tòa nhà bị nổ tung thành từng mảnh."
                    },
                    {
                        "en": "tear/rip something to pieces",
                        "vi": "xé / xé một cái gì đó thành nhiều mảnh"
                    },
                    {
                        "en": "in pieces The vase lay in pieces in the floor.",
                        "vi": "thành từng mảnh Chiếc bình nằm thành từng mảnh trên sàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the parts that something is made of",
                    "vi": "một trong những bộ phận mà một cái gì đó được làm bằng"
                },
                "examples": [
                    {
                        "en": "to pieces He took the clock to pieces.",
                        "vi": "thành từng mảnh Anh ta lấy đồng hồ ra từng mảnh."
                    },
                    {
                        "en": "piece of something a missing piece of the puzzle",
                        "vi": "mảnh ghép của một thứ gì đó còn thiếu một mảnh ghép"
                    },
                    {
                        "en": "The bridge was taken down piece by piece.",
                        "vi": "Cây cầu đã bị hạ gục từng mảnh."
                    },
                    {
                        "en": "She's been doing a 500-piece jigsaw.",
                        "vi": "Cô ấy đang ghép hình 500 mảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a single item of a particular type, especially one that forms part of a set",
                    "vi": "một mục duy nhất của một loại cụ thể, đặc biệt là một mục tạo thành một phần của tập hợp"
                },
                "examples": [
                    {
                        "en": "a piece of equipment/furniture",
                        "vi": "một phần thiết bị / đồ nội thất"
                    },
                    {
                        "en": "a piece of clothing/luggage",
                        "vi": "một bộ quần áo / hành lý"
                    },
                    {
                        "en": "a piece of machinery",
                        "vi": "một phần của máy móc"
                    },
                    {
                        "en": "a 28-piece dinner service",
                        "vi": "dịch vụ ăn tối 28 món"
                    }
                ]
            },
            {
                "define": {
                    "en": "used with many uncountable nouns to describe a single example or an amount of something",
                    "vi": "được sử dụng với nhiều danh từ không đếm được để mô tả một ví dụ đơn lẻ hoặc một số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a piece of information/evidence/advice/news/legislation",
                        "vi": "một phần thông tin / bằng chứng / lời khuyên / tin tức / luật pháp"
                    },
                    {
                        "en": "a piece of software",
                        "vi": "một phần mềm"
                    },
                    {
                        "en": "This is a superb piece of work.",
                        "vi": "Đây là một tác phẩm tuyệt vời."
                    },
                    {
                        "en": "It was an interesting piece of research.",
                        "vi": "Đó là một nghiên cứu thú vị."
                    },
                    {
                        "en": "The building is a piece of history (= of historical interest or importance).",
                        "vi": "Tòa nhà là một phần của lịch sử (= lợi ích hoặc tầm quan trọng của lịch sử)."
                    },
                    {
                        "en": "Isn't that a piece of luck?",
                        "vi": "Đó không phải là một phần may mắn sao?"
                    },
                    {
                        "en": "You should eat at least two pieces of fruit a day.",
                        "vi": "Bạn nên ăn ít nhất hai miếng trái cây mỗi ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a single item of writing, art, music, etc. that somebody has produced or created; a short item of writing from a longer work",
                    "vi": "một mục duy nhất của văn bản, nghệ thuật, âm nhạc, v.v. mà ai đó đã sản xuất hoặc tạo ra; một mục ngắn của văn bản từ một tác phẩm dài hơn"
                },
                "examples": [
                    {
                        "en": "piece of something a piece of music/art",
                        "vi": "một phần của cái gì đó một bản nhạc / nghệ thuật"
                    },
                    {
                        "en": "a fine piece of writing",
                        "vi": "một đoạn văn tốt"
                    },
                    {
                        "en": "They performed pieces by Bach and Handel.",
                        "vi": "Họ biểu diễn các tác phẩm của Bach và Handel."
                    },
                    {
                        "en": "The painting is a companion piece to (= is closely related to and intended to be displayed with) an earlier work.",
                        "vi": "Bức tranh là một tác phẩm đồng hành với (= có liên quan chặt chẽ với và dự định được trưng bày cùng) một tác phẩm trước đó."
                    },
                    {
                        "en": "(formal) They have some beautiful pieces (= works of art, etc.) in their home.",
                        "vi": "(trang trọng) Họ có một số tác phẩm đẹp (= tác phẩm nghệ thuật, v.v.) trong nhà của họ."
                    },
                    {
                        "en": "piece from something She read a piece from ‘Alice in Wonderland’.",
                        "vi": "một đoạn từ thứ gì đó Cô ấy đã đọc một đoạn trong 'Alice ở xứ sở thần tiên'."
                    }
                ]
            },
            {
                "define": {
                    "en": "an article in a newspaper or magazine or a broadcast on television or radio",
                    "vi": "một bài báo trên báo hoặc tạp chí hoặc chương trình phát sóng trên truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "The Washington Post ran a series of opinion pieces criticizing the policy.",
                        "vi": "Washington Post đã đăng một loạt các ý kiến chỉ trích chính sách này."
                    },
                    {
                        "en": "piece about/on something Did you see her piece about the internet in the paper today?",
                        "vi": "bài về / về điều gì đó Bạn có thấy bài viết của cô ấy về internet trên báo hôm nay không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a coin of the value mentioned",
                    "vi": "một đồng tiền có giá trị được đề cập"
                },
                "examples": [
                    {
                        "en": "a 50p piece",
                        "vi": "một mảnh 50p"
                    },
                    {
                        "en": "a five-cent piece",
                        "vi": "một miếng năm xu"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the small figures or objects that you move around in games such as chess",
                    "vi": "một trong những hình hoặc đồ vật nhỏ mà bạn di chuyển trong các trò chơi như cờ vua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part or share of something",
                    "vi": "một phần hoặc chia sẻ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "companies seeking a piece of the market",
                        "vi": "các công ty đang tìm kiếm một phần của thị trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "a gun",
                    "vi": "một khẩu súng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short distance",
                    "vi": "một khoảng cách ngắn"
                },
                "examples": [
                    {
                        "en": "She lives down the road a piece from here.",
                        "vi": "Cô ấy sống cách đây một đoạn đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "small objects or items of various kinds",
                    "vi": "các đồ vật nhỏ hoặc các loại vật phẩm khác nhau"
                },
                "examples": [
                    {
                        "en": "She stuffed all her bits and pieces into a bag and left.",
                        "vi": "Cô ấy nhét tất cả những thứ của mình vào một chiếc túi và rời đi."
                    },
                    {
                        "en": "I just need to get a few bits and pieces at the supermarket.",
                        "vi": "Tôi chỉ cần lấy một vài mảnh vụn ở siêu thị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use bombs or other weapons to destroy somebody/something completely",
                    "vi": "sử dụng bom hoặc vũ khí khác để tiêu diệt hoàn toàn ai đó / thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The plane was blown to pieces when the bomb exploded.",
                        "vi": "Chiếc máy bay bị nổ tung khi quả bom phát nổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very old and in bad condition because of long use",
                    "vi": "trở nên rất cũ và trong tình trạng xấu do sử dụng lâu dài"
                },
                "examples": [
                    {
                        "en": "Our car is falling to pieces, we've had it so long.",
                        "vi": "Chiếc xe của chúng tôi đang rơi ra từng mảnh, chúng tôi đã có nó quá lâu."
                    },
                    {
                        "en": "My old dictionary is falling to pieces.",
                        "vi": "Từ điển cũ của tôi đang rơi ra từng mảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop working; to be destroyed",
                    "vi": "ngừng hoạt động; Bị phá hủy"
                },
                "examples": [
                    {
                        "en": "He's worried the business will fall to pieces without him.",
                        "vi": "Anh ấy lo lắng việc kinh doanh sẽ tan rã nếu không có anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody that you think their behaviour is bad or are angry with them",
                    "vi": "nói với ai đó rằng bạn nghĩ hành vi của họ là xấu hoặc đang tức giận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be so upset or afraid that you cannot manage to live or work normally",
                    "vi": "buồn bã hoặc sợ hãi đến mức bạn không thể xoay sở để sống hoặc làm việc bình thường"
                },
                "examples": [
                    {
                        "en": "After his wife died he just went to pieces.",
                        "vi": "Sau khi vợ chết, anh ta tan thành từng mảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is no definite answer to a question",
                    "vi": "được sử dụng để nói rằng không có câu trả lời chắc chắn cho một câu hỏi"
                },
                "examples": [
                    {
                        "en": "‘How long will it take?’ ‘How long's a piece of string?’",
                        "vi": "Làm cái đó mất bao lâu?' 'Một đoạn dây dài bao nhiêu?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "safe; not damaged or hurt, especially after a journey or dangerous experience",
                    "vi": "an toàn; không bị hư hỏng hoặc tổn thương, đặc biệt là sau một cuộc hành trình hoặc trải nghiệm nguy hiểm"
                },
                "examples": [
                    {
                        "en": "They were lucky to get home in one piece.",
                        "vi": "Họ đã may mắn về được nhà trong một mảnh đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is unpleasant, unkind or dishonest",
                    "vi": "một người khó ưa, không tử tế hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Don’t trust him; he’s a nasty piece of work.",
                        "vi": "Đừng tin tưởng anh ta; anh ấy là một công việc khó chịu."
                    },
                    {
                        "en": "He's a thoroughly nasty piece of work.",
                        "vi": "Anh ta là một công việc hoàn toàn khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the same or similar",
                    "vi": "tất cả giống nhau hoặc tương tự"
                },
                "examples": [
                    {
                        "en": "The houses are all of a piece.",
                        "vi": "Các ngôi nhà đều là một mảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "all at the same time",
                    "vi": "Tất cả cùng một lúc"
                },
                "examples": [
                    {
                        "en": "The house was built all of a piece in 1754.",
                        "vi": "Ngôi nhà được xây dựng toàn bộ vào năm 1754."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to return or to help somebody return to a normal situation, particularly after a shock or a disaster",
                    "vi": "để trở lại hoặc để giúp ai đó trở lại tình trạng bình thường, đặc biệt là sau một cú sốc hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "You cannot live your children's lives for them; you can only be there to pick up the pieces when things go wrong.",
                        "vi": "Bạn không thể sống cuộc sống của con cái bạn cho chúng; bạn chỉ có thể ở đó để nhặt từng mảnh khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is very easy to do",
                    "vi": "một điều rất dễ làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a share of the available money or benefits that you believe you have a right to",
                    "vi": "một phần tiền hoặc lợi ích hiện có mà bạn tin rằng bạn có quyền"
                },
                "examples": [
                    {
                        "en": "The company is demanding a larger slice of the corporate pie.",
                        "vi": "Công ty đang đòi hỏi một phần lớn hơn trong miếng bánh doanh nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is very easy to do",
                    "vi": "một điều rất dễ làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express the fact that you admire somebody or find them funny, often when they have done something that surprises you",
                    "vi": "được sử dụng để bày tỏ sự thật rằng bạn ngưỡng mộ ai đó hoặc thấy họ buồn cười, thường là khi họ đã làm điều gì đó khiến bạn ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "You're some piece of work, Jack, do you know that?",
                        "vi": "Anh là một công việc, Jack, anh có biết không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a share or role in an interesting or exciting activity, especially one that makes money",
                    "vi": "một chia sẻ hoặc vai trò trong một hoạt động thú vị hoặc hấp dẫn, đặc biệt là một hoạt động kiếm tiền"
                },
                "examples": [
                    {
                        "en": "Foreign firms will all want a piece of the action if the new airport goes ahead.",
                        "vi": "Tất cả các công ty nước ngoài sẽ muốn có một phần hành động nếu sân bay mới đi vào hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say exactly what you feel or think",
                    "vi": "nói chính xác những gì bạn cảm thấy hoặc suy nghĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person or thing that is responsible for all the trouble in a situation",
                    "vi": "người hoặc vật chịu trách nhiệm cho tất cả các rắc rối trong một tình huống"
                },
                "examples": [
                    {
                        "en": "It’s hard to identify the real villain of the piece in this case.",
                        "vi": "Thật khó để xác định nhân vật phản diện thực sự của tác phẩm trong trường hợp này."
                    }
                ]
            }
        ]
    },
    {
        "id": "288a7b93cebe4bc28119bee7e6aa94b4",
        "word": "puzzle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpʌzl/",
            "us": "/ˈpʌzl/"
        },
        "nearby": [
            {
                "word": "putz",
                "pos": "verb"
            },
            {
                "word": "putz",
                "pos": "noun"
            },
            {
                "word": "puzzle",
                "pos": "noun"
            },
            {
                "word": "puzzle",
                "pos": "verb"
            },
            {
                "word": "puzzled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game, etc. that you have to think about carefully in order to answer it or do it",
                    "vi": "một trò chơi, v.v. mà bạn phải suy nghĩ cẩn thận để trả lời hoặc thực hiện nó"
                },
                "examples": [
                    {
                        "en": "a crossword puzzle",
                        "vi": "một câu đố ô chữ"
                    },
                    {
                        "en": "a book of puzzles for children",
                        "vi": "một cuốn sách câu đố cho trẻ em"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is difficult to understand or explain",
                    "vi": "điều gì đó khó hiểu hoặc khó giải thích"
                },
                "examples": [
                    {
                        "en": "The deeper meaning of the poem remains a puzzle.",
                        "vi": "Ý nghĩa sâu xa hơn của bài thơ vẫn còn là một câu đố."
                    },
                    {
                        "en": "The detectives were beginning to solve the murder. All the pieces in the puzzle were falling neatly into place.",
                        "vi": "Các thám tử đang bắt đầu giải quyết vụ giết người. Tất cả các mảnh ghép trong câu đố đã nằm gọn gàng vào vị trí."
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture printed on cardboard (= very thick, stiff card) or wood, that has been cut up into a lot of small pieces of different shapes that you have to fit together again",
                    "vi": "một bức tranh in trên bìa cứng (= thẻ rất dày, cứng) hoặc gỗ, đã được cắt thành nhiều mảnh nhỏ có hình dạng khác nhau mà bạn phải ghép lại với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2081793b49a04887aa465ae1fdb31158",
        "word": "dice",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/daɪs/",
            "us": "/daɪs/"
        },
        "nearby": [
            {
                "word": "diazepam",
                "pos": "noun"
            },
            {
                "word": "dibs",
                "pos": "noun"
            },
            {
                "word": "dice",
                "pos": "noun"
            },
            {
                "word": "dice",
                "pos": "verb"
            },
            {
                "word": "dicey",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small cube of wood, plastic, etc., with a different number of spots on each of its sides, used in games of chance",
                    "vi": "một khối nhỏ bằng gỗ, nhựa, v.v., với một số điểm khác nhau trên mỗi mặt của nó, được sử dụng trong các trò chơi may rủi"
                },
                "examples": [
                    {
                        "en": "a pair of dice",
                        "vi": "một cặp xúc xắc"
                    },
                    {
                        "en": "to roll/throw/shake the dice",
                        "vi": "lăn / ném / lắc xúc xắc"
                    },
                    {
                        "en": "You decide who’s going to start by throwing the dice.",
                        "vi": "Bạn quyết định ai sẽ bắt đầu bằng cách ném xúc xắc."
                    },
                    {
                        "en": "You move forward according to the number on the dice.",
                        "vi": "Bạn tiến lên theo số trên viên xúc xắc."
                    },
                    {
                        "en": "(figurative) It was a last desperate throw of the dice to save his marriage.",
                        "vi": "(nghĩa bóng) Đó là lần ném xúc xắc cuối cùng trong tuyệt vọng để cứu lấy cuộc hôn nhân của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game played with dice",
                    "vi": "một trò chơi chơi với xúc xắc"
                },
                "examples": [
                    {
                        "en": "We played dice all night.",
                        "vi": "Chúng tôi đã chơi xúc xắc suốt đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody at an unfair disadvantage/advantage",
                    "vi": "đặt ai đó vào thế bất lợi / lợi thế không công bằng"
                },
                "examples": [
                    {
                        "en": "He has always felt that the dice were loaded against him in life.",
                        "vi": "Anh luôn cảm thấy rằng những viên xúc xắc đã chống lại anh trong cuộc sống."
                    },
                    {
                        "en": "This is another attempt to load the dice in favour of employers.",
                        "vi": "Đây là một nỗ lực khác để nạp xúc xắc có lợi cho người sử dụng lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you refuse to do something, or that something cannot be done",
                    "vi": "được sử dụng để thể hiện rằng bạn từ chối làm điều gì đó, hoặc điều gì đó không thể được thực hiện"
                },
                "examples": [
                    {
                        "en": "He wanted $400 for it, so no dice.",
                        "vi": "Anh ta muốn 400 đô la cho nó, vì vậy không có xúc xắc."
                    }
                ]
            }
        ]
    },
    {
        "id": "3089ed488c924917940c09b0f65a0edc",
        "word": "monopoly",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈnɒpəli/",
            "us": "/məˈnɑːpəli/"
        },
        "nearby": [
            {
                "word": "monopolization",
                "pos": "noun"
            },
            {
                "word": "monopolize",
                "pos": "verb"
            },
            {
                "word": "monopoly",
                "pos": "noun"
            },
            {
                "word": "Monopoly money",
                "pos": "noun"
            },
            {
                "word": "monorail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the complete control of trade in particular goods or the supply of a particular service; a type of goods or a service that is controlled in this way",
                    "vi": "kiểm soát hoàn toàn thương mại đối với hàng hóa cụ thể hoặc việc cung cấp một dịch vụ cụ thể; một loại hàng hóa hoặc một dịch vụ được kiểm soát theo cách này"
                },
                "examples": [
                    {
                        "en": "In the past central government had a monopoly on television broadcasting.",
                        "vi": "Trong quá khứ, chính quyền trung ương đã độc quyền về phát sóng truyền hình."
                    },
                    {
                        "en": "Electricity, gas and water were considered to be natural monopolies.",
                        "vi": "Điện, khí đốt và nước được coi là độc quyền tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the complete control, possession or use of something; a thing that belongs only to one person or group and that other people cannot share",
                    "vi": "hoàn toàn kiểm soát, sở hữu hoặc sử dụng một cái gì đó; một thứ chỉ thuộc về một người hoặc một nhóm và những người khác không thể chia sẻ"
                },
                "examples": [
                    {
                        "en": "Managers do not have a monopoly on stress.",
                        "vi": "Các nhà quản lý không có độc quyền về căng thẳng."
                    },
                    {
                        "en": "A good education should not be the monopoly of the rich.",
                        "vi": "Một nền giáo dục tốt không nên là độc quyền của người giàu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a board game in which players have to pretend to buy and sell land and houses, using pieces of paper that look like money",
                    "vi": "một trò chơi hội đồng trong đó người chơi phải giả vờ mua và bán đất và nhà, sử dụng các mảnh giấy trông giống như tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a9916011afb64da199ca51d4c7ff609e",
        "word": "backgammon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbækɡæmən/",
            "us": "/ˈbækɡæmən/"
        },
        "nearby": [
            {
                "word": "backflip",
                "pos": "noun"
            },
            {
                "word": "back-formation",
                "pos": "noun"
            },
            {
                "word": "backgammon",
                "pos": "noun"
            },
            {
                "word": "background",
                "pos": "noun"
            },
            {
                "word": "backhand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two people played on a board marked with long thin triangles. Players throw dice and move pieces around the board.",
                    "vi": "một trò chơi dành cho hai người chơi trên một bảng được đánh dấu bằng các hình tam giác dài và mỏng. Người chơi ném xúc xắc và di chuyển các quân cờ xung quanh bàn cờ."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "03682aeaac9b43ea872cc42c1b1dc224",
        "word": "bagatelle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbæɡəˈtel/",
            "us": "/ˌbæɡəˈtel/"
        },
        "nearby": [
            {
                "word": "bag",
                "pos": "noun"
            },
            {
                "word": "bag",
                "pos": "verb"
            },
            {
                "word": "bagatelle",
                "pos": "noun"
            },
            {
                "word": "Walter Bagehot",
                "pos": ""
            },
            {
                "word": "bagel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game played on a board with small balls that you try to hit into holes",
                    "vi": "một trò chơi được chơi trên bảng với những quả bóng nhỏ mà bạn cố gắng đánh vào lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small or unimportant thing or amount",
                    "vi": "một thứ hoặc số lượng nhỏ hoặc không quan trọng"
                },
                "examples": [
                    {
                        "en": "It cost a mere bagatelle.",
                        "vi": "Nó chỉ tốn một chiếc bánh mì tròn."
                    }
                ]
            }
        ]
    },
    {
        "id": "58632e033fad450083c0086abec1daff",
        "word": "bishop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪʃəp/",
            "us": "/ˈbɪʃəp/"
        },
        "nearby": [
            {
                "word": "bisexual",
                "pos": "noun"
            },
            {
                "word": "bisexuality",
                "pos": "noun"
            },
            {
                "word": "bishop",
                "pos": "noun"
            },
            {
                "word": "bishopric",
                "pos": "noun"
            },
            {
                "word": "Bismarck",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a senior priest in charge of the work of the Church in a city or district",
                    "vi": "một linh mục cao cấp phụ trách công việc của Giáo hội trong một thành phố hoặc quận"
                },
                "examples": [
                    {
                        "en": "the Bishop of Oxford",
                        "vi": "Giám mục của Oxford"
                    },
                    {
                        "en": "Bishop Pritchard",
                        "vi": "Bishop Pritchard"
                    },
                    {
                        "en": "He was appointed Bishop of Ely.",
                        "vi": "Ông được bổ nhiệm làm Giám mục của Ely."
                    },
                    {
                        "en": "He’s the diocesan bishop and he has three suffragan bishops to help him.",
                        "vi": "Ông ấy là giám mục giáo phận và ông ấy có ba giám mục đủ quyền để giúp đỡ ông ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece used in the game of chess that is like a bishop’s hat in shape and can move any number of squares in a diagonal line",
                    "vi": "một quân cờ được sử dụng trong trò chơi cờ vua có hình dạng giống như một chiếc mũ của giám mục và có thể di chuyển bất kỳ số ô vuông nào trên một đường chéo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6088724aba8c4dce8ea3634a3d107a45",
        "word": "castle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑːsl/",
            "us": "/ˈkæsl/"
        },
        "nearby": [
            {
                "word": "cast iron",
                "pos": "noun"
            },
            {
                "word": "cast-iron",
                "pos": "adjective"
            },
            {
                "word": "castle",
                "pos": "noun"
            },
            {
                "word": "Barbara Castle",
                "pos": ""
            },
            {
                "word": "Castle Howard",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large strong building with thick, high walls and towers, built in the past by kings or queens, or other important people, to defend themselves against attack",
                    "vi": "một tòa nhà lớn kiên cố với những bức tường và tháp cao, dày, được xây dựng trong quá khứ bởi các vị vua hoặc hoàng hậu, hoặc những người quan trọng khác, để tự vệ trước sự tấn công"
                },
                "examples": [
                    {
                        "en": "a medieval castle",
                        "vi": "một lâu đài thời trung cổ"
                    },
                    {
                        "en": "Windsor Castle",
                        "vi": "Lâu đài Windsor"
                    },
                    {
                        "en": "in/at the castle They were invited to a banquet in the castle.",
                        "vi": "trong / tại lâu đài Họ được mời đến một bữa tiệc trong lâu đài."
                    },
                    {
                        "en": "They sought safety within the castle walls.",
                        "vi": "Họ tìm kiếm sự an toàn trong các bức tường lâu đài."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four pieces placed in the corner squares of the board at the start of the game, usually made to look like a castle",
                    "vi": "bất kỳ quân nào trong số bốn quân cờ được đặt trong các ô vuông góc của bàn cờ khi bắt đầu trò chơi, thường được làm để trông giống như một lâu đài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to have) plans or dreams that are not likely to happen or come true",
                    "vi": "(có) kế hoạch hoặc ước mơ không có khả năng xảy ra hoặc trở thành hiện thực"
                },
                "examples": [
                    {
                        "en": "As a child he would wander round the boatyards, building castles in the air about owning a boat one day.",
                        "vi": "Khi còn là một đứa trẻ, ông thường đi lang thang quanh các xưởng đóng thuyền, xây dựng các lâu đài trên không trung và sở hữu một chiếc thuyền vào một ngày nào đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s home is a place where they can be private and safe and do as they like",
                    "vi": "nhà của một người là nơi mà họ có thể riêng tư và an toàn và làm theo ý thích của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1dc35b9ee1e34c07a65bb374d173c75d",
        "word": "check",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃek/",
            "us": "/tʃek/"
        },
        "nearby": [
            {
                "word": "cheat sheet",
                "pos": "noun"
            },
            {
                "word": "check",
                "pos": "verb"
            },
            {
                "word": "check",
                "pos": "noun"
            },
            {
                "word": "check",
                "pos": "exclamation"
            },
            {
                "word": "checkbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of making sure that something is safe, correct or in good condition by examining it",
                    "vi": "một hành động đảm bảo rằng một cái gì đó an toàn, chính xác hoặc trong tình trạng tốt bằng cách kiểm tra nó"
                },
                "examples": [
                    {
                        "en": "Could you give the tyres a check?",
                        "vi": "Bạn có thể kiểm tra lốp xe được không?"
                    },
                    {
                        "en": "I went for a health check before going on the trip.",
                        "vi": "Tôi đã đi kiểm tra sức khỏe trước khi lên đường."
                    },
                    {
                        "en": "The drugs were found in their car during a routine check by police.",
                        "vi": "Ma túy được tìm thấy trong xe của họ trong một cuộc kiểm tra định kỳ của cảnh sát."
                    },
                    {
                        "en": "I'll just have a quick check to see if the letter's arrived yet.",
                        "vi": "Tôi sẽ kiểm tra nhanh xem thư đã đến chưa."
                    },
                    {
                        "en": "check of something She had a thorough check of the room, but nothing had been taken.",
                        "vi": "kiểm tra một cái gì đó Cô đã kiểm tra kỹ lưỡng căn phòng, nhưng không có gì được lấy."
                    },
                    {
                        "en": "check for something a check for spelling mistakes",
                        "vi": "kiểm tra cái gì đó kiểm tra lỗi chính tả"
                    },
                    {
                        "en": "check on something It is vital to keep a check on your speed (= look at it regularly in order to control it).",
                        "vi": "kiểm tra điều gì đó Điều quan trọng là phải kiểm tra tốc độ của bạn (= xem xét nó thường xuyên để kiểm soát nó)."
                    },
                    {
                        "en": "I did a final check on the seating arrangements.",
                        "vi": "Tôi đã kiểm tra lần cuối về việc sắp xếp chỗ ngồi."
                    },
                    {
                        "en": "check with somebody A check with the doctor confirmed his fears.",
                        "vi": "kiểm tra với ai đó Một cuộc kiểm tra với bác sĩ xác nhận nỗi sợ hãi của anh ta."
                    },
                    {
                        "en": "A spokesperson said the company made regular checks with the police and the council.",
                        "vi": "Người phát ngôn cho biết công ty đã kiểm tra thường xuyên với cảnh sát và hội đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an investigation to find out more information about somebody/something",
                    "vi": "một cuộc điều tra để tìm hiểu thêm thông tin về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The agency insisted all the necessary background checks had been carried out.",
                        "vi": "Cơ quan này khẳng định tất cả các cuộc kiểm tra lý lịch cần thiết đã được thực hiện."
                    },
                    {
                        "en": "Security checks were causing long delays at border crossings.",
                        "vi": "Việc kiểm tra an ninh đã gây ra sự chậm trễ kéo dài tại các cửa khẩu biên giới."
                    },
                    {
                        "en": "check on somebody/something The police ran a check on the registration number of the car.",
                        "vi": "check on somebody / something Cảnh sát đã kiểm tra số đăng ký của chiếc xe."
                    },
                    {
                        "en": "Was any check made on Mr Morris when he applied for the post?",
                        "vi": "Ông Morris có kiểm tra gì khi ông ấy nộp đơn đăng ký không?"
                    },
                    {
                        "en": "We're running a police check on all applicants for the job.",
                        "vi": "Chúng tôi đang tiến hành một cuộc kiểm tra của cảnh sát đối với tất cả những người nộp đơn xin việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark (✓) put next to a sum or an item on a list, usually to show that it has been checked or done or is correct",
                    "vi": "một dấu (✓) đặt bên cạnh một tổng hoặc một mục trên danh sách, thường để cho thấy rằng nó đã được kiểm tra hoặc hoàn thành hoặc là đúng"
                },
                "examples": [
                    {
                        "en": "The teacher put a check next to his name.",
                        "vi": "Giáo viên đặt một tấm séc bên cạnh tên anh ta."
                    },
                    {
                        "en": "If there are no checks in the boxes, you have successfully unsubscribed.",
                        "vi": "Nếu không có dấu kiểm trong các hộp, bạn đã hủy đăng ký thành công."
                    },
                    {
                        "en": "Place a check beside each characteristic that you feel that you possess.",
                        "vi": "Đặt một tấm séc bên cạnh mỗi đặc điểm mà bạn cảm thấy rằng bạn có."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper that shows how much you have to pay for the food and drinks that you have had in a restaurant",
                    "vi": "một mảnh giấy cho biết bạn phải trả bao nhiêu cho đồ ăn và thức uống mà bạn đã dùng trong một nhà hàng"
                },
                "examples": [
                    {
                        "en": "Can I have the check, please?",
                        "vi": "Cho tôi xin cái séc được không?"
                    },
                    {
                        "en": "Tess asked for the check and handed the waiter a credit card.",
                        "vi": "Tess yêu cầu séc và đưa thẻ tín dụng cho người phục vụ."
                    },
                    {
                        "en": "I paid the check for the dinner.",
                        "vi": "Tôi đã trả séc cho bữa tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a printed form that you can write on and sign as a way of paying for something instead of using money",
                    "vi": "một biểu mẫu in mà bạn có thể viết và ký tên như một cách thanh toán cho một thứ gì đó thay vì sử dụng tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that delays the progress of something else or stops it from getting worse",
                    "vi": "thứ gì đó làm trì hoãn tiến trình của thứ khác hoặc ngăn nó trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "A cold spring will provide a natural check on the number of insects.",
                        "vi": "Mùa xuân lạnh sẽ giúp kiểm tra số lượng côn trùng một cách tự nhiên."
                    },
                    {
                        "en": "the most fundamental check to the power of the British monarchy",
                        "vi": "kiểm tra cơ bản nhất đối với quyền lực của chế độ quân chủ Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "rules that are designed to control the amount of power, especially political power, that one person or group has",
                    "vi": "các quy tắc được thiết kế để kiểm soát lượng quyền lực, đặc biệt là quyền lực chính trị, mà một người hoặc một nhóm có"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a pattern of squares, usually of two colours",
                    "vi": "một mô hình hình vuông, thường có hai màu"
                },
                "examples": [
                    {
                        "en": "Do you prefer checks or stripes?",
                        "vi": "Bạn thích séc hay sọc?"
                    },
                    {
                        "en": "a check shirt/suit",
                        "vi": "một chiếc áo sơ mi / bộ đồ séc"
                    },
                    {
                        "en": "a yellow and red check skirt",
                        "vi": "váy kiểm tra màu vàng và đỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place in a club, restaurant, etc. where you can leave your coat or bag",
                    "vi": "một địa điểm trong câu lạc bộ, nhà hàng, v.v. nơi bạn có thể để áo khoác hoặc túi xách của mình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a ticket that you get when you leave your coat, bag, etc. in, for example, a restaurant or theatre",
                    "vi": "một vé mà bạn nhận được khi để áo khoác, túi xách, v.v. vào nhà hàng hoặc rạp hát, chẳng hạn như"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a position in which a player’s king (= the most important piece) can be directly attacked by the other player’s pieces",
                    "vi": "vị trí trong đó vua của người chơi (= quân quan trọng nhất) có thể bị quân của người chơi khác tấn công trực tiếp"
                },
                "examples": [
                    {
                        "en": "There, you're in check.",
                        "vi": "Ở đó, bạn đang kiểm tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep something under control so that it does not spread or get worse",
                    "vi": "để kiểm soát điều gì đó để nó không lây lan hoặc trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "Maggie managed to keep her temper in check.",
                        "vi": "Maggie đã kiểm soát được sự bình tĩnh của mình."
                    },
                    {
                        "en": "The epidemic was held in check by widespread vaccination.",
                        "vi": "Dịch bệnh đã được kiểm soát bằng cách tiêm chủng trên diện rộng."
                    },
                    {
                        "en": "You need to keep your temper in check!",
                        "vi": "Bạn cần phải giữ bình tĩnh của bạn trong kiểm tra!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse an offer or invitation but say that you might accept it later",
                    "vi": "từ chối một đề nghị hoặc lời mời nhưng nói rằng bạn có thể chấp nhận nó sau"
                },
                "examples": [
                    {
                        "en": "‘Are you coming for a drink?’ ‘Can I take a rain check?—I must get this finished tonight.’",
                        "vi": "Bạn có đến uống nước không?' 'Tôi có thể kiểm tra mưa không? - Tôi phải hoàn thành việc này tối nay.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "e931fa12ce454818941ea49c23e73ea9",
        "word": "checkers",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃekəz/",
            "us": "/ˈtʃekərz/"
        },
        "nearby": [
            {
                "word": "checkerboard",
                "pos": "noun"
            },
            {
                "word": "checkered",
                "pos": "adjective"
            },
            {
                "word": "checkers",
                "pos": "noun"
            },
            {
                "word": "Checkers",
                "pos": ""
            },
            {
                "word": "check in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two players using 24 round pieces on a board marked with black and white squares",
                    "vi": "trò chơi dành cho hai người chơi sử dụng 24 mảnh tròn trên bảng được đánh dấu bằng các ô vuông đen và trắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5db2c54e65f14424a12107d6e83c2b08",
        "word": "chessman",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃesmæn/",
            "us": "/ˈtʃesmæn/"
        },
        "nearby": [
            {
                "word": "chess",
                "pos": "noun"
            },
            {
                "word": "chessboard",
                "pos": "noun"
            },
            {
                "word": "chessman",
                "pos": "noun"
            },
            {
                "word": "chest",
                "pos": "noun"
            },
            {
                "word": "Chester",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the 32 pieces used in the game of chess",
                    "vi": "bất kỳ quân nào trong số 32 quân cờ được sử dụng trong trò chơi cờ vua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e31da0299e64ea08e4f5ff82f831813",
        "word": "Chinese chequers",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtʃaɪniːz ˈtʃekəz/",
            "us": "/ˌtʃaɪniːz ˈtʃekərz/"
        },
        "nearby": [
            {
                "word": "Chinese",
                "pos": "noun"
            },
            {
                "word": "Chinese cabbage",
                "pos": "noun"
            },
            {
                "word": "Chinese chequers",
                "pos": "noun"
            },
            {
                "word": "Chinese lantern",
                "pos": "noun"
            },
            {
                "word": "Chinese whispers",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two to six players who try to move the playing pieces from one corner to the opposite corner of the board, which is like a star in shape",
                    "vi": "một trò chơi dành cho hai đến sáu người chơi cố gắng di chuyển các quân cờ từ góc này sang góc đối diện của bàn cờ, giống như hình ngôi sao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "27b5bf5c35814d69915448405e4651da",
        "word": "Chutes and Ladders™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃuːts ən ˈlædəz/",
            "us": "/ˌʃuːts ən ˈlædərz/"
        },
        "nearby": [
            {
                "word": "churn rate",
                "pos": "noun"
            },
            {
                "word": "chute",
                "pos": "noun"
            },
            {
                "word": "Chutes and Ladders",
                "pos": "noun"
            },
            {
                "word": "chutney",
                "pos": "noun"
            },
            {
                "word": "chutzpah",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a children’s game played on a special board with pictures of chutes and ladders on it. Players move their pieces up the ladders to go forward and down the chutes to go back.",
                    "vi": "một trò chơi dành cho trẻ em được chơi trên một tấm bảng đặc biệt có hình các máng và thang trên đó. Người chơi di chuyển quân cờ của mình lên thang để đi tiếp và xuống máng để quay lại."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "01421eaf78f74d3d9adc83b44aee3f0a",
        "word": "counter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊntə(r)/",
            "us": "/ˈkaʊntər/"
        },
        "nearby": [
            {
                "word": "countenance",
                "pos": "verb"
            },
            {
                "word": "counter-attack",
                "pos": "verb"
            },
            {
                "word": "counter",
                "pos": "noun"
            },
            {
                "word": "counter",
                "pos": "verb"
            },
            {
                "word": "counter",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long flat surface over which goods are sold or business is done in a shop, bank, etc.",
                    "vi": "một bề mặt phẳng dài, trên đó hàng hóa được bán hoặc kinh doanh được thực hiện trong một cửa hàng, ngân hàng, v.v."
                },
                "examples": [
                    {
                        "en": "behind the counter I asked the woman behind the counter if they had any postcards.",
                        "vi": "phía sau quầy, tôi hỏi người phụ nữ đứng sau quầy xem họ có tấm bưu thiếp nào không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat surface in a kitchen for preparing food on",
                    "vi": "một bề mặt phẳng trong nhà bếp để chuẩn bị thức ăn"
                },
                "examples": [
                    {
                        "en": "She put her bags down on the kitchen counter.",
                        "vi": "Cô đặt túi xách của mình xuống quầy bếp."
                    },
                    {
                        "en": "The kitchen had black marble counter tops.",
                        "vi": "Nhà bếp có mặt bàn bằng đá cẩm thạch đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small disc used for playing or scoring in some board games",
                    "vi": "một đĩa nhỏ được sử dụng để chơi hoặc ghi điểm trong một số trò chơi trên bàn cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an electronic device for counting something",
                    "vi": "một thiết bị điện tử để đếm thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The needle on the rev counter soared.",
                        "vi": "Kim trên đồng hồ đo vòng tua máy tăng vọt."
                    },
                    {
                        "en": "You need to reset the counter.",
                        "vi": "Bạn cần đặt lại bộ đếm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who counts something, for example votes in an election",
                    "vi": "một người đếm cái gì đó, ví dụ như bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "You can get computers to help the counters to count the votes.",
                        "vi": "Bạn có thể nhờ máy tính để giúp quầy kiểm phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a response to somebody/something that opposes their ideas, position, etc.",
                    "vi": "phản hồi với ai đó / điều gì đó phản đối ý tưởng, vị trí của họ, v.v."
                },
                "examples": [
                    {
                        "en": "The employers' association was seen as a counter to union power.",
                        "vi": "Hiệp hội người sử dụng lao động được coi là một đối trọng với quyền lực của công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "goods, especially medicines, for sale over the counter can be bought without a prescription (= written permission from a doctor to buy a medicine) or special licence",
                    "vi": "hàng hóa, đặc biệt là thuốc, bán không cần đơn có thể được mua mà không cần đơn (= văn bản cho phép mua thuốc của bác sĩ) hoặc giấy phép đặc biệt"
                },
                "examples": [
                    {
                        "en": "These tablets are available over the counter.",
                        "vi": "Những máy tính bảng này có sẵn trên quầy."
                    },
                    {
                        "en": "This kind of medication cannot be bought over the counter.",
                        "vi": "Loại thuốc này không thể được mua qua quầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "goods that are bought or sold under the counter are sold secretly and sometimes illegally",
                    "vi": "hàng hóa được mua hoặc bán dưới quầy được bán một cách bí mật và đôi khi bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Pornography may be legally banned but it is still available under the counter.",
                        "vi": "Nội dung khiêu dâm có thể bị cấm hợp pháp nhưng nó vẫn có sẵn dưới quầy."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a693994d9d54901af60f7bab107497a",
        "word": "domino",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɒmɪnəʊ/",
            "us": "/ˈdɑːmɪnəʊ/"
        },
        "nearby": [
            {
                "word": "dominion",
                "pos": "noun"
            },
            {
                "word": "'Fats' Domino",
                "pos": ""
            },
            {
                "word": "domino",
                "pos": "noun"
            },
            {
                "word": "domino effect",
                "pos": "noun"
            },
            {
                "word": "Domino's Pizza",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small flat block, often made of wood, with two groups of dots (= small round marks) representing numbers on one side, used for playing games",
                    "vi": "một khối phẳng nhỏ, thường làm bằng gỗ, có hai nhóm chấm (= dấu tròn nhỏ) thể hiện số ở một bên, dùng để chơi trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a game played with a set of dominoes, in which players take turns to put them onto a table",
                    "vi": "một trò chơi được chơi với một bộ domino, trong đó người chơi thay phiên nhau đặt chúng lên bàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6464836533f844edb29c67251e016b54",
        "word": "draught",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/drɑːft/",
            "us": "/dræft/"
        },
        "nearby": [
            {
                "word": "drat",
                "pos": "exclamation"
            },
            {
                "word": "dratted",
                "pos": "adjective"
            },
            {
                "word": "draught",
                "pos": "noun"
            },
            {
                "word": "draught",
                "pos": "adjective"
            },
            {
                "word": "draught",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flow of cool air in a room or other small space",
                    "vi": "luồng không khí mát trong phòng hoặc không gian nhỏ khác"
                },
                "examples": [
                    {
                        "en": "There's a draught in here.",
                        "vi": "Có một bản nháp ở đây."
                    },
                    {
                        "en": "A cold draught of air blew in from the open window.",
                        "vi": "Một luồng gió lạnh thổi vào từ cửa sổ đang mở."
                    },
                    {
                        "en": "in a draught I was sitting in a draught.",
                        "vi": "trong một bản nháp Tôi đang ngồi trong một bản nháp."
                    },
                    {
                        "en": "She shivered in the icy draught.",
                        "vi": "Cô rùng mình trong bản nháp băng giá."
                    },
                    {
                        "en": "a draught coming under the door",
                        "vi": "một bản nháp đến dưới cửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "one continuous action of swallowing liquid (= making it go down your throat); the amount swallowed",
                    "vi": "một hành động liên tục nuốt chất lỏng (= làm cho nó chảy xuống cổ họng của bạn); số lượng nuốt"
                },
                "examples": [
                    {
                        "en": "He took a deep draught of his beer.",
                        "vi": "Anh uống một hơi hết sạch bia của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "medicine in a liquid form",
                    "vi": "thuốc ở dạng lỏng"
                },
                "examples": [
                    {
                        "en": "a sleeping draught (= one that makes you sleep)",
                        "vi": "một bản nháp khi ngủ (= một bản nháp khiến bạn ngủ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a game for two players using 24 round pieces on a board marked with black and white squares",
                    "vi": "trò chơi dành cho hai người chơi sử dụng 24 mảnh tròn trên bảng được đánh dấu bằng các ô vuông đen và trắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the round pieces used in a game of draughts",
                    "vi": "một trong những mảnh tròn được sử dụng trong trò chơi nháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "taken from a large container (= a barrel)",
                    "vi": "lấy từ một thùng lớn (= một thùng)"
                },
                "examples": [
                    {
                        "en": "This beer is not available on draught (= it is available only in bottles or cans).",
                        "vi": "Bia này không có sẵn ở dạng tươi (= chỉ có ở dạng chai hoặc lon)."
                    }
                ]
            }
        ]
    },
    {
        "id": "3f9ad5230a844e94a2284b756b0693e9",
        "word": "king",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɪŋ/",
            "us": "/kɪŋ/"
        },
        "nearby": [
            {
                "word": "kinetic",
                "pos": "adjective"
            },
            {
                "word": "kinetic art",
                "pos": "noun"
            },
            {
                "word": "king",
                "pos": "noun"
            },
            {
                "word": "the King",
                "pos": ""
            },
            {
                "word": "B B King",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the male ruler of an independent state that has a royal family",
                    "vi": "người cai trị nam giới của một quốc gia độc lập có một gia đình hoàng gia"
                },
                "examples": [
                    {
                        "en": "the kings and queens of England",
                        "vi": "các vị vua và nữ hoàng của nước Anh"
                    },
                    {
                        "en": "the French king",
                        "vi": "vua pháp"
                    },
                    {
                        "en": "to be crowned king",
                        "vi": "lên ngôi vua"
                    },
                    {
                        "en": "King George V",
                        "vi": "Vua George V"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, an animal or a thing that is thought to be the best or most important of a particular type",
                    "vi": "một người, một con vật hoặc một thứ được cho là tốt nhất hoặc quan trọng nhất của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "the king of comedy",
                        "vi": "vua hài kịch"
                    },
                    {
                        "en": "The lion is the king of the jungle.",
                        "vi": "Sư tử là vua của rừng già."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in compounds with the names of animals or plants to describe a very large type of the thing mentioned",
                    "vi": "được sử dụng trong các hợp chất với tên của động vật hoặc thực vật để mô tả một loại rất lớn của điều được đề cập"
                },
                "examples": [
                    {
                        "en": "a king penguin",
                        "vi": "một con chim cánh cụt vua"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important piece used in the game of chess, that can move one square in any direction",
                    "vi": "quân quan trọng nhất được sử dụng trong trò chơi cờ vua, có thể di chuyển một ô vuông theo bất kỳ hướng nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a playing card with the picture of a king on it",
                    "vi": "một thẻ chơi với hình ảnh của một vị vua trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very large amount of money",
                    "vi": "một số tiền rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person considered to be the best, most famous or successful in a particular place or area of activity",
                    "vi": "người được coi là giỏi nhất, nổi tiếng nhất hoặc thành công ở một địa điểm hoặc lĩnh vực hoạt động cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "855153beca144e7390e2a5b5e6c83465",
        "word": "knight",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/naɪt/",
            "us": "/naɪt/"
        },
        "nearby": [
            {
                "word": "knife-edge",
                "pos": "noun"
            },
            {
                "word": "knifepoint",
                "pos": "noun"
            },
            {
                "word": "knight",
                "pos": "noun"
            },
            {
                "word": "knight",
                "pos": "verb"
            },
            {
                "word": "Knight Commander",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the Middle Ages) a man of high social rank who had a duty to fight for his king. Knights are often shown in pictures riding horses and wearing armour.",
                    "vi": "(trong thời Trung Cổ) một người đàn ông có địa vị xã hội cao, người có nhiệm vụ chiến đấu cho vị vua của mình. Các hiệp sĩ thường được thể hiện trong các bức tranh cưỡi ngựa và mặc áo giáp."
                },
                "examples": [
                    {
                        "en": "tales of medieval knights errant, wandering in search of chivalrous adventures",
                        "vi": "câu chuyện về những hiệp sĩ thời trung cổ sai lầm, lang thang tìm kiếm những cuộc phiêu lưu hào hiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a man who has been given a special honour by the king or queen and has the title Sir before his name",
                    "vi": "(ở Anh) một người đàn ông được vua hoặc hoàng hậu đặc biệt tôn vinh và có tước hiệu Ngài trước tên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece used in the game of chess that is like a horse’s head in shape",
                    "vi": "một quân cờ được sử dụng trong trò chơi cờ vua giống như hình đầu ngựa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who saves somebody, especially a woman, from a dangerous situation",
                    "vi": "một người đàn ông cứu ai đó, đặc biệt là một người phụ nữ, khỏi một tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "She's still waiting for a knight in shining armour to come and rescue her.",
                        "vi": "Cô ấy vẫn đang chờ một hiệp sĩ trong bộ giáp sáng chói đến và giải cứu cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "8682d871b3f74432a79dace35ee12df7",
        "word": "ludo",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈluːdəʊ/",
            "us": "/ˈluːdəʊ/"
        },
        "nearby": [
            {
                "word": "ludicrousness",
                "pos": "noun"
            },
            {
                "word": "Robert Ludlum",
                "pos": ""
            },
            {
                "word": "ludo",
                "pos": "noun"
            },
            {
                "word": "lug",
                "pos": "verb"
            },
            {
                "word": "lug",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a simple game played with dice and small discs on a special board, similar to the American game, Parcheesi",
                    "vi": "một trò chơi đơn giản được chơi với xúc xắc và đĩa nhỏ trên một bảng đặc biệt, tương tự như trò chơi của Mỹ, Parcheesi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "afcd08b8d474472cb209201c6c8f5507",
        "word": "mahjong",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɑːˈdʒɒŋ/",
            "us": "/mɑːˈʒɑːŋ/"
        },
        "nearby": [
            {
                "word": "mahatma",
                "pos": "noun"
            },
            {
                "word": "Mahayana",
                "pos": "noun"
            },
            {
                "word": "mahjong",
                "pos": "noun"
            },
            {
                "word": "mahogany",
                "pos": "noun"
            },
            {
                "word": "mahoosive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Chinese game played with small pieces of wood with symbols on them",
                    "vi": "một trò chơi Trung Quốc chơi với những mảnh gỗ nhỏ có biểu tượng trên chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "935b2f59b197421696599b10b24ef437",
        "word": "pawn",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pɔːn/",
            "us": "/pɔːn/"
        },
        "nearby": [
            {
                "word": "paw",
                "pos": "noun"
            },
            {
                "word": "paw",
                "pos": "verb"
            },
            {
                "word": "pawn",
                "pos": "noun"
            },
            {
                "word": "pawn",
                "pos": "verb"
            },
            {
                "word": "pawnbroker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a chess piece of the smallest size and least value. Each player has eight pawns at the start of a game.",
                    "vi": "một quân cờ có kích thước nhỏ nhất và giá trị nhỏ nhất. Mỗi người chơi có tám con tốt khi bắt đầu trò chơi."
                },
                "examples": [
                    {
                        "en": "He had to sacrifice another pawn.",
                        "vi": "Anh phải hy sinh một con tốt khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or group whose actions are controlled by more powerful people",
                    "vi": "một người hoặc một nhóm có hành động được kiểm soát bởi những người quyền lực hơn"
                },
                "examples": [
                    {
                        "en": "The hostages are being used as political pawns.",
                        "vi": "Các con tin đang được sử dụng như một con tốt chính trị."
                    },
                    {
                        "en": "The prince became a pawn in the game of power politics.",
                        "vi": "Hoàng tử trở thành con tốt trong trò chơi chính trị quyền lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is in pawn, it has been pawned",
                    "vi": "nếu một cái gì đó được cầm đồ, nó đã được cầm đồ"
                },
                "examples": [
                    {
                        "en": "All her jewellery was in pawn.",
                        "vi": "Tất cả đồ trang sức của cô đều được cầm đồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "87952c87c91047e5a863f3152db70bc1",
        "word": "Pelmanism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpelmənɪzəm/",
            "us": "/ˈpelmənɪzəm/"
        },
        "nearby": [
            {
                "word": "pell-mell",
                "pos": "adverb"
            },
            {
                "word": "pellucid",
                "pos": "adjective"
            },
            {
                "word": "Pelmanism",
                "pos": "noun"
            },
            {
                "word": "pelmet",
                "pos": "noun"
            },
            {
                "word": "pelota",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which players must remember cards or other objects that they have seen",
                    "vi": "một trò chơi trong đó người chơi phải nhớ các thẻ hoặc các đồ vật khác mà họ đã nhìn thấy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5b844a37efd2411fb3a6564f9807c9fa",
        "word": "queen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kwiːn/",
            "us": "/kwiːn/"
        },
        "nearby": [
            {
                "word": "Quebec City",
                "pos": ""
            },
            {
                "word": "Quechua",
                "pos": "noun"
            },
            {
                "word": "queen",
                "pos": "noun"
            },
            {
                "word": "Queen",
                "pos": ""
            },
            {
                "word": "Ellery Queen",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the female ruler of an independent state that has a royal family",
                    "vi": "nữ cai trị của một quốc gia độc lập có một gia đình hoàng gia"
                },
                "examples": [
                    {
                        "en": "She was crowned queen at the age of fifteen.",
                        "vi": "Cô lên ngôi hoàng hậu khi mới mười lăm tuổi."
                    },
                    {
                        "en": "kings and queens",
                        "vi": "Những vị vua và hoàng hậu"
                    },
                    {
                        "en": "queen of… the Queen of Norway",
                        "vi": "nữ hoàng của… Nữ hoàng Na Uy"
                    },
                    {
                        "en": "Queen Victoria",
                        "vi": "Nữ hoàng Victoria"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wife of a king",
                    "vi": "vợ của một vị vua"
                },
                "examples": [
                    {
                        "en": "Henry VII and his queen, Elizabeth of York",
                        "vi": "Henry VII và nữ hoàng của ông, Elizabeth of York"
                    },
                    {
                        "en": "queen of… The King and Queen of Denmark attended the wedding.",
                        "vi": "nữ hoàng của… Nhà vua và Nữ hoàng Đan Mạch đã tham dự lễ cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman, place or thing that is thought to be one of the best in a particular group or area",
                    "vi": "một người phụ nữ, địa điểm hoặc thứ được cho là tốt nhất trong một nhóm hoặc khu vực cụ thể"
                },
                "examples": [
                    {
                        "en": "the queen of fashion",
                        "vi": "nữ hoàng thời trang"
                    },
                    {
                        "en": "a movie queen",
                        "vi": "một nữ hoàng điện ảnh"
                    },
                    {
                        "en": "Venice, queen of the Adriatic",
                        "vi": "Venice, nữ hoàng của Adriatic"
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman or girl chosen to perform official duties at a festival or celebration",
                    "vi": "một phụ nữ hoặc cô gái được chọn để thực hiện nhiệm vụ chính thức tại một lễ hội hoặc lễ kỷ niệm"
                },
                "examples": [
                    {
                        "en": "a carnival queen",
                        "vi": "một nữ hoàng lễ hội"
                    },
                    {
                        "en": "a May queen (= at a festival to celebrate the coming of spring)",
                        "vi": "nữ hoàng tháng 5 (= tại lễ hội mừng mùa xuân sắp đến)"
                    },
                    {
                        "en": "a homecoming queen",
                        "vi": "một nữ hoàng trở về nhà"
                    },
                    {
                        "en": "She was nominated for prom queen in high school.",
                        "vi": "Cô từng được đề cử là nữ hoàng vũ hội ở trường trung học."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most powerful piece used in the game of chess that can move any number of squares in any direction",
                    "vi": "quân cờ mạnh nhất được sử dụng trong trò chơi cờ vua có thể di chuyển bất kỳ số ô vuông nào theo bất kỳ hướng nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a playing card with the picture of a queen on it",
                    "vi": "một thẻ chơi với hình ảnh của một nữ hoàng trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large female insect that lays eggs for the whole group",
                    "vi": "một con côn trùng cái lớn đẻ trứng cho cả đàn"
                },
                "examples": [
                    {
                        "en": "a queen bee",
                        "vi": "ong chúa"
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word for a gay man who behaves like a woman",
                    "vi": "một từ xúc phạm cho một người đồng tính nam cư xử như một phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person considered to be the best, most famous or successful in a particular place or area of activity",
                    "vi": "người được coi là giỏi nhất, nổi tiếng nhất hoặc thành công ở một địa điểm hoặc lĩnh vực hoạt động cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f9e4d3cde8ee424b975f51fd54dc0a50",
        "word": "Scrabble™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskræbl/",
            "us": "/ˈskræbl/"
        },
        "nearby": [
            {
                "word": "SCR",
                "pos": "noun"
            },
            {
                "word": "scrabble",
                "pos": "verb"
            },
            {
                "word": "Scrabble",
                "pos": "noun"
            },
            {
                "word": "scraggly",
                "pos": "adjective"
            },
            {
                "word": "scraggy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a board game in which players try to make words from letters printed on small plastic blocks and connect them to words that have already been placed on the board",
                    "vi": "một trò chơi trên bàn cờ trong đó người chơi cố gắng tạo ra các từ từ các chữ cái in trên các khối nhựa nhỏ và nối chúng với các từ đã được đặt sẵn trên bảng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43642002968845c199bba16b8c932d2a",
        "word": "snakes and ladders",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsneɪks ən ˈlædəz/",
            "us": "/ˌsneɪks ən ˈlædərz/"
        },
        "nearby": [
            {
                "word": "snake oil",
                "pos": "noun"
            },
            {
                "word": "snake pit",
                "pos": "noun"
            },
            {
                "word": "snakes and ladders",
                "pos": "noun"
            },
            {
                "word": "snakeskin",
                "pos": "noun"
            },
            {
                "word": "snaky",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a children’s game played on a special board with pictures of snakes and ladders on it. Players move their pieces up the ladders to go forward and down the snakes to go back.",
                    "vi": "một trò chơi dành cho trẻ em được chơi trên một bảng đặc biệt với hình ảnh những con rắn và những chiếc thang trên đó. Người chơi di chuyển quân cờ của mình lên thang để đi tiếp và xuống rắn để quay lại."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "84643f564409450283b21c36ab6ca3f0",
        "word": "stalemate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪlmeɪt/",
            "us": "/ˈsteɪlmeɪt/"
        },
        "nearby": [
            {
                "word": "St Albans",
                "pos": ""
            },
            {
                "word": "stale",
                "pos": "adjective"
            },
            {
                "word": "stalemate",
                "pos": "noun"
            },
            {
                "word": "staleness",
                "pos": "noun"
            },
            {
                "word": "Stalinism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disagreement or a situation in a competition in which neither side is able to win or make any progress",
                    "vi": "bất đồng hoặc một tình huống trong một cuộc thi mà cả hai bên đều không thể giành chiến thắng hoặc đạt được bất kỳ tiến bộ nào"
                },
                "examples": [
                    {
                        "en": "The talks ended in (a) stalemate.",
                        "vi": "Cuộc đàm phán kết thúc trong (a) bế tắc."
                    },
                    {
                        "en": "proposals aimed at breaking (= ending) the political stalemate",
                        "vi": "đề xuất nhằm phá vỡ (= chấm dứt) tình trạng bế tắc chính trị"
                    },
                    {
                        "en": "The strike has once again reached stalemate.",
                        "vi": "Cuộc đình công một lần nữa đi vào bế tắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a player cannot successfully move any of their pieces and the game ends without a winner",
                    "vi": "tình huống trong đó người chơi không thể di chuyển thành công bất kỳ quân nào của họ và trò chơi kết thúc mà không có người chiến thắng"
                },
                "examples": [
                    {
                        "en": "The match ended in (a) stalemate",
                        "vi": "Trận đấu kết thúc trong (a) bế tắc"
                    }
                ]
            }
        ]
    },
    {
        "id": "0c04ab85bd8344f3862bf17acaaa05df",
        "word": "tiddlywinks",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɪdliwɪŋks/",
            "us": "/ˈtɪdliwɪŋks/"
        },
        "nearby": [
            {
                "word": "tiddler",
                "pos": "noun"
            },
            {
                "word": "tiddly",
                "pos": "adjective"
            },
            {
                "word": "tiddlywinks",
                "pos": "noun"
            },
            {
                "word": "tide",
                "pos": "noun"
            },
            {
                "word": "tide",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game in which players try to make small plastic discs jump into a cup by pressing them on the edge with a larger disc",
                    "vi": "một trò chơi trong đó người chơi cố gắng làm cho những chiếc đĩa nhựa nhỏ nhảy vào một chiếc cốc bằng cách ấn chúng vào cạnh bằng một chiếc đĩa lớn hơn"
                },
                "examples": []
            }
        ]
    }
]