[
    {
        "id": "22b643ae2d8545c1a3039ab4e8537709",
        "word": "virus",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈvaɪrəs/",
            "us": "/ˈvaɪrəs/"
        },
        "nearby": [
            {
                "word": "virulent",
                "pos": "adjective"
            },
            {
                "word": "virulently",
                "pos": "adverb"
            },
            {
                "word": "virus",
                "pos": "noun"
            },
            {
                "word": "visa",
                "pos": "noun"
            },
            {
                "word": "visage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a living thing, too small to be seen without a microscope, that causes disease in people, animals and plants",
                    "vi": "một sinh vật sống, quá nhỏ để có thể nhìn thấy mà không có kính hiển vi, gây bệnh cho người, động vật và thực vật"
                },
                "examples": [
                    {
                        "en": "the flu/influenza virus",
                        "vi": "vi rút cúm / cúm"
                    },
                    {
                        "en": "patients known to have been infected with the virus",
                        "vi": "bệnh nhân được biết là đã bị nhiễm vi rút"
                    },
                    {
                        "en": "the human immunodeficiency virus or HIV",
                        "vi": "vi rút suy giảm miễn dịch ở người hoặc HIV"
                    },
                    {
                        "en": "the hepatitis C virus",
                        "vi": "vi rút viêm gan C"
                    },
                    {
                        "en": "a highly infectious disease caused by a virus",
                        "vi": "một bệnh truyền nhiễm cao do vi rút gây ra"
                    },
                    {
                        "en": "a virus infection",
                        "vi": "nhiễm vi rút"
                    },
                    {
                        "en": "The vaccination offers good protection against the virus.",
                        "vi": "Việc chủng ngừa mang lại sự bảo vệ tốt chống lại vi rút."
                    },
                    {
                        "en": "It is not clear how she contracted the virus.",
                        "vi": "Không rõ bằng cách nào mà cô ấy lại nhiễm virus."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disease caused by a virus",
                    "vi": "một căn bệnh do vi rút gây ra"
                },
                "examples": [
                    {
                        "en": "There's a virus going around the office.",
                        "vi": "Có một loại vi-rút đang đi khắp văn phòng."
                    },
                    {
                        "en": "I must have caught a virus on holiday.",
                        "vi": "Tôi chắc chắn đã bị nhiễm vi-rút vào kỳ nghỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "instructions that are hidden within a computer program and are designed to cause faults or destroy data",
                    "vi": "hướng dẫn bị ẩn trong chương trình máy tính và được thiết kế để gây ra lỗi hoặc phá hủy dữ liệu"
                },
                "examples": [
                    {
                        "en": "a computer virus",
                        "vi": "một vi rút máy tính"
                    },
                    {
                        "en": "I think I've got a virus on my laptop.",
                        "vi": "Tôi nghĩ rằng tôi đã có một vi-rút trên máy tính xách tay của mình."
                    },
                    {
                        "en": "The virus in the software was programmed to corrupt the hard disk.",
                        "vi": "Vi rút trong phần mềm đã được lập trình để làm hỏng đĩa cứng."
                    },
                    {
                        "en": "software errors that can be exploited by virus writers",
                        "vi": "lỗi phần mềm có thể bị người viết vi rút khai thác"
                    }
                ]
            }
        ]
    },
    {
        "id": "f37944a714844d14857260f99df311e4",
        "word": "error message",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈerə mesɪdʒ/",
            "us": "/ˈerər mesɪdʒ/"
        },
        "nearby": [
            {
                "word": "error",
                "pos": "noun"
            },
            {
                "word": "error correction",
                "pos": "noun"
            },
            {
                "word": "error message",
                "pos": "noun"
            },
            {
                "word": "ersatz",
                "pos": "adjective"
            },
            {
                "word": "Erse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a message that appears on a computer screen that tells you that you have done something wrong or that the program cannot do what you want it to do",
                    "vi": "một thông báo xuất hiện trên màn hình máy tính cho bạn biết rằng bạn đã làm sai điều gì đó hoặc chương trình không thể làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "An error message comes up when I try to open the program.",
                        "vi": "Một thông báo lỗi xuất hiện khi tôi cố gắng mở chương trình."
                    }
                ]
            }
        ]
    },
    {
        "id": "04c095d7f5244ed9a79644b19f926934",
        "word": "bug",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/bʌɡ/",
            "us": "/bʌɡ/"
        },
        "nearby": [
            {
                "word": "buff up",
                "pos": "phrasal verb"
            },
            {
                "word": "Buffy the Vampire Slayer",
                "pos": ""
            },
            {
                "word": "bug",
                "pos": "noun"
            },
            {
                "word": "bug",
                "pos": "verb"
            },
            {
                "word": "bugaboo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any small insect",
                    "vi": "bất kỳ loài côn trùng nhỏ nào"
                },
                "examples": [
                    {
                        "en": "There's a bug crawling up your arm.",
                        "vi": "Có một con bọ đang bò lên trên cánh tay của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an illness that is usually fairly mild but spreads easily from person to person",
                    "vi": "một bệnh thường khá nhẹ nhưng dễ lây lan từ người này sang người khác"
                },
                "examples": [
                    {
                        "en": "a flu bug",
                        "vi": "một con bọ cúm"
                    },
                    {
                        "en": "There's a stomach bug going round (= people are catching it from each other).",
                        "vi": "Có một con bọ trong dạ dày đang bùng phát (= mọi người đang bắt nó từ nhau)."
                    },
                    {
                        "en": "I picked up a bug in the office.",
                        "vi": "Tôi đã nhặt được một lỗi trong văn phòng."
                    },
                    {
                        "en": "He's off work with a flu bug.",
                        "vi": "Anh ấy đang nghỉ việc vì bị cúm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an enthusiastic interest in something such as a sport or a hobby",
                    "vi": "quan tâm nhiệt tình đến một cái gì đó chẳng hạn như một môn thể thao hoặc một sở thích"
                },
                "examples": [
                    {
                        "en": "She's been bitten by the travel bug.",
                        "vi": "Cô ấy đã bị cắn bởi con bọ du lịch."
                    },
                    {
                        "en": "She was never interested in fitness before but now she's been bitten by the bug.",
                        "vi": "Trước đây cô ấy chưa bao giờ quan tâm đến thể dục nhưng giờ cô ấy đã bị con bọ cắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fault in a machine, especially in a computer system or program",
                    "vi": "lỗi trong máy, đặc biệt là trong hệ thống máy tính hoặc chương trình"
                },
                "examples": [
                    {
                        "en": "The software is full of bugs.",
                        "vi": "Phần mềm có đầy lỗi."
                    },
                    {
                        "en": "My computer's really slow at the moment—it must be some kind of bug.",
                        "vi": "Máy tính của tôi thực sự chậm vào lúc này — chắc là một loại lỗi nào đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small hidden device for listening to other people’s conversations",
                    "vi": "một thiết bị ẩn nhỏ để nghe cuộc trò chuyện của người khác"
                },
                "examples": [
                    {
                        "en": "They planted a bug in his hotel room.",
                        "vi": "Họ đã gieo một con bọ trong phòng khách sạn của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "0957b89a52b541b7b726fedb3cea83e6",
        "word": "crash",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kræʃ/",
            "us": "/kræʃ/"
        },
        "nearby": [
            {
                "word": "craps",
                "pos": "noun"
            },
            {
                "word": "crapshoot",
                "pos": "noun"
            },
            {
                "word": "crash",
                "pos": "noun"
            },
            {
                "word": "crash",
                "pos": "verb"
            },
            {
                "word": "crash",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an accident in which a vehicle hits something, for example another vehicle, usually causing damage and often injuring or killing the passengers",
                    "vi": "một vụ tai nạn trong đó một chiếc xe va vào một thứ gì đó, chẳng hạn như một chiếc xe khác, thường gây ra thiệt hại và thường làm hành khách bị thương hoặc thiệt mạng"
                },
                "examples": [
                    {
                        "en": "a car/plane crash",
                        "vi": "một vụ tai nạn ô tô / máy bay"
                    },
                    {
                        "en": "A man has been arrested in connection with a fatal crash on the M4 motorway.",
                        "vi": "Một người đàn ông đã bị bắt liên quan đến một vụ tai nạn chết người trên đường cao tốc M4."
                    },
                    {
                        "en": "It is not clear what caused the crash.",
                        "vi": "Không rõ điều gì đã gây ra vụ tai nạn."
                    },
                    {
                        "en": "in a crash A girl was killed yesterday in a crash involving a stolen car.",
                        "vi": "trong một vụ tai nạn Một cô gái đã thiệt mạng ngày hôm qua trong một vụ tai nạn liên quan đến một chiếc xe bị đánh cắp."
                    },
                    {
                        "en": "34 people died in the train crash.",
                        "vi": "34 người chết trong vụ đâm tàu."
                    },
                    {
                        "en": "There were no other vehicles involved in the crash.",
                        "vi": "Không có phương tiện nào khác liên quan đến vụ tai nạn."
                    },
                    {
                        "en": "Mechanical failures were to blame for the crash of the helicopter.",
                        "vi": "Các lỗi cơ học được cho là nguyên nhân dẫn đến sự cố máy bay trực thăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden loud noise made, for example, by something falling or breaking",
                    "vi": "một tiếng ồn lớn đột ngột được tạo ra, chẳng hạn như một cái gì đó rơi hoặc vỡ"
                },
                "examples": [
                    {
                        "en": "The tree fell with a great crash.",
                        "vi": "Cây đổ với một tai nạn lớn."
                    },
                    {
                        "en": "The first distant crash of thunder shook the air.",
                        "vi": "Tiếng sấm sét ở xa đầu tiên làm rung chuyển không khí."
                    },
                    {
                        "en": "She heard the crash of shattering glass as the vehicles collided.",
                        "vi": "Cô nghe thấy tiếng kính vỡ vụn khi các phương tiện va chạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden serious fall in the price or value of something; the occasion when a business, etc. fails",
                    "vi": "sự sụt giảm nghiêm trọng đột ngột về giá cả hoặc giá trị của một thứ gì đó; khi một doanh nghiệp, v.v. thất bại"
                },
                "examples": [
                    {
                        "en": "Some economists have been predicting another crash for years.",
                        "vi": "Một số nhà kinh tế đã dự đoán một vụ tai nạn khác trong nhiều năm."
                    },
                    {
                        "en": "the 2008 stock market crash",
                        "vi": "sự sụp đổ của thị trường chứng khoán năm 2008"
                    },
                    {
                        "en": "crash of… the crash of 2008",
                        "vi": "sự sụp đổ của… sự sụp đổ của năm 2008"
                    },
                    {
                        "en": "crash in something a crash in share prices",
                        "vi": "sụp đổ trong một cái gì đó một sự sụp đổ trong giá cổ phiếu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden failure of a machine or system, especially of a computer or computer system",
                    "vi": "sự cố đột ngột của máy hoặc hệ thống, đặc biệt là máy tính hoặc hệ thống máy tính"
                },
                "examples": [
                    {
                        "en": "Users won't lose important data if a hardware problem causes a crash.",
                        "vi": "Người dùng sẽ không mất dữ liệu quan trọng nếu sự cố phần cứng gây ra sự cố."
                    },
                    {
                        "en": "a computer crash",
                        "vi": "một sự cố máy tính"
                    },
                    {
                        "en": "A systems crash in the morning and a bomb scare in the afternoon provided enough excitement for one day.",
                        "vi": "Một sự cố hệ thống vào buổi sáng và một vụ đánh bom vào buổi chiều đã tạo ra đủ sự phấn khích cho một ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d22b6ce146c49319b45f82cf137ff58",
        "word": "crash",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kræʃ/",
            "us": "/kræʃ/"
        },
        "nearby": [
            {
                "word": "crapshoot",
                "pos": "noun"
            },
            {
                "word": "crash",
                "pos": "noun"
            },
            {
                "word": "crash",
                "pos": "verb"
            },
            {
                "word": "crash",
                "pos": "adjective"
            },
            {
                "word": "crash barrier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a vehicle crashes or the driver crashes it, it hits an object or another vehicle, causing damage",
                    "vi": "nếu xe bị va chạm hoặc người lái xe đâm phải vật thể hoặc phương tiện khác, gây hư hỏng"
                },
                "examples": [
                    {
                        "en": "I was terrified that the plane would crash.",
                        "vi": "Tôi vô cùng sợ hãi rằng máy bay sẽ gặp sự cố."
                    },
                    {
                        "en": "We're going to crash, aren't we?",
                        "vi": "Chúng ta sẽ gặp sự cố, phải không?"
                    },
                    {
                        "en": "crash into something A truck went out of control and crashed into the back of a bus.",
                        "vi": "đâm vào một cái gì đó Một chiếc xe tải đã mất kiểm soát và đâm vào phía sau của một chiếc xe buýt."
                    },
                    {
                        "en": "crash something I crashed my motorcycle on the way to a training session.",
                        "vi": "va chạm một cái gì đó Tôi đã đâm xe máy của tôi trên đường đến một buổi tập huấn."
                    },
                    {
                        "en": "crash something into something He crashed his car into a wall.",
                        "vi": "đâm một cái gì đó vào một cái gì đó Anh ấy đã đâm xe của anh ấy vào một bức tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit something hard while moving, causing noise and/or damage; to make something hit somebody/something in this way",
                    "vi": "va chạm mạnh vào vật gì đó khi đang di chuyển, gây ra tiếng ồn và / hoặc hư hỏng; để làm cho một cái gì đó đánh ai đó / cái gì đó theo cách này"
                },
                "examples": [
                    {
                        "en": "crash + adv./prep. A brick crashed through the window.",
                        "vi": "sụp đổ + adv./prep. Một viên gạch đâm xuyên qua cửa sổ."
                    },
                    {
                        "en": "With a sweep of his hand he sent the glasses crashing to the floor.",
                        "vi": "Với một cái quét tay của mình, anh ấy đã làm cho chiếc kính rơi xuống sàn."
                    },
                    {
                        "en": "The huge tree came crashing down during the storm.",
                        "vi": "Cây to bị đổ trong cơn bão."
                    },
                    {
                        "en": "Waves crashed against the shore.",
                        "vi": "Sóng vỗ vào bờ."
                    },
                    {
                        "en": "crash + adj. The door crashed open.",
                        "vi": "sự sụp đổ + adj. Cánh cửa bị sập mở."
                    },
                    {
                        "en": "crash something + adj. She stormed out of the room and crashed the door shut behind her.",
                        "vi": "sụp đổ cái gì đó + adj. Cô lao ra khỏi phòng và đóng sập cửa lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a loud noise",
                    "vi": "tạo ra một tiếng ồn lớn"
                },
                "examples": [
                    {
                        "en": "Thunder crashed overhead.",
                        "vi": "Sấm sét rơi trên đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lose value or fail suddenly and quickly",
                    "vi": "mất giá trị hoặc thất bại đột ngột và nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Share prices crashed to an all-time low yesterday.",
                        "vi": "Giá cổ phiếu đã giảm xuống mức thấp nhất mọi thời đại vào ngày hôm qua."
                    },
                    {
                        "en": "The company crashed with debts of £50 million.",
                        "vi": "Công ty rơi vào tình trạng nợ 50 triệu bảng Anh."
                    },
                    {
                        "en": "We were badly affected when the stock market crashed in 2008.",
                        "vi": "Chúng tôi đã bị ảnh hưởng nặng nề khi thị trường chứng khoán sụp đổ vào năm 2008."
                    },
                    {
                        "en": "Their investments were wiped out when technology stocks crashed.",
                        "vi": "Các khoản đầu tư của họ đã bị xóa sổ khi cổ phiếu công nghệ lao dốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a computer crashes or you crash a computer, it stops working suddenly",
                    "vi": "nếu một máy tính bị treo hoặc bạn làm hỏng máy tính, nó ngừng hoạt động đột ngột"
                },
                "examples": [
                    {
                        "en": "Files can be lost if the system suddenly crashes.",
                        "vi": "Các tập tin có thể bị mất nếu hệ thống đột ngột bị treo."
                    },
                    {
                        "en": "Their website crashed repeatedly on Tuesday.",
                        "vi": "Trang web của họ đã bị sập liên tục vào thứ Ba."
                    },
                    {
                        "en": "crash something A surge of traffic crashed their servers.",
                        "vi": "sự cố một cái gì đó Một lượng truy cập tăng cao đã làm hỏng máy chủ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "gatecrash (= to go to a party or social event without being invited)",
                    "vi": "gatecrash (= đi dự tiệc hoặc sự kiện xã hội mà không được mời)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to lose very badly in a sports game",
                    "vi": "thua rất nặng trong một trò chơi thể thao"
                },
                "examples": [
                    {
                        "en": "The team crashed to their worst defeat this season.",
                        "vi": "Đội đã phải nhận thất bại tồi tệ nhất trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to sleep, especially suddenly or in a place where you do not usually sleep",
                    "vi": "đi ngủ, đặc biệt là đột ngột hoặc ở một nơi mà bạn không thường ngủ"
                },
                "examples": [
                    {
                        "en": "I was so tired I crashed out on the sofa.",
                        "vi": "Tôi quá mệt mỏi nên ngã ra ghế sofa."
                    },
                    {
                        "en": "I've come to crash on your floor for a couple of nights.",
                        "vi": "Tôi đã đến đụng sàn của bạn trong vài đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody crashes, their heart stops beating",
                    "vi": "nếu ai đó gặp sự cố, tim họ ngừng đập"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go wrong or to fail badly and suddenly",
                    "vi": "đi sai hoặc thất bại nặng nề và đột ngột"
                },
                "examples": [
                    {
                        "en": "His career crashed and burned after he threatened a journalist.",
                        "vi": "Sự nghiệp của anh ta sụp đổ và bùng cháy sau khi anh ta đe dọa một nhà báo."
                    },
                    {
                        "en": "The stock markets are getting ready to crash and burn.",
                        "vi": "Các thị trường chứng khoán đang sẵn sàng sụp đổ và bùng cháy."
                    },
                    {
                        "en": "She continued to crash and burn through personal controversies that included driving drunk.",
                        "vi": "Cô tiếp tục va chạm và bùng cháy qua những tranh cãi cá nhân bao gồm việc lái xe trong tình trạng say rượu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very boring person, activity, event or subject",
                    "vi": "một người, hoạt động, sự kiện hoặc chủ đề rất nhàm chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5bfbee40f4e41949e107f026e860494",
        "word": "error correction",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈerə kərekʃn/",
            "us": "/ˈerər kərekʃn/"
        },
        "nearby": [
            {
                "word": "erroneously",
                "pos": "adverb"
            },
            {
                "word": "error",
                "pos": "noun"
            },
            {
                "word": "error correction",
                "pos": "noun"
            },
            {
                "word": "error message",
                "pos": "noun"
            },
            {
                "word": "ersatz",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a process by which a computer corrects mistakes in data",
                    "vi": "một quy trình mà máy tính sửa chữa những sai sót trong dữ liệu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f68c146d71b491d9f5f8274bb1c06cd",
        "word": "hack",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/hæk/",
            "us": "/hæk/"
        },
        "nearby": [
            {
                "word": "habitué",
                "pos": "noun"
            },
            {
                "word": "hacienda",
                "pos": "noun"
            },
            {
                "word": "hack",
                "pos": "verb"
            },
            {
                "word": "hack",
                "pos": "noun"
            },
            {
                "word": "hackathon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit and cut somebody/something in a rough, heavy way",
                    "vi": "đánh và cắt ai đó / cái gì đó một cách thô bạo, nặng nề"
                },
                "examples": [
                    {
                        "en": "hack somebody/something + adv./prep. I hacked the dead branches off.",
                        "vi": "hack ai đó / cái gì đó + adv./prep. Tôi đã bẻ gãy những cành cây chết."
                    },
                    {
                        "en": "They were hacked to death as they tried to escape.",
                        "vi": "Họ đã bị hack đến chết khi cố gắng trốn thoát."
                    },
                    {
                        "en": "We had to hack our way through the jungle.",
                        "vi": "Chúng tôi phải đi xuyên rừng."
                    },
                    {
                        "en": "+ adv./prep. We hacked away at the bushes.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to kick something roughly or without control",
                    "vi": "đá một cái gì đó thô bạo hoặc không có kiểm soát"
                },
                "examples": [
                    {
                        "en": "He hacked the ball away.",
                        "vi": "Anh ta hack bóng đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to secretly find a way of looking at and/or changing information on somebody else’s computer system without permission",
                    "vi": "bí mật tìm cách xem và / hoặc thay đổi thông tin trên hệ thống máy tính của người khác mà không được phép"
                },
                "examples": [
                    {
                        "en": "hack into something He hacked into the bank's computer.",
                        "vi": "hack vào một cái gì đó Anh ta đã xâm nhập vào máy tính của ngân hàng."
                    },
                    {
                        "en": "hack something They had hacked secret data.",
                        "vi": "hack cái gì đó Họ đã hack dữ liệu bí mật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work together informally and often quickly with other people to create a program using different technologies",
                    "vi": "làm việc cùng nhau một cách không chính thức và thường xuyên nhanh chóng với những người khác để tạo ra một chương trình sử dụng các công nghệ khác nhau"
                },
                "examples": [
                    {
                        "en": "We spent the morning hacking around with HTML and building web pages.",
                        "vi": "Chúng tôi đã dành cả buổi sáng để hack HTML và xây dựng các trang web."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able/not able to manage in a particular situation",
                    "vi": "để có thể / không thể quản lý trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Lots of people leave this job because they can't hack it.",
                        "vi": "Rất nhiều người rời bỏ công việc này vì họ không thể hack nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ride a horse for pleasure",
                    "vi": "cưỡi ngựa cho vui"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to drive a taxi",
                    "vi": "lái taxi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4be25687edbf44b0b56dd9bb49efd26a",
        "word": "cybercrime",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsaɪbəkraɪm/",
            "us": "/ˈsaɪbərkraɪm/"
        },
        "nearby": [
            {
                "word": "cyberbullying",
                "pos": "noun"
            },
            {
                "word": "cybercafe",
                "pos": "noun"
            },
            {
                "word": "cybercrime",
                "pos": "noun"
            },
            {
                "word": "the Cybermen",
                "pos": "noun"
            },
            {
                "word": "Cyber Monday",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "crime that is committed using the internet, for example by stealing somebody’s personal or bank details or by infecting their computer with a virus",
                    "vi": "tội phạm được thực hiện bằng cách sử dụng internet, chẳng hạn như bằng cách lấy cắp thông tin cá nhân hoặc ngân hàng của ai đó hoặc bằng cách lây nhiễm vi-rút vào máy tính của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba4926b6b76b41a0b0dab4312e00349e",
        "word": "down",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/daʊn/",
            "us": "/daʊn/"
        },
        "nearby": [
            {
                "word": "down",
                "pos": "preposition"
            },
            {
                "word": "down",
                "pos": "verb"
            },
            {
                "word": "down",
                "pos": "adjective"
            },
            {
                "word": "down",
                "pos": "noun"
            },
            {
                "word": "down and out",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "moving or directed downwards or away from a place",
                    "vi": "di chuyển hoặc hướng xuống dưới hoặc ra khỏi một nơi"
                },
                "examples": [
                    {
                        "en": "The down escalator isn't working.",
                        "vi": "Thang cuốn xuống không hoạt động."
                    },
                    {
                        "en": "Click the down arrow.",
                        "vi": "Nhấp vào mũi tên xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad or depressed",
                    "vi": "buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "I feel a bit down today.",
                        "vi": "Tôi cảm thấy một chút xuống ngày hôm nay."
                    },
                    {
                        "en": "You look a bit down. Is something the matter?",
                        "vi": "Bạn nhìn xuống một chút. Có gì sai không?"
                    },
                    {
                        "en": "Don't let the weather get you down.",
                        "vi": "Đừng để thời tiết làm bạn thất vọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working",
                    "vi": "không làm việc"
                },
                "examples": [
                    {
                        "en": "The system was down all morning.",
                        "vi": "Hệ thống đã ngừng hoạt động cả buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no money because of a period of bad luck",
                    "vi": "không có tiền vì một khoảng thời gian kém may mắn"
                },
                "examples": [
                    {
                        "en": "In the movie they play two jazz musicians who are down on their luck.",
                        "vi": "Trong phim, họ đóng vai hai nhạc sĩ nhạc jazz đang thất vọng với vận may của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy and depressed",
                    "vi": "không vui và chán nản"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to hurt somebody when they are already defeated",
                    "vi": "tiếp tục làm tổn thương ai đó khi họ đã bị đánh bại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to hurt somebody when they are already defeated, etc.",
                    "vi": "để tiếp tục làm tổn thương ai đó khi họ đã bị đánh bại, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "06e9ca09c03d421aa8a8a44737cd0df7",
        "word": "hacker",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhækə(r)/",
            "us": "/ˈhækər/"
        },
        "nearby": [
            {
                "word": "hackathon",
                "pos": "noun"
            },
            {
                "word": "hacked off",
                "pos": "adjective"
            },
            {
                "word": "hacker",
                "pos": "noun"
            },
            {
                "word": "hacking",
                "pos": "noun"
            },
            {
                "word": "hacking cough",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who uses computers to get access to data in somebody else's computer or phone system without permission",
                    "vi": "một người sử dụng máy tính để truy cập vào dữ liệu trong hệ thống máy tính hoặc điện thoại của người khác mà không được phép"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who uses or writes computer programs with enthusiasm and skill",
                    "vi": "một người sử dụng hoặc viết các chương trình máy tính với sự nhiệt tình và kỹ năng"
                },
                "examples": [
                    {
                        "en": "The software is so complicated that only experienced hackers can use it.",
                        "vi": "Phần mềm này rất phức tạp nên chỉ những hacker có kinh nghiệm mới có thể sử dụng nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "f44b92fbe10d48fdb2b7b07024fdacd7",
        "word": "help desk",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhelp desk/",
            "us": "/ˈhelp desk/"
        },
        "nearby": [
            {
                "word": "help",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "exclamation"
            },
            {
                "word": "help desk",
                "pos": "noun"
            },
            {
                "word": "helper",
                "pos": "noun"
            },
            {
                "word": "helpful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a service, usually in a business company, that gives people information and help, especially if they are having problems with a computer",
                    "vi": "một dịch vụ, thường là trong một công ty kinh doanh, cung cấp cho mọi người thông tin và sự trợ giúp, đặc biệt nếu họ đang gặp sự cố với máy tính"
                },
                "examples": [
                    {
                        "en": "Staff experiencing problems with their computers should call the help desk.",
                        "vi": "Nhân viên gặp sự cố với máy tính của họ nên gọi cho bộ phận trợ giúp."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce00ec807dc948b8b18b238e7f475739",
        "word": "infect",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈfekt/",
            "us": "/ɪnˈfekt/"
        },
        "nearby": [
            {
                "word": "infatuated",
                "pos": "adjective"
            },
            {
                "word": "infatuation",
                "pos": "noun"
            },
            {
                "word": "infect",
                "pos": "verb"
            },
            {
                "word": "infected",
                "pos": "adjective"
            },
            {
                "word": "infection",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a disease or an illness spread to a person, an animal or a plant",
                    "vi": "làm cho một căn bệnh hoặc một bệnh tật lây lan sang người, động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "infect somebody/something (with something) It is not possible to infect another person through kissing.",
                        "vi": "lây nhiễm cho ai đó / cái gì đó (với cái gì đó) Không thể lây nhiễm cho người khác thông qua nụ hôn."
                    },
                    {
                        "en": "(be) infected with something people infected with HIV",
                        "vi": "(bị) nhiễm thứ gì đó mà người bị nhiễm HIV"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a substance contain harmful bacteria that can spread disease",
                    "vi": "để tạo ra một chất có chứa vi khuẩn có hại có thể lây lan bệnh tật"
                },
                "examples": [
                    {
                        "en": "be infected (with something) The eggs were infected with salmonella.",
                        "vi": "bị nhiễm khuẩn (với thứ gì đó) Trứng bị nhiễm khuẩn salmonella."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a computer virus spread to another computer or program",
                    "vi": "để làm cho vi-rút máy tính lây lan sang máy tính hoặc chương trình khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody share a particular feeling",
                    "vi": "để làm cho ai đó chia sẻ một cảm giác cụ thể"
                },
                "examples": [
                    {
                        "en": "She infected the children with her enthusiasm for music.",
                        "vi": "Cô truyền cho bọn trẻ sự nhiệt tình của mình với âm nhạc."
                    },
                    {
                        "en": "The whole room was soon infected by his laughter.",
                        "vi": "Cả căn phòng đã sớm bị tiếng cười của anh làm cho nhiễm bệnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa4c606ef5e54cc69ac15ceb62686c11",
        "word": "overload",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌəʊvəˈləʊd/",
            "us": "/ˌəʊvərˈləʊd/"
        },
        "nearby": [
            {
                "word": "overleaf",
                "pos": "adverb"
            },
            {
                "word": "overlie",
                "pos": "verb"
            },
            {
                "word": "overload",
                "pos": "verb"
            },
            {
                "word": "overload",
                "pos": "noun"
            },
            {
                "word": "overlong",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put too great a load on something",
                    "vi": "đặt một tải trọng quá lớn vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "an overloaded truck",
                        "vi": "một chiếc xe tải quá tải"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody too much of something",
                    "vi": "để cung cấp cho ai đó quá nhiều thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He's overloaded with responsibilities.",
                        "vi": "Anh ấy đang quá tải với những trách nhiệm."
                    },
                    {
                        "en": "Don't overload the students with information.",
                        "vi": "Đừng quá tải thông tin của học sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put too great a demand on a computer, an electrical system, etc. causing it to fail",
                    "vi": "đặt ra yêu cầu quá lớn đối với máy tính, hệ thống điện, v.v. khiến máy tính bị lỗi"
                },
                "examples": [
                    {
                        "en": "The lights went out because the system was overloaded.",
                        "vi": "Đèn tắt do hệ thống quá tải."
                    }
                ]
            }
        ]
    },
    {
        "id": "33e91d0396e54f52ae595bdaa3567d0a",
        "word": "overload",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈəʊvələʊd/",
            "us": "/ˈəʊvərləʊd/"
        },
        "nearby": [
            {
                "word": "overlie",
                "pos": "verb"
            },
            {
                "word": "overload",
                "pos": "verb"
            },
            {
                "word": "overload",
                "pos": "noun"
            },
            {
                "word": "overlong",
                "pos": "adjective"
            },
            {
                "word": "overlook",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too much of something",
                    "vi": "quá nhiều thứ"
                },
                "examples": [
                    {
                        "en": "In these days of technological change we all suffer from information overload.",
                        "vi": "Trong thời buổi công nghệ thay đổi như hiện nay, tất cả chúng ta đều bị quá tải thông tin."
                    },
                    {
                        "en": "An electrical overload caused the fuse to blow.",
                        "vi": "Quá tải điện làm nổ cầu chì."
                    }
                ]
            }
        ]
    },
    {
        "id": "4668c3c6af094fbb93dd3d409e68deab",
        "word": "time out",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "timely",
                "pos": "adjective"
            },
            {
                "word": "time machine",
                "pos": "noun"
            },
            {
                "word": "time out",
                "pos": "phrasal verb"
            },
            {
                "word": "timeout",
                "pos": "noun"
            },
            {
                "word": "Time Out",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(of a computer program or task) to turn off, or turn something off, after a particular length of time even if the user has not finished",
                    "vi": "(của một chương trình hoặc tác vụ máy tính) để tắt hoặc tắt thứ gì đó, sau một khoảng thời gian cụ thể ngay cả khi người dùng chưa hoàn thành"
                },
                "examples": [
                    {
                        "en": "My satellite connection timed out—it was so frustrating.",
                        "vi": "Kết nối vệ tinh của tôi đã hết thời gian chờ — điều đó thật khó chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "35f016f091634de59cfc80e27b2d44fa",
        "word": "botnet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒtnet/",
            "us": "/ˈbɑːtnet/"
        },
        "nearby": [
            {
                "word": "the Earl of Bothwell",
                "pos": ""
            },
            {
                "word": "bothy",
                "pos": "noun"
            },
            {
                "word": "botnet",
                "pos": "noun"
            },
            {
                "word": "Botox",
                "pos": "verb"
            },
            {
                "word": "Botox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of computers that are controlled by malware (= software such as a virus that the users do not know about or want)",
                    "vi": "một nhóm máy tính bị phần mềm độc hại kiểm soát (= phần mềm chẳng hạn như vi-rút mà người dùng không biết hoặc không muốn)"
                },
                "examples": [
                    {
                        "en": "The internet has been flooded with botnets, unnoticed by the public.",
                        "vi": "Internet đã tràn ngập các mạng botnet, không được công chúng chú ý."
                    },
                    {
                        "en": "Botnet attacks can be used to damage a competitor’s website.",
                        "vi": "Các cuộc tấn công botnet có thể được sử dụng để làm hỏng trang web của đối thủ cạnh tranh."
                    }
                ]
            }
        ]
    },
    {
        "id": "00fb17827d7a4da199a967b8d52d0854",
        "word": "buggy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌɡi/",
            "us": "/ˈbʌɡi/"
        },
        "nearby": [
            {
                "word": "Buggins' turn",
                "pos": "noun"
            },
            {
                "word": "buggy",
                "pos": "noun"
            },
            {
                "word": "buggy",
                "pos": "adjective"
            },
            {
                "word": "bugle",
                "pos": "noun"
            },
            {
                "word": "bugler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "full of bugs so it does not work correctly",
                    "vi": "đầy lỗi nên nó không hoạt động chính xác"
                },
                "examples": [
                    {
                        "en": "The software is buggy and slow.",
                        "vi": "Phần mềm có lỗi và chậm."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of bugs (= insects)",
                    "vi": "đầy bọ (= côn trùng)"
                },
                "examples": [
                    {
                        "en": "The summers are hot and humid and buggy.",
                        "vi": "Mùa hè nóng và ẩm ướt và nhiều lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": [
                    {
                        "en": "With this app, kids go buggy over math.",
                        "vi": "Với ứng dụng này, trẻ em sẽ giải toán."
                    }
                ]
            },
            {
                "define": {
                    "en": "sticking out, especially in a way that looks crazy",
                    "vi": "gắn bó, đặc biệt là theo một cách trông có vẻ điên rồ"
                },
                "examples": [
                    {
                        "en": "I do not believe in little alien dudes with buggy eyes.",
                        "vi": "Tôi không tin vào những anh chàng người ngoài hành tinh nhỏ bé với đôi mắt tinh ranh."
                    },
                    {
                        "en": "My eyes went buggy just looking at them.",
                        "vi": "Mắt tôi cứ trừng trừng khi nhìn vào chúng."
                    }
                ]
            }
        ]
    },
    {
        "id": "986680afde224361996b53b601cfe53c",
        "word": "corrupt",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈrʌpt/",
            "us": "/kəˈrʌpt/"
        },
        "nearby": [
            {
                "word": "corrugated",
                "pos": "adjective"
            },
            {
                "word": "corrupt",
                "pos": "adjective"
            },
            {
                "word": "corrupt",
                "pos": "verb"
            },
            {
                "word": "corruptible",
                "pos": "adjective"
            },
            {
                "word": "corruption",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have a bad effect on somebody and make them behave in a way that is not honest or moral",
                    "vi": "gây ảnh hưởng xấu đến ai đó và khiến họ cư xử theo cách không trung thực hoặc đạo đức"
                },
                "examples": [
                    {
                        "en": "He was corrupted by power and ambition.",
                        "vi": "Anh ta đã bị tha hóa bởi quyền lực và tham vọng."
                    },
                    {
                        "en": "the corrupting effects of great wealth",
                        "vi": "tác động hư hỏng của sự giàu có lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the original form of something, so that it is damaged or made less good in some way",
                    "vi": "để thay đổi hình thức ban đầu của một thứ gì đó, để nó bị hư hỏng hoặc kém đi theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a corrupted form of Buddhism",
                        "vi": "một hình thức hư hỏng của Phật giáo"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause mistakes to appear in a computer file, etc. with the result that the information in it is no longer correct; (of a computer file, etc.) to start containing mistakes",
                    "vi": "gây ra lỗi xuất hiện trong tệp máy tính, v.v. với kết quả là thông tin trong đó không còn chính xác; (của một tệp máy tính, v.v.) để bắt đầu chứa các lỗi"
                },
                "examples": [
                    {
                        "en": "The program has somehow corrupted the system files.",
                        "vi": "Chương trình đã làm hỏng các tệp hệ thống bằng cách nào đó."
                    },
                    {
                        "en": "corrupted data",
                        "vi": "dữ liệu bị hỏng"
                    },
                    {
                        "en": "The disk will corrupt if it is overloaded.",
                        "vi": "Đĩa sẽ bị hỏng nếu nó bị quá tải."
                    }
                ]
            }
        ]
    },
    {
        "id": "df996b43482940a88708de544258345a",
        "word": "corruption",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈrʌpʃn/",
            "us": "/kəˈrʌpʃn/"
        },
        "nearby": [
            {
                "word": "corrupt",
                "pos": "verb"
            },
            {
                "word": "corruptible",
                "pos": "adjective"
            },
            {
                "word": "corruption",
                "pos": "noun"
            },
            {
                "word": "corruptly",
                "pos": "adverb"
            },
            {
                "word": "corsage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dishonest or illegal behaviour, especially of people in authority",
                    "vi": "hành vi không trung thực hoặc bất hợp pháp, đặc biệt là của những người có thẩm quyền"
                },
                "examples": [
                    {
                        "en": "allegations of bribery and corruption",
                        "vi": "cáo buộc hối lộ và tham nhũng"
                    },
                    {
                        "en": "The new district attorney has promised to fight police corruption.",
                        "vi": "Luật sư mới của quận đã hứa sẽ chống lại sự tham nhũng của cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or effect of making somebody change from moral to immoral standards of behaviour",
                    "vi": "hành động hoặc tác động của việc làm cho ai đó thay đổi từ các tiêu chuẩn hành vi đạo đức sang vô đạo đức"
                },
                "examples": [
                    {
                        "en": "He claimed that sex and violence on TV led to the corruption of young people.",
                        "vi": "Ông cho rằng tình dục và bạo lực trên TV đã dẫn đến sự tha hóa của giới trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the form of a word or phrase that has become changed from its original form in some way; the process by which a word or phrase changes form in this way",
                    "vi": "hình thức của một từ hoặc cụm từ đã bị thay đổi so với hình thức ban đầu của nó theo một cách nào đó; quá trình mà một từ hoặc cụm từ thay đổi hình thức theo cách này"
                },
                "examples": [
                    {
                        "en": "The word ‘holiday’ is a corruption of ‘holy day’.",
                        "vi": "Từ 'kỳ nghỉ' là sự biến chất của 'ngày thánh'."
                    },
                    {
                        "en": "He thought it was possible to secure the language from corruption and decay.",
                        "vi": "Ông nghĩ rằng có thể bảo đảm ngôn ngữ này không bị hư hỏng và mục nát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect when data is changed by accident in a computer system due to hardware or software failure",
                    "vi": "ảnh hưởng khi dữ liệu bị thay đổi ngẫu nhiên trong hệ thống máy tính do lỗi phần cứng hoặc phần mềm"
                },
                "examples": [
                    {
                        "en": "A failure of a hard disk can cause unrecoverable data corruption.",
                        "vi": "Sự cố của một đĩa cứng có thể gây ra lỗi dữ liệu không thể khôi phục được."
                    }
                ]
            }
        ]
    },
    {
        "id": "6512d9730b2047aebcd8fef769325f36",
        "word": "cracker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrækə(r)/",
            "us": "/ˈkrækər/"
        },
        "nearby": [
            {
                "word": "cracked",
                "pos": "adjective"
            },
            {
                "word": "cracked wheat",
                "pos": "noun"
            },
            {
                "word": "cracker",
                "pos": "noun"
            },
            {
                "word": "cracker-barrel philosophy",
                "pos": "noun"
            },
            {
                "word": "crackerjack",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin dry biscuit that often tastes of salt and is usually eaten with cheese",
                    "vi": "một loại bánh quy khô mỏng thường có vị muối và thường được ăn với pho mát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a tube of coloured paper that makes a loud explosive sound when it is pulled open by two people. Crackers usually contain a paper hat, a small present and a joke, and are used in the UK at Christmas parties and meals.",
                    "vi": "một ống giấy màu phát ra tiếng nổ lớn khi được hai người kéo mở. Bánh quy giòn thường chứa một chiếc mũ giấy, một món quà nhỏ và một trò đùa, và được sử dụng ở Anh trong các bữa tiệc và bữa ăn Giáng sinh."
                },
                "examples": [
                    {
                        "en": "Who wants to pull this cracker with me?",
                        "vi": "Ai muốn kéo cracker này với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you think is very good, funny, etc.",
                    "vi": "một cái gì đó mà bạn nghĩ là rất hay, vui nhộn, v.v."
                },
                "examples": [
                    {
                        "en": "It was a cracker of a goal.",
                        "vi": "Đó là một mục tiêu."
                    },
                    {
                        "en": "I've got a joke for you. It's a real cracker!",
                        "vi": "Tôi có một trò đùa cho bạn. Đó là một cracker thực sự!"
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word for a poor white person with little education from the southern US",
                    "vi": "một từ xúc phạm cho một người da trắng nghèo, ít học đến từ miền nam Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who illegally finds a way of looking at or stealing information on somebody else’s computer system",
                    "vi": "một người tìm cách xem hoặc lấy cắp thông tin bất hợp pháp trên hệ thống máy tính của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an attractive woman",
                    "vi": "một người phụ nữ hấp dẫn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7d70c2d4f48b4b65a87216fbb0571f41",
        "word": "debug",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdiːbʌɡ/",
            "us": "/ˈdiːbʌɡ/"
        },
        "nearby": [
            {
                "word": "debtor",
                "pos": "noun"
            },
            {
                "word": "debt relief",
                "pos": "noun"
            },
            {
                "word": "debug",
                "pos": "noun"
            },
            {
                "word": "debug",
                "pos": "verb"
            },
            {
                "word": "debugger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of looking for and removing faults in a computer program",
                    "vi": "quá trình tìm kiếm và loại bỏ các lỗi trong chương trình máy tính"
                },
                "examples": [
                    {
                        "en": "The new website is in its final stages of debug and will launch next month.",
                        "vi": "Trang web mới đang trong giai đoạn gỡ lỗi cuối cùng và sẽ ra mắt vào tháng tới."
                    },
                    {
                        "en": "The knowledge you acquire from debugs is invaluable.",
                        "vi": "Kiến thức bạn thu được từ gỡ lỗi là vô giá."
                    }
                ]
            }
        ]
    },
    {
        "id": "13602eb46e534b6bbd5ba8e0a5426c78",
        "word": "debug",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiːˈbʌɡ/",
            "us": "/ˌdiːˈbʌɡ/"
        },
        "nearby": [
            {
                "word": "debt relief",
                "pos": "noun"
            },
            {
                "word": "debug",
                "pos": "noun"
            },
            {
                "word": "debug",
                "pos": "verb"
            },
            {
                "word": "debugger",
                "pos": "noun"
            },
            {
                "word": "debunk",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look for and remove the faults in a computer program",
                    "vi": "để tìm và loại bỏ các lỗi trong chương trình máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3bab727ea67c4e019d1f8ed3ffc719a8",
        "word": "disinfect",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdɪsɪnˈfekt/",
            "us": "/ˌdɪsɪnˈfekt/"
        },
        "nearby": [
            {
                "word": "disinclination",
                "pos": "noun"
            },
            {
                "word": "disinclined",
                "pos": "adjective"
            },
            {
                "word": "disinfect",
                "pos": "verb"
            },
            {
                "word": "disinfectant",
                "pos": "noun"
            },
            {
                "word": "disinfection",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to clean something using a substance that kills bacteria",
                    "vi": "để làm sạch thứ gì đó bằng cách sử dụng chất diệt vi khuẩn"
                },
                "examples": [
                    {
                        "en": "to disinfect a surface/room/wound",
                        "vi": "để khử trùng bề mặt / phòng / vết thương"
                    }
                ]
            },
            {
                "define": {
                    "en": "to run a computer program to get rid of a computer virus",
                    "vi": "chạy chương trình máy tính để loại bỏ vi rút máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d734431a9b14efda9da66f696bda0d0",
        "word": "freeze",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/friːz/",
            "us": "/friːz/"
        },
        "nearby": [
            {
                "word": "freewheeling",
                "pos": "adjective"
            },
            {
                "word": "free will",
                "pos": "noun"
            },
            {
                "word": "freeze",
                "pos": "verb"
            },
            {
                "word": "freeze",
                "pos": "noun"
            },
            {
                "word": "freeze-dry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become hard, and often turn to ice, as a result of extreme cold; to make something do this",
                    "vi": "trở nên cứng và thường chuyển sang đóng băng do quá lạnh; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Water freezes at 0°C.",
                        "vi": "Nước đóng băng ở 0 ° C."
                    },
                    {
                        "en": "It's so cold that even the river has frozen.",
                        "vi": "Nó lạnh đến nỗi ngay cả dòng sông cũng đóng băng."
                    },
                    {
                        "en": "freeze something The cold weather had frozen the ground.",
                        "vi": "đóng băng cái gì đó Thời tiết lạnh giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "freeze + adj. The clothes froze solid on the washing line.",
                        "vi": "đóng băng + adj. Quần áo đông cứng trên dây giặt."
                    },
                    {
                        "en": "freeze something + adj. The frost had frozen the ground hard.",
                        "vi": "đóng băng cái gì đó + adj. Băng giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "Last year's cold spell froze the lake solid.",
                        "vi": "Đợt lạnh năm ngoái làm đông cứng mặt hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a pipe, lock or machine freezes, or something freezes it, it becomes blocked with frozen liquid and therefore cannot be used",
                    "vi": "nếu một đường ống, ổ khóa hoặc máy bị đóng băng, hoặc thứ gì đó đóng băng nó, nó sẽ bị chặn bởi chất lỏng đông lạnh và do đó không thể sử dụng được"
                },
                "examples": [
                    {
                        "en": "The pipes have frozen, so we've got no water.",
                        "vi": "Các đường ống đã đóng băng, vì vậy chúng tôi không có nước."
                    },
                    {
                        "en": "freeze up I kept the car running to stop the engine freezing up.",
                        "vi": "đóng băng Tôi tiếp tục cho xe chạy để ngăn động cơ đóng băng lên."
                    },
                    {
                        "en": "freeze something Ten degrees of frost had frozen the lock on the car.",
                        "vi": "đóng băng một thứ gì đó Băng giá mười độ đã đóng băng ổ khóa trên xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it freezes, the weather is at or below 0° Celsius",
                    "vi": "khi nó đóng băng, thời tiết bằng hoặc dưới 0 ° C"
                },
                "examples": [
                    {
                        "en": "It may freeze tonight, so bring those plants inside.",
                        "vi": "Tối nay trời có thể đóng băng, vì vậy hãy mang những cây đó vào trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very cold; to be so cold that you die",
                    "vi": "rất lạnh; lạnh đến mức bạn chết"
                },
                "examples": [
                    {
                        "en": "Every time she opens the window we all freeze.",
                        "vi": "Mỗi lần cô ấy mở cửa sổ, tất cả chúng tôi đều đông cứng."
                    },
                    {
                        "en": "Two men froze to death on the mountain.",
                        "vi": "Hai người đàn ông chết cóng trên núi."
                    },
                    {
                        "en": "freeze somebody Two men were frozen to death on the mountain.",
                        "vi": "đóng băng ai đó Hai người đàn ông bị chết cóng trên núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep something, especially food, at a very low temperature in order to preserve it",
                    "vi": "để giữ một thứ gì đó, đặc biệt là thực phẩm, ở nhiệt độ rất thấp để bảo quản"
                },
                "examples": [
                    {
                        "en": "Can you freeze this cake?",
                        "vi": "Bạn có thể đông lạnh chiếc bánh này không?"
                    },
                    {
                        "en": "The organ samples were immediately frozen in liquid nitrogen.",
                        "vi": "Các mẫu nội tạng ngay lập tức được làm đông lạnh trong nitơ lỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be kept at a very low temperature",
                    "vi": "để có thể được giữ ở nhiệt độ rất thấp"
                },
                "examples": [
                    {
                        "en": "Some fruits freeze better than others.",
                        "vi": "Một số loại trái cây đóng băng tốt hơn những loại khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop moving suddenly because of fear, etc.",
                    "vi": "ngừng di chuyển đột ngột vì sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "I froze with terror as the door slowly opened.",
                        "vi": "Tôi sững người vì sợ hãi khi cánh cửa từ từ mở ra."
                    },
                    {
                        "en": "(figurative) The smile froze on her lips.",
                        "vi": "(nghĩa bóng) Nụ cười vụt tắt trên môi."
                    },
                    {
                        "en": "The police officer shouted ‘Freeze!’ and the man dropped the gun.",
                        "vi": "Viên cảnh sát hét lên 'Đóng băng!' và người đàn ông đã đánh rơi súng."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a computer screen freezes, you cannot move any of the images, etc. on it, because there is a problem with the system",
                    "vi": "khi màn hình máy tính bị treo, bạn không thể di chuyển bất kỳ hình ảnh nào, v.v. trên đó, do có sự cố với hệ thống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop a film or video in order to look at a particular picture",
                    "vi": "dừng phim hoặc video để xem một bức tranh cụ thể"
                },
                "examples": [
                    {
                        "en": "Freeze the action there!",
                        "vi": "Đóng băng hành động ở đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold wages, prices, etc. at a fixed level for a period of time",
                    "vi": "giữ tiền lương, giá cả, v.v. ở một mức cố định trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "Salaries have been frozen for the current year.",
                        "vi": "Tiền lương đã bị đóng băng cho năm hiện tại."
                    },
                    {
                        "en": "Prices have been frozen at this level for over a year now.",
                        "vi": "Giá đã bị đóng băng ở mức này trong hơn một năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent money, a bank account, etc. from being used by getting a court order which bans it",
                    "vi": "để ngăn tiền, tài khoản ngân hàng, v.v. bị sử dụng bằng cách nhận lệnh tòa cấm tài khoản đó"
                },
                "examples": [
                    {
                        "en": "The company's assets have been frozen.",
                        "vi": "Tài sản của công ty đã bị phong toả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly stop because something has frightened or surprised you",
                    "vi": "đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Jess froze in her tracks and took a deep breath.",
                        "vi": "Jess lặng người đi và hít thở sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly make somebody stop by frightening or surprising them; to suddenly stop because something has frightened or surprised you",
                    "vi": "đột nhiên khiến ai đó dừng lại bằng cách làm họ sợ hãi hoặc ngạc nhiên; đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The question stopped Alice in her tracks.",
                        "vi": "Câu hỏi khiến Alice dừng lại."
                    },
                    {
                        "en": "Suddenly he stopped dead in his tracks: what was he doing?",
                        "vi": "Đột nhiên anh ấy chết sững lại: anh ấy đang làm gì vậy?"
                    },
                    {
                        "en": "(figurative) The disease was stopped in its tracks by immunization programmes.",
                        "vi": "(nghĩa bóng) Căn bệnh này đã được chặn đứng bởi các chương trình chủng ngừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "d8496ebd894e4d778a8bd297ab044b23",
        "word": "hard error",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhɑːd ˈerə(r)/",
            "us": "/ˌhɑːrd ˈerər/"
        },
        "nearby": [
            {
                "word": "harden",
                "pos": "verb"
            },
            {
                "word": "hardening",
                "pos": "noun"
            },
            {
                "word": "hard error",
                "pos": "noun"
            },
            {
                "word": "hard-faced",
                "pos": "adjective"
            },
            {
                "word": "hard-fought",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an error or a fault that makes a program or operating system stop working, and that cannot be corrected",
                    "vi": "một lỗi hoặc một lỗi làm cho một chương trình hoặc hệ điều hành ngừng hoạt động và không thể sửa được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cd4d7469942849cbbd8f9d4038df00b9",
        "word": "laggy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlæɡi/",
            "us": "/ˈlæɡi/"
        },
        "nearby": [
            {
                "word": "lager lout",
                "pos": "noun"
            },
            {
                "word": "laggard",
                "pos": "noun"
            },
            {
                "word": "laggy",
                "pos": "adjective"
            },
            {
                "word": "lagoon",
                "pos": "noun"
            },
            {
                "word": "Fiorello La Guardia",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slow to respond",
                    "vi": "trả lời chậm"
                },
                "examples": [
                    {
                        "en": "My computer gets really laggy when there are pictures.",
                        "vi": "Máy tính của tôi thực sự bị lag khi có hình ảnh."
                    },
                    {
                        "en": "The problem was a laggy internet connection.",
                        "vi": "Vấn đề là kết nối internet bị chậm."
                    }
                ]
            }
        ]
    },
    {
        "id": "bf29ae3c682748de953c71015c7484a8",
        "word": "malicious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈlɪʃəs/",
            "us": "/məˈlɪʃəs/"
        },
        "nearby": [
            {
                "word": "Malibu",
                "pos": ""
            },
            {
                "word": "malice",
                "pos": "noun"
            },
            {
                "word": "malicious",
                "pos": "adjective"
            },
            {
                "word": "maliciously",
                "pos": "adverb"
            },
            {
                "word": "malign",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or showing a desire to harm somebody or hurt their feelings, caused by a feeling of hate",
                    "vi": "có hoặc thể hiện mong muốn làm hại ai đó hoặc làm tổn thương cảm xúc của họ, gây ra bởi cảm giác ghét"
                },
                "examples": [
                    {
                        "en": "malicious gossip/lies/rumours",
                        "vi": "tin đồn ác ý / dối trá / tin đồn"
                    },
                    {
                        "en": "He took malicious pleasure in telling me what she had said.",
                        "vi": "Anh ấy đã rất vui khi kể cho tôi nghe những gì cô ấy đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "intended to damage somebody's computer or data files",
                    "vi": "nhằm mục đích làm hỏng máy tính hoặc tệp dữ liệu của ai đó"
                },
                "examples": [
                    {
                        "en": "These are nasty pieces of malicious code such as viruses, Trojan horses and worms.",
                        "vi": "Đây là những đoạn mã độc hại khó chịu như vi rút, ngựa Trojan và sâu."
                    },
                    {
                        "en": "malicious software/applications",
                        "vi": "phần mềm / ứng dụng độc hại"
                    }
                ]
            }
        ]
    },
    {
        "id": "2d8bee835b8143c3888c3e337e61977b",
        "word": "malware",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmælweə(r)/",
            "us": "/ˈmælwer/"
        },
        "nearby": [
            {
                "word": "malt whisky",
                "pos": "noun"
            },
            {
                "word": "the Malverns",
                "pos": ""
            },
            {
                "word": "malware",
                "pos": "noun"
            },
            {
                "word": "mam",
                "pos": "noun"
            },
            {
                "word": "mama1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "software such as a virus specifically designed to damage or gain access to a computer system without the user knowing",
                    "vi": "phần mềm chẳng hạn như vi-rút được thiết kế đặc biệt để làm hỏng hoặc giành quyền truy cập vào hệ thống máy tính mà người dùng không biết"
                },
                "examples": [
                    {
                        "en": "the threat posed by malware",
                        "vi": "mối đe dọa do phần mềm độc hại gây ra"
                    },
                    {
                        "en": "How to protect yourself against malware.",
                        "vi": "Cách bảo vệ bạn khỏi phần mềm độc hại."
                    },
                    {
                        "en": "Responding to the pop-up will get you a nice case of malware!",
                        "vi": "Trả lời cửa sổ bật lên sẽ giúp bạn có một trường hợp phần mềm độc hại tuyệt vời!"
                    }
                ]
            }
        ]
    },
    {
        "id": "4b5b762b4d4c49ac8b725cf6c92ffcbf",
        "word": "noise",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nɔɪz/",
            "us": "/nɔɪz/"
        },
        "nearby": [
            {
                "word": "no-hoper",
                "pos": "noun"
            },
            {
                "word": "noir",
                "pos": "noun"
            },
            {
                "word": "noise",
                "pos": "noun"
            },
            {
                "word": "noiseless",
                "pos": "adjective"
            },
            {
                "word": "noiselessly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sound, especially when it is loud, unpleasant or frightening",
                    "vi": "một âm thanh, đặc biệt là khi nó lớn, khó chịu hoặc đáng sợ"
                },
                "examples": [
                    {
                        "en": "There was a rattling noise coming from the back of the car.",
                        "vi": "Có tiếng động lạch cạch phát ra từ phía sau xe."
                    },
                    {
                        "en": "What's that noise?",
                        "vi": "Tiếng ồn đó là gì?"
                    },
                    {
                        "en": "I heard a loud noise and turned around.",
                        "vi": "Tôi nghe thấy một tiếng động lớn và quay lại."
                    },
                    {
                        "en": "Don't make a noise.",
                        "vi": "Đừng làm ồn."
                    },
                    {
                        "en": "They were making too much noise.",
                        "vi": "Họ đã tạo ra quá nhiều tiếng ồn."
                    },
                    {
                        "en": "I was woken by the noise of a car starting up.",
                        "vi": "Tôi bị đánh thức bởi tiếng ồn ào của một chiếc xe hơi đang nổ máy."
                    },
                    {
                        "en": "There was constant background noise from the motorway.",
                        "vi": "Có tiếng ồn xung quanh liên tục từ đường cao tốc."
                    },
                    {
                        "en": "Measures are needed to reduce noise levels.",
                        "vi": "Cần có các biện pháp để giảm mức ồn."
                    },
                    {
                        "en": "above the noise We had to shout above the noise of the traffic.",
                        "vi": "phía trên tiếng ồn Chúng tôi phải hét lên phía trên tiếng ồn ào của xe cộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "extra electrical or electronic signals that are not part of the signal that is being broadcast or transmitted and which may damage it",
                    "vi": "tín hiệu điện hoặc điện tử bổ sung không phải là một phần của tín hiệu đang được phát hoặc truyền đi và có thể làm hỏng nó"
                },
                "examples": [
                    {
                        "en": "Place the devices as close as possible to the sensors to reduce noise in the signal.",
                        "vi": "Đặt các thiết bị càng gần cảm biến càng tốt để giảm nhiễu tín hiệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "information that is not wanted and that can make it difficult for the important or useful information to be seen clearly",
                    "vi": "thông tin không mong muốn và điều đó có thể khiến thông tin quan trọng hoặc hữu ích khó được nhìn thấy rõ ràng"
                },
                "examples": [
                    {
                        "en": "There is some noise in the data which needs to be reduced.",
                        "vi": "Có một số nhiễu trong dữ liệu cần được giảm bớt."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important person",
                    "vi": "một người quan trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to complain loudly",
                    "vi": "phàn nàn lớn tiếng"
                },
                "examples": [
                    {
                        "en": "I will continue to make as much noise as I can to support the scheme.",
                        "vi": "Tôi sẽ tiếp tục gây ồn ào nhất có thể để hỗ trợ chương trình này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk in an indirect way about something that you think you might do",
                    "vi": "nói một cách gián tiếp về điều gì đó mà bạn nghĩ rằng bạn có thể làm"
                },
                "examples": [
                    {
                        "en": "The company has been making noises about closing several factories.",
                        "vi": "Công ty đã gây ồn ào về việc đóng cửa một số nhà máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to complain about something",
                    "vi": "phàn nàn về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make remarks of the kind mentioned, even when that is not what you really think",
                    "vi": "để đưa ra nhận xét thuộc loại được đề cập, ngay cả khi đó không phải là điều bạn thực sự nghĩ"
                },
                "examples": [
                    {
                        "en": "He made all the right noises at the meeting yesterday (= said what people wanted to hear).",
                        "vi": "Anh ấy đã tạo ra mọi tiếng ồn phù hợp tại cuộc họp ngày hôm qua (= nói những gì mọi người muốn nghe)."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6f1f73eb3fa4f359fbec3ffcfeb1f0c",
        "word": "overflow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊvəfləʊ/",
            "us": "/ˈəʊvərfləʊ/"
        },
        "nearby": [
            {
                "word": "overflight",
                "pos": "noun"
            },
            {
                "word": "overflow",
                "pos": "verb"
            },
            {
                "word": "overflow",
                "pos": "noun"
            },
            {
                "word": "overfly",
                "pos": "verb"
            },
            {
                "word": "overfond",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a number of people or things that do not fit into the space available",
                    "vi": "một số người hoặc những thứ không phù hợp với không gian có sẵn"
                },
                "examples": [
                    {
                        "en": "A new office block was built to accommodate the overflow of staff.",
                        "vi": "Một khối văn phòng mới được xây dựng để đáp ứng lượng nhân viên tràn vào."
                    },
                    {
                        "en": "an overflow car park",
                        "vi": "một bãi đậu xe tràn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of liquid flowing out of a container, etc. that is already full; the liquid that flows out",
                    "vi": "hành động của chất lỏng chảy ra khỏi thùng chứa, v.v. đã đầy; chất lỏng chảy ra"
                },
                "examples": [
                    {
                        "en": "an overflow of water from the lake",
                        "vi": "nước tràn từ hồ"
                    },
                    {
                        "en": "(figurative) an overflow of powerful emotions",
                        "vi": "(nghĩa bóng) tràn đầy cảm xúc mạnh mẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a pipe that allows extra liquid to flow away safely when a container is full",
                    "vi": "một đường ống cho phép chất lỏng bổ sung chảy đi một cách an toàn khi một thùng chứa đầy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a fault that happens because a number or data item is too large for the computer to represent it exactly",
                    "vi": "một lỗi xảy ra do một số hoặc mục dữ liệu quá lớn để máy tính có thể đại diện chính xác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5b623c64663440f6b85bd70b12123491",
        "word": "security hole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sɪˈkjʊərəti həʊl/",
            "us": "/sɪˈkjʊrəti həʊl/"
        },
        "nearby": [
            {
                "word": "security forces",
                "pos": "noun"
            },
            {
                "word": "security guard",
                "pos": "noun"
            },
            {
                "word": "security hole",
                "pos": "noun"
            },
            {
                "word": "security risk",
                "pos": "noun"
            },
            {
                "word": "Security Service",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mistake in a piece of software that allows a user to gain access to a computer system or network without permission",
                    "vi": "lỗi trong một phần mềm cho phép người dùng truy cập vào hệ thống máy tính hoặc mạng mà không được phép"
                },
                "examples": [
                    {
                        "en": "The hacker discovered a security hole that exposed over ten million users' passwords.",
                        "vi": "Tin tặc đã phát hiện ra một lỗ hổng bảo mật làm lộ hơn mười triệu mật khẩu của người dùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "6359fb70596a44c680f50ed4a6a681c2",
        "word": "soft error",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsɒft ˈerə(r)/",
            "us": "/ˌsɔːft ˈerər/"
        },
        "nearby": [
            {
                "word": "softener",
                "pos": "noun"
            },
            {
                "word": "soften up",
                "pos": "phrasal verb"
            },
            {
                "word": "soft error",
                "pos": "noun"
            },
            {
                "word": "soft focus",
                "pos": "noun"
            },
            {
                "word": "soft fruit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an error or fault that makes a program or operating system stop working, but that can often be corrected by switching the computer off then on again",
                    "vi": "một lỗi hoặc lỗi làm cho một chương trình hoặc hệ điều hành ngừng hoạt động, nhưng điều đó thường có thể được sửa chữa bằng cách tắt máy tính sau đó bật lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "76a0a2387e334edc93ed792ee39b73fe",
        "word": "timeout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪmaʊt/",
            "us": "/ˈtaɪmaʊt/"
        },
        "nearby": [
            {
                "word": "time machine",
                "pos": "noun"
            },
            {
                "word": "time out",
                "pos": "phrasal verb"
            },
            {
                "word": "timeout",
                "pos": "noun"
            },
            {
                "word": "Time Out",
                "pos": ""
            },
            {
                "word": "timepass",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a break in play during a sports game, especially one that a coach asks for in order to give new instructions to the team",
                    "vi": "thời gian nghỉ giải lao trong một trận đấu thể thao, đặc biệt là trận đấu mà huấn luyện viên yêu cầu để đưa ra hướng dẫn mới cho đội"
                },
                "examples": [
                    {
                        "en": "New coach Steve Kerr called (a) timeout and his team responded.",
                        "vi": "Huấn luyện viên mới Steve Kerr đã gọi (a) thời gian chờ và đội của anh ấy đã trả lời."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a process or program stops after a particular amount of time because it has not worked successfully",
                    "vi": "một trường hợp khi một quá trình hoặc chương trình dừng lại sau một khoảng thời gian cụ thể vì nó không hoạt động thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "50bdb199fcec46348c3e8b4e3ac247d2",
        "word": "Trojan horse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtrəʊdʒən ˈhɔːs/",
            "us": "/ˌtrəʊdʒən ˈhɔːrs/"
        },
        "nearby": [
            {
                "word": "Troilus and Cressida",
                "pos": ""
            },
            {
                "word": "Trojan",
                "pos": "noun, adjective"
            },
            {
                "word": "Trojan horse",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that is used to trick an enemy in order to achieve a secret purpose",
                    "vi": "một người hoặc một vật được sử dụng để lừa kẻ thù nhằm đạt được mục đích bí mật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a computer program that seems to be helpful but that is, in fact, designed to destroy data, etc.",
                    "vi": "một chương trình máy tính có vẻ hữu ích nhưng trên thực tế, nó được thiết kế để phá hủy dữ liệu, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c634799b4c1540cc83ba064c51152eb0",
        "word": "troubleshoot",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrʌblʃuːt/",
            "us": "/ˈtrʌblʃuːt/"
        },
        "nearby": [
            {
                "word": "troublemaker",
                "pos": "noun"
            },
            {
                "word": "the Troubles",
                "pos": ""
            },
            {
                "word": "troubleshoot",
                "pos": "verb"
            },
            {
                "word": "troubleshooter",
                "pos": "noun"
            },
            {
                "word": "troubleshooting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to analyse and solve serious problems for a company or other organization",
                    "vi": "để phân tích và giải quyết các vấn đề nghiêm trọng cho một công ty hoặc tổ chức khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to identify and correct faults in a computer system",
                    "vi": "để xác định và sửa lỗi trong hệ thống máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c009b20f88a4463c9e14f201006ae76d",
        "word": "unreadable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ʌnˈriːdəbl/",
            "us": "/ʌnˈriːdəbl/"
        },
        "nearby": [
            {
                "word": "unreactive",
                "pos": "adjective"
            },
            {
                "word": "unread",
                "pos": "adjective"
            },
            {
                "word": "unreadable",
                "pos": "adjective"
            },
            {
                "word": "unreal",
                "pos": "adjective"
            },
            {
                "word": "unrealistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too boring or difficult to be worth reading",
                    "vi": "quá nhàm chán hoặc khó đọc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult or impossible to read",
                    "vi": "khó hoặc không thể đọc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody’s face or expression is unreadable, you cannot tell what they are thinking or feeling",
                    "vi": "nếu khuôn mặt hoặc biểu cảm của ai đó không thể đọc được, bạn không thể biết họ đang nghĩ gì hoặc cảm thấy gì"
                },
                "examples": [
                    {
                        "en": "Ed regarded her with an unreadable expression.",
                        "vi": "Ed nhìn cô ấy với một biểu cảm khó hiểu."
                    },
                    {
                        "en": "His eyes were unreadable as he led her into the office.",
                        "vi": "Đôi mắt anh không thể đọc được khi anh dẫn cô vào văn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing information that a computer is not able to read",
                    "vi": "chứa thông tin mà máy tính không thể đọc được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3804553971894a46ad406d81d5c404e3",
        "word": "worm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɜːm/",
            "us": "/wɜːrm/"
        },
        "nearby": [
            {
                "word": "worldwide",
                "pos": "adjective, adverb"
            },
            {
                "word": "the World Wide Web",
                "pos": "noun"
            },
            {
                "word": "worm",
                "pos": "noun"
            },
            {
                "word": "worm",
                "pos": "verb"
            },
            {
                "word": "worm-eaten",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, thin creature with a soft body and no bones or legs",
                    "vi": "một sinh vật dài, gầy với cơ thể mềm mại và không có xương hoặc chân"
                },
                "examples": [
                    {
                        "en": "birds looking for worms",
                        "vi": "chim tìm sâu"
                    },
                    {
                        "en": "Worms burrow down through the soil.",
                        "vi": "Giun chui xuống đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "long, thin creatures that live inside the bodies of humans or animals and can cause illness",
                    "vi": "sinh vật dài, mảnh sống bên trong cơ thể người hoặc động vật và có thể gây bệnh"
                },
                "examples": [
                    {
                        "en": "The dog has worms.",
                        "vi": "Con chó bị giun."
                    }
                ]
            },
            {
                "define": {
                    "en": "the young form of an insect when it looks like a short worm",
                    "vi": "hình thức non của côn trùng khi nó trông giống như một con sâu ngắn"
                },
                "examples": [
                    {
                        "en": "This apple is full of worms.",
                        "vi": "Quả táo này đầy sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a computer program that is a type of virus and that spreads across a network by copying itself",
                    "vi": "chương trình máy tính là một loại vi rút và lây lan trên mạng bằng cách sao chép chính nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person you do not like or respect, especially because they have a weak character and do not behave well towards other people",
                    "vi": "một người mà bạn không thích hoặc không tôn trọng, đặc biệt là vì họ có tính cách nhu nhược và không cư xử tốt với người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you open up a can of worms, you start doing something that will cause a lot of problems and be very difficult",
                    "vi": "Nếu bạn mở một hộp sâu, bạn bắt đầu làm một việc gì đó sẽ gây ra rất nhiều vấn đề và rất khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person who takes the opportunity to do something before other people will have an advantage over them",
                    "vi": "người nắm lấy cơ hội để làm điều gì đó trước người khác sẽ có lợi thế hơn họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is normally quiet and does not complain will protest when the situation becomes too hard to bear",
                    "vi": "một người bình thường ít nói và không phàn nàn sẽ phản đối khi tình hình trở nên quá khó khăn để chịu đựng"
                },
                "examples": []
            }
        ]
    }
]