[
    {
        "id": "38ed4bc594eb4a1892415258edc6e247",
        "word": "natural",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈnætʃrəl/",
            "us": "/ˈnætʃrəl/"
        },
        "nearby": [
            {
                "word": "nattily",
                "pos": "adverb"
            },
            {
                "word": "natty",
                "pos": "adjective"
            },
            {
                "word": "natural",
                "pos": "adjective"
            },
            {
                "word": "natural",
                "pos": "noun"
            },
            {
                "word": "natural-born",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "existing in nature; not made or caused by humans",
                    "vi": "tồn tại trong tự nhiên; không phải do con người tạo ra hoặc gây ra"
                },
                "examples": [
                    {
                        "en": "the natural world (= of trees, rivers, animals and birds)",
                        "vi": "thế giới tự nhiên (= cây cối, sông ngòi, động vật và chim chóc)"
                    },
                    {
                        "en": "We should respect animals and the natural environment, which is their home.",
                        "vi": "Chúng ta nên tôn trọng động vật và môi trường tự nhiên, là nhà của chúng."
                    },
                    {
                        "en": "a country’s natural resources (= its coal, oil, forests, etc.)",
                        "vi": "tài nguyên thiên nhiên của một quốc gia (= than, dầu, rừng, v.v.)"
                    },
                    {
                        "en": "wildlife in its natural habitat",
                        "vi": "động vật hoang dã trong môi trường sống tự nhiên của nó"
                    },
                    {
                        "en": "The natural beauty of flowers inspired Monet's experiments in colour.",
                        "vi": "Vẻ đẹp tự nhiên của hoa đã truyền cảm hứng cho các thí nghiệm về màu sắc của Monet."
                    },
                    {
                        "en": "All the materials used are natural.",
                        "vi": "Tất cả các vật liệu được sử dụng là tự nhiên."
                    },
                    {
                        "en": "My hair soon grew back to its natural colour (= after being dyed).",
                        "vi": "Tóc tôi sớm mọc trở lại màu tự nhiên (= sau khi nhuộm)."
                    },
                    {
                        "en": "The clothes are available in warm natural colours.",
                        "vi": "Quần áo có màu sắc tự nhiên ấm áp."
                    }
                ]
            },
            {
                "define": {
                    "en": "having little or no processing",
                    "vi": "có ít hoặc không có quá trình xử lý"
                },
                "examples": [
                    {
                        "en": "natural yogurt (= with no flavour added)",
                        "vi": "sữa chua tự nhiên (= không thêm hương liệu)"
                    },
                    {
                        "en": "I try to eat a sugar-free, natural food diet.",
                        "vi": "Tôi cố gắng ăn một chế độ ăn không đường, thực phẩm tự nhiên."
                    },
                    {
                        "en": "Natural treatments have no unwanted side effects.",
                        "vi": "Phương pháp điều trị tự nhiên không có tác dụng phụ không mong muốn."
                    },
                    {
                        "en": "We made bread with a natural raising agent.",
                        "vi": "Chúng tôi đã làm bánh mì với một chất nuôi tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "normal; as you would expect",
                    "vi": "thông thường; như bạn mong đợi"
                },
                "examples": [
                    {
                        "en": "to die of natural causes (= not by violence, but normally, of old age)",
                        "vi": "chết vì những nguyên nhân tự nhiên (= không phải do bạo lực, mà bình thường, vì tuổi già)"
                    },
                    {
                        "en": "Singing for her was as natural as breathing.",
                        "vi": "Hát đối với cô ấy tự nhiên như hơi thở."
                    },
                    {
                        "en": "He thought social inequality was all part of the natural order of things.",
                        "vi": "Ông cho rằng bất bình đẳng xã hội là một phần của trật tự tự nhiên của mọi thứ."
                    },
                    {
                        "en": "She was the natural choice for the job.",
                        "vi": "Cô ấy là sự lựa chọn tự nhiên cho công việc."
                    },
                    {
                        "en": "it is natural (for somebody) to do something It's only natural to worry about your children.",
                        "vi": "Việc lo lắng cho con cái của bạn là điều đương nhiên (đối với ai đó)."
                    },
                    {
                        "en": "It's perfectly natural for you to feel annoyed.",
                        "vi": "Bạn cảm thấy bực mình là điều hoàn toàn tự nhiên."
                    },
                    {
                        "en": "it is natural that… It's natural that he would want to see his own son.",
                        "vi": "điều đó là tự nhiên… Điều tự nhiên là anh ấy muốn gặp con trai của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe behaviour or abilities that are part of the character that a person or an animal was born with",
                    "vi": "được sử dụng để mô tả hành vi hoặc khả năng là một phần của tính cách mà một người hoặc một con vật được sinh ra"
                },
                "examples": [
                    {
                        "en": "the natural agility of a cat",
                        "vi": "sự nhanh nhẹn tự nhiên của một con mèo"
                    },
                    {
                        "en": "the natural processes of language learning",
                        "vi": "các quá trình tự nhiên của việc học ngôn ngữ"
                    },
                    {
                        "en": "She has a natural ability with children.",
                        "vi": "Cô ấy có khả năng thiên bẩm với trẻ em."
                    },
                    {
                        "en": "Daniel's natural talent is for engineering.",
                        "vi": "Tài năng thiên bẩm của Daniel là về kỹ thuật."
                    },
                    {
                        "en": "It was my natural instinct to defend myself.",
                        "vi": "Đó là bản năng tự vệ của tôi."
                    },
                    {
                        "en": "When body temperature is beginning to fall there is a natural tendency to fall asleep.",
                        "vi": "Khi nhiệt độ cơ thể bắt đầu giảm, họ có xu hướng đi vào giấc ngủ một cách tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "having an ability that you were born with",
                    "vi": "có một khả năng mà bạn được sinh ra với"
                },
                "examples": [
                    {
                        "en": "He's a natural leader.",
                        "vi": "Anh ấy là một nhà lãnh đạo bẩm sinh."
                    },
                    {
                        "en": "She's a natural rebel.",
                        "vi": "Cô ấy là một kẻ nổi loạn bẩm sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "relaxed and not pretending to be somebody/something different",
                    "vi": "thoải mái và không giả vờ là ai đó / điều gì đó khác biệt"
                },
                "examples": [
                    {
                        "en": "It's difficult to look natural when you're feeling nervous.",
                        "vi": "Thật khó để trông tự nhiên khi bạn cảm thấy lo lắng."
                    },
                    {
                        "en": "There's something really natural about her.",
                        "vi": "Có một cái gì đó thực sự tự nhiên về cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "related by blood",
                    "vi": "quan hệ huyết thống"
                },
                "examples": [
                    {
                        "en": "His natural mother was unable to care for him so he was raised by an aunt.",
                        "vi": "Mẹ ruột của anh không thể chăm sóc cho anh nên anh được nuôi dưỡng bởi một người dì."
                    }
                ]
            },
            {
                "define": {
                    "en": "born to parents who are not married",
                    "vi": "sinh ra bởi cha mẹ không kết hôn"
                },
                "examples": [
                    {
                        "en": "She was a natural daughter of King James II.",
                        "vi": "Cô là con gái ruột của Vua James II."
                    }
                ]
            },
            {
                "define": {
                    "en": "based on human reason alone",
                    "vi": "chỉ dựa trên lý trí của con người"
                },
                "examples": [
                    {
                        "en": "I am a firm believer in human rights and natural law.",
                        "vi": "Tôi là một người tin tưởng vững chắc vào quyền con người và luật tự nhiên."
                    },
                    {
                        "en": "It goes against natural justice to punish a child for the crimes of its parents.",
                        "vi": "Nó đi ngược lại công lý tự nhiên khi trừng phạt một đứa trẻ vì tội ác của cha mẹ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after the name of a note to show that the note is neither sharp nor flat. The written symbol is (♮).",
                    "vi": "được sử dụng sau tên của nốt nhạc để thể hiện rằng nốt nhạc đó không nhọn và cũng không bằng phẳng. Ký hiệu được viết là (♮)."
                },
                "examples": [
                    {
                        "en": "B natural",
                        "vi": "B tự nhiên"
                    }
                ]
            }
        ]
    },
    {
        "id": "f4b6592877794e2abfb2085d9be04572",
        "word": "environment",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪnˈvaɪrənmənt/",
            "us": "/ɪnˈvaɪrənmənt/"
        },
        "nearby": [
            {
                "word": "envious",
                "pos": "adjective"
            },
            {
                "word": "enviously",
                "pos": "adverb"
            },
            {
                "word": "environment",
                "pos": "noun"
            },
            {
                "word": "the Environment Agency",
                "pos": ""
            },
            {
                "word": "environmental",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the natural world in which people, animals and plants live",
                    "vi": "thế giới tự nhiên nơi con người, động vật và thực vật sống"
                },
                "examples": [
                    {
                        "en": "The government should do more to protect the environment.",
                        "vi": "Chính phủ nên làm nhiều hơn nữa để bảo vệ môi trường."
                    },
                    {
                        "en": "to preserve/pollute/harm the environment",
                        "vi": "để bảo tồn / gây ô nhiễm / gây hại cho môi trường"
                    },
                    {
                        "en": "damage to the natural environment",
                        "vi": "thiệt hại cho môi trường tự nhiên"
                    },
                    {
                        "en": "protection/destruction of the marine environment",
                        "vi": "bảo vệ / phá hủy môi trường biển"
                    },
                    {
                        "en": "The environment minister expressed concern over pollution levels.",
                        "vi": "Bộ trưởng Môi trường bày tỏ quan ngại về mức độ ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the conditions in which a person, animal or plant lives or operates or in which an activity takes place",
                    "vi": "các điều kiện mà con người, động vật hoặc thực vật sống hoặc hoạt động hoặc trong đó một hoạt động diễn ra"
                },
                "examples": [
                    {
                        "en": "a pleasant work/learning environment",
                        "vi": "một môi trường làm việc / học tập dễ chịu"
                    },
                    {
                        "en": "Hospitals have a duty to provide a safe working environment for all staff.",
                        "vi": "Các bệnh viện có nhiệm vụ cung cấp một môi trường làm việc an toàn cho tất cả nhân viên."
                    },
                    {
                        "en": "They have created an environment in which productivity should flourish.",
                        "vi": "Họ đã tạo ra một môi trường mà ở đó năng suất sẽ phát triển."
                    },
                    {
                        "en": "Polar bears are totally adapted to their hostile environment.",
                        "vi": "Gấu Bắc Cực hoàn toàn thích nghi với môi trường thù địch của chúng."
                    },
                    {
                        "en": "We operate in a highly competitive business environment.",
                        "vi": "Chúng tôi hoạt động trong một môi trường kinh doanh cạnh tranh cao."
                    },
                    {
                        "en": "The tests were carried out in a controlled environment.",
                        "vi": "Các thử nghiệm được thực hiện trong một môi trường được kiểm soát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the complete structure (including hardware and software) within which a user, computer or program operates",
                    "vi": "cấu trúc hoàn chỉnh (bao gồm cả phần cứng và phần mềm) trong đó người dùng, máy tính hoặc chương trình hoạt động"
                },
                "examples": [
                    {
                        "en": "a desktop development environment",
                        "vi": "môi trường phát triển máy tính để bàn"
                    }
                ]
            }
        ]
    },
    {
        "id": "133950ca9a854cee836c0e9d32cd8825",
        "word": "nature",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈneɪtʃə(r)/",
            "us": "/ˈneɪtʃər/"
        },
        "nearby": [
            {
                "word": "natural selection",
                "pos": "noun"
            },
            {
                "word": "natural wastage",
                "pos": "noun"
            },
            {
                "word": "nature",
                "pos": "noun"
            },
            {
                "word": "Nature",
                "pos": ""
            },
            {
                "word": "nature reserve",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the plants, animals and things that exist in the universe that are not made by people",
                    "vi": "tất cả thực vật, động vật và những thứ tồn tại trong vũ trụ không phải do con người tạo ra"
                },
                "examples": [
                    {
                        "en": "Take time to appreciate the beauties of nature.",
                        "vi": "Hãy dành thời gian để đánh giá cao vẻ đẹp của thiên nhiên."
                    },
                    {
                        "en": "man-made substances not found in nature",
                        "vi": "các chất nhân tạo không có trong tự nhiên"
                    },
                    {
                        "en": "A lot of nature conservation is about protecting habitats.",
                        "vi": "Bảo tồn thiên nhiên rất nhiều là bảo vệ môi trường sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that things happen in the physical world when it is not controlled by people",
                    "vi": "cách mà mọi thứ xảy ra trong thế giới vật chất khi nó không được kiểm soát bởi con người"
                },
                "examples": [
                    {
                        "en": "The forces of nature are constantly reshaping our world.",
                        "vi": "Các lực lượng của tự nhiên đang liên tục định hình lại thế giới của chúng ta."
                    },
                    {
                        "en": "It is impossible to change the laws of nature.",
                        "vi": "Không thể thay đổi quy luật tự nhiên."
                    },
                    {
                        "en": "Her illness was Nature's way of telling her to do less.",
                        "vi": "Căn bệnh của cô ấy là cách Tự nhiên bảo cô ấy phải làm ít hơn."
                    },
                    {
                        "en": "Is genius the result of nature or nurture?",
                        "vi": "Thiên tài là kết quả của tự nhiên hay sự nuôi dưỡng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the usual way that a person or an animal behaves that is part of their character",
                    "vi": "cách thông thường mà một người hoặc một con vật cư xử là một phần tính cách của chúng"
                },
                "examples": [
                    {
                        "en": "by nature She is very sensitive by nature.",
                        "vi": "bởi bản chất Cô ấy rất nhạy cảm về bản chất."
                    },
                    {
                        "en": "it is not in somebody's nature to do something It's not in his nature to be unkind.",
                        "vi": "bản chất của ai đó không phải là làm điều gì đó. Bản chất của anh ta không phải là xấu."
                    },
                    {
                        "en": "it is against somebody's nature to do something It was against her nature to tell lies.",
                        "vi": "nó là chống lại bản chất của ai đó để làm điều gì đó Nó đi ngược lại bản chất của cô ấy là nói dối."
                    },
                    {
                        "en": "We appealed to his better nature (= his kindness).",
                        "vi": "Chúng tôi kêu gọi bản chất tốt hơn của anh ấy (= lòng tốt của anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the basic qualities of a thing",
                    "vi": "những phẩm chất cơ bản của một sự vật"
                },
                "examples": [
                    {
                        "en": "the changing nature of society",
                        "vi": "sự thay đổi bản chất của xã hội"
                    },
                    {
                        "en": "It's difficult to define the exact nature of the problem.",
                        "vi": "Thật khó để xác định bản chất chính xác của vấn đề."
                    },
                    {
                        "en": "His work explores the nature of the mother-child relationship.",
                        "vi": "Tác phẩm của anh khám phá bản chất của mối quan hệ mẹ con."
                    },
                    {
                        "en": "in nature My work is very specialized in nature.",
                        "vi": "trong tự nhiên Công việc của tôi rất chuyên biệt về tự nhiên."
                    },
                    {
                        "en": "by its nature The future by its very nature is uncertain.",
                        "vi": "về bản chất của nó Tương lai về bản chất của nó là không chắc chắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type or kind of something",
                    "vi": "một loại hoặc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "of a… nature His books were mainly of a scientific nature.",
                        "vi": "có tính chất… Những cuốn sách của ông ấy chủ yếu có tính chất khoa học."
                    },
                    {
                        "en": "Don't worry about things of that nature.",
                        "vi": "Đừng lo lắng về những thứ có tính chất đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of character or quality mentioned",
                    "vi": "có loại nhân vật hoặc phẩm chất được đề cập"
                },
                "examples": [
                    {
                        "en": "a good-natured man",
                        "vi": "một người đàn ông tốt bụng"
                    }
                ]
            },
            {
                "define": {
                    "en": "not natural; not moral",
                    "vi": "không thuộc về thiên nhiên; không đạo đức"
                },
                "examples": [
                    {
                        "en": "Murder is a crime against nature.",
                        "vi": "Giết người là một tội ác chống lại thiên nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to return to) a simple kind of life in the country, away from cities",
                    "vi": "(để trở lại) một kiểu sống đơn giản ở nông thôn, cách xa thành phố"
                },
                "examples": [
                    {
                        "en": "When you’re camping, you can get back to nature.",
                        "vi": "Khi cắm trại, bạn có thể trở về với thiên nhiên."
                    },
                    {
                        "en": "We built our house in the country because we wanted to get back to nature.",
                        "vi": "Chúng tôi xây dựng ngôi nhà của mình trong nước vì chúng tôi muốn trở về với thiên nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the need to go to the toilet",
                    "vi": "nhu cầu đi vệ sinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person with a very strong personality who is full of energy, very determined and difficult for others to resist",
                    "vi": "một người có tính cách rất mạnh mẽ, tràn đầy năng lượng, rất kiên định và khó ai có thể cưỡng lại được."
                },
                "examples": [
                    {
                        "en": "Gerard is a force of nature, continually pursuing his target when everyone else is ready to give up.",
                        "vi": "Gerard là một sức mạnh của tự nhiên, liên tục theo đuổi mục tiêu của mình khi mọi người khác đã sẵn sàng từ bỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power of the wind, rain, etc., especially when it causes damage or harm",
                    "vi": "sức mạnh của gió, mưa, v.v., đặc biệt khi nó gây ra thiệt hại hoặc tác hại"
                },
                "examples": [
                    {
                        "en": "They were fighting a losing battle against the forces of nature.",
                        "vi": "Họ đang chiến đấu trong một trận chiến thua cuộc trước các lực lượng của thiên nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar to something; a type of something; in the style of something",
                    "vi": "tương tự như một cái gì đó; một loại cái gì đó; theo phong cách của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His speech was in the nature of an apology.",
                        "vi": "Bài phát biểu của anh ấy mang tính chất của một lời xin lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the way that things usually happen",
                    "vi": "theo cách mà mọi thứ thường xảy ra"
                },
                "examples": [
                    {
                        "en": "In the nature of things, young people often rebel against their parents.",
                        "vi": "Trong bản chất của sự việc, những người trẻ tuổi thường nổi loạn chống lại cha mẹ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow natural processes to happen, without trying to stop or change them (used especially in the context of illness)",
                    "vi": "để cho phép các quá trình tự nhiên xảy ra mà không cần cố gắng ngăn chặn hoặc thay đổi chúng (được sử dụng đặc biệt trong bối cảnh bệnh tật)"
                },
                "examples": [
                    {
                        "en": "The midwife must judge when to let nature take its course and when to intervene.",
                        "vi": "Người hộ sinh phải phán đoán khi nào để tự nhiên diễn ra và khi nào cần can thiệp."
                    },
                    {
                        "en": "When the dog responded so badly to the treatment, we decided to let nature take its course.",
                        "vi": "Khi con chó phản ứng rất tệ với phương pháp điều trị, chúng tôi quyết định để tự nhiên xử lý."
                    }
                ]
            }
        ]
    },
    {
        "id": "97b6217bdbbc4c3a914d7dc6f97d8a27",
        "word": "protect",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/prəˈtekt/",
            "us": "/prəˈtekt/"
        },
        "nearby": [
            {
                "word": "protean",
                "pos": "adjective"
            },
            {
                "word": "protease",
                "pos": "noun"
            },
            {
                "word": "protect",
                "pos": "verb"
            },
            {
                "word": "protection",
                "pos": "noun"
            },
            {
                "word": "protectionism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make sure that somebody/something is not harmed, injured, damaged, etc.",
                    "vi": "để đảm bảo rằng ai đó / điều gì đó không bị tổn hại, bị thương, bị hư hỏng, v.v."
                },
                "examples": [
                    {
                        "en": "protect somebody/something/yourself to protect children/citizens/civilians/consumers/workers",
                        "vi": "bảo vệ ai đó / cái gì đó / chính bạn để bảo vệ trẻ em / công dân / dân thường / người tiêu dùng / người lao động"
                    },
                    {
                        "en": "Our aim is to protect the jobs of our members.",
                        "vi": "Mục đích của chúng tôi là bảo vệ công việc của các thành viên."
                    },
                    {
                        "en": "the section of the treaty that protects the rights of employees",
                        "vi": "phần của hiệp ước bảo vệ quyền của nhân viên"
                    },
                    {
                        "en": "Each company is fighting to protect its own commercial interests.",
                        "vi": "Mỗi công ty đang đấu tranh để bảo vệ lợi ích thương mại của chính mình."
                    },
                    {
                        "en": "A majority of Democrats believe that such regulations protect the public.",
                        "vi": "Đa số đảng viên Dân chủ tin rằng các quy định như vậy bảo vệ công chúng."
                    },
                    {
                        "en": "protect somebody/something/yourself against something Troops have been sent to protect aid workers against attack.",
                        "vi": "bảo vệ ai đó / cái gì đó / chính bạn chống lại điều gì đó Quân đội đã được gửi đến để bảo vệ nhân viên cứu trợ chống lại cuộc tấn công."
                    },
                    {
                        "en": "protect somebody/something/yourself from something They huddled together to protect themselves from the wind.",
                        "vi": "bảo vệ ai đó / cái gì đó / bản thân khỏi điều gì đó Họ xúm vào nhau để bảo vệ mình khỏi gió."
                    },
                    {
                        "en": "protect against something a paint that helps protect against rust",
                        "vi": "bảo vệ chống lại thứ gì đó một lớp sơn giúp bảo vệ chống gỉ"
                    },
                    {
                        "en": "protect from something Vitamin B12 may have a role in protecting from heart disease.",
                        "vi": "Bảo vệ khỏi một thứ gì đó Vitamin B12 có thể có vai trò trong việc bảo vệ khỏi bệnh tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to introduce laws that make it illegal to kill, harm or damage a particular animal, area of land, building, etc.",
                    "vi": "đưa ra các luật quy định việc giết, làm hại hoặc làm hư hại một con vật cụ thể, diện tích đất, tòa nhà, v.v. là bất hợp pháp."
                },
                "examples": [
                    {
                        "en": "a protected area/species",
                        "vi": "một khu bảo tồn / loài"
                    },
                    {
                        "en": "the need to protect the environment",
                        "vi": "sự cần thiết phải bảo vệ môi trường"
                    },
                    {
                        "en": "to be protected by something Polar bears have been protected by law in Norway since 1973.",
                        "vi": "được bảo vệ bởi thứ gì đó Gấu Bắc cực đã được luật pháp ở Na Uy bảo vệ từ năm 1973."
                    },
                    {
                        "en": "The plant is protected under the Wildlife and Countryside Act.",
                        "vi": "Nhà máy được bảo vệ theo Đạo luật Động vật Hoang dã và Nông thôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help an industry in your own country by taxing goods from other countries so that there is less competition",
                    "vi": "để giúp một ngành công nghiệp ở quốc gia của bạn bằng cách đánh thuế hàng hóa từ các quốc gia khác để có ít cạnh tranh hơn"
                },
                "examples": [
                    {
                        "en": "protected markets",
                        "vi": "thị trường được bảo vệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide somebody/something with insurance against fire, injury, damage, etc.",
                    "vi": "để cung cấp cho ai đó / cái gì đó bảo hiểm chống lại hỏa hoạn, thương tích, thiệt hại, v.v."
                },
                "examples": [
                    {
                        "en": "Many policies do not protect you against personal injury.",
                        "vi": "Nhiều chính sách không bảo vệ bạn khỏi thương tích cá nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit access to data, a web page, etc., for example by using passwords or encryption (= special codes)",
                    "vi": "để giới hạn quyền truy cập vào dữ liệu, trang web, v.v., chẳng hạn bằng cách sử dụng mật khẩu hoặc mã hóa (= mã đặc biệt)"
                },
                "examples": [
                    {
                        "en": "Security products are designed to protect information from unauthorized access.",
                        "vi": "Các sản phẩm bảo mật được thiết kế để bảo vệ thông tin khỏi bị truy cập trái phép."
                    },
                    {
                        "en": "All these pages are password-protected.",
                        "vi": "Tất cả các trang này đều được bảo vệ bằng mật khẩu."
                    }
                ]
            }
        ]
    },
    {
        "id": "87498a08c2184f2d9c964649f6ee528e",
        "word": "environmental",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪnˌvaɪrənˈmentl/",
            "us": "/ɪnˌvaɪrənˈmentl/"
        },
        "nearby": [
            {
                "word": "environment",
                "pos": "noun"
            },
            {
                "word": "the Environment Agency",
                "pos": ""
            },
            {
                "word": "environmental",
                "pos": "adjective"
            },
            {
                "word": "environmental art",
                "pos": "noun"
            },
            {
                "word": "Environmental Health Officer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the natural conditions in which people, animals and plants live; connected with the environment",
                    "vi": "kết nối với các điều kiện tự nhiên nơi con người, động vật và thực vật sinh sống; kết nối với môi trường"
                },
                "examples": [
                    {
                        "en": "the environmental impact of pollution",
                        "vi": "tác động môi trường của ô nhiễm"
                    },
                    {
                        "en": "Their main objective is to promote environmental protection.",
                        "vi": "Mục tiêu chính của họ là thúc đẩy bảo vệ môi trường."
                    },
                    {
                        "en": "environmental issues/problems/concerns",
                        "vi": "vấn đề môi trường / vấn đề / mối quan tâm"
                    },
                    {
                        "en": "an environmental group/movement (= that aims to improve or protect the natural environment)",
                        "vi": "một nhóm / phong trào môi trường (= nhằm mục đích cải thiện hoặc bảo vệ môi trường tự nhiên)"
                    },
                    {
                        "en": "environmental degradation/damage",
                        "vi": "suy thoái / thiệt hại môi trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the conditions that affect the behaviour and development of somebody/something",
                    "vi": "kết nối với các điều kiện ảnh hưởng đến hành vi và sự phát triển của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "the environmental factors that affect insect development",
                        "vi": "các yếu tố môi trường ảnh hưởng đến sự phát triển của côn trùng"
                    },
                    {
                        "en": "The responses of animals to changing environmental conditions are a central issue in ecology.",
                        "vi": "Các phản ứng của động vật đối với các điều kiện môi trường thay đổi là một vấn đề trọng tâm trong sinh thái học."
                    },
                    {
                        "en": "She is the director of environmental health at the council.",
                        "vi": "Cô ấy là giám đốc sức khỏe môi trường tại hội đồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a985a788797e4ace917970ac4c3513d2",
        "word": "green",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ɡriːn/",
            "us": "/ɡriːn/"
        },
        "nearby": [
            {
                "word": "Greek cross",
                "pos": "noun"
            },
            {
                "word": "Greek salad",
                "pos": "noun"
            },
            {
                "word": "green",
                "pos": "adjective"
            },
            {
                "word": "green",
                "pos": "noun"
            },
            {
                "word": "green",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the colour of grass or the leaves of most plants and trees",
                    "vi": "có màu của cỏ hoặc lá của hầu hết các loại cây và cây cối"
                },
                "examples": [
                    {
                        "en": "green grass/leaves/vegetables",
                        "vi": "cỏ xanh / lá / rau"
                    },
                    {
                        "en": "his piercing green eyes",
                        "vi": "đôi mắt xanh lục xuyên thấu của anh ấy"
                    },
                    {
                        "en": "Wait for the light to turn green (= on traffic lights).",
                        "vi": "Chờ đèn chuyển sang màu xanh lục (= trên đèn giao thông)."
                    }
                ]
            },
            {
                "define": {
                    "en": "covered with grass or other plants",
                    "vi": "được bao phủ bởi cỏ hoặc các loại cây khác"
                },
                "examples": [
                    {
                        "en": "green fields/pastures/hills",
                        "vi": "cánh đồng xanh / đồng cỏ / đồi"
                    },
                    {
                        "en": "It's just two minutes' walk to the nearest public green space.",
                        "vi": "Chỉ mất hai phút đi bộ đến không gian xanh công cộng gần nhất."
                    },
                    {
                        "en": "After the rains, the land was green with new growth.",
                        "vi": "Sau những cơn mưa, đất đai lại xanh tươi với những mầm mống mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "not yet ready to eat",
                    "vi": "chưa sẵn sàng để ăn"
                },
                "examples": [
                    {
                        "en": "green tomatoes",
                        "vi": "cà chua xanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the protection of the environment; supporting the protection of the environment as a political principle",
                    "vi": "kết nối với việc bảo vệ môi trường; ủng hộ việc bảo vệ môi trường như một nguyên tắc chính trị"
                },
                "examples": [
                    {
                        "en": "green energy",
                        "vi": "năng lượng xanh"
                    },
                    {
                        "en": "green politics",
                        "vi": "chính trị xanh"
                    },
                    {
                        "en": "Try to adopt a greener lifestyle.",
                        "vi": "Cố gắng áp dụng một lối sống xanh hơn."
                    },
                    {
                        "en": "the Green Party",
                        "vi": "Đảng Xanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "young and without experience",
                    "vi": "trẻ và không có kinh nghiệm"
                },
                "examples": [
                    {
                        "en": "The new trainees are still very green.",
                        "vi": "Các thực tập sinh mới còn rất xanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "being a pale colour, as if the person is going to vomit",
                    "vi": "có màu nhợt nhạt, như thể người đó sắp nôn"
                },
                "examples": [
                    {
                        "en": "It was a rough crossing and most of the passengers looked distinctly green.",
                        "vi": "Đó là một đường băng qua gồ ghề và hầu hết các hành khách đều trông xanh rờn rõ rệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "said about people who never seem happy with what they have and always think they could be happier in a different place or situation",
                    "vi": "nói về những người dường như không bao giờ hạnh phúc với những gì họ có và luôn nghĩ rằng họ có thể hạnh phúc hơn ở một nơi hoặc hoàn cảnh khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very jealous (= angry or unhappy because you wish you had something that somebody else has )",
                    "vi": "rất ghen tị (= tức giận hoặc không vui vì bạn ước bạn có thứ gì đó mà người khác có)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "021e700199b04398ae3dde7c4de0f4fd",
        "word": "national park",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌnæʃnəl ˈpɑːk/",
            "us": "/ˌnæʃnəl ˈpɑːrk/"
        },
        "nearby": [
            {
                "word": "National Nature Reserve",
                "pos": "noun"
            },
            {
                "word": "the National Organization for Women",
                "pos": ""
            },
            {
                "word": "national park",
                "pos": "noun"
            },
            {
                "word": "National Park Service",
                "pos": ""
            },
            {
                "word": "the National Portrait Gallery",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land that is protected by the government for people to visit because of its natural beauty and historical or scientific interest",
                    "vi": "một khu đất được chính phủ bảo vệ để mọi người đến tham quan vì vẻ đẹp tự nhiên và lợi ích lịch sử hoặc khoa học"
                },
                "examples": [
                    {
                        "en": "Yellowstone National Park",
                        "vi": "Công viên quốc gia Yellowstone"
                    },
                    {
                        "en": "The area was designated a national park.",
                        "vi": "Khu vực này đã được chỉ định là một công viên quốc gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b9d0c0ac6384a2a87ec5cf8043bd4f9",
        "word": "resource",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈsɔːs/",
            "us": "/ˈriːsɔːrs/"
        },
        "nearby": [
            {
                "word": "resounding",
                "pos": "adjective"
            },
            {
                "word": "resoundingly",
                "pos": "adverb"
            },
            {
                "word": "resource",
                "pos": "noun"
            },
            {
                "word": "resource",
                "pos": "verb"
            },
            {
                "word": "resourceful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a supply of something that a country, an organization or a person has and can use, especially to increase their wealth",
                    "vi": "nguồn cung cấp một thứ gì đó mà một quốc gia, một tổ chức hoặc một người có và có thể sử dụng, đặc biệt là để tăng sự giàu có của họ"
                },
                "examples": [
                    {
                        "en": "the exploitation of minerals and other natural resources",
                        "vi": "khai thác khoáng sản và các tài nguyên thiên nhiên khác"
                    },
                    {
                        "en": "They promote the use of renewable resources like soybean oil.",
                        "vi": "Họ thúc đẩy việc sử dụng các nguồn tài nguyên tái tạo như dầu đậu nành."
                    },
                    {
                        "en": "water/mineral/energy resources",
                        "vi": "tài nguyên nước / khoáng sản / năng lượng"
                    },
                    {
                        "en": "The school does the best it can with limited resources (= money).",
                        "vi": "Trường làm tốt nhất có thể với nguồn lực hạn chế (= tiền bạc)."
                    },
                    {
                        "en": "a valuable/precious/scarce resource",
                        "vi": "một nguồn tài nguyên có giá trị / quý giá / khan hiếm"
                    },
                    {
                        "en": "Think carefully about how you allocate resources.",
                        "vi": "Hãy suy nghĩ cẩn thận về cách bạn phân bổ nguồn lực."
                    },
                    {
                        "en": "We agreed to pool our resources (= so that everyone gives something).",
                        "vi": "Chúng tôi đã đồng ý tổng hợp các nguồn lực của mình (= để mọi người cung cấp một cái gì đó)."
                    },
                    {
                        "en": "Police have had to devote more resources to these cases.",
                        "vi": "Cảnh sát đã phải dành nhiều nguồn lực hơn cho những trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that can be used to help achieve an aim, especially a book, equipment, etc. that provides information for teachers and students",
                    "vi": "thứ gì đó có thể được sử dụng để giúp đạt được mục tiêu, đặc biệt là sách, thiết bị, v.v. cung cấp thông tin cho giáo viên và học sinh"
                },
                "examples": [
                    {
                        "en": "The website is an invaluable educational resource.",
                        "vi": "Trang web là một nguồn tài nguyên giáo dục vô giá."
                    },
                    {
                        "en": "This is an online resource for anyone interested in digital design.",
                        "vi": "Đây là một tài nguyên trực tuyến cho bất kỳ ai quan tâm đến thiết kế kỹ thuật số."
                    },
                    {
                        "en": "The library is a vast resource for historians of medieval France.",
                        "vi": "Thư viện là một nguồn tài nguyên rộng lớn cho các nhà sử học của nước Pháp thời trung cổ."
                    },
                    {
                        "en": "Time is your most valuable resource, especially in examinations.",
                        "vi": "Thời gian là nguồn tài nguyên quý giá nhất của bạn, đặc biệt là trong các kỳ thi."
                    },
                    {
                        "en": "resource books for teachers",
                        "vi": "sách tài nguyên cho giáo viên"
                    },
                    {
                        "en": "a library resource centre",
                        "vi": "một trung tâm tài nguyên thư viện"
                    }
                ]
            },
            {
                "define": {
                    "en": "personal qualities such as courage and imagination that help you deal with difficult situations",
                    "vi": "những phẩm chất cá nhân như lòng dũng cảm và trí tưởng tượng giúp bạn đối phó với những tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "He has no inner resources and hates being alone.",
                        "vi": "Anh ta không có nguồn lực bên trong và ghét ở một mình."
                    },
                    {
                        "en": "She is someone of considerable personal resources.",
                        "vi": "Cô ấy là một người có nguồn lực cá nhân đáng kể."
                    }
                ]
            }
        ]
    },
    {
        "id": "676ebae4e7114ddeb1651a758e6f8b68",
        "word": "biome",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbaɪəʊm/",
            "us": "/ˈbaɪəʊm/"
        },
        "nearby": [
            {
                "word": "bioluminescence",
                "pos": "noun"
            },
            {
                "word": "biomass",
                "pos": "noun"
            },
            {
                "word": "biome",
                "pos": "noun"
            },
            {
                "word": "biomechanics",
                "pos": "noun"
            },
            {
                "word": "biomedical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the characteristic plants and animals that exist in a particular type of environment, for example in a forest or desert",
                    "vi": "các loài thực vật và động vật đặc trưng tồn tại trong một kiểu môi trường cụ thể, ví dụ như trong rừng hoặc sa mạc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d4def2bee7ba4e02933819da9d8bcd90",
        "word": "conservation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌkɒnsəˈveɪʃn/",
            "us": "/ˌkɑːnsərˈveɪʃn/"
        },
        "nearby": [
            {
                "word": "consequently",
                "pos": "adverb"
            },
            {
                "word": "conservancy",
                "pos": "noun"
            },
            {
                "word": "conservation",
                "pos": "noun"
            },
            {
                "word": "conservation area",
                "pos": "noun"
            },
            {
                "word": "conservationist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the protection of the natural environment",
                    "vi": "bảo vệ môi trường tự nhiên"
                },
                "examples": [
                    {
                        "en": "to be interested in wildlife conservation",
                        "vi": "quan tâm đến bảo tồn động vật hoang dã"
                    },
                    {
                        "en": "Road development in the area has been severely affected by the conservation programmes of the council.",
                        "vi": "Việc phát triển đường trong khu vực đã bị ảnh hưởng nghiêm trọng bởi các chương trình bảo tồn của hội đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the official protection of buildings and objects that have historical or artistic importance",
                    "vi": "chính thức bảo vệ các tòa nhà và đồ vật có tầm quan trọng về lịch sử hoặc nghệ thuật"
                },
                "examples": [
                    {
                        "en": "the conservation of ancient monuments/manuscripts/our cultural heritage",
                        "vi": "bảo tồn các di tích cổ đại / bản thảo / di sản văn hóa của chúng ta"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of preventing something from being lost, wasted, damaged or destroyed",
                    "vi": "hành động ngăn chặn một cái gì đó bị mất, lãng phí, bị hư hỏng hoặc bị phá hủy"
                },
                "examples": [
                    {
                        "en": "to encourage the conservation of water/fuel",
                        "vi": "khuyến khích tiết kiệm nước / nhiên liệu"
                    },
                    {
                        "en": "energy conservation",
                        "vi": "bảo tồn năng lượng"
                    },
                    {
                        "en": "practices that are good for the community, such as water efficiency and resource conservation",
                        "vi": "thực hành tốt cho cộng đồng, chẳng hạn như hiệu quả sử dụng nước và bảo tồn tài nguyên"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c476d994dc3485e82d4f170dd541dd7",
        "word": "conservation area",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌkɒnsəˈveɪʃn eəriə/",
            "us": "/ˌkɑːnsərˈveɪʃn eriə/"
        },
        "nearby": [
            {
                "word": "conservancy",
                "pos": "noun"
            },
            {
                "word": "conservation",
                "pos": "noun"
            },
            {
                "word": "conservation area",
                "pos": "noun"
            },
            {
                "word": "conservationist",
                "pos": "noun"
            },
            {
                "word": "conservatism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) an area where the natural environment or the buildings are protected by law from being damaged or changed",
                    "vi": "(ở Anh) một khu vực mà môi trường tự nhiên hoặc các tòa nhà được luật pháp bảo vệ khỏi bị hư hại hoặc thay đổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d1c4587e2004e439ec77b6425e0b3bf",
        "word": "deforestation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌdiːˌfɒrɪˈsteɪʃn/",
            "us": "/ˌdiːˌfɔːrɪˈsteɪʃn/"
        },
        "nearby": [
            {
                "word": "defoliation",
                "pos": "noun"
            },
            {
                "word": "deforest",
                "pos": "verb"
            },
            {
                "word": "deforestation",
                "pos": "noun"
            },
            {
                "word": "deform",
                "pos": "verb"
            },
            {
                "word": "deformation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of cutting down or burning the trees in an area",
                    "vi": "hành động chặt hoặc đốt cây trong một khu vực"
                },
                "examples": [
                    {
                        "en": "land erosion caused by widespread deforestation",
                        "vi": "xói mòn đất do phá rừng tràn lan"
                    }
                ]
            }
        ]
    },
    {
        "id": "76a703731db6455aa02a96ca05c9a8a1",
        "word": "diversity",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/daɪˈvɜːsəti/",
            "us": "/daɪˈvɜːrsəti/"
        },
        "nearby": [
            {
                "word": "diversion",
                "pos": "noun"
            },
            {
                "word": "diversionary",
                "pos": "adjective"
            },
            {
                "word": "diversity",
                "pos": "noun"
            },
            {
                "word": "divert",
                "pos": "verb"
            },
            {
                "word": "diverticulitis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a range of many people or things that are very different from each other",
                    "vi": "một loạt nhiều người hoặc nhiều thứ rất khác nhau"
                },
                "examples": [
                    {
                        "en": "the biological diversity of the rainforests",
                        "vi": "sự đa dạng sinh học của rừng nhiệt đới"
                    },
                    {
                        "en": "a great/wide/rich diversity of opinion",
                        "vi": "đa dạng ý kiến lớn / rộng / phong phú"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality or fact of including a range of many people or things",
                    "vi": "chất lượng hoặc thực tế của việc bao gồm nhiều người hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "There is a need for greater diversity and choice in education.",
                        "vi": "Cần có sự đa dạng và lựa chọn nhiều hơn trong giáo dục."
                    },
                    {
                        "en": "The company is working to improve its profile in terms of diversity and inclusion (= offering equal opportunities to people from minority groups).",
                        "vi": "Công ty đang nỗ lực cải thiện hồ sơ của mình về sự đa dạng và hòa nhập (= mang lại cơ hội bình đẳng cho những người thuộc các nhóm thiểu số)."
                    }
                ]
            }
        ]
    },
    {
        "id": "8b2249bbe532466197df555efabbab92",
        "word": "eco-friendly",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌiːkəʊ ˈfrendli/",
            "us": "/ˌiːkəʊ ˈfrendli/"
        },
        "nearby": [
            {
                "word": "eco-chic",
                "pos": "adjective"
            },
            {
                "word": "ecocide",
                "pos": "noun"
            },
            {
                "word": "eco-friendly",
                "pos": "adjective"
            },
            {
                "word": "E. coli",
                "pos": "noun"
            },
            {
                "word": "ecological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not harmful to the environment",
                    "vi": "không gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "eco-friendly products",
                        "vi": "sản phẩm thân thiện với môi trường"
                    }
                ]
            }
        ]
    },
    {
        "id": "548f27a4aa6f468a94721a228ca9d9fe",
        "word": "ecology",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/iˈkɒlədʒi/",
            "us": "/iˈkɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "ecologically",
                "pos": "adverb"
            },
            {
                "word": "ecologist",
                "pos": "noun"
            },
            {
                "word": "ecology",
                "pos": "noun"
            },
            {
                "word": "e-commerce",
                "pos": "noun"
            },
            {
                "word": "economic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the relation of plants and living creatures to each other and to their environment; the study of this",
                    "vi": "mối quan hệ của thực vật và sinh vật với nhau và với môi trường của chúng; nghiên cứu về điều này"
                },
                "examples": [
                    {
                        "en": "plant/animal/human ecology",
                        "vi": "sinh thái thực vật / động vật / con người"
                    },
                    {
                        "en": "the ecology movement",
                        "vi": "phong trào sinh thái"
                    },
                    {
                        "en": "Oil pollution could damage the fragile ecology of the coral reefs.",
                        "vi": "Ô nhiễm dầu có thể làm hỏng hệ sinh thái mong manh của các rạn san hô."
                    },
                    {
                        "en": "All ecologies on earth are heavily shaped by human activity.",
                        "vi": "Tất cả các hệ sinh thái trên trái đất đều được định hình rất nhiều bởi hoạt động của con người."
                    }
                ]
            }
        ]
    },
    {
        "id": "b6b9d7a7f50d4bd8883d24b12d2fe856",
        "word": "ecosystem",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈiːkəʊsɪstəm/",
            "us": "/ˈiːkəʊsɪstəm/"
        },
        "nearby": [
            {
                "word": "economy",
                "pos": "noun"
            },
            {
                "word": "economy class syndrome",
                "pos": "noun"
            },
            {
                "word": "ecosystem",
                "pos": "noun"
            },
            {
                "word": "ecoterrorism",
                "pos": "noun"
            },
            {
                "word": "ecoterrorist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the plants and living creatures in a particular area considered in relation to their physical environment",
                    "vi": "tất cả các loài thực vật và sinh vật sống trong một khu vực cụ thể được xem xét liên quan đến môi trường vật chất của chúng"
                },
                "examples": [
                    {
                        "en": "Islands often support delicate ecosystems that evolved without any need for defence.",
                        "vi": "Các hòn đảo thường hỗ trợ các hệ sinh thái tinh vi phát triển mà không cần bất kỳ sự phòng thủ nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "57ae3f37b33a4bb4aa12412640a305e1",
        "word": "environmentalist",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪnˌvaɪrənˈmentəlɪst/",
            "us": "/ɪnˌvaɪrənˈmentəlɪst/"
        },
        "nearby": [
            {
                "word": "Environmental Health Officer",
                "pos": "noun"
            },
            {
                "word": "environmentalism",
                "pos": "noun"
            },
            {
                "word": "environmentalist",
                "pos": "noun"
            },
            {
                "word": "environmentally",
                "pos": "adverb"
            },
            {
                "word": "environmentally friendly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is interested in the natural environment and wants to improve and protect it",
                    "vi": "một người quan tâm đến môi trường tự nhiên và muốn cải thiện và bảo vệ nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d950203711f049f593c24cf149c5a361",
        "word": "environmentally friendly",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪnˌvaɪrənmentəli ˈfrendli/",
            "us": "/ɪnˌvaɪrənmentəli ˈfrendli/"
        },
        "nearby": [
            {
                "word": "environmentalist",
                "pos": "noun"
            },
            {
                "word": "environmentally",
                "pos": "adverb"
            },
            {
                "word": "environmentally friendly",
                "pos": "adjective"
            },
            {
                "word": "the Environmental Protection Agency",
                "pos": ""
            },
            {
                "word": "environs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not harming the environment",
                    "vi": "không gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "environmentally friendly packaging",
                        "vi": "bao bì thân thiện với môi trường"
                    }
                ]
            }
        ]
    },
    {
        "id": "4b92563ef841472181c3ed832a3ac05e",
        "word": "green belt",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡriːn belt/",
            "us": "/ˈɡriːn belt/"
        },
        "nearby": [
            {
                "word": "Green Bay",
                "pos": ""
            },
            {
                "word": "green bean",
                "pos": "noun"
            },
            {
                "word": "green belt",
                "pos": "noun"
            },
            {
                "word": "Green Beret",
                "pos": "noun"
            },
            {
                "word": "green bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of open land around a city where there are strict controls about building",
                    "vi": "một khu vực đất trống xung quanh thành phố, nơi có những kiểm soát chặt chẽ về việc xây dựng"
                },
                "examples": [
                    {
                        "en": "New roads are cutting into the green belt.",
                        "vi": "Những con đường mới đang cắt vào vành đai xanh."
                    },
                    {
                        "en": "Green belt development is carefully regulated.",
                        "vi": "Sự phát triển vành đai xanh được quy định cẩn thận."
                    },
                    {
                        "en": "The government promised to maintain the green belt.",
                        "vi": "Chính phủ hứa sẽ duy trì vành đai xanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "467cc6384c7941c8b344c8bd23df007a",
        "word": "habitat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhæbɪtæt/",
            "us": "/ˈhæbɪtæt/"
        },
        "nearby": [
            {
                "word": "habit",
                "pos": "noun"
            },
            {
                "word": "habitable",
                "pos": "adjective"
            },
            {
                "word": "habitat",
                "pos": "noun"
            },
            {
                "word": "Habitat",
                "pos": ""
            },
            {
                "word": "habitation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where a particular type of animal or plant is normally found",
                    "vi": "nơi mà một loại động vật hoặc thực vật cụ thể thường được tìm thấy"
                },
                "examples": [
                    {
                        "en": "The panda's natural habitat is the bamboo forest.",
                        "vi": "Môi trường sống tự nhiên của gấu trúc là rừng tre."
                    },
                    {
                        "en": "The marshes provide a rich habitat for water plants.",
                        "vi": "Các đầm lầy cung cấp một môi trường sống phong phú cho các loài thực vật nước."
                    },
                    {
                        "en": "the destruction of wildlife habitat",
                        "vi": "sự phá hủy môi trường sống của động vật hoang dã"
                    }
                ]
            }
        ]
    },
    {
        "id": "840298a27a204ddc8c4d40479329eeb3",
        "word": "protection",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈtekʃn/",
            "us": "/prəˈtekʃn/"
        },
        "nearby": [
            {
                "word": "protease",
                "pos": "noun"
            },
            {
                "word": "protect",
                "pos": "verb"
            },
            {
                "word": "protection",
                "pos": "noun"
            },
            {
                "word": "protectionism",
                "pos": "noun"
            },
            {
                "word": "protectionist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of protecting somebody/something; the state of being protected",
                    "vi": "hành động bảo vệ ai đó / cái gì đó; trạng thái được bảo vệ"
                },
                "examples": [
                    {
                        "en": "protection against something Wear clothes that provide adequate protection against the wind and rain.",
                        "vi": "bảo vệ chống lại thứ gì đó Mặc quần áo có đủ khả năng bảo vệ khỏi gió và mưa."
                    },
                    {
                        "en": "protection from something His straw hat offered some protection from the sun.",
                        "vi": "sự bảo vệ khỏi một cái gì đó Mũ rơm của anh ấy cung cấp một số bảo vệ khỏi ánh nắng mặt trời."
                    },
                    {
                        "en": "protection of somebody/something (against/from something) We seek to ensure the protection of human rights.",
                        "vi": "bảo vệ ai đó / cái gì đó (chống lại / khỏi cái gì đó) Chúng tôi cố gắng đảm bảo việc bảo vệ quyền con người."
                    },
                    {
                        "en": "the conservation and protection of the environment",
                        "vi": "bảo tồn và bảo vệ môi trường"
                    },
                    {
                        "en": "protection for somebody/something (against/from something) They are campaigning for better protection for workers.",
                        "vi": "bảo vệ cho ai đó / cái gì đó (chống lại / từ cái gì đó) Họ đang vận động để bảo vệ tốt hơn cho người lao động."
                    },
                    {
                        "en": "for protection She carries a gun in her bag for personal protection.",
                        "vi": "để bảo vệ Cô ấy mang theo một khẩu súng trong túi để bảo vệ cá nhân."
                    },
                    {
                        "en": "under protection He asked to be put under police protection.",
                        "vi": "dưới sự bảo vệ Anh ấy yêu cầu được đặt dưới sự bảo vệ của cảnh sát."
                    },
                    {
                        "en": "under the protection of somebody/something These people remain under the protection of the United Nations.",
                        "vi": "dưới sự bảo vệ của ai đó / điều gì đó Những người này vẫn dưới sự bảo vệ của Liên hợp quốc."
                    },
                    {
                        "en": "data protection laws",
                        "vi": "luật bảo vệ dữ liệu"
                    },
                    {
                        "en": "the importance of environmental protection",
                        "vi": "tầm quan trọng của việc bảo vệ môi trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that protects somebody/something against something",
                    "vi": "một thứ bảo vệ ai đó / cái gì đó chống lại cái gì đó"
                },
                "examples": [
                    {
                        "en": "protection against something The plastic sheeting is not a complete protection against the rain.",
                        "vi": "bảo vệ chống lại thứ gì đó Tấm nhựa không phải là một lớp bảo vệ hoàn toàn khỏi mưa."
                    },
                    {
                        "en": "protection from something The trench served as a protection from enemy gunfire.",
                        "vi": "bảo vệ khỏi một cái gì đó Đường hào đóng vai trò như một lớp bảo vệ khỏi làn đạn của kẻ thù."
                    },
                    {
                        "en": "as (a) protection He wears a helmet as protection.",
                        "vi": "as (a) sự bảo vệ Anh ấy đội mũ bảo hiểm như một sự bảo vệ."
                    },
                    {
                        "en": "as (a) protection against/from something Fill the cooling system with antifreeze as a protection against frost.",
                        "vi": "như (a) bảo vệ chống lại / khỏi thứ gì đó Đổ chất chống đông vào hệ thống làm mát để bảo vệ khỏi sương giá."
                    },
                    {
                        "en": "They wore the charm as a protection against evil spirits.",
                        "vi": "Họ đeo bùa như một vật bảo vệ chống lại linh hồn ma quỷ."
                    }
                ]
            },
            {
                "define": {
                    "en": "insurance against fire, injury, damage, etc.",
                    "vi": "bảo hiểm chống cháy, thương tật, thiệt hại, v.v."
                },
                "examples": [
                    {
                        "en": "Our policy offers complete protection against fire and theft.",
                        "vi": "Chính sách của chúng tôi cung cấp sự bảo vệ hoàn toàn khỏi hỏa hoạn và trộm cắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the system of helping an industry in your own country by taxing foreign goods",
                    "vi": "hệ thống trợ giúp một ngành công nghiệp ở quốc gia của bạn bằng cách đánh thuế hàng hóa nước ngoài"
                },
                "examples": [
                    {
                        "en": "The government is ready to introduce protection for the car industry.",
                        "vi": "Chính phủ đã sẵn sàng đưa ra biện pháp bảo hộ cho ngành công nghiệp xe hơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the system of paying criminals so that they will not attack your business or property",
                    "vi": "hệ thống thanh toán tội phạm để chúng không tấn công doanh nghiệp hoặc tài sản của bạn"
                },
                "examples": [
                    {
                        "en": "to pay protection money",
                        "vi": "trả tiền bảo vệ"
                    },
                    {
                        "en": "to run a protection racket",
                        "vi": "để chạy một vợt bảo vệ"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e960675443142b398d6898b638c76e9",
        "word": "reserve",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈzɜːv/",
            "us": "/rɪˈzɜːrv/"
        },
        "nearby": [
            {
                "word": "reservation",
                "pos": "noun"
            },
            {
                "word": "reservation policy",
                "pos": "noun"
            },
            {
                "word": "reserve",
                "pos": "noun"
            },
            {
                "word": "reserve",
                "pos": "verb"
            },
            {
                "word": "reserve bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a supply of something that is available to be used in the future or when it is needed",
                    "vi": "nguồn cung cấp thứ gì đó có sẵn để sử dụng trong tương lai hoặc khi cần"
                },
                "examples": [
                    {
                        "en": "cash/foreign currency reserves",
                        "vi": "dự trữ tiền mặt / ngoại tệ"
                    },
                    {
                        "en": "large oil and gas reserves",
                        "vi": "trữ lượng dầu khí lớn"
                    },
                    {
                        "en": "reserve funds",
                        "vi": "quỹ dự trữ"
                    },
                    {
                        "en": "reserve of something He discovered unexpected reserves of strength.",
                        "vi": "dự trữ của một cái gì đó Ông đã khám phá ra nguồn dự trữ sức mạnh bất ngờ."
                    },
                    {
                        "en": "The country has the world's largest reserves of coal.",
                        "vi": "Nước này có trữ lượng than lớn nhất thế giới."
                    },
                    {
                        "en": "The company has substantial reserves of capital.",
                        "vi": "Công ty có nguồn vốn dự trữ đáng kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of land that is a protected area for animals, plants, etc.",
                    "vi": "mảnh đất là khu bảo tồn động vật, thực vật, v.v."
                },
                "examples": [
                    {
                        "en": "a wildlife/forest reserve",
                        "vi": "khu bảo tồn động vật hoang dã / rừng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land in the US that is kept separate for Native Americans to live in",
                    "vi": "một khu vực đất ở Hoa Kỳ được giữ riêng biệt cho người Mỹ bản địa sinh sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the quality that somebody has when they do not talk easily to other people about their ideas, feelings, etc.",
                    "vi": "phẩm chất mà ai đó có khi họ không dễ dàng nói chuyện với người khác về ý tưởng, cảm xúc của họ, v.v."
                },
                "examples": [
                    {
                        "en": "She found it difficult to make friends because of her natural reserve.",
                        "vi": "Cô cảm thấy khó kết bạn vì tính dự trữ tự nhiên của mình."
                    },
                    {
                        "en": "Jaime always talked to people without reserve.",
                        "vi": "Jaime luôn nói chuyện với mọi người mà không cần dự trữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling that you do not want to accept or agree to something, etc. until you are quite sure that it is all right to do so",
                    "vi": "cảm giác rằng bạn không muốn chấp nhận hoặc đồng ý với điều gì đó, v.v. cho đến khi bạn chắc chắn rằng làm như vậy là ổn"
                },
                "examples": [
                    {
                        "en": "with reserve Any contract should be treated with reserve until it has been checked.",
                        "vi": "có dự trữ Mọi hợp đồng nên được xử lý bằng dự trữ cho đến khi nó được kiểm tra."
                    },
                    {
                        "en": "without reserve She trusted him without reserve (= completely).",
                        "vi": "không có dự trữ Cô ấy tin tưởng anh ấy mà không cần dự trữ (= hoàn toàn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra player who plays in a team when one of the other players is injured or not available to play",
                    "vi": "một người chơi bổ sung chơi trong một đội khi một trong những người chơi khác bị thương hoặc không có mặt để thi đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a team that is below the level of the main team",
                    "vi": "một đội dưới cấp của đội chính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an extra military force, etc. that is not part of a country’s regular forces, but is available to be used when needed",
                    "vi": "một lực lượng quân sự bổ sung, v.v. không thuộc lực lượng chính quy của một quốc gia, nhưng sẵn sàng sử dụng khi cần thiết"
                },
                "examples": [
                    {
                        "en": "the Army Reserve",
                        "vi": "quân dự bị"
                    },
                    {
                        "en": "the reserve police",
                        "vi": "cảnh sát dự bị"
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest price that somebody will accept for something, especially something that is sold at an auction",
                    "vi": "mức giá thấp nhất mà ai đó sẽ chấp nhận cho một thứ gì đó, đặc biệt là thứ được bán trong một cuộc đấu giá"
                },
                "examples": [
                    {
                        "en": "The painting failed to reach to its reserve and was withdrawn from the sale.",
                        "vi": "Bức tranh đã không đạt được mức dự trữ và đã bị thu hồi khỏi việc bán."
                    }
                ]
            },
            {
                "define": {
                    "en": "available to be used in the future or when needed",
                    "vi": "có sẵn để sử dụng trong tương lai hoặc khi cần thiết"
                },
                "examples": [
                    {
                        "en": "The money was being kept in reserve for their retirement.",
                        "vi": "Số tiền đã được giữ để dự trữ cho thời gian nghỉ hưu của họ."
                    },
                    {
                        "en": "200 police officers were held in reserve.",
                        "vi": "200 sĩ quan cảnh sát được giữ trong lực lượng dự bị."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa4fdc83e65540b785d10c43e6f8496c",
        "word": "sustainable",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/səˈsteɪnəbl/",
            "us": "/səˈsteɪnəbl/"
        },
        "nearby": [
            {
                "word": "sustain",
                "pos": "verb"
            },
            {
                "word": "sustainability",
                "pos": "noun"
            },
            {
                "word": "sustainable",
                "pos": "adjective"
            },
            {
                "word": "sustainably",
                "pos": "adverb"
            },
            {
                "word": "sustained",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving the use of natural products and energy in a way that does not harm the environment",
                    "vi": "liên quan đến việc sử dụng các sản phẩm tự nhiên và năng lượng theo cách không gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "sustainable forest management",
                        "vi": "quản lý rừng bền vững"
                    },
                    {
                        "en": "an environmentally sustainable society",
                        "vi": "một xã hội bền vững với môi trường"
                    },
                    {
                        "en": "This type of farming is simply not sustainable any more.",
                        "vi": "Loại hình canh tác này đơn giản là không bền vững nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "that can continue or be continued for a long time",
                    "vi": "có thể tiếp tục hoặc được tiếp tục trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "sustainable economic growth",
                        "vi": "tăng trưởng kinh tế bền vững"
                    },
                    {
                        "en": "Unfortunately, this level of output is not sustainable.",
                        "vi": "Thật không may, mức sản lượng này không bền vững."
                    }
                ]
            }
        ]
    },
    {
        "id": "1814c162e4cd439a8cb39905c8eb8bb0",
        "word": "biodiversity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbaɪəʊdaɪˈvɜːsəti/",
            "us": "/ˌbaɪəʊdaɪˈvɜːrsəti/"
        },
        "nearby": [
            {
                "word": "biodegrade",
                "pos": "verb"
            },
            {
                "word": "biodiesel",
                "pos": "noun"
            },
            {
                "word": "biodiversity",
                "pos": "noun"
            },
            {
                "word": "bioenergy",
                "pos": "noun"
            },
            {
                "word": "bioengineering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the existence of a large number of different kinds of animals and plants which make a balanced environment",
                    "vi": "sự tồn tại của một số lượng lớn các loại động vật và thực vật khác nhau tạo nên một môi trường cân bằng"
                },
                "examples": [
                    {
                        "en": "The mining project threatens one of the world’s richest areas of biodiversity.",
                        "vi": "Dự án khai thác đang đe dọa một trong những khu vực đa dạng sinh học phong phú nhất thế giới."
                    }
                ]
            }
        ]
    },
    {
        "id": "553bc26332d9441696a5618ef4b04585",
        "word": "biological diversity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbaɪəˌlɒdʒɪkl daɪˈvɜːsəti/",
            "us": "/ˌbaɪəˌlɑːdʒɪkl daɪˈvɜːrsəti/"
        },
        "nearby": [
            {
                "word": "biological",
                "pos": "adjective"
            },
            {
                "word": "biological clock",
                "pos": "noun"
            },
            {
                "word": "biological diversity",
                "pos": "noun"
            },
            {
                "word": "biologically",
                "pos": "adverb"
            },
            {
                "word": "biological warfare",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the existence of a large number of different kinds of animals and plants which make a balanced environment",
                    "vi": "sự tồn tại của một số lượng lớn các loại động vật và thực vật khác nhau tạo nên một môi trường cân bằng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce55eabc2cc24683a1a5a17c95a5ed10",
        "word": "conservationist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒnsəˈveɪʃənɪst/",
            "us": "/ˌkɑːnsərˈveɪʃənɪst/"
        },
        "nearby": [
            {
                "word": "conservation",
                "pos": "noun"
            },
            {
                "word": "conservation area",
                "pos": "noun"
            },
            {
                "word": "conservationist",
                "pos": "noun"
            },
            {
                "word": "conservatism",
                "pos": "noun"
            },
            {
                "word": "conservative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who takes an active part in the protection of the environment",
                    "vi": "một người tích cực tham gia bảo vệ môi trường"
                },
                "examples": [
                    {
                        "en": "a meeting of local conservationists",
                        "vi": "một cuộc họp của các nhà bảo tồn địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "e0ac8292c03740d5b9bcba5096d6b41c",
        "word": "conserve",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈsɜːv/",
            "us": "/kənˈsɜːrv/"
        },
        "nearby": [
            {
                "word": "conservator",
                "pos": "noun"
            },
            {
                "word": "conservatory",
                "pos": "noun"
            },
            {
                "word": "conserve",
                "pos": "verb"
            },
            {
                "word": "conserve",
                "pos": "noun"
            },
            {
                "word": "consider",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to protect something and prevent it from being changed or destroyed",
                    "vi": "để bảo vệ thứ gì đó và ngăn nó bị thay đổi hoặc phá hủy"
                },
                "examples": [
                    {
                        "en": "new laws to conserve wildlife in the area",
                        "vi": "luật mới để bảo tồn động vật hoang dã trong khu vực"
                    }
                ]
            },
            {
                "define": {
                    "en": "to use as little of something as possible so that it lasts a long time",
                    "vi": "sử dụng càng ít thứ gì đó càng tốt để nó tồn tại trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "Help to conserve energy by insulating your home.",
                        "vi": "Giúp tiết kiệm năng lượng bằng cách cách nhiệt cho ngôi nhà của bạn."
                    },
                    {
                        "en": "Renewable energy resources can help conserve fossil fuels and reduce carbon emissions.",
                        "vi": "Các nguồn năng lượng tái tạo có thể giúp bảo tồn nhiên liệu hóa thạch và giảm lượng khí thải carbon."
                    }
                ]
            }
        ]
    },
    {
        "id": "af0c6cf6fb86424e913fc7b7d1541b18",
        "word": "ecological",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌiːkəˈlɒdʒɪkl/",
            "us": "/ˌiːkəˈlɑːdʒɪkl/"
        },
        "nearby": [
            {
                "word": "eco-friendly",
                "pos": "adjective"
            },
            {
                "word": "E. coli",
                "pos": "noun"
            },
            {
                "word": "ecological",
                "pos": "adjective"
            },
            {
                "word": "ecological footprint",
                "pos": "noun"
            },
            {
                "word": "ecologically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the relation of plants and living creatures to each other and to their environment",
                    "vi": "kết nối với mối quan hệ của thực vật và sinh vật với nhau và với môi trường của chúng"
                },
                "examples": [
                    {
                        "en": "We risk upsetting the ecological balance of the area.",
                        "vi": "Chúng ta có nguy cơ làm đảo lộn cân bằng sinh thái của khu vực."
                    },
                    {
                        "en": "an ecological disaster (= one that alters the whole balance of ecology in an area)",
                        "vi": "một thảm họa sinh thái (= một thảm họa làm thay đổi toàn bộ cân bằng sinh thái trong một khu vực)"
                    }
                ]
            },
            {
                "define": {
                    "en": "interested in and concerned about the ecology of a place",
                    "vi": "quan tâm và quan tâm đến hệ sinh thái của một địa điểm"
                },
                "examples": [
                    {
                        "en": "the ecological movement",
                        "vi": "phong trào sinh thái"
                    }
                ]
            }
        ]
    },
    {
        "id": "5b325897d56445b9b650c84ba8c55245",
        "word": "ecologist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/iˈkɒlədʒɪst/",
            "us": "/iˈkɑːlədʒɪst/"
        },
        "nearby": [
            {
                "word": "ecological footprint",
                "pos": "noun"
            },
            {
                "word": "ecologically",
                "pos": "adverb"
            },
            {
                "word": "ecologist",
                "pos": "noun"
            },
            {
                "word": "ecology",
                "pos": "noun"
            },
            {
                "word": "e-commerce",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a scientist who studies ecology",
                    "vi": "một nhà khoa học nghiên cứu sinh thái học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is interested in ecology and believes the environment should be protected",
                    "vi": "một người quan tâm đến sinh thái và tin rằng môi trường cần được bảo vệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e85af4b600244daa81125b49d721b1d3",
        "word": "environmentalism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˌvaɪrənˈmentəlɪzəm/",
            "us": "/ɪnˌvaɪrənˈmentəlɪzəm/"
        },
        "nearby": [
            {
                "word": "environmental art",
                "pos": "noun"
            },
            {
                "word": "Environmental Health Officer",
                "pos": "noun"
            },
            {
                "word": "environmentalism",
                "pos": "noun"
            },
            {
                "word": "environmentalist",
                "pos": "noun"
            },
            {
                "word": "environmentally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "concern about the natural environment and how to improve and protect it",
                    "vi": "quan tâm đến môi trường tự nhiên và làm thế nào để cải thiện và bảo vệ nó"
                },
                "examples": [
                    {
                        "en": "This paper examines the rise of environmentalism in France and its impact on French society.",
                        "vi": "Bài báo này xem xét sự trỗi dậy của chủ nghĩa môi trường ở Pháp và tác động của nó đối với xã hội Pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "df9f1879a2d742c4b4023546a1ab2248",
        "word": "logging",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlɒɡɪŋ/",
            "us": "/ˈlɔːɡɪŋ/"
        },
        "nearby": [
            {
                "word": "loggerheads",
                "pos": "noun"
            },
            {
                "word": "loggia",
                "pos": "noun"
            },
            {
                "word": "logging",
                "pos": "noun"
            },
            {
                "word": "logic",
                "pos": "noun"
            },
            {
                "word": "-logic",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the work or business of cutting down trees for their wood",
                    "vi": "công việc hoặc kinh doanh của việc chặt cây để lấy gỗ của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5c0474e4a9f74988800a08830f670523",
        "word": "low-impact",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌləʊ ˈɪmpækt/",
            "us": "/ˌləʊ ˈɪmpækt/"
        },
        "nearby": [
            {
                "word": "low-grade",
                "pos": "adjective"
            },
            {
                "word": "low-hanging fruit",
                "pos": "noun"
            },
            {
                "word": "low-impact",
                "pos": "adjective"
            },
            {
                "word": "low-key",
                "pos": "adjective"
            },
            {
                "word": "lowland",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving movements that do not put a lot of stress on the body",
                    "vi": "liên quan đến các chuyển động không gây căng thẳng cho cơ thể"
                },
                "examples": [
                    {
                        "en": "low-impact aerobics",
                        "vi": "thể dục nhịp điệu tác động thấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "not causing very many problems or changes, especially in the environment",
                    "vi": "không gây ra nhiều vấn đề hoặc thay đổi, đặc biệt là trong môi trường"
                },
                "examples": [
                    {
                        "en": "low-impact tourism",
                        "vi": "du lịch tác động thấp"
                    }
                ]
            }
        ]
    },
    {
        "id": "fc425e65c41f43beaba97b7cf8360de7",
        "word": "managed",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmænɪdʒd/",
            "us": "/ˈmænɪdʒd/"
        },
        "nearby": [
            {
                "word": "manage",
                "pos": "verb"
            },
            {
                "word": "manageable",
                "pos": "adjective"
            },
            {
                "word": "managed",
                "pos": "adjective"
            },
            {
                "word": "managed care",
                "pos": "noun"
            },
            {
                "word": "management",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done or arranged with care and control",
                    "vi": "được thực hiện hoặc sắp xếp với sự cẩn thận và kiểm soát"
                },
                "examples": [
                    {
                        "en": "The money will be invested in managed funds.",
                        "vi": "Số tiền sẽ được đầu tư vào các quỹ được quản lý."
                    },
                    {
                        "en": "Only wood from managed forests is used in our furniture.",
                        "vi": "Chỉ gỗ từ các khu rừng được quản lý mới được sử dụng trong đồ nội thất của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "1cb070f28019493cbb6ed78961c61f79",
        "word": "nature reserve",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈneɪtʃə rɪzɜːv/",
            "us": "/ˈneɪtʃər rɪzɜːrv/"
        },
        "nearby": [
            {
                "word": "nature",
                "pos": "noun"
            },
            {
                "word": "Nature",
                "pos": ""
            },
            {
                "word": "nature reserve",
                "pos": "noun"
            },
            {
                "word": "nature strip",
                "pos": "noun"
            },
            {
                "word": "nature trail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land where the animals and plants are protected",
                    "vi": "một khu vực đất nơi động vật và thực vật được bảo vệ"
                },
                "examples": [
                    {
                        "en": "The area has been designated a nature reserve.",
                        "vi": "Khu vực này đã được chỉ định là một khu bảo tồn thiên nhiên."
                    }
                ]
            }
        ]
    },
    {
        "id": "66518487653b449bbeea5b77563d8680",
        "word": "reintroduce",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːɪntrəˈdjuːs/",
            "us": "/ˌriːɪntrəˈduːs/"
        },
        "nearby": [
            {
                "word": "reinterpret",
                "pos": "verb"
            },
            {
                "word": "reinterpretation",
                "pos": "noun"
            },
            {
                "word": "reintroduce",
                "pos": "verb"
            },
            {
                "word": "reintroduction",
                "pos": "noun"
            },
            {
                "word": "reinvent",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to start to use something again",
                    "vi": "để bắt đầu sử dụng lại thứ gì đó"
                },
                "examples": [
                    {
                        "en": "reintroduce something to reintroduce the death penalty",
                        "vi": "giới thiệu lại một cái gì đó để giới thiệu lại án tử hình"
                    },
                    {
                        "en": "reintroduce something to something plans to reintroduce trams to the city",
                        "vi": "giới thiệu lại điều gì đó với kế hoạch giới thiệu lại xe điện đến thành phố"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a type of animal, bird or plant back into a region where it once lived",
                    "vi": "đưa một loại động vật, chim hoặc thực vật trở lại khu vực nơi nó từng sinh sống"
                },
                "examples": [
                    {
                        "en": "The centre has a fifty per cent success rate of reintroducing animals to the wild.",
                        "vi": "Trung tâm có tỷ lệ đưa động vật về tự nhiên thành công là 50%."
                    }
                ]
            }
        ]
    },
    {
        "id": "5002920c42be45aeae466d114e1310fe",
        "word": "sanctuary",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsæŋktʃuəri/",
            "us": "/ˈsæŋktʃueri/"
        },
        "nearby": [
            {
                "word": "sanction",
                "pos": "verb"
            },
            {
                "word": "sanctity",
                "pos": "noun"
            },
            {
                "word": "sanctuary",
                "pos": "noun"
            },
            {
                "word": "sanctum",
                "pos": "noun"
            },
            {
                "word": "sand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area where wild birds or animals are protected and encouraged to produce young",
                    "vi": "một khu vực mà các loài chim hoặc động vật hoang dã được bảo vệ và khuyến khích sinh sản"
                },
                "examples": [
                    {
                        "en": "a bird/wildlife sanctuary",
                        "vi": "một khu bảo tồn chim / động vật hoang dã"
                    },
                    {
                        "en": "The island was declared a wildlife sanctuary in 1969.",
                        "vi": "Đảo được tuyên bố là khu bảo tồn động vật hoang dã vào năm 1969."
                    }
                ]
            },
            {
                "define": {
                    "en": "safety and protection, especially for people who are in danger of being attacked or captured",
                    "vi": "an toàn và bảo vệ, đặc biệt là đối với những người có nguy cơ bị tấn công hoặc bị bắt giữ"
                },
                "examples": [
                    {
                        "en": "to seek/find/take sanctuary in a place",
                        "vi": "tìm kiếm / tìm kiếm / lấy nơi tôn nghiêm"
                    },
                    {
                        "en": "The government offered sanctuary to 4 000 refugees.",
                        "vi": "Chính phủ đã cung cấp khu bảo tồn cho 4000 người tị nạn."
                    },
                    {
                        "en": "She longed for the sanctuary of her own home.",
                        "vi": "Cô khao khát nơi tôn nghiêm của chính ngôi nhà của mình."
                    },
                    {
                        "en": "a place of sanctuary",
                        "vi": "một nơi tôn nghiêm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a safe place, especially one where people who are in danger of being attacked or captured can stay and be protected",
                    "vi": "một nơi an toàn, đặc biệt là một nơi mà những người có nguy cơ bị tấn công hoặc bị bắt giữ có thể ở lại và được bảo vệ"
                },
                "examples": [
                    {
                        "en": "The church became a sanctuary for the refugees.",
                        "vi": "Nhà thờ trở thành nơi tôn nghiêm của những người tị nạn."
                    },
                    {
                        "en": "It had been built as a sanctuary from World War II bombs.",
                        "vi": "Nó đã được xây dựng như một khu bảo tồn khỏi bom của Thế chiến thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a holy building or the part of it that is considered the most holy",
                    "vi": "một tòa nhà thánh hoặc một phần của nó được coi là thánh thiêng nhất"
                },
                "examples": [
                    {
                        "en": "the sanctuary of Poseidon at Sourvion",
                        "vi": "thánh địa của Poseidon tại Sourvion"
                    },
                    {
                        "en": "Women were forbidden to enter the sanctuary.",
                        "vi": "Phụ nữ bị cấm vào khu bảo tồn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0ce831a0031489d971ab4110d1741df",
        "word": "conservancy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈsɜːvənsi/",
            "us": "/kənˈsɜːrvənsi/"
        },
        "nearby": [
            {
                "word": "consequentially",
                "pos": "adverb"
            },
            {
                "word": "consequently",
                "pos": "adverb"
            },
            {
                "word": "conservancy",
                "pos": "noun"
            },
            {
                "word": "conservation",
                "pos": "noun"
            },
            {
                "word": "conservation area",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of officials who control the use of a port, a river, an area of land, etc.",
                    "vi": "một nhóm quan chức kiểm soát việc sử dụng cảng, sông, diện tích đất đai, v.v."
                },
                "examples": [
                    {
                        "en": "the Thames Conservancy",
                        "vi": "Thames Conservancy"
                    },
                    {
                        "en": "Texas Nature Conservancy",
                        "vi": "Bảo tồn Thiên nhiên Texas"
                    }
                ]
            },
            {
                "define": {
                    "en": "the protection of the natural environment",
                    "vi": "bảo vệ môi trường tự nhiên"
                },
                "examples": [
                    {
                        "en": "nature conservancy",
                        "vi": "bảo tồn thiên nhiên"
                    }
                ]
            }
        ]
    },
    {
        "id": "93ed12ef35524d3bb245ccc86aff0904",
        "word": "ecoterrorism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːkəʊterərɪzəm/",
            "us": "/ˈiːkəʊterərɪzəm/"
        },
        "nearby": [
            {
                "word": "economy class syndrome",
                "pos": "noun"
            },
            {
                "word": "ecosystem",
                "pos": "noun"
            },
            {
                "word": "ecoterrorism",
                "pos": "noun"
            },
            {
                "word": "ecoterrorist",
                "pos": "noun"
            },
            {
                "word": "ecotourism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "violent activities that are carried out in order to draw attention to issues relating to the environment",
                    "vi": "các hoạt động bạo lực được thực hiện nhằm thu hút sự chú ý đến các vấn đề liên quan đến môi trường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "deliberate damage to the environment, done in order to draw attention to a political issue",
                    "vi": "cố ý làm hỏng môi trường, được thực hiện để thu hút sự chú ý đến một vấn đề chính trị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "723399398ec44432b89a5f9bf37fa559",
        "word": "ecotourism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːkəʊtʊərɪzəm/",
            "us": "/ˈiːkəʊtʊrɪzəm/"
        },
        "nearby": [
            {
                "word": "ecoterrorism",
                "pos": "noun"
            },
            {
                "word": "ecoterrorist",
                "pos": "noun"
            },
            {
                "word": "ecotourism",
                "pos": "noun"
            },
            {
                "word": "ecotourist",
                "pos": "noun"
            },
            {
                "word": "ecotown",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "organized holidays that are designed so that the tourists damage the environment as little as possible, especially when some of the money they pay is used to protect the local environment and animals",
                    "vi": "Các kỳ nghỉ được tổ chức được thiết kế sao cho khách du lịch làm tổn hại đến môi trường ít nhất có thể, đặc biệt là khi một số tiền họ trả được dùng để bảo vệ môi trường và động vật địa phương"
                },
                "examples": [
                    {
                        "en": "Ecotourism is financing rainforest preservation.",
                        "vi": "Du lịch sinh thái là tài trợ cho việc bảo tồn rừng nhiệt đới."
                    }
                ]
            }
        ]
    },
    {
        "id": "81714691802048b99b2b28eb8b84a5be",
        "word": "eco-warrior",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːkəʊ wɒriə(r)/",
            "us": "/ˈiːkəʊ wɔːriər/"
        },
        "nearby": [
            {
                "word": "ecotown",
                "pos": "noun"
            },
            {
                "word": "ecotype",
                "pos": "noun"
            },
            {
                "word": "eco-warrior",
                "pos": "noun"
            },
            {
                "word": "ecru",
                "pos": "noun"
            },
            {
                "word": "ecstasy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who actively tries to prevent damage to the environment",
                    "vi": "một người tích cực cố gắng ngăn chặn thiệt hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "Eco-warriors have set up camps around the airport site.",
                        "vi": "Các chiến binh sinh thái đã dựng trại xung quanh khu vực sân bay."
                    },
                    {
                        "en": "The eco-warrior discussed causes close to his heart, including organic farming, hedge-laying and healthy school dinners.",
                        "vi": "Chiến binh sinh thái đã thảo luận về những nguyên nhân gần gũi với trái tim của anh ta, bao gồm nông nghiệp hữu cơ, chăn nuôi hàng rào và bữa tối ở trường lành mạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fce12acdf97748f5a6d7f59f1529ffc9",
        "word": "fell",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/fel/",
            "us": "/fel/"
        },
        "nearby": [
            {
                "word": "Felix the Cat",
                "pos": ""
            },
            {
                "word": "fell",
                "pos": "noun"
            },
            {
                "word": "fell",
                "pos": "verb"
            },
            {
                "word": "fell",
                "pos": "adjective"
            },
            {
                "word": "fella",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut down a tree",
                    "vi": "chặt cây"
                },
                "examples": [
                    {
                        "en": "Trees were felled and floated downstream.",
                        "vi": "Cây cối bị đốn hạ và trôi về phía hạ lưu."
                    },
                    {
                        "en": "illegally felled timber",
                        "vi": "gỗ bị đốn hạ bất hợp pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody fall to the ground",
                    "vi": "làm cho ai đó rơi xuống đất"
                },
                "examples": [
                    {
                        "en": "He felled his opponent with a single blow.",
                        "vi": "Anh ta hạ gục đối thủ chỉ với một đòn duy nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "c5f59c6a2dc740c7a062ff23d21f14b0",
        "word": "Gaia",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡaɪə/",
            "us": "/ˈɡaɪə/"
        },
        "nearby": [
            {
                "word": "gag order",
                "pos": "noun"
            },
            {
                "word": "gag rule",
                "pos": "noun"
            },
            {
                "word": "Gaia",
                "pos": "noun"
            },
            {
                "word": "gaiety",
                "pos": "noun"
            },
            {
                "word": "the Gaiety Girls",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the Earth, considered as a single natural system that organizes and controls itself",
                    "vi": "Trái đất, được coi là một hệ thống tự nhiên duy nhất tự tổ chức và kiểm soát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "54bdbeebf490422a999d33a06f7970a9",
        "word": "game reserve",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡeɪm rɪzɜːv/",
            "us": "/ˈɡeɪm rɪzɜːrv/"
        },
        "nearby": [
            {
                "word": "game point",
                "pos": "noun"
            },
            {
                "word": "gamer",
                "pos": "noun"
            },
            {
                "word": "game reserve",
                "pos": "noun"
            },
            {
                "word": "games console",
                "pos": "noun"
            },
            {
                "word": "game show",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large area of land where wild animals can live in safety",
                    "vi": "một vùng đất rộng lớn nơi động vật hoang dã có thể an toàn sinh sống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73334b80e326490cb363e274ca7c77d7",
        "word": "green",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡriːn/",
            "us": "/ɡriːn/"
        },
        "nearby": [
            {
                "word": "green",
                "pos": "adjective"
            },
            {
                "word": "green",
                "pos": "noun"
            },
            {
                "word": "green",
                "pos": "verb"
            },
            {
                "word": "green audit",
                "pos": "noun"
            },
            {
                "word": "Kate Greenaway",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to create parks and other areas with trees and plants in a city",
                    "vi": "để tạo công viên và các khu vực khác có cây cối và thực vật trong thành phố"
                },
                "examples": [
                    {
                        "en": "projects for greening the cities",
                        "vi": "dự án xanh hóa thành phố"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody more aware of issues connected with the environment; to make something appear friendly towards the environment",
                    "vi": "để làm cho ai đó nhận thức rõ hơn về các vấn đề liên quan đến môi trường; để làm cho một cái gì đó có vẻ thân thiện với môi trường"
                },
                "examples": [
                    {
                        "en": "an attempt to green industry bosses",
                        "vi": "một nỗ lực để làm chủ ngành công nghiệp xanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "005faa677e6c4fba82997eba66601ca2",
        "word": "green audit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡriːn ˈɔːdɪt/",
            "us": "/ˌɡriːn ˈɔːdɪt/"
        },
        "nearby": [
            {
                "word": "green",
                "pos": "noun"
            },
            {
                "word": "green",
                "pos": "verb"
            },
            {
                "word": "green audit",
                "pos": "noun"
            },
            {
                "word": "Kate Greenaway",
                "pos": ""
            },
            {
                "word": "greenback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official examination of the effect of a company’s business on the environment",
                    "vi": "một cuộc kiểm tra chính thức về ảnh hưởng của hoạt động kinh doanh của một công ty đối với môi trường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "90ae4b45f75844398a22ae6fe2b3bcb5",
        "word": "green manure",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡriːn məˈnjʊə(r)/",
            "us": "/ˌɡriːn məˈnʊr/"
        },
        "nearby": [
            {
                "word": "green-light",
                "pos": "verb"
            },
            {
                "word": "Green Man",
                "pos": "noun"
            },
            {
                "word": "green manure",
                "pos": "noun"
            },
            {
                "word": "greenness",
                "pos": "noun"
            },
            {
                "word": "green onion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "plants that are dug into the soil in order to improve its quality",
                    "vi": "thực vật được đào vào đất để cải thiện chất lượng của nó"
                },
                "examples": [
                    {
                        "en": "Green manure crops such as alfalfa and mustard are widely used in organic gardening.",
                        "vi": "Cây phân xanh như cỏ linh lăng và mù tạt được sử dụng rộng rãi trong làm vườn hữu cơ."
                    }
                ]
            }
        ]
    },
    {
        "id": "61b2c8e12b054361abbc45e33178c71b",
        "word": "greenwash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡriːnwɒʃ/",
            "us": "/ˈɡriːnwɔːʃ/"
        },
        "nearby": [
            {
                "word": "green vegetable",
                "pos": "noun"
            },
            {
                "word": "green wall",
                "pos": "noun"
            },
            {
                "word": "greenwash",
                "pos": "noun"
            },
            {
                "word": "the green welly brigade",
                "pos": "noun"
            },
            {
                "word": "Greenwich",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "activities by a company or an organization that are intended to make people think that it is concerned about the environment, even if its real business actually harms the environment",
                    "vi": "các hoạt động của một công ty hoặc một tổ chức nhằm làm cho mọi người nghĩ rằng họ quan tâm đến môi trường, ngay cả khi hoạt động kinh doanh thực sự của họ thực sự gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "A common form of greenwash is to publicly claim a commitment to the environment while quietly lobbying to avoid regulation.",
                        "vi": "Một hình thức thông minh phổ biến là công khai tuyên bố cam kết về môi trường trong khi âm thầm vận động hành lang để tránh các quy định."
                    }
                ]
            }
        ]
    },
    {
        "id": "e6f34090606e45688043dfce3898125a",
        "word": "log",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɒɡ/",
            "us": "/lɔːɡ/"
        },
        "nearby": [
            {
                "word": "log",
                "pos": "noun"
            },
            {
                "word": "-log",
                "pos": "combining form"
            },
            {
                "word": "log",
                "pos": "verb"
            },
            {
                "word": "Logan",
                "pos": ""
            },
            {
                "word": "loganberry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put information in an official record or write a record of events",
                    "vi": "để đưa thông tin vào một hồ sơ chính thức hoặc viết một bản ghi các sự kiện"
                },
                "examples": [
                    {
                        "en": "The police log all phone calls.",
                        "vi": "Cảnh sát ghi lại tất cả các cuộc điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel a particular distance or for a particular length of time",
                    "vi": "để đi một khoảng cách cụ thể hoặc trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "The pilot has logged 1 000 hours in the air.",
                        "vi": "Phi công đã đăng nhập 1000 giờ trên không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut down trees in a forest for their wood",
                    "vi": "chặt cây trong rừng để lấy gỗ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bdba0745a1af4bacb9e1bb681301edf4",
        "word": "rewilding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈwaɪldɪŋ/",
            "us": "/ˌriːˈwaɪldɪŋ/"
        },
        "nearby": [
            {
                "word": "rewatch",
                "pos": "verb"
            },
            {
                "word": "rewatch",
                "pos": "noun"
            },
            {
                "word": "rewilding",
                "pos": "noun"
            },
            {
                "word": "rewind",
                "pos": "verb"
            },
            {
                "word": "rewind button",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of helping large areas of land to return to their natural state",
                    "vi": "thực hành giúp những vùng đất rộng lớn trở lại trạng thái tự nhiên của chúng"
                },
                "examples": [
                    {
                        "en": "There is a proposal for the rewilding of the islands.",
                        "vi": "Có một đề xuất cho việc cuộn lại các đảo."
                    },
                    {
                        "en": "Rewilding represents a desire to return to the state in which humans existed before the advent of civilization.",
                        "vi": "Tua lại thể hiện mong muốn quay trở lại trạng thái mà con người đã tồn tại trước khi nền văn minh ra đời."
                    }
                ]
            }
        ]
    }
]