[
    {
        "id": "941ab5ce2c924fe8b3427d4b4d3df930",
        "word": "alone",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈləʊn/",
            "us": "/əˈləʊn/"
        },
        "nearby": [
            {
                "word": "aloha",
                "pos": "exclamation"
            },
            {
                "word": "aloha shirt",
                "pos": "noun"
            },
            {
                "word": "alone",
                "pos": "adjective"
            },
            {
                "word": "along",
                "pos": "preposition"
            },
            {
                "word": "along",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without any other people",
                    "vi": "không có bất kỳ người nào khác"
                },
                "examples": [
                    {
                        "en": "not alone in Tom is not alone in finding Rick hard to work with.",
                        "vi": "không đơn độc ở Tom không đơn độc trong việc thấy Rick khó làm việc cùng."
                    },
                    {
                        "en": "be alone with somebody/something She did not want to be alone with him.",
                        "vi": "ở một mình với ai đó / điều gì đó Cô ấy không muốn ở một mình với anh ấy."
                    },
                    {
                        "en": "He was afraid of being alone with his thoughts.",
                        "vi": "Anh sợ cô đơn với những suy nghĩ của mình."
                    },
                    {
                        "en": "He lives alone.",
                        "vi": "Anh ấy sông một mình."
                    },
                    {
                        "en": "She was sitting all alone in the hall.",
                        "vi": "Cô ấy đang ngồi một mình trong hội trường."
                    },
                    {
                        "en": "Finally the two of us were alone together.",
                        "vi": "Cuối cùng thì hai chúng tôi đã ở riêng với nhau."
                    },
                    {
                        "en": "I don't like going out alone at night.",
                        "vi": "Tôi không thích đi chơi một mình vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "without the help of other people or things",
                    "vi": "mà không có sự giúp đỡ của người khác hoặc những thứ khác"
                },
                "examples": [
                    {
                        "en": "It's hard bringing up children alone.",
                        "vi": "Thật khó để nuôi dạy con cái một mình."
                    },
                    {
                        "en": "The assassin said he had acted alone.",
                        "vi": "Sát thủ nói rằng anh ta đã hành động một mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "lonely and unhappy or without any friends",
                    "vi": "cô đơn và không hạnh phúc hoặc không có bất kỳ người bạn nào"
                },
                "examples": [
                    {
                        "en": "Carol felt all alone in the world.",
                        "vi": "Carol cảm thấy cô đơn trên thế giới này."
                    },
                    {
                        "en": "I've been so alone since you went away.",
                        "vi": "Tôi đã rất cô đơn kể từ khi bạn đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a noun or pronoun to show that the person or thing mentioned is the only one",
                    "vi": "được sử dụng sau một danh từ hoặc đại từ để chỉ người hoặc vật được đề cập là duy nhất"
                },
                "examples": [
                    {
                        "en": "You can't blame anyone else; you alone made the decision.",
                        "vi": "Bạn không thể đổ lỗi cho bất kỳ ai khác; một mình bạn đưa ra quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a noun or pronoun to emphasize one particular thing",
                    "vi": "được sử dụng sau một danh từ hoặc đại từ để nhấn mạnh một điều cụ thể"
                },
                "examples": [
                    {
                        "en": "The shoes alone cost £200.",
                        "vi": "Chỉ riêng đôi giày đã có giá 200 bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something without help from anyone",
                    "vi": "để làm điều gì đó mà không cần sự giúp đỡ từ bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "Andrew decided to go it alone and start his own business.",
                        "vi": "Andrew quyết định đi một mình và bắt đầu công việc kinh doanh của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop annoying somebody or trying to get their attention",
                    "vi": "để ngừng làm phiền ai đó hoặc cố gắng thu hút sự chú ý của họ"
                },
                "examples": [
                    {
                        "en": "She's asked to be left alone but the press photographers follow her everywhere.",
                        "vi": "Cô ấy được yêu cầu được để một mình nhưng các phóng viên ảnh theo dõi cô ấy ở khắp mọi nơi."
                    },
                    {
                        "en": "Don't touch me! Leave me alone!",
                        "vi": "Đừng chạm vào tôi! Để tôi yên!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop touching, changing, or moving something",
                    "vi": "ngừng chạm vào, thay đổi hoặc di chuyển thứ gì đó"
                },
                "examples": [
                    {
                        "en": "I've told you before—leave my things alone!",
                        "vi": "Tôi đã nói với bạn rồi - hãy để mọi thứ của tôi yên!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a statement to emphasize that because the first thing is not true or possible, the next thing cannot be true or possible either",
                    "vi": "được sử dụng sau một tuyên bố để nhấn mạnh rằng bởi vì điều đầu tiên không đúng hoặc có thể xảy ra, điều tiếp theo cũng không thể đúng hoặc có thể"
                },
                "examples": [
                    {
                        "en": "There isn't enough room for us, let alone any guests.",
                        "vi": "Không có đủ chỗ cho chúng tôi, chưa nói đến bất kỳ khách nào."
                    },
                    {
                        "en": "I didn’t have any clothes, let alone a passport.",
                        "vi": "Tôi không có quần áo chứ đừng nói đến hộ chiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be independent or not connected with other people, organizations or ideas",
                    "vi": "độc lập hoặc không kết nối với những người, tổ chức hoặc ý tưởng khác"
                },
                "examples": [
                    {
                        "en": "These islands are too small to stand alone as independent states.",
                        "vi": "Những hòn đảo này quá nhỏ để có thể đứng riêng lẻ thành các quốc gia độc lập."
                    },
                    {
                        "en": "The problems that research is designed to solve do not stand alone, but are part of a wider context.",
                        "vi": "Các vấn đề mà nghiên cứu được thiết kế để giải quyết không đứng riêng lẻ, mà là một phần của bối cảnh rộng lớn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be not near other objects or buildings",
                    "vi": "không ở gần các vật thể hoặc tòa nhà khác"
                },
                "examples": [
                    {
                        "en": "The arch once stood alone at the entrance to the castle.",
                        "vi": "Cổng vòm từng đứng một mình ở lối vào lâu đài."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will have to wait for some time to find out the result of a situation",
                    "vi": "thường nói rằng bạn sẽ phải đợi một thời gian để tìm ra kết quả của một tình huống"
                },
                "examples": [
                    {
                        "en": "Only time will tell if the treatment has been successful.",
                        "vi": "Chỉ có thời gian mới biết liệu việc điều trị có thành công hay không."
                    }
                ]
            }
        ]
    },
    {
        "id": "4142df3274a649138a14c3653aa8e4fb",
        "word": "desolate",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdesələt/",
            "us": "/ˈdesələt/"
        },
        "nearby": [
            {
                "word": "Des Moines",
                "pos": ""
            },
            {
                "word": "Desmond",
                "pos": ""
            },
            {
                "word": "desolate",
                "pos": "adjective"
            },
            {
                "word": "desolate",
                "pos": "verb"
            },
            {
                "word": "desolation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "empty and without people, making you feel sad or frightened",
                    "vi": "trống rỗng và không có người, khiến bạn cảm thấy buồn hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "They looked out on a bleak and desolate landscape.",
                        "vi": "Họ nhìn ra một khung cảnh ảm đạm và hoang vắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very lonely and unhappy",
                    "vi": "rất cô đơn và không hạnh phúc"
                },
                "examples": [
                    {
                        "en": "The loss of his friend made him feel utterly desolate.",
                        "vi": "Việc mất đi người bạn khiến anh cảm thấy vô cùng hoang vắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b820c78f82544655adcbb7e049d64a0b",
        "word": "isolation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌaɪsəˈleɪʃn/",
            "us": "/ˌaɪsəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "isolated",
                "pos": "adjective"
            },
            {
                "word": "isolating",
                "pos": "adjective"
            },
            {
                "word": "isolation",
                "pos": "noun"
            },
            {
                "word": "isolationism",
                "pos": "noun"
            },
            {
                "word": "isolationist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of separating somebody/something; the state of being separate",
                    "vi": "hành động tách rời ai đó / cái gì đó; trạng thái tách biệt"
                },
                "examples": [
                    {
                        "en": "geographical isolation",
                        "vi": "cách ly địa lý"
                    },
                    {
                        "en": "an isolation hospital/ward (= for people with infectious diseases)",
                        "vi": "bệnh viện / khu cách ly (= dành cho những người mắc bệnh truyền nhiễm)"
                    },
                    {
                        "en": "isolation (from somebody/something) The country has been threatened with complete isolation from the international community unless the atrocities stop.",
                        "vi": "cô lập (với ai đó / cái gì đó) Quốc gia đã bị đe dọa bị cô lập hoàn toàn khỏi cộng đồng quốc tế trừ khi hành động tàn bạo dừng lại."
                    },
                    {
                        "en": "He lives in splendid isolation (= far from, or in a superior position to, everyone else).",
                        "vi": "Anh ta sống trong sự cô lập tuyệt vời (= xa, hoặc ở vị trí cao hơn tất cả những người khác)."
                    },
                    {
                        "en": "the isolation of the polio virus",
                        "vi": "sự phân lập của vi rút bại liệt"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being alone or lonely",
                    "vi": "trạng thái ở một mình hoặc cô đơn"
                },
                "examples": [
                    {
                        "en": "Many unemployed people experience feelings of isolation and depression.",
                        "vi": "Nhiều người thất nghiệp trải qua cảm giác bị cô lập và trầm cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "separately; alone",
                    "vi": "riêng biệt; một mình"
                },
                "examples": [
                    {
                        "en": "To make sense, these figures should not be looked at in isolation.",
                        "vi": "Để có lý, không nên nhìn những số liệu này một cách riêng lẻ."
                    },
                    {
                        "en": "Words are pronounced differently in isolation from how they are pronounced in context.",
                        "vi": "Các từ được phát âm khác biệt với cách chúng được phát âm trong ngữ cảnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "275c909bc544434d91bd18d8d09d8b56",
        "word": "loneliness",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈləʊnlinəs/",
            "us": "/ˈləʊnlinəs/"
        },
        "nearby": [
            {
                "word": "London Zoo",
                "pos": ""
            },
            {
                "word": "lone",
                "pos": "adjective"
            },
            {
                "word": "loneliness",
                "pos": "noun"
            },
            {
                "word": "lonely",
                "pos": "adjective"
            },
            {
                "word": "lonely heart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being unhappy because you have no friends or people to talk to",
                    "vi": "cảm giác không vui vì bạn không có bạn bè hoặc người để nói chuyện"
                },
                "examples": [
                    {
                        "en": "a period of loneliness in his life",
                        "vi": "khoảng thời gian cô đơn trong cuộc đời anh ấy"
                    },
                    {
                        "en": "feelings of loneliness and depression",
                        "vi": "cảm giác cô đơn và trầm cảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of a period of time being sad and spent alone",
                    "vi": "thực tế là một khoảng thời gian buồn bã và ở một mình"
                },
                "examples": [
                    {
                        "en": "the loneliness of all those evenings at home just watching TV",
                        "vi": "sự cô đơn của tất cả những buổi tối ở nhà chỉ xem TV"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that very few people ever visit a place",
                    "vi": "thực tế là rất ít người từng đến thăm một nơi"
                },
                "examples": [
                    {
                        "en": "the desolation and loneliness of the island",
                        "vi": "sự hoang vắng và cô đơn của hòn đảo"
                    }
                ]
            }
        ]
    },
    {
        "id": "c3245f987e4542819ae213d5135f9c37",
        "word": "solitary",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɒlətri/",
            "us": "/ˈsɑːləteri/"
        },
        "nearby": [
            {
                "word": "solitaire",
                "pos": "noun"
            },
            {
                "word": "solitariness",
                "pos": "noun"
            },
            {
                "word": "solitary",
                "pos": "adjective"
            },
            {
                "word": "solitary",
                "pos": "noun"
            },
            {
                "word": "solitary confinement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done alone; without other people",
                    "vi": "thực hiện một mình; không có người khác"
                },
                "examples": [
                    {
                        "en": "She enjoys long solitary walks.",
                        "vi": "Cô ấy thích đi bộ dài trong cô đơn."
                    },
                    {
                        "en": "He led a solitary life.",
                        "vi": "Ông sống một cuộc sống đơn độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "enjoying being alone; frequently spending time alone",
                    "vi": "thích ở một mình; thường xuyên dành thời gian ở một mình"
                },
                "examples": [
                    {
                        "en": "He was a solitary child.",
                        "vi": "Anh là một đứa trẻ đơn độc."
                    },
                    {
                        "en": "Tigers are solitary animals.",
                        "vi": "Hổ là loài động vật sống đơn độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "alone, with no other people or things around",
                    "vi": "một mình, không có người khác hoặc những thứ xung quanh"
                },
                "examples": [
                    {
                        "en": "a solitary farm",
                        "vi": "một trang trại đơn độc"
                    },
                    {
                        "en": "A solitary light burned dimly in the hall.",
                        "vi": "Một ngọn đèn lẻ loi cháy mờ trong đại sảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "only one",
                    "vi": "chỉ một"
                },
                "examples": [
                    {
                        "en": "There was not a solitary shred of evidence (= none at all).",
                        "vi": "Không có một mảnh bằng chứng đơn lẻ nào (= không có gì cả)."
                    }
                ]
            }
        ]
    },
    {
        "id": "0453b18918ac49a9b0c3db9fe82053ef",
        "word": "adrift",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈdrɪft/",
            "us": "/əˈdrɪft/"
        },
        "nearby": [
            {
                "word": "adrenaline",
                "pos": "noun"
            },
            {
                "word": "Adrian",
                "pos": ""
            },
            {
                "word": "adrift",
                "pos": "adjective"
            },
            {
                "word": "adroit",
                "pos": "adjective"
            },
            {
                "word": "adroitly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a boat or a person in a boat is adrift, the boat is not tied to anything or is floating without being controlled by anyone",
                    "vi": "nếu thuyền hoặc người trên thuyền bị trôi dạt, thuyền không bị ràng buộc vào bất cứ thứ gì hoặc đang trôi mà không bị ai điều khiển."
                },
                "examples": [
                    {
                        "en": "The survivors were adrift in a lifeboat for six days.",
                        "vi": "Những người sống sót đã trôi dạt trên một chiếc xuồng cứu sinh trong sáu ngày."
                    },
                    {
                        "en": "Their boat had been set adrift.",
                        "vi": "Thuyền của họ đã trôi dạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling alone and without a direction or an aim in life",
                    "vi": "cảm thấy đơn độc và không có phương hướng hay mục tiêu trong cuộc sống"
                },
                "examples": [
                    {
                        "en": "young people adrift in the big city",
                        "vi": "những người trẻ tuổi ở thành phố lớn"
                    },
                    {
                        "en": "Without language, human beings are cast adrift.",
                        "vi": "Không có ngôn ngữ, con người bị bỏ rơi."
                    },
                    {
                        "en": "She felt cast adrift in a vulgar, materialistic society.",
                        "vi": "Cô cảm thấy bị bỏ rơi trong một xã hội vật chất thô tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer attached or fixed in the right position",
                    "vi": "không còn được gắn hoặc cố định đúng vị trí"
                },
                "examples": [
                    {
                        "en": "I nearly suffocated when the pipe on my breathing apparatus came adrift.",
                        "vi": "Tôi gần như chết ngạt khi đường ống trên thiết bị thở của tôi bị trôi."
                    },
                    {
                        "en": "(figurative) She had been cut adrift from everything she had known.",
                        "vi": "(nghĩa bóng) Cô ấy đã bị cắt đứt khỏi mọi thứ mà cô ấy đã biết."
                    },
                    {
                        "en": "(figurative) Our plans had gone badly adrift.",
                        "vi": "(nghĩa bóng) Kế hoạch của chúng tôi đã trôi qua một cách tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "behind the score or position of your opponents",
                    "vi": "xếp sau điểm số hoặc vị trí của đối thủ của bạn"
                },
                "examples": [
                    {
                        "en": "The team are now just six points adrift of the leaders.",
                        "vi": "Hiện đội bóng này chỉ hơn đội dẫn đầu sáu điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "4775560f0ec140cbb639735d0ee5e8ca",
        "word": "bereft",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪˈreft/",
            "us": "/bɪˈreft/"
        },
        "nearby": [
            {
                "word": "bereaved",
                "pos": "adjective"
            },
            {
                "word": "bereavement",
                "pos": "noun"
            },
            {
                "word": "bereft",
                "pos": "adjective"
            },
            {
                "word": "beret",
                "pos": "noun"
            },
            {
                "word": "Beretta",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "completely without something; having lost something",
                    "vi": "hoàn toàn không có một cái gì đó; bị mất một cái gì đó"
                },
                "examples": [
                    {
                        "en": "bereft of ideas/hope",
                        "vi": "thiếu ý tưởng / hy vọng"
                    }
                ]
            },
            {
                "define": {
                    "en": "sad and lonely because you have lost something",
                    "vi": "buồn và cô đơn vì bạn đã mất một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was utterly bereft when his wife died.",
                        "vi": "Anh ấy đã hoàn toàn buồn bã khi vợ anh ấy qua đời."
                    },
                    {
                        "en": "The shock of his departure had left her feeling alone and bereft.",
                        "vi": "Cú sốc về sự ra đi của anh khiến cô cảm thấy đơn độc và lạc lõng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b751b6bcf46b4e26863a5c2632e76f14",
        "word": "break",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/breɪk/",
            "us": "/breɪk/"
        },
        "nearby": [
            {
                "word": "bread tree",
                "pos": "noun"
            },
            {
                "word": "breadwinner",
                "pos": "noun"
            },
            {
                "word": "break",
                "pos": "verb"
            },
            {
                "word": "break",
                "pos": "noun"
            },
            {
                "word": "breakable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be damaged and separated into two or more parts, as a result of force; to damage something in this way",
                    "vi": "bị hư hỏng và bị tách thành hai hoặc nhiều phần do tác động của lực; để làm hỏng một cái gì đó theo cách này"
                },
                "examples": [
                    {
                        "en": "All the windows broke with the force of the blast.",
                        "vi": "Tất cả các cửa sổ bị vỡ do vụ nổ."
                    },
                    {
                        "en": "The bag broke under the weight of the bottles inside it.",
                        "vi": "Chiếc túi bị vỡ dưới sức nặng của những chiếc chai bên trong nó."
                    },
                    {
                        "en": "break in/into something She dropped the plate and it broke into pieces.",
                        "vi": "break in / into something Cô ấy đánh rơi cái đĩa và nó vỡ thành nhiều mảnh."
                    },
                    {
                        "en": "The boat hit a rock and broke in half.",
                        "vi": "Chiếc thuyền va phải một tảng đá và gãy làm đôi."
                    },
                    {
                        "en": "break something to break a cup/window",
                        "vi": "làm vỡ cái gì đó để làm vỡ cốc / cửa sổ"
                    },
                    {
                        "en": "She fell off a ladder and broke her arm.",
                        "vi": "Cô ấy bị ngã khỏi một cái thang và bị gãy tay."
                    },
                    {
                        "en": "to break a leg/bone",
                        "vi": "gãy chân / xương"
                    },
                    {
                        "en": "break something in/into something He broke the chocolate in two.",
                        "vi": "break something in / into something Anh ấy đã bẻ đôi viên sô cô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop working as a result of being damaged; to damage something and stop it from working",
                    "vi": "ngừng hoạt động do bị hư hỏng; làm hỏng thứ gì đó và ngăn nó hoạt động"
                },
                "examples": [
                    {
                        "en": "My watch has broken.",
                        "vi": "Đồng hồ của tôi đã bị hỏng."
                    },
                    {
                        "en": "break something I think I've broken the washing machine.",
                        "vi": "làm hỏng một cái gì đó Tôi nghĩ rằng tôi đã làm hỏng máy giặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut the surface of the skin and make it bleed",
                    "vi": "cắt bề mặt da và làm cho nó chảy máu"
                },
                "examples": [
                    {
                        "en": "The dog bit me but didn't break the skin.",
                        "vi": "Con chó cắn tôi nhưng không làm rách da."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is against the law; to not keep a promise, etc.",
                    "vi": "làm điều gì đó trái với luật pháp; không giữ lời hứa, v.v."
                },
                "examples": [
                    {
                        "en": "I had broken the law and deserved to be punished.",
                        "vi": "Tôi đã phạm luật và đáng bị trừng phạt."
                    },
                    {
                        "en": "People should not be allowed to break the rules.",
                        "vi": "Mọi người không được phép phá vỡ các quy tắc."
                    },
                    {
                        "en": "to break a promise",
                        "vi": "thất hứa"
                    },
                    {
                        "en": "to break an agreement/a contract/your word",
                        "vi": "để phá vỡ một thỏa thuận / một hợp đồng / lời nói của bạn"
                    },
                    {
                        "en": "to break an appointment (= not to come to it)",
                        "vi": "để phá vỡ một cuộc hẹn (= không đến với nó)"
                    },
                    {
                        "en": "He was breaking the speed limit (= travelling faster than the law allows).",
                        "vi": "Anh ta đã vượt quá tốc độ cho phép (= đi nhanh hơn luật cho phép)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something for a while, especially when it is time to eat or have a drink",
                    "vi": "ngừng làm việc gì đó trong một thời gian, đặc biệt là khi đã đến giờ ăn hoặc uống"
                },
                "examples": [
                    {
                        "en": "break for something Let's break for lunch.",
                        "vi": "nghỉ ngơi cho một cái gì đó Hãy giải lao cho bữa trưa."
                    },
                    {
                        "en": "Parliament breaks for recess next week.",
                        "vi": "Quốc hội nghỉ giải lao vào tuần tới."
                    },
                    {
                        "en": "We broke early and went for a drink.",
                        "vi": "Chúng tôi tan vỡ sớm và đi uống nước."
                    },
                    {
                        "en": "break something Their sleep was broken by noise from the street.",
                        "vi": "phá vỡ một cái gì đó Giấc ngủ của họ bị phá vỡ bởi tiếng ồn từ đường phố."
                    },
                    {
                        "en": "(especially British English) We broke our journey in Oxford (= stopped in Oxford on the way to the place we were going to).",
                        "vi": "(đặc biệt là tiếng Anh Anh) Chúng tôi đã phá vỡ hành trình của chúng tôi ở Oxford (= dừng lại ở Oxford trên đường đến nơi chúng tôi sẽ đến)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to interrupt something so that it ends suddenly",
                    "vi": "để làm gián đoạn một cái gì đó để nó kết thúc đột ngột"
                },
                "examples": [
                    {
                        "en": "She broke the silence by coughing.",
                        "vi": "Cô ấy phá vỡ sự im lặng bằng cách ho."
                    },
                    {
                        "en": "A tree broke his fall (= stopped him as he was falling).",
                        "vi": "Một cái cây đã làm gãy ngã anh ta (= dừng anh ta lại khi anh ta đang ngã xuống)."
                    },
                    {
                        "en": "The phone rang and broke my train of thought.",
                        "vi": "Điện thoại reo và phá vỡ dòng suy nghĩ của tôi."
                    },
                    {
                        "en": "Someone laughed suddenly and the spell was broken.",
                        "vi": "Ai đó đột nhiên cười và câu thần chú đã bị phá vỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something end by using force or strong action",
                    "vi": "để làm cho điều gì đó kết thúc bằng cách sử dụng vũ lực hoặc hành động mạnh"
                },
                "examples": [
                    {
                        "en": "an attempt to break the year-long siege",
                        "vi": "một nỗ lực để phá vỡ vòng vây kéo dài một năm"
                    },
                    {
                        "en": "Management has not succeeded in breaking the strike.",
                        "vi": "Ban quản lý đã không thành công trong việc phá vỡ cuộc đình công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a connection with something or a relationship with somebody",
                    "vi": "để kết thúc một kết nối với một cái gì đó hoặc một mối quan hệ với ai đó"
                },
                "examples": [
                    {
                        "en": "He broke all ties with his parents.",
                        "vi": "Anh đoạn tuyệt mọi quan hệ với cha mẹ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to get away from or out of a position in which they have been caught",
                    "vi": "quản lý để thoát khỏi hoặc thoát khỏi vị trí mà họ đã bị bắt"
                },
                "examples": [
                    {
                        "en": "He finally managed to break free from his attacker.",
                        "vi": "Cuối cùng anh ta cũng thoát được khỏi kẻ tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy something or make somebody/something weaker; to become weak or be destroyed",
                    "vi": "để phá hủy một cái gì đó hoặc làm cho ai đó / cái gì đó yếu hơn; trở nên yếu ớt hoặc bị tiêu diệt"
                },
                "examples": [
                    {
                        "en": "to break somebody’s morale/resistance/resolve/spirit",
                        "vi": "để phá vỡ tinh thần / sự kháng cự / quyết tâm / tinh thần của ai đó"
                    },
                    {
                        "en": "The government was determined to break the power of the trade unions.",
                        "vi": "Chính phủ đã quyết tâm phá vỡ quyền lực của các tổ chức công đoàn."
                    },
                    {
                        "en": "The scandal broke him (= ruined his reputation and destroyed his confidence).",
                        "vi": "Vụ bê bối đã phá vỡ anh ta (= hủy hoại danh tiếng và phá hủy sự tự tin của anh ta)."
                    },
                    {
                        "en": "She broke under questioning (= was no longer able to bear it) and confessed to everything.",
                        "vi": "Cô ấy bị tra khảo (= không còn chịu đựng được nữa) và thú nhận mọi chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win a game in which it is your opponent's turn to serve (= hit the ball across the net first)",
                    "vi": "để thắng một trò chơi mà đến lượt đối thủ của bạn giao bóng (= đánh bóng qua lưới trước)"
                },
                "examples": [
                    {
                        "en": "Williams broke her opponent's serve five times.",
                        "vi": "Williams bẻ giao bóng của đối thủ năm lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel so sad, lonely, etc. that they cannot live a normal life",
                    "vi": "làm cho ai đó cảm thấy rất buồn, cô đơn, v.v. đến mức họ không thể sống một cuộc sống bình thường"
                },
                "examples": [
                    {
                        "en": "The death of his wife broke him completely.",
                        "vi": "Cái chết của người vợ khiến anh ấy hoàn toàn suy sụp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change suddenly, usually after a period when it has been fine",
                    "vi": "thay đổi đột ngột, thường là sau một khoảng thời gian khi nó đã ổn"
                },
                "examples": [
                    {
                        "en": "On the third day the weather broke and they had a violent storm.",
                        "vi": "Vào ngày thứ ba, thời tiết tan vỡ và họ có một cơn bão dữ dội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show an opening",
                    "vi": "để hiển thị một sự mở đầu"
                },
                "examples": [
                    {
                        "en": "The clouds broke and the sun came out.",
                        "vi": "Mây tan và mặt trời ló dạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come up through the surface of water in the sea, a pool, etc.",
                    "vi": "đi lên qua bề mặt nước ở biển, hồ bơi, v.v."
                },
                "examples": [
                    {
                        "en": "When his head broke the surface he took in deep gulps of air.",
                        "vi": "Khi đầu anh ta vỡ ra khỏi bề mặt, anh ta hít vào một hơi thật sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the day or dawn or a storm breaks, it begins",
                    "vi": "khi một ngày hoặc bình minh hoặc một cơn bão tan, nó bắt đầu"
                },
                "examples": [
                    {
                        "en": "Dawn was breaking when they finally left.",
                        "vi": "Bình minh đã tan vỡ khi cuối cùng họ rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a piece of news breaks, it becomes known",
                    "vi": "nếu một mẩu tin tức bị phá vỡ, nó sẽ được biết đến"
                },
                "examples": [
                    {
                        "en": "There was a public outcry when the scandal broke.",
                        "vi": "Đã có một làn sóng phản đối kịch liệt của công chúng khi vụ bê bối nổ ra."
                    },
                    {
                        "en": "breaking news (= news that is arriving about events that have just happened)",
                        "vi": "tin tức nóng hổi (= tin tức đến về các sự kiện vừa xảy ra)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the first to tell somebody some bad news",
                    "vi": "là người đầu tiên nói với ai đó một số tin xấu"
                },
                "examples": [
                    {
                        "en": "Who's going to break it to her?",
                        "vi": "Ai sẽ phá vỡ nó cho cô ấy?"
                    },
                    {
                        "en": "I'm sorry to be the one to break the news to you.",
                        "vi": "Tôi xin lỗi vì đã thông báo tin tức cho bạn."
                    },
                    {
                        "en": "Just break the news to her gently.",
                        "vi": "Chỉ cần thông báo tin tức cho cô ấy một cách nhẹ nhàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody’s voice breaks, it changes its tone because of emotion",
                    "vi": "nếu giọng nói của ai đó bị vỡ, nó sẽ thay đổi âm sắc vì cảm xúc"
                },
                "examples": [
                    {
                        "en": "Her voice broke as she told us the dreadful news.",
                        "vi": "Giọng cô ấy vỡ ra khi cô ấy kể cho chúng tôi nghe tin tức kinh hoàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a boy’s voice breaks, it becomes permanently deeper at about the age of 13 or 14",
                    "vi": "Khi giọng của một cậu bé bị vỡ, nó sẽ trở nên trầm hơn vĩnh viễn vào khoảng 13 hoặc 14 tuổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something better, faster, etc. than anyone has ever done it before",
                    "vi": "để làm điều gì đó tốt hơn, nhanh hơn, v.v. so với bất kỳ ai đã từng làm trước đây"
                },
                "examples": [
                    {
                        "en": "She had broken the world 100 metres record.",
                        "vi": "Cô đã phá kỷ lục 100 mét thế giới."
                    },
                    {
                        "en": "The movie broke all box-office records.",
                        "vi": "Bộ phim đã phá vỡ mọi kỷ lục phòng vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "when waves break, they fall and are dissolved into foam, usually near land",
                    "vi": "khi sóng vỡ, chúng rơi xuống và tan thành bọt, thường là gần đất liền"
                },
                "examples": [
                    {
                        "en": "the sound of waves breaking on the beach",
                        "vi": "trên bãi biển tiếng sóng vỗ"
                    },
                    {
                        "en": "The sea was breaking over the wrecked ship.",
                        "vi": "Biển đang vỡ òa vì con tàu bị đắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the meaning of something secret",
                    "vi": "để tìm ra ý nghĩa của một điều gì đó bí mật"
                },
                "examples": [
                    {
                        "en": "to break a code",
                        "vi": "phá mã"
                    }
                ]
            },
            {
                "define": {
                    "en": "to change a banknote for coins",
                    "vi": "đổi tiền giấy thành tiền xu"
                },
                "examples": [
                    {
                        "en": "Can you break a twenty-dollar bill?",
                        "vi": "Bạn có thể bẻ một tờ 20 đô la không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "64be10fae1ca464ba8e2c6b7d30697b4",
        "word": "desolation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdesəˈleɪʃn/",
            "us": "/ˌdesəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "desolate",
                "pos": "adjective"
            },
            {
                "word": "desolate",
                "pos": "verb"
            },
            {
                "word": "desolation",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of being very lonely and unhappy",
                    "vi": "cảm giác rất cô đơn và không hạnh phúc"
                },
                "examples": [
                    {
                        "en": "Her death left him with a terrible sense of desolation.",
                        "vi": "Cái chết của cô để lại cho anh một cảm giác hoang tàn khủng khiếp."
                    },
                    {
                        "en": "She was racked by a feeling of utter desolation.",
                        "vi": "Cô ấy đã bị phá hủy bởi một cảm giác hoàn toàn hoang vắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of a place that is badly damaged or destroyed and offers no joy or hope to people",
                    "vi": "tình trạng của một nơi bị hư hại nặng hoặc bị phá hủy và không mang lại niềm vui hay hy vọng cho mọi người"
                },
                "examples": [
                    {
                        "en": "a scene of utter desolation",
                        "vi": "một cảnh hoàn toàn hoang tàn"
                    }
                ]
            }
        ]
    },
    {
        "id": "68e26337a62946bca848d887c21cdd00",
        "word": "forlorn",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/fəˈlɔːn/",
            "us": "/fərˈlɔːrn/"
        },
        "nearby": [
            {
                "word": "forklift truck",
                "pos": "noun"
            },
            {
                "word": "fork out",
                "pos": "phrasal verb"
            },
            {
                "word": "forlorn",
                "pos": "adjective"
            },
            {
                "word": "forlornly",
                "pos": "adverb"
            },
            {
                "word": "form",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "appearing lonely and unhappy",
                    "vi": "xuất hiện cô đơn và không hạnh phúc"
                },
                "examples": [
                    {
                        "en": "She looked so forlorn, standing there in the rain.",
                        "vi": "Trông cô ấy thật mệt mỏi, đứng đó trong mưa."
                    },
                    {
                        "en": "A couple of forlorn tourists waited for their coach.",
                        "vi": "Một vài khách du lịch đã chờ đợi huấn luyện viên của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not cared for and with no people in it",
                    "vi": "không được chăm sóc và không có người trong đó"
                },
                "examples": [
                    {
                        "en": "Empty houses quickly take on a forlorn look.",
                        "vi": "Những ngôi nhà trống trải nhanh chóng mang một diện mạo hoang tàn."
                    },
                    {
                        "en": "The cottage stood forlorn and empty.",
                        "vi": "Ngôi nhà tranh sừng sững và trống trải."
                    }
                ]
            },
            {
                "define": {
                    "en": "unlikely to succeed, come true, etc.",
                    "vi": "không chắc thành công, thành hiện thực, v.v."
                },
                "examples": [
                    {
                        "en": "She waited in the forlorn hope that he would one day come back to her.",
                        "vi": "Cô đã chờ đợi trong hy vọng mòn mỏi rằng một ngày nào đó anh sẽ quay lại với cô."
                    },
                    {
                        "en": "His father smiled weakly in a forlorn attempt to reassure him that everything was all right.",
                        "vi": "Cha anh mỉm cười yếu ớt trong một nỗ lực tàn nhẫn để trấn an anh rằng mọi thứ đều ổn."
                    }
                ]
            }
        ]
    },
    {
        "id": "669e41541ec44ad6997ecbd0734b3345",
        "word": "loner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈləʊnə(r)/",
            "us": "/ˈləʊnər/"
        },
        "nearby": [
            {
                "word": "lone parent",
                "pos": "noun"
            },
            {
                "word": "lone-parent family",
                "pos": "noun"
            },
            {
                "word": "loner",
                "pos": "noun"
            },
            {
                "word": "the Lone Ranger",
                "pos": ""
            },
            {
                "word": "lonesome",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is often alone or who prefers to be alone, rather than with other people",
                    "vi": "một người thường ở một mình hoặc thích ở một mình hơn là với những người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b553ede11d764c12aec089419910269c",
        "word": "lonesome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈləʊnsəm/",
            "us": "/ˈləʊnsəm/"
        },
        "nearby": [
            {
                "word": "loner",
                "pos": "noun"
            },
            {
                "word": "the Lone Ranger",
                "pos": ""
            },
            {
                "word": "lonesome",
                "pos": "adjective"
            },
            {
                "word": "lonesome",
                "pos": "noun"
            },
            {
                "word": "long-term",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy because you are alone and do not want to be or because you have no friends",
                    "vi": "không hạnh phúc vì bạn ở một mình và không muốn trở thành hoặc vì bạn không có bạn bè"
                },
                "examples": [
                    {
                        "en": "I felt so lonesome after he left.",
                        "vi": "Tôi cảm thấy thật cô đơn sau khi anh ấy rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "where not many people go; a long way from where people live",
                    "vi": "nơi không có nhiều người đi; một chặng đường dài từ nơi mọi người sống"
                },
                "examples": [
                    {
                        "en": "a lonesome road",
                        "vi": "một con đường đơn độc"
                    }
                ]
            }
        ]
    },
    {
        "id": "e972c84458c9404ea4b147f3a36056da",
        "word": "recluse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈkluːs/",
            "us": "/ˈrekluːs/"
        },
        "nearby": [
            {
                "word": "recline",
                "pos": "verb"
            },
            {
                "word": "recliner",
                "pos": "noun"
            },
            {
                "word": "recluse",
                "pos": "noun"
            },
            {
                "word": "reclusive",
                "pos": "adjective"
            },
            {
                "word": "recognition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who lives alone and likes to avoid other people",
                    "vi": "một người sống một mình và thích tránh người khác"
                },
                "examples": [
                    {
                        "en": "to lead the life of a recluse",
                        "vi": "sống ẩn dật"
                    }
                ]
            }
        ]
    },
    {
        "id": "10b8c19087ea488e8a96146bc4608d4f",
        "word": "reclusive",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈkluːsɪv/",
            "us": "/rɪˈkluːsɪv/"
        },
        "nearby": [
            {
                "word": "recliner",
                "pos": "noun"
            },
            {
                "word": "recluse",
                "pos": "noun"
            },
            {
                "word": "reclusive",
                "pos": "adjective"
            },
            {
                "word": "recognition",
                "pos": "noun"
            },
            {
                "word": "recognizable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living alone and avoiding other people",
                    "vi": "sống một mình và tránh những người khác"
                },
                "examples": [
                    {
                        "en": "a reclusive millionaire",
                        "vi": "một triệu phú ẩn dật"
                    }
                ]
            }
        ]
    },
    {
        "id": "d0e244d751924d0f82f60df213f1f8fb",
        "word": "solitude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒlətjuːd/",
            "us": "/ˈsɑːlətuːd/"
        },
        "nearby": [
            {
                "word": "solitary",
                "pos": "noun"
            },
            {
                "word": "solitary confinement",
                "pos": "noun"
            },
            {
                "word": "solitude",
                "pos": "noun"
            },
            {
                "word": "solo",
                "pos": "adverb"
            },
            {
                "word": "solo",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being alone, especially when you find this pleasant",
                    "vi": "trạng thái ở một mình, đặc biệt là khi bạn thấy điều này thật dễ chịu"
                },
                "examples": [
                    {
                        "en": "She longed for peace and solitude.",
                        "vi": "Cô khao khát bình yên và cô độc."
                    },
                    {
                        "en": "I returned to the solitude of my room.",
                        "vi": "Tôi trở lại sự vắng vẻ của căn phòng của mình."
                    },
                    {
                        "en": "He shut himself away to pray in solitude.",
                        "vi": "Anh ta tự đóng cửa để cầu nguyện trong cô độc."
                    }
                ]
            }
        ]
    }
]