[
    {
        "id": "d8b8a89fbe334589b2d880b954f9616a",
        "word": "meeting",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmiːtɪŋ/",
            "us": "/ˈmiːtɪŋ/"
        },
        "nearby": [
            {
                "word": "meet and greet",
                "pos": "noun"
            },
            {
                "word": "meet-and-greet",
                "pos": "adjective"
            },
            {
                "word": "meeting",
                "pos": "noun"
            },
            {
                "word": "meeting house",
                "pos": "noun"
            },
            {
                "word": "meeting place",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people come together to discuss or decide something",
                    "vi": "một dịp khi mọi người cùng nhau thảo luận hoặc quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "A hundred people attended the public meeting.",
                        "vi": "Một trăm người đã tham dự cuộc họp công khai."
                    },
                    {
                        "en": "The meeting will be held in the school hall.",
                        "vi": "Cuộc họp sẽ được tổ chức tại hội trường của trường."
                    },
                    {
                        "en": "to schedule/convene/arrange/organize/call a meeting",
                        "vi": "lên lịch / triệu tập / sắp xếp / tổ chức / gọi một cuộc họp"
                    },
                    {
                        "en": "Helen will chair the meeting (= be in charge of it).",
                        "vi": "Helen sẽ chủ trì cuộc họp (= phụ trách cuộc họp)."
                    },
                    {
                        "en": "The meeting was postponed.",
                        "vi": "Cuộc họp đã bị hoãn lại."
                    },
                    {
                        "en": "an annual meeting",
                        "vi": "một cuộc họp thường niên"
                    },
                    {
                        "en": "a board/council/committee/public meeting",
                        "vi": "một hội đồng quản trị / hội đồng / ủy ban / cuộc họp công cộng"
                    },
                    {
                        "en": "a series of meetings",
                        "vi": "một loạt các cuộc họp"
                    },
                    {
                        "en": "What time is the meeting?",
                        "vi": "Cuộc họp diễn ra lúc mấy giờ?"
                    },
                    {
                        "en": "Three speakers addressed the meeting.",
                        "vi": "Ba diễn giả phát biểu tại cuộc họp."
                    },
                    {
                        "en": "in a meeting I'll be in a meeting all morning—can you take my calls?",
                        "vi": "trong một cuộc họp Tôi sẽ họp cả buổi sáng — bạn có thể nhận cuộc gọi của tôi không?"
                    },
                    {
                        "en": "at a meeting The issue will be discussed at the next board meeting.",
                        "vi": "tại cuộc họp Vấn đề sẽ được thảo luận trong cuộc họp hội đồng quản trị tiếp theo."
                    },
                    {
                        "en": "meeting of somebody/something a meeting of the United Nations Security Council",
                        "vi": "cuộc họp của ai đó / cái gì đó một cuộc họp của Hội đồng Bảo an Liên hợp quốc"
                    },
                    {
                        "en": "meeting with somebody She is due to have a meeting with senior government officials.",
                        "vi": "meeting with somebody Cô ấy sẽ có một cuộc họp với các quan chức cấp cao của chính phủ."
                    },
                    {
                        "en": "meeting about something A public meeting about the proposal takes place on Monday.",
                        "vi": "cuộc họp về điều gì đó Một cuộc họp công khai về đề xuất diễn ra vào thứ Hai."
                    },
                    {
                        "en": "meeting between A and B This will be the first meeting between the two leaders since they took office.",
                        "vi": "Cuộc gặp giữa A và B Đây sẽ là cuộc gặp đầu tiên giữa hai nhà lãnh đạo kể từ khi họ nhậm chức."
                    },
                    {
                        "en": "Facilities include nine meeting rooms.",
                        "vi": "Cơ sở vật chất bao gồm chín phòng họp."
                    },
                    {
                        "en": "They rely on videoconferencing for virtual meetings.",
                        "vi": "Họ dựa vào hội nghị truyền hình cho các cuộc họp ảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people at a meeting",
                    "vi": "những người trong một cuộc họp"
                },
                "examples": [
                    {
                        "en": "The meeting will discuss how to resolve the ongoing crisis in this region.",
                        "vi": "Cuộc họp sẽ thảo luận về cách giải quyết cuộc khủng hoảng đang diễn ra ở khu vực này."
                    },
                    {
                        "en": "The meeting voted to accept the pay offer.",
                        "vi": "Cuộc họp đã biểu quyết chấp nhận đề nghị trả lương."
                    },
                    {
                        "en": "Mr Wade told the meeting that a one-way system would make the town safer.",
                        "vi": "Ông Wade nói với cuộc họp rằng hệ thống một chiều sẽ giúp thị trấn an toàn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which two or more people meet together, because they have arranged it or by chance",
                    "vi": "một tình huống mà hai hoặc nhiều người gặp nhau, do họ đã sắp xếp hoặc do tình cờ"
                },
                "examples": [
                    {
                        "en": "at a meeting At our first meeting I was nervous.",
                        "vi": "tại một cuộc họp Tại cuộc họp đầu tiên của chúng tôi, tôi đã rất lo lắng."
                    },
                    {
                        "en": "It was a chance meeting that would change my life.",
                        "vi": "Đó là một cuộc gặp gỡ tình cờ sẽ thay đổi cuộc đời tôi."
                    },
                    {
                        "en": "He remembered their childhood meetings with nostalgia.",
                        "vi": "Anh nhớ về những cuộc gặp gỡ thuở nhỏ của họ với nỗi nhớ."
                    },
                    {
                        "en": "meeting of/between A and B The meeting of father and son after so long was a joyous occasion.",
                        "vi": "cuộc gặp gỡ của / giữa A và B Cuộc gặp gỡ của hai cha con sau bao lâu là một dịp vui."
                    },
                    {
                        "en": "meeting with somebody This was only my second meeting with him.",
                        "vi": "cuộc gặp với ai đó Đây chỉ là cuộc gặp thứ hai của tôi với anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sports event or set of races, especially for horses",
                    "vi": "một sự kiện thể thao hoặc tập hợp các cuộc đua, đặc biệt là dành cho ngựa"
                },
                "examples": [
                    {
                        "en": "an athletics meeting",
                        "vi": "một cuộc họp điền kinh"
                    },
                    {
                        "en": "a race meeting",
                        "vi": "một cuộc họp cuộc đua"
                    },
                    {
                        "en": "The horse has won at all of his previous meetings this season.",
                        "vi": "Chú ngựa ô đã thắng trong tất cả các lần gặp nhau trước đây của anh ấy trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when people, especially Quakers, come together for worship",
                    "vi": "một dịp mà mọi người, đặc biệt là Quakers, đến với nhau để thờ phượng"
                },
                "examples": [
                    {
                        "en": "Quaker meetings are held here every week.",
                        "vi": "Các cuộc họp Quaker được tổ chức ở đây hàng tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a close understanding between people with similar ideas, especially when they meet to do something or meet for the first time",
                    "vi": "sự hiểu biết chặt chẽ giữa những người có cùng ý tưởng, đặc biệt là khi họ gặp nhau để làm việc gì đó hoặc gặp nhau lần đầu tiên"
                },
                "examples": [
                    {
                        "en": "a meeting of minds between the two artists",
                        "vi": "cuộc gặp gỡ tâm đầu ý hợp giữa hai nghệ sĩ"
                    }
                ]
            }
        ]
    },
    {
        "id": "9250769fa2cd49e6ac596d0f0578d207",
        "word": "accept",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/əkˈsept/",
            "us": "/əkˈsept/"
        },
        "nearby": [
            {
                "word": "accentuate",
                "pos": "verb"
            },
            {
                "word": "accentuation",
                "pos": "noun"
            },
            {
                "word": "accept",
                "pos": "verb"
            },
            {
                "word": "acceptability",
                "pos": "noun"
            },
            {
                "word": "acceptable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take willingly something that is offered; to say ‘yes’ to an offer, invitation, etc.",
                    "vi": "sẵn sàng nhận một cái gì đó được cung cấp; để nói 'có' với một đề nghị, lời mời, v.v."
                },
                "examples": [
                    {
                        "en": "He asked me to marry him and I accepted.",
                        "vi": "Anh ấy ngỏ lời cưới tôi và tôi đã nhận lời."
                    },
                    {
                        "en": "accept something Please accept our sincere apologies.",
                        "vi": "chấp nhận điều gì Xin hãy chấp nhận lời xin lỗi chân thành của chúng tôi."
                    },
                    {
                        "en": "It was pouring with rain so I accepted his offer of a lift.",
                        "vi": "Trời đổ mưa nên tôi chấp nhận lời đề nghị đi thang máy của anh ấy."
                    },
                    {
                        "en": "I am unfortunately unable to accept your kind invitation.",
                        "vi": "Tôi rất tiếc không thể chấp nhận lời mời tử tế của bạn."
                    },
                    {
                        "en": "The board of directors accepted our proposal.",
                        "vi": "Ban giám đốc đã chấp nhận đề nghị của chúng tôi."
                    },
                    {
                        "en": "She's decided not to accept the job.",
                        "vi": "Cô ấy đã quyết định không nhận công việc."
                    },
                    {
                        "en": "Please accept this small token of my appreciation.",
                        "vi": "Xin vui lòng chấp nhận dấu hiệu nhỏ này của sự đánh giá cao của tôi."
                    },
                    {
                        "en": "accept something from somebody He is charged with accepting bribes from a firm of suppliers.",
                        "vi": "nhận một cái gì đó từ ai đó Anh ta bị buộc tội nhận hối lộ từ một công ty cung cấp."
                    },
                    {
                        "en": "accept something for something She said she'd accept $15 for it.",
                        "vi": "chấp nhận một cái gì đó cho một cái gì đó Cô ấy nói rằng cô ấy sẽ chấp nhận $ 15 cho nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to or approve of something",
                    "vi": "đồng ý hoặc chấp thuận một cái gì đó"
                },
                "examples": [
                    {
                        "en": "accept something They accepted the court's decision.",
                        "vi": "chấp nhận một cái gì đó Họ đã chấp nhận quyết định của tòa án."
                    },
                    {
                        "en": "The judge refused to accept his evidence.",
                        "vi": "Thẩm phán từ chối chấp nhận bằng chứng của anh ta."
                    },
                    {
                        "en": "He accepted all the changes we proposed.",
                        "vi": "Anh ấy đã chấp nhận tất cả những thay đổi mà chúng tôi đề xuất."
                    },
                    {
                        "en": "Are you willing to accept the challenge?",
                        "vi": "Bạn có sẵn sàng chấp nhận thử thách không?"
                    },
                    {
                        "en": "accept something from somebody She won't accept advice from anyone.",
                        "vi": "chấp nhận điều gì đó từ ai đó Cô ấy sẽ không chấp nhận lời khuyên từ bất kỳ ai."
                    },
                    {
                        "en": "accept something for something My article has been accepted for publication.",
                        "vi": "chấp nhận một cái gì đó cho một cái gì đó Bài báo của tôi đã được chấp nhận để xuất bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take payment in a particular form",
                    "vi": "nhận thanh toán bằng một hình thức cụ thể"
                },
                "examples": [
                    {
                        "en": "This machine only accepts coins.",
                        "vi": "Máy này chỉ chấp nhận tiền xu."
                    },
                    {
                        "en": "Credit cards are widely accepted.",
                        "vi": "Thẻ tín dụng được chấp nhận rộng rãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to admit that you are responsible or to blame for something",
                    "vi": "thừa nhận rằng bạn có trách nhiệm hoặc để đổ lỗi cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He accepts full responsibility for what happened.",
                        "vi": "Anh ấy xin nhận hoàn toàn trách nhiệm về những gì đã xảy ra."
                    },
                    {
                        "en": "You have to accept the consequences of your actions.",
                        "vi": "Bạn phải chấp nhận hậu quả của hành động của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue in a difficult situation without complaining, because you realize that you cannot change it",
                    "vi": "tiếp tục trong một tình huống khó khăn mà không phàn nàn, bởi vì bạn nhận ra rằng bạn không thể thay đổi nó"
                },
                "examples": [
                    {
                        "en": "accept something You just have to accept the fact that we're never going to be rich.",
                        "vi": "chấp nhận một điều gì đó Bạn chỉ cần chấp nhận sự thật rằng chúng ta sẽ không bao giờ giàu có."
                    },
                    {
                        "en": "to be willing/prepared to accept something",
                        "vi": "sẵn sàng / chuẩn bị để chấp nhận điều gì đó"
                    },
                    {
                        "en": "Nothing will change as long as the workers continue to accept these appalling conditions.",
                        "vi": "Sẽ không có gì thay đổi chừng nào người lao động tiếp tục chấp nhận những điều kiện kinh khủng này."
                    },
                    {
                        "en": "accept something as something They accept the risks as part of the job.",
                        "vi": "chấp nhận một cái gì đó như một cái gì đó Họ chấp nhận rủi ro như một phần của công việc."
                    },
                    {
                        "en": "accept that… He just refused to accept that his father was no longer there.",
                        "vi": "chấp nhận điều đó… Anh ấy chỉ từ chối chấp nhận rằng cha anh ấy không còn ở đó nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel welcome and part of a group",
                    "vi": "để làm cho ai đó cảm thấy được chào đón và là một phần của nhóm"
                },
                "examples": [
                    {
                        "en": "accept somebody It may take years to be completely accepted by the local community.",
                        "vi": "chấp nhận ai đó Có thể mất nhiều năm để được cộng đồng địa phương chấp nhận hoàn toàn."
                    },
                    {
                        "en": "accept somebody into something She had never been accepted into what was essentially a man's world.",
                        "vi": "chấp nhận ai đó vào một điều gì đó Cô ấy chưa bao giờ được chấp nhận vào thế giới thực chất là của một người đàn ông."
                    },
                    {
                        "en": "accept somebody as something He never really accepted her as his own child.",
                        "vi": "chấp nhận ai đó như một cái gì đó Anh ấy không bao giờ thực sự chấp nhận cô ấy là con của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to believe that something is true",
                    "vi": "tin rằng điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "accept something I don't accept his version of events.",
                        "vi": "chấp nhận một cái gì đó Tôi không chấp nhận phiên bản của các sự kiện của mình."
                    },
                    {
                        "en": "accept something as something Can we accept his account as the true version?",
                        "vi": "chấp nhận một cái gì đó như một cái gì đó Chúng ta có thể chấp nhận tài khoản của anh ấy là phiên bản thật không?"
                    },
                    {
                        "en": "accept that… I accept that this will not be popular.",
                        "vi": "chấp nhận điều đó… Tôi chấp nhận rằng điều này sẽ không phổ biến."
                    },
                    {
                        "en": "I am not prepared to accept that this decision is final.",
                        "vi": "Tôi không chuẩn bị để chấp nhận rằng quyết định này là cuối cùng."
                    },
                    {
                        "en": "it is accepted that… It is generally accepted that people are motivated by success.",
                        "vi": "nó được chấp nhận rằng… Người ta thường chấp nhận rằng mọi người được thúc đẩy bởi thành công."
                    },
                    {
                        "en": "something is accepted to be, have, etc. something Their workforce is widely accepted to have the best conditions in Europe.",
                        "vi": "điều gì đó được chấp nhận là có, có, v.v. Lực lượng lao động của họ được chấp nhận rộng rãi để có những điều kiện tốt nhất ở Châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to join an organization, attend an institution, use a service, etc.",
                    "vi": "để cho phép ai đó tham gia một tổ chức, tham dự một tổ chức, sử dụng một dịch vụ, v.v."
                },
                "examples": [
                    {
                        "en": "accept somebody The college he applied to has accepted him.",
                        "vi": "chấp nhận ai đó Trường đại học mà anh ấy đăng ký đã chấp nhận anh ấy."
                    },
                    {
                        "en": "accept somebody into something She was disappointed not to be accepted into the club.",
                        "vi": "chấp nhận ai đó vào một cái gì đó Cô ấy thất vọng khi không được chấp nhận vào câu lạc bộ."
                    },
                    {
                        "en": "accept somebody as something The landlord was willing to accept us as tenants.",
                        "vi": "chấp nhận ai đó như một cái gì đó Chủ nhà sẵn sàng nhận chúng tôi là người thuê nhà."
                    },
                    {
                        "en": "accept somebody to do something She was accepted to study music.",
                        "vi": "chấp nhận ai đó làm điều gì đó Cô ấy đã được nhận vào học âm nhạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8df443db72d4658a80efb1513a10ba2",
        "word": "offer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɒfə(r)/",
            "us": "/ˈɔːfər/"
        },
        "nearby": [
            {
                "word": "offensiveness",
                "pos": "noun"
            },
            {
                "word": "offer",
                "pos": "verb"
            },
            {
                "word": "offer",
                "pos": "noun"
            },
            {
                "word": "offering",
                "pos": "noun"
            },
            {
                "word": "offertory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of saying that you are willing to do something for somebody or give something to somebody",
                    "vi": "một hành động nói rằng bạn sẵn sàng làm điều gì đó cho ai đó hoặc đưa một cái gì đó cho ai đó"
                },
                "examples": [
                    {
                        "en": "to receive a job offer",
                        "vi": "để nhận được một lời mời làm việc"
                    },
                    {
                        "en": "to accept/reject/decline an offer",
                        "vi": "chấp nhận / từ chối / từ chối một đề nghị"
                    },
                    {
                        "en": "offer of something Thank you for your kind offer of help.",
                        "vi": "đề nghị của một cái gì đó Cảm ơn bạn đã đề nghị giúp đỡ của bạn."
                    },
                    {
                        "en": "I took him up on his offer of a loan.",
                        "vi": "Tôi đã cho anh ta vay tiền."
                    },
                    {
                        "en": "You can't just turn down offers of work like that.",
                        "vi": "Bạn không thể từ chối những lời mời làm việc như vậy."
                    },
                    {
                        "en": "an offer of marriage",
                        "vi": "một lời đề nghị kết hôn"
                    },
                    {
                        "en": "offer to do something I accepted her offer to pay.",
                        "vi": "đề nghị làm điều gì đó Tôi đã chấp nhận lời đề nghị trả tiền của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money that somebody is willing to pay for something",
                    "vi": "một số tiền mà ai đó sẵn sàng trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "offer for something I've had an offer of $2 500 for the car.",
                        "vi": "đề nghị cho một cái gì đó Tôi đã có một đề nghị $ 2 500 cho chiếc xe."
                    },
                    {
                        "en": "The museum received an offer for the painting of $19 million.",
                        "vi": "Bảo tàng đã nhận được một lời đề nghị cho bức tranh là 19 triệu đô la."
                    },
                    {
                        "en": "They've decided to accept our original offer.",
                        "vi": "Họ đã quyết định chấp nhận đề nghị ban đầu của chúng tôi."
                    },
                    {
                        "en": "The offer has been withdrawn.",
                        "vi": "Đề nghị đã được rút lại."
                    },
                    {
                        "en": "offer (that)… They made me an offer I couldn't refuse.",
                        "vi": "đề nghị (đó)… Họ đã đưa cho tôi một đề nghị mà tôi không thể từ chối."
                    },
                    {
                        "en": "The original price was £3 000, but I'm open to offers (= willing to consider offers that are less than that).",
                        "vi": "Giá ban đầu là £ 3 000, nhưng tôi sẵn sàng nhận các đề nghị (= sẵn sàng xem xét các đề nghị thấp hơn thế)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a reduction in the normal price of something, usually for a short period of time",
                    "vi": "giảm giá bình thường của một thứ gì đó, thường là trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "This special offer is valid until the end of the month.",
                        "vi": "Ưu đãi đặc biệt này có giá trị đến cuối tháng."
                    },
                    {
                        "en": "See next week's issue for details of more free offers.",
                        "vi": "Xem số báo tuần tới để biết thêm chi tiết về các ưu đãi miễn phí."
                    },
                    {
                        "en": "offer on something They have an offer on new phones at the moment.",
                        "vi": "cung cấp về một cái gì đó Họ có một ưu đãi trên điện thoại mới vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "that can be bought, used, etc.",
                    "vi": "có thể được mua, sử dụng, v.v."
                },
                "examples": [
                    {
                        "en": "The following is a list of courses currently on offer.",
                        "vi": "Sau đây là danh sách các khóa học hiện đang được cung cấp."
                    },
                    {
                        "en": "Prizes worth more than £20 000 are on offer.",
                        "vi": "Các giải thưởng trị giá hơn 20.000 bảng Anh đang được cung cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "on sale at a lower price than normal for a short period of time",
                    "vi": "bán với giá thấp hơn bình thường trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Italian wines are on (special) offer this week.",
                        "vi": "Rượu vang Ý đang được ưu đãi (đặc biệt) trong tuần này."
                    },
                    {
                        "en": "We have a number of bargains on offer.",
                        "vi": "Chúng tôi có một số giá rẻ được cung cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a house or other building is under offer, somebody has agreed to buy it at a particular price",
                    "vi": "nếu một ngôi nhà hoặc tòa nhà khác đang được chào bán, ai đó đã đồng ý mua nó với một mức giá cụ thể"
                },
                "examples": [
                    {
                        "en": "The property is currently under offer to a client.",
                        "vi": "Tài sản hiện đang được cung cấp cho một khách hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b2a9fbb9b2f46c2b705694c0f21b8a8",
        "word": "agreement",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈɡriːmənt/",
            "us": "/əˈɡriːmənt/"
        },
        "nearby": [
            {
                "word": "agreeably",
                "pos": "adverb"
            },
            {
                "word": "agreed",
                "pos": "adjective"
            },
            {
                "word": "agreement",
                "pos": "noun"
            },
            {
                "word": "agri-",
                "pos": "combining form"
            },
            {
                "word": "agribusiness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement, a promise or a contract made with somebody",
                    "vi": "một sự sắp xếp, một lời hứa hoặc một hợp đồng được thực hiện với ai đó"
                },
                "examples": [
                    {
                        "en": "an international peace agreement",
                        "vi": "một hiệp định hòa bình quốc tế"
                    },
                    {
                        "en": "The agreement (= the document recording the agreement) was signed during a meeting at the UN.",
                        "vi": "Thỏa thuận (= tài liệu ghi lại thỏa thuận) được ký kết trong một cuộc họp tại LHQ."
                    },
                    {
                        "en": "agreement with somebody They have entered into a free trade agreement with Australia.",
                        "vi": "thỏa thuận với ai đó Họ đã tham gia một hiệp định thương mại tự do với Úc."
                    },
                    {
                        "en": "agreement between A and B An agreement was finally reached between management and employees.",
                        "vi": "thỏa thuận giữa A và B Cuối cùng đã đạt được thỏa thuận giữa quản lý và nhân viên."
                    },
                    {
                        "en": "agreement to do something They had an agreement never to talk about work at home.",
                        "vi": "thỏa thuận để làm điều gì đó Họ đã có một thỏa thuận không bao giờ nói về công việc ở nhà."
                    },
                    {
                        "en": "They had made a verbal agreement to sell.",
                        "vi": "Họ đã có một thỏa thuận miệng để bán."
                    },
                    {
                        "en": "under an agreement The software is provided under a license agreement and may not be copied without permission.",
                        "vi": "theo thỏa thuận Phần mềm được cung cấp theo thỏa thuận cấp phép và không được sao chép nếu không được phép."
                    },
                    {
                        "en": "The specific terms of the agreement have not been disclosed.",
                        "vi": "Các điều khoản cụ thể của thỏa thuận vẫn chưa được tiết lộ."
                    },
                    {
                        "en": "The documents are covered by a confidentiality agreement.",
                        "vi": "Các tài liệu được bảo mật bởi một thỏa thuận bảo mật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of sharing the same opinion or feeling",
                    "vi": "trạng thái chia sẻ cùng quan điểm hoặc cảm xúc"
                },
                "examples": [
                    {
                        "en": "The two sides failed to reach agreement.",
                        "vi": "Hai bên không đạt được thỏa thuận."
                    },
                    {
                        "en": "agreement on something There was broad agreement on what was needed.",
                        "vi": "thỏa thuận về một cái gì đó Có một thỏa thuận rộng rãi về những gì cần thiết."
                    },
                    {
                        "en": "agreement (among somebody) (that…) There is agreement among teachers that changes need to be made.",
                        "vi": "thỏa thuận (giữa một số người) (điều đó…) Có sự nhất trí giữa các giáo viên rằng cần phải thực hiện những thay đổi."
                    },
                    {
                        "en": "in agreement Is everybody in agreement now?",
                        "vi": "đồng ý Bây giờ có ai đồng ý không?"
                    },
                    {
                        "en": "in agreement on/about something Are we in agreement about the price?",
                        "vi": "trong thỏa thuận về / về một cái gì đó Chúng ta có đồng ý về giá cả không?"
                    },
                    {
                        "en": "in agreement with somebody on/about something My wife is in complete agreement with me on this issue.",
                        "vi": "đồng ý với ai đó về / về điều gì đó Vợ tôi hoàn toàn đồng ý với tôi về vấn đề này."
                    },
                    {
                        "en": "in agreement with somebody (that…) I am in agreement with you that she should be given more responsibilities.",
                        "vi": "đồng ý với ai đó (rằng…) Tôi đồng ý với bạn rằng cô ấy nên được giao nhiều trách nhiệm hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of somebody approving of something and allowing it to happen",
                    "vi": "thực tế là ai đó chấp thuận điều gì đó và cho phép nó xảy ra"
                },
                "examples": [
                    {
                        "en": "You'll have to get your parents' agreement if you want to go on the trip.",
                        "vi": "Bạn sẽ phải nhận được sự đồng ý của bố mẹ nếu bạn muốn tham gia chuyến đi."
                    },
                    {
                        "en": "with the agreement of somebody Most pension schemes allow employees to keep working with the agreement of their employer.",
                        "vi": "với sự đồng ý của ai đó Hầu hết các chương trình lương hưu đều cho phép nhân viên tiếp tục làm việc với sự đồng ý của người sử dụng lao động của họ."
                    },
                    {
                        "en": "without the agreement of somebody No images may be reproduced without the artist's agreement.",
                        "vi": "không có sự đồng ý của ai đó Không được sao chép hình ảnh mà không có sự đồng ý của nghệ sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of having the same number, gender or person",
                    "vi": "trạng thái có cùng số lượng, giới tính hoặc người"
                },
                "examples": [
                    {
                        "en": "in agreement with something In the sentence ‘They live in the country’, the plural form of the verb ‘live’ is in agreement with the plural subject ‘they’.",
                        "vi": "đồng ý với điều gì Trong câu 'Họ sống ở đất nước', dạng số nhiều của động từ 'sống' đồng ý với chủ ngữ số nhiều 'họ'."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b2c8c4bf9c44d6ca600a6370693f867",
        "word": "deal",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/diːl/",
            "us": "/diːl/"
        },
        "nearby": [
            {
                "word": "deafness",
                "pos": "noun"
            },
            {
                "word": "deal",
                "pos": "verb"
            },
            {
                "word": "deal",
                "pos": "noun"
            },
            {
                "word": "deal-breaker",
                "pos": "noun"
            },
            {
                "word": "dealer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an agreement, especially in business, on particular conditions for buying or doing something",
                    "vi": "một thỏa thuận, đặc biệt là trong kinh doanh, về các điều kiện cụ thể để mua hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to sign/strike/finalize/close a deal",
                        "vi": "để ký / đình công / hoàn tất / đóng một thỏa thuận"
                    },
                    {
                        "en": "to negotiate/broker/agree/reach a deal",
                        "vi": "thương lượng / môi giới / đồng ý / đạt được thỏa thuận"
                    },
                    {
                        "en": "She is travelling to New York to seal the deal (= conclude it).",
                        "vi": "Cô ấy đang đi du lịch đến New York để ký kết thỏa thuận (= kết thúc nó)."
                    },
                    {
                        "en": "a deal with somebody We did a deal with the management on overtime.",
                        "vi": "thỏa thuận với ai đó Chúng tôi đã thỏa thuận với ban quản lý về thời gian làm thêm giờ."
                    },
                    {
                        "en": "I'll make a deal with you—I'll work evenings if you'll work weekends.",
                        "vi": "Tôi sẽ thỏa thuận với bạn — Tôi sẽ làm việc vào buổi tối nếu bạn sẽ làm việc vào cuối tuần."
                    },
                    {
                        "en": "(informal) He is trying to cut a deal (= make one) with the rebels.",
                        "vi": "(không chính thức) Anh ta đang cố gắng cắt đứt một thỏa thuận (= làm một) với quân nổi dậy."
                    },
                    {
                        "en": "The deal fell through (= no agreement was reached).",
                        "vi": "Thỏa thuận đã thất bại (= không đạt được thỏa thuận nào)."
                    },
                    {
                        "en": "I got a good deal on the car (= bought it cheaply).",
                        "vi": "Tôi có một món hời trên chiếc xe hơi (= mua nó với giá rẻ)."
                    },
                    {
                        "en": "They were hoping for a better pay deal.",
                        "vi": "Họ đã hy vọng cho một thỏa thuận trả lương tốt hơn."
                    },
                    {
                        "en": "Both sides are willing to agree on a peace deal.",
                        "vi": "Cả hai bên đều sẵn sàng đồng ý về một thỏa thuận hòa bình."
                    },
                    {
                        "en": "Listen. This is the deal (= this is what we have agreed and are going to do).",
                        "vi": "Nghe. Đây là thỏa thuận (= đây là những gì chúng tôi đã đồng ý và sẽ thực hiện)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that somebody/something is treated",
                    "vi": "cách mà ai đó / cái gì đó được đối xử"
                },
                "examples": [
                    {
                        "en": "If elected, the party has promised a new deal (= better and fairer treatment) for teachers.",
                        "vi": "Nếu được bầu, đảng đã hứa sẽ có một thỏa thuận mới (= đối xử tốt hơn và công bằng hơn) cho các giáo viên."
                    },
                    {
                        "en": "They knew they'd been given a raw deal (= been treated unfairly).",
                        "vi": "Họ biết rằng họ đã được giao một thỏa thuận thô (= bị đối xử bất công)."
                    },
                    {
                        "en": "We tried to ensure that everyone got a fair deal.",
                        "vi": "Chúng tôi đã cố gắng đảm bảo rằng mọi người đều có được một thỏa thuận công bằng."
                    },
                    {
                        "en": "Women get a bad deal when it comes to domestic work.",
                        "vi": "Phụ nữ gặp khó khăn khi nói về công việc gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of giving out cards to the players",
                    "vi": "hành động đưa thẻ cho người chơi"
                },
                "examples": [
                    {
                        "en": "It's your deal.",
                        "vi": "Đó là thỏa thuận của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the soft pale wood of fir or pine trees, especially when it is cut into boards for making things",
                    "vi": "gỗ nhạt màu mềm của cây linh sam hoặc cây thông, đặc biệt là khi nó được cắt thành ván để làm vật dụng"
                },
                "examples": [
                    {
                        "en": "a deal table",
                        "vi": "một bảng thỏa thuận"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are not impressed by something",
                    "vi": "từng nói rằng bạn không bị ấn tượng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "So he earns more than me. Big deal!",
                        "vi": "Vì vậy, anh ấy kiếm được nhiều hơn tôi. Việc lớn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "an agreement or a plan that has been finally completed or agreed",
                    "vi": "một thỏa thuận hoặc một kế hoạch cuối cùng đã được hoàn thành hoặc đồng ý"
                },
                "examples": [
                    {
                        "en": "The merger is by no means a done deal yet.",
                        "vi": "Việc sát nhập hoàn toàn không phải là một thỏa thuận được thực hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "much; a lot",
                    "vi": "nhiều; nhiều"
                },
                "examples": [
                    {
                        "en": "She's feeling a good deal better.",
                        "vi": "Cô ấy cảm thấy ổn hơn."
                    },
                    {
                        "en": "We don't see them a great deal (= often) these days.",
                        "vi": "Chúng tôi không thấy họ nhiều (= thường xuyên) những ngày này."
                    },
                    {
                        "en": "They spent a great deal of money.",
                        "vi": "Họ đã chi rất nhiều tiền."
                    },
                    {
                        "en": "A good deal of research has been done on the subject.",
                        "vi": "Rất nhiều nghiên cứu đã được thực hiện về chủ đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you agree to somebody's terms",
                    "vi": "từng nói rằng bạn đồng ý với các điều khoản của ai đó"
                },
                "examples": [
                    {
                        "en": "‘I'll cook if you wash the dishes.’ ‘It's a deal!’",
                        "vi": "Tôi sẽ nấu nếu bạn rửa bát.' 'Đó là một thỏa thuận!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is not important or not a problem",
                    "vi": "được sử dụng để nói rằng một cái gì đó không quan trọng hoặc không phải là một vấn đề"
                },
                "examples": [
                    {
                        "en": "If I don't win it's no big deal.",
                        "vi": "Nếu tôi không thắng thì cũng không có gì to tát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an agreement with somebody in which both sides have an advantage",
                    "vi": "để thực hiện một thỏa thuận với ai đó mà cả hai bên đều có lợi thế"
                },
                "examples": [
                    {
                        "en": "Perhaps we could strike a bargain.",
                        "vi": "Có lẽ chúng ta có thể đạt được một món hời."
                    },
                    {
                        "en": "The United States has struck a historic deal with India.",
                        "vi": "Hoa Kỳ đã đạt được một thỏa thuận lịch sử với Ấn Độ."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is happening in the present situation?",
                    "vi": "điều gì đang xảy ra trong tình huống hiện tại?"
                },
                "examples": [
                    {
                        "en": "What's the deal? Do you want to go out or not?",
                        "vi": "Thỏa thuận là gì? Bạn có muốn đi chơi hay không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c183f6012f345d98646b0dfbf47c000",
        "word": "pressure",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpreʃə(r)/",
            "us": "/ˈpreʃər/"
        },
        "nearby": [
            {
                "word": "press stud",
                "pos": "noun"
            },
            {
                "word": "press-up",
                "pos": "noun"
            },
            {
                "word": "pressure",
                "pos": "noun"
            },
            {
                "word": "pressure",
                "pos": "verb"
            },
            {
                "word": "pressure cooker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of trying to persuade or to force somebody to do something",
                    "vi": "hành động cố gắng thuyết phục hoặc buộc ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "pressure for something The pressure for change continued to mount.",
                        "vi": "áp lực cho một cái gì đó Áp lực cho sự thay đổi tiếp tục gia tăng."
                    },
                    {
                        "en": "pressure on somebody We are determined to keep up the pressure on the other member states.",
                        "vi": "áp lực lên ai đó Chúng tôi quyết tâm tiếp tục gây áp lực lên các quốc gia thành viên khác."
                    },
                    {
                        "en": "pressure on somebody to do something There is intense pressure on her to resign.",
                        "vi": "Áp lực buộc ai đó làm điều gì đó Có áp lực rất lớn buộc cô ấy phải từ chức."
                    },
                    {
                        "en": "pressure to do something In every society there is strong pressure to conform.",
                        "vi": "áp lực để làm điều gì đó Trong mọi xã hội đều có áp lực mạnh mẽ để tuân thủ."
                    },
                    {
                        "en": "Do you feel any pressure to dress in a certain way?",
                        "vi": "Bạn có cảm thấy áp lực khi phải ăn mặc theo một cách nào đó không?"
                    },
                    {
                        "en": "We must bring pressure to bear on our government to reverse this decision.",
                        "vi": "Chúng ta phải gây áp lực lên chính phủ để đảo ngược quyết định này."
                    },
                    {
                        "en": "pressure from somebody/something The company is facing increasing pressure from shareholders",
                        "vi": "áp lực từ ai đó / điều gì đó Công ty đang phải đối mặt với áp lực ngày càng tăng từ các cổ đông"
                    },
                    {
                        "en": "The government eventually bowed to popular pressure (= they agreed to do what people were trying to get them to do).",
                        "vi": "Chính phủ cuối cùng đã phải cúi đầu trước áp lực của dân chúng (= họ đồng ý làm những gì mọi người đang cố gắng bắt họ làm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficulties and worries that are caused by the need to achieve or to behave in a particular way",
                    "vi": "khó khăn và lo lắng gây ra bởi nhu cầu đạt được hoặc để hành xử theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "You need to be able to handle pressure in this job.",
                        "vi": "Bạn cần phải có khả năng xử lý áp lực trong công việc này."
                    },
                    {
                        "en": "pressure of something She was unable to attend because of the pressure of work.",
                        "vi": "áp lực của việc gì đó Cô đã không thể tham dự vì áp lực công việc."
                    },
                    {
                        "en": "How can anyone enjoy the pressures of city life?",
                        "vi": "Làm thế nào để mọi người có thể tận hưởng những áp lực của cuộc sống thành phố?"
                    },
                    {
                        "en": "pressure on somebody The economic pressures on small businesses are intense.",
                        "vi": "áp lực lên ai đó Áp lực kinh tế đối với các doanh nghiệp nhỏ là rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the force or weight with which something presses against something else",
                    "vi": "lực hoặc trọng lượng mà một thứ gì đó đè lên một thứ khác"
                },
                "examples": [
                    {
                        "en": "The nurse applied pressure to his arm to stop the bleeding.",
                        "vi": "Y tá đã áp vào cánh tay của anh ta để cầm máu."
                    },
                    {
                        "en": "The barriers gave way under the pressure of the crowd.",
                        "vi": "Các rào cản đã nhường chỗ trước sức ép của đám đông."
                    },
                    {
                        "en": "Last year he had brain surgery to relieve pressure from a blood clot.",
                        "vi": "Năm ngoái, anh đã phẫu thuật não để giảm áp lực do cục máu đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the force produced by a particular amount of gas or liquid in a container or a limited space; the amount of this",
                    "vi": "Lực tạo ra bởi một lượng khí hoặc chất lỏng cụ thể trong một bình chứa hoặc một không gian giới hạn; số lượng của cái này"
                },
                "examples": [
                    {
                        "en": "air/water pressure",
                        "vi": "áp suất không khí / nước"
                    },
                    {
                        "en": "Check the tyre pressure (= the amount of air in a tyre) regularly.",
                        "vi": "Thường xuyên kiểm tra áp suất lốp (= lượng không khí trong lốp)."
                    },
                    {
                        "en": "a pressure gauge (= an instrument used for measuring the pressure of a liquid or a gas)",
                        "vi": "một đồng hồ đo áp suất (= một dụng cụ dùng để đo áp suất của chất lỏng hoặc chất khí)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect that something has on the way a situation develops, especially when this causes problems",
                    "vi": "ảnh hưởng của điều gì đó đến cách một tình huống phát triển, đặc biệt là khi điều này gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "This puts upward pressure on prices.",
                        "vi": "Điều này gây áp lực tăng giá."
                    },
                    {
                        "en": "The high unemployment rate was exerting downward pressure on wage growth.",
                        "vi": "Tỷ lệ thất nghiệp cao gây áp lực giảm tốc độ tăng lương."
                    },
                    {
                        "en": "These measures are intended to relieve the pressure on the prison system.",
                        "vi": "Các biện pháp này nhằm giảm bớt áp lực cho hệ thống nhà tù."
                    },
                    {
                        "en": "They raised the starting threshold for income tax to ease the pressure on family budgets.",
                        "vi": "Họ đã nâng ngưỡng khởi điểm đối với thuế thu nhập để giảm bớt áp lực cho ngân sách gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the force of the atmosphere on the earth’s surface",
                    "vi": "lực của bầu khí quyển trên bề mặt trái đất"
                },
                "examples": [
                    {
                        "en": "A band of high/low pressure is moving across the country.",
                        "vi": "Một dải áp cao / áp thấp đang di chuyển trên khắp cả nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force or to try to persuade somebody to do something",
                    "vi": "ép buộc hoặc cố gắng thuyết phục ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Advertisements put pressure on girls to be thin.",
                        "vi": "Các quảng cáo gây áp lực khiến các cô gái phải gầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a liquid or a gas is kept under pressure, it is forced into a container so that when the container is opened, the liquid or gas escapes quickly",
                    "vi": "Nếu chất lỏng hoặc chất khí được giữ dưới áp suất thì nó bị ép vào thùng chứa để khi mở thùng ra, chất lỏng hoặc chất khí thoát ra nhanh chóng."
                },
                "examples": [
                    {
                        "en": "Draught beer is pumped out of the barrel under pressure.",
                        "vi": "Bia hơi được bơm ra khỏi thùng dưới áp suất."
                    }
                ]
            },
            {
                "define": {
                    "en": "being forced to do something",
                    "vi": "bị buộc phải làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "The director is under increasing pressure to resign.",
                        "vi": "Giám đốc đang chịu áp lực ngày càng tăng phải từ chức."
                    },
                    {
                        "en": "Hospital staff are coming under pressure to work longer hours.",
                        "vi": "Nhân viên bệnh viện đang phải chịu áp lực làm việc nhiều giờ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "made to feel anxious about something you have to do",
                    "vi": "khiến bạn cảm thấy lo lắng về điều gì đó bạn phải làm"
                },
                "examples": [
                    {
                        "en": "The team performs well under pressure.",
                        "vi": "Đội thi đấu tốt dưới áp lực."
                    },
                    {
                        "en": "He's felt under pressure since his wife had the operation.",
                        "vi": "Anh ấy cảm thấy áp lực kể từ khi vợ anh ấy phẫu thuật."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d2bd32b42374748a92eae96408a070d",
        "word": "reject",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈdʒekt/",
            "us": "/rɪˈdʒekt/"
        },
        "nearby": [
            {
                "word": "Lord Reith",
                "pos": ""
            },
            {
                "word": "the Reith lectures",
                "pos": ""
            },
            {
                "word": "reject",
                "pos": "verb"
            },
            {
                "word": "reject",
                "pos": "noun"
            },
            {
                "word": "rejection",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to refuse to accept or consider something",
                    "vi": "từ chối chấp nhận hoặc xem xét điều gì đó"
                },
                "examples": [
                    {
                        "en": "to reject an argument/a hypothesis/a notion/a plan",
                        "vi": "bác bỏ một lập luận / một giả thuyết / một quan điểm / một kế hoạch"
                    },
                    {
                        "en": "to reject a claim/an offer/a request/an application",
                        "vi": "để từ chối một yêu cầu / một đề nghị / một yêu cầu / một ứng dụng"
                    },
                    {
                        "en": "The bank has the option of accepting or rejecting this offer.",
                        "vi": "Ngân hàng có quyền lựa chọn chấp nhận hoặc từ chối đề nghị này."
                    },
                    {
                        "en": "The prime minister rejected any idea of reforming the system.",
                        "vi": "Thủ tướng bác bỏ mọi ý tưởng cải tổ hệ thống."
                    },
                    {
                        "en": "The proposal was firmly rejected.",
                        "vi": "Đề xuất đã bị từ chối một cách kiên quyết."
                    },
                    {
                        "en": "School officials flatly rejected the proposal.",
                        "vi": "Các quan chức của trường thẳng thừng từ chối đề nghị này."
                    },
                    {
                        "en": "All our suggestions were rejected out of hand.",
                        "vi": "Tất cả các đề xuất của chúng tôi đã bị từ chối trong tầm tay."
                    },
                    {
                        "en": "The Government rejected calls for an inquiry.",
                        "vi": "Chính phủ đã từ chối các yêu cầu điều tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to accept somebody for a job, position, etc.",
                    "vi": "từ chối nhận ai đó cho một công việc, vị trí, v.v."
                },
                "examples": [
                    {
                        "en": "Please reject the following candidates…",
                        "vi": "Vui lòng từ chối các ứng cử viên sau…"
                    },
                    {
                        "en": "I've been rejected by all the universities I applied to.",
                        "vi": "Tôi đã bị từ chối bởi tất cả các trường đại học mà tôi đăng ký."
                    },
                    {
                        "en": "Some applicants were rejected outright.",
                        "vi": "Một số ứng viên đã bị từ chối hoàn toàn."
                    },
                    {
                        "en": "We considered offering him the job, but finally rejected him.",
                        "vi": "Chúng tôi đã cân nhắc đề nghị công việc cho anh ấy, nhưng cuối cùng đã từ chối anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide not to use, sell, publish, etc. something because its quality is not good enough",
                    "vi": "để quyết định không sử dụng, bán, xuất bản, v.v. thứ gì đó vì chất lượng của nó không đủ tốt"
                },
                "examples": [
                    {
                        "en": "Imperfect articles are rejected by our quality control.",
                        "vi": "Các bài báo không hoàn hảo bị từ chối bởi kiểm soát chất lượng của chúng tôi."
                    },
                    {
                        "en": "The book was at first rejected by publishers.",
                        "vi": "Ban đầu cuốn sách bị các nhà xuất bản từ chối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not accept a new organ after a transplant operation, by producing substances that attack the organ",
                    "vi": "không chấp nhận một cơ quan mới sau khi phẫu thuật cấy ghép, bằng cách tạo ra các chất tấn công cơ quan đó"
                },
                "examples": [
                    {
                        "en": "Her body has already rejected two kidneys.",
                        "vi": "Cơ thể cô ấy đã từ chối hai quả thận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to give a person or an animal enough love or care",
                    "vi": "không dành cho một người hoặc một con vật đủ tình yêu thương hoặc sự quan tâm"
                },
                "examples": [
                    {
                        "en": "The lioness rejected the smallest cub, which died.",
                        "vi": "Sư tử cái từ chối đàn con nhỏ nhất đã chết."
                    },
                    {
                        "en": "When her husband left home she felt rejected and useless.",
                        "vi": "Khi chồng bỏ nhà đi, cô cảm thấy bị từ chối và vô dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b3e4f55ee42f461ba425e82bb50be866",
        "word": "approach",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈprəʊtʃ/",
            "us": "/əˈprəʊtʃ/"
        },
        "nearby": [
            {
                "word": "appro",
                "pos": "noun"
            },
            {
                "word": "approach",
                "pos": "noun"
            },
            {
                "word": "approach",
                "pos": "verb"
            },
            {
                "word": "approachable",
                "pos": "adjective"
            },
            {
                "word": "approbation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come near to somebody/something in distance or time",
                    "vi": "đến gần ai đó / cái gì đó trong khoảng cách hoặc thời gian"
                },
                "examples": [
                    {
                        "en": "We could hear the train approaching.",
                        "vi": "Chúng tôi có thể nghe thấy tiếng tàu đang đến gần."
                    },
                    {
                        "en": "Winter is approaching.",
                        "vi": "Mùa đông đang đến gần."
                    },
                    {
                        "en": "The deadline was fast approaching.",
                        "vi": "Thời hạn đã đến rất nhanh."
                    },
                    {
                        "en": "The rapidly approaching storm could be seen on the horizon.",
                        "vi": "Cơn bão đang tiến nhanh có thể được nhìn thấy ở đường chân trời."
                    },
                    {
                        "en": "approach somebody/something She's approaching the end of her first year in the job.",
                        "vi": "tiếp cận ai đó / điều gì đó Cô ấy sắp kết thúc năm đầu tiên đi làm."
                    },
                    {
                        "en": "I was approached by a woman who asked for the time.",
                        "vi": "Tôi được một người phụ nữ tiếp cận hỏi thời gian."
                    },
                    {
                        "en": "The house is approached via a long driveway.",
                        "vi": "Ngôi nhà được tiếp cận qua một con đường lái xe dài."
                    },
                    {
                        "en": "approach (somebody/something) from… The men approached the creature cautiously from behind.",
                        "vi": "tiếp cận (ai đó / cái gì đó) từ… Những người đàn ông tiếp cận sinh vật một cách thận trọng từ phía sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak to somebody about something, especially to ask them for something or to offer to do something",
                    "vi": "nói chuyện với ai đó về điều gì đó, đặc biệt là yêu cầu họ làm điều gì đó hoặc đề nghị làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "approach somebody We have been approached by a number of companies that are interested in our product.",
                        "vi": "tiếp cận ai đó Chúng tôi đã được tiếp cận bởi một số công ty quan tâm đến sản phẩm của chúng tôi."
                    },
                    {
                        "en": "I'd like to ask his opinion but I find him difficult to approach (= not easy to talk to in a friendly way).",
                        "vi": "Tôi muốn hỏi ý kiến của anh ấy nhưng tôi thấy anh ấy khó gần (= không dễ nói chuyện một cách thân thiện)."
                    },
                    {
                        "en": "approach somebody for something She was often approached for help and advice.",
                        "vi": "tiếp cận ai đó vì điều gì đó Cô ấy thường được tiếp cận để được giúp đỡ và tư vấn."
                    },
                    {
                        "en": "approach somebody about something We have approached the company about the possibility of a merger.",
                        "vi": "tiếp cận ai đó về điều gì đó Chúng tôi đã tiếp cận công ty về khả năng sáp nhập."
                    },
                    {
                        "en": "approach somebody about doing something Have you approached John about organizing a concert?",
                        "vi": "tiếp cận ai đó về việc làm gì đó Bạn đã từng tiếp cận John về việc tổ chức một buổi hòa nhạc chưa?"
                    },
                    {
                        "en": "approach somebody to do something She was approached to take part in the event.",
                        "vi": "tiếp cận ai đó để làm điều gì đó Cô ấy đã được tiếp cận để tham gia vào sự kiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come close to something in amount, level or quality",
                    "vi": "để tiến gần đến điều gì đó về số lượng, cấp độ hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "Interest rates are approaching zero.",
                        "vi": "Lãi suất đang về 0."
                    },
                    {
                        "en": "profits approaching 30 million dollars",
                        "vi": "lợi nhuận đạt 30 triệu đô la"
                    },
                    {
                        "en": "Few writers approach his richness of language.",
                        "vi": "Rất ít nhà văn tiếp cận được với sự phong phú về ngôn ngữ của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start dealing with a problem, task, etc. in a particular way",
                    "vi": "để bắt đầu giải quyết một vấn đề, nhiệm vụ, v.v. theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "to approach a subject/matter/task/question",
                        "vi": "để tiếp cận một chủ đề / vấn đề / nhiệm vụ / câu hỏi"
                    },
                    {
                        "en": "What's the best way to approach this problem?",
                        "vi": "Cách tốt nhất để tiếp cận vấn đề này là gì?"
                    },
                    {
                        "en": "The issues should be approached with caution.",
                        "vi": "Các vấn đề cần được tiếp cận một cách thận trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "fafde4e840564d55a8e76f0c87c4dbfc",
        "word": "bid",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/bɪd/",
            "us": "/bɪd/"
        },
        "nearby": [
            {
                "word": "bicycle lane",
                "pos": "noun"
            },
            {
                "word": "bicyclist",
                "pos": "noun"
            },
            {
                "word": "bid1",
                "pos": "noun"
            },
            {
                "word": "bid1",
                "pos": "verb"
            },
            {
                "word": "bid2",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an offer by a person or a company to pay a particular amount of money for something",
                    "vi": "lời đề nghị của một người hoặc một công ty để trả một số tiền cụ thể cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "bid for something A German firm launched a takeover bid for the company.",
                        "vi": "đấu thầu cho một thứ gì đó Một công ty của Đức đã đưa ra một cuộc đấu thầu tiếp quản công ty."
                    },
                    {
                        "en": "At the auction (= a public sale where things are sold to the person who offers the most), the highest bid for the picture was £200.",
                        "vi": "Tại cuộc đấu giá (= một cuộc mua bán công khai nơi mọi thứ được bán cho người cung cấp nhiều nhất), giá thầu cao nhất cho bức tranh là 200 bảng Anh."
                    },
                    {
                        "en": "bid on something (North American English also) the highest bid on the picture",
                        "vi": "đặt giá thầu cho một thứ gì đó (cả tiếng Anh ở Bắc Mỹ) giá thầu cao nhất trên bức tranh"
                    },
                    {
                        "en": "Any more bids?",
                        "vi": "Có thêm giá thầu nào không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an offer to do work or provide a service for a particular price, in competition with other companies, etc.",
                    "vi": "một đề nghị làm việc hoặc cung cấp một dịch vụ với một mức giá cụ thể, cạnh tranh với các công ty khác, v.v."
                },
                "examples": [
                    {
                        "en": "The company submitted a bid for the contract to clean the hospital.",
                        "vi": "Công ty đã nộp hồ sơ dự thầu hợp đồng làm sạch bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "an effort to do something or to obtain something",
                    "vi": "nỗ lực để làm một cái gì đó hoặc để đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "bid for something a bid for power",
                        "vi": "đấu thầu cho một thứ gì đó đấu thầu quyền lực"
                    },
                    {
                        "en": "bid to do something a desperate bid to escape from his attackers",
                        "vi": "đấu thầu để làm điều gì đó một nỗ lực tuyệt vọng để trốn thoát khỏi những kẻ tấn công của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of the number of points a player thinks they will win",
                    "vi": "tuyên bố về số điểm mà một người chơi nghĩ rằng họ sẽ thắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cd648a195ff14701bd122cc66f8f7573",
        "word": "bid",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/bɪd/",
            "us": "/bɪd/"
        },
        "nearby": [
            {
                "word": "bicyclist",
                "pos": "noun"
            },
            {
                "word": "bid1",
                "pos": "noun"
            },
            {
                "word": "bid1",
                "pos": "verb"
            },
            {
                "word": "bid2",
                "pos": "verb"
            },
            {
                "word": "biddable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to offer to pay a particular price for something, especially at an auction",
                    "vi": "đề nghị trả một mức giá cụ thể cho một thứ gì đó, đặc biệt là tại một cuộc đấu giá"
                },
                "examples": [
                    {
                        "en": "bid (something) (for something) I bid £2 000 for the painting.",
                        "vi": "đấu giá (một cái gì đó) (cho một cái gì đó) Tôi đấu giá £ 2 000 cho bức tranh."
                    },
                    {
                        "en": "bid (against somebody) (for something) We wanted to buy the chairs but another couple were bidding against us.",
                        "vi": "trả giá (chống lại ai đó) (cho một cái gì đó) Chúng tôi muốn mua những chiếc ghế nhưng một cặp đôi khác đã đấu giá chống lại chúng tôi."
                    },
                    {
                        "en": "Two dealers bid against each other for the antique table.",
                        "vi": "Hai đại lý đấu giá với nhau cho chiếc bàn cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to offer to do work or provide a service for a particular price, in competition with other companies, etc.",
                    "vi": "đề nghị thực hiện công việc hoặc cung cấp dịch vụ với một mức giá cụ thể, cạnh tranh với các công ty khác, v.v."
                },
                "examples": [
                    {
                        "en": "bid for something A French firm will be bidding for the contract.",
                        "vi": "đấu thầu cho một cái gì đó Một công ty Pháp sẽ đấu thầu hợp đồng."
                    },
                    {
                        "en": "bid on something (North American English also) A French firm will be bidding on the contract.",
                        "vi": "đấu thầu một thứ gì đó (cả tiếng Anh ở Bắc Mỹ) Một công ty Pháp sẽ đấu thầu hợp đồng."
                    },
                    {
                        "en": "bid to do something Which other cities are bidding to host the 2028 Olympics?",
                        "vi": "đấu thầu để làm điều gì đó Những thành phố nào khác đang đấu thầu để đăng cai Thế vận hội 2028?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do, get or achieve something",
                    "vi": "để cố gắng làm, đạt được hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The team is bidding to retain its place in the league.",
                        "vi": "Đội đang đấu thầu để duy trì vị trí của mình trong giải đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some card games) to say how many points you expect to win",
                    "vi": "(trong một số trò chơi bài) để cho biết bạn mong muốn giành được bao nhiêu điểm"
                },
                "examples": [
                    {
                        "en": "She bid four hearts.",
                        "vi": "Cô trả giá bốn trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "used by an auctioneer who is selling something",
                    "vi": "được sử dụng bởi một đấu giá viên đang bán một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What am I bid for this vase?",
                        "vi": "Tôi đấu giá cái bình này là gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3501010c2e83405fa0761025c29405aa",
        "word": "contract",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒntrækt/",
            "us": "/ˈkɑːntrækt/"
        },
        "nearby": [
            {
                "word": "contraceptive",
                "pos": "adjective"
            },
            {
                "word": "contraceptive",
                "pos": "noun"
            },
            {
                "word": "contract",
                "pos": "noun"
            },
            {
                "word": "contract",
                "pos": "verb"
            },
            {
                "word": "contract bridge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official written agreement",
                    "vi": "một thỏa thuận chính thức bằng văn bản"
                },
                "examples": [
                    {
                        "en": "All employees have a written contract of employment.",
                        "vi": "Tất cả nhân viên đều có hợp đồng lao động bằng văn bản."
                    },
                    {
                        "en": "a research/modelling/recording contract",
                        "vi": "một hợp đồng nghiên cứu / mô hình hóa / ghi âm"
                    },
                    {
                        "en": "a lucrative government contract",
                        "vi": "một hợp đồng chính phủ béo bở"
                    },
                    {
                        "en": "contract with somebody to enter into/negotiate/sign a contract with the supplier",
                        "vi": "hợp đồng với ai đó để tham gia / đàm phán / ký hợp đồng với nhà cung cấp"
                    },
                    {
                        "en": "contract between A and B These clauses form part of the contract between buyer and seller.",
                        "vi": "hợp đồng giữa A và B Các điều khoản này là một phần của hợp đồng giữa người mua và người bán."
                    },
                    {
                        "en": "contract for something a contract for the supply of vehicles",
                        "vi": "hợp đồng cho một cái gì đó một hợp đồng cung cấp phương tiện"
                    },
                    {
                        "en": "contract to do something to win/be awarded a contract to build a new school",
                        "vi": "hợp đồng làm điều gì đó để giành chiến thắng / được trao hợp đồng xây dựng trường học mới"
                    },
                    {
                        "en": "to renew/extend/terminate/cancel a contract",
                        "vi": "để gia hạn / gia hạn / chấm dứt / hủy bỏ hợp đồng"
                    },
                    {
                        "en": "on a contract I was on a three-year contract that expired last week.",
                        "vi": "về một hợp đồng Tôi đã có một hợp đồng ba năm hết hạn vào tuần trước."
                    },
                    {
                        "en": "under contract to/with somebody/something She is under contract to (= has a contract to work for) a major American computer firm.",
                        "vi": "theo hợp đồng với / với ai đó / cái gì Cô ấy theo hợp đồng với (= có hợp đồng làm việc cho) một hãng máy tính lớn của Mỹ."
                    },
                    {
                        "en": "out of contract The phone costs several hundred dollars more out of contract (= without a contract with a phone company).",
                        "vi": "ngoài hợp đồng Điện thoại có giá cao hơn vài trăm đô la ngoài hợp đồng (= không có hợp đồng với công ty điện thoại)."
                    },
                    {
                        "en": "The midfielder will be out of contract at the end of the season (= his contract with his club will have finished).",
                        "vi": "Tiền vệ này sẽ hết hợp đồng vào cuối mùa giải (= hợp đồng của anh ấy với câu lạc bộ của anh ấy sẽ hết hạn)."
                    },
                    {
                        "en": "a contract worker (= one employed on a contract for a fixed period of time)",
                        "vi": "một nhân viên hợp đồng (= một người làm việc theo hợp đồng trong một khoảng thời gian cố định)"
                    },
                    {
                        "en": "Under the terms of the contract the job should have been finished yesterday.",
                        "vi": "Theo các điều khoản của hợp đồng, công việc đáng lẽ phải được hoàn thành vào ngày hôm qua."
                    },
                    {
                        "en": "They were sued for breach of contract (= not doing what they agreed to do in a contract).",
                        "vi": "Họ bị kiện vì vi phạm hợp đồng (= không làm những gì họ đã đồng ý trong hợp đồng)."
                    },
                    {
                        "en": "He had a release clause written into his contract.",
                        "vi": "Anh ấy đã có một điều khoản giải phóng được ghi vào hợp đồng của mình."
                    },
                    {
                        "en": "subject to contract The offer has been accepted, subject to contract (= the agreement is not official until the contract is signed).",
                        "vi": "tùy thuộc vào hợp đồng Đề nghị đã được chấp nhận, tùy thuộc vào hợp đồng (= thỏa thuận không chính thức cho đến khi hợp đồng được ký kết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an agreement to kill somebody for money",
                    "vi": "một thỏa thuận giết ai đó để lấy tiền"
                },
                "examples": [
                    {
                        "en": "She took out a contract on her ex-husband.",
                        "vi": "Cô ấy rút ra một hợp đồng với chồng cũ của mình."
                    },
                    {
                        "en": "He has a contract out on you.",
                        "vi": "Anh ấy đã ký hợp đồng với bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d9a28ba318f4483dbe33d257f54d2758",
        "word": "draft",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/drɑːft/",
            "us": "/dræft/"
        },
        "nearby": [
            {
                "word": "draconian",
                "pos": "adjective"
            },
            {
                "word": "Dracula",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "verb"
            },
            {
                "word": "draft",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rough written version of something that is not yet in its final form",
                    "vi": "một phiên bản viết thô của thứ gì đó vẫn chưa ở dạng cuối cùng"
                },
                "examples": [
                    {
                        "en": "This is only the first draft of my speech.",
                        "vi": "Đây chỉ là bản thảo đầu tiên của bài phát biểu của tôi."
                    },
                    {
                        "en": "I've made a rough draft of the letter.",
                        "vi": "Tôi đã làm một bản thảo thô của bức thư."
                    },
                    {
                        "en": "The final published version differs from earlier drafts in many key details.",
                        "vi": "Phiên bản cuối cùng được xuất bản khác với các bản nháp trước đó ở nhiều chi tiết chính."
                    },
                    {
                        "en": "the final draft (= the final version)",
                        "vi": "bản nháp cuối cùng (= phiên bản cuối cùng)"
                    },
                    {
                        "en": "a draft report/plan/bill/resolution",
                        "vi": "một dự thảo báo cáo / kế hoạch / hóa đơn / giải quyết"
                    },
                    {
                        "en": "a draft document/proposal",
                        "vi": "một tài liệu / đề xuất dự thảo"
                    },
                    {
                        "en": "the draft constitution/legislation/agreement",
                        "vi": "dự thảo hiến pháp / luật pháp / hiệp định"
                    },
                    {
                        "en": "The legislation is still in draft form.",
                        "vi": "Luật vẫn đang ở dạng dự thảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written order to a bank to pay money to somebody",
                    "vi": "một văn bản yêu cầu ngân hàng trả tiền cho ai đó"
                },
                "examples": [
                    {
                        "en": "Payment must be made by bank draft drawn on a UK bank.",
                        "vi": "Thanh toán phải được thực hiện bằng hối phiếu ngân hàng được ký phát tại một ngân hàng ở Vương quốc Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the practice of ordering people by law to join the armed forces",
                    "vi": "thực hành lệnh mọi người tham gia lực lượng vũ trang theo quy định của pháp luật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system in which professional teams in some sports choose players each year from among college students",
                    "vi": "một hệ thống trong đó các đội chuyên nghiệp trong một số môn thể thao chọn người chơi mỗi năm trong số các sinh viên đại học"
                },
                "examples": [
                    {
                        "en": "He was the fourth player chosen in the 2017 draft, but the first of his class to reach the major leagues.",
                        "vi": "Anh ấy là cầu thủ thứ tư được chọn trong bản dự thảo năm 2017, nhưng là người đầu tiên trong lớp của anh ấy tham dự các giải đấu lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flow of cool air in a room or other small space",
                    "vi": "luồng không khí mát trong phòng hoặc không gian nhỏ khác"
                },
                "examples": [
                    {
                        "en": "Can you shut the door? There's a draft in here.",
                        "vi": "Bạn có thể đóng cửa lại không? Có một bản nháp ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "one continuous action of swallowing liquid (= making it go down your throat); the amount swallowed",
                    "vi": "một hành động liên tục nuốt chất lỏng (= làm cho nó chảy xuống cổ họng của bạn); số lượng nuốt"
                },
                "examples": [
                    {
                        "en": "He took a deep draft of his beer.",
                        "vi": "Anh uống một hơi hết sạch bia của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "medicine in a liquid form",
                    "vi": "thuốc ở dạng lỏng"
                },
                "examples": [
                    {
                        "en": "a sleeping draft (= one that makes you sleep)",
                        "vi": "một bản nháp khi ngủ (= một bản nháp khiến bạn ngủ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "e71c777a432a4647afc1fccb50dcbbd7",
        "word": "draft",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/drɑːft/",
            "us": "/dræft/"
        },
        "nearby": [
            {
                "word": "Dracula",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "verb"
            },
            {
                "word": "draft",
                "pos": "adjective"
            },
            {
                "word": "draft board",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to write the first rough version of something such as a letter, speech, book or law",
                    "vi": "để viết phiên bản thô đầu tiên của một cái gì đó chẳng hạn như một lá thư, bài phát biểu, sách hoặc luật"
                },
                "examples": [
                    {
                        "en": "I'll draft a letter for you.",
                        "vi": "Tôi sẽ soạn thảo một lá thư cho bạn."
                    },
                    {
                        "en": "The military began drafting a new constitution.",
                        "vi": "Quân đội bắt đầu soạn thảo hiến pháp mới."
                    },
                    {
                        "en": "Members of Parliament are busy drafting new legislation.",
                        "vi": "Các thành viên của Quốc hội đang bận rộn với việc soạn thảo luật mới."
                    },
                    {
                        "en": "to draft a bill/law/plan",
                        "vi": "để soạn thảo một dự luật / luật / kế hoạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose people and send them somewhere for a special task",
                    "vi": "để chọn người và gửi họ đến một nơi nào đó cho một nhiệm vụ đặc biệt"
                },
                "examples": [
                    {
                        "en": "Extra police are being drafted in to control the crowds.",
                        "vi": "Cảnh sát bổ sung đang được điều động để kiểm soát đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to order somebody by law to join the armed forces",
                    "vi": "ra lệnh cho ai đó theo luật gia nhập lực lượng vũ trang"
                },
                "examples": [
                    {
                        "en": "be drafted (into something) They were drafted into the army.",
                        "vi": "được dự thảo (thành một cái gì đó) Họ đã được đưa vào quân đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "69bb4ea200334ae990eebbe0105e9f75",
        "word": "negotiate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/nɪˈɡəʊʃieɪt/",
            "us": "/nɪˈɡəʊʃieɪt/"
        },
        "nearby": [
            {
                "word": "negligible",
                "pos": "adjective"
            },
            {
                "word": "negotiable",
                "pos": "adjective"
            },
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            },
            {
                "word": "negotiation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to reach an agreement by formal discussion",
                    "vi": "cố gắng đạt được một thỏa thuận bằng cách thảo luận chính thức"
                },
                "examples": [
                    {
                        "en": "negotiate (with somebody) (for something) The government will not negotiate with terrorists.",
                        "vi": "thương lượng (với ai đó) (cho điều gì đó) Chính phủ sẽ không thương lượng với những kẻ khủng bố."
                    },
                    {
                        "en": "We have been negotiating for more pay.",
                        "vi": "Chúng tôi đã đàm phán để được trả nhiều tiền hơn."
                    },
                    {
                        "en": "negotiate (with somebody) about/on something They have refused to negotiate on this issue.",
                        "vi": "thương lượng (với ai đó) về / về điều gì đó Họ đã từ chối thương lượng về vấn đề này."
                    },
                    {
                        "en": "a strong negotiating position",
                        "vi": "một vị trí đàm phán mạnh mẽ"
                    },
                    {
                        "en": "negotiating skills",
                        "vi": "các kỹ năng thương lượng"
                    },
                    {
                        "en": "negotiate between A and B to negotiate between the two sides",
                        "vi": "thương lượng giữa A và B để thương lượng giữa hai bên"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange or agree something by formal discussion",
                    "vi": "sắp xếp hoặc đồng ý một cái gì đó bằng cách thảo luận chính thức"
                },
                "examples": [
                    {
                        "en": "to negotiate a deal/contract/treaty/settlement",
                        "vi": "để thương lượng một thỏa thuận / hợp đồng / hiệp ước / dàn xếp"
                    },
                    {
                        "en": "We successfully negotiated the release of the hostages.",
                        "vi": "Chúng tôi đã thương lượng thành công việc thả con tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to successfully get over or past a difficult part on a path or route",
                    "vi": "để vượt qua hoặc vượt qua một phần khó khăn trên một con đường hoặc lộ trình"
                },
                "examples": [
                    {
                        "en": "The climbers had to negotiate a steep rock face.",
                        "vi": "Các nhà leo núi đã phải thương lượng về một mặt đá dốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cc8d4a9b87749c5a3b56b519e5bb0b7",
        "word": "negotiation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/nɪˌɡəʊʃiˈeɪʃn/",
            "us": "/nɪˌɡəʊʃiˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            },
            {
                "word": "negotiation",
                "pos": "noun"
            },
            {
                "word": "negotiator",
                "pos": "noun"
            },
            {
                "word": "Negress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "formal discussion between people who are trying to reach an agreement",
                    "vi": "thảo luận chính thức giữa những người đang cố gắng đạt được thỏa thuận"
                },
                "examples": [
                    {
                        "en": "peace/trade/contract negotiations",
                        "vi": "đàm phán hòa bình / thương mại / hợp đồng"
                    },
                    {
                        "en": "They begin another round of negotiations today.",
                        "vi": "Họ bắt đầu một vòng đàm phán khác hôm nay."
                    },
                    {
                        "en": "to enter into/open/begin negotiations",
                        "vi": "tham gia / mở / bắt đầu đàm phán"
                    },
                    {
                        "en": "to continue/resume/conclude negotiations",
                        "vi": "tiếp tục / tiếp tục / kết thúc đàm phán"
                    },
                    {
                        "en": "negotiation with somebody They were conducting secret negotiations with Spain.",
                        "vi": "đàm phán với ai đó Họ đang tiến hành các cuộc đàm phán bí mật với Tây Ban Nha."
                    },
                    {
                        "en": "negotiation between A and B The rent is a matter for negotiation between the landlord and the tenant.",
                        "vi": "thương lượng giữa A và B Giá thuê là vấn đề cần thương lượng giữa chủ nhà và người thuê."
                    },
                    {
                        "en": "in negotiation with somebody A contract is prepared in negotiation with our clients.",
                        "vi": "trong thương lượng với ai đó Một hợp đồng được chuẩn bị để thương lượng với khách hàng của chúng tôi."
                    },
                    {
                        "en": "under negotiation The issue is still under negotiation.",
                        "vi": "đang thương lượng Vấn đề vẫn đang được thương lượng."
                    },
                    {
                        "en": "The price is generally open to negotiation.",
                        "vi": "Giá cả nói chung là mở để thương lượng."
                    }
                ]
            }
        ]
    },
    {
        "id": "17ef7adf50b74ea0883e6f59227dfb00",
        "word": "proposal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈpəʊzl/",
            "us": "/prəˈpəʊzl/"
        },
        "nearby": [
            {
                "word": "proportionately",
                "pos": "adverb"
            },
            {
                "word": "proportioned",
                "pos": "adjective"
            },
            {
                "word": "proposal",
                "pos": "noun"
            },
            {
                "word": "propose",
                "pos": "verb"
            },
            {
                "word": "proposer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal suggestion or plan; the act of making a suggestion",
                    "vi": "một gợi ý hoặc kế hoạch chính thức; hành động đưa ra một đề xuất"
                },
                "examples": [
                    {
                        "en": "to submit/present/put forward a proposal",
                        "vi": "gửi / trình bày / đưa ra một đề xuất"
                    },
                    {
                        "en": "to consider/discuss a proposal",
                        "vi": "để xem xét / thảo luận về một đề xuất"
                    },
                    {
                        "en": "to accept/approve/support/reject a proposal",
                        "vi": "chấp nhận / phê duyệt / hỗ trợ / từ chối một đề xuất"
                    },
                    {
                        "en": "proposal to do something a proposal to build more office accommodation",
                        "vi": "đề xuất làm điều gì đó đề xuất xây thêm văn phòng lưu trú"
                    },
                    {
                        "en": "proposal that… His proposal that the system should be changed was rejected.",
                        "vi": "đề xuất rằng… Đề xuất của anh ấy rằng nên thay đổi hệ thống đã bị từ chối."
                    },
                    {
                        "en": "proposal for something The proposal for a new high-speed railway met with strong opposition.",
                        "vi": "Đề xuất về một cái gì đó Đề xuất về một tuyến đường sắt tốc độ cao mới đã vấp phải sự phản đối mạnh mẽ."
                    },
                    {
                        "en": "proposal on something When will the minister publish his proposals on reform of the health service?",
                        "vi": "Đề xuất về điều gì Khi nào Bộ trưởng sẽ công bố các đề xuất của mình về cải cách dịch vụ y tế?"
                    },
                    {
                        "en": "proposal by/from somebody two recent proposals by Vancouver City Council",
                        "vi": "đề xuất của / từ ai đó hai đề xuất gần đây của Hội đồng Thành phố Vancouver"
                    },
                    {
                        "en": "Reaction to the proposals from technology companies has so far been muted.",
                        "vi": "Phản ứng trước các đề xuất từ các công ty công nghệ cho đến nay vẫn bị tắt tiếng."
                    },
                    {
                        "en": "under a proposal Under these proposals, the Commission will be significantly strengthened.",
                        "vi": "theo một đề xuất Theo các đề xuất này, Ủy ban sẽ được củng cố đáng kể."
                    },
                    {
                        "en": "The Republicans in Congress will vote for the president's budget proposal.",
                        "vi": "Đảng Cộng hòa trong Quốc hội sẽ bỏ phiếu cho đề xuất ngân sách của tổng thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of formally asking somebody to marry you",
                    "vi": "một hành động chính thức yêu cầu ai đó kết hôn với bạn"
                },
                "examples": [
                    {
                        "en": "She accepted his proposal of marriage.",
                        "vi": "Cô nhận lời cầu hôn của anh."
                    },
                    {
                        "en": "a marriage proposal",
                        "vi": "một lời cầu hôn"
                    },
                    {
                        "en": "She turned down his proposal.",
                        "vi": "Cô đã từ chối lời cầu hôn của anh."
                    },
                    {
                        "en": "She had been hoping for a sweet old-fashioned proposal of marriage.",
                        "vi": "Cô đã hy vọng vào một lời cầu hôn ngọt ngào kiểu xưa."
                    }
                ]
            }
        ]
    },
    {
        "id": "1dca757473bc447e806954420f1b18ac",
        "word": "schedule",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈʃedjuːl/",
            "us": "/ˈskedʒuːl/"
        },
        "nearby": [
            {
                "word": "schadenfreude",
                "pos": "noun"
            },
            {
                "word": "schedule",
                "pos": "noun"
            },
            {
                "word": "schedule",
                "pos": "verb"
            },
            {
                "word": "scheduled caste",
                "pos": "noun"
            },
            {
                "word": "scheduled flight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to arrange for something to happen at a particular time",
                    "vi": "sắp xếp cho một cái gì đó xảy ra vào một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "schedule something for something The meeting is scheduled for Friday afternoon.",
                        "vi": "lên lịch cho việc gì đó Cuộc họp được lên lịch vào chiều thứ sáu."
                    },
                    {
                        "en": "Local elections were tentatively scheduled for November.",
                        "vi": "Các cuộc bầu cử địa phương dự kiến được lên lịch vào tháng 11."
                    },
                    {
                        "en": "schedule something We scheduled regular status meetings.",
                        "vi": "lên lịch một cái gì đó Chúng tôi đã lên lịch các cuộc họp trạng thái thường xuyên."
                    },
                    {
                        "en": "One of the scheduled events is a talk on alternative medicine.",
                        "vi": "Một trong những sự kiện đã được lên lịch là buổi nói chuyện về thuốc thay thế."
                    },
                    {
                        "en": "He finally arrived, an hour later than scheduled.",
                        "vi": "Cuối cùng thì anh cũng đến, muộn hơn một tiếng so với lịch trình."
                    },
                    {
                        "en": "We'll be stopping here for longer than scheduled.",
                        "vi": "Chúng tôi sẽ dừng ở đây lâu hơn lịch trình."
                    },
                    {
                        "en": "schedule somebody/something to do something I'm scheduled to arrive in LA at 5 o'clock.",
                        "vi": "lên lịch cho ai đó / việc gì đó để làm việc gì đó Tôi dự kiến đến LA lúc 5 giờ."
                    },
                    {
                        "en": "The talks were originally scheduled to begin in May.",
                        "vi": "Các cuộc đàm phán ban đầu dự kiến bắt đầu vào tháng Năm."
                    },
                    {
                        "en": "The store is scheduled to open on Friday.",
                        "vi": "Cửa hàng dự kiến mở cửa vào thứ Sáu."
                    },
                    {
                        "en": "She is not scheduled to meet with any government officials during her trip.",
                        "vi": "Cô ấy không có kế hoạch gặp bất kỳ quan chức chính phủ nào trong chuyến đi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to include something in an official list of things",
                    "vi": "bao gồm một cái gì đó trong một danh sách chính thức của những thứ"
                },
                "examples": [
                    {
                        "en": "The substance has been scheduled as a poison.",
                        "vi": "Chất này đã được lên lịch như một chất độc."
                    }
                ]
            }
        ]
    },
    {
        "id": "d87fa85d8e0a4205abdb29218e61cb96",
        "word": "acquisition",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌækwɪˈzɪʃn/",
            "us": "/ˌækwɪˈzɪʃn/"
        },
        "nearby": [
            {
                "word": "acquire",
                "pos": "verb"
            },
            {
                "word": "acquired characteristic",
                "pos": "noun"
            },
            {
                "word": "acquisition",
                "pos": "noun"
            },
            {
                "word": "acquisitive",
                "pos": "adjective"
            },
            {
                "word": "acquisitiveness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of getting something, especially knowledge, a skill, etc.",
                    "vi": "hành động nhận được một cái gì đó, đặc biệt là kiến thức, một kỹ năng, v.v."
                },
                "examples": [
                    {
                        "en": "theories of child language acquisition",
                        "vi": "lý thuyết về tiếp thu ngôn ngữ trẻ em"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that somebody buys to add to what they already own, usually something valuable",
                    "vi": "thứ mà ai đó mua để thêm vào thứ họ đã sở hữu, thường là thứ có giá trị"
                },
                "examples": [
                    {
                        "en": "His latest acquisition is a racehorse.",
                        "vi": "Mua lại mới nhất của anh ấy là một con ngựa đua."
                    },
                    {
                        "en": "The money will be spent on acquisitions for the university library.",
                        "vi": "Số tiền sẽ được chi cho việc mua lại thư viện trường đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company, piece of land, etc. bought by somebody, especially another company; the act of buying it",
                    "vi": "một công ty, một mảnh đất, vv được mua bởi một người nào đó, đặc biệt là một công ty khác; hành động mua nó"
                },
                "examples": [
                    {
                        "en": "They have made acquisitions in several EU countries.",
                        "vi": "Họ đã thực hiện mua lại ở một số quốc gia EU."
                    },
                    {
                        "en": "the acquisition of shares by employees",
                        "vi": "việc mua lại cổ phần của nhân viên"
                    },
                    {
                        "en": "The group has announced its first overseas acquisition: a successful software company.",
                        "vi": "Tập đoàn đã công bố thương vụ mua lại đầu tiên ở nước ngoài: một công ty phần mềm thành công."
                    },
                    {
                        "en": "The company has just made another acquisition.",
                        "vi": "Công ty vừa thực hiện một vụ mua lại khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "845bc1760e8948dc875ccdc8791216ec",
        "word": "bargaining power",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɑːɡənɪŋ paʊə(r)/",
            "us": "/ˈbɑːrɡənɪŋ paʊər/"
        },
        "nearby": [
            {
                "word": "bargaining",
                "pos": "noun"
            },
            {
                "word": "bargaining chip",
                "pos": "noun"
            },
            {
                "word": "bargaining power",
                "pos": "noun"
            },
            {
                "word": "bargain on",
                "pos": "phrasal verb"
            },
            {
                "word": "barge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of control a person or group has when trying to reach an agreement with another group in a business or political situation",
                    "vi": "mức độ kiểm soát của một người hoặc một nhóm khi cố gắng đạt được thỏa thuận với một nhóm khác trong một tình huống kinh doanh hoặc chính trị"
                },
                "examples": [
                    {
                        "en": "The smaller states’ efforts to exercise their collective bargaining power against multinationals have failed.",
                        "vi": "Các nỗ lực của các quốc gia nhỏ hơn để thực hiện quyền thương lượng tập thể của họ chống lại các công ty đa quốc gia đã thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "d78b68ca4dda4b7d86e43c03feac5e9d",
        "word": "close",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kləʊz/",
            "us": "/kləʊz/"
        },
        "nearby": [
            {
                "word": "clonk",
                "pos": "noun"
            },
            {
                "word": "clonk",
                "pos": "verb"
            },
            {
                "word": "close1",
                "pos": "verb"
            },
            {
                "word": "close1",
                "pos": "noun"
            },
            {
                "word": "close2",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put something into a position so that it covers an opening; to get into this position",
                    "vi": "để đặt một cái gì đó vào một vị trí để nó che một lỗ hổng; để có được vị trí này"
                },
                "examples": [
                    {
                        "en": "He closed the door firmly.",
                        "vi": "Anh đóng chặt cửa lại."
                    },
                    {
                        "en": "Would anyone mind if I closed the window?",
                        "vi": "Có ai phiền nếu tôi đóng cửa sổ không?"
                    },
                    {
                        "en": "She closed the gate behind her.",
                        "vi": "Cô đóng cổng sau lưng."
                    },
                    {
                        "en": "It's dark now—let's close the curtains.",
                        "vi": "Bây giờ trời đã tối - hãy đóng rèm lại."
                    },
                    {
                        "en": "I closed my eyes against the bright light.",
                        "vi": "Tôi nhắm mắt trước ánh sáng rực rỡ."
                    },
                    {
                        "en": "The doors open and close automatically.",
                        "vi": "Cửa đóng mở tự động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move the parts of something together so that it is no longer open",
                    "vi": "để di chuyển các bộ phận của một thứ gì đó lại với nhau để nó không còn mở nữa"
                },
                "examples": [
                    {
                        "en": "to close a book/an umbrella",
                        "vi": "đóng một cuốn sách / một chiếc ô"
                    },
                    {
                        "en": "He ate greedily, without closing his mouth.",
                        "vi": "Nó ăn một cách thèm thuồng, không ngậm được miệng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the work of a shop, etc. stop for a period of time; to not be open for people to use",
                    "vi": "để làm cho công việc của một cửa hàng, vv dừng lại trong một khoảng thời gian; không được mở cho mọi người sử dụng"
                },
                "examples": [
                    {
                        "en": "be closed The school was closed because of the heavy snow.",
                        "vi": "đóng cửa Trường đã đóng cửa vì tuyết rơi dày."
                    },
                    {
                        "en": "be closed for something The museum has been closed for renovation.",
                        "vi": "bị đóng cửa vì điều gì đó Bảo tàng đã được đóng cửa để cải tạo."
                    },
                    {
                        "en": "be closed to somebody/something The road was closed to traffic for two days.",
                        "vi": "bị đóng cửa với ai đó / cái gì đó Con đường bị đóng cửa không cho xe cộ qua lại trong hai ngày."
                    },
                    {
                        "en": "The castle has been closed to visitors because of the royal wedding.",
                        "vi": "Lâu đài đã bị đóng cửa không cho du khách tham quan vì đám cưới hoàng gia."
                    },
                    {
                        "en": "What time does the bank close?",
                        "vi": "Ngân hàng đóng cửa lúc mấy giờ?"
                    },
                    {
                        "en": "close for something We close for lunch between twelve and two.",
                        "vi": "đóng cửa cho một cái gì đó Chúng tôi đóng cửa cho bữa trưa từ mười hai giờ đến hai giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a company, shop, etc. closes, or if you close it, it stops operating as a business",
                    "vi": "nếu một công ty, cửa hàng, v.v. đóng cửa hoặc nếu bạn đóng cửa, nó sẽ ngừng hoạt động như một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "The hospital closed at the end of last year.",
                        "vi": "Bệnh viện đóng cửa vào cuối năm ngoái."
                    },
                    {
                        "en": "The play closed after just three nights.",
                        "vi": "Vở kịch khép lại chỉ sau ba đêm."
                    },
                    {
                        "en": "close something The club was closed by the police.",
                        "vi": "đóng cửa một cái gì đó Câu lạc bộ đã bị cảnh sát đóng cửa."
                    },
                    {
                        "en": "All the steelworks around here were closed down in the 1980s.",
                        "vi": "Tất cả các nhà máy thép xung quanh đây đã bị đóng cửa vào những năm 1980."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end or make something end",
                    "vi": "kết thúc hoặc kết thúc điều gì đó"
                },
                "examples": [
                    {
                        "en": "The meeting will close at 10.00 p.m.",
                        "vi": "Cuộc họp sẽ kết thúc lúc 10 giờ tối"
                    },
                    {
                        "en": "The offer closes at the end of the week.",
                        "vi": "Ưu đãi kết thúc vào cuối tuần."
                    },
                    {
                        "en": "I will close with a few words about future events.",
                        "vi": "Tôi sẽ kết thúc bằng một vài từ về các sự kiện trong tương lai."
                    },
                    {
                        "en": "close something to close a meeting/debate",
                        "vi": "đóng một cái gì đó để kết thúc một cuộc họp / cuộc tranh luận"
                    },
                    {
                        "en": "to close a case/an investigation",
                        "vi": "đóng một vụ án / một cuộc điều tra"
                    },
                    {
                        "en": "to close an account (= to stop keeping money in a bank account)",
                        "vi": "đóng tài khoản (= ngừng giữ tiền trong tài khoản ngân hàng)"
                    },
                    {
                        "en": "The subject is now closed (= we will not discuss it again).",
                        "vi": "Chủ đề hiện đã bị đóng (= chúng ta sẽ không thảo luận lại)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange and settle a business deal",
                    "vi": "sắp xếp và giải quyết một giao dịch kinh doanh"
                },
                "examples": [
                    {
                        "en": "Right now we are trying to close the deal with our sponsors.",
                        "vi": "Hiện tại, chúng tôi đang cố gắng hoàn tất thỏa thuận với các nhà tài trợ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put an end to a mistake in something that causes a security risk or gives somebody an unfair advantage",
                    "vi": "để chấm dứt một sai lầm trong một cái gì đó gây ra rủi ro bảo mật hoặc mang lại cho ai đó một lợi thế không công bằng"
                },
                "examples": [
                    {
                        "en": "The company acted quickly to close a security hole in its online systems.",
                        "vi": "Công ty đã hành động nhanh chóng để đóng một lỗ hổng bảo mật trong các hệ thống trực tuyến của mình."
                    },
                    {
                        "en": "Congressional leaders have agreed to close a loophole that gave small businesses a big tax break for buying SUVs.",
                        "vi": "Các nhà lãnh đạo Quốc hội đã đồng ý đóng một lỗ hổng khiến các doanh nghiệp nhỏ được giảm thuế lớn khi mua xe SUV."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop using a computer program or file and put it away",
                    "vi": "ngừng sử dụng một chương trình hoặc tệp máy tính và bỏ nó đi"
                },
                "examples": [
                    {
                        "en": "Once I got a few apps closed, it started working again.",
                        "vi": "Sau khi tôi đóng một vài ứng dụng, nó bắt đầu hoạt động trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be worth a particular amount at the end of the day’s business",
                    "vi": "có giá trị bằng một số tiền cụ thể vào cuối ngày của công việc kinh doanh"
                },
                "examples": [
                    {
                        "en": "Shares in the company closed at 265p.",
                        "vi": "Cổ phiếu của công ty đóng cửa lúc 265p."
                    },
                    {
                        "en": "closing prices",
                        "vi": "chốt giá"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the distance or difference between two people or things smaller; to become smaller or narrower",
                    "vi": "để làm cho khoảng cách hoặc sự khác biệt giữa hai người hoặc mọi thứ nhỏ lại; trở nên nhỏ hơn hoặc hẹp hơn"
                },
                "examples": [
                    {
                        "en": "These measures are aimed at closing the gap between rich and poor.",
                        "vi": "Các biện pháp này nhằm thu hẹp khoảng cách giàu nghèo."
                    },
                    {
                        "en": "The gap between the two top teams is closing all the time.",
                        "vi": "Khoảng cách giữa hai đội đầu bảng đang ngày càng thu hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover somebody/something and hold them/it, or to make something do this",
                    "vi": "để che ai đó / cái gì đó và giữ họ / nó, hoặc để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "She closed her hand over his.",
                        "vi": "Cô khép bàn tay của mình trên tay anh."
                    },
                    {
                        "en": "Her hand closed over his.",
                        "vi": "Bàn tay cô đặt trên tay anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an electrical circuit continuous",
                    "vi": "để làm cho một mạch điện liên tục"
                },
                "examples": [
                    {
                        "en": "When a finger touches the panel, it closes the circuit.",
                        "vi": "Khi một ngón tay chạm vào bảng điều khiển, nó sẽ đóng mạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something because you no longer believe you will be successful or will find a solution",
                    "vi": "ngừng làm điều gì đó bởi vì bạn không còn tin rằng mình sẽ thành công hoặc sẽ tìm ra giải pháp"
                },
                "examples": [
                    {
                        "en": "The police have closed the book on the case (= they have stopped trying to solve it).",
                        "vi": "Cảnh sát đã đóng sổ về vụ án (= họ đã ngừng cố gắng giải quyết nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it unlikely that something will happen",
                    "vi": "để làm cho nó không chắc rằng một cái gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "She was careful not to close the door on the possibility of further talks.",
                        "vi": "Cô ấy đã cẩn thận không đóng cửa về khả năng có những cuộc nói chuyện tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop trading",
                    "vi": "ngừng giao dịch"
                },
                "examples": [
                    {
                        "en": "The factory closed its doors for the last time in 2009.",
                        "vi": "Nhà máy đóng cửa lần cuối vào năm 2009."
                    },
                    {
                        "en": "The company closed shop and left the US last year.",
                        "vi": "Công ty đã đóng cửa hàng và rời Mỹ vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to think about something as a possibility",
                    "vi": "từ chối nghĩ về điều gì đó như một khả năng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a group of people close ranks, they work closely together to defend themselves, especially when they are being criticized",
                    "vi": "nếu một nhóm người gần gũi với nhau, họ hợp tác chặt chẽ với nhau để bảo vệ mình, đặc biệt là khi họ đang bị chỉ trích"
                },
                "examples": [
                    {
                        "en": "It's not unusual for the police to close ranks when one of their officers is being investigated.",
                        "vi": "Không có gì lạ khi cảnh sát đóng quân khi một trong những sĩ quan của họ đang bị điều tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "if soldiers close ranks, they move closer together in order to defend themselves",
                    "vi": "nếu binh lính đóng hàng ngũ, họ tiến lại gần nhau hơn để tự vệ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to listen to something",
                    "vi": "từ chối nghe một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She decided to shut her ears to all the rumours.",
                        "vi": "Cô quyết định bịt tai trước mọi tin đồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend that you have not noticed something so that you do not have to deal with it",
                    "vi": "giả vờ rằng bạn không nhận thấy điều gì đó để bạn không phải đối phó với nó"
                },
                "examples": [
                    {
                        "en": "You can't just close your eyes to his violence.",
                        "vi": "Bạn không thể chỉ nhắm mắt làm ngơ trước sự bạo hành của anh ta."
                    },
                    {
                        "en": "They seem intent on shutting their eyes to the problems of pollution.",
                        "vi": "Họ dường như có ý định nhắm mắt vào các vấn đề ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "very easily, without thinking about it",
                    "vi": "rất dễ dàng, không cần suy nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "I've made this trip so often, I could do it with my eyes shut.",
                        "vi": "Tôi đã thực hiện chuyến đi này thường xuyên, tôi có thể làm điều đó với đôi mắt của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b452f5c4989b40b3924d95dc63eee187",
        "word": "dealing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdiːlɪŋ/",
            "us": "/ˈdiːlɪŋ/"
        },
        "nearby": [
            {
                "word": "dealership",
                "pos": "noun"
            },
            {
                "word": "deal in",
                "pos": "phrasal verb"
            },
            {
                "word": "dealing",
                "pos": "noun"
            },
            {
                "word": "dealmaker",
                "pos": "noun"
            },
            {
                "word": "deal out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "business activities; the relations that you have with somebody in business",
                    "vi": "các hoạt động kinh doanh; mối quan hệ mà bạn có với ai đó trong kinh doanh"
                },
                "examples": [
                    {
                        "en": "I knew nothing of his business dealings.",
                        "vi": "Tôi không biết gì về các giao dịch kinh doanh của anh ấy."
                    },
                    {
                        "en": "dealings with somebody/something Have you had any previous dealings with this company?",
                        "vi": "giao dịch với ai đó / điều gì đó Bạn đã có bất kỳ giao dịch nào trước đây với công ty này chưa?"
                    },
                    {
                        "en": "She has always been very polite in her dealings with me.",
                        "vi": "Cô ấy luôn rất lịch sự trong cách cư xử với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of doing business with somebody",
                    "vi": "một cách kinh doanh với ai đó"
                },
                "examples": [
                    {
                        "en": "a reputation for fair/honest dealing",
                        "vi": "danh tiếng về giao dịch công bằng / trung thực"
                    }
                ]
            },
            {
                "define": {
                    "en": "buying and selling",
                    "vi": "mua và bán"
                },
                "examples": [
                    {
                        "en": "drug dealing",
                        "vi": "buôn bán ma túy"
                    },
                    {
                        "en": "dealings in shares",
                        "vi": "giao dịch cổ phiếu"
                    }
                ]
            }
        ]
    },
    {
        "id": "5349d63be3a444bb903d8b5f2889eca3",
        "word": "merge",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/mɜːdʒ/",
            "us": "/mɜːrdʒ/"
        },
        "nearby": [
            {
                "word": "merengue",
                "pos": "noun"
            },
            {
                "word": "meretricious",
                "pos": "adjective"
            },
            {
                "word": "merge",
                "pos": "verb"
            },
            {
                "word": "merger",
                "pos": "noun"
            },
            {
                "word": "meridian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to combine or make two or more things combine to form a single thing",
                    "vi": "để kết hợp hoặc làm cho hai hoặc nhiều thứ kết hợp để tạo thành một thứ duy nhất"
                },
                "examples": [
                    {
                        "en": "The banks are set to merge next year.",
                        "vi": "Các ngân hàng sẽ hợp nhất vào năm tới."
                    },
                    {
                        "en": "The two groups have merged to form a new party.",
                        "vi": "Hai nhóm đã hợp nhất để thành lập một đảng mới."
                    },
                    {
                        "en": "merge with something His department will merge with mine.",
                        "vi": "hợp nhất với một cái gì đó Bộ phận của anh ấy sẽ hợp nhất với của tôi."
                    },
                    {
                        "en": "merge into something The villages expanded and merged into one large town.",
                        "vi": "hợp nhất thành một cái gì đó Các làng mở rộng và hợp nhất thành một thị trấn lớn."
                    },
                    {
                        "en": "merge (A and B) (together) Fact and fiction merge together in his latest thriller.",
                        "vi": "hợp nhất (A và B) (cùng nhau) Sự thật và hư cấu hợp nhất với nhau trong bộ phim kinh dị mới nhất của anh ấy."
                    },
                    {
                        "en": "merge A with B His department will be merged with mine.",
                        "vi": "hợp nhất A với B Bộ phận của anh ấy sẽ được hợp nhất với của tôi."
                    },
                    {
                        "en": "merge something The company was formed by merging three smaller firms.",
                        "vi": "hợp nhất một cái gì đó Công ty được thành lập bằng cách hợp nhất ba công ty nhỏ hơn."
                    },
                    {
                        "en": "merge something into something Merge multiple text files into one master file.",
                        "vi": "hợp nhất một cái gì đó thành một cái gì đó Hợp nhất nhiều tệp văn bản thành một tệp chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two things merge, or if one thing merges into another, the differences between them gradually disappear so that it is impossible to separate them",
                    "vi": "nếu hai thứ hợp nhất, hoặc nếu một thứ hòa vào một thứ khác, thì sự khác biệt giữa chúng dần dần biến mất đến mức không thể tách chúng ra được"
                },
                "examples": [
                    {
                        "en": "The hills merged into the dark sky behind them.",
                        "vi": "Những ngọn đồi hòa vào bầu trời đen tối phía sau họ."
                    },
                    {
                        "en": "The figures gradually merged into the darkness.",
                        "vi": "Những bóng hình dần hòa vào bóng tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave quietly when you are with a group of people so that they do not notice you",
                    "vi": "cư xử nhẹ nhàng khi bạn ở với một nhóm người để họ không chú ý đến bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4325d32159ce40f88f2a343aba7c9c5b",
        "word": "merger",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɜːdʒə(r)/",
            "us": "/ˈmɜːrdʒər/"
        },
        "nearby": [
            {
                "word": "meretricious",
                "pos": "adjective"
            },
            {
                "word": "merge",
                "pos": "verb"
            },
            {
                "word": "merger",
                "pos": "noun"
            },
            {
                "word": "meridian",
                "pos": "noun"
            },
            {
                "word": "meringue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of joining two or more organizations or businesses into one",
                    "vi": "hành động tham gia hai hoặc nhiều tổ chức hoặc doanh nghiệp thành một"
                },
                "examples": [
                    {
                        "en": "If the merger goes through, thousands of jobs will be lost.",
                        "vi": "Nếu việc sáp nhập diễn ra, hàng nghìn công việc sẽ bị mất."
                    },
                    {
                        "en": "merger between/of A and B a merger between the two banks",
                        "vi": "sự hợp nhất giữa / của A và B sự hợp nhất giữa hai ngân hàng"
                    },
                    {
                        "en": "merger with something our proposed merger with the university",
                        "vi": "sáp nhập với một cái gì đó mà chúng tôi đề xuất sáp nhập với trường đại học"
                    },
                    {
                        "en": "There are local companies ripe for merger or acquisition.",
                        "vi": "Có những công ty địa phương đã chín muồi để sáp nhập hoặc mua lại."
                    }
                ]
            }
        ]
    },
    {
        "id": "1e97425dd12f4465b81ca4fa6bc3ace5",
        "word": "on the market",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɑːkɪt/",
            "us": "/ˈmɑːrkɪt/"
        },
        "nearby": [
            {
                "word": "markedly",
                "pos": "adverb"
            },
            {
                "word": "marker",
                "pos": "noun"
            },
            {
                "word": "market",
                "pos": "noun"
            },
            {
                "word": "market",
                "pos": "verb"
            },
            {
                "word": "marketability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people buy and sell goods; the open area or building where they meet to do this",
                    "vi": "một dịp mà mọi người mua và bán hàng hóa; khu vực mở hoặc tòa nhà nơi họ gặp nhau để làm điều này"
                },
                "examples": [
                    {
                        "en": "a fruit/flower/fish market",
                        "vi": "chợ trái cây / hoa / cá"
                    },
                    {
                        "en": "an antiques market",
                        "vi": "chợ đồ cổ"
                    },
                    {
                        "en": "an indoor/a street market",
                        "vi": "chợ trong nhà / chợ đường phố"
                    },
                    {
                        "en": "market stalls/traders",
                        "vi": "quầy hàng / thương nhân trong chợ"
                    },
                    {
                        "en": "at the market We buy our fruit and vegetables at the market.",
                        "vi": "ở chợ Chúng tôi mua trái cây và rau của chúng tôi ở chợ."
                    },
                    {
                        "en": "Thursday is market day.",
                        "vi": "Thứ năm là ngày họp chợ."
                    }
                ]
            },
            {
                "define": {
                    "en": "business or trade, or the amount of trade in a particular type of goods",
                    "vi": "kinh doanh hoặc buôn bán, hoặc số lượng buôn bán một loại hàng hóa cụ thể"
                },
                "examples": [
                    {
                        "en": "the world market in coffee",
                        "vi": "thị trường cà phê thế giới"
                    },
                    {
                        "en": "They have increased their share of the market by 10 per cent.",
                        "vi": "Họ đã tăng thị phần của mình lên 10%."
                    },
                    {
                        "en": "The firm will expand its size to claim more market share.",
                        "vi": "Công ty sẽ mở rộng quy mô để giành thêm thị phần."
                    },
                    {
                        "en": "the property/housing/job market (= the number and type of houses, jobs, etc. that are available)",
                        "vi": "thị trường bất động sản / nhà ở / việc làm (= số lượng và loại nhà, công việc, v.v. có sẵn)"
                    },
                    {
                        "en": "They have cornered the market in sportswear (= sell the most).",
                        "vi": "Họ đã lũng đoạn thị trường quần áo thể thao (= bán được nhiều nhất)."
                    },
                    {
                        "en": "New companies have entered the market.",
                        "vi": "Các công ty mới đã tham gia vào thị trường."
                    },
                    {
                        "en": "The big players still dominate the market.",
                        "vi": "Các công ty lớn vẫn chiếm ưu thế trên thị trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area, country or section of the population that might buy goods",
                    "vi": "một khu vực, quốc gia hoặc bộ phận dân cư cụ thể có thể mua hàng hóa"
                },
                "examples": [
                    {
                        "en": "The Chinese market has opened up recently.",
                        "vi": "Thị trường Trung Quốc đã mở cửa gần đây."
                    },
                    {
                        "en": "Expansion into the global market brings more risk.",
                        "vi": "Mở rộng ra thị trường toàn cầu mang lại nhiều rủi ro hơn."
                    },
                    {
                        "en": "They supply beef to the domestic market.",
                        "vi": "Họ cung cấp thịt bò cho thị trường nội địa."
                    },
                    {
                        "en": "The young, health-conscious female consumer is our target market.",
                        "vi": "Khách hàng nữ trẻ tuổi, quan tâm đến sức khỏe là thị trường mục tiêu của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of people who want to buy something",
                    "vi": "số lượng người muốn mua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a growing/declining market for second-hand cars",
                        "vi": "thị trường ô tô cũ đang phát triển / suy giảm"
                    },
                    {
                        "en": "There's not much of a market for tourist art on the island.",
                        "vi": "Không có nhiều thị trường cho nghệ thuật du lịch trên đảo."
                    },
                    {
                        "en": "New Zealand is competing in an international market for medical graduates.",
                        "vi": "New Zealand đang cạnh tranh trên thị trường quốc tế dành cho sinh viên tốt nghiệp y khoa."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who buy and sell goods in competition with each other",
                    "vi": "những người mua và bán hàng hóa cạnh tranh với nhau"
                },
                "examples": [
                    {
                        "en": "The market will decide if the TV station has any future.",
                        "vi": "Thị trường sẽ quyết định xem đài truyền hình có tương lai hay không."
                    },
                    {
                        "en": "a market-based/market-led/market-driven economy",
                        "vi": "một nền kinh tế dựa trên thị trường / dẫn dắt thị trường / định hướng thị trường"
                    },
                    {
                        "en": "innovative products at the forefront of market trends",
                        "vi": "sản phẩm sáng tạo đi đầu xu hướng thị trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the business of buying and selling shares in companies and the place where this happens; a stock exchange",
                    "vi": "việc kinh doanh mua và bán cổ phần trong các công ty và nơi xảy ra việc này; một sàn giao dịch chứng khoán"
                },
                "examples": [
                    {
                        "en": "the futures market",
                        "vi": "thị trường tương lai"
                    },
                    {
                        "en": "a market crash",
                        "vi": "một sự sụp đổ của thị trường"
                    },
                    {
                        "en": "The market closed weaker.",
                        "vi": "Thị trường đóng cửa yếu hơn."
                    },
                    {
                        "en": "The markets reacted quickly to the negative publicity.",
                        "vi": "Các thị trường đã phản ứng nhanh chóng với những dư luận tiêu cực."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which there is a lot of a particular item for sale, so that prices are low and people buying have a choice",
                    "vi": "một tình huống trong đó có rất nhiều một mặt hàng cụ thể để bán, do đó giá thấp và người mua có quyền lựa chọn"
                },
                "examples": [
                    {
                        "en": "In a buyer's market, the commodity is plentiful and so its price is not high.",
                        "vi": "Trong thị trường của người mua, hàng hóa rất phong phú và do đó giá của nó không cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "interested in buying something",
                    "vi": "quan tâm đến việc mua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm not in the market for a new car at the moment.",
                        "vi": "Tôi không muốn mua xe mới vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "available for people to buy",
                    "vi": "có sẵn để mọi người mua"
                },
                "examples": [
                    {
                        "en": "to put your house on the market",
                        "vi": "đưa ngôi nhà của bạn ra thị trường"
                    },
                    {
                        "en": "The house came on the market last year.",
                        "vi": "Ngôi nhà được tung ra thị trường vào năm ngoái."
                    },
                    {
                        "en": "There are hundreds of different brands on the market.",
                        "vi": "Trên thị trường có hàng trăm nhãn hiệu khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "available to buy without any limits",
                    "vi": "có sẵn để mua mà không có bất kỳ giới hạn nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to buy and sell stocks and shares in order to make a profit",
                    "vi": "mua và bán cổ phiếu và cổ phiếu để kiếm lợi nhuận"
                },
                "examples": [
                    {
                        "en": "He is a skilled investor who knows how to play the market—and win.",
                        "vi": "Anh ấy là một nhà đầu tư lành nghề, người biết cách chơi thị trường và giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to charge such a high price for your goods, services, etc. that nobody wants to buy them",
                    "vi": "tính giá hàng hóa, dịch vụ của bạn, v.v. cao đến mức không ai muốn mua chúng"
                },
                "examples": [
                    {
                        "en": "Some leading UK firms are pricing themselves out of the market.",
                        "vi": "Một số công ty hàng đầu của Vương quốc Anh đang định giá mình ngoài thị trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people selling something have an advantage, because there is not a lot of a particular item for sale, and prices can be kept high",
                    "vi": "tình huống trong đó những người bán thứ gì đó có lợi thế hơn, vì không có nhiều mặt hàng cụ thể để bán và giá có thể được giữ ở mức cao"
                },
                "examples": [
                    {
                        "en": "In a seller’s market, demand exceeds supply, and prices are high.",
                        "vi": "Trong thị trường của người bán, cầu vượt quá cung và giá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop something from being sold",
                    "vi": "để ngăn một cái gì đó được bán"
                },
                "examples": [
                    {
                        "en": "The slimming pills were taken off the market.",
                        "vi": "Thuốc giảm béo đã được bán trên thị trường."
                    },
                    {
                        "en": "Thousands of egg products were taken off the shelves following the health scare.",
                        "vi": "Hàng nghìn sản phẩm trứng đã được đưa ra khỏi kệ hàng sau sự lo ngại về sức khỏe."
                    }
                ]
            }
        ]
    },
    {
        "id": "f26c2fe5016b4f0fa80bf2f8531203d0",
        "word": "take over",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "take out of",
                "pos": "phrasal verb"
            },
            {
                "word": "take out of himself/herself",
                "pos": "phrasal verb"
            },
            {
                "word": "take over",
                "pos": "phrasal verb"
            },
            {
                "word": "takeover",
                "pos": "noun"
            },
            {
                "word": "taker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become bigger or more important than something else; to replace something",
                    "vi": "trở nên lớn hơn hoặc quan trọng hơn một thứ khác; để thay thế một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Try not to let negative thoughts take over.",
                        "vi": "Cố gắng đừng để những suy nghĩ tiêu cực lấn át."
                    },
                    {
                        "en": "It has been suggested that mammals took over from dinosaurs 65 million years ago.",
                        "vi": "Có ý kiến cho rằng động vật có vú đã tiếp quản khủng long cách đây 65 triệu năm."
                    },
                    {
                        "en": "In your teens, peer-group friendships may take over from parents as the major influence on you.",
                        "vi": "Ở tuổi thiếu niên, tình bạn cùng nhóm có thể tiếp nhận từ cha mẹ vì ảnh hưởng chính đến bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have control of or responsibility for something, especially in place of somebody else",
                    "vi": "bắt đầu có quyền kiểm soát hoặc trách nhiệm đối với một cái gì đó, đặc biệt là thay cho người khác"
                },
                "examples": [
                    {
                        "en": "Paul's daughter took over the job in 2017.",
                        "vi": "Con gái của Paul đã tiếp quản công việc này vào năm 2017."
                    },
                    {
                        "en": "Gerald Ford took over the presidency after Nixon resigned.",
                        "vi": "Gerald Ford lên nắm quyền tổng thống sau khi Nixon từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gain control of a political party, a country, etc.",
                    "vi": "để giành quyền kiểm soát một đảng chính trị, một quốc gia, v.v."
                },
                "examples": [
                    {
                        "en": "The army is threatening to take over if civil unrest continues.",
                        "vi": "Quân đội đang đe dọa sẽ tiếp quản nếu tình trạng bất ổn dân sự tiếp tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gain control of a business, a company, etc., especially by buying shares",
                    "vi": "để giành quyền kiểm soát một doanh nghiệp, một công ty, v.v., đặc biệt là bằng cách mua cổ phiếu"
                },
                "examples": [
                    {
                        "en": "CBS Records was taken over by Sony.",
                        "vi": "CBS Records do Sony tiếp quản."
                    }
                ]
            }
        ]
    },
    {
        "id": "7756ff9712524ad29a1d04ae9aa80304",
        "word": "bring something to the party/table",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈteɪbl/",
            "us": "/ˈteɪbl/"
        },
        "nearby": [
            {
                "word": "tabla",
                "pos": "noun"
            },
            {
                "word": "tablature",
                "pos": "noun"
            },
            {
                "word": "table",
                "pos": "noun"
            },
            {
                "word": "table",
                "pos": "verb"
            },
            {
                "word": "tableau",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of furniture that consists of a flat top supported by legs",
                    "vi": "một món đồ nội thất bao gồm một mặt phẳng được hỗ trợ bởi chân"
                },
                "examples": [
                    {
                        "en": "at a/the table We sat at a round table in the corner.",
                        "vi": "tại a / the table Chúng tôi ngồi ở một chiếc bàn tròn trong góc."
                    },
                    {
                        "en": "around/round a/the table They were sitting around the kitchen table.",
                        "vi": "around / round a / the table Họ đang ngồi quanh bàn bếp."
                    },
                    {
                        "en": "She took a seat at the end of the table.",
                        "vi": "Cô ngồi vào cuối bàn."
                    },
                    {
                        "en": "My father always sits at the head of the table.",
                        "vi": "Bố tôi luôn ngồi đầu bàn."
                    },
                    {
                        "en": "A table for two, please (= in a restaurant).",
                        "vi": "Vui lòng cho một bàn cho hai người (= trong nhà hàng)."
                    },
                    {
                        "en": "I'd like to book a table for dinner tonight (= in a restaurant)",
                        "vi": "Tôi muốn đặt bàn cho bữa tối tối nay (= trong một nhà hàng)"
                    },
                    {
                        "en": "to set the table",
                        "vi": "đặt bàn ăn"
                    },
                    {
                        "en": "(British English also) to lay the table (= to put the plates, knives, etc. on it for a meal)",
                        "vi": "(Anh Anh cũng vậy) để đặt bàn (= đặt đĩa, dao, v.v. lên đó cho bữa ăn)"
                    },
                    {
                        "en": "to clear the table (= take away the dirty plates, etc. at the end of a meal)",
                        "vi": "dọn dẹp bàn ăn (= lấy đi đĩa bẩn, v.v. khi kết thúc bữa ăn)"
                    },
                    {
                        "en": "He questioned her next morning over the breakfast table (= during breakfast).",
                        "vi": "Anh ta chất vấn cô vào sáng hôm sau trên bàn ăn sáng (= trong bữa sáng)."
                    },
                    {
                        "en": "a pool/billiard/snooker table",
                        "vi": "bàn bida / bida / bi da"
                    }
                ]
            },
            {
                "define": {
                    "en": "the people sitting at a table for a meal or to play cards, etc.",
                    "vi": "những người ngồi trong bàn ăn hoặc chơi bài, v.v."
                },
                "examples": [
                    {
                        "en": "He kept the whole table entertained with his jokes.",
                        "vi": "Anh ấy giữ cho cả bàn giải trí bằng những câu chuyện cười của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of facts or numbers arranged in a special order, usually in rows and columns",
                    "vi": "danh sách các dữ kiện hoặc số được sắp xếp theo một thứ tự đặc biệt, thường là theo hàng và cột"
                },
                "examples": [
                    {
                        "en": "a table of contents (= a list of the main points or information in a book, usually at the front of the book)",
                        "vi": "mục lục (= danh sách các điểm chính hoặc thông tin trong sách, thường ở đầu sách)"
                    },
                    {
                        "en": "The table below shows how prices have changed over the past 20 years.",
                        "vi": "Bảng dưới đây cho thấy giá cả đã thay đổi như thế nào trong 20 năm qua."
                    },
                    {
                        "en": "in a/the table He showed the price fluctuations in a statistical table.",
                        "vi": "in a / the table Anh ta chỉ ra sự biến động giá cả trong một bảng thống kê."
                    },
                    {
                        "en": "See Table XII for population figures.",
                        "vi": "Xem Bảng XII về số liệu dân số."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of sports teams, countries, schools, etc. that shows their position in a competition, etc.",
                    "vi": "danh sách các đội thể thao, quốc gia, trường học, v.v. thể hiện vị trí của họ trong một cuộc thi, v.v."
                },
                "examples": [
                    {
                        "en": "If Arsenal win this game they'll go to the top of the table.",
                        "vi": "Nếu Arsenal thắng trận này, họ sẽ đi đầu bảng."
                    },
                    {
                        "en": "the bottom of the table",
                        "vi": "cuối bảng"
                    },
                    {
                        "en": "in a/the table United are second in the table.",
                        "vi": "in a / the table United đứng thứ hai trong bảng."
                    },
                    {
                        "en": "The team will be lucky to finish the season mid-table.",
                        "vi": "Đội sẽ may mắn kết thúc mùa giải giữa bảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list showing the results when a number is multiplied by a set of other numbers, especially 1 to 12, in turn",
                    "vi": "danh sách hiển thị kết quả khi một số được nhân với một tập hợp các số khác, đặc biệt là từ 1 đến 12, lần lượt"
                },
                "examples": [
                    {
                        "en": "Do you know your six times table?",
                        "vi": "Bạn có biết bảng sáu lần của bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to contribute something useful to a discussion, project, etc.",
                    "vi": "để đóng góp một cái gì đó hữu ích cho một cuộc thảo luận, dự án, v.v."
                },
                "examples": [
                    {
                        "en": "What Hislop brought to the table was real commitment and energy.",
                        "vi": "Những gì Hislop mang lại là sự cam kết và năng lượng thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join formal discussions about something",
                    "vi": "tham gia các cuộc thảo luận chính thức về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Different countries come to the table with differing expectations about what they can achieve.",
                        "vi": "Các quốc gia khác nhau thảo luận với những kỳ vọng khác nhau về những gì họ có thể đạt được."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drink more alcohol than somebody else without becoming as drunk as they are",
                    "vi": "uống nhiều rượu hơn người khác mà không say như họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody honestly what your plans, ideas, etc. are",
                    "vi": "để nói với ai đó một cách trung thực kế hoạch, ý tưởng, v.v. của bạn là gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a topic is off the table at a formal discussion, people are not willing or allowed to discuss it",
                    "vi": "nếu một chủ đề không được bàn trong một cuộc thảo luận chính thức, mọi người không sẵn sàng hoặc không được phép thảo luận về nó"
                },
                "examples": [
                    {
                        "en": "Some issues were so controversial they were taken off the table.",
                        "vi": "Một số vấn đề gây tranh cãi nên không cần bàn cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "offered to people so that they can consider or discuss it",
                    "vi": "được cung cấp cho mọi người để họ có thể xem xét hoặc thảo luận về nó"
                },
                "examples": [
                    {
                        "en": "Management have put several new proposals on the table.",
                        "vi": "Ban quản lý đã đưa ra một số đề xuất mới trên bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not going to be discussed or considered until a future date",
                    "vi": "sẽ không được thảo luận hoặc xem xét cho đến một ngày trong tương lai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change a situation so that you are now in a stronger position than the person who used to be in a stronger position than you",
                    "vi": "thay đổi tình huống để bây giờ bạn ở vị trí mạnh hơn người đã từng ở vị trí mạnh hơn bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to serve food to people, for example at a formal meal",
                    "vi": "để phục vụ thức ăn cho mọi người, chẳng hạn như trong một bữa ăn chính thức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to work serving food to people in a restaurant",
                    "vi": "làm việc phục vụ đồ ăn cho mọi người trong nhà hàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "33b1431dd0c74904b7326c6cb5740f22",
        "word": "broker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbrəʊkə(r)/",
            "us": "/ˈbrəʊkər/"
        },
        "nearby": [
            {
                "word": "broken home",
                "pos": "noun"
            },
            {
                "word": "brokenly",
                "pos": "adverb"
            },
            {
                "word": "broker",
                "pos": "noun"
            },
            {
                "word": "broker",
                "pos": "verb"
            },
            {
                "word": "brokerage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who buys and sells things for other people",
                    "vi": "một người mua và bán những thứ cho người khác"
                },
                "examples": [
                    {
                        "en": "Ask advice from an insurance broker.",
                        "vi": "Xin lời khuyên từ một nhà môi giới bảo hiểm."
                    },
                    {
                        "en": "a broker for the company",
                        "vi": "một nhà môi giới cho công ty"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an organization that buys and sells shares for other people",
                    "vi": "một người hoặc một tổ chức mua và bán cổ phiếu cho người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who arranges the details of an agreement between two groups or countries that disagree or oppose each other",
                    "vi": "một người sắp xếp các chi tiết của một thỏa thuận giữa hai nhóm hoặc quốc gia không đồng ý hoặc chống lại nhau"
                },
                "examples": [
                    {
                        "en": "He offered to act as a broker between the rebels and the government.",
                        "vi": "Anh ta đề nghị làm môi giới giữa phe nổi dậy và chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e1b75f7d8479439b892132bbc1b6b78c",
        "word": "broker",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbrəʊkə(r)/",
            "us": "/ˈbrəʊkər/"
        },
        "nearby": [
            {
                "word": "brokenly",
                "pos": "adverb"
            },
            {
                "word": "broker",
                "pos": "noun"
            },
            {
                "word": "broker",
                "pos": "verb"
            },
            {
                "word": "brokerage",
                "pos": "noun"
            },
            {
                "word": "broker-dealer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to arrange the details of an agreement, especially between different countries",
                    "vi": "để sắp xếp các chi tiết của một thỏa thuận, đặc biệt là giữa các quốc gia khác nhau"
                },
                "examples": [
                    {
                        "en": "a peace plan brokered by the UN",
                        "vi": "một kế hoạch hòa bình do LHQ làm trung gian"
                    },
                    {
                        "en": "Efforts to broker a compromise solution failed.",
                        "vi": "Những nỗ lực để môi giới một giải pháp thỏa hiệp đã thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "056ff09cbaa14638a624ca55d85fbc23",
        "word": "buyout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪaʊt/",
            "us": "/ˈbaɪaʊt/"
        },
        "nearby": [
            {
                "word": "buy off",
                "pos": "phrasal verb"
            },
            {
                "word": "buy out",
                "pos": "phrasal verb"
            },
            {
                "word": "buyout",
                "pos": "noun"
            },
            {
                "word": "buy-to-let",
                "pos": "adjective"
            },
            {
                "word": "buy up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which a person or group gains control of a company by buying all or most of its shares",
                    "vi": "tình huống trong đó một người hoặc một nhóm giành được quyền kiểm soát công ty bằng cách mua tất cả hoặc phần lớn cổ phần của công ty đó"
                },
                "examples": [
                    {
                        "en": "a management buyout",
                        "vi": "một sự mua lại của ban quản lý"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f8ba137d9654914977680fdad08bae6",
        "word": "due diligence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuː ˈdɪlɪdʒəns/",
            "us": "/ˌduː ˈdɪlɪdʒəns/"
        },
        "nearby": [
            {
                "word": "due",
                "pos": "adverb"
            },
            {
                "word": "due date",
                "pos": "noun"
            },
            {
                "word": "due diligence",
                "pos": "noun"
            },
            {
                "word": "duel",
                "pos": "noun"
            },
            {
                "word": "duel",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "reasonable steps taken by a person or an organization to avoid committing a tort or an offence",
                    "vi": "các bước hợp lý được thực hiện bởi một người hoặc một tổ chức để tránh vi phạm hoặc hành vi phạm tội"
                },
                "examples": [
                    {
                        "en": "The company had taken all reasonable precautions and exercised due diligence to avoid the offence.",
                        "vi": "Công ty đã thực hiện tất cả các biện pháp phòng ngừa hợp lý và thực hiện trách nhiệm giải trình để tránh vi phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a careful investigation of the state of a business by a person or organization that is thinking of buying it or investing in it",
                    "vi": "một cuộc điều tra cẩn thận về tình trạng của một doanh nghiệp bởi một người hoặc tổ chức đang nghĩ đến việc mua nó hoặc đầu tư vào nó"
                },
                "examples": [
                    {
                        "en": "Investors are encouraged to perform their own due diligence on a company prior to investment.",
                        "vi": "Các nhà đầu tư được khuyến khích thực hiện thẩm định của riêng họ đối với một công ty trước khi đầu tư."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0970644df714de9b9adf227a37fd0ba",
        "word": "fall through",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "fallow deer",
                "pos": "noun"
            },
            {
                "word": "the Falls Road",
                "pos": ""
            },
            {
                "word": "fall through",
                "pos": "phrasal verb"
            },
            {
                "word": "fall to",
                "pos": "phrasal verb"
            },
            {
                "word": "fall upon",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to not be completed, or not happen",
                    "vi": "không được hoàn thành, hoặc không xảy ra"
                },
                "examples": [
                    {
                        "en": "Our plans fell through because of lack of money.",
                        "vi": "Kế hoạch của chúng tôi thất bại vì thiếu tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce9aceb25da04a7bb0dd015e0ccb464c",
        "word": "hardball",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːdbɔːl/",
            "us": "/ˈhɑːrdbɔːl/"
        },
        "nearby": [
            {
                "word": "hard-ass",
                "pos": "adjective"
            },
            {
                "word": "hardback",
                "pos": "noun"
            },
            {
                "word": "hardball",
                "pos": "noun"
            },
            {
                "word": "hard-bitten",
                "pos": "adjective"
            },
            {
                "word": "hardboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the game of baseball (when contrasted with softball)",
                    "vi": "trò chơi bóng chày (khi đối chiếu với bóng mềm)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to refer to a way of behaving, especially in politics, that shows that a person is determined to get what they want",
                    "vi": "được sử dụng để chỉ một cách hành xử, đặc biệt là trong chính trị, cho thấy rằng một người quyết tâm đạt được những gì họ muốn"
                },
                "examples": [
                    {
                        "en": "I want us to play hardball on this issue.",
                        "vi": "Tôi muốn chúng ta chơi khó về vấn đề này."
                    },
                    {
                        "en": "hardball politics",
                        "vi": "chính trị cứng rắn"
                    }
                ]
            }
        ]
    },
    {
        "id": "c3bff1d667494981abf87a3643308f7e",
        "word": "horse-trading",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːs treɪdɪŋ/",
            "us": "/ˈhɔːrs treɪdɪŋ/"
        },
        "nearby": [
            {
                "word": "horse show",
                "pos": "noun"
            },
            {
                "word": "horse's neck",
                "pos": "noun"
            },
            {
                "word": "horse-trading",
                "pos": "noun"
            },
            {
                "word": "horse trailer",
                "pos": "noun"
            },
            {
                "word": "horsewhip",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of buying and selling horses",
                    "vi": "hoạt động mua bán ngựa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the activity of discussing business with somebody using clever or secret methods in order to reach an agreement that suits you",
                    "vi": "hoạt động thảo luận kinh doanh với ai đó bằng các phương pháp thông minh hoặc bí mật để đạt được thỏa thuận phù hợp với bạn"
                },
                "examples": [
                    {
                        "en": "political horse-trading",
                        "vi": "buôn bán ngựa chính trị"
                    }
                ]
            }
        ]
    },
    {
        "id": "3b098fb79cb24d1cb62a75dd65cb3085",
        "word": "hostile",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒstaɪl/",
            "us": "/ˈhɑːstl/"
        },
        "nearby": [
            {
                "word": "hostelry",
                "pos": "noun"
            },
            {
                "word": "hostess",
                "pos": "noun"
            },
            {
                "word": "hostile",
                "pos": "adjective"
            },
            {
                "word": "hostile witness",
                "pos": "noun"
            },
            {
                "word": "hostility",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "aggressive or unfriendly and ready to argue or fight",
                    "vi": "hung hăng hoặc không thân thiện và sẵn sàng tranh cãi hoặc đánh nhau"
                },
                "examples": [
                    {
                        "en": "The speaker got a hostile reception from the audience.",
                        "vi": "Người nói đã nhận được sự đón nhận nhiệt tình từ khán giả."
                    },
                    {
                        "en": "hostile to/towards somebody/something She was openly hostile towards her parents.",
                        "vi": "thù địch với / đối với ai đó / cái gì đó Cô ấy công khai thù địch với cha mẹ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "strongly rejecting something",
                    "vi": "từ chối mạnh mẽ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The proposals have provoked a hostile response from opposition parties.",
                        "vi": "Các đề xuất đã gây ra phản ứng thù địch từ các đảng đối lập."
                    },
                    {
                        "en": "hostile to something Many of the employees were hostile to the idea of change.",
                        "vi": "thù địch với điều gì đó Nhiều nhân viên không thích ý tưởng về sự thay đổi."
                    },
                    {
                        "en": "Many people were openly hostile to the idea.",
                        "vi": "Nhiều người đã công khai thù địch với ý tưởng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "making it difficult for something to happen or to be achieved",
                    "vi": "làm cho điều gì đó khó xảy ra hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "hostile conditions for plants to grow in",
                        "vi": "điều kiện thù địch cho thực vật phát triển"
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a military enemy",
                    "vi": "thuộc về kẻ thù quân sự"
                },
                "examples": [
                    {
                        "en": "hostile territory",
                        "vi": "lãnh thổ thù địch"
                    }
                ]
            },
            {
                "define": {
                    "en": "not wanted by the company that is to be bought",
                    "vi": "không muốn bởi công ty sẽ được mua"
                },
                "examples": [
                    {
                        "en": "a hostile takeover bid",
                        "vi": "một giá thầu tiếp quản thù địch"
                    }
                ]
            }
        ]
    },
    {
        "id": "b324e15a336a4fcca65ac62141cf780e",
        "word": "ink",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪŋk/",
            "us": "/ɪŋk/"
        },
        "nearby": [
            {
                "word": "injustice",
                "pos": "noun"
            },
            {
                "word": "ink",
                "pos": "noun"
            },
            {
                "word": "ink",
                "pos": "verb"
            },
            {
                "word": "inkblot test",
                "pos": "noun"
            },
            {
                "word": "ink in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cover something with ink so that it can be used for printing",
                    "vi": "phủ một thứ gì đó bằng mực để nó có thể được sử dụng để in"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to sign a document, especially a contract",
                    "vi": "để ký một tài liệu, đặc biệt là một hợp đồng"
                },
                "examples": [
                    {
                        "en": "The group has just inked a $10 million deal.",
                        "vi": "Tập đoàn vừa ký một hợp đồng trị giá 10 triệu đô la."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9ef49b2720f48c09fa163eb2ab6c9fd",
        "word": "lead",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/liːd/",
            "us": "/liːd/"
        },
        "nearby": [
            {
                "word": "leach",
                "pos": "verb"
            },
            {
                "word": "lead1",
                "pos": "verb"
            },
            {
                "word": "lead1",
                "pos": "noun"
            },
            {
                "word": "lead2",
                "pos": "noun"
            },
            {
                "word": "'Leadbelly'",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the position ahead of everyone else in a race or competition",
                    "vi": "vị trí trước những người khác trong một cuộc đua hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "She took the lead in the second lap.",
                        "vi": "Cô dẫn đầu ở vòng thứ hai."
                    },
                    {
                        "en": "to hold (onto)/regain the lead",
                        "vi": "giữ (giữ) / giành lại vị trí dẫn đầu"
                    },
                    {
                        "en": "in the lead The Democrats now appear to be in the lead.",
                        "vi": "đang dẫn đầu Đảng Dân chủ hiện đang dẫn đầu."
                    },
                    {
                        "en": "into the lead He has gone into the lead.",
                        "vi": "dẫn đầu Anh ấy đã đi vào dẫn đầu."
                    },
                    {
                        "en": "The lead car is now three minutes ahead of the rest of the field.",
                        "vi": "Chiếc xe dẫn đầu hiện đã đi trước phần còn lại của sân ba phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount or distance that somebody/something is in front of somebody/something else",
                    "vi": "số lượng hoặc khoảng cách mà ai đó / cái gì đó ở phía trước ai đó / cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "a commanding/comfortable lead",
                        "vi": "một sự chỉ huy / thoải mái"
                    },
                    {
                        "en": "to extend/stretch/double/increase your lead",
                        "vi": "để mở rộng / kéo dài / tăng gấp đôi / tăng khách hàng tiềm năng của bạn"
                    },
                    {
                        "en": "lead of something Labour have taken a lead of five points in the polls.",
                        "vi": "dẫn đầu về thứ gì đó Lao động đã dẫn đầu 5 điểm trong các cuộc thăm dò."
                    },
                    {
                        "en": "lead (of something) over somebody/something He managed to hold a lead of two seconds over his closest rival.",
                        "vi": "dẫn đầu (của cái gì đó) so với ai đó / cái gì đó Anh ta đã dẫn trước đối thủ gần nhất của mình hai giây."
                    },
                    {
                        "en": "An own goal from United gave Chelsea an early two-goal lead in the 11th minute.",
                        "vi": "Một bàn phản lưới nhà của United đã giúp Chelsea sớm dẫn trước hai bàn ở phút thứ 11."
                    }
                ]
            },
            {
                "define": {
                    "en": "an example or action for people to copy",
                    "vi": "một ví dụ hoặc hành động để mọi người sao chép"
                },
                "examples": [
                    {
                        "en": "If one bank raises interest rates, all the others will follow their lead.",
                        "vi": "Nếu một ngân hàng tăng lãi suất, tất cả các ngân hàng khác sẽ tuân theo chỉ đạo của họ."
                    },
                    {
                        "en": "If we take the lead in this (= start to act), others may follow.",
                        "vi": "Nếu chúng ta đi đầu trong việc này (= bắt đầu hành động), những người khác có thể làm theo."
                    },
                    {
                        "en": "You go first, I'll take my lead from you.",
                        "vi": "Bạn đi trước, tôi sẽ dẫn đường cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of information that may help to find out the truth or facts about a situation, especially a crime",
                    "vi": "một phần thông tin có thể giúp tìm ra sự thật hoặc sự thật về một tình huống, đặc biệt là tội phạm"
                },
                "examples": [
                    {
                        "en": "The police will follow up all possible leads.",
                        "vi": "Cảnh sát sẽ theo dõi tất cả các đầu mối có thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that may be useful to you, especially a possible new customer or business opportunity",
                    "vi": "một người hoặc điều có thể hữu ích cho bạn, đặc biệt là một khách hàng mới hoặc cơ hội kinh doanh"
                },
                "examples": [
                    {
                        "en": "The marketing campaign generated hundreds of new leads.",
                        "vi": "Chiến dịch tiếp thị đã tạo ra hàng trăm khách hàng tiềm năng mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main part in a play, film, etc.; the person who plays this part",
                    "vi": "phần chính trong một vở kịch, bộ phim, v.v.; người đóng phần này"
                },
                "examples": [
                    {
                        "en": "Who is playing the lead?",
                        "vi": "Ai đang đóng vai chính?"
                    },
                    {
                        "en": "the male/female lead",
                        "vi": "nam / nữ chính"
                    },
                    {
                        "en": "Both Christine and Fiona want the lead role.",
                        "vi": "Cả Christine và Fiona đều muốn đóng vai chính."
                    },
                    {
                        "en": "I always dreamed of becoming the lead singer in a band.",
                        "vi": "Tôi luôn mơ ước trở thành ca sĩ chính trong một ban nhạc."
                    },
                    {
                        "en": "He played lead guitar on a number of tracks.",
                        "vi": "Anh ấy đã chơi guitar chính trên một số bản nhạc."
                    },
                    {
                        "en": "the band's lead guitarist",
                        "vi": "tay guitar chính của ban nhạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a project, department, etc.",
                    "vi": "người phụ trách một dự án, bộ phận, v.v."
                },
                "examples": [
                    {
                        "en": "Sam is the lead on this project.",
                        "vi": "Sam là người dẫn đầu trong dự án này."
                    },
                    {
                        "en": "Dr Mary Steadman, clinical lead in Accident and Emergency at the Royal Berkshire Hospital",
                        "vi": "Tiến sĩ Mary Steadman, trưởng nhóm lâm sàng về Tai nạn và Cấp cứu tại Bệnh viện Hoàng gia Berkshire"
                    },
                    {
                        "en": "Sarah Montague will become the lead presenter of the show from next month.",
                        "vi": "Sarah Montague sẽ trở thành người dẫn chương trình chính của chương trình từ tháng tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the first sentence or paragraph of a news story, giving the most important points of the story",
                    "vi": "câu đầu tiên hoặc đoạn văn của một câu chuyện tin tức, đưa ra những điểm quan trọng nhất của câu chuyện"
                },
                "examples": [
                    {
                        "en": "Check out this lead from Monday's front page story:…",
                        "vi": "Hãy xem khách hàng tiềm năng này từ câu chuyện trên trang nhất hôm thứ Hai:…"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long piece of leather, chain or rope used for holding and controlling a dog",
                    "vi": "một miếng da dài, dây xích hoặc dây thừng dùng để giữ và điều khiển một con chó"
                },
                "examples": [
                    {
                        "en": "on a lead Dogs must be kept on a lead in the park.",
                        "vi": "dẫn dắt Chó phải được dẫn dắt trong công viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long piece of wire, usually covered in plastic, that is used to connect a piece of electrical equipment to a source of electricity",
                    "vi": "một đoạn dây dài, thường được bọc bằng nhựa, được sử dụng để nối một thiết bị điện với nguồn điện."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give the most important point of a news story near the end instead of at the beginning",
                    "vi": "để đưa ra điểm quan trọng nhất của một câu chuyện tin tức ở gần cuối thay vì ở đầu"
                },
                "examples": [
                    {
                        "en": "Unfortunately, he buried the lede in the last paragraph of the story.",
                        "vi": "Thật không may, anh ta đã chôn con chì trong đoạn cuối của câu chuyện."
                    }
                ]
            }
        ]
    },
    {
        "id": "b42e0d19605a4ce79ab94add9a765852",
        "word": "leverage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈliːvərɪdʒ/",
            "us": "/ˈlevərɪdʒ/"
        },
        "nearby": [
            {
                "word": "lever",
                "pos": "noun"
            },
            {
                "word": "lever",
                "pos": "verb"
            },
            {
                "word": "leverage",
                "pos": "noun"
            },
            {
                "word": "leverage",
                "pos": "verb"
            },
            {
                "word": "leveraged buyout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to influence what people do",
                    "vi": "khả năng ảnh hưởng đến những gì mọi người làm"
                },
                "examples": [
                    {
                        "en": "diplomatic leverage",
                        "vi": "đòn bẩy ngoại giao"
                    },
                    {
                        "en": "Retailers can exert leverage over producers by threatening to take their business elsewhere.",
                        "vi": "Các nhà bán lẻ có thể tạo đòn bẩy đối với các nhà sản xuất bằng cách đe dọa đưa hoạt động kinh doanh của họ đi nơi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of using a lever to open or lift something; the force used to do this",
                    "vi": "hành động sử dụng một đòn bẩy để mở hoặc nâng một thứ gì đó; lực lượng được sử dụng để làm điều này"
                },
                "examples": [
                    {
                        "en": "A longer piece of wood would give you greater leverage.",
                        "vi": "Một miếng gỗ dài hơn sẽ cho bạn đòn bẩy lớn hơn."
                    },
                    {
                        "en": "Position the piece of wood so that maximum leverage can be applied.",
                        "vi": "Định vị miếng gỗ để có thể sử dụng đòn bẩy tối đa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the relationship between the amount of money that a company owes and the value of its shares",
                    "vi": "mối quan hệ giữa số tiền mà một công ty nợ và giá trị cổ phiếu của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "830b44e8646b490d8ba38238077fabef",
        "word": "pull out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "pull off",
                "pos": "phrasal verb"
            },
            {
                "word": "pull on",
                "pos": "phrasal verb"
            },
            {
                "word": "pull out",
                "pos": "phrasal verb"
            },
            {
                "word": "pull-out",
                "pos": "noun"
            },
            {
                "word": "pull over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move away from the side of the road, etc.",
                    "vi": "để di chuyển ra khỏi bên đường, v.v."
                },
                "examples": [
                    {
                        "en": "A car suddenly pulled out in front of me.",
                        "vi": "Một chiếc ô tô đột ngột lao ra trước mặt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a station",
                    "vi": "rời khỏi một nhà ga"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move away from something or stop being involved in it",
                    "vi": "rời xa một cái gì đó hoặc ngừng tham gia vào nó"
                },
                "examples": [
                    {
                        "en": "The project became so expensive that we had to pull out.",
                        "vi": "Dự án trở nên đắt đỏ đến mức chúng tôi phải rút ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody/something move away from something or stop being involved in it",
                    "vi": "để khiến ai đó / điều gì đó rời xa điều gì đó hoặc ngừng tham gia vào nó"
                },
                "examples": [
                    {
                        "en": "They are pulling their troops out of the war zone.",
                        "vi": "Họ đang kéo quân của họ ra khỏi vùng chiến sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "5629ec1bcea94804b7c282cf6416c49e",
        "word": "pull the plug on somebody/something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pʊl/",
            "us": "/pʊl/"
        },
        "nearby": [
            {
                "word": "Pulitzer Prize",
                "pos": "noun"
            },
            {
                "word": "pull-out",
                "pos": "adjective"
            },
            {
                "word": "pull",
                "pos": "verb"
            },
            {
                "word": "pull",
                "pos": "noun"
            },
            {
                "word": "pull ahead",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take hold of something and use force in order to move it or try to move it towards yourself",
                    "vi": "nắm lấy một thứ gì đó và sử dụng lực để di chuyển nó hoặc cố gắng di chuyển nó về phía bạn"
                },
                "examples": [
                    {
                        "en": "You push and I'll pull.",
                        "vi": "Bạn đẩy và tôi sẽ kéo."
                    },
                    {
                        "en": "Don't pull so hard or the handle will come off.",
                        "vi": "Đừng kéo quá mạnh nếu không tay cầm sẽ bị bung ra."
                    },
                    {
                        "en": "He got hold of the end and pulled.",
                        "vi": "Anh ấy đã nắm được phần cuối và kéo."
                    },
                    {
                        "en": "pull on something I pulled on the rope to see if it was secure.",
                        "vi": "kéo một cái gì đó tôi đã kéo trên dây để xem nó có chắc chắn không."
                    },
                    {
                        "en": "pull at something He pulled at her coat sleeve.",
                        "vi": "kéo cái gì đó Anh kéo ống tay áo khoác của cô."
                    },
                    {
                        "en": "pull something Stop pulling her hair!",
                        "vi": "kéo cái gì đó Dừng kéo tóc cô ấy!"
                    },
                    {
                        "en": "She pulled the cord and the parachute opened.",
                        "vi": "Cô kéo dây và chiếc dù mở ra."
                    },
                    {
                        "en": "pull somebody/something + adv./prep. She pulled him gently towards her.",
                        "vi": "kéo ai đó / cái gì đó + adv./prep. Cô nhẹ nhàng kéo anh về phía mình."
                    },
                    {
                        "en": "He smiled and pulled her closer.",
                        "vi": "Anh mỉm cười và kéo cô lại gần."
                    },
                    {
                        "en": "pull something + adj. Pull the door shut.",
                        "vi": "kéo cái gì đó + adj. Đóng cửa lại."
                    },
                    {
                        "en": "She pulled the straps tight.",
                        "vi": "Cô kéo chặt dây đai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something from a place by pulling",
                    "vi": "để loại bỏ một cái gì đó khỏi một nơi bằng cách kéo"
                },
                "examples": [
                    {
                        "en": "pull something If these weeds are not pulled, they will spread rapidly .",
                        "vi": "kéo một cái gì đó Nếu những cỏ dại này không được nhổ, chúng sẽ lây lan nhanh chóng."
                    },
                    {
                        "en": "He pulled a knife and stabbed the man.",
                        "vi": "Anh ta rút dao và đâm người đàn ông."
                    },
                    {
                        "en": "pull something + adv./prep. Pull the plug out.",
                        "vi": "kéo cái gì đó + adv./prep. Rút phích cắm ra."
                    },
                    {
                        "en": "to pull out a gun/knife",
                        "vi": "rút súng / dao"
                    },
                    {
                        "en": "She pulled off her boots.",
                        "vi": "Cô ấy cởi ủng."
                    },
                    {
                        "en": "James pulled his shirt over his head, letting it fall to the floor.",
                        "vi": "James kéo áo qua đầu, để nó rơi xuống sàn."
                    },
                    {
                        "en": "They were still pulling bodies from the rubble.",
                        "vi": "Họ vẫn đang kéo các thi thể từ đống đổ nát."
                    },
                    {
                        "en": "She he was spotted in the water and pulled to safety.",
                        "vi": "Cô được phát hiện trong nước và được kéo đến nơi an toàn."
                    },
                    {
                        "en": "He pulled a gun on me (= took out a gun and aimed it at me).",
                        "vi": "Anh ta rút súng vào tôi (= lấy súng ra và nhắm vào tôi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somebody/something in a particular direction by pulling",
                    "vi": "để di chuyển ai đó / cái gì đó theo một hướng cụ thể bằng cách kéo"
                },
                "examples": [
                    {
                        "en": "Pull your chair nearer the table.",
                        "vi": "Kéo ghế của bạn gần bàn hơn."
                    },
                    {
                        "en": "I pulled up a seat next to her.",
                        "vi": "Tôi kéo một chỗ ngồi cạnh cô ấy."
                    },
                    {
                        "en": "He pulled on his sweater.",
                        "vi": "Anh ấy kéo áo len của mình."
                    },
                    {
                        "en": "She took his arm and pulled him along.",
                        "vi": "Cô nắm tay anh và kéo anh đi cùng."
                    },
                    {
                        "en": "The sun was too bright so I pulled the blinds down.",
                        "vi": "Mặt trời quá chói nên tôi kéo rèm xuống."
                    },
                    {
                        "en": "Mary pulled the blanket up over her head.",
                        "vi": "Mary kéo chăn lên trên đầu."
                    },
                    {
                        "en": "He was the only living person pulled from the rubble that night .",
                        "vi": "Anh ta là người sống duy nhất được kéo ra từ đống đổ nát trong đêm đó."
                    },
                    {
                        "en": "She pulled on her boots and hurried off.",
                        "vi": "Cô mang ủng và vội vã rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold or be attached to something and move it along behind you",
                    "vi": "để giữ hoặc gắn vào một cái gì đó và di chuyển nó theo phía sau bạn"
                },
                "examples": [
                    {
                        "en": "In this area oxen are used to pull carts.",
                        "vi": "Trong khu vực này, bò được sử dụng để kéo xe."
                    },
                    {
                        "en": "a car pulling a trailer",
                        "vi": "một chiếc xe đầu kéo một rơ moóc"
                    },
                    {
                        "en": "The horses pulling the wagon stopped suddenly.",
                        "vi": "Những con ngựa đang kéo xe đột ngột dừng lại."
                    },
                    {
                        "en": "Ponies were used to pull the coal trucks.",
                        "vi": "Ngựa con được sử dụng để kéo các xe chở than."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move your body or a part of your body in a particular direction, especially using force",
                    "vi": "để di chuyển cơ thể hoặc một bộ phận của cơ thể theo một hướng cụ thể, đặc biệt là sử dụng lực"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. He tried to kiss her but she pulled away.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "pull something/yourself + adv./prep. The dog snapped at her and she quickly pulled back her hand.",
                        "vi": "kéo cái gì đó / mình + adv./prep. Con chó ngoạm vào cô và cô nhanh chóng rút tay lại."
                    },
                    {
                        "en": "pull something/yourself + adj. John pulled himself free and ran off.",
                        "vi": "kéo cái gì đó / mình + adj. John thả mình ra và chạy đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open or close curtains, etc.",
                    "vi": "để mở hoặc đóng rèm cửa, v.v."
                },
                "examples": [
                    {
                        "en": "Pull the curtains—it's dark outside.",
                        "vi": "Kéo rèm cửa - bên ngoài trời tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to damage a muscle, etc. by using too much force",
                    "vi": "làm hỏng cơ, v.v. bằng cách sử dụng quá nhiều lực"
                },
                "examples": [
                    {
                        "en": "to pull a muscle/ligament/tendon",
                        "vi": "để kéo cơ / dây chằng / gân"
                    },
                    {
                        "en": "He pulled a hamstring in training.",
                        "vi": "Anh ta đã kéo gân kheo trong quá trình luyện tập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move a switch, etc. towards yourself or down in order to operate a machine or piece of equipment",
                    "vi": "để di chuyển một công tắc, v.v. về phía bạn hoặc xuống để vận hành máy hoặc thiết bị"
                },
                "examples": [
                    {
                        "en": "Pull the lever to start the motor.",
                        "vi": "Kéo cần để khởi động động cơ."
                    },
                    {
                        "en": "Don't pull the trigger!",
                        "vi": "Đừng bóp cò!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or make a vehicle move to the side",
                    "vi": "để di chuyển hoặc làm cho một chiếc xe di chuyển sang một bên"
                },
                "examples": [
                    {
                        "en": "The wheel is pulling to the left.",
                        "vi": "Bánh xe đang kéo sang trái."
                    },
                    {
                        "en": "She pulled the car to the right to avoid the dog.",
                        "vi": "Cô cho xe tấp vào lề phải để tránh con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work hard and use a lot of power",
                    "vi": "làm việc chăm chỉ và sử dụng nhiều sức mạnh"
                },
                "examples": [
                    {
                        "en": "The old car pulled hard as we drove slowly up the hill.",
                        "vi": "Chiếc xe cũ kỹ kéo mạnh khi chúng tôi chạy chầm chậm lên đồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use oars to move a boat along",
                    "vi": "sử dụng mái chèo để di chuyển thuyền"
                },
                "examples": [
                    {
                        "en": "They pulled towards the shore.",
                        "vi": "Họ kéo về phía bờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attract the interest or support of somebody/something",
                    "vi": "để thu hút sự quan tâm hoặc ủng hộ của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "They pulled in huge crowds on their latest tour.",
                        "vi": "Họ đã kéo đến rất đông trong chuyến lưu diễn mới nhất của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attract somebody sexually and get them to spend the evening with you",
                    "vi": "để thu hút ai đó về tình dục và khiến họ dành cả buổi tối với bạn"
                },
                "examples": [
                    {
                        "en": "He can still pull the girls.",
                        "vi": "Anh ta vẫn có thể kéo các cô gái."
                    },
                    {
                        "en": "She's hoping to pull tonight.",
                        "vi": "Cô ấy hy vọng sẽ kéo tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in playing a trick on somebody, committing a crime, etc.",
                    "vi": "để thành công trong việc lừa ai đó, phạm tội, v.v."
                },
                "examples": [
                    {
                        "en": "He's pulling some sort of trick on you.",
                        "vi": "Anh ta đang giở một chiêu trò gì đó với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cancel an event; to stop showing an advertisement, etc.",
                    "vi": "để hủy một sự kiện; ngừng hiển thị quảng cáo, v.v."
                },
                "examples": [
                    {
                        "en": "The gig was pulled at the last moment.",
                        "vi": "Hợp đồng biểu diễn đã được rút lại vào thời điểm cuối cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform two roles or functions at the same time",
                    "vi": "để thực hiện hai vai trò hoặc chức năng cùng một lúc"
                },
                "examples": [
                    {
                        "en": "This device can pull double duty as a decent laptop and an adequate tablet.",
                        "vi": "Thiết bị này có thể thực hiện nhiệm vụ kép như một máy tính xách tay tốt và một máy tính bảng phù hợp."
                    },
                    {
                        "en": "She deserves credit for serving double duty as a host and performer.",
                        "vi": "Cô ấy xứng đáng được ghi nhận vì đã thực hiện hai nhiệm vụ vừa là người dẫn chương trình vừa là người biểu diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start being more careful in your behaviour, especially by spending less money than before",
                    "vi": "để bắt đầu cẩn thận hơn trong hành vi của bạn, đặc biệt là bằng cách tiêu ít tiền hơn trước đây"
                },
                "examples": [
                    {
                        "en": "Small businesses have had to pull their horns in during the recession.",
                        "vi": "Các doanh nghiệp nhỏ đã phải kéo sừng của họ trong thời kỳ suy thoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is very difficult to make somebody do something",
                    "vi": "từng nói rằng rất khó để bắt ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's like pulling teeth trying to get him to talk.",
                        "vi": "Nó giống như nhổ răng để cố gắng khiến anh ta nói chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to improve your situation yourself, without help from other people",
                    "vi": "để tự cải thiện tình hình của bạn mà không cần sự giúp đỡ của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce an expression on your face to show that you do not like somebody/something or in order to make somebody laugh",
                    "vi": "biểu hiện trên khuôn mặt của bạn để thể hiện rằng bạn không thích ai đó / điều gì đó hoặc để làm cho ai đó cười"
                },
                "examples": [
                    {
                        "en": "What are you pulling a face at now?",
                        "vi": "Bạn đang kéo một khuôn mặt vào lúc này?"
                    },
                    {
                        "en": "Do you think it’s funny to make faces behind my back?",
                        "vi": "Bạn có nghĩ thật buồn cười khi làm mặt sau lưng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to trick somebody",
                    "vi": "lừa ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have different aims that cannot be achieved together without causing problems",
                    "vi": "có những mục tiêu khác nhau mà không thể đạt được cùng nhau mà không gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "There are different considerations, often pulling in different directions.",
                        "vi": "Có những cân nhắc khác nhau, thường kéo theo các hướng khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in doing something difficult by making an extra effort or doing something clever or surprising",
                    "vi": "để thành công khi làm điều gì đó khó khăn bằng cách nỗ lực thêm hoặc làm điều gì đó thông minh hoặc đáng ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "We managed to pull it out of the bag despite not being at our best for most of the game.",
                        "vi": "Chúng tôi đã cố gắng rút nó ra khỏi túi mặc dù không ở trạng thái tốt nhất trong phần lớn thời gian của trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a joke on somebody, usually by making them believe something that is not true",
                    "vi": "để đùa ai đó, thường là khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show that you do not believe what somebody has just said",
                    "vi": "được sử dụng để cho thấy rằng bạn không tin những gì ai đó vừa nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make the greatest effort possible to achieve something",
                    "vi": "nỗ lực cao nhất có thể để đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put an end to somebody’s project, a plan, etc.",
                    "vi": "để chấm dứt dự án, kế hoạch của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "The television company pulled the plug on the series after only five episodes.",
                        "vi": "Hãng truyền hình đã rút khỏi bộ phim chỉ sau năm tập."
                    },
                    {
                        "en": "They decided to pull the plug on the project.",
                        "vi": "Họ quyết định rút phích cắm vào dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express something less strongly than you are able to, for example to avoid upsetting or shocking somebody",
                    "vi": "để thể hiện điều gì đó ít mạnh mẽ hơn bạn có thể, chẳng hạn như để tránh làm ai đó buồn hoặc sốc"
                },
                "examples": [
                    {
                        "en": "Her articles certainly don't pull any punches.",
                        "vi": "Các bài báo của cô ấy chắc chắn không có bất kỳ cú đấm nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly produce something as a solution to a problem",
                    "vi": "đột nhiên tạo ra một cái gì đó như một giải pháp cho một vấn đề"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make use of your place or status in society or at work to make somebody do what you want",
                    "vi": "để sử dụng vị trí hoặc địa vị của bạn trong xã hội hoặc tại nơi làm việc để khiến ai đó làm những gì bạn muốn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take help or support away from somebody suddenly",
                    "vi": "bất ngờ nhận được sự giúp đỡ hoặc hỗ trợ từ một người nào đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to improve your performance, work, behaviour, etc.",
                    "vi": "để cố gắng cải thiện hiệu suất, công việc, hành vi của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "You're going to have to pull your socks up.",
                        "vi": "Bạn sẽ phải kéo tất của mình lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use your influence in order to get an advantage for somebody",
                    "vi": "sử dụng ảnh hưởng của bạn để có được lợi thế cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to control events or the actions of other people",
                    "vi": "để kiểm soát các sự kiện hoặc hành động của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly move from your house and go to live somewhere else",
                    "vi": "đột ngột chuyển khỏi nhà của bạn và đi đến một nơi khác"
                },
                "examples": [
                    {
                        "en": "He pulled up stakes and went back to France.",
                        "vi": "Anh ta thu hồi cổ phần và quay trở lại Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work as hard as everyone else in a job, an activity, etc.",
                    "vi": "làm việc chăm chỉ như mọi người trong một công việc, một hoạt động, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hide your real actions or intentions from somebody by making them believe something that is not true",
                    "vi": "che giấu hành động hoặc ý định thực sự của bạn với ai đó bằng cách khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f139b01a80904947b80fb10c586c43bb",
        "word": "takeover",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈteɪkəʊvə(r)/",
            "us": "/ˈteɪkəʊvər/"
        },
        "nearby": [
            {
                "word": "take out of himself/herself",
                "pos": "phrasal verb"
            },
            {
                "word": "take over",
                "pos": "phrasal verb"
            },
            {
                "word": "takeover",
                "pos": "noun"
            },
            {
                "word": "taker",
                "pos": "noun"
            },
            {
                "word": "take the Fifth",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of taking control of a company by buying most of its shares",
                    "vi": "hành động nắm quyền kiểm soát công ty bằng cách mua phần lớn cổ phần của công ty đó"
                },
                "examples": [
                    {
                        "en": "a takeover bid for the company",
                        "vi": "một cuộc đấu thầu tiếp quản cho công ty"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of taking control of a country, an area or a political organization by force",
                    "vi": "hành động giành quyền kiểm soát một quốc gia, một khu vực hoặc một tổ chức chính trị bằng vũ lực"
                },
                "examples": [
                    {
                        "en": "attempts to prevent the takeover of the Republic by the military",
                        "vi": "nỗ lực ngăn chặn việc quân đội tiếp quản nước Cộng hòa"
                    }
                ]
            }
        ]
    },
    {
        "id": "5c3a2ab6424b4880bfe8f04898e393e3",
        "word": "trade in",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "trade down",
                "pos": "phrasal verb"
            },
            {
                "word": "trade fair",
                "pos": "noun"
            },
            {
                "word": "trade in",
                "pos": "phrasal verb"
            },
            {
                "word": "trade-in",
                "pos": "noun"
            },
            {
                "word": "trademark",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give something used as part of the payment for something new",
                    "vi": "để cung cấp một cái gì đó được sử dụng như một phần của khoản thanh toán cho một cái gì đó mới"
                },
                "examples": [
                    {
                        "en": "He traded in his old car for a new Mercedes.",
                        "vi": "Anh ta đổi chiếc xe cũ lấy một chiếc Mercedes mới."
                    }
                ]
            }
        ]
    }
]