[
    {
        "id": "fd927392676147fc86b1101560b35fcc",
        "word": "seat",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/siːt/",
            "us": "/siːt/"
        },
        "nearby": [
            {
                "word": "season premiere",
                "pos": "noun"
            },
            {
                "word": "season ticket",
                "pos": "noun"
            },
            {
                "word": "seat",
                "pos": "noun"
            },
            {
                "word": "seat",
                "pos": "verb"
            },
            {
                "word": "seat belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can sit, for example a chair",
                    "vi": "một nơi mà bạn có thể ngồi, ví dụ như một chiếc ghế"
                },
                "examples": [
                    {
                        "en": "She sat back in her seat.",
                        "vi": "Cô ngồi trở lại chỗ của mình."
                    },
                    {
                        "en": "He put his shopping on the seat behind him.",
                        "vi": "Anh đặt đồ đạc của mình vào chỗ ngồi phía sau."
                    },
                    {
                        "en": "Please take a seat (= sit down).",
                        "vi": "Please take a seat (= ngồi xuống)."
                    },
                    {
                        "en": "Ladies and gentlemen, please take your seats (= sit down).",
                        "vi": "Xin mời quý vị và các bạn ngồi xuống (= ngồi xuống)."
                    },
                    {
                        "en": "the front/passenger seat (= in a car)",
                        "vi": "ghế trước / ghế hành khách (= trong xe hơi)"
                    },
                    {
                        "en": "the back/rear seats",
                        "vi": "ghế sau / sau"
                    },
                    {
                        "en": "a child seat (= for a child in a car)",
                        "vi": "ghế trẻ em (= cho trẻ em trên xe hơi)"
                    },
                    {
                        "en": "a window/an aisle seat (= on a plane or train)",
                        "vi": "một cửa sổ / một chỗ ngồi trên lối đi (= trên máy bay hoặc xe lửa)"
                    },
                    {
                        "en": "a window/corner seat (= one near a window/in a corner)",
                        "vi": "một cửa sổ / chỗ ngồi trong góc (= một cái gần cửa sổ / trong một góc)"
                    },
                    {
                        "en": "a car/toilet seat",
                        "vi": "chỗ ngồi trên ô tô / nhà vệ sinh"
                    },
                    {
                        "en": "We used the branch of an old tree as a seat.",
                        "vi": "Chúng tôi dùng cành cây cổ thụ làm chỗ ngồi."
                    },
                    {
                        "en": "We all filed back to our seats in silence.",
                        "vi": "Tất cả chúng tôi quay trở lại chỗ ngồi của mình trong im lặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the number of seats mentioned",
                    "vi": "với số lượng ghế đã đề cập"
                },
                "examples": [
                    {
                        "en": "(British English) a ten-seater minibus",
                        "vi": "(Anh Anh) một chiếc xe buýt nhỏ mười chỗ ngồi"
                    },
                    {
                        "en": "an all-seater stadium (= in which nobody is allowed to stand)",
                        "vi": "sân vận động toàn chỗ ngồi (= trong đó không ai được phép đứng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a chair, etc. on which you actually sit",
                    "vi": "phần của một chiếc ghế, v.v. mà bạn thực sự ngồi"
                },
                "examples": [
                    {
                        "en": "a steel chair with a plastic seat",
                        "vi": "ghế thép với ghế nhựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you pay to sit in a plane, train, theatre, etc.",
                    "vi": "nơi bạn trả tiền để ngồi trên máy bay, tàu hỏa, nhà hát, v.v."
                },
                "examples": [
                    {
                        "en": "Call the theatre box office to book your seats.",
                        "vi": "Gọi điện đến phòng vé rạp để đặt chỗ."
                    },
                    {
                        "en": "To reserve a seat, visit our website.",
                        "vi": "Để đặt chỗ, hãy truy cập trang web của chúng tôi."
                    },
                    {
                        "en": "There are no seats left on that flight.",
                        "vi": "Không còn chỗ ngồi trên chuyến bay đó."
                    },
                    {
                        "en": "Airlines often give great deals to fill empty seats.",
                        "vi": "Các hãng hàng không thường đưa ra những ưu đãi lớn để lấp đầy ghế trống."
                    },
                    {
                        "en": "seat for something We had excellent seats for the show, on the third row.",
                        "vi": "chỗ ngồi cho thứ gì đó Chúng tôi đã có những chỗ ngồi tuyệt vời cho buổi biểu diễn, trên hàng ghế thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official position as a member of a parliament, council, committee, etc.",
                    "vi": "một vị trí chính thức như một thành viên của quốc hội, hội đồng, ủy ban, v.v."
                },
                "examples": [
                    {
                        "en": "a seat on the city council/in Parliament/in Congress",
                        "vi": "một ghế trong hội đồng thành phố / trong Quốc hội / trong Quốc hội"
                    },
                    {
                        "en": "Republicans currently hold 51 seats in the Senate.",
                        "vi": "Đảng Cộng hòa hiện nắm giữ 51 ghế tại Thượng viện."
                    },
                    {
                        "en": "The majority of seats on the board will be held by business representatives.",
                        "vi": "Phần lớn các ghế trong hội đồng quản trị sẽ do các đại diện doanh nghiệp nắm giữ."
                    },
                    {
                        "en": "The party won 32 seats in the recent elections.",
                        "vi": "Đảng đã giành được 32 ghế trong cuộc bầu cử gần đây."
                    },
                    {
                        "en": "Several ministers are in danger of losing their seats.",
                        "vi": "Một số bộ trưởng có nguy cơ mất ghế."
                    },
                    {
                        "en": "(British English) to take your seat (= to begin your duties, especially in Parliament)",
                        "vi": "(Anh Anh) để ngồi vào ghế của bạn (= để bắt đầu nhiệm vụ của bạn, đặc biệt là trong Quốc hội)"
                    },
                    {
                        "en": "One vote could make all the difference in the highly marginal seat of Crawley.",
                        "vi": "Một phiếu bầu có thể tạo ra tất cả sự khác biệt trong chiếc ghế rất có lợi cho Crawley."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people are involved in a particular activity, especially a city that has a university or the offices of a government",
                    "vi": "nơi mọi người tham gia vào một hoạt động cụ thể, đặc biệt là một thành phố có trường đại học hoặc các văn phòng của chính phủ"
                },
                "examples": [
                    {
                        "en": "Washington is the seat of government of the US.",
                        "vi": "Washington là nơi đặt chính quyền của Hoa Kỳ."
                    },
                    {
                        "en": "a university town renowned as a seat of learning",
                        "vi": "một thị trấn đại học nổi tiếng là nơi học tập"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large house in the country that belongs to a member of the upper class",
                    "vi": "một ngôi nhà lớn ở đất nước thuộc về thành viên của tầng lớp thượng lưu"
                },
                "examples": [
                    {
                        "en": "For the first two years of her life she lived at Ickworth, the family seat in Sussex.",
                        "vi": "Trong hai năm đầu đời, cô sống tại Ickworth, nơi dành cho gia đình ở Sussex."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the body on which a person sits",
                    "vi": "phần cơ thể mà một người ngồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a pair of trousers that covers a person’s seat",
                    "vi": "một phần của một chiếc quần dài che đi chỗ ngồi của một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have an advantage over other people or be in control of a situation",
                    "vi": "để có lợi thế hơn người khác hoặc kiểm soát tình huống"
                },
                "examples": [
                    {
                        "en": "Canada is in the catbird seat as an energy powerhouse.",
                        "vi": "Canada là một cường quốc năng lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person in control of a situation",
                    "vi": "trở thành người kiểm soát tình huống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to refer to the number of people who attend a show, talk, etc., especially when emphasizing the need or desire to attract a large number",
                    "vi": "được sử dụng để chỉ số lượng người tham gia một buổi biểu diễn, buổi nói chuyện, v.v., đặc biệt khi nhấn mạnh nhu cầu hoặc mong muốn thu hút một số lượng lớn"
                },
                "examples": [
                    {
                        "en": "They're not bothered about attracting the right audience—they just want bums on seats.",
                        "vi": "Họ không bận tâm về việc thu hút đúng đối tượng — họ chỉ muốn có được một chỗ ngồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act without careful thought and without a plan that you have made in advance, hoping that you will be lucky and be successful",
                    "vi": "hành động mà không suy nghĩ kỹ lưỡng và không có kế hoạch mà bạn đã lập trước, hy vọng rằng bạn sẽ gặp may mắn và thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very excited and giving your full attention to something",
                    "vi": "rất hào hứng và dành toàn bộ sự chú ý của bạn cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "The game had the crowd on the edge of their seats.",
                        "vi": "Trò chơi có rất nhiều khán giả ở mép ghế của họ."
                    },
                    {
                        "en": "I was on the edge of my seat waiting to find out what happened next.",
                        "vi": "Tôi đang ngồi trên mép ghế chờ xem chuyện gì xảy ra tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody else to play a more active and important role in a particular situation than you do",
                    "vi": "để cho phép ai đó khác đóng một vai trò tích cực và quan trọng hơn trong một tình huống cụ thể hơn bạn"
                },
                "examples": [
                    {
                        "en": "Many managers take a back seat and leave recruitment to specialists.",
                        "vi": "Nhiều nhà quản lý rút lui và để lại việc tuyển dụng cho các chuyên gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "381b0d9c380d48eb8d602699c6c43b8e",
        "word": "business class",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbɪznəs klɑːs/",
            "us": "/ˈbɪznəs klæs/"
        },
        "nearby": [
            {
                "word": "business card",
                "pos": "noun"
            },
            {
                "word": "business casual",
                "pos": "noun"
            },
            {
                "word": "business class",
                "pos": "noun"
            },
            {
                "word": "business class",
                "pos": "adverb"
            },
            {
                "word": "the business end",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a plane where passengers have a high level of comfort and service, designed for people travelling on business, and less expensive than first class",
                    "vi": "phần của máy bay nơi hành khách có mức độ thoải mái và dịch vụ cao, được thiết kế cho những người đi công tác và ít tốn kém hơn so với khoang hạng nhất"
                },
                "examples": [
                    {
                        "en": "There were no seats available in business class.",
                        "vi": "Không có chỗ ngồi trong hạng thương gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "eb38dac163c8417fb0c1dc0effdcb8ce",
        "word": "first-class",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfɜːst ˈklɑːs/",
            "us": "/ˌfɜːrst ˈklæs/"
        },
        "nearby": [
            {
                "word": "firstborn",
                "pos": "adjective"
            },
            {
                "word": "first class",
                "pos": "noun"
            },
            {
                "word": "first-class",
                "pos": "adjective"
            },
            {
                "word": "first-class cricket",
                "pos": "noun"
            },
            {
                "word": "first cost",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in the best group; of the highest standard",
                    "vi": "trong nhóm tốt nhất; tiêu chuẩn cao nhất"
                },
                "examples": [
                    {
                        "en": "a first-class novel",
                        "vi": "một cuốn tiểu thuyết hạng nhất"
                    },
                    {
                        "en": "a first-class writer",
                        "vi": "một nhà văn hạng nhất"
                    },
                    {
                        "en": "The car was in first-class condition.",
                        "vi": "Chiếc xe đã được trong tình trạng hạng nhất."
                    },
                    {
                        "en": "I know a place where the food is first-class.",
                        "vi": "Tôi biết một nơi mà thức ăn là hạng nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the best and most expensive way of travelling on a train, plane or ship",
                    "vi": "được kết nối với cách tốt nhất và đắt nhất để di chuyển trên tàu hỏa, máy bay hoặc tàu thủy"
                },
                "examples": [
                    {
                        "en": "first-class rail travel",
                        "vi": "du lịch đường sắt hạng nhất"
                    },
                    {
                        "en": "a first-class cabin/seat/ticket",
                        "vi": "cabin / ghế / vé hạng nhất"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) connected with letters, packages, etc. that are delivered most quickly, or that cost more to send",
                    "vi": "(ở Vương quốc Anh) được kết nối với các lá thư, gói hàng, v.v. được gửi nhanh nhất hoặc chi phí gửi cao hơn"
                },
                "examples": [
                    {
                        "en": "first-class mail/post/postage/stamps",
                        "vi": "thư / bưu chính / bưu phí / tem hạng nhất"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a university degree of the highest class from a British university",
                    "vi": "được sử dụng để mô tả bằng đại học thuộc loại cao nhất của một trường đại học ở Anh"
                },
                "examples": [
                    {
                        "en": "She was awarded a first-class degree in English.",
                        "vi": "Cô đã được trao bằng hạng nhất về tiếng Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c465d609a8f4c5e82c97f087f582101",
        "word": "first class",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfɜːst ˈklɑːs/",
            "us": "/ˌfɜːrst ˈklæs/"
        },
        "nearby": [
            {
                "word": "firstborn",
                "pos": "noun"
            },
            {
                "word": "firstborn",
                "pos": "adjective"
            },
            {
                "word": "first class",
                "pos": "noun"
            },
            {
                "word": "first-class",
                "pos": "adjective"
            },
            {
                "word": "first-class cricket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the best and most expensive seats or accommodation on a train, plane or ship",
                    "vi": "chỗ ngồi hoặc chỗ ở tốt nhất và đắt nhất trên tàu hỏa, máy bay hoặc tàu thủy"
                },
                "examples": [
                    {
                        "en": "There is more room in first class.",
                        "vi": "Có nhiều chỗ hơn trong khoang hạng nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) the class of mail that is delivered most quickly",
                    "vi": "(ở Anh) loại thư được chuyển nhanh nhất"
                },
                "examples": [
                    {
                        "en": "First class costs more.",
                        "vi": "Hạng nhất đắt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) the class of mail that is used for letters",
                    "vi": "(ở Hoa Kỳ) loại thư được sử dụng cho các bức thư"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the highest standard of degree given by a British university",
                    "vi": "tiêu chuẩn cao nhất về bằng cấp của một trường đại học ở Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f1eb12a57d7a4c82a4244c25ca907332",
        "word": "nose",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/nəʊz/",
            "us": "/nəʊz/"
        },
        "nearby": [
            {
                "word": "the Norwich School",
                "pos": ""
            },
            {
                "word": "no-score draw",
                "pos": "noun"
            },
            {
                "word": "nose",
                "pos": "noun"
            },
            {
                "word": "nose",
                "pos": "verb"
            },
            {
                "word": "nose about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the face that sticks out above the mouth, used for breathing and smelling things",
                    "vi": "phần mặt nhô ra trên miệng, dùng để thở và ngửi mọi thứ"
                },
                "examples": [
                    {
                        "en": "She had dark eyes and a long narrow nose.",
                        "vi": "Cô có đôi mắt đen và chiếc mũi dài hẹp."
                    },
                    {
                        "en": "He broke his nose in the fight.",
                        "vi": "Anh ta bị gãy mũi trong cuộc chiến."
                    },
                    {
                        "en": "She wrinkled her nose in disgust.",
                        "vi": "Cô nhăn mũi chán ghét."
                    },
                    {
                        "en": "He pressed his nose up against the window.",
                        "vi": "Anh ta áp mũi vào cửa sổ."
                    },
                    {
                        "en": "through your nose Try to breathe through your nose.",
                        "vi": "bằng mũi Cố gắng thở bằng mũi."
                    },
                    {
                        "en": "He blew his nose (= cleared it by blowing strongly into a handkerchief).",
                        "vi": "Anh ấy xì mũi (= làm sạch bằng cách thổi mạnh vào khăn tay)."
                    },
                    {
                        "en": "a blocked/runny nose",
                        "vi": "bị nghẹt / chảy nước mũi"
                    },
                    {
                        "en": "Stop picking your nose! (= removing dirt from it with your finger)",
                        "vi": "Đừng ngoáy mũi! (= loại bỏ bụi bẩn khỏi nó bằng ngón tay của bạn)"
                    },
                    {
                        "en": "He held his nose as he passed the stinking dustbins.",
                        "vi": "Anh ta bịt mũi khi đi ngang qua những thùng rác bốc mùi."
                    },
                    {
                        "en": "(figurative) He held his nose and voted for the bill anyway.",
                        "vi": "(nghĩa bóng) Dù sao thì anh ấy cũng ôm mũi và bỏ phiếu cho dự luật."
                    },
                    {
                        "en": "He pushed his glasses up the bridge of his nose (= the hard part near the top).",
                        "vi": "Anh ấy đẩy kính lên sống mũi (= phần cứng ở gần đỉnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of nose mentioned",
                    "vi": "có loại mũi được đề cập"
                },
                "examples": [
                    {
                        "en": "red-nosed",
                        "vi": "mũi đỏ"
                    },
                    {
                        "en": "large-nosed",
                        "vi": "mũi to"
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a plane, spacecraft, etc.",
                    "vi": "phần trước của máy bay, tàu vũ trụ, v.v."
                },
                "examples": [
                    {
                        "en": "Heat detectors are fitted in the nose of the missile.",
                        "vi": "Các thiết bị phát hiện nhiệt được lắp trong mũi tên lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special ability for finding or recognizing something",
                    "vi": "một khả năng đặc biệt để tìm kiếm hoặc nhận ra một cái gì đó"
                },
                "examples": [
                    {
                        "en": "As a journalist, she has always had a nose for a good story.",
                        "vi": "Là một nhà báo, cô ấy luôn phải chú ý đến một câu chuyện hay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sense of smell",
                    "vi": "khứu giác"
                },
                "examples": [
                    {
                        "en": "a dog with a good nose",
                        "vi": "một con chó có mũi tốt"
                    },
                    {
                        "en": "(figurative) Good noses can always smell a fight brewing.",
                        "vi": "(nghĩa bóng) Những chiếc mũi tốt luôn có thể ngửi thấy mùi của một loại bia chiến đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a smell that is characteristic of a particular wine",
                    "vi": "một mùi đặc trưng của một loại rượu cụ thể"
                },
                "examples": [
                    {
                        "en": "This Cote de Beaune has a good nose, with apricot and raisin aromas.",
                        "vi": "Cote de Beaune này có một cái mũi tốt, với hương thơm của quả mơ và nho khô."
                    }
                ]
            },
            {
                "define": {
                    "en": "by only a small amount (used mostly when talking about horse racing)",
                    "vi": "chỉ với một lượng nhỏ (được sử dụng chủ yếu khi nói về đua ngựa)"
                },
                "examples": [
                    {
                        "en": "He lost his first race by a nose but won the next three.",
                        "vi": "Anh ta đã thua cuộc đua đầu tiên của mình bởi một mũi nhưng giành chiến thắng trong ba cuộc tiếp theo."
                    },
                    {
                        "en": "Glen's Diamond was declared the winner by a nose from the 11–4 favourite.",
                        "vi": "Glen's Diamond đã được tuyên bố là người chiến thắng bởi một chiếc mũi trong số 11–4 yêu thích."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something when you are angry that is meant to harm somebody else but that also harms you",
                    "vi": "làm điều gì đó khi bạn tức giận có nghĩa là để làm hại người khác nhưng điều đó cũng gây hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be guided by your sense of smell",
                    "vi": "được hướng dẫn bởi khứu giác của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go straight forward",
                    "vi": "đi thẳng về phía trước"
                },
                "examples": [
                    {
                        "en": "The garage is a mile ahead up the hill—just follow your nose.",
                        "vi": "Nhà để xe ở phía trước một dặm lên đồi — chỉ cần đi theo mũi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what seems right or reasonable, rather than following any particular rules",
                    "vi": "hành động theo những gì có vẻ đúng hoặc hợp lý, thay vì tuân theo bất kỳ quy tắc cụ thể nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say that people have their noses in the trough, you mean that they are trying to get a lot of money for themselves",
                    "vi": "nếu bạn nói rằng mọi người có cái mũi của họ, bạn có nghĩa là họ đang cố gắng kiếm thật nhiều tiền cho mình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to defeat somebody",
                    "vi": "để đánh bại ai đó"
                },
                "examples": [
                    {
                        "en": "We have to give him a bloody nose in the election.",
                        "vi": "Chúng tôi phải cho anh ta một máu mũi trong cuộc bầu cử."
                    },
                    {
                        "en": "Voters gave the government a bloody nose in the local elections.",
                        "vi": "Các cử tri đã cho chính phủ chảy máu mũi trong các cuộc bầu cử địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be reading something and giving it all your attention",
                    "vi": "đọc một cái gì đó và dành tất cả sự chú ý của bạn"
                },
                "examples": [
                    {
                        "en": "Peter always has his nose in a book.",
                        "vi": "Peter luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look around a place; to look for something in a place",
                    "vi": "để nhìn xung quanh một nơi; tìm kiếm thứ gì đó ở một nơi"
                },
                "examples": [
                    {
                        "en": "I’ll have a nose round and see what I can find.",
                        "vi": "Tôi sẽ xem xét những gì tôi có thể tìm thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is not upset or annoyed about something because it does not affect them in a bad way",
                    "vi": "được sử dụng để nói rằng ai đó không buồn hoặc khó chịu về điều gì đó bởi vì nó không ảnh hưởng đến họ theo cách xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to avoid doing anything wrong or illegal",
                    "vi": "để tránh làm bất cứ điều gì sai trái hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Since leaving prison, he's managed to keep his nose clean.",
                        "vi": "Kể từ khi ra tù, anh ấy đã cố gắng giữ cho mũi của mình sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try not to become involved in things that should not really involve you",
                    "vi": "cố gắng không tham gia vào những việc không thực sự liên quan đến bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to work hard for a long period of time without stopping",
                    "vi": "làm việc chăm chỉ trong một thời gian dài không ngừng nghỉ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody do everything you want; to control somebody completely",
                    "vi": "để khiến ai đó làm mọi thứ bạn muốn; để kiểm soát ai đó hoàn toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a way that suggests that you think that you are better than somebody or that something is not good enough for you",
                    "vi": "hành xử theo cách gợi ý rằng bạn nghĩ rằng bạn tốt hơn ai đó hoặc rằng điều gì đó không đủ tốt cho bạn"
                },
                "examples": [
                    {
                        "en": "People who live in that area tend to look down their noses at their poorer neighbours.",
                        "vi": "Những người sống trong khu vực đó có xu hướng coi thường những người hàng xóm nghèo hơn của họ."
                    },
                    {
                        "en": "They tend to look down their noses at people who drive small cars.",
                        "vi": "Họ có xu hướng cúi đầu nhìn những người lái xe ô tô nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if cars, etc. are nose to tail, they are moving slowly in a long line with little space between them",
                    "vi": "nếu ô tô, v.v. hướng mũi vào nhau, chúng đang di chuyển chậm trên một đường dài với rất ít khoảng trống giữa chúng"
                },
                "examples": [
                    {
                        "en": "The traffic was nose to tail for miles.",
                        "vi": "Giao thông nối đuôi nhau hàng dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "exactly",
                    "vi": "một cách chính xác"
                },
                "examples": [
                    {
                        "en": "The budget should hit the $136 billion target on the nose.",
                        "vi": "Ngân sách sẽ đạt được mục tiêu 136 tỷ đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay too much money for something",
                    "vi": "trả quá nhiều tiền cho một thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to become involved in something that should not involve you",
                    "vi": "cố gắng tham gia vào một cái gì đó không liên quan đến bạn"
                },
                "examples": [
                    {
                        "en": "He’s always poking his nose into other people’s business.",
                        "vi": "Anh ta luôn chúi mũi vào việc của người khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a polite way of referring to the fact that a woman is going to the toilet",
                    "vi": "một cách lịch sự để chỉ việc một người phụ nữ đi vệ sinh"
                },
                "examples": [
                    {
                        "en": "I'm just going to powder my nose.",
                        "vi": "Tôi chỉ đi đánh bột mũi thôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to upset or annoy somebody, especially by not giving them enough attention",
                    "vi": "làm khó chịu hoặc làm phiền ai đó, đặc biệt là bằng cách không dành đủ sự quan tâm cho họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep reminding somebody in an unkind way of their past mistakes",
                    "vi": "tiếp tục nhắc nhở ai đó một cách không tử tế về những sai lầm trong quá khứ của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a rude sign with your thumb on your nose; to show that you have no respect for somebody/something",
                    "vi": "ra dấu thô lỗ bằng ngón tay cái trên mũi; để thể hiện rằng bạn không tôn trọng ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The company just thumbs its nose at the legislation on pollution.",
                        "vi": "Công ty chỉ cần chú ý đến luật về ô nhiễm."
                    },
                    {
                        "en": "They thumb their noses at all of our traditions.",
                        "vi": "Họ chỉa mũi vào tất cả các truyền thống của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse something, especially because you do not think that it is good enough for you",
                    "vi": "từ chối một cái gì đó, đặc biệt là vì bạn không nghĩ rằng nó đủ tốt cho bạn"
                },
                "examples": [
                    {
                        "en": "The children turn up their noses at almost everything I cook.",
                        "vi": "Bọn trẻ chĩa mũi dùi vào hầu hết mọi thứ tôi nấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is under somebody’s nose, it is very close to them but they cannot see it",
                    "vi": "nếu một cái gì đó ở dưới mũi của ai đó, nó rất gần với họ nhưng họ không thể nhìn thấy nó"
                },
                "examples": [
                    {
                        "en": "I searched everywhere for the letter and it was under my nose all the time!",
                        "vi": "Tôi đã tìm kiếm khắp nơi để tìm bức thư và nó luôn ở dưới mũi tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something happens under somebody’s nose, they do not notice it even though it is not being done secretly",
                    "vi": "nếu có điều gì đó xảy ra dưới mũi ai đó, họ không nhận thấy điều đó mặc dù nó không được thực hiện một cách bí mật"
                },
                "examples": [
                    {
                        "en": "The police didn't know the drugs ring was operating right under their noses.",
                        "vi": "Cảnh sát không biết chiếc nhẫn ma túy đang hoạt động ngay dưới mũi họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is not friendly and suggests that you think that you are better than other people",
                    "vi": "theo cách không thân thiện và gợi ý rằng bạn nghĩ rằng bạn giỏi hơn những người khác"
                },
                "examples": [
                    {
                        "en": "She walked in with her nose in the air, ignoring everyone.",
                        "vi": "Cô ấy bước vào với mũi trong không khí, không để ý đến mọi người."
                    }
                ]
            }
        ]
    },
    {
        "id": "29a1fefc76b643a4b87b7db23dd0b961",
        "word": "safety belt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈseɪfti belt/",
            "us": "/ˈseɪfti belt/"
        },
        "nearby": [
            {
                "word": "safe space",
                "pos": "noun"
            },
            {
                "word": "safety",
                "pos": "noun"
            },
            {
                "word": "safety belt",
                "pos": "noun"
            },
            {
                "word": "safety catch",
                "pos": "noun"
            },
            {
                "word": "safety curtain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt that is attached to the seat in a car or a plane and that you fasten around yourself so that you are not thrown out of the seat if there is an accident",
                    "vi": "dây đai được gắn vào ghế trên ô tô hoặc máy bay và bạn buộc chặt quanh mình để không bị văng ra khỏi ghế nếu có tai nạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e12bc35beef04b6791f3e4cf0c66f11d",
        "word": "seat belt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːt belt/",
            "us": "/ˈsiːt belt/"
        },
        "nearby": [
            {
                "word": "seat",
                "pos": "noun"
            },
            {
                "word": "seat",
                "pos": "verb"
            },
            {
                "word": "seat belt",
                "pos": "noun"
            },
            {
                "word": "seating",
                "pos": "noun"
            },
            {
                "word": "seatmate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a belt that is attached to the seat in a car or plane and that you fasten around yourself so that you are not thrown out of the seat if there is an accident",
                    "vi": "dây đai được gắn vào ghế trên ô tô hoặc máy bay và bạn buộc chặt quanh mình để không bị văng ra khỏi ghế nếu có tai nạn"
                },
                "examples": [
                    {
                        "en": "Fasten your seat belts.",
                        "vi": "Buộc chặt dây an toàn của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c7332714d4d487293ab9138778cf324",
        "word": "tail",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/teɪl/",
            "us": "/teɪl/"
        },
        "nearby": [
            {
                "word": "t'ai chi ch'uan",
                "pos": "noun"
            },
            {
                "word": "taiga",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "verb"
            },
            {
                "word": "tail away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part that sticks out at the back of the body of a bird, an animal or a fish, which the animal can move from side to side or up and down",
                    "vi": "phần nhô ra ở phía sau cơ thể của một con chim, một con vật hoặc một con cá mà con vật có thể di chuyển từ bên này sang bên kia hoặc lên xuống"
                },
                "examples": [
                    {
                        "en": "The dog ran up, wagging its tail.",
                        "vi": "Con chó chạy đến, vẫy đuôi."
                    },
                    {
                        "en": "My dog loves to chase his tail.",
                        "vi": "Con chó của tôi rất thích đuổi theo đuôi của mình."
                    },
                    {
                        "en": "The male has beautiful tail feathers.",
                        "vi": "Con đực có bộ lông đuôi đẹp."
                    },
                    {
                        "en": "It was black from its nose to the tip of its tail.",
                        "vi": "Nó có màu đen từ mũi đến đầu đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of tail mentioned",
                    "vi": "có loại đuôi được đề cập"
                },
                "examples": [
                    {
                        "en": "a white-tailed eagle",
                        "vi": "đại bàng đuôi trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the back part of a plane, spacecraft, etc.",
                    "vi": "phần sau của máy bay, tàu vũ trụ, v.v."
                },
                "examples": [
                    {
                        "en": "The plane's tail section had broken off.",
                        "vi": "Phần đuôi của chiếc máy bay đã bị gãy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of something that sticks out at the back like a tail",
                    "vi": "một phần của cái gì đó nhô ra ở phía sau như một cái đuôi"
                },
                "examples": [
                    {
                        "en": "the tail of a kite",
                        "vi": "đuôi của một con diều"
                    }
                ]
            },
            {
                "define": {
                    "en": "the last part of something that is moving away from you",
                    "vi": "phần cuối cùng của thứ gì đó đang rời xa bạn"
                },
                "examples": [
                    {
                        "en": "the tail of the procession",
                        "vi": "đuôi của đám rước"
                    },
                    {
                        "en": "the truck at the tail of our convoy",
                        "vi": "chiếc xe tải ở đuôi đoàn xe của chúng tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long jacket divided at the back below the waist into two pieces that become narrower at the bottom, worn by men at very formal events",
                    "vi": "một chiếc áo khoác dài được chia ở phía sau dưới thắt lưng thành hai mảnh trở nên hẹp hơn ở phía dưới, được nam giới mặc tại các sự kiện rất trang trọng"
                },
                "examples": [
                    {
                        "en": "The men all wore top hat and tails.",
                        "vi": "Những người đàn ông đều đội mũ chóp và có đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a coin that does not have a picture of the head of a person on it, used as one choice when a coin is tossed to decide something",
                    "vi": "mặt của đồng xu không có hình đầu người trên đó, được sử dụng như một sự lựa chọn khi tung đồng xu để quyết định điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is sent to follow somebody secretly and find out information about where that person goes, what they do, etc.",
                    "vi": "một người được cử đi theo dõi ai đó một cách bí mật và tìm hiểu thông tin về nơi người đó đi, họ làm gì, v.v."
                },
                "examples": [
                    {
                        "en": "The police have put a tail on him.",
                        "vi": "Cảnh sát đã bắt được hắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to understand something",
                    "vi": "không thể hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't make head nor tail of what he was saying.",
                        "vi": "Tôi không thể hiểu rõ anh ta đang nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very busy but in fact achieve very little",
                    "vi": "rất bận rộn nhưng trên thực tế đạt được rất ít"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance",
                    "vi": "được sử dụng để hỏi ai đó mặt nào của đồng xu mà họ nghĩ sẽ hướng lên trên khi nó được tung ra để quyết định một điều gì đó tình cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if cars, etc. are nose to tail, they are moving slowly in a long line with little space between them",
                    "vi": "nếu ô tô, v.v. hướng mũi vào nhau, chúng đang di chuyển chậm trên một đường dài với rất ít khoảng trống giữa chúng"
                },
                "examples": [
                    {
                        "en": "The traffic was nose to tail for miles.",
                        "vi": "Giao thông nối đuôi nhau hàng dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "following behind somebody very closely, especially in a car",
                    "vi": "theo sau ai đó rất gần, đặc biệt là trong ô tô"
                },
                "examples": [
                    {
                        "en": "There’s been a white van sitting on my tail for the past ten miles.",
                        "vi": "Có một chiếc xe tải màu trắng đang ngồi trên đuôi tôi trong mười dặm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant feature that comes at the end of a story, an event, etc. and makes it less good, successful, etc.",
                    "vi": "một tính năng khó chịu xuất hiện ở cuối câu chuyện, sự kiện, v.v. và làm cho nó kém hay, thành công, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation in which the most important aspect is being influenced and controlled by somebody/something that is not as important",
                    "vi": "được sử dụng để mô tả một tình huống trong đó khía cạnh quan trọng nhất đang bị ảnh hưởng và kiểm soát bởi ai đó / điều gì đó không quan trọng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run away from a fight or dangerous situation",
                    "vi": "để chạy trốn khỏi một cuộc chiến hoặc tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "When they heard the sirens, they turned tail and ran.",
                        "vi": "Khi nghe tiếng còi, chúng quay đầu bỏ chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling ashamed or unhappy because you have been defeated or punished",
                    "vi": "cảm thấy xấu hổ hoặc không vui vì bạn đã bị đánh bại hoặc bị trừng phạt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "da3e8763b8194a848b72a30084267860",
        "word": "wing",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/wɪŋ/",
            "us": "/wɪŋ/"
        },
        "nearby": [
            {
                "word": "wine vinegar",
                "pos": "noun"
            },
            {
                "word": "wine waiter",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "verb"
            },
            {
                "word": "wing back",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the parts of the body of a bird, insect or bat that it uses for flying",
                    "vi": "một trong những bộ phận trên cơ thể của chim, côn trùng hoặc dơi mà nó sử dụng để bay"
                },
                "examples": [
                    {
                        "en": "The swan flapped its wings noisily.",
                        "vi": "Con thiên nga vỗ cánh ồn ào."
                    },
                    {
                        "en": "wing feathers",
                        "vi": "lông cánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wing of a chicken, etc. eaten as food",
                    "vi": "cánh của một con gà, v.v. được ăn làm thức ăn"
                },
                "examples": [
                    {
                        "en": "We ordered the fried chicken wings.",
                        "vi": "Chúng tôi gọi món cánh gà rán."
                    },
                    {
                        "en": "First, fry the chicken wings in the oil until they begin to brown.",
                        "vi": "Đầu tiên, chiên cánh gà trong dầu cho đến khi chúng bắt đầu chuyển sang màu nâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the large flat parts that stick out from the side of a plane and help to keep it in the air when it is flying",
                    "vi": "một trong những bộ phận phẳng lớn nhô ra khỏi thành bên của máy bay và giúp giữ nó trong không khí khi nó đang bay"
                },
                "examples": [
                    {
                        "en": "Salvage teams have been able to recover part of the wing of the plane.",
                        "vi": "Các đội trục vớt đã trục vớt được một phần cánh của máy bay."
                    },
                    {
                        "en": "The right wing grazed the runway on landing.",
                        "vi": "Cánh phải sượt qua đường băng khi hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a large building that sticks out from the main part",
                    "vi": "một phần của tòa nhà lớn nhô ra khỏi phần chính"
                },
                "examples": [
                    {
                        "en": "the east wing",
                        "vi": "cánh đông"
                    },
                    {
                        "en": "the new wing of the hospital",
                        "vi": "cánh mới của bệnh viện"
                    },
                    {
                        "en": "Our rooms were in the west wing.",
                        "vi": "Phòng của chúng tôi ở cánh phía tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a car that is above a wheel",
                    "vi": "một bộ phận của ô tô ở phía trên bánh xe"
                },
                "examples": [
                    {
                        "en": "There was a dent in the nearside wing.",
                        "vi": "Có một vết lõm ở cánh gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of an organization that has a particular function or whose members share the same opinions",
                    "vi": "một bộ phận của tổ chức có một chức năng cụ thể hoặc có các thành viên có cùng quan điểm"
                },
                "examples": [
                    {
                        "en": "The radical wing of the party was dissatisfied with the policies.",
                        "vi": "Cánh cấp tiến của đảng đã không hài lòng với các chính sách."
                    },
                    {
                        "en": "The political wing of the National Resistance Army entered into negotiations with the government.",
                        "vi": "Cánh chính trị của Quân đội Kháng chiến Quốc gia tham gia đàm phán với chính phủ."
                    },
                    {
                        "en": "They're on the left wing of the Labour Party.",
                        "vi": "Họ thuộc cánh trái của Đảng Lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "either of the attacking players who play towards the side of the playing area in sports such as football (soccer) or hockey",
                    "vi": "một trong các cầu thủ tấn công chơi về phía bên của khu vực chơi trong các môn thể thao như bóng đá (bóng đá) hoặc khúc côn cầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the far left or right side of the sports field",
                    "vi": "ngoài cùng bên trái hoặc bên phải của sân thể thao"
                },
                "examples": [
                    {
                        "en": "He plays on the wing.",
                        "vi": "Anh ấy chơi ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area at either side of the stage that cannot be seen by the audience",
                    "vi": "khu vực ở hai bên của sân khấu mà khán giả không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She watched every performance from the wings.",
                        "vi": "Cô ấy theo dõi mọi màn trình diễn từ đôi cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit a person’s freedom or power",
                    "vi": "để hạn chế quyền tự do hoặc quyền lực của một người"
                },
                "examples": [
                    {
                        "en": "Having a new baby to take care of has clipped her wings.",
                        "vi": "Có một em bé mới để chăm sóc đã chắp cánh cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass the exams that mean you are allowed to fly a plane",
                    "vi": "để vượt qua các kỳ thi có nghĩa là bạn được phép lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "ready to take over a particular job or be used in a particular situation when needed",
                    "vi": "sẵn sàng đảm nhận một công việc cụ thể hoặc được sử dụng trong một tình huống cụ thể khi cần thiết"
                },
                "examples": [
                    {
                        "en": "She was aware of a whole host of ambitious young managers waiting in the wings.",
                        "vi": "Cô nhận thức được rằng có rất nhiều nhà quản lý trẻ đầy tham vọng đang chờ đợi trong cánh."
                    },
                    {
                        "en": "There's a wealth of talent waiting in the wings of British theatre.",
                        "vi": "Có rất nhiều tài năng đang chờ đợi trong cánh của nhà hát Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "flying",
                    "vi": "bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with only a very slight chance of success",
                    "vi": "chỉ với một cơ hội thành công rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become more independent and confident and try new activities, etc.",
                    "vi": "để trở nên độc lập và tự tin hơn và thử các hoạt động mới, v.v."
                },
                "examples": [
                    {
                        "en": "Going to college gave her the chance to spread her wings.",
                        "vi": "Vào đại học đã cho cô cơ hội để chắp cánh cho mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of and help somebody who has less experience of something than you",
                    "vi": "để chăm sóc và giúp đỡ ai đó có ít kinh nghiệm về điều gì đó hơn bạn"
                },
                "examples": [
                    {
                        "en": "Simon's uncle had taken him under his wing.",
                        "vi": "Chú của Simon đã đưa anh ta về dưới trướng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly away",
                    "vi": "bay đi"
                },
                "examples": [
                    {
                        "en": "(figurative) Her imagination took wing.",
                        "vi": "(nghĩa bóng) Trí tưởng tượng của cô ấy đã thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "aaee5a4917cc4fc186bd50b4f85632b8",
        "word": "aisle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/aɪl/",
            "us": "/aɪl/"
        },
        "nearby": [
            {
                "word": "airy-fairy",
                "pos": "adjective"
            },
            {
                "word": "Aisha",
                "pos": ""
            },
            {
                "word": "aisle",
                "pos": "noun"
            },
            {
                "word": "Aisling",
                "pos": ""
            },
            {
                "word": "aitch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage between rows of seats in a church, theatre, train, etc., or between rows of shelves in a supermarket",
                    "vi": "lối đi giữa các hàng ghế trong nhà thờ, rạp hát, xe lửa, v.v. hoặc giữa các hàng kệ trong siêu thị"
                },
                "examples": [
                    {
                        "en": "an aisle seat (= in a plane or train)",
                        "vi": "ghế trên lối đi (= trên máy bay hoặc xe lửa)"
                    },
                    {
                        "en": "Coffee and tea are in the next aisle.",
                        "vi": "Cà phê và trà ở lối đi tiếp theo."
                    },
                    {
                        "en": "She looked radiant as she walked down the aisle on her father’s arm.",
                        "vi": "Cô trông rạng rỡ khi bước xuống lối đi trên tay bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get married",
                    "vi": "kết hôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "laughing a lot",
                    "vi": "cười rất nhiều"
                },
                "examples": [
                    {
                        "en": "She soon had us rolling in the aisles.",
                        "vi": "Cô ấy đã sớm bắt chúng tôi lăn bánh trên lối đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to either of two opposite opinions on an issue",
                    "vi": "dùng để chỉ một trong hai ý kiến trái ngược nhau về một vấn đề"
                },
                "examples": [
                    {
                        "en": "The two countries are often on opposite sides of the fence when it comes to climate change.",
                        "vi": "Hai quốc gia thường ở hai phía đối diện của hàng rào khi nói đến biến đổi khí hậu."
                    },
                    {
                        "en": "There are arguments on both sides of the aisle.",
                        "vi": "Hai bên lối đi có những cuộc tranh cãi."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1f201dfa5dc49e38931691ed545d5c3",
        "word": "cabin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkæbɪn/",
            "us": "/ˈkæbɪn/"
        },
        "nearby": [
            {
                "word": "caber",
                "pos": "noun"
            },
            {
                "word": "Cabernet Sauvignon",
                "pos": "noun"
            },
            {
                "word": "cabin",
                "pos": "noun"
            },
            {
                "word": "cabin boy",
                "pos": "noun"
            },
            {
                "word": "cabin crew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small room on a ship in which you live or sleep",
                    "vi": "một căn phòng nhỏ trên con tàu nơi bạn sống hoặc ngủ"
                },
                "examples": [
                    {
                        "en": "I lay in my cabin feeling miserably seasick.",
                        "vi": "Tôi nằm trong cabin của mình với cảm giác say sóng thảm hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the areas for passengers to sit in a plane",
                    "vi": "một trong những khu vực dành cho hành khách ngồi máy bay"
                },
                "examples": [
                    {
                        "en": "the first-class cabin",
                        "vi": "khoang hạng nhất"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small house or shelter, usually made of wood",
                    "vi": "một ngôi nhà nhỏ hoặc nơi trú ẩn, thường làm bằng gỗ"
                },
                "examples": [
                    {
                        "en": "a log cabin",
                        "vi": "nhà chòi bằng gỗ"
                    }
                ]
            }
        ]
    },
    {
        "id": "b2a6cae75a7048d4a1e3547ac8695464",
        "word": "jet engine",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒet endʒɪn/",
            "us": "/ˈdʒet endʒɪn/"
        },
        "nearby": [
            {
                "word": "jet",
                "pos": "verb"
            },
            {
                "word": "jet black",
                "pos": "adjective"
            },
            {
                "word": "jet engine",
                "pos": "noun"
            },
            {
                "word": "jetfoil",
                "pos": "noun"
            },
            {
                "word": "jet lag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an engine that drives an aircraft forwards by pushing out a stream of gases behind it",
                    "vi": "một động cơ đưa máy bay về phía trước bằng cách đẩy ra một dòng khí đằng sau nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "99cefe239efc4093a7c9f98fb440652d",
        "word": "legroom",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈleɡruːm/",
            "us": "/ˈleɡruːm/"
        },
        "nearby": [
            {
                "word": "Legoland",
                "pos": ""
            },
            {
                "word": "leg-pull",
                "pos": "noun"
            },
            {
                "word": "legroom",
                "pos": "noun"
            },
            {
                "word": "legume",
                "pos": "noun"
            },
            {
                "word": "leguminous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of space available for your legs when you are sitting in a car, plane, theatre, etc.",
                    "vi": "khoảng không gian dành cho đôi chân của bạn khi bạn ngồi trên ô tô, máy bay, rạp hát, v.v."
                },
                "examples": [
                    {
                        "en": "There’s not much legroom in the front of the car.",
                        "vi": "Không có nhiều chỗ để chân ở phía trước của xe."
                    },
                    {
                        "en": "The seats are comfortable, but there’s very little legroom.",
                        "vi": "Ghế ngồi thoải mái, nhưng có rất ít chỗ để chân."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce250a1a0fc24417b535ecd8db5ca7c8",
        "word": "sick bag",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɪk bæɡ/",
            "us": "/ˈsɪk bæɡ/"
        },
        "nearby": [
            {
                "word": "sick",
                "pos": "noun"
            },
            {
                "word": "sick",
                "pos": "verb"
            },
            {
                "word": "sick bag",
                "pos": "noun"
            },
            {
                "word": "sickbay",
                "pos": "noun"
            },
            {
                "word": "sickbed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a paper bag on a boat or plane into which you can vomit",
                    "vi": "một túi giấy trên thuyền hoặc máy bay mà bạn có thể nôn ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "39f0643a93e349cebff8881ed5d37dd4",
        "word": "automatic pilot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɔːtəmætɪk ˈpaɪlət/",
            "us": "/ˌɔːtəmætɪk ˈpaɪlət/"
        },
        "nearby": [
            {
                "word": "automatic license plate recognition",
                "pos": "noun"
            },
            {
                "word": "automatic number plate recognition",
                "pos": "noun"
            },
            {
                "word": "automatic pilot",
                "pos": "noun"
            },
            {
                "word": "automatic transmission",
                "pos": "noun"
            },
            {
                "word": "automatic writing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in an aircraft or a ship that keeps it on a fixed course without the need for a person to control it",
                    "vi": "một thiết bị trên máy bay hoặc tàu thủy giữ nó đi theo hướng cố định mà không cần người điều khiển"
                },
                "examples": [
                    {
                        "en": "The aircraft was set on automatic pilot.",
                        "vi": "Máy bay được thiết lập trên phi công tự động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something without thinking because you have done the same thing many times before",
                    "vi": "để làm điều gì đó mà không cần suy nghĩ bởi vì bạn đã làm điều tương tự nhiều lần trước đây"
                },
                "examples": [
                    {
                        "en": "I got up and dressed on automatic pilot.",
                        "vi": "Tôi đứng dậy và mặc quần áo phi công tự động."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a06df5eb15b4a659fb379cbddc43354",
        "word": "autopilot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɔːtəʊpaɪlət/",
            "us": "/ˈɔːtəʊpaɪlət/"
        },
        "nearby": [
            {
                "word": "autonomously",
                "pos": "adverb"
            },
            {
                "word": "autonomy",
                "pos": "noun"
            },
            {
                "word": "autopilot",
                "pos": "noun"
            },
            {
                "word": "autopsy",
                "pos": "noun"
            },
            {
                "word": "auto racing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in an aircraft or a ship that keeps it on a fixed course without the need for a person to control it",
                    "vi": "một thiết bị trên máy bay hoặc tàu thủy giữ nó đi theo hướng cố định mà không cần người điều khiển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something without thinking because you have done the same thing many times before",
                    "vi": "để làm điều gì đó mà không cần suy nghĩ bởi vì bạn đã làm điều tương tự nhiều lần trước đây"
                },
                "examples": [
                    {
                        "en": "I got up and dressed on autopilot.",
                        "vi": "Tôi đứng dậy và mặc quần áo trên máy lái tự động."
                    }
                ]
            }
        ]
    },
    {
        "id": "339ae499026a487e9635fae43e945b1f",
        "word": "blade",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bleɪd/",
            "us": "/bleɪd/"
        },
        "nearby": [
            {
                "word": "bladder",
                "pos": "noun"
            },
            {
                "word": "bladdered",
                "pos": "adjective"
            },
            {
                "word": "blade",
                "pos": "noun"
            },
            {
                "word": "blading",
                "pos": "noun"
            },
            {
                "word": "blag",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the flat part of a knife, tool or machine, which has a sharp edge or edges for cutting",
                    "vi": "phần phẳng của dao, dụng cụ hoặc máy có cạnh hoặc các cạnh sắc để cắt"
                },
                "examples": [
                    {
                        "en": "The machine comes with a plastic guard over the blade to protect the operator.",
                        "vi": "Máy đi kèm với một bộ phận bảo vệ bằng nhựa trên lưỡi dao để bảo vệ người vận hành."
                    },
                    {
                        "en": "Knife blades are generally made of stainless steel.",
                        "vi": "Lưỡi dao nói chung được làm bằng thép không gỉ."
                    },
                    {
                        "en": "The prisoner used a hacksaw blade to cut through the bars.",
                        "vi": "Người tù đã dùng một lưỡi cưa sắt để cắt xuyên song sắt."
                    },
                    {
                        "en": "He swung the blade with all his strength.",
                        "vi": "Anh vung kiếm bằng tất cả sức lực của mình."
                    },
                    {
                        "en": "The swordsmen weaved and dodged as their blades clashed over and over again.",
                        "vi": "Các kiếm sĩ đan và né tránh khi lưỡi kiếm của họ va chạm nhiều lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the flat parts that turn around in an engine or on a helicopter",
                    "vi": "một trong những bộ phận phẳng quay trong động cơ hoặc trên máy bay trực thăng"
                },
                "examples": [
                    {
                        "en": "the blades of a propeller",
                        "vi": "cánh của một cánh quạt"
                    },
                    {
                        "en": "rotor blades on a helicopter",
                        "vi": "cánh quạt trên máy bay trực thăng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the flat wide part of an oar (= one of the long straight pieces of wood that are used to row a boat) that goes in the water",
                    "vi": "phần phẳng rộng của mái chèo (= một trong những miếng gỗ dài thẳng dùng để chèo thuyền) đi trong nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a single flat leaf of grass",
                    "vi": "một lá cỏ phẳng"
                },
                "examples": [
                    {
                        "en": "Not a blade of grass stirred.",
                        "vi": "Không một ngọn cỏ khuấy động."
                    }
                ]
            },
            {
                "define": {
                    "en": "the flat metal part on the bottom of an ice skate",
                    "vi": "phần kim loại phẳng dưới đáy giày trượt băng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0d2a58f31a514bbb9ea914e52d302ab6",
        "word": "cargo",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɑːɡəʊ/",
            "us": "/ˈkɑːrɡəʊ/"
        },
        "nearby": [
            {
                "word": "care worker",
                "pos": "noun"
            },
            {
                "word": "careworn",
                "pos": "adjective"
            },
            {
                "word": "cargo",
                "pos": "noun"
            },
            {
                "word": "cargo pants",
                "pos": "noun"
            },
            {
                "word": "Carib",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the goods carried in a ship, an aircraft or a motor vehicle",
                    "vi": "hàng hóa được vận chuyển trên tàu thủy, máy bay hoặc một phương tiện cơ giới"
                },
                "examples": [
                    {
                        "en": "The tanker began to spill its cargo of oil.",
                        "vi": "Chiếc tàu chở dầu bắt đầu làm tràn dầu của nó."
                    },
                    {
                        "en": "a cargo ship",
                        "vi": "một con tàu chở hàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "4e5b91e75bdd46c485cc72902ebcc906",
        "word": "cockpit",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒkpɪt/",
            "us": "/ˈkɑːkpɪt/"
        },
        "nearby": [
            {
                "word": "cockleshell",
                "pos": "noun"
            },
            {
                "word": "cockney",
                "pos": "noun"
            },
            {
                "word": "cockpit",
                "pos": "noun"
            },
            {
                "word": "cockroach",
                "pos": "noun"
            },
            {
                "word": "John Cockroft",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area in a plane, boat or racing car where the pilot or driver sits",
                    "vi": "khu vực trên máy bay, thuyền hoặc xe đua nơi phi công hoặc người lái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7593ff6e766d4afab2367db243294ea2",
        "word": "hold",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/həʊld/",
            "us": "/həʊld/"
        },
        "nearby": [
            {
                "word": "Holby City",
                "pos": ""
            },
            {
                "word": "hold",
                "pos": "verb"
            },
            {
                "word": "hold",
                "pos": "noun"
            },
            {
                "word": "hold against",
                "pos": "phrasal verb"
            },
            {
                "word": "holdall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of holding somebody/something; the way you are holding somebody/something",
                    "vi": "hành động giữ ai đó / cái gì đó; cách bạn đang ôm ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "hold on somebody/something His hold on her arm tightened.",
                        "vi": "giữ chặt ai đó / cái gì đó Anh ấy ôm chặt lấy cánh tay của cô ấy."
                    },
                    {
                        "en": "He lost his hold on the rock and was swept away by the tide.",
                        "vi": "Anh ta mất khả năng bám vào tảng đá và bị thủy triều cuốn trôi."
                    },
                    {
                        "en": "Make sure you've got a steady hold on the camera.",
                        "vi": "Đảm bảo bạn đã cầm chắc máy ảnh."
                    },
                    {
                        "en": "She tried to keep hold of the child's hand.",
                        "vi": "Cô cố gắng giữ tay đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of holding somebody, especially in a fight or in a sport such as wrestling",
                    "vi": "một cách cụ thể để giữ ai đó, đặc biệt là trong một cuộc chiến hoặc trong một môn thể thao như đấu vật"
                },
                "examples": [
                    {
                        "en": "in a hold He still had me in a tight hold.",
                        "vi": "trong tình trạng bế tắc Anh vẫn giữ chặt tôi."
                    },
                    {
                        "en": "The wrestler put his opponent into a head hold.",
                        "vi": "Đô vật đặt đối thủ của mình vào thế ôm đầu."
                    },
                    {
                        "en": "The exercise called for the recruits to get out of various holds.",
                        "vi": "Cuộc tập trận kêu gọi các tân binh thoát ra khỏi các đợt giam giữ khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "influence, power or control over somebody/something",
                    "vi": "ảnh hưởng, quyền lực hoặc quyền kiểm soát ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He struggled to get a hold of his anger.",
                        "vi": "Anh cố gắng kìm chế cơn tức giận của mình."
                    },
                    {
                        "en": "hold over somebody/something What she knew about his past gave her a hold over him.",
                        "vi": "nắm giữ ai đó / điều gì đó Những gì cô ấy biết về quá khứ của anh ấy đã giúp cô ấy nắm giữ anh ấy."
                    },
                    {
                        "en": "hold on somebody/something This crisis had weakened his hold on power.",
                        "vi": "giữ chặt ai đó / cái gì đó Cuộc khủng hoảng này đã làm suy yếu khả năng nắm giữ quyền lực của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you can put your hands or feet when climbing",
                    "vi": "nơi bạn có thể đặt tay hoặc chân khi leo núi"
                },
                "examples": [
                    {
                        "en": "in a hold She put her foot firmly in the hold and pulled herself up.",
                        "vi": "Cô ấy đặt chân vào chỗ giữ và kéo người lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a ship or plane where the goods being carried are stored",
                    "vi": "phần của một con tàu hoặc máy bay nơi hàng hóa được vận chuyển được lưu trữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have or take somebody/something in your hands",
                    "vi": "có hoặc nắm lấy ai đó / thứ gì đó trong tay bạn"
                },
                "examples": [
                    {
                        "en": "He caught hold of her wrists so she couldn't get away.",
                        "vi": "Anh nắm lấy cổ tay cô để cô không thể thoát ra."
                    },
                    {
                        "en": "Lee got hold of the dog by its collar.",
                        "vi": "Lee đã nắm lấy cổ của con chó."
                    },
                    {
                        "en": "Quick, grab a hold of that rope.",
                        "vi": "Nhanh lên, nắm lấy sợi dây đó."
                    },
                    {
                        "en": "Gently, she took hold of the door handle and turned it.",
                        "vi": "Nhẹ nhàng, cô nắm lấy tay nắm cửa và xoay nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to contact or find somebody",
                    "vi": "để liên hệ hoặc tìm ai đó"
                },
                "examples": [
                    {
                        "en": "Where have you been? I've been trying to get hold of you all day.",
                        "vi": "Bạn đã ở đâu Tôi đã cố gắng giữ lấy bạn cả ngày."
                    },
                    {
                        "en": "Eventually, we got hold of Dan in New York.",
                        "vi": "Cuối cùng, chúng tôi đã nắm được Dan ở New York."
                    },
                    {
                        "en": "Do you know where I can get hold of a good plumber?",
                        "vi": "Bạn có biết tôi có thể tìm được một thợ sửa ống nước giỏi ở đâu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to find something that you want or need",
                    "vi": "để tìm một cái gì đó mà bạn muốn hoặc cần"
                },
                "examples": [
                    {
                        "en": "I need to get hold of Tom's address.",
                        "vi": "Tôi cần biết địa chỉ của Tom."
                    },
                    {
                        "en": "It's almost impossible to get hold of tickets for the final.",
                        "vi": "Gần như không thể cầm được vé xem trận chung kết."
                    },
                    {
                        "en": "The police do not know how the boy got hold of the knife.",
                        "vi": "Cảnh sát không biết làm thế nào mà cậu bé cầm được con dao."
                    },
                    {
                        "en": "How did the press get hold of the story?",
                        "vi": "Làm thế nào mà báo chí nắm bắt được câu chuyện?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to learn or understand something",
                    "vi": "để học hoặc hiểu điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand something in the wrong way",
                    "vi": "hiểu sai điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with no rules or limits on what somebody is allowed to do",
                    "vi": "không có quy tắc hoặc giới hạn về những gì ai đó được phép làm"
                },
                "examples": [
                    {
                        "en": "There will be no holds barred in his interview with the president this evening.",
                        "vi": "Sẽ không có bất kỳ điều gì bị cấm trong cuộc phỏng vấn của anh ấy với tổng thống vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "delayed until a later time or date",
                    "vi": "bị trì hoãn cho đến một thời gian hoặc ngày sau đó"
                },
                "examples": [
                    {
                        "en": "She put her career on hold to have a baby.",
                        "vi": "Cô tạm gác sự nghiệp để sinh con."
                    },
                    {
                        "en": "The project is on hold until more money is available.",
                        "vi": "Dự án đang tạm dừng cho đến khi có thêm tiền."
                    },
                    {
                        "en": "The department has placed its plans on hold pending the results of the elections.",
                        "vi": "Bộ đã tạm dừng các kế hoạch của mình trong khi chờ kết quả của cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person on the phone is put on hold, they have to wait until the person they want to talk to becomes free or has found out the information that is needed",
                    "vi": "nếu một người đang gọi điện thoại, họ phải đợi cho đến khi người mà họ muốn trò chuyện trở nên rảnh rỗi hoặc đã tìm ra thông tin cần thiết"
                },
                "examples": [
                    {
                        "en": "(British English) I’ll just pop you on hold.",
                        "vi": "(Anh Anh) Tôi sẽ chỉ cho bạn biết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have complete control over somebody/something; to become very strong",
                    "vi": "để bắt đầu có toàn quyền kiểm soát ai đó / cái gì đó; trở nên rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Panic took hold of him and he couldn't move.",
                        "vi": "Sự hoảng loạn nắm lấy anh và anh không thể di chuyển."
                    },
                    {
                        "en": "They got out of the house just before the flames took hold.",
                        "vi": "Họ ra khỏi nhà ngay trước khi ngọn lửa bùng lên."
                    },
                    {
                        "en": "It is best to treat the disease early before it takes a hold.",
                        "vi": "Tốt nhất bạn nên điều trị bệnh sớm trước khi khỏi bệnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c6cf5dc6a414616b6f9b2bb744999ee",
        "word": "intercom",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪntəkɒm/",
            "us": "/ˈɪntərkɑːm/"
        },
        "nearby": [
            {
                "word": "Intercity",
                "pos": "noun"
            },
            {
                "word": "intercollegiate",
                "pos": "adjective"
            },
            {
                "word": "intercom",
                "pos": "noun"
            },
            {
                "word": "intercommunication",
                "pos": "noun"
            },
            {
                "word": "interconnect",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of communication by phone or radio inside an office, plane, etc.; the device you press or switch on to start using this system",
                    "vi": "hệ thống liên lạc qua điện thoại hoặc radio bên trong văn phòng, máy bay, v.v.; thiết bị bạn nhấn hoặc bật để bắt đầu sử dụng hệ thống này"
                },
                "examples": [
                    {
                        "en": "over the intercom to announce something over the intercom",
                        "vi": "qua hệ thống liên lạc nội bộ để thông báo điều gì đó qua hệ thống liên lạc nội bộ"
                    },
                    {
                        "en": "They called him on the intercom.",
                        "vi": "Họ gọi cho anh ta qua hệ thống liên lạc nội bộ."
                    },
                    {
                        "en": "Mr Jack’s arrival was announced over the intercom.",
                        "vi": "Sự xuất hiện của ông Jack đã được thông báo qua hệ thống liên lạc nội bộ."
                    }
                ]
            }
        ]
    },
    {
        "id": "97d23ea4810a478eba55623baf13cac6",
        "word": "oxygen mask",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɒksɪdʒən mɑːsk/",
            "us": "/ˈɑːksɪdʒən mæsk/"
        },
        "nearby": [
            {
                "word": "oxygenator",
                "pos": "noun"
            },
            {
                "word": "oxygen bar",
                "pos": "noun"
            },
            {
                "word": "oxygen mask",
                "pos": "noun"
            },
            {
                "word": "oxygen tent",
                "pos": "noun"
            },
            {
                "word": "oxymoron",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device placed over the nose and mouth through which a person can breathe oxygen, for example in an aircraft or a hospital",
                    "vi": "một thiết bị được đặt qua mũi và miệng mà qua đó một người có thể thở oxy, ví dụ như trong máy bay hoặc bệnh viện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1c2a0e6c2e9d408c98063f4e2562bce8",
        "word": "radar",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈreɪdɑː(r)/",
            "us": "/ˈreɪdɑːr/"
        },
        "nearby": [
            {
                "word": "rad",
                "pos": "noun"
            },
            {
                "word": "RADA",
                "pos": ""
            },
            {
                "word": "radar",
                "pos": "noun"
            },
            {
                "word": "radar trap",
                "pos": "noun"
            },
            {
                "word": "raddled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that uses radio waves to find the position and movement of objects, for example planes and ships, when they cannot be seen",
                    "vi": "một hệ thống sử dụng sóng vô tuyến để tìm vị trí và chuyển động của các vật thể, ví dụ như máy bay và tàu, khi không thể nhìn thấy chúng"
                },
                "examples": [
                    {
                        "en": "They located the ship by radar.",
                        "vi": "Họ định vị con tàu bằng radar."
                    },
                    {
                        "en": "a radar screen",
                        "vi": "một màn hình radar"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people are not aware of something",
                    "vi": "được sử dụng để nói rằng mọi người không nhận thức được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Experts say a lot of corporate crime stays under the radar.",
                        "vi": "Các chuyên gia cho biết rất nhiều tội phạm doanh nghiệp vẫn nằm trong tầm ngắm."
                    },
                    {
                        "en": "The conflict has slipped below the radar of the mass media.",
                        "vi": "Cuộc xung đột đã tuột xuống dưới tầm ngắm của các phương tiện thông tin đại chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people’s attention is on or not on something",
                    "vi": "được sử dụng để nói rằng sự chú ý của mọi người đang tập trung vào hoặc không vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The issue of terrorism is back on the radar screen.",
                        "vi": "Vấn đề khủng bố đã trở lại trên màn hình radar."
                    },
                    {
                        "en": "Since the scandal broke, all other issues seem to have disappeared off the radar screen as far as the media is concerned.",
                        "vi": "Kể từ khi vụ bê bối nổ ra, tất cả các vấn đề khác dường như đã biến mất khỏi màn hình radar theo như phương tiện truyền thông quan tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "0cf304a727e94dc292ce38264b974c3c",
        "word": "stick",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/stɪk/",
            "us": "/stɪk/"
        },
        "nearby": [
            {
                "word": "STI",
                "pos": "noun"
            },
            {
                "word": "stick",
                "pos": "verb"
            },
            {
                "word": "stick",
                "pos": "noun"
            },
            {
                "word": "stickability",
                "pos": "noun"
            },
            {
                "word": "stick around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin piece of wood that has fallen or been broken from a tree",
                    "vi": "một mảnh gỗ mỏng bị rơi hoặc bị gãy từ cây"
                },
                "examples": [
                    {
                        "en": "We collected dry sticks to start a fire.",
                        "vi": "Chúng tôi thu thập những que củi khô để nhóm lửa."
                    },
                    {
                        "en": "He said he was beaten with a stick.",
                        "vi": "Anh ta nói rằng anh ta đã bị đánh bằng một cây gậy."
                    },
                    {
                        "en": "The boys were throwing sticks and stones at the dog.",
                        "vi": "Các cậu bé ném gậy và đá vào con chó."
                    },
                    {
                        "en": "Her arms and legs were like sticks (= very thin).",
                        "vi": "Tay và chân của cô ấy như que củi (= rất gầy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stick that you carry and use as a support when you are walking",
                    "vi": "một cây gậy mà bạn mang theo và sử dụng làm điểm tựa khi bạn đi bộ"
                },
                "examples": [
                    {
                        "en": "He walks with a stick these days, but he still gets about.",
                        "vi": "Anh ấy đi bộ với một cây gậy những ngày này, nhưng anh ấy vẫn đi được."
                    },
                    {
                        "en": "The old lady leant on her stick as she talked.",
                        "vi": "Bà cụ chống gậy khi nói chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, thin object that is used in some sports to hit or control the ball",
                    "vi": "một vật dài, mỏng được sử dụng trong một số môn thể thao để đánh hoặc kiểm soát bóng"
                },
                "examples": [
                    {
                        "en": "a hockey stick",
                        "vi": "một cây gậy khúc côn cầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, thin piece of something",
                    "vi": "một mảnh dài, mỏng của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The man had sticks of dynamite strapped to his chest.",
                        "vi": "Người đàn ông bị quấn một que thuốc nổ vào ngực."
                    },
                    {
                        "en": "a stick of gum",
                        "vi": "một thanh kẹo cao su"
                    },
                    {
                        "en": "carrot/cinnamon/celery sticks",
                        "vi": "que cà rốt / quế / cần tây"
                    },
                    {
                        "en": "(North American English) a stick of butter",
                        "vi": "(Tiếng Anh Bắc Mỹ) một miếng bơ"
                    },
                    {
                        "en": "The savoury dips were served with sticks of carrot and celery.",
                        "vi": "Nước chấm mặn được phục vụ với cà rốt và cần tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin piece of wood or plastic that you use for a particular purpose",
                    "vi": "một miếng gỗ hoặc nhựa mỏng mà bạn sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "pieces of pineapple on sticks",
                        "vi": "miếng dứa trên que"
                    },
                    {
                        "en": "The men were carrying spades and measuring sticks.",
                        "vi": "Những người đàn ông mang theo thuổng và que đo."
                    },
                    {
                        "en": "I used a selfie stick to take the picture.",
                        "vi": "Tôi đã sử dụng gậy tự sướng để chụp ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quantity of a substance, such as solid glue (= a sticky substance), that is sold in a small container with round ends and straight sides, and can be pushed further out of the container as it is used",
                    "vi": "Một lượng chất, chẳng hạn như keo đặc (= chất dính), được bán trong một hộp đựng nhỏ với các đầu tròn và các cạnh thẳng, và có thể được đẩy ra khỏi hộp đựng khi nó được sử dụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a stick with a handle in a plane that is used to control direction or height",
                    "vi": "một cây gậy có tay cầm trên mặt phẳng được sử dụng để điều khiển hướng hoặc độ cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a handle used to change the gears of a vehicle",
                    "vi": "một tay cầm được sử dụng để thay đổi các bánh răng của một chiếc xe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a baton, used by the person who conducts an orchestra",
                    "vi": "một dùi cui, được sử dụng bởi người chỉ huy một dàn nhạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "criticism or severe words",
                    "vi": "những lời chỉ trích hoặc nặng nề"
                },
                "examples": [
                    {
                        "en": "The referee got a lot of stick from the home fans.",
                        "vi": "Trọng tài đã dính rất nhiều đòn từ các CĐV nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "country areas, a long way from cities",
                    "vi": "các khu vực nông thôn, một chặng đường dài từ các thành phố"
                },
                "examples": [
                    {
                        "en": "We live out in the sticks.",
                        "vi": "Chúng tôi sống trong những cây gậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person",
                    "vi": "một người"
                },
                "examples": [
                    {
                        "en": "He's not such a bad old stick.",
                        "vi": "Anh ấy không phải là một cây gậy cũ xấu như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult situation when any action you take will have bad results",
                    "vi": "rơi vào tình huống khó khăn khi bất kỳ hành động nào bạn thực hiện đều có kết quả xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the use or threat of force or power",
                    "vi": "việc sử dụng hoặc đe dọa vũ lực hoặc quyền lực"
                },
                "examples": [
                    {
                        "en": "The authorities used quiet persuasion instead of the big stick.",
                        "vi": "Các nhà chức trách đã sử dụng sự thuyết phục yên lặng thay vì cây gậy lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you use the carrot and stick approach, you persuade somebody to try harder by offering them a reward if they do, or a punishment if they do not",
                    "vi": "nếu bạn sử dụng phương pháp tiếp cận củ cà rốt và cây gậy, bạn thuyết phục ai đó cố gắng hơn bằng cách đưa ra phần thưởng cho họ nếu họ làm như vậy hoặc một hình phạt nếu họ không làm"
                },
                "examples": [
                    {
                        "en": "The emphasis is on the carrot of incentive rather than the stick of taxes.",
                        "vi": "Sự nhấn mạnh là cà rốt của sự khuyến khích hơn là cây gậy của thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person in a group who is chosen or forced to perform an unpleasant duty or task",
                    "vi": "trở thành người trong nhóm được chọn hoặc buộc phải thực hiện một nhiệm vụ hoặc nhiệm vụ khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand something in the wrong way",
                    "vi": "hiểu sai điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a fact, an argument, etc. that is used in order to blame or punish somebody",
                    "vi": "một thực tế, một lập luận, v.v. được sử dụng để đổ lỗi hoặc trừng phạt ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly move from your house and go to live somewhere else",
                    "vi": "đột ngột chuyển khỏi nhà của bạn và đi đến một nơi khác"
                },
                "examples": [
                    {
                        "en": "He upped sticks and went back to France.",
                        "vi": "Anh ta chống gậy và quay trở lại Pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "502d340f5c7d4083845c929ec4ebb7e8",
        "word": "aft",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɑːft/",
            "us": "/æft/"
        },
        "nearby": [
            {
                "word": "Afro-Caribbean",
                "pos": "adjective"
            },
            {
                "word": "Afrocentric",
                "pos": "adjective"
            },
            {
                "word": "aft",
                "pos": "adverb, adjective"
            },
            {
                "word": "after",
                "pos": "preposition"
            },
            {
                "word": "after",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in, near or towards the back of a ship or an aircraft",
                    "vi": "ở, gần hoặc về phía sau của một con tàu hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "fore and aft of the cockpit",
                        "vi": "phía trước và phía sau buồng lái"
                    },
                    {
                        "en": "The ship was moored to the dock fore and aft.",
                        "vi": "Con tàu được thả vào bến phía trước và phía sau."
                    },
                    {
                        "en": "the aft cabin/deck",
                        "vi": "cabin / boong phía sau"
                    }
                ]
            }
        ]
    },
    {
        "id": "a806485c729d4d029c301fa861fed78d",
        "word": "aileron",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeɪlərɒn/",
            "us": "/ˈeɪlərɑːn/"
        },
        "nearby": [
            {
                "word": "aikido",
                "pos": "noun"
            },
            {
                "word": "ail",
                "pos": "verb"
            },
            {
                "word": "aileron",
                "pos": "noun"
            },
            {
                "word": "ailing",
                "pos": "adjective"
            },
            {
                "word": "ailment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of the wing of a plane that moves up and down to control the plane’s balance",
                    "vi": "một bộ phận của cánh máy bay chuyển động lên xuống để điều khiển sự cân bằng của máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e8133118964949368b402061ff1046d0",
        "word": "altimeter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæltɪmiːtə(r)/",
            "us": "/ælˈtɪmətər/"
        },
        "nearby": [
            {
                "word": "Althea",
                "pos": ""
            },
            {
                "word": "although",
                "pos": "conjunction"
            },
            {
                "word": "altimeter",
                "pos": "noun"
            },
            {
                "word": "altitude",
                "pos": "noun"
            },
            {
                "word": "altitude sickness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an instrument for showing height above sea level, used especially in an aircraft",
                    "vi": "một công cụ để hiển thị độ cao trên mực nước biển, được sử dụng đặc biệt trên máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "588fc52a99d44e7bab8d1f04c121850e",
        "word": "black box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌblæk ˈbɒks/",
            "us": "/ˌblæk ˈbɑːks/"
        },
        "nearby": [
            {
                "word": "blackboard",
                "pos": "noun"
            },
            {
                "word": "black bottom",
                "pos": "noun"
            },
            {
                "word": "black box",
                "pos": "noun"
            },
            {
                "word": "black bun",
                "pos": "noun"
            },
            {
                "word": "Blackburn",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small machine in a plane that records all the details of each flight and is useful for finding out the cause of an accident",
                    "vi": "một chiếc máy nhỏ trên máy bay ghi lại tất cả các chi tiết của mỗi chuyến bay và rất hữu ích để tìm ra nguyên nhân của một vụ tai nạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a complicated piece of equipment, usually electronic, that you know produces particular results, but that you do not completely understand",
                    "vi": "một thiết bị phức tạp, thường là thiết bị điện tử, mà bạn biết tạo ra kết quả cụ thể, nhưng bạn không hoàn toàn hiểu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5d1efdbd5944a90a04e7cc364809b8b",
        "word": "bulkhead",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌlkhed/",
            "us": "/ˈbʌlkhed/"
        },
        "nearby": [
            {
                "word": "bulk",
                "pos": "noun"
            },
            {
                "word": "bulk",
                "pos": "verb"
            },
            {
                "word": "bulkhead",
                "pos": "noun"
            },
            {
                "word": "bulk out",
                "pos": "phrasal verb"
            },
            {
                "word": "bulk up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall that divides a ship or an aircraft into separate parts",
                    "vi": "một bức tường chia một con tàu hoặc một chiếc máy bay thành các phần riêng biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c474e1abac98481ab2454927dda376ef",
        "word": "canopy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænəpi/",
            "us": "/ˈkænəpi/"
        },
        "nearby": [
            {
                "word": "canoodle",
                "pos": "verb"
            },
            {
                "word": "can opener",
                "pos": "noun"
            },
            {
                "word": "canopy",
                "pos": "noun"
            },
            {
                "word": "canst",
                "pos": "verb"
            },
            {
                "word": "cant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cover that is fixed or hangs above a bed, seat, etc. as a shelter or decoration",
                    "vi": "một tấm phủ được cố định hoặc treo phía trên giường, chỗ ngồi, v.v. làm nơi trú ẩn hoặc trang trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a layer of something that spreads over an area like a roof, especially branches of trees in a forest",
                    "vi": "một lớp thứ gì đó trải rộng trên một khu vực như mái nhà, đặc biệt là các cành cây trong rừng"
                },
                "examples": [
                    {
                        "en": "The canopy of a rainforest is about 10 metres thick.",
                        "vi": "Tán của một khu rừng nhiệt đới dày khoảng 10 mét."
                    },
                    {
                        "en": "a canopy of leaves",
                        "vi": "một tán lá"
                    },
                    {
                        "en": "a glorious canopy of stars",
                        "vi": "một tán sao huy hoàng"
                    },
                    {
                        "en": "We could see the sky through gaps in the forest canopy.",
                        "vi": "Chúng tôi có thể nhìn thấy bầu trời qua những khoảng trống trong tán rừng."
                    },
                    {
                        "en": "The trees formed a leafy canopy above their heads.",
                        "vi": "Cây cối tạo thành một tán lá trên đầu."
                    },
                    {
                        "en": "a thick canopy of branches",
                        "vi": "một tán cây dày"
                    }
                ]
            },
            {
                "define": {
                    "en": "a roof that is supported on posts and is sometimes also attached at one side to a building",
                    "vi": "một mái nhà được hỗ trợ trên các cột và đôi khi cũng được gắn ở một bên của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a new steel entrance canopy for the building",
                        "vi": "một mái che lối vào bằng thép mới cho tòa nhà"
                    },
                    {
                        "en": "a fabric canopy to provide shade in the backyard",
                        "vi": "một tán vải để cung cấp bóng râm ở sân sau"
                    }
                ]
            },
            {
                "define": {
                    "en": "a cover for the cockpit of an aircraft",
                    "vi": "nắp buồng lái máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47ce068de9d94820bb12e80871c6b067",
        "word": "club class",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklʌb klɑːs/",
            "us": "/ˈklʌb klæs/"
        },
        "nearby": [
            {
                "word": "clubbing",
                "pos": "noun"
            },
            {
                "word": "club car",
                "pos": "noun"
            },
            {
                "word": "club class",
                "pos": "noun"
            },
            {
                "word": "club foot",
                "pos": "noun"
            },
            {
                "word": "club-footed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a plane where passengers have a high level of comfort and service, designed for people travelling on business, and less expensive than first class",
                    "vi": "phần của máy bay nơi hành khách có mức độ thoải mái và dịch vụ cao, được thiết kế cho những người đi công tác và ít tốn kém hơn so với khoang hạng nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce5edf9fef18468d95a5e9b0dd8969b5",
        "word": "cowling",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊlɪŋ/",
            "us": "/ˈkaʊlɪŋ/"
        },
        "nearby": [
            {
                "word": "Abraham Cowley",
                "pos": ""
            },
            {
                "word": "cowlick",
                "pos": "noun"
            },
            {
                "word": "cowling",
                "pos": "noun"
            },
            {
                "word": "cowl neck",
                "pos": "noun"
            },
            {
                "word": "co-worker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal cover for an engine, especially on an aircraft",
                    "vi": "vỏ kim loại cho động cơ, đặc biệt là trên máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5709845d5ecd4819b4b573cd00a9978b",
        "word": "delta wing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeltə wɪŋ/",
            "us": "/ˈdeltə wɪŋ/"
        },
        "nearby": [
            {
                "word": "delta rays",
                "pos": "noun"
            },
            {
                "word": "delta rhythm",
                "pos": "noun"
            },
            {
                "word": "delta wing",
                "pos": "noun"
            },
            {
                "word": "deltoids",
                "pos": "noun"
            },
            {
                "word": "delude",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a single wing in the shape of a triangle on some aircraft, especially on military planes",
                    "vi": "một cánh đơn hình tam giác trên một số máy bay, đặc biệt là trên máy bay quân sự"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "24af07c460db4950a75ce7ae64a6fbd2",
        "word": "dual controls",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuːəl kənˈtrəʊlz/",
            "us": "/ˌduːəl kənˈtrəʊlz/"
        },
        "nearby": [
            {
                "word": "dual carriageway",
                "pos": "noun"
            },
            {
                "word": "dual control",
                "pos": "adjective"
            },
            {
                "word": "dual controls",
                "pos": "noun"
            },
            {
                "word": "dualism",
                "pos": "noun"
            },
            {
                "word": "dualist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "two sets of instruments for controlling a vehicle or aircraft, so that a teacher, for example, can take control from the driver",
                    "vi": "hai bộ công cụ để điều khiển phương tiện hoặc máy bay, để giáo viên, chẳng hạn, có thể nắm quyền điều khiển từ người lái xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3cd1ebbdceff4f4791424e82416a144b",
        "word": "ejector seat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈdʒektə siːt/",
            "us": "/ɪˈdʒektər siːt/"
        },
        "nearby": [
            {
                "word": "eject",
                "pos": "verb"
            },
            {
                "word": "ejection",
                "pos": "noun"
            },
            {
                "word": "ejector seat",
                "pos": "noun"
            },
            {
                "word": "ekdam",
                "pos": "adverb"
            },
            {
                "word": "eke",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a seat that allows a pilot to be thrown out of an aircraft in an emergency",
                    "vi": "ghế cho phép phi công ném ra khỏi máy bay trong trường hợp khẩn cấp"
                },
                "examples": [
                    {
                        "en": "The pilot was saved by the ejector seat.",
                        "vi": "Phi công đã được cứu nhờ ghế phóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "67c865d0e4d34e6ba1745b26f0e513d9",
        "word": "elevator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈelɪveɪtə(r)/",
            "us": "/ˈelɪveɪtər/"
        },
        "nearby": [
            {
                "word": "elevating",
                "pos": "adjective"
            },
            {
                "word": "elevation",
                "pos": "noun"
            },
            {
                "word": "elevator",
                "pos": "noun"
            },
            {
                "word": "eleven",
                "pos": ""
            },
            {
                "word": "eleven-plus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine that carries people or goods up and down to different levels in a building or a mine",
                    "vi": "máy vận chuyển người hoặc hàng hóa lên và xuống các tầng khác nhau trong tòa nhà hoặc hầm mỏ"
                },
                "examples": [
                    {
                        "en": "It's on the fifth floor, so we'd better take the elevator.",
                        "vi": "Nó ở tầng năm, vì vậy tốt hơn chúng ta nên đi thang máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall building used to store grain and that contains equipment to move it",
                    "vi": "một tòa nhà cao được sử dụng để lưu trữ ngũ cốc và có thiết bị để di chuyển nó"
                },
                "examples": [
                    {
                        "en": "In the harbour a giant elevator stores prairie grain.",
                        "vi": "Trong bến cảng, một chiếc thang máy khổng lồ lưu trữ ngũ cốc thảo nguyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part in the tail of an aircraft that is moved to make it go up and down",
                    "vi": "một bộ phận ở đuôi của máy bay được di chuyển để làm cho nó đi lên và đi xuống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0867621f30454707a6dc27587190bda9",
        "word": "fin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɪn/",
            "us": "/fɪn/"
        },
        "nearby": [
            {
                "word": "filtrate",
                "pos": "noun"
            },
            {
                "word": "filtration",
                "pos": "noun"
            },
            {
                "word": "fin",
                "pos": "noun"
            },
            {
                "word": "finagle",
                "pos": "verb"
            },
            {
                "word": "final",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a fish, used for swimming and keeping balance",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi cơ thể cá, dùng để bơi và giữ thăng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a vehicle, an aircraft, etc., used for improving its balance and movement",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi thân xe, máy bay, v.v., được sử dụng để cải thiện khả năng giữ thăng bằng và chuyển động của nó"
                },
                "examples": [
                    {
                        "en": "tail fins",
                        "vi": "Vây đuôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "174afc46e582475da0f03dad62c83996",
        "word": "flap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/flæp/",
            "us": "/flæp/"
        },
        "nearby": [
            {
                "word": "flannel",
                "pos": "noun"
            },
            {
                "word": "flannelette",
                "pos": "noun"
            },
            {
                "word": "flap",
                "pos": "noun"
            },
            {
                "word": "flap",
                "pos": "verb"
            },
            {
                "word": "flapjack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat piece of paper, cloth, metal, etc. that is attached to something along one side and that hangs down or covers an opening",
                    "vi": "một mảnh giấy phẳng, vải, kim loại, v.v. được gắn vào thứ gì đó dọc theo một bên và treo xuống hoặc che một lỗ hở"
                },
                "examples": [
                    {
                        "en": "the flap of an envelope",
                        "vi": "nắp của một phong bì"
                    },
                    {
                        "en": "I zipped the tent flaps shut.",
                        "vi": "Tôi đóng nắp lều lại."
                    },
                    {
                        "en": "The jacket was fastened with a complicated buttoned flap.",
                        "vi": "Chiếc áo khoác được buộc chặt với một vạt cài cúc phức tạp."
                    },
                    {
                        "en": "He was wearing a deerstalker hat with flaps to cover the ears.",
                        "vi": "Anh ta đang đội một chiếc mũ tai bèo với hai bên tai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quick often noisy movement of something up and down or from side to side",
                    "vi": "một chuyển động nhanh thường ồn ào của một thứ gì đó lên xuống hoặc từ bên này sang bên kia"
                },
                "examples": [
                    {
                        "en": "With a flap of its wings, the bird was gone.",
                        "vi": "Với một cái vỗ cánh của nó, con chim đã biến mất."
                    },
                    {
                        "en": "the flap of the sails",
                        "vi": "cánh buồm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of worry and excitement",
                    "vi": "trạng thái lo lắng và phấn khích"
                },
                "examples": [
                    {
                        "en": "She gets in a flap over the slightest thing.",
                        "vi": "Cô ấy bị bất ngờ vì điều nhỏ nhặt nhất."
                    },
                    {
                        "en": "Harry’s in a bit of a flap over this interview tomorrow.",
                        "vi": "Harry sẽ hơi lo lắng về cuộc phỏng vấn này vào ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "public anger or criticism caused by something a public figure has said or done",
                    "vi": "sự tức giận của công chúng hoặc sự chỉ trích gây ra bởi điều gì đó mà một nhân vật của công chúng đã nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "the flap about the President’s business affairs",
                        "vi": "bài báo về các vấn đề kinh doanh của Tổng thống"
                    },
                    {
                        "en": "a flap over nuclear issues",
                        "vi": "lật tẩy các vấn đề hạt nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of the wing of an aircraft, at the back of the wing, that can be moved up or down to control movement in either direction",
                    "vi": "một bộ phận của cánh máy bay, ở phía sau cánh, có thể di chuyển lên hoặc xuống để điều khiển chuyển động theo một trong hai hướng"
                },
                "examples": [
                    {
                        "en": "The wing flaps were not extended at the time of the accident.",
                        "vi": "Các cánh tà không được mở rộng vào thời điểm xảy ra tai nạn."
                    },
                    {
                        "en": "The pilot lowered the flaps as the aircraft came into land.",
                        "vi": "Phi công hạ cánh tà xuống khi máy bay hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a speech sound that is produced by striking the tongue quickly and lightly against the part of the mouth behind the upper front teeth",
                    "vi": "âm thanh nói được tạo ra bằng cách đánh lưỡi nhanh và nhẹ vào phần miệng phía sau răng cửa trên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "55b9d70b84db45c7a142af55257b31da",
        "word": "flight deck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflaɪt dek/",
            "us": "/ˈflaɪt dek/"
        },
        "nearby": [
            {
                "word": "flight attendant",
                "pos": "noun"
            },
            {
                "word": "flight crew",
                "pos": "noun"
            },
            {
                "word": "flight deck",
                "pos": "noun"
            },
            {
                "word": "flight jacket",
                "pos": "noun"
            },
            {
                "word": "flightless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area at the front of a large plane where the pilot sits to use the controls and fly the plane",
                    "vi": "một khu vực phía trước máy bay lớn nơi phi công ngồi để sử dụng các điều khiển và lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long flat surface on top of a ship that carries aircraft (= an aircraft carrier) where they take off and land",
                    "vi": "một bề mặt phẳng dài trên đầu tàu chở máy bay (= tàu sân bay) nơi chúng cất cánh và hạ cánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "58a174823b764f709048a374240d9b82",
        "word": "flight recorder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflaɪt rɪkɔːdə(r)/",
            "us": "/ˈflaɪt rɪkɔːrdər/"
        },
        "nearby": [
            {
                "word": "flight officer",
                "pos": "noun"
            },
            {
                "word": "flight path",
                "pos": "noun"
            },
            {
                "word": "flight recorder",
                "pos": "noun"
            },
            {
                "word": "flight sergeant",
                "pos": "noun"
            },
            {
                "word": "flight shame",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small machine in a plane that records all the details of each flight and is useful for finding out the cause of an accident",
                    "vi": "một chiếc máy nhỏ trên máy bay ghi lại tất cả các chi tiết của mỗi chuyến bay và rất hữu ích để tìm ra nguyên nhân của một vụ tai nạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1be56e02b4504c04ad4c3b878b547407",
        "word": "fuselage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfjuːzəlɑːʒ/",
            "us": "/ˈfjuːsəlɑːʒ/"
        },
        "nearby": [
            {
                "word": "fuse",
                "pos": "verb"
            },
            {
                "word": "fuse box",
                "pos": "noun"
            },
            {
                "word": "fuselage",
                "pos": "noun"
            },
            {
                "word": "fuse wire",
                "pos": "noun"
            },
            {
                "word": "fusilier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main part of an aircraft in which passengers and goods are carried",
                    "vi": "bộ phận chính của máy bay mà hành khách và hàng hóa được chuyên chở"
                },
                "examples": [
                    {
                        "en": "Repairs to the fuselage are almost complete.",
                        "vi": "Việc sửa chữa thân máy bay gần như hoàn tất."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d39427d3587494680d50c541c4715e2",
        "word": "galley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæli/",
            "us": "/ˈɡæli/"
        },
        "nearby": [
            {
                "word": "galleried",
                "pos": "adjective"
            },
            {
                "word": "gallery",
                "pos": "noun"
            },
            {
                "word": "galley",
                "pos": "noun"
            },
            {
                "word": "galliard",
                "pos": "noun"
            },
            {
                "word": "Gallic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long flat ship with sails, especially one used by the ancient Greeks or Romans in war, usually rowed by slaves or prisoners",
                    "vi": "một con tàu phẳng dài có buồm, đặc biệt là con tàu được người Hy Lạp hoặc La Mã cổ đại sử dụng trong chiến tranh, thường được chèo bởi nô lệ hoặc tù nhân"
                },
                "examples": [
                    {
                        "en": "a galley slave",
                        "vi": "một nô lệ galley"
                    }
                ]
            },
            {
                "define": {
                    "en": "the kitchen on a ship or plane",
                    "vi": "nhà bếp trên tàu hoặc máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "319bb9cdcfb84754ab2a6f0f78c82eca",
        "word": "gangway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋweɪ/",
            "us": "/ˈɡæŋweɪ/"
        },
        "nearby": [
            {
                "word": "gang together",
                "pos": "phrasal verb"
            },
            {
                "word": "gang up",
                "pos": "phrasal verb"
            },
            {
                "word": "gangway",
                "pos": "noun"
            },
            {
                "word": "ganja",
                "pos": "noun"
            },
            {
                "word": "gannet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage between rows of seats in a theatre, an aircraft, etc.",
                    "vi": "lối đi giữa các hàng ghế trong rạp hát, máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "I made my way along the narrow gangway.",
                        "vi": "Tôi đã đi theo con đường hẹp."
                    },
                    {
                        "en": "His suitcase was blocking the gangway.",
                        "vi": "Chiếc vali của anh ta nằm chắn ngang đường băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bridge placed between the side of a ship and land so people can get on and off",
                    "vi": "một cây cầu được đặt giữa mạn tàu và đất liền để mọi người có thể lên và xuống"
                },
                "examples": [
                    {
                        "en": "They staggered down the gangway to the quay.",
                        "vi": "Họ loạng choạng đi xuống đường sắt để đến bến tàu."
                    },
                    {
                        "en": "They finally agreed to let us on board and we climbed the gangway.",
                        "vi": "Cuối cùng họ đồng ý cho chúng tôi lên tàu và chúng tôi leo lên đường băng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea7d492cbb1940b78b8bf54a2aad4434",
        "word": "gyroscope",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒaɪrəskəʊp/",
            "us": "/ˈdʒaɪrəskəʊp/"
        },
        "nearby": [
            {
                "word": "gyratory",
                "pos": "adjective"
            },
            {
                "word": "gyratory",
                "pos": "noun"
            },
            {
                "word": "gyroscope",
                "pos": "noun"
            },
            {
                "word": "gyroscopic",
                "pos": "adjective"
            },
            {
                "word": "H2O",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device consisting of a wheel that turns rapidly inside a frame and does not change position when the frame is moved. Gyroscopes are often used to keep ships and aircraft steady.",
                    "vi": "một thiết bị bao gồm một bánh xe quay nhanh dần đều bên trong khung và không thay đổi vị trí khi khung được chuyển động. Con quay hồi chuyển thường được sử dụng để giữ cho tàu và máy bay ổn định."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3e4cecb09483451793e44431bafdcee6",
        "word": "hatch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hætʃ/",
            "us": "/hætʃ/"
        },
        "nearby": [
            {
                "word": "hatbox",
                "pos": "noun"
            },
            {
                "word": "hatch",
                "pos": "verb"
            },
            {
                "word": "hatch",
                "pos": "noun"
            },
            {
                "word": "Hatchards",
                "pos": ""
            },
            {
                "word": "hatchback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening or a door in a ship, aircraft or spacecraft",
                    "vi": "một sự mở hoặc một cánh cửa trong một con tàu, máy bay hoặc tàu vũ trụ"
                },
                "examples": [
                    {
                        "en": "The engineer was peering into the service hatch.",
                        "vi": "Kỹ sư đang chăm chú vào cửa hầm dịch vụ."
                    },
                    {
                        "en": "an escape hatch",
                        "vi": "một lối thoát hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening in a wall between two rooms, especially a kitchen and a dining room, through which food can be passed",
                    "vi": "một khe hở trong bức tường giữa hai phòng, đặc biệt là nhà bếp và phòng ăn, qua đó thức ăn có thể đi qua"
                },
                "examples": [
                    {
                        "en": "a serving hatch",
                        "vi": "một khẩu phần ăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening or a door in a floor or ceiling",
                    "vi": "một lỗ mở hoặc một cánh cửa trên sàn nhà hoặc trần nhà"
                },
                "examples": [
                    {
                        "en": "a hatch to the attic",
                        "vi": "một cửa sập cho tầng áp mái"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare yourself for a period of difficulty or trouble",
                    "vi": "để chuẩn bị cho mình trong một giai đoạn khó khăn hoặc rắc rối"
                },
                "examples": [
                    {
                        "en": "A natural tendency in times of recession is to batten down the hatches and think about our own needs.",
                        "vi": "Một xu hướng tự nhiên trong thời kỳ suy thoái là thu mình lại và suy nghĩ về nhu cầu của chính chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut all the entrances to the lower part, especially because a storm is expected",
                    "vi": "đóng tất cả các lối vào phần dưới, đặc biệt là vì dự kiến sẽ có bão"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used before drinking something, especially to express good wishes before drinking alcohol",
                    "vi": "được sử dụng trước khi uống một thứ gì đó, đặc biệt là để bày tỏ những lời chúc tốt đẹp trước khi uống rượu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "72b11d55e9a0462180c21a380229e98c",
        "word": "hatchway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhætʃweɪ/",
            "us": "/ˈhætʃweɪ/"
        },
        "nearby": [
            {
                "word": "hatchet man",
                "pos": "noun"
            },
            {
                "word": "hatchling",
                "pos": "noun"
            },
            {
                "word": "hatchway",
                "pos": "noun"
            },
            {
                "word": "hate",
                "pos": "verb"
            },
            {
                "word": "hate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening or a door in a ship, aircraft or spacecraft",
                    "vi": "một sự mở hoặc một cánh cửa trong một con tàu, máy bay hoặc tàu vũ trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2ca57d9c25e41ed937262ce0c6cbabe",
        "word": "inboard",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪnbɔːd/",
            "us": "/ˈɪnbɔːrd/"
        },
        "nearby": [
            {
                "word": "inauthentic",
                "pos": "adjective"
            },
            {
                "word": "inauthenticity",
                "pos": "noun"
            },
            {
                "word": "inboard",
                "pos": "adjective"
            },
            {
                "word": "inboard",
                "pos": "adverb"
            },
            {
                "word": "inborn",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "located on the inside of a boat, plane or car",
                    "vi": "nằm bên trong thuyền, máy bay hoặc ô tô"
                },
                "examples": [
                    {
                        "en": "an inboard motor",
                        "vi": "một động cơ bên trong"
                    }
                ]
            }
        ]
    },
    {
        "id": "a1bcecd0dee448d38f9649935dde3834",
        "word": "joystick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɔɪstɪk/",
            "us": "/ˈdʒɔɪstɪk/"
        },
        "nearby": [
            {
                "word": "joyrider",
                "pos": "noun"
            },
            {
                "word": "joyriding",
                "pos": "noun"
            },
            {
                "word": "joystick",
                "pos": "noun"
            },
            {
                "word": "JP",
                "pos": "noun"
            },
            {
                "word": "JPEG",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a stick with a handle used with some computer games to move images on the screen",
                    "vi": "một cây gậy có tay cầm được sử dụng với một số trò chơi máy tính để di chuyển hình ảnh trên màn hình"
                },
                "examples": [
                    {
                        "en": "There are two joysticks on the console, which you operate with your thumbs.",
                        "vi": "Có hai cần điều khiển trên bảng điều khiển mà bạn thao tác bằng ngón tay cái."
                    },
                    {
                        "en": "You can direct your spaceship around the screen using the mouse, the keyboard or a joystick.",
                        "vi": "Bạn có thể hướng phi thuyền của mình quanh màn hình bằng chuột, bàn phím hoặc cần điều khiển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stick with a handle in an aircraft that is used to control direction or height",
                    "vi": "một cây gậy có tay cầm trên máy bay được sử dụng để điều khiển hướng hoặc độ cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7c408262f7494fbb9adf1cd20a2afe77",
        "word": "landing gear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlændɪŋ ɡɪə(r)/",
            "us": "/ˈlændɪŋ ɡɪr/"
        },
        "nearby": [
            {
                "word": "landing card",
                "pos": "noun"
            },
            {
                "word": "landing craft",
                "pos": "noun"
            },
            {
                "word": "landing gear",
                "pos": "noun"
            },
            {
                "word": "landing lights",
                "pos": "noun"
            },
            {
                "word": "landing page",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of an aircraft, including the wheels, that supports it when it is landing and taking off",
                    "vi": "bộ phận của máy bay, bao gồm cả bánh xe, hỗ trợ nó khi nó hạ cánh và cất cánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c97d52e5802b4ddb880b6ecac13084b7",
        "word": "leading edge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌliːdɪŋ ˈedʒ/",
            "us": "/ˌliːdɪŋ ˈedʒ/"
        },
        "nearby": [
            {
                "word": "leading aircraftwoman",
                "pos": "noun"
            },
            {
                "word": "leading article",
                "pos": "noun"
            },
            {
                "word": "leading edge",
                "pos": "noun"
            },
            {
                "word": "leading-edge",
                "pos": "adjective"
            },
            {
                "word": "leading lady",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the most important and advanced position in an area of activity, especially technology",
                    "vi": "vị trí quan trọng và tiên tiến nhất trong một lĩnh vực hoạt động, đặc biệt là công nghệ"
                },
                "examples": [
                    {
                        "en": "at the leading edge of scientific research",
                        "vi": "ở vị trí hàng đầu của nghiên cứu khoa học"
                    },
                    {
                        "en": "The company has had the leading edge in electronics for ten years.",
                        "vi": "Công ty đã có lợi thế hàng đầu trong lĩnh vực điện tử trong mười năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the front or forward edge of something moving, especially an aircraft wing",
                    "vi": "mép trước hoặc mép phía trước của thứ gì đó đang chuyển động, đặc biệt là cánh máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a85d092181244865b70dfc814b280573",
        "word": "nose cone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnəʊz kəʊn/",
            "us": "/ˈnəʊz kəʊn/"
        },
        "nearby": [
            {
                "word": "noseband",
                "pos": "noun"
            },
            {
                "word": "nosebleed",
                "pos": "noun"
            },
            {
                "word": "nose cone",
                "pos": "noun"
            },
            {
                "word": "nosedive",
                "pos": "noun"
            },
            {
                "word": "nosedive",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pointed front end of a rocket, an aircraft, etc.",
                    "vi": "đầu nhọn phía trước của tên lửa, máy bay, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d90cb903ab24384870c82a352a4bfa4",
        "word": "outboard",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaʊtbɔːd/",
            "us": "/ˈaʊtbɔːrd/"
        },
        "nearby": [
            {
                "word": "outback",
                "pos": "noun"
            },
            {
                "word": "outbid",
                "pos": "verb"
            },
            {
                "word": "outboard",
                "pos": "adjective"
            },
            {
                "word": "outboard motor",
                "pos": "noun"
            },
            {
                "word": "outbound",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on, towards or near the outside of a ship or an aircraft",
                    "vi": "trên, về phía hoặc gần bên ngoài của một con tàu hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "outboard wing panels",
                        "vi": "tấm cánh ngoài"
                    }
                ]
            }
        ]
    },
    {
        "id": "57f48106b7774876936b4514397e1169",
        "word": "payload",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪləʊd/",
            "us": "/ˈpeɪləʊd/"
        },
        "nearby": [
            {
                "word": "paying guest",
                "pos": "noun"
            },
            {
                "word": "pay into",
                "pos": "phrasal verb"
            },
            {
                "word": "payload",
                "pos": "noun"
            },
            {
                "word": "paymaster",
                "pos": "noun"
            },
            {
                "word": "the Paymaster General",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the passengers or goods on a vehicle, especially an aircraft, for which payment is received",
                    "vi": "hành khách hoặc hàng hóa trên phương tiện giao thông, đặc biệt là máy bay, nơi nhận thanh toán"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the equipment carried by a spacecraft or satellite",
                    "vi": "thiết bị do tàu vũ trụ hoặc vệ tinh mang theo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the explosive power of a bomb or a missile",
                    "vi": "sức nổ của bom hoặc tên lửa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fcf680e67f9e45d1a03a2c2c821292a4",
        "word": "propeller",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈpelə(r)/",
            "us": "/prəˈpelər/"
        },
        "nearby": [
            {
                "word": "propel",
                "pos": "verb"
            },
            {
                "word": "propellant",
                "pos": "noun"
            },
            {
                "word": "propeller",
                "pos": "noun"
            },
            {
                "word": "propelling pencil",
                "pos": "noun"
            },
            {
                "word": "propensity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device with two or more long, flat blades that turn quickly and cause a ship or an aircraft to move forward",
                    "vi": "một thiết bị có hai hoặc nhiều cánh phẳng, dài trở lên quay nhanh và làm cho tàu hoặc máy bay chuyển động về phía trước"
                },
                "examples": [
                    {
                        "en": "The propeller suddenly stopped turning.",
                        "vi": "Cánh quạt đột ngột ngừng quay."
                    },
                    {
                        "en": "The boat is fitted with a two-blade propeller.",
                        "vi": "Thuyền được gắn một chân vịt hai lưỡi."
                    },
                    {
                        "en": "The front engine drives the propellers.",
                        "vi": "Động cơ phía trước dẫn động các cánh quạt."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cc0b220d0f94327af6366c09384c1a4",
        "word": "rudder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌdə(r)/",
            "us": "/ˈrʌdər/"
        },
        "nearby": [
            {
                "word": "ruckus",
                "pos": "noun"
            },
            {
                "word": "ructions",
                "pos": "noun"
            },
            {
                "word": "rudder",
                "pos": "noun"
            },
            {
                "word": "rudderless",
                "pos": "adjective"
            },
            {
                "word": "ruddy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of wood or metal at the back of a boat or an aircraft that is used for controlling its direction",
                    "vi": "một mảnh gỗ hoặc kim loại ở phía sau của một chiếc thuyền hoặc một chiếc máy bay được sử dụng để điều khiển hướng của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a5e84239187248558ed266484963e927",
        "word": "spoiler",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspɔɪlə(r)/",
            "us": "/ˈspɔɪlər/"
        },
        "nearby": [
            {
                "word": "spoil",
                "pos": "noun"
            },
            {
                "word": "spoilage",
                "pos": "noun"
            },
            {
                "word": "spoiler",
                "pos": "noun"
            },
            {
                "word": "spoiler alert",
                "pos": "noun"
            },
            {
                "word": "spoiling tactics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of an aircraft’s wing that can be raised in order to interrupt the flow of air over it and so slow the aircraft’s speed",
                    "vi": "một phần của cánh máy bay có thể nâng lên để làm gián đoạn luồng không khí qua nó và do đó làm chậm tốc độ của máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a raised part on a fast car that prevents it from being lifted off the road when travelling very fast",
                    "vi": "một bộ phận được nâng lên trên ô tô đang chạy nhanh giúp nó không bị nâng lên khỏi mặt đường khi đi rất nhanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a candidate for a political office who is unlikely to win but who may get enough votes to prevent one of the main candidates from winning",
                    "vi": "một ứng cử viên cho một văn phòng chính trị không có khả năng giành chiến thắng nhưng người có thể nhận đủ số phiếu để ngăn một trong những ứng cử viên chính giành chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that intends or is intended to stop somebody/something being successful",
                    "vi": "một người hoặc vật có ý định hoặc dự định ngăn cản ai đó / điều gì đó thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "information that you are given about what is going to happen in a film, television series, etc. before it is shown to the public",
                    "vi": "thông tin mà bạn được cung cấp về những gì sẽ xảy ra trong một bộ phim, một loạt phim truyền hình, v.v. trước khi nó được trình chiếu cho công chúng"
                },
                "examples": [
                    {
                        "en": "Warning: this review contains spoilers.",
                        "vi": "Cảnh báo: đánh giá này có chứa những kẻ phá hoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a news story, book, etc. that is produced very quickly in order to take attention away from one produced by a competitor that appears at the same time",
                    "vi": "một câu chuyện tin tức, cuốn sách, v.v. được sản xuất rất nhanh để thu hút sự chú ý từ một câu chuyện do đối thủ cạnh tranh sản xuất xuất hiện cùng lúc"
                },
                "examples": [
                    {
                        "en": "The paper ran a spoiler.",
                        "vi": "Tờ giấy chạy một đoạn lướt gió."
                    }
                ]
            }
        ]
    },
    {
        "id": "337547bf20574edd9551cbf894fdd4fd",
        "word": "stabilizer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪbəlaɪzə(r)/",
            "us": "/ˈsteɪbəlaɪzər/"
        },
        "nearby": [
            {
                "word": "stabilization",
                "pos": "noun"
            },
            {
                "word": "stabilize",
                "pos": "verb"
            },
            {
                "word": "stabilizer",
                "pos": "noun"
            },
            {
                "word": "stable",
                "pos": "adjective"
            },
            {
                "word": "stable",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that keeps something steady, especially one that stops an aircraft or a ship from rolling to one side",
                    "vi": "một thiết bị giữ cho thứ gì đó ổn định, đặc biệt là thiết bị ngăn máy bay hoặc tàu thủy lăn sang một bên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "small wheels that are fitted at each side of the back wheel on a child’s bicycle to stop it from falling over",
                    "vi": "bánh xe nhỏ được lắp ở mỗi bên của bánh sau trên xe đạp của trẻ để ngăn xe bị đổ"
                },
                "examples": [
                    {
                        "en": "She can ride her bike without stabilizers now.",
                        "vi": "Bây giờ cô ấy có thể đạp xe mà không cần ổn định."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chemical that is sometimes added to food or paint to stop the various substances in it from becoming separate",
                    "vi": "một hóa chất đôi khi được thêm vào thực phẩm hoặc sơn để ngăn các chất khác nhau trong đó trở nên riêng biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf59bee266fc4c0397f0fe155d23939e",
        "word": "stowage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstəʊɪdʒ/",
            "us": "/ˈstəʊɪdʒ/"
        },
        "nearby": [
            {
                "word": "stovies",
                "pos": "noun"
            },
            {
                "word": "stow",
                "pos": "verb"
            },
            {
                "word": "stowage",
                "pos": "noun"
            },
            {
                "word": "stow away",
                "pos": "phrasal verb"
            },
            {
                "word": "stowaway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "space provided for stowing things away, in a boat or a plane",
                    "vi": "không gian được cung cấp để xếp đồ đạc đi xa, trên thuyền hoặc máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "85d0c45695944159a1b8a76a4c157c6c",
        "word": "tailplane",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈteɪlpleɪn/",
            "us": "/ˈteɪlpleɪn/"
        },
        "nearby": [
            {
                "word": "tailpiece",
                "pos": "noun"
            },
            {
                "word": "tailpipe",
                "pos": "noun"
            },
            {
                "word": "tailplane",
                "pos": "noun"
            },
            {
                "word": "tailspin",
                "pos": "noun"
            },
            {
                "word": "tailwind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small wing at the back of an aircraft",
                    "vi": "một cánh nhỏ ở phía sau máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "45d28848386d441fa82024b2c06f5caa",
        "word": "turbojet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɜːbəʊdʒet/",
            "us": "/ˈtɜːrbəʊdʒet/"
        },
        "nearby": [
            {
                "word": "turbocharged",
                "pos": "adjective"
            },
            {
                "word": "turbocharger",
                "pos": "noun"
            },
            {
                "word": "turbojet",
                "pos": "noun"
            },
            {
                "word": "turboprop",
                "pos": "noun"
            },
            {
                "word": "turbot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a turbine engine that produces forward movement by forcing out a stream of hot air and gas behind it",
                    "vi": "một động cơ tuabin tạo ra chuyển động tịnh tiến bằng cách đẩy ra một luồng khí nóng và khí phía sau nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plane that gets its power from this type of engine",
                    "vi": "một chiếc máy bay nhận được sức mạnh từ loại động cơ này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c003132273140e6930c09dad5e9b7a1",
        "word": "turboprop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɜːbəʊprɒp/",
            "us": "/ˈtɜːrbəʊprɑːp/"
        },
        "nearby": [
            {
                "word": "turbocharger",
                "pos": "noun"
            },
            {
                "word": "turbojet",
                "pos": "noun"
            },
            {
                "word": "turboprop",
                "pos": "noun"
            },
            {
                "word": "turbot",
                "pos": "noun"
            },
            {
                "word": "turbulence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a turbine engine that produces forward movement by turning a propeller (= a set of blades that turn round and round)",
                    "vi": "một động cơ tuabin tạo ra chuyển động tịnh tiến bằng cách quay một cánh quạt (= một bộ cánh quay tròn và quay tròn)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plane that gets its power from this type of engine",
                    "vi": "một chiếc máy bay nhận được sức mạnh từ loại động cơ này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "caeb7a5e20f2446baeed9269f645294d",
        "word": "undercarriage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌndəkærɪdʒ/",
            "us": "/ˈʌndərkærɪdʒ/"
        },
        "nearby": [
            {
                "word": "underbid",
                "pos": "verb"
            },
            {
                "word": "underbrush",
                "pos": "noun"
            },
            {
                "word": "undercarriage",
                "pos": "noun"
            },
            {
                "word": "undercharge",
                "pos": "verb"
            },
            {
                "word": "underclass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of an aircraft, including the wheels, that supports it when it is on the ground",
                    "vi": "bộ phận của máy bay, bao gồm cả bánh xe, hỗ trợ nó khi nó ở trên mặt đất"
                },
                "examples": []
            }
        ]
    }
]