[
    {
        "id": "1e176b729d164b9789072ff993415f79",
        "word": "interview",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈɪntəvjuː/",
            "us": "/ˈɪntərvjuː/"
        },
        "nearby": [
            {
                "word": "interventionist",
                "pos": "noun"
            },
            {
                "word": "interventionist",
                "pos": "adjective"
            },
            {
                "word": "interview",
                "pos": "noun"
            },
            {
                "word": "interview",
                "pos": "verb"
            },
            {
                "word": "interviewee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal meeting at which somebody is asked questions to see if they are suitable for a particular job, or for a course of study at a college, university, etc.",
                    "vi": "một cuộc họp chính thức trong đó ai đó được đặt câu hỏi để xem liệu họ có phù hợp với một công việc cụ thể hay cho một khóa học tại một trường cao đẳng, đại học, v.v."
                },
                "examples": [
                    {
                        "en": "a job interview",
                        "vi": "một cuộc phỏng vấn việc làm"
                    },
                    {
                        "en": "She's been called for (an) interview.",
                        "vi": "Cô ấy đã được gọi cho (một) cuộc phỏng vấn."
                    },
                    {
                        "en": "interview for something He has an interview next week for the manager's job.",
                        "vi": "phỏng vấn cho việc gì Anh ấy có một cuộc phỏng vấn vào tuần tới cho công việc của người quản lý."
                    },
                    {
                        "en": "interview with somebody/something (for something) I got an interview with a PR company for a trainee position.",
                        "vi": "phỏng vấn với ai đó / điều gì đó (vì điều gì đó) Tôi đã nhận một cuộc phỏng vấn với một công ty PR cho vị trí thực tập sinh."
                    },
                    {
                        "en": "in an interview In the interview they asked me about my future plans.",
                        "vi": "trong một cuộc phỏng vấn Trong cuộc phỏng vấn, họ hỏi tôi về kế hoạch tương lai của tôi."
                    },
                    {
                        "en": "at an interview He came across very well at the interview.",
                        "vi": "tại một cuộc phỏng vấn Anh ấy đã thể hiện rất tốt trong buổi phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a meeting (often a public one) at which a journalist asks somebody questions in order to find out their opinions",
                    "vi": "một cuộc họp (thường là một cuộc họp công khai) trong đó một nhà báo đặt câu hỏi cho ai đó để tìm hiểu ý kiến của họ"
                },
                "examples": [
                    {
                        "en": "a television/TV/radio/newspaper interview",
                        "vi": "một cuộc phỏng vấn trên truyền hình / TV / radio / báo chí"
                    },
                    {
                        "en": "to do/give an interview (= to agree to answer questions)",
                        "vi": "thực hiện / phỏng vấn (= đồng ý trả lời câu hỏi)"
                    },
                    {
                        "en": "to conduct an interview (= to ask somebody questions in public)",
                        "vi": "để thực hiện một cuộc phỏng vấn (= đặt câu hỏi cho ai đó trước công chúng)"
                    },
                    {
                        "en": "The interview was published in all the papers.",
                        "vi": "Cuộc phỏng vấn đã được đăng trên tất cả các tờ báo."
                    },
                    {
                        "en": "in an interview Yesterday, in an interview on German television, the minister denied the reports.",
                        "vi": "Trong một cuộc phỏng vấn Hôm qua, trong một cuộc phỏng vấn trên truyền hình Đức, Bộ trưởng đã phủ nhận các báo cáo."
                    },
                    {
                        "en": "interview with somebody an in-depth interview with the new governor",
                        "vi": "phỏng vấn ai đó một cuộc phỏng vấn sâu với thống đốc mới"
                    },
                    {
                        "en": "interview about something an exclusive interview about her new book",
                        "vi": "phỏng vấn về điều gì đó một cuộc phỏng vấn độc quyền về cuốn sách mới của cô ấy"
                    },
                    {
                        "en": "interview by somebody The film begins with an interview by two local student reporters.",
                        "vi": "phỏng vấn của ai đó Bộ phim bắt đầu với cuộc phỏng vấn của hai phóng viên sinh viên địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a private meeting between people when questions are asked and answered",
                    "vi": "một cuộc họp riêng giữa mọi người khi các câu hỏi được hỏi và trả lời"
                },
                "examples": [
                    {
                        "en": "a telephone/phone interview",
                        "vi": "một cuộc phỏng vấn qua điện thoại / qua điện thoại"
                    },
                    {
                        "en": "interview with somebody She's had an interview with the careers adviser.",
                        "vi": "phỏng vấn với ai đó Cô ấy đã có một cuộc phỏng vấn với cố vấn nghề nghiệp."
                    },
                    {
                        "en": "He gave a very full account in long interviews with experienced police officers.",
                        "vi": "Anh ta đã tường thuật rất đầy đủ trong các cuộc phỏng vấn dài với các sĩ quan cảnh sát giàu kinh nghiệm."
                    },
                    {
                        "en": "Interviews and questionnaires are the most important tools in market research.",
                        "vi": "Phỏng vấn và bảng câu hỏi là những công cụ quan trọng nhất trong nghiên cứu thị trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "27b7db656c00477da7b397040d68d01f",
        "word": "interview",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈɪntəvjuː/",
            "us": "/ˈɪntərvjuː/"
        },
        "nearby": [
            {
                "word": "interventionist",
                "pos": "adjective"
            },
            {
                "word": "interview",
                "pos": "noun"
            },
            {
                "word": "interview",
                "pos": "verb"
            },
            {
                "word": "interviewee",
                "pos": "noun"
            },
            {
                "word": "interviewer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk to somebody and ask them questions at a formal meeting to find out if they are suitable for a job, course of study, etc.",
                    "vi": "để nói chuyện với ai đó và đặt câu hỏi cho họ tại một cuộc họp chính thức để tìm hiểu xem liệu họ có phù hợp với công việc, khóa học, v.v."
                },
                "examples": [
                    {
                        "en": "interview somebody The university interviews all potential candidates.",
                        "vi": "phỏng vấn ai đó Trường đại học phỏng vấn tất cả các ứng viên tiềm năng."
                    },
                    {
                        "en": "interview somebody for something Which post are you being interviewed for?",
                        "vi": "phỏng vấn ai đó về cái gì Bạn đang được phỏng vấn cho bài đăng nào?"
                    },
                    {
                        "en": "We interviewed ten people for the job.",
                        "vi": "Chúng tôi đã phỏng vấn mười người cho công việc."
                    },
                    {
                        "en": "The deadline for applications is 15 October and we will be interviewing early in November.",
                        "vi": "Hạn nộp hồ sơ là ngày 15 tháng 10 và chúng tôi sẽ phỏng vấn vào đầu tháng 11."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk to somebody and answer questions at a formal meeting to get a job, a place on a course of study, etc.",
                    "vi": "để nói chuyện với ai đó và trả lời các câu hỏi tại một cuộc họp chính thức để xin việc, một vị trí trong quá trình học tập, v.v."
                },
                "examples": [
                    {
                        "en": "The website gives you tips on interviewing for colleges.",
                        "vi": "Trang web cung cấp cho bạn các mẹo về phỏng vấn vào các trường đại học."
                    },
                    {
                        "en": "If you don't interview well you are unlikely to get the job.",
                        "vi": "Nếu bạn không phỏng vấn tốt, bạn khó có thể nhận được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody questions about their life, opinions, etc., especially on the radio or television or for a newspaper or magazine",
                    "vi": "để hỏi ai đó những câu hỏi về cuộc sống, ý kiến của họ, v.v., đặc biệt là trên đài phát thanh hoặc truyền hình hoặc cho một tờ báo hoặc tạp chí"
                },
                "examples": [
                    {
                        "en": "interview somebody about something Next week, I will be interviewing Spielberg about his latest movie.",
                        "vi": "phỏng vấn ai đó về điều gì đó Tuần tới, tôi sẽ phỏng vấn Spielberg về bộ phim mới nhất của anh ấy."
                    },
                    {
                        "en": "interview somebody The prime minister declined to be interviewed.",
                        "vi": "phỏng vấn ai đó Thủ tướng từ chối phỏng vấn."
                    },
                    {
                        "en": "interview somebody on something I heard him being interviewed on the news earlier.",
                        "vi": "phỏng vấn ai đó về điều gì đó mà tôi nghe nói anh ấy đã được phỏng vấn trên bản tin trước đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody questions at a private meeting",
                    "vi": "đặt câu hỏi cho ai đó trong một cuộc họp riêng"
                },
                "examples": [
                    {
                        "en": "interview somebody The police are waiting to interview the injured man.",
                        "vi": "phỏng vấn ai đó Cảnh sát đang chờ để phỏng vấn người đàn ông bị thương."
                    },
                    {
                        "en": "interview somebody about something After 14 days, patients were interviewed about the recurrence of any symptoms.",
                        "vi": "phỏng vấn ai đó về điều gì đó Sau 14 ngày, bệnh nhân được phỏng vấn về sự tái phát của bất kỳ triệu chứng nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f87ff59498944b89da0c0a9fdb0d86f",
        "word": "apply",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/əˈplaɪ/",
            "us": "/əˈplaɪ/"
        },
        "nearby": [
            {
                "word": "appliqué",
                "pos": "noun"
            },
            {
                "word": "appliquéd",
                "pos": "adjective"
            },
            {
                "word": "apply",
                "pos": "verb"
            },
            {
                "word": "appoint",
                "pos": "verb"
            },
            {
                "word": "appointee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a formal request, usually in writing, for something such as a job, a loan, permission for something, a place at a university, etc.",
                    "vi": "để đưa ra một yêu cầu chính thức, thường là bằng văn bản, cho một cái gì đó chẳng hạn như một công việc, một khoản vay, sự cho phép đối với một cái gì đó, một vị trí tại một trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "You should apply in person/by letter.",
                        "vi": "Bạn nên nộp đơn trực tiếp / qua thư."
                    },
                    {
                        "en": "apply for something I have decided to apply for this new job.",
                        "vi": "ứng tuyển một cái gì đó Tôi đã quyết định áp dụng cho công việc mới này."
                    },
                    {
                        "en": "They have successfully applied for political asylum.",
                        "vi": "Họ đã xin tị nạn chính trị thành công."
                    },
                    {
                        "en": "to apply for a visa/passport/grant/licence",
                        "vi": "để xin thị thực / hộ chiếu / cấp / giấy phép"
                    },
                    {
                        "en": "The developers applied for planning permission to build over 200 houses.",
                        "vi": "Các chủ đầu tư đã xin phép quy hoạch để xây dựng hơn 200 ngôi nhà."
                    },
                    {
                        "en": "apply to somebody/something to apply to a company/university",
                        "vi": "nộp đơn cho ai đó / cái gì đó để nộp đơn vào một công ty / trường đại học"
                    },
                    {
                        "en": "apply to somebody/something for something They may apply to the court for the decision to be reversed.",
                        "vi": "áp dụng cho ai đó / cái gì đó cho một cái gì đó Họ có thể nộp đơn lên tòa án để hủy bỏ quyết định."
                    },
                    {
                        "en": "apply to do something He has applied to join the army.",
                        "vi": "apply to do something Anh ấy đã nộp đơn xin gia nhập quân đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect or be relevant to somebody/something",
                    "vi": "ảnh hưởng hoặc có liên quan đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Special conditions apply if you are under 18.",
                        "vi": "Các điều kiện đặc biệt được áp dụng nếu bạn dưới 18 tuổi."
                    },
                    {
                        "en": "apply to somebody/something The rules applied to employees and their behaviour at work.",
                        "vi": "áp dụng cho ai đó / cái gì đó Các quy tắc áp dụng cho nhân viên và hành vi của họ tại nơi làm việc."
                    },
                    {
                        "en": "What I am saying applies only to some of you.",
                        "vi": "Những gì tôi đang nói chỉ áp dụng cho một số bạn."
                    },
                    {
                        "en": "The policy will apply equally to everyone.",
                        "vi": "Chính sách sẽ áp dụng bình đẳng cho tất cả mọi người."
                    },
                    {
                        "en": "The law applied only to foreign nationals.",
                        "vi": "Luật chỉ áp dụng cho công dân nước ngoài."
                    },
                    {
                        "en": "apply something to somebody/something The word ‘unexciting’ could never be applied to her novels.",
                        "vi": "áp dụng điều gì đó cho ai đó / điều gì đó Từ 'không thú vị' không bao giờ có thể được áp dụng cho tiểu thuyết của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use something or make something work in a particular situation",
                    "vi": "để sử dụng một cái gì đó hoặc làm cho một cái gì đó hoạt động trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "apply something to apply political pressure",
                        "vi": "áp dụng một cái gì đó để áp dụng áp lực chính trị"
                    },
                    {
                        "en": "The challenge allows students to apply economic principles they learn in class.",
                        "vi": "Thử thách cho phép sinh viên áp dụng các nguyên tắc kinh tế mà họ học được trong lớp."
                    },
                    {
                        "en": "to apply economic sanctions",
                        "vi": "áp dụng các biện pháp trừng phạt kinh tế"
                    },
                    {
                        "en": "to apply a test/method/technique/approach/rule",
                        "vi": "để áp dụng một bài kiểm tra / phương pháp / kỹ thuật / cách tiếp cận / quy tắc"
                    },
                    {
                        "en": "Each citizen needs to apply the same standards to himself as to others.",
                        "vi": "Mỗi công dân cần áp dụng các tiêu chuẩn tương tự cho mình cũng như cho những người khác."
                    },
                    {
                        "en": "apply something to something The new technology was applied to farming.",
                        "vi": "áp dụng một cái gì đó vào một cái gì đó Công nghệ mới đã được áp dụng cho nông nghiệp."
                    },
                    {
                        "en": "Now is the time to apply the insights you have gained from your studies.",
                        "vi": "Bây giờ là lúc để áp dụng những hiểu biết bạn có được từ việc học của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or spread something such as paint, cream, etc. onto a surface",
                    "vi": "để đặt hoặc trải một thứ gì đó như sơn, kem, v.v. lên bề mặt"
                },
                "examples": [
                    {
                        "en": "apply something to something Apply the cream sparingly to your face and neck.",
                        "vi": "thoa thứ gì đó lên thứ gì đó Thoa ít kem lên mặt và cổ."
                    },
                    {
                        "en": "The glue should be applied to both surfaces.",
                        "vi": "Keo nên được áp dụng cho cả hai bề mặt."
                    },
                    {
                        "en": "apply something She combed her hair and carefully applied her make-up.",
                        "vi": "thoa thứ gì đó Cô chải đầu và trang điểm cẩn thận."
                    },
                    {
                        "en": "The paint was applied with a fine brush.",
                        "vi": "Sơn đã được áp dụng bằng một bàn chải mịn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work at something or study something very hard",
                    "vi": "để làm việc ở một cái gì đó hoặc nghiên cứu một cái gì đó rất khó khăn"
                },
                "examples": [
                    {
                        "en": "apply yourself You would pass your exams if you applied yourself.",
                        "vi": "tự áp dụng Bạn sẽ vượt qua kỳ thi của mình nếu bạn tự nộp đơn."
                    },
                    {
                        "en": "apply yourself/something to (doing) something We applied our minds to finding a solution to our problem.",
                        "vi": "áp dụng bản thân / điều gì đó vào (làm) điều gì đó Chúng tôi đã áp dụng trí óc của mình để tìm ra giải pháp cho vấn đề của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to press on something hard with your hand, foot, etc. to make something work or have an effect on something",
                    "vi": "ấn mạnh vào vật gì đó bằng tay, chân, v.v. để làm cho vật gì đó hoạt động hoặc tác động lên vật gì đó"
                },
                "examples": [
                    {
                        "en": "apply something to apply the brakes (of a vehicle)",
                        "vi": "áp dụng một cái gì đó để áp dụng phanh (của một chiếc xe)"
                    },
                    {
                        "en": "apply something to something Pressure applied to the wound will stop the bleeding.",
                        "vi": "áp một cái gì đó lên một cái gì đó Áp lực lên vết thương sẽ cầm máu."
                    }
                ]
            }
        ]
    },
    {
        "id": "bda9a808d2784da59903d096cecc1de3",
        "word": "experience",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪkˈspɪəriəns/",
            "us": "/ɪkˈspɪriəns/"
        },
        "nearby": [
            {
                "word": "expensive",
                "pos": "adjective"
            },
            {
                "word": "expensively",
                "pos": "adverb"
            },
            {
                "word": "experience",
                "pos": "noun"
            },
            {
                "word": "experience",
                "pos": "verb"
            },
            {
                "word": "experienced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the knowledge and skill that you have gained through doing something for a period of time; the process of gaining this",
                    "vi": "kiến thức và kỹ năng mà bạn có được khi làm một việc gì đó trong một khoảng thời gian; quá trình đạt được điều này"
                },
                "examples": [
                    {
                        "en": "My lack of practical experience was a disadvantage.",
                        "vi": "Thiếu kinh nghiệm thực tế của tôi là một bất lợi."
                    },
                    {
                        "en": "experience of something Do you have any previous experience of this type of work?",
                        "vi": "kinh nghiệm của một cái gì đó Bạn có bất kỳ kinh nghiệm trước đây về loại công việc?"
                    },
                    {
                        "en": "This new approach draws on years of experience of teaching children to read.",
                        "vi": "Cách tiếp cận mới này dựa trên kinh nghiệm nhiều năm dạy trẻ em đọc."
                    },
                    {
                        "en": "experience in doing something a doctor with experience in dealing with patients suffering from stress",
                        "vi": "kinh nghiệm làm việc gì đó một bác sĩ có kinh nghiệm đối phó với những bệnh nhân bị căng thẳng"
                    },
                    {
                        "en": "experience in something He gained extensive experience in the field of artificial intelligence whilst working on the project.",
                        "vi": "kinh nghiệm trong lĩnh vực nào đó Anh ấy đã có được nhiều kinh nghiệm trong lĩnh vực trí tuệ nhân tạo khi làm việc trong dự án."
                    },
                    {
                        "en": "experience as something I have over ten years’ experience as a teacher.",
                        "vi": "kinh nghiệm như một thứ mà tôi có hơn mười năm kinh nghiệm làm giáo viên."
                    },
                    {
                        "en": "experience with something The course provides hands-on experience with various systems.",
                        "vi": "trải nghiệm với điều gì đó Khóa học cung cấp kinh nghiệm thực hành với các hệ thống khác nhau."
                    },
                    {
                        "en": "She didn't get paid much but it was all good experience.",
                        "vi": "Cô ấy không được trả nhiều tiền nhưng tất cả đều là trải nghiệm tốt."
                    },
                    {
                        "en": "We all learn by experience.",
                        "vi": "Tất cả chúng ta đều học hỏi bằng kinh nghiệm."
                    },
                    {
                        "en": "The new player will bring a wealth of experience to the team.",
                        "vi": "Người chơi mới sẽ mang lại nhiều kinh nghiệm cho cả đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the things that have happened to you that influence the way you think and behave",
                    "vi": "những điều đã xảy ra với bạn ảnh hưởng đến cách bạn suy nghĩ và cư xử"
                },
                "examples": [
                    {
                        "en": "Experience has taught me that life can be very unfair.",
                        "vi": "Kinh nghiệm đã dạy tôi rằng cuộc sống có thể rất bất công."
                    },
                    {
                        "en": "Experience shows that this strategy does not always work.",
                        "vi": "Kinh nghiệm cho thấy không phải lúc nào chiến lược này cũng hiệu quả."
                    },
                    {
                        "en": "The book is based on personal experience.",
                        "vi": "Cuốn sách dựa trên kinh nghiệm cá nhân."
                    },
                    {
                        "en": "from experience It is important to try and learn from experience.",
                        "vi": "từ kinh nghiệm Điều quan trọng là cố gắng và học hỏi kinh nghiệm."
                    },
                    {
                        "en": "She knew from past experience that Ann would not give up easily.",
                        "vi": "Từ kinh nghiệm trong quá khứ, cô biết rằng Ann sẽ không dễ dàng từ bỏ."
                    },
                    {
                        "en": "in somebody's experience In my experience, very few people really understand the problem.",
                        "vi": "theo kinh nghiệm của ai đó Theo kinh nghiệm của tôi, rất ít người thực sự hiểu được vấn đề."
                    },
                    {
                        "en": "experience of something He had first-hand experience of poverty.",
                        "vi": "kinh nghiệm về điều gì đó Anh ấy đã có kinh nghiệm đầu tiên về nghèo đói."
                    },
                    {
                        "en": "the collective experience of everyday life",
                        "vi": "kinh nghiệm chung của cuộc sống hàng ngày"
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or activity that affects you in some way",
                    "vi": "một sự kiện hoặc hoạt động ảnh hưởng đến bạn theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a unique/positive/wonderful experience",
                        "vi": "một trải nghiệm độc đáo / tích cực / tuyệt vời"
                    },
                    {
                        "en": "experience of something Share your experiences of parenthood by emailing the address below.",
                        "vi": "kinh nghiệm về điều gì đó Chia sẻ kinh nghiệm làm cha mẹ của bạn bằng cách gửi email đến địa chỉ bên dưới."
                    },
                    {
                        "en": "We aim to give our guests the experience of a lifetime.",
                        "vi": "Chúng tôi mong muốn mang đến cho khách những trải nghiệm trọn đời."
                    },
                    {
                        "en": "experience of doing something It was her first experience of living alone.",
                        "vi": "kinh nghiệm làm điều gì đó Đó là kinh nghiệm sống một mình đầu tiên của cô."
                    },
                    {
                        "en": "The play is based loosely on his own life experiences.",
                        "vi": "Vở kịch được xây dựng dựa trên kinh nghiệm sống của chính anh ấy."
                    },
                    {
                        "en": "He found the whole experience traumatic.",
                        "vi": "Anh ấy thấy toàn bộ trải nghiệm đều là đau thương."
                    },
                    {
                        "en": "Losing four matches in a row proved a valuable learning experience (= it showed the players what they need to improve).",
                        "vi": "Để thua bốn trận liên tiếp chứng tỏ một kinh nghiệm học hỏi quý giá (= nó cho các cầu thủ thấy họ cần cải thiện điều gì)."
                    },
                    {
                        "en": "Living in Africa was very different from home and quite an experience (= unusual for us).",
                        "vi": "Sống ở Châu Phi rất khác so với ở nhà và là một trải nghiệm (= bất thường đối với chúng tôi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "what it is like for somebody to use a service, do an activity, attend an event, etc.",
                    "vi": "ai đó sử dụng một dịch vụ, thực hiện một hoạt động, tham dự một sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "We are continually looking for ways to improve the customer experience.",
                        "vi": "Chúng tôi liên tục tìm cách cải thiện trải nghiệm của khách hàng."
                    },
                    {
                        "en": "Enjoy a fine dining experience with quality service.",
                        "vi": "Tận hưởng trải nghiệm ẩm thực cao cấp với dịch vụ chất lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "events or knowledge shared by all the members of a particular group in society, that influences the way they think and behave",
                    "vi": "các sự kiện hoặc kiến thức được chia sẻ bởi tất cả các thành viên của một nhóm cụ thể trong xã hội, ảnh hưởng đến cách họ suy nghĩ và hành xử"
                },
                "examples": [
                    {
                        "en": "musical forms like jazz that emerged out of the Black American experience",
                        "vi": "các hình thức âm nhạc như jazz xuất hiện từ trải nghiệm của người Mỹ da đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody should think of a failure as being something that they can learn from",
                    "vi": "đã từng nói rằng ai đó nên nghĩ về thất bại là điều gì đó mà họ có thể học hỏi từ"
                },
                "examples": [
                    {
                        "en": "We lost a lot of money, but we just put it down to experience.",
                        "vi": "Chúng tôi đã mất rất nhiều tiền, nhưng chúng tôi chỉ đặt nó xuống để trải nghiệm."
                    }
                ]
            }
        ]
    },
    {
        "id": "0418fcf3872c466fb516b3ce362ec18c",
        "word": "interviewer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɪntəvjuːə(r)/",
            "us": "/ˈɪntərvjuːər/"
        },
        "nearby": [
            {
                "word": "interview",
                "pos": "verb"
            },
            {
                "word": "interviewee",
                "pos": "noun"
            },
            {
                "word": "interviewer",
                "pos": "noun"
            },
            {
                "word": "interviewing",
                "pos": "noun"
            },
            {
                "word": "interwar",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person who asks the questions in an interview",
                    "vi": "người đặt câu hỏi trong một cuộc phỏng vấn"
                },
                "examples": [
                    {
                        "en": "The interviewer made the candidates feel relaxed.",
                        "vi": "Người phỏng vấn đã làm cho các ứng viên cảm thấy thoải mái."
                    },
                    {
                        "en": "Interviewers rarely ask about his personal life.",
                        "vi": "Những người phỏng vấn hiếm khi hỏi về cuộc sống cá nhân của anh ấy."
                    },
                    {
                        "en": "She once told an interviewer, ‘A dancer’s life is very hard’.",
                        "vi": "Cô từng nói với một người phỏng vấn rằng: 'Cuộc sống của một vũ công rất khó khăn'."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d6f1d972c8b463aba276494ffa69359",
        "word": "question",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkwestʃən/",
            "us": "/ˈkwestʃən/"
        },
        "nearby": [
            {
                "word": "quest",
                "pos": "verb"
            },
            {
                "word": "question",
                "pos": "noun"
            },
            {
                "word": "question",
                "pos": "verb"
            },
            {
                "word": "questionable",
                "pos": "adjective"
            },
            {
                "word": "questionably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to ask somebody questions about something, especially officially",
                    "vi": "để hỏi ai đó câu hỏi về điều gì đó, đặc biệt là chính thức"
                },
                "examples": [
                    {
                        "en": "question somebody Police are keen to question any witnesses.",
                        "vi": "hỏi ai đó Cảnh sát muốn thẩm vấn bất kỳ nhân chứng nào."
                    },
                    {
                        "en": "Two men are being questioned by police.",
                        "vi": "Hai người đàn ông đang bị cảnh sát thẩm vấn."
                    },
                    {
                        "en": "Over half of those questioned said they rarely took any exercise.",
                        "vi": "Hơn một nửa số người được hỏi cho biết họ hiếm khi tập thể dục."
                    },
                    {
                        "en": "question somebody about something She was arrested and questioned about the fire.",
                        "vi": "hỏi ai đó về điều gì đó Cô ấy đã bị bắt và bị thẩm vấn về vụ cháy."
                    },
                    {
                        "en": "question somebody on something The students were questioned on the books they had been studying.",
                        "vi": "hỏi ai đó về điều gì đó Các học sinh được hỏi về những cuốn sách mà họ đã học."
                    },
                    {
                        "en": "+ speech ‘What's wrong?’ she questioned.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have or express doubts about something",
                    "vi": "có hoặc bày tỏ nghi ngờ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "question something I just accepted what he told me. I never thought to question it.",
                        "vi": "câu hỏi điều gì đó tôi chỉ chấp nhận những gì anh ta nói với tôi. Tôi chưa bao giờ nghĩ sẽ đặt câu hỏi về nó."
                    },
                    {
                        "en": "No one has ever questioned her judgement.",
                        "vi": "Chưa ai thắc mắc về khả năng phán đoán của cô ấy."
                    },
                    {
                        "en": "At times I question the wisdom of that decision.",
                        "vi": "Đôi khi tôi tự hỏi sự khôn ngoan của quyết định đó."
                    },
                    {
                        "en": "I seriously question his ability to do his job.",
                        "vi": "Tôi nghiêm túc đặt câu hỏi về khả năng làm công việc của anh ấy."
                    },
                    {
                        "en": "question whether, what, etc… He questioned whether the accident was solely the truck driver's fault.",
                        "vi": "câu hỏi liệu, cái gì, vv… Anh ta đặt câu hỏi liệu vụ tai nạn có phải hoàn toàn do lỗi của tài xế xe tải hay không."
                    }
                ]
            }
        ]
    },
    {
        "id": "992e55fdd32d42ff946266c3b75a9d5c",
        "word": "application",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌæplɪˈkeɪʃn/",
            "us": "/ˌæplɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "applicable",
                "pos": "adjective"
            },
            {
                "word": "applicant",
                "pos": "noun"
            },
            {
                "word": "application",
                "pos": "noun"
            },
            {
                "word": "application programming interface",
                "pos": "noun"
            },
            {
                "word": "applicator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal (often written) request for something, such as a job, permission to do something or a place at a college or university",
                    "vi": "một yêu cầu chính thức (thường được viết) cho một cái gì đó, chẳng hạn như một công việc, sự cho phép để làm một cái gì đó hoặc một vị trí tại một trường cao đẳng hoặc đại học"
                },
                "examples": [
                    {
                        "en": "a planning/patent/visa application",
                        "vi": "một kế hoạch / bằng sáng chế / đơn xin thị thực"
                    },
                    {
                        "en": "We have received applications from more than 3 000 students.",
                        "vi": "Chúng tôi đã nhận được đơn đăng ký của hơn 3 000 sinh viên."
                    },
                    {
                        "en": "You need to complete the online application form.",
                        "vi": "Bạn cần phải hoàn thành mẫu đơn đăng ký trực tuyến."
                    },
                    {
                        "en": "application for something an application for asylum/a licence",
                        "vi": "đơn xin việc gì đó đơn xin tị nạn / giấy phép"
                    },
                    {
                        "en": "(formal) an application for leave to appeal against the conviction",
                        "vi": "(chính thức) đơn xin nghỉ việc để kháng cáo bản án"
                    },
                    {
                        "en": "application to do something After graduating she made an application to join the BBC.",
                        "vi": "ứng dụng để làm một cái gì đó Sau khi tốt nghiệp, cô đã làm đơn xin gia nhập BBC."
                    },
                    {
                        "en": "application to somebody (for something) His application to the court for bail has been refused.",
                        "vi": "đơn gửi ai đó (vì điều gì đó) Đơn của anh ta lên tòa án để được tại ngoại đã bị từ chối."
                    },
                    {
                        "en": "application to somebody to do something They submitted an application to the council to build two houses.",
                        "vi": "ứng dụng để ai đó làm điều gì đó Họ đã nộp đơn lên hội đồng để xây dựng hai ngôi nhà."
                    },
                    {
                        "en": "on application to somebody Further information is available on application to the principal.",
                        "vi": "khi nộp đơn cho ai đó Thông tin khác có sẵn trong đơn cho hiệu trưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the practical use of something, especially a theory, discovery, etc.",
                    "vi": "ứng dụng thực tế của một thứ gì đó, đặc biệt là lý thuyết, khám phá, v.v."
                },
                "examples": [
                    {
                        "en": "The invention would have a wide range of applications in industry.",
                        "vi": "Sáng chế sẽ có nhiều ứng dụng trong ngành công nghiệp."
                    },
                    {
                        "en": "What are the practical applications of this work?",
                        "vi": "Những ứng dụng thực tế của công việc này là gì?"
                    },
                    {
                        "en": "application (of something) to something the application of new technology to teaching",
                        "vi": "ứng dụng (của một cái gì đó) vào một cái gì đó ứng dụng công nghệ mới vào giảng dạy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of putting or spreading something, such as paint or medical creams, onto something else",
                    "vi": "một hành động đặt hoặc phết một thứ gì đó, chẳng hạn như sơn hoặc kem y tế, lên một thứ khác"
                },
                "examples": [
                    {
                        "en": "It took three applications of paint to cover the graffiti.",
                        "vi": "Phải mất ba lần sơn để che bức vẽ graffiti."
                    },
                    {
                        "en": "lotion for external application only (= to be put on the skin, not swallowed)",
                        "vi": "kem dưỡng da chỉ để bôi ngoài da (= bôi ngoài da, không nuốt)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making a rule, etc. operate or become effective",
                    "vi": "hành động đưa ra quy tắc, v.v. hoạt động hoặc trở nên hiệu quả"
                },
                "examples": [
                    {
                        "en": "strict application of the law",
                        "vi": "áp dụng pháp luật nghiêm minh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a program designed to do a particular job; a piece of software",
                    "vi": "một chương trình được thiết kế để làm một công việc cụ thể; một phần mềm"
                },
                "examples": [
                    {
                        "en": "a database application",
                        "vi": "một ứng dụng cơ sở dữ liệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the strength of mind to work hard at something; great effort",
                    "vi": "sức mạnh của tâm trí để làm việc chăm chỉ vào một cái gì đó; Sự nỗ lực to lớn"
                },
                "examples": [
                    {
                        "en": "Success as a writer demands great application.",
                        "vi": "Thành công với tư cách là một nhà văn đòi hỏi một ứng dụng tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "5bf373a518df4dc8ba2c2fe12e8fc0b5",
        "word": "candidate",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkændɪdət/",
            "us": "/ˈkændɪdət/"
        },
        "nearby": [
            {
                "word": "candida",
                "pos": "noun"
            },
            {
                "word": "candidacy",
                "pos": "noun"
            },
            {
                "word": "candidate",
                "pos": "noun"
            },
            {
                "word": "candidature",
                "pos": "noun"
            },
            {
                "word": "Candid Camera",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is trying to be elected or is applying for a job",
                    "vi": "một người đang cố gắng được bầu hoặc đang xin việc"
                },
                "examples": [
                    {
                        "en": "a presidential candidate",
                        "vi": "một ứng cử viên tổng thống"
                    },
                    {
                        "en": "candidate for something one of the leading candidates for the presidency",
                        "vi": "ứng cử viên cho một cái gì đó một trong những ứng cử viên hàng đầu cho chức vụ tổng thống"
                    },
                    {
                        "en": "He is the best candidate for the job.",
                        "vi": "Anh ấy là ứng cử viên tốt nhất cho công việc."
                    },
                    {
                        "en": "(British English) She stood as a candidate in the local elections.",
                        "vi": "(Anh Anh) Cô ấy đã ứng cử như một ứng cử viên trong cuộc bầu cử địa phương."
                    },
                    {
                        "en": "The party is fielding more candidates than ever before.",
                        "vi": "Đảng đang tìm kiếm nhiều ứng cử viên hơn bao giờ hết."
                    },
                    {
                        "en": "to nominate/select a candidate",
                        "vi": "đề cử / chọn một ứng cử viên"
                    },
                    {
                        "en": "to endorse a candidate (= say you support them)",
                        "vi": "xác nhận một ứng cử viên (= nói rằng bạn ủng hộ họ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person taking an exam",
                    "vi": "một người tham gia kỳ thi"
                },
                "examples": [
                    {
                        "en": "Candidates are allowed to use dictionaries in this examination.",
                        "vi": "Thí sinh được phép sử dụng từ điển trong phần thi này."
                    },
                    {
                        "en": "We run special revision courses for examination candidates.",
                        "vi": "Chúng tôi tổ chức các khóa học ôn tập đặc biệt dành cho các ứng viên dự thi."
                    },
                    {
                        "en": "candidate for something a candidate for the degree of MPhil",
                        "vi": "ứng cử viên cho một cái gì đó một ứng cử viên cho mức độ MPhil"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or group that is considered suitable for something or that is likely to get something or to be something",
                    "vi": "một người hoặc một nhóm được coi là phù hợp với điều gì đó hoặc có khả năng đạt được thứ gì đó hoặc trở thành thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Our team is a prime candidate for relegation this year.",
                        "vi": "Đội của chúng tôi là ứng cử viên hàng đầu cho suất xuống hạng năm nay."
                    },
                    {
                        "en": "Your father is an obvious candidate for a heart attack.",
                        "vi": "Cha của bạn là một ứng cử viên rõ ràng cho một cơn đau tim."
                    },
                    {
                        "en": "She's a likely candidate for promotion.",
                        "vi": "Cô ấy là một ứng cử viên có khả năng được thăng chức."
                    },
                    {
                        "en": "This is a prime candidate for best movie of the year.",
                        "vi": "Đây là một ứng cử viên hàng đầu cho giải Phim hay nhất của năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "1eaee55143a44bce81ddae353aba4969",
        "word": "CV",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌsiː ˈviː/",
            "us": "/ˌsiː ˈviː/"
        },
        "nearby": [
            {
                "word": "cut up",
                "pos": "phrasal verb"
            },
            {
                "word": "cutup",
                "pos": "noun"
            },
            {
                "word": "CV",
                "pos": "noun"
            },
            {
                "word": "cwm",
                "pos": "noun"
            },
            {
                "word": "C-word",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written record of your education and the jobs you have done, that you send when you are applying for a job (the abbreviation for ‘curriculum vitae’)",
                    "vi": "một bản ghi chép về quá trình học tập của bạn và những công việc bạn đã làm mà bạn gửi khi đi xin việc (viết tắt của 'sơ yếu lý lịch')"
                },
                "examples": [
                    {
                        "en": "Send a full CV with your job application.",
                        "vi": "Gửi một bản CV đầy đủ cùng với đơn xin việc của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of a college teacher's education, where they have worked, the books and articles they have published and the courses they have taught, used when they are applying for a job (the abbreviation for ‘curriculum vitae’)",
                    "vi": "hồ sơ về giáo dục của một giáo viên đại học, nơi họ đã làm việc, các sách và bài báo họ đã xuất bản và các khóa học họ đã dạy, được sử dụng khi họ xin việc (viết tắt của 'sơ yếu lý lịch')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "29ba9e45e1574bc6aa0d22ceca6b67c3",
        "word": "hire",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhaɪə(r)/",
            "us": "/ˈhaɪər/"
        },
        "nearby": [
            {
                "word": "hipsters",
                "pos": "noun"
            },
            {
                "word": "hiragana",
                "pos": "noun"
            },
            {
                "word": "hire",
                "pos": "verb"
            },
            {
                "word": "hire",
                "pos": "noun"
            },
            {
                "word": "hired hand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody a job",
                    "vi": "giao cho ai đó một công việc"
                },
                "examples": [
                    {
                        "en": "She was hired three years ago.",
                        "vi": "Cô ấy đã được thuê cách đây ba năm."
                    },
                    {
                        "en": "The government is encouraging employers to hire disabled people.",
                        "vi": "Chính phủ đang khuyến khích người sử dụng lao động thuê người khuyết tật."
                    },
                    {
                        "en": "He does the hiring and firing in our company.",
                        "vi": "Anh ấy làm công việc tuyển dụng và sa thải trong công ty của chúng tôi."
                    },
                    {
                        "en": "We’re not hiring right now.",
                        "vi": "Chúng tôi không tuyển dụng ngay bây giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to employ somebody for a short time to do a particular job",
                    "vi": "tuyển dụng ai đó trong một thời gian ngắn để làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "to hire a lawyer/detective",
                        "vi": "thuê luật sư / thám tử"
                    },
                    {
                        "en": "They hired a firm of consultants to design the new system.",
                        "vi": "Họ đã thuê một công ty tư vấn để thiết kế hệ thống mới."
                    },
                    {
                        "en": "Workers were hired by the day.",
                        "vi": "Công nhân được thuê theo ngày."
                    },
                    {
                        "en": "hire somebody as something She was hired by the campaign as a foreign-policy adviser.",
                        "vi": "thuê ai đó như một cái gì đó Cô ấy đã được chiến dịch thuê làm cố vấn chính sách đối ngoại."
                    },
                    {
                        "en": "hire yourself somebody You will need to hire yourself an accountant and a lawyer.",
                        "vi": "thuê cho mình một ai đó Bạn sẽ cần phải thuê cho mình một kế toán và một luật sư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money to borrow something for a short time",
                    "vi": "trả tiền để vay một thứ gì đó trong thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "hire something to hire a room/studio",
                        "vi": "thuê một cái gì đó để thuê một phòng / studio"
                    },
                    {
                        "en": "hire something from somebody We hired a car from a local firm.",
                        "vi": "thuê một cái gì đó từ ai đó Chúng tôi đã thuê một chiếc xe hơi từ một công ty địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3fc532b0e0844ffb52a9bc77e7d3c7b",
        "word": "qualification",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌkwɒlɪfɪˈkeɪʃn/",
            "us": "/ˌkwɑːlɪfɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "Quaker",
                "pos": "adjective"
            },
            {
                "word": "Quaker Oats",
                "pos": ""
            },
            {
                "word": "qualification",
                "pos": "noun"
            },
            {
                "word": "qualified",
                "pos": "adjective"
            },
            {
                "word": "qualifier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an exam that you have passed or a course of study that you have successfully completed",
                    "vi": "một kỳ thi mà bạn đã vượt qua hoặc một khóa học mà bạn đã hoàn thành thành công"
                },
                "examples": [
                    {
                        "en": "academic/educational/professional/vocational qualifications",
                        "vi": "trình độ học vấn / giáo dục / chuyên nghiệp / nghề nghiệp"
                    },
                    {
                        "en": "a coaching/teaching/nursing qualification",
                        "vi": "bằng cấp huấn luyện / giảng dạy / điều dưỡng"
                    },
                    {
                        "en": "He left school with no formal qualifications.",
                        "vi": "Anh ta rời trường mà không có bằng cấp chính thức."
                    },
                    {
                        "en": "to have qualifications",
                        "vi": "có bằng cấp"
                    },
                    {
                        "en": "to gain/get/obtain/possess/achieve qualifications",
                        "vi": "để đạt được / có được / có được / sở hữu / đạt được trình độ"
                    },
                    {
                        "en": "In this job, experience counts for more than paper qualifications.",
                        "vi": "Trong công việc này, kinh nghiệm quan trọng hơn bằng cấp trên giấy tờ."
                    },
                    {
                        "en": "qualification in something Too many school-leavers lack basic qualifications in English and Maths.",
                        "vi": "trình độ chuyên môn trong một lĩnh vực nào đó Quá nhiều học sinh bỏ học thiếu trình độ cơ bản về tiếng Anh và Toán."
                    }
                ]
            },
            {
                "define": {
                    "en": "a skill or type of experience that you need for a particular job or activity",
                    "vi": "một kỹ năng hoặc loại kinh nghiệm mà bạn cần cho một công việc hoặc hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "What qualifications do radio presenters require?",
                        "vi": "Người dẫn chương trình phát thanh yêu cầu những bằng cấp gì?"
                    },
                    {
                        "en": "qualification for something Previous teaching experience is a necessary qualification for this job.",
                        "vi": "trình độ cho một cái gì đó Kinh nghiệm giảng dạy trước đây là một bằng cấp cần thiết cho công việc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "information that you add to a statement to limit the effect that it has or the way it is applied",
                    "vi": "thông tin mà bạn thêm vào một tuyên bố để hạn chế ảnh hưởng của nó hoặc cách nó được áp dụng"
                },
                "examples": [
                    {
                        "en": "I accept his theories, but not without certain qualifications.",
                        "vi": "Tôi chấp nhận lý thuyết của ông ấy, nhưng không phải là không có trình độ nhất định."
                    },
                    {
                        "en": "The plan was approved without qualification.",
                        "vi": "Kế hoạch đã được phê duyệt mà không cần đủ điều kiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of passing an exam, completing a course of training or reaching the standard necessary to do a job or take part in a competition",
                    "vi": "thực tế là vượt qua một kỳ thi, hoàn thành một khóa đào tạo hoặc đạt đến tiêu chuẩn cần thiết để làm một công việc hoặc tham gia một cuộc thi"
                },
                "examples": [
                    {
                        "en": "Nurses in training should be given a guarantee of employment following qualification.",
                        "vi": "Các y tá được đào tạo phải được đảm bảo việc làm sau khi đủ tiêu chuẩn."
                    },
                    {
                        "en": "A victory in this game will earn them qualification for the World Cup.",
                        "vi": "Một chiến thắng trong trận đấu này sẽ giúp họ có suất tham dự World Cup."
                    }
                ]
            }
        ]
    },
    {
        "id": "a59281dc32a4475c8c4f70c35f2f37d5",
        "word": "qualified",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkwɒlɪfaɪd/",
            "us": "/ˈkwɑːlɪfaɪd/"
        },
        "nearby": [
            {
                "word": "Quaker Oats",
                "pos": ""
            },
            {
                "word": "qualification",
                "pos": "noun"
            },
            {
                "word": "qualified",
                "pos": "adjective"
            },
            {
                "word": "qualifier",
                "pos": "noun"
            },
            {
                "word": "qualify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having passed the exams or completed the training that are necessary in order to do a particular job; having the experience to do a particular job",
                    "vi": "đã vượt qua các kỳ thi hoặc hoàn thành khóa đào tạo cần thiết để làm một công việc cụ thể; có kinh nghiệm để làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "a qualified teacher",
                        "vi": "một giáo viên có trình độ"
                    },
                    {
                        "en": "a qualified instructor/accountant/nurse/doctor",
                        "vi": "một người hướng dẫn / kế toán / y tá / bác sĩ có trình độ"
                    },
                    {
                        "en": "qualified staff/personnel",
                        "vi": "nhân viên / nhân viên có trình độ"
                    },
                    {
                        "en": "to be highly qualified",
                        "vi": "có trình độ cao"
                    },
                    {
                        "en": "to be suitably/fully qualified",
                        "vi": "đủ tiêu chuẩn / phù hợp"
                    },
                    {
                        "en": "qualified for something She's extremely well qualified for the job.",
                        "vi": "đủ điều kiện cho một cái gì đó Cô ấy có trình độ cực kỳ tốt cho công việc."
                    },
                    {
                        "en": "qualified to do something I'm not qualified to teach in state schools.",
                        "vi": "đủ điều kiện để làm điều gì đó mà tôi không đủ tiêu chuẩn để dạy trong các trường tiểu bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the practical knowledge or skills to do something",
                    "vi": "có kiến thức hoặc kỹ năng thực tế để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I don't know much about it, so I don't feel qualified to comment.",
                        "vi": "Tôi không biết nhiều về nó, vì vậy tôi cảm thấy không đủ tư cách để nhận xét."
                    },
                    {
                        "en": "I'm not technically qualified to say anything.",
                        "vi": "Tôi không đủ trình độ kỹ thuật để nói bất cứ điều gì."
                    },
                    {
                        "en": "His supporters say he is uniquely qualified to lead the country out of the crisis.",
                        "vi": "Những người ủng hộ ông nói rằng ông có đủ tư cách duy nhất để lãnh đạo đất nước thoát khỏi khủng hoảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "limited in some way",
                    "vi": "hạn chế theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "The plan was given only qualified support.",
                        "vi": "Kế hoạch chỉ được cung cấp hỗ trợ đủ điều kiện."
                    },
                    {
                        "en": "The project was only a qualified success.",
                        "vi": "Dự án chỉ là một thành công đủ điều kiện."
                    },
                    {
                        "en": "It was met with qualified enthusiasm.",
                        "vi": "Nó đã được đáp ứng với sự nhiệt tình có trình độ."
                    },
                    {
                        "en": "The proposals received heavily qualified approval.",
                        "vi": "Các đề xuất đã nhận được nhiều phê duyệt đủ điều kiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9409faf89af4753a1b84ae0cb40ba22",
        "word": "work experience",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwɜːk ɪkspɪəriəns/",
            "us": "/ˈwɜːrk ɪkspɪriəns/"
        },
        "nearby": [
            {
                "word": "workers' compensation",
                "pos": "noun"
            },
            {
                "word": "work ethic",
                "pos": "noun"
            },
            {
                "word": "work experience",
                "pos": "noun"
            },
            {
                "word": "workfare",
                "pos": "noun"
            },
            {
                "word": "workflow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the work or jobs that you have done in your life so far",
                    "vi": "công việc hoặc công việc mà bạn đã làm trong cuộc sống của bạn cho đến nay"
                },
                "examples": [
                    {
                        "en": "The opportunities available will depend on your previous work experience and qualifications.",
                        "vi": "Các cơ hội có được sẽ phụ thuộc vào kinh nghiệm làm việc và trình độ của bạn trước đây."
                    },
                    {
                        "en": "What kind of work experience do you have?",
                        "vi": "Bạn có kinh nghiệm làm việc gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time that a young person, especially a student, spends working in a company as a form of training",
                    "vi": "một khoảng thời gian mà một người trẻ, đặc biệt là sinh viên, dành để làm việc trong một công ty như một hình thức đào tạo"
                },
                "examples": [
                    {
                        "en": "Students do work experience in local firms.",
                        "vi": "Sinh viên có kinh nghiệm làm việc trong các công ty địa phương."
                    },
                    {
                        "en": "He's doing a month's unpaid work experience with an engineering company.",
                        "vi": "Anh ấy đang trải qua một tháng làm việc không công với một công ty kỹ thuật."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa86ab9d872e4e38957de10215ec999a",
        "word": "covering letter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkʌvərɪŋ letə(r)/",
            "us": "/ˈkʌvərɪŋ letər/"
        },
        "nearby": [
            {
                "word": "cover in",
                "pos": "phrasal verb"
            },
            {
                "word": "covering",
                "pos": "noun"
            },
            {
                "word": "covering letter",
                "pos": "noun"
            },
            {
                "word": "coverlet",
                "pos": "noun"
            },
            {
                "word": "cover letter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a letter that you send with something explaining the contents of the document, etc. that you are sending",
                    "vi": "một lá thư bạn gửi với nội dung giải thích nội dung của tài liệu, v.v. mà bạn đang gửi"
                },
                "examples": [
                    {
                        "en": "Send a covering letter and a CV to the following address…",
                        "vi": "Gửi thư giới thiệu và CV đến địa chỉ sau…"
                    }
                ]
            }
        ]
    },
    {
        "id": "dfbc1a00284d4bf7b2dac5c603d18452",
        "word": "job description",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒɒb dɪskrɪpʃn/",
            "us": "/ˈdʒɑːb dɪskrɪpʃn/"
        },
        "nearby": [
            {
                "word": "Jobcentre Plus",
                "pos": "noun"
            },
            {
                "word": "job creation",
                "pos": "noun"
            },
            {
                "word": "job description",
                "pos": "noun"
            },
            {
                "word": "job-hunt",
                "pos": "verb"
            },
            {
                "word": "jobless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written description of the exact work and responsibilities of a job",
                    "vi": "một bản mô tả công việc chính xác và trách nhiệm của một công việc"
                },
                "examples": [
                    {
                        "en": "There was no mention of any cleaning in my job description.",
                        "vi": "Không có đề cập đến bất kỳ công việc dọn dẹp nào trong mô tả công việc của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "74b9bce7586b4a388e084e6ee46a404a",
        "word": "placement",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpleɪsmənt/",
            "us": "/ˈpleɪsmənt/"
        },
        "nearby": [
            {
                "word": "placeman",
                "pos": "noun"
            },
            {
                "word": "place mat",
                "pos": "noun"
            },
            {
                "word": "placement",
                "pos": "noun"
            },
            {
                "word": "placement test",
                "pos": "noun"
            },
            {
                "word": "place name",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of finding somebody a suitable job or place to live",
                    "vi": "hành động tìm cho ai đó một công việc hoặc nơi ở thích hợp"
                },
                "examples": [
                    {
                        "en": "a job placement service",
                        "vi": "một dịch vụ giới thiệu việc làm"
                    },
                    {
                        "en": "placement with a foster family",
                        "vi": "sắp xếp với một gia đình nuôi dưỡng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a job, often as part of a course of study, where you get some experience of a particular kind of work",
                    "vi": "một công việc, thường là một phần của khóa học, nơi bạn có được một số kinh nghiệm về một loại công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "The course includes a placement in Year 3.",
                        "vi": "Khóa học bao gồm một vị trí trong năm 3."
                    },
                    {
                        "en": "on placement The third year is spent on placement in selected companies.",
                        "vi": "về vị trí Năm thứ ba được dành cho việc bố trí vào các công ty được chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of placing something somewhere",
                    "vi": "hành động đặt một cái gì đó ở đâu đó"
                },
                "examples": [
                    {
                        "en": "This procedure ensures correct placement of the catheter.",
                        "vi": "Quy trình này đảm bảo vị trí chính xác của ống thông."
                    }
                ]
            }
        ]
    },
    {
        "id": "c755b6f6e2324c82bf33a06cd75785ad",
        "word": "position",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/pəˈzɪʃn/",
            "us": "/pəˈzɪʃn/"
        },
        "nearby": [
            {
                "word": "posing pouch",
                "pos": "noun"
            },
            {
                "word": "posit",
                "pos": "verb"
            },
            {
                "word": "position",
                "pos": "noun"
            },
            {
                "word": "position",
                "pos": "verb"
            },
            {
                "word": "positional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where somebody/something is located",
                    "vi": "nơi mà ai đó / cái gì đó được đặt"
                },
                "examples": [
                    {
                        "en": "Where would be the best position for the lights?",
                        "vi": "Đâu sẽ là vị trí tốt nhất cho đèn?"
                    },
                    {
                        "en": "from a/your position From his position on the cliff top, he had a good view of the harbour.",
                        "vi": "từ a / vị trí của bạn Từ vị trí của mình trên đỉnh vách đá, anh ta có một tầm nhìn tốt ra bến cảng."
                    },
                    {
                        "en": "She looked down over the scene from a raised position.",
                        "vi": "Cô ấy nhìn xuống khung cảnh từ một vị trí được nâng lên."
                    },
                    {
                        "en": "in a position These plants will grow well in a sheltered position.",
                        "vi": "ở một vị trí Những cây này sẽ phát triển tốt ở một vị trí có mái che."
                    },
                    {
                        "en": "The hotel stands in an elevated position looking out over the lake.",
                        "vi": "Khách sạn nằm ở vị trí trên cao nhìn ra hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where somebody/something is meant to be; the correct place",
                    "vi": "nơi mà ai đó / cái gì đó có nghĩa là; đúng nơi"
                },
                "examples": [
                    {
                        "en": "He took up his position by the door.",
                        "vi": "Anh ta vào vị trí của mình bên cửa."
                    },
                    {
                        "en": "in position Is everybody in position?",
                        "vi": "ở vị trí Mọi người đã vào vị trí chưa?"
                    },
                    {
                        "en": "The dancers all got into position.",
                        "vi": "Các vũ công đều đã vào vị trí."
                    },
                    {
                        "en": "She was learning to change her hand from first to third position (= on the strings of a violin).",
                        "vi": "Cô ấy đang học cách đổi tay từ vị trí thứ nhất sang vị trí thứ ba (= trên dây của một cây vĩ cầm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody is sitting or standing, or the way in which something is arranged",
                    "vi": "cách mà ai đó đang ngồi hoặc đứng hoặc cách sắp xếp thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a sitting/standing/kneeling position",
                        "vi": "tư thế ngồi / đứng / quỳ"
                    },
                    {
                        "en": "My arms were aching so I shifted (my) position slightly.",
                        "vi": "Cánh tay của tôi bị đau nên tôi hơi dịch chuyển vị trí (của mình)."
                    },
                    {
                        "en": "The soldiers had to stand for hours without changing position.",
                        "vi": "Những người lính phải đứng hàng giờ liền mà không thay đổi vị trí."
                    },
                    {
                        "en": "in a… position Keep the box in an upright position.",
                        "vi": "ở vị trí… Giữ hộp ở vị trí thẳng đứng."
                    },
                    {
                        "en": "Make sure that you are working in a comfortable position.",
                        "vi": "Đảm bảo rằng bạn đang làm việc trong tư thế thoải mái."
                    },
                    {
                        "en": "She moved the seat into a reclining position.",
                        "vi": "Cô chuyển ghế sang tư thế ngả lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the situation that somebody is in, especially when it affects what they can and cannot do",
                    "vi": "tình huống mà ai đó đang gặp phải, đặc biệt là khi nó ảnh hưởng đến những gì họ có thể và không thể làm"
                },
                "examples": [
                    {
                        "en": "The company's financial position is not certain.",
                        "vi": "Tình hình tài chính của công ty không chắc chắn."
                    },
                    {
                        "en": "The company hopes to maintain its position as market leader.",
                        "vi": "Công ty hy vọng sẽ giữ vững vị trí dẫn đầu thị trường."
                    },
                    {
                        "en": "in your position What would you do in my position?",
                        "vi": "ở vị trí của bạn Bạn sẽ làm gì ở vị trí của tôi?"
                    },
                    {
                        "en": "in a… position This put him and his colleagues in a difficult position.",
                        "vi": "ở một vị trí… Điều này đặt anh ấy và các đồng nghiệp của anh ấy vào một tình thế khó khăn."
                    },
                    {
                        "en": "This recent sale puts us in a strong position.",
                        "vi": "Việc bán hàng gần đây này đặt chúng tôi vào một vị trí vững chắc."
                    },
                    {
                        "en": "to be in a position of power/strength/authority",
                        "vi": "ở vị trí quyền lực / sức mạnh / quyền hạn"
                    },
                    {
                        "en": "in a position to do something I'm afraid I am not in a position to help you.",
                        "vi": "ở vị trí để làm điều gì đó Tôi e rằng tôi không có đủ tư cách để giúp bạn."
                    },
                    {
                        "en": "You are in no position to complain.",
                        "vi": "Bạn không có tư cách để phàn nàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an opinion on or an attitude towards a particular subject",
                    "vi": "một ý kiến hoặc một thái độ đối với một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "She has made her position very clear.",
                        "vi": "Cô ấy đã thể hiện rất rõ ràng lập trường của mình."
                    },
                    {
                        "en": "to change/reconsider/shift your position",
                        "vi": "để thay đổi / xem xét lại / thay đổi vị trí của bạn"
                    },
                    {
                        "en": "position on something the party’s position on education reforms",
                        "vi": "lập trường của đảng về cải cách giáo dục"
                    },
                    {
                        "en": "position that… My parents always took the position that early nights meant healthy children.",
                        "vi": "vị trí rằng… Cha mẹ tôi luôn quan điểm rằng những buổi tối sớm có nghĩa là những đứa trẻ khỏe mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or organization’s level of importance when compared with others",
                    "vi": "mức độ quan trọng của một người hoặc tổ chức khi so sánh với những người khác"
                },
                "examples": [
                    {
                        "en": "the position of women in society",
                        "vi": "vị trí của phụ nữ trong xã hội"
                    },
                    {
                        "en": "the company’s dominant position in the world market",
                        "vi": "vị trí thống lĩnh của công ty trên thị trường thế giới"
                    },
                    {
                        "en": "Atkins occupies a remarkable position in the history of photography.",
                        "vi": "Atkins chiếm một vị trí đáng chú ý trong lịch sử nhiếp ảnh."
                    },
                    {
                        "en": "Wealth and position (= high social status) were not important to her.",
                        "vi": "Sự giàu có và địa vị (= địa vị xã hội cao) không quan trọng đối với cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a job",
                    "vi": "một công việc"
                },
                "examples": [
                    {
                        "en": "He held a senior position in a large company.",
                        "vi": "Anh đã giữ một vị trí cấp cao trong một công ty lớn."
                    },
                    {
                        "en": "I should like to apply for the position of Sales Director.",
                        "vi": "Tôi muốn ứng tuyển vào vị trí Giám đốc Kinh doanh."
                    },
                    {
                        "en": "They are advertising for a clinic coordinator and hope to fill the position by June.",
                        "vi": "Họ đang quảng cáo cho một điều phối viên phòng khám và hy vọng sẽ lấp đầy vị trí này vào tháng Sáu."
                    },
                    {
                        "en": "We need more women in leadership positions.",
                        "vi": "Chúng ta cần nhiều phụ nữ hơn ở các vị trí lãnh đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place in a race, competition, or test, when compared to others",
                    "vi": "một vị trí trong cuộc đua, cuộc thi hoặc bài kiểm tra, khi so sánh với những người khác"
                },
                "examples": [
                    {
                        "en": "United's 3–0 win moved them up to third position.",
                        "vi": "Chiến thắng 3–0 của United đã đưa họ lên vị trí thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where somebody plays and the responsibilities they have in some team games",
                    "vi": "nơi mà ai đó chơi và trách nhiệm của họ trong một số trò chơi đồng đội"
                },
                "examples": [
                    {
                        "en": "What position does he play?",
                        "vi": "Anh ta chơi ở vị trí nào?"
                    },
                    {
                        "en": "Nakata had to play out of position when the defender was injured.",
                        "vi": "Nakata phải thi đấu lệch vị trí khi hậu vệ này dính chấn thương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a group of people involved in fighting have put men and guns",
                    "vi": "một nơi mà một nhóm người tham gia đánh nhau đã đặt người và súng"
                },
                "examples": [
                    {
                        "en": "They attacked the enemy positions at dawn.",
                        "vi": "Họ tấn công vào các vị trí của địch lúc rạng sáng."
                    },
                    {
                        "en": "The defence stuck firmly to its position.",
                        "vi": "Hàng thủ đã cố gắng giữ vững vị trí của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c1cb48e2bd049ec8100b3d6af320376",
        "word": "post",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/pəʊst/",
            "us": "/pəʊst/"
        },
        "nearby": [
            {
                "word": "possum",
                "pos": "noun"
            },
            {
                "word": "post-",
                "pos": "prefix"
            },
            {
                "word": "post",
                "pos": "noun"
            },
            {
                "word": "post",
                "pos": "verb"
            },
            {
                "word": "Emily Post",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official system used for sending and delivering letters, packages, etc.",
                    "vi": "hệ thống chính thức được sử dụng để gửi và chuyển thư, gói hàng, v.v."
                },
                "examples": [
                    {
                        "en": "by post I'll send the original to you by post.",
                        "vi": "qua đường bưu điện Tôi sẽ gửi bản gốc cho bạn qua đường bưu điện."
                    },
                    {
                        "en": "I sent it by first-class post.",
                        "vi": "Tôi đã gửi nó qua đường bưu điện hạng nhất."
                    },
                    {
                        "en": "in the post I'll put the documents in the post to you tomorrow.",
                        "vi": "trong bài viết tôi sẽ đưa các tài liệu trong bài gửi cho bạn vào ngày mai."
                    },
                    {
                        "en": "My application got lost in the post.",
                        "vi": "Ứng dụng của tôi đã bị thất lạc trong bài đăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "letters, packages, etc. that are sent and delivered",
                    "vi": "thư, gói, v.v. được gửi và chuyển"
                },
                "examples": [
                    {
                        "en": "There was a lot of post this morning.",
                        "vi": "Có rất nhiều bài viết sáng nay."
                    },
                    {
                        "en": "Have you opened your post yet?",
                        "vi": "Bạn đã mở bài viết của mình chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion during the day when letters, etc. are collected or delivered",
                    "vi": "một dịp trong ngày khi thư, v.v. được thu thập hoặc chuyển đi"
                },
                "examples": [
                    {
                        "en": "to catch/miss the post",
                        "vi": "để bắt / bỏ lỡ bài đăng"
                    },
                    {
                        "en": "in the post The parcel came in this morning's post.",
                        "vi": "trong bài Bưu kiện đã đến trong bài đăng sáng nay."
                    },
                    {
                        "en": "The form should arrive in the post tomorrow.",
                        "vi": "Hình thức sẽ đến trong bài viết vào ngày mai."
                    },
                    {
                        "en": "Payment should be sent by return of post (= immediately).",
                        "vi": "Thanh toán phải được gửi qua bưu điện (= ngay lập tức)."
                    },
                    {
                        "en": "Do you get a second post here?",
                        "vi": "Bạn có nhận được một bài viết thứ hai ở đây?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a message sent to a discussion group on the internet; a piece of writing that forms part of a blog",
                    "vi": "một tin nhắn được gửi đến một nhóm thảo luận trên internet; một đoạn văn tạo thành một phần của blog"
                },
                "examples": [
                    {
                        "en": "I love reading her posts because I learn so much.",
                        "vi": "Tôi thích đọc bài viết của cô ấy vì tôi học được rất nhiều."
                    },
                    {
                        "en": "They have deleted all my posts.",
                        "vi": "Họ đã xóa tất cả các bài viết của tôi."
                    },
                    {
                        "en": "post about somebody/something She wrote a post about the experience on her blog.",
                        "vi": "đăng về ai đó / điều gì đó Cô ấy đã viết một bài về trải nghiệm trên blog của mình."
                    },
                    {
                        "en": "post by somebody This post by Mark Brady is very interesting.",
                        "vi": "bài của ai đó Bài này của Mark Brady rất thú vị."
                    },
                    {
                        "en": "post from somebody The forum does not allow posts from non-members.",
                        "vi": "bài đăng từ ai đó Diễn đàn không cho phép bài viết từ những người không phải là thành viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a job, especially an important one in a large organization",
                    "vi": "một công việc, đặc biệt là một công việc quan trọng trong một tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "an academic/a government post",
                        "vi": "một học thuật / một bài đăng của chính phủ"
                    },
                    {
                        "en": "She took up a teaching post at Basle University.",
                        "vi": "Cô đã tham gia giảng dạy tại Đại học Basle."
                    },
                    {
                        "en": "to resign (from)/quit/leave a post",
                        "vi": "từ chức (từ) / nghỉ việc / để lại một bài đăng"
                    },
                    {
                        "en": "We will be creating 15 new posts next year.",
                        "vi": "Chúng tôi sẽ tạo 15 bài đăng mới trong năm tới."
                    },
                    {
                        "en": "The company has been unable to fill the post.",
                        "vi": "Công ty đã không thể điền vào bài đăng."
                    },
                    {
                        "en": "He has held the post for three years.",
                        "vi": "Ông đã giữ chức vụ này trong ba năm."
                    },
                    {
                        "en": "She was offered a key post in the new government.",
                        "vi": "Cô đã được đề nghị một vị trí quan trọng trong chính phủ mới."
                    },
                    {
                        "en": "post of something He accepted the post of deputy prime minister.",
                        "vi": "post of something Ông nhận chức phó thủ tướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of sending somebody to a particular place to do their job, especially for a limited period of time",
                    "vi": "một hành động cử ai đó đến một địa điểm cụ thể để thực hiện công việc của họ, đặc biệt là trong một khoảng thời gian giới hạn"
                },
                "examples": [
                    {
                        "en": "an overseas post",
                        "vi": "một bài đăng ở nước ngoài"
                    },
                    {
                        "en": "The island is rated by diplomats as a hardship post (= one that people do not like to be sent to because it is not a very comfortable place to live).",
                        "vi": "Hòn đảo được các nhà ngoại giao đánh giá là một nơi khó khăn (= một hòn đảo mà mọi người không thích được đưa đến vì nó không phải là một nơi thoải mái để sống)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where somebody, especially a soldier, does their job",
                    "vi": "nơi mà ai đó, đặc biệt là một người lính, làm công việc của họ"
                },
                "examples": [
                    {
                        "en": "a police/military/customs post",
                        "vi": "một trạm cảnh sát / quân đội / hải quan"
                    },
                    {
                        "en": "an observation post",
                        "vi": "một trạm quan sát"
                    },
                    {
                        "en": "Three soldiers were shot dead at a border post.",
                        "vi": "Ba binh sĩ bị bắn chết tại một đồn biên phòng."
                    },
                    {
                        "en": "The guards were ordered not to leave their posts.",
                        "vi": "Các lính canh được lệnh không được rời khỏi vị trí của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of wood or metal that is set in the ground in a position pointing upwards, especially to support something or to mark a point",
                    "vi": "một miếng gỗ hoặc kim loại được đặt dưới đất ở vị trí hướng lên trên, đặc biệt là để hỗ trợ một cái gì đó hoặc để đánh dấu một điểm"
                },
                "examples": [
                    {
                        "en": "She tied the dog to a post.",
                        "vi": "Cô ấy buộc con chó vào một cái cột."
                    },
                    {
                        "en": "corner posts (= that mark the corners of a sports field)",
                        "vi": "bài viết ở góc (= đánh dấu các góc của sân thể thao)"
                    },
                    {
                        "en": "The team’s ‘net’ was a piece of string tied to two posts.",
                        "vi": "Lưới' của đội là một đoạn dây buộc vào hai trụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where a race finishes, especially in horse racing",
                    "vi": "nơi kết thúc một cuộc đua, đặc biệt là trong cuộc đua ngựa"
                },
                "examples": [
                    {
                        "en": "The first horse past the post wins the race.",
                        "vi": "Con ngựa đầu tiên vượt qua cột thắng cuộc đua."
                    },
                    {
                        "en": "She led for most of the way before being pipped at the post (= beaten at the last moment).",
                        "vi": "Cô ấy đã dẫn đầu trong phần lớn chặng đường trước khi bị đánh bại ở vị trí cuối cùng (= bị đánh bại vào giây phút cuối cùng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the two posts that form part of a goal",
                    "vi": "một trong hai bài đăng tạo thành một phần của mục tiêu"
                },
                "examples": [
                    {
                        "en": "The ball hit the post and bounced in.",
                        "vi": "Bóng đập cột dọc bật ra."
                    },
                    {
                        "en": "He steered a shot between the goalkeeper and the near post.",
                        "vi": "Anh ấy thực hiện một cú sút vào giữa thủ môn và cột gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be forced to go from one person or situation to another without achieving anything",
                    "vi": "bị buộc phải đi từ người này sang tình huống khác mà không đạt được bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "Morale is very low. People have just had enough of being thrown from pillar to post.",
                        "vi": "Tinh thần rất thấp. Mọi người vừa đủ bị ném từ cột này sang cột khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "very deaf (= unable to hear anything)",
                    "vi": "rất điếc (= không thể nghe thấy gì)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e03a53ca169c46669eab9e601420f47d",
        "word": "recruit",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈkruːt/",
            "us": "/rɪˈkruːt/"
        },
        "nearby": [
            {
                "word": "recrudescence",
                "pos": "noun"
            },
            {
                "word": "recrudescent",
                "pos": "adjective"
            },
            {
                "word": "recruit",
                "pos": "verb"
            },
            {
                "word": "recruit",
                "pos": "noun"
            },
            {
                "word": "recruiter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find new people to join a company, an organization, the armed forces, etc.",
                    "vi": "để tìm những người mới tham gia vào một công ty, một tổ chức, lực lượng vũ trang, v.v."
                },
                "examples": [
                    {
                        "en": "recruit (somebody) We are trying to recruit officers from more diverse backgrounds.",
                        "vi": "tuyển dụng (ai đó) Chúng tôi đang cố gắng tuyển dụng các sĩ quan từ nhiều nguồn gốc khác nhau."
                    },
                    {
                        "en": "He's responsible for recruiting at all levels.",
                        "vi": "Anh ấy chịu trách nhiệm tuyển dụng ở tất cả các cấp."
                    },
                    {
                        "en": "recruit somebody to something They recruited several new members to the club.",
                        "vi": "tuyển dụng ai đó vào một cái gì đó Họ đã tuyển dụng một số thành viên mới vào câu lạc bộ."
                    },
                    {
                        "en": "recruit somebody to do something They recruited more staff to deal with the complaints.",
                        "vi": "tuyển dụng ai đó làm việc gì đó Họ tuyển thêm nhân viên để giải quyết các khiếu nại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade somebody to do something, especially to help you",
                    "vi": "thuyết phục ai đó làm điều gì đó, đặc biệt là giúp bạn"
                },
                "examples": [
                    {
                        "en": "We were recruited to help peel the vegetables.",
                        "vi": "Chúng tôi được tuyển dụng để giúp gọt rau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form a new army, team, etc. by persuading new people to join it",
                    "vi": "để thành lập một đội quân, đội mới, v.v. bằng cách thuyết phục những người mới tham gia"
                },
                "examples": [
                    {
                        "en": "to recruit a task force",
                        "vi": "tuyển dụng một đội đặc nhiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "07e6fe1b4a1848d1a755f317841f4e74",
        "word": "reference",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrefrəns/",
            "us": "/ˈrefrəns/"
        },
        "nearby": [
            {
                "word": "referee",
                "pos": "verb"
            },
            {
                "word": "referee's assistant",
                "pos": "noun"
            },
            {
                "word": "reference",
                "pos": "noun"
            },
            {
                "word": "reference",
                "pos": "verb"
            },
            {
                "word": "reference book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing you say or write that mentions somebody/something else; the act of mentioning somebody/something",
                    "vi": "một điều bạn nói hoặc viết đề cập đến ai đó / điều gì đó khác; hành động đề cập đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "reference to somebody/something She made no reference to her illness but only to her future plans.",
                        "vi": "tham chiếu đến ai đó / điều gì đó Cô ấy không đề cập đến căn bệnh của mình mà chỉ đề cập đến kế hoạch tương lai của cô ấy."
                    },
                    {
                        "en": "the President’s passing reference to (= brief mention of) the end of the war",
                        "vi": "lời đề cập của Tổng thống về (= đề cập ngắn gọn về) sự kết thúc của chiến tranh"
                    },
                    {
                        "en": "Her book contains many biblical references.",
                        "vi": "Cuốn sách của cô ấy chứa nhiều tài liệu tham khảo trong Kinh thánh."
                    },
                    {
                        "en": "His testimony included references to memos by the company's financial managers.",
                        "vi": "Lời khai của ông bao gồm các tham chiếu đến các bản ghi nhớ của các giám đốc tài chính của công ty."
                    },
                    {
                        "en": "Study their correspondence and you find only three references to George Washington.",
                        "vi": "Nghiên cứu thư từ của họ và bạn chỉ tìm thấy ba tài liệu tham khảo về George Washington."
                    },
                    {
                        "en": "She discreetly avoided any specific reference to religion.",
                        "vi": "Cô ấy kín đáo tránh bất kỳ đề cập cụ thể nào đến tôn giáo."
                    },
                    {
                        "en": "reference to doing something The book is full of references to growing up in India.",
                        "vi": "tham khảo để làm điều gì đó Cuốn sách có đầy đủ các tài liệu tham khảo về việc lớn lên ở Ấn Độ."
                    },
                    {
                        "en": "There are frequent references in the text to the English Civil War.",
                        "vi": "Trong văn bản thường xuyên nhắc đến Nội chiến Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of looking at something for information",
                    "vi": "hành động nhìn vào thứ gì đó để tìm thông tin"
                },
                "examples": [
                    {
                        "en": "for reference A copy of the booklet is given to the employee for reference.",
                        "vi": "để tham khảo Một bản sao của tập sách được đưa cho nhân viên để tham khảo."
                    },
                    {
                        "en": "Keep the list of numbers near the phone for easy reference.",
                        "vi": "Giữ danh sách các số gần điện thoại để dễ dàng tham khảo."
                    },
                    {
                        "en": "I wrote down the name of the hotel for future reference (= because it might be useful in the future).",
                        "vi": "Tôi đã viết ra tên của khách sạn để tham khảo trong tương lai (= vì nó có thể hữu ích trong tương lai)."
                    },
                    {
                        "en": "The library contains many popular works of reference (= books that contain facts and information).",
                        "vi": "Thư viện chứa nhiều tác phẩm tham khảo phổ biến (= sách chứa các dữ kiện và thông tin)."
                    },
                    {
                        "en": "We provided reference materials about our Greek vase collection.",
                        "vi": "Chúng tôi đã cung cấp tài liệu tham khảo về bộ sưu tập bình Hy Lạp của chúng tôi."
                    },
                    {
                        "en": "reference to something Reference to the guide shows that the word has been used in the latter sense.",
                        "vi": "tham chiếu đến điều gì đó Tham chiếu đến hướng dẫn cho thấy rằng từ này đã được sử dụng theo nghĩa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number, word or symbol that shows where something is on a map, or where you can find a piece of information",
                    "vi": "một số, từ hoặc ký hiệu cho biết vị trí của một thứ gì đó trên bản đồ hoặc nơi bạn có thể tìm thấy một phần thông tin"
                },
                "examples": [
                    {
                        "en": "The map reference is Y4.",
                        "vi": "Tham chiếu bản đồ là Y4."
                    },
                    {
                        "en": "It is essential that an accurate grid reference is given.",
                        "vi": "Điều cần thiết là phải cung cấp một tham chiếu lưới chính xác."
                    },
                    {
                        "en": "Please quote your reference number when making an enquiry.",
                        "vi": "Vui lòng trích dẫn số tham chiếu của bạn khi thực hiện một yêu cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of asking somebody for help or advice",
                    "vi": "hành động yêu cầu ai đó giúp đỡ hoặc lời khuyên"
                },
                "examples": [
                    {
                        "en": "The emergency nurse can treat minor injuries without reference to a doctor.",
                        "vi": "tá cấp cứu có thể điều trị những vết thương nhỏ mà không cần tham khảo ý kiến của bác sĩ."
                    },
                    {
                        "en": "The decision was made without reference to local managers.",
                        "vi": "Quyết định được đưa ra mà không có sự tham khảo của các nhà quản lý địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a letter written by somebody who knows you, giving information about your character and abilities, especially to a new employer",
                    "vi": "một lá thư được viết bởi một người biết bạn, cung cấp thông tin về tính cách và khả năng của bạn, đặc biệt là cho một nhà tuyển dụng mới"
                },
                "examples": [
                    {
                        "en": "I'm sure she'll give you a good reference.",
                        "vi": "Tôi chắc rằng cô ấy sẽ cung cấp cho bạn một tài liệu tham khảo tốt."
                    },
                    {
                        "en": "We will take up references (= contact the people who provided them) after the interview.",
                        "vi": "Chúng tôi sẽ xem xét các tài liệu tham khảo (= liên hệ với những người đã cung cấp chúng) sau cuộc phỏng vấn."
                    },
                    {
                        "en": "We'll need a reference from your current employer.",
                        "vi": "Chúng tôi sẽ cần một tài liệu tham khảo từ nhà tuyển dụng hiện tại của bạn."
                    },
                    {
                        "en": "She asked him to provide a reference for her.",
                        "vi": "Cô ấy yêu cầu anh ta cung cấp một tài liệu tham khảo cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who agrees to write a reference, for you, for example when you are applying for a job",
                    "vi": "một người đồng ý viết tài liệu tham khảo cho bạn, chẳng hạn như khi bạn đang nộp đơn xin việc"
                },
                "examples": [
                    {
                        "en": "My previous boss will act as a reference for me.",
                        "vi": "Ông chủ trước đây của tôi sẽ đóng vai trò là người tham khảo cho tôi."
                    },
                    {
                        "en": "His former employer agreed to act as a reference for him.",
                        "vi": "Người sử dụng lao động cũ của anh ấy đã đồng ý làm người tham khảo cho anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a note in a book that tells you where a particular piece of information comes from",
                    "vi": "một ghi chú trong một cuốn sách cho bạn biết một phần thông tin cụ thể đến từ đâu"
                },
                "examples": [
                    {
                        "en": "There is a list of references at the end of each chapter.",
                        "vi": "Có một danh sách các tài liệu tham khảo ở cuối mỗi chương."
                    },
                    {
                        "en": "For references, see Section D above.",
                        "vi": "Để tham khảo, hãy xem Phần D ở trên."
                    },
                    {
                        "en": "reference to something References to previous research are listed in an appendix.",
                        "vi": "tham chiếu đến điều gì đó Các tài liệu tham khảo về nghiên cứu trước đây được liệt kê trong phần phụ lục."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what you are talking or writing about",
                    "vi": "được sử dụng để nói những gì bạn đang nói hoặc viết về"
                },
                "examples": [
                    {
                        "en": "With reference to your letter of July 22…",
                        "vi": "Với tham chiếu đến lá thư của bạn ngày 22 tháng 7…"
                    },
                    {
                        "en": "I am writing with reference to your job application.",
                        "vi": "Tôi đang viết thư với tham chiếu đến đơn xin việc của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "86ba732456804a2599a7d509f7a874e8",
        "word": "appoint",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈpɔɪnt/",
            "us": "/əˈpɔɪnt/"
        },
        "nearby": [
            {
                "word": "appliquéd",
                "pos": "adjective"
            },
            {
                "word": "apply",
                "pos": "verb"
            },
            {
                "word": "appoint",
                "pos": "verb"
            },
            {
                "word": "appointee",
                "pos": "noun"
            },
            {
                "word": "appointment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody for a job or position of responsibility",
                    "vi": "để chọn ai đó cho một công việc hoặc vị trí trách nhiệm"
                },
                "examples": [
                    {
                        "en": "appoint somebody They have appointed a new head teacher at my son's school.",
                        "vi": "bổ nhiệm ai đó Họ đã bổ nhiệm một giáo viên hiệu trưởng mới tại trường học của con trai tôi."
                    },
                    {
                        "en": "appoint somebody to something She has recently been appointed to the committee.",
                        "vi": "bổ nhiệm ai đó vào việc gì đó Cô ấy gần đây đã được bổ nhiệm vào ủy ban."
                    },
                    {
                        "en": "appoint somebody (as) something They appointed him (as) captain of the English team.",
                        "vi": "bổ nhiệm ai đó (với tư cách) điều gì đó Họ đã bổ nhiệm anh ta (với tư cách) đội trưởng của đội Anh."
                    },
                    {
                        "en": "She's been appointed British ambassador to the UN.",
                        "vi": "Cô ấy được bổ nhiệm làm đại sứ Anh tại LHQ."
                    },
                    {
                        "en": "appoint somebody to do something A lawyer was appointed to represent the child.",
                        "vi": "chỉ định ai đó làm việc gì đó Một luật sư đã được chỉ định để đại diện cho đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange or decide on a time or place for doing something",
                    "vi": "để sắp xếp hoặc quyết định về thời gian hoặc địa điểm để làm một việc gì đó"
                },
                "examples": [
                    {
                        "en": "be appointed A date for the meeting is still to be appointed.",
                        "vi": "được chỉ định Một ngày cho cuộc họp vẫn được chỉ định."
                    },
                    {
                        "en": "Everyone was assembled at the appointed time.",
                        "vi": "Mọi người đã được tập hợp vào thời gian đã định."
                    }
                ]
            }
        ]
    },
    {
        "id": "db280dd458f74e2f9845f73516c2a305",
        "word": "intern",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪntɜːn/",
            "us": "/ˈɪntɜːrn/"
        },
        "nearby": [
            {
                "word": "intermix",
                "pos": "verb"
            },
            {
                "word": "intern",
                "pos": "verb"
            },
            {
                "word": "intern",
                "pos": "noun"
            },
            {
                "word": "internal",
                "pos": "adjective"
            },
            {
                "word": "internal combustion engine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a student or new graduate who is getting practical experience in a job, sometimes without pay, for example during the summer holiday",
                    "vi": "một sinh viên hoặc sinh viên mới tốt nghiệp đang có kinh nghiệm thực tế trong một công việc, đôi khi không được trả lương, chẳng hạn như trong kỳ nghỉ hè"
                },
                "examples": [
                    {
                        "en": "a summer intern at a law firm",
                        "vi": "một thực tập sinh mùa hè tại một công ty luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "an advanced student of medicine whose training is nearly finished and who is working in a hospital to get further practical experience",
                    "vi": "một sinh viên y khoa tiên tiến đã gần kết thúc khóa đào tạo và đang làm việc trong bệnh viện để có thêm kinh nghiệm thực tế"
                },
                "examples": [
                    {
                        "en": "Interns and residents at the hospital are working 12-hour shifts.",
                        "vi": "Thực tập sinh và cư dân tại bệnh viện đang làm việc theo ca 12 giờ."
                    },
                    {
                        "en": "Interns in hospitals learn how to act professionally in the most dire emergencies.",
                        "vi": "Các sinh viên thực tập tại bệnh viện học cách hành động chuyên nghiệp trong những trường hợp khẩn cấp nghiêm trọng nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd29c3ce56a548c098b172cad4335b7a",
        "word": "internship",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪntɜːnʃɪp/",
            "us": "/ˈɪntɜːrnʃɪp/"
        },
        "nearby": [
            {
                "word": "internist",
                "pos": "noun"
            },
            {
                "word": "internment",
                "pos": "noun"
            },
            {
                "word": "internship",
                "pos": "noun"
            },
            {
                "word": "interoffice",
                "pos": "adjective"
            },
            {
                "word": "interoperability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time during which a student or new graduate gets practical experience in a job, for example during the summer holiday",
                    "vi": "khoảng thời gian mà sinh viên hoặc sinh viên mới tốt nghiệp có được kinh nghiệm thực tế trong công việc, ví dụ như trong kỳ nghỉ hè"
                },
                "examples": [
                    {
                        "en": "an internship at a television station",
                        "vi": "thực tập ở đài truyền hình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a job that an advanced student of medicine, whose training is nearly finished, does in a hospital to get further practical experience",
                    "vi": "một công việc mà một sinh viên y khoa tiên tiến, người đã được đào tạo gần xong, làm trong bệnh viện để có thêm kinh nghiệm thực tế"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b910f05dcb994ccaa7e4f262c6d85588",
        "word": "interviewee",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪntəvjuːˈiː/",
            "us": "/ˌɪntərvjuːˈiː/"
        },
        "nearby": [
            {
                "word": "interview",
                "pos": "noun"
            },
            {
                "word": "interview",
                "pos": "verb"
            },
            {
                "word": "interviewee",
                "pos": "noun"
            },
            {
                "word": "interviewer",
                "pos": "noun"
            },
            {
                "word": "interviewing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person who answers the questions in an interview",
                    "vi": "người trả lời các câu hỏi trong một cuộc phỏng vấn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "72b7ae5a62ed4179be692fdb9e2f7242",
        "word": "job-hunt",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒɒb hʌnt/",
            "us": "/ˈdʒɑːb hʌnt/"
        },
        "nearby": [
            {
                "word": "job creation",
                "pos": "noun"
            },
            {
                "word": "job description",
                "pos": "noun"
            },
            {
                "word": "job-hunt",
                "pos": "verb"
            },
            {
                "word": "jobless",
                "pos": "adjective"
            },
            {
                "word": "joblessness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to find a job",
                    "vi": "cố gắng tìm một công việc"
                },
                "examples": [
                    {
                        "en": "At that time I had been job-hunting for six months.",
                        "vi": "Lúc đó tôi đã tìm việc được sáu tháng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec0c51abb0884ca59c47a44185e58ae7",
        "word": "referee",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌrefəˈriː/",
            "us": "/ˌrefəˈriː/"
        },
        "nearby": [
            {
                "word": "refer",
                "pos": "verb"
            },
            {
                "word": "referable",
                "pos": "adjective"
            },
            {
                "word": "referee",
                "pos": "noun"
            },
            {
                "word": "referee",
                "pos": "verb"
            },
            {
                "word": "referee's assistant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official who controls the game in some sports",
                    "vi": "quan chức điều khiển trò chơi trong một số môn thể thao"
                },
                "examples": [
                    {
                        "en": "He was sent off for arguing with the referee.",
                        "vi": "Anh ta đã bị đuổi khỏi sân vì tranh cãi với trọng tài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who gives information about your character and ability, usually in a letter, for example when you are applying for a job",
                    "vi": "một người cung cấp thông tin về tính cách và khả năng của bạn, thường là trong một lá thư, chẳng hạn như khi bạn đang nộp đơn xin việc"
                },
                "examples": [
                    {
                        "en": "The principal often acts as a referee for his students.",
                        "vi": "Hiệu trưởng thường làm trọng tài cho học sinh của mình."
                    },
                    {
                        "en": "His former employer agreed to act as a referee for him.",
                        "vi": "Người chủ cũ của anh đã đồng ý làm trọng tài cho anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is asked to settle an argument",
                    "vi": "một người được yêu cầu giải quyết một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "to act as a referee between the parties involved",
                        "vi": "hoạt động như một trọng tài giữa các bên liên quan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who reads and checks the quality of an academic article before it is published",
                    "vi": "một người đọc và kiểm tra chất lượng của một bài báo học thuật trước khi nó được xuất bản"
                },
                "examples": [
                    {
                        "en": "All papers are sent out to external referees.",
                        "vi": "Tất cả các giấy tờ được gửi cho các trọng tài bên ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "079e649043bb4a759b3f3d2a50d08527",
        "word": "résumé",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrezjuːmeɪ/",
            "us": "/ˈrezəmeɪ/"
        },
        "nearby": [
            {
                "word": "resultative",
                "pos": "adjective"
            },
            {
                "word": "resume",
                "pos": "verb"
            },
            {
                "word": "résumé",
                "pos": "noun"
            },
            {
                "word": "resumption",
                "pos": "noun"
            },
            {
                "word": "resupply",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short summary or account of something",
                    "vi": "một bản tóm tắt ngắn hoặc tài khoản của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a brief résumé of events so far",
                        "vi": "một bản lý lịch ngắn gọn về các sự kiện cho đến nay"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written record of your education and the jobs you have done, that you send when you are applying for a job",
                    "vi": "một bản ghi chép về quá trình học tập của bạn và những công việc bạn đã làm, mà bạn gửi khi đi xin việc"
                },
                "examples": [
                    {
                        "en": "Yes, I've read your résumé. Very impressive.",
                        "vi": "Vâng, tôi đã đọc bản lý lịch của bạn. Rất ấn tượng."
                    },
                    {
                        "en": "You can post your résumé on the website free of charge.",
                        "vi": "Bạn có thể đăng lý lịch của mình trên trang web miễn phí."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f833b758eb5433f93706ec8fa01fa23",
        "word": "vacancy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈveɪkənsi/",
            "us": "/ˈveɪkənsi/"
        },
        "nearby": [
            {
                "word": "VA",
                "pos": ""
            },
            {
                "word": "vac",
                "pos": "noun"
            },
            {
                "word": "vacancy",
                "pos": "noun"
            },
            {
                "word": "vacant",
                "pos": "adjective"
            },
            {
                "word": "vacantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a job that is available for somebody to do",
                    "vi": "một công việc có sẵn để ai đó làm"
                },
                "examples": [
                    {
                        "en": "job vacancies",
                        "vi": "tuyển dụng việc làm"
                    },
                    {
                        "en": "Her going on maternity leave will create a temporary vacancy.",
                        "vi": "Việc cô ấy nghỉ sinh sẽ tạo ra một vị trí trống tạm thời."
                    },
                    {
                        "en": "vacancy (for somebody/something) vacancies for bar staff",
                        "vi": "vị trí tuyển dụng (cho ai đó / cái gì đó) vị trí tuyển dụng cho nhân viên quầy bar"
                    },
                    {
                        "en": "to fill a vacancy",
                        "vi": "để lấp đầy một vị trí tuyển dụng"
                    },
                    {
                        "en": "There’s a vacancy in the accounts department.",
                        "vi": "Có một vị trí tuyển dụng trong bộ phận tài khoản."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room that is available in a hotel, etc.",
                    "vi": "một phòng có sẵn trong một khách sạn, v.v."
                },
                "examples": [
                    {
                        "en": "I'm sorry, we have no vacancies.",
                        "vi": "Tôi xin lỗi, chúng tôi không có vị trí tuyển dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of a job or room being available",
                    "vi": "thực tế là một công việc hoặc phòng trống"
                },
                "examples": [
                    {
                        "en": "high office vacancy rates and stagnant housing prices",
                        "vi": "tỷ lệ trống văn phòng cao và giá nhà đất trì trệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "lack of interest or ideas",
                    "vi": "thiếu quan tâm hoặc ý tưởng"
                },
                "examples": [
                    {
                        "en": "the vacancy of her expression",
                        "vi": "chỗ trống của biểu hiện của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "ef0c1b5c3d4f47c1bd39d260031ced13",
        "word": "exit interview",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeksɪt ɪntəvjuː/",
            "us": "/ˈeksɪt ɪntərvjuː/"
        },
        "nearby": [
            {
                "word": "exit",
                "pos": "verb"
            },
            {
                "word": "exit exam",
                "pos": "noun"
            },
            {
                "word": "exit interview",
                "pos": "noun"
            },
            {
                "word": "exit poll",
                "pos": "noun"
            },
            {
                "word": "exit strategy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an interview with an employee leaving their job, a student finishing a study programme, etc. in order to find out why they are leaving or what their experience was like",
                    "vi": "một cuộc phỏng vấn với một nhân viên rời bỏ công việc của họ, một sinh viên đang hoàn thành chương trình học, v.v. để tìm hiểu lý do tại sao họ rời đi hoặc trải nghiệm của họ như thế nào"
                },
                "examples": [
                    {
                        "en": "He urged all firms to carry out exit interviews when staff are leaving.",
                        "vi": "Ông kêu gọi tất cả các công ty thực hiện các cuộc phỏng vấn xuất cảnh khi nhân viên rời đi."
                    },
                    {
                        "en": "At their exit interviews, 100 per cent of the students reported that they loved the new system.",
                        "vi": "Tại các cuộc phỏng vấn xin xuất cảnh, 100% sinh viên cho biết họ yêu thích hệ thống mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "539ec5a4e7224268a58f7f311158b1f8",
        "word": "grill",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrɪl/",
            "us": "/ɡrɪl/"
        },
        "nearby": [
            {
                "word": "grifter",
                "pos": "noun"
            },
            {
                "word": "grill",
                "pos": "noun"
            },
            {
                "word": "grill",
                "pos": "verb"
            },
            {
                "word": "grille",
                "pos": "noun"
            },
            {
                "word": "grilling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cook food under a very strong heat",
                    "vi": "nấu thức ăn dưới nhiệt độ rất mạnh"
                },
                "examples": [
                    {
                        "en": "Grill the sausages for ten minutes.",
                        "vi": "Nướng xúc xích trong mười phút."
                    },
                    {
                        "en": "grilled bacon",
                        "vi": "thịt xông khói nướng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cook food over a fire, especially outdoors",
                    "vi": "nấu thức ăn trên lửa, đặc biệt là ở ngoài trời"
                },
                "examples": [
                    {
                        "en": "grilled meat and shrimp",
                        "vi": "thịt và tôm nướng"
                    },
                    {
                        "en": "At night we used to grill steaks over charcoal in the open air.",
                        "vi": "Vào ban đêm, chúng tôi thường nướng thịt nướng trên than hoa ngoài trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about their ideas, actions, etc., often in an unpleasant way",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về ý tưởng, hành động, v.v. của họ, thường theo cách khó chịu"
                },
                "examples": [
                    {
                        "en": "They grilled her about where she had been all night.",
                        "vi": "Họ nướng cô về nơi cô đã ở suốt đêm."
                    },
                    {
                        "en": "He was grilled by detectives for several hours.",
                        "vi": "Anh ta đã bị các thám tử nướng trong vài giờ."
                    }
                ]
            }
        ]
    }
]