[
    {
        "id": "45a180018fdc419f8f3b70a16d600190",
        "title": "Morning",
        "content": "He wakes up. He sees the sun rise. He brushes his teeth. His teeth are white. He puts on his clothes. His shirt is blue. His shoes are yellow. His pants are brown. He goes downstairs. He gets a bowl. He pours milk and cereal. He eats. He gets the newspaper. He reads."
    },
    {
        "id": "e75694585084412e963349578a6b316a",
        "title": "First Day of School",
        "content": "He goes to class. There is an empty seat in front. He sits in the seat. He looks around. There are different people. He says \"hi\" to the girl next to him. She smiles. The teacher comes in. She closes the door. Everyone is silent. The first day of school begins."
    },
    {
        "id": "a22366fbf02c458788c5646ae7cf141f",
        "title": "Water on the Floor",
        "content": "She is thirsty. She gets a glass of water. She begins to walk. She drops the glass. There is water on the floor. The puddle is big. She gets a mop. She wipes the water off. The floor is clean. She gets another glass of water. She drinks it. She is happy."
    },
    {
        "id": "91275acdfe924f81902187146856dd05",
        "title": "Babysitting",
        "content": "Casey wants a new car. She needs money. She decides to babysit. She takes care of the child. She feeds him lunch. She reads him a story. The story is funny. The child laughs. Casey likes him. The child's mom comes home. The child kisses Casey. Casey leaves. She will babysit him again."
    },
    {
        "id": "4ffc338f09254a78811c6501e104c955",
        "title": "A Doctor",
        "content": "Sam is a doctor. He takes care of people. He smiles at them. He gives them medicine. He gives stickers to the younger patients. The younger patients like him. They see him when they are sick. He makes them feel better. This makes him happy. He loves his job. He goes home proud."
    },
    {
        "id": "ca6d62a9fe8940379ec0033eae243697",
        "title": "Twins",
        "content": "Jill and Jodi are twins. They look the same. But they act differently. Jill likes sports. She is good at basketball and golf. She is also loud. She talks all day. Jodi likes reading. She can read 300 pages a day. She is also quiet. She does not like to talk. Jill and Jodi still love each other."
    },
    {
        "id": "dd43e61bb725407db1adc4162752a308",
        "title": "Reading",
        "content": "The book is in the library. Jodi goes to the library. She wants to borrow it. She uses her card to check it out. She takes the book back home. She sits on the couch. She reads the first page. It is good. She reads twenty more pages. It is not that good anymore. Jodi returns the book."
    },
    {
        "id": "ebb4b65f28c74ffc92acd1f4dd965028",
        "title": "Ruined by the Rain",
        "content": "Brenda wants to have a picnic. She gets a basket. She puts sandwiches in the basket. The sandwiches are healthy. They are also tasty. She drives to the park. She lays out a blanket. She hears a sound. It is raining. She folds the blanket back. She puts the food in the basket."
    },
    {
        "id": "34256169e53c4daab68be0559cbc7f0d",
        "title": "Banana Nut Muffin",
        "content": "Mary goes to the store. The store is very big. The store sells  bakery goods. Mary sees a carrot cake. She does not like carrots. She sees a banana nut muffin. It looks good. It costs two dollars. She buys it. She takes the wrapper off. She takes a big bite. It is crunchy on the outside. It is soft on the inside."
    },
    {
        "id": "4f697325765d4172b88e3a951d65c38e",
        "title": "The Park",
        "content": "Linda loves the park. There is so much to do. First, she looks at the sky. One cloud looks like a dog. Another cloud looks like a sheep. Later, she feeds the ducks. They are hungry. Linda throws bread crumbs. The ducks enjoy the food. Finally, Linda watches the sun go down. It is beautiful."
    },
    {
        "id": "863b7df7a53f4501b2b3ba104b76a7c1",
        "title": "A New Vision",
        "content": "Sandra cannot see. A bird looks like a pillow. A pillow looks like a marshmallow. A marshmallow looks like a tree. A tree looks like a bee. Sandra goes to a doctor. The doctor gives her glasses. She puts them on. She can see the doctor. His eyes are blue. Everything is clear."
    },
    {
        "id": "d5b57ed4c638497789beeca186eb8a24",
        "title": "Fruit Shop",
        "content": "Carol walks to the store. The store sells fruits. The fruits are colorful. Strawberries and apples are red. Tangerines and pumpkins are orange. Lemons are yellow. Limes are green. Blueberries are blue. Grapes and plums are purple. Carol's favorite color is purple. She buys a plum. She leaves the store. She bites the plum. It is tasty."
    },
    {
        "id": "6623112f5d5f455280238382e908c852",
        "title": "Special Cereal",
        "content": "He wakes up early. He is tired. He needs breakfast. Breakfast will give him energy. He goes to the kitchen. He pours milk into the bowl. He sees the wheat cereal box. Wheat cereal is healthy. He opens the box. There is a toy inside. It is a small car."
    },
    {
        "id": "4c78ca9131ec4955bc8ca1e8ed533586",
        "title": "A New Shirt",
        "content": "She goes to the mall. There are many stores at the mall. She sees a clothing store. She goes inside. There are many different shirts. Some shirts have flowers. Other shirts have stripes. She gets a flowered shirt. It is pink and white. She tries it on. She looks in the mirror. The shirt looks great."
    },
    {
        "id": "25ca112d802c41438e4c3a1fce282924",
        "title": "Picking a Color for the House",
        "content": "His house is white. White is too boring. He goes to the paint store. He looks at the different colors. He sees the red bucket. Red is too daring. He sees the blue bucket. Blue is too sad. He sees the yellow bucket. Yellow is too bright. He sees the green bucket. Green is perfect."
    },
    {
        "id": "c34268c78f8746739e61aa670fe8f00c",
        "title": "The Beach Is Fun",
        "content": "The beach is fun! Some people swim in the water. They see who is the fastest. The winner gets a surfboard. Some people lie down on the sand. They want to relax. The kids make sandcastles. They try to make the castles big and tall. Later, the water washes the sandcastles away. The kids make new ones."
    },
    {
        "id": "97a925845769456cb3171083cb57c958",
        "title": "A Beautiful Garden",
        "content": "The garden is beautiful. The garden is big. There are many flowers. There are pink flowers. There are purple flowers. There are small flowers. There are big flowers. The gardener plants more flowers. There is also a fountain. Kids sit next to it. Kids throw coins into it. Their parents smile."
    },
    {
        "id": "fe358d0635ce4942a435a22461798d65",
        "title": "She Shoots, She Scores",
        "content": "She plays basketball. The game is intense. She stares at her teammate. Her teammate passes the ball to her. She runs to her team's side of the court. She dunks the ball in the basket. Her team is happy. They hug her. They shout her name. The people in the bleachers shout, \"Hooray!\""
    },
    {
        "id": "4f129d4fe8e44ae38563723e285d7585",
        "title": "Celebrating the Win",
        "content": "Her basketball team won a big game. They want to celebrate. They have to buy some things. They split the work. Patricia goes to the bakery shop. She orders a cake shaped like a basketball. Linda gets the decorations. She buys bottles of bubbles and water balloons. All the team members meet at Mary's house. They celebrate."
    },
    {
        "id": "cba39d6fe1ac4d99a0e7f3eabfca8bbb",
        "title": "The Race",
        "content": "She stands at the starting line. She wishes her competitors good luck. They are racing to see who is the fastest. She is nervous. Her hands are already sweating. The whistle goes off. She starts to run. She starts slowly for a few minutes. Later, she speeds up. Her competitors are slow. They are. tired. She reaches the finish line. She wins."
    },
    {
        "id": "62ddfe6cf78f415eb9f10071275e98cf",
        "title": "Substitute Teacher",
        "content": "Ms. Smith is a great teacher. She makes math look easy. She also teaches her students how to be great people. Ms. Smith feels sick one day. Another teacher substitutes. Mr. Johnson teaches the class instead. Mr. Johnson is a bad teacher. He makes math confusing. He also yells at the students a lot. The students want Ms. Smith back."
    },
    {
        "id": "d5789914196a4f55b4468dd5ac28c811",
        "title": "Sticker Collection",
        "content": "He likes to collect stickers. He likes the way they feel and look. He has over 500. He has animal stickers. They are shiny and big. He has fruit-shaped stickers. They smell good. He even has stickers of bugs! They almost look real. He shows his sticker collection to everyone."
    },
    {
        "id": "ff43bcf1f57544b39b5dcc20f116f5ea",
        "title": "Getting Ready for the Road Trip",
        "content": "Her family is going to another state. It is far away. It will take them 48 hours to get there. They have to prepare. Her mom brings a map so that she knows where to go. Her dad buys sandwiches and bottles of water. She brings a camera. Now, they can remember this moment forever."
    },
    {
        "id": "83261d4b5a5c47c4a2dfc35e6ffa712a",
        "title": "Calling Her Brother",
        "content": "Karen lives in California. Her brother lives in Ohio. They miss each other. They only see each other once a year. Karen calls him every day. She talks about their parents. She also tells him about her day at school. He tells her about his day at college. They never want to say goodbye to each other."
    },
    {
        "id": "20b87b0a51064705904bdbc0f3312d19",
        "title": "Biking with Grandma",
        "content": "Lisa and her grandma go to the beach. They ride their bikes. Grandma still rides like a young girl. She is very fast. Lisa is slow, but she is willing to practice. The two ride their bikes for four hours. They decide to relax. Lisa gives her grandma a hug."
    },
    {
        "id": "4b380189f73d42f9b57439b76be308ca",
        "title": "The Newspaper Is Interesting",
        "content": "He hears a sound from outside. He looks out his window. The newspaper has arrived! He loves the newspaper. It's just so interesting. He reads the cover story. It is about a homeless man who won the lottery. Then, he looks at the cartoons. They are so funny. He loves the newspaper."
    },
    {
        "id": "cf032b6124374d71ad7f82cbb012c2d6",
        "title": "The New Neighbors",
        "content": "The Johnsons realize  that they have new neighbors. They visit the Taylors and say hello. The Taylors invite them in. They make spaghetti for the Johnsons to eat. The adults talk about the neighborhood. They also talk about what their jobs are. The kids all play in the Taylors' backyard. They get along well. The Taylors feel at home."
    },
    {
        "id": "12e5572e62bd40d0a9f2d598982864ef",
        "title": "A Scary Movie",
        "content": "She goes to the movie theater. The movie starts  to play. A monster appears on the screen. She screams. She is scared. She continues to watch. The screen is completely black. She reaches for some popcorn. The monster screams, \"Boo!\" She jumps and drops all her popcorn."
    },
    {
        "id": "9664fa78d8b840b6a7541cb192986d82",
        "title": "Stage Fright",
        "content": "It is time for the show. He plays a doctor in the play. He is nervous. He goes on the stage. He looks at his audience. There are so many people. They are all staring at him. He is about to speak. He forgets his lines. He goes back."
    },
    {
        "id": "ba763b325d5b4756a7014e1cb08c98aa",
        "title": "Lost and Found",
        "content": "Steven walks around his town. He trips over something. He looks down. It is a wallet. There are $500 cash, credit cards, and a driver's license in the wallet. Steven needs to return this to the owner. He takes the wallet to his town's lost and found center. Now, the owner can find it."
    },
    {
        "id": "e52a1b6762244e878d05a1399f60dc01",
        "title": "Asking for a Favor",
        "content": "I drive my car. It suddenly stops. I go outside to see what is wrong. It's a flat tire! I need to call a tow truck service, but I do not have my phone with me. I see another car coming. I ask the driver if I could borrow his phone. He says, \"Of course.\" What a nice person!"
    },
    {
        "id": "42d4351cd5ee4ca9a17ace57d7845f6a",
        "title": "What Do They Do on a Friday Night?",
        "content": "David, Jennifer, and Susan try to find something to do. David wants to eat at a restaurant. Jennifer and Susan already ate. Jennifer wants to sing at a karaoke. David and Susan have sore throats. Susan wants to play tennis. David and Jennifer are lazy. What do they do now?"
    },
    {
        "id": "c4b38f09621b41daac5be853ae777d17",
        "title": "Food Samples",
        "content": "She goes to the market. She wants to buy blueberry muffins. She is not sure if it tastes good. She finds an employee, and asks for a sample. The employee cuts a small piece, and gives it to her. She tries it. It is good. She buys the pack of muffins."
    },
    {
        "id": "f2e0cd1587b24401b93351bc1ab31dcc",
        "title": "The Dog Howls",
        "content": "She jumps into her bed. She is ready to sleep. She hears a noise. She looks out her window. She sees a dog howling. She goes outside. The dog is sad. His owner does not feed him. She gets the dog some food. She plays catch with him. His tail wags."
    },
    {
        "id": "a5a55c381ee44bc0a734aaf28e8b6b69",
        "title": "Things to Do as a Secretary",
        "content": "Edward is a secretary in a doctor's office. He does a lot of things. He greets patients. He asks for their information. He records their height and weight. He tells them how long they have to wait. He answers phone calls. He always knows what to say. Edward also keeps the files organized."
    },
    {
        "id": "be2e8666dcbb4d60a74f55abcda1bdbf",
        "title": "Things to Do as a Maid",
        "content": "She is a maid for a rich family. She does a lot of things. She does the laundry. She washes the windows. She cooks meals. She cleans the tables. She wipes the floors. She does not like cleaning. However, she likes taking care of the children. She reads to them. She picks them up from school."
    },
    {
        "id": "3ea3be27dc37483e8585e3344ba31076",
        "title": "The Police",
        "content": "He walks into his house. The door is already open. The windows are broken. Clothes are all over the place. The furniture is turned upside down. He sees a person in a mask. He is being robbed! He makes sure the robber does not see him. He calls the police. The police arrive quickly. They arrest the bad guy."
    },
    {
        "id": "cf975e07411440a58176b1ee2550fa7b",
        "title": "The Hair Stylist",
        "content": "The hair stylist loves his job. He provides many services. He cuts people's hair shorter. It's very easy for him to do. He charges only $5. He straightens hair. This is hard for him to do. He charges $100. He dyes customers' hair. He lets customers pick any color. He charges $50. People think his prices are fair."
    },
    {
        "id": "5091bca7960c45e089abaa74c1ed8534",
        "title": "Losing Her Cell Phone",
        "content": "She reaches into her pocket. Her cell phone is gone. She looks under her bed. All she sees are some coins. She looks under her couch. All she sees are some pencils. She has an idea. She calls her cell phone number with another phone. She hears a ring. It is coming from the kitchen. She sees her phone above the microwave."
    },
    {
        "id": "b014c776abf34e4cb502a8012ad19502",
        "title": "Squirrels at the Park",
        "content": "She goes to the park. She sees a lot of squirrels. They are small. They are brown. They have furry tails. They run really fast. They have big eyes. They are cute. She goes up to a squirrel. She feeds a nut to the squirrel. The squirrel takes it, and runs away."
    },
    {
        "id": "a45b4429282d4428a05837387095dc3b",
        "title": "Awake at Night",
        "content": "She cannot sleep. She tries exercising. She runs three miles around her house. She does 100 jumping jacks. She dances. She goes back to bed. She tries to sleep. She still cannot sleep. She asks her older sister what to do. Her older sister sings her a lullaby. She falls asleep."
    },
    {
        "id": "731f023746d14156b5ce6e1260a2f1c5",
        "title": "Gifts for Students",
        "content": "It is Christmas time. Ms. Miller goes to a store. She shops for gifts for her students. She buys 20 stockings. She buys candy canes. She buys school supplies. She buys gingerbread cookies. She puts the items in the stockings. She goes to the cashier. The cashier tells Ms. Miller what a nice teacher she is."
    },
    {
        "id": "9ffb6d47472c4ff983abea68d49466b0",
        "title": "Job Interview",
        "content": "He has a job interview soon. He wants to be the manager. He needs to prepare. He goes to the barber. He gets a haircut. He goes to the mall. He buys a suit. He goes home. He prints out his resume. He goes to the company. He takes a deep breath. He is ready."
    },
    {
        "id": "1217922dde9149c080c2f74762c478d3",
        "title": "More Money",
        "content": "She gets an allowance from her parents. They give her $10 a week. She wants more. She asks her parents nicely. They say no. She tries to change their minds. She washes their cars. She makes them dinner. She compliments them. Her parents decide to give her a raise. She will get $15 a week."
    },
    {
        "id": "751a835c8c3e4311a75c6bd53149a68c",
        "title": "The Lunch Lady and the Bully",
        "content": "The big bully enters the cafeteria. He goes to the front of the line. The students do not say anything. They are smaller than him. They are scared. The lunch lady sees the bully being mean. She tells him to get out. The students cheer for the lunch lady."
    },
    {
        "id": "a731d15f01324488a266a7a2b2a21342",
        "title": "Grand Opening",
        "content": "He opens his new bakery shop. The shop sells cake, bread, and muffins. He puts a large sign outside. It says: \"50% off everything.\" He hopes to get a lot of customers.  Many people start coming in. He greets the customers. They buy his bakery goods. He thanks them for coming."
    },
    {
        "id": "17a0f4caa4624c60a2d44c9bcd3da9d3",
        "title": "The Crumb on the Floor",
        "content": "She eats a Granola Bar. She drops a crumb in the kitchen. She does not realize it. She goes to watch a movie. She comes back to the kitchen. She sees many ants. The ants are all near the crumb. She gets a broom. She sweeps the ants and the crumb away."
    },
    {
        "id": "05bd0faa038c41cea909b1d69fd617b0",
        "title": "Fireworks",
        "content": "People go to the park to see the fireworks. They lay out their blankets. They sit on them and watch. The fireworks are amazing. Some are big and loud. Others are small and quiet. The fireworks appear in different colors. Some are red. Some are green. Some are gold."
    },
    {
        "id": "776e060b56894fbbbed7c1aecad35465",
        "title": "A Book Lover",
        "content": "She goes to the library. She looks at the mystery section. She takes two books from the shelf. She goes to the romance section. She does not take any books from that shelf. The romance books seem boring. She takes some cooking magazines. She goes to the checkout desk."
    },
    {
        "id": "85f309af4c4c4590905341113bf89125",
        "title": "Dressed for the Rain",
        "content": "It is raining. She wears a yellow raincoat. Her body is warm. She wears a knitted hat. Her head is warm. She wears a gray scarf. Her neck is warm. She wears rain boots. Her feet are warm. She wears mittens. Her hands are warm. She gets an umbrella. She goes outside."
    },
    {
        "id": "1342abe74a0943e6bbd6096432a55081",
        "title": "Milk Gone Bad",
        "content": "She pours the cereal into a bowl. She needs milk. She goes to the refrigerator. She gets the milk. She pours the milk into the bowl. She tastes it. Yuck! It tastes bad. She checks the milk carton. The expiration date was last week. She throws it away. No one should drink it."
    },
    {
        "id": "2708a0dbefea410781b2879718566ae2",
        "title": "Clothes on Sale",
        "content": "Ms. White goes to a clothing store. The dresses are on sale. She buys a dress for her daughter. It is blue with yellow flowers. Ms. White takes the dress home. Her daughter tries it on. It doesn't fit. It is too tight. Ms. White goes back to the store. She wants her money back. The cashier says, \"Sorry, all sales are final.\""
    },
    {
        "id": "b5cce2ff41cf4c8ead9573d6decae2c5",
        "title": "The Lifeguard",
        "content": "Ruth is a lifeguard. She wears a bright, red shirt. She has a whistle. She sits on a tall chair. She looks at the swimmers at the beach. She makes sure everything is okay. She looks out for danger. When people are drowning, she saves them. People like her. She makes them feel safe. Ruth loves her job."
    },
    {
        "id": "5ab9426cbf884758ba5927c7543cc345",
        "title": "Bad Partners",
        "content": "Mr. Green wants his students to work together on a project. Anthony, Brian, and Carol are all in one group. Anthony is lazy. He does not do anything. Brian and Carol have to do all the work. They cannot finish. Mr. Green is upset. Brian and Carol tell Mr. Green that Anthony didn't do anything. Mr. Green gives them one more day to finish."
    },
    {
        "id": "fa54a85b743847268ab2a4b704ba8103",
        "title": "Knitting is Fun",
        "content": "She knits a lot of things. She knits scarves. She knits hats. She knits sweaters. She knits mittens. She wears what she makes. She wears them for winter. She stays warm. She gives the stuff she knits to her friends, too. Her friends love them. She also sells what she knits. Her customers buy them."
    },
    {
        "id": "5a63918454144bbc926b3e2d5a110cb5",
        "title": "She Loves Her Phone",
        "content": "She looks at her phone. It is three inches long and two inches wide. She loves her phone. She uses it all the time. She brings it everywhere. She talks to her friends on it. She plays games on it. She plans her schedule on it. She checks her email on it."
    },
    {
        "id": "f5a5f486a37244e8be43678c19041496",
        "title": "Winter Break",
        "content": "Winter break starts soon. Joseph is so excited. He can't stop smiling. He can't wait. He taps his foot. He plays with his pencils. He looks at the clock. He thinks of the snow. He is ready to make snowballs. He is ready to go skiing."
    },
    {
        "id": "2d04c736a3ba4414a8d5e60f1b7b6b2d",
        "title": "Making a Smoothie",
        "content": "She is thirsty. She wants a smoothie. She gets a blender. She puts strawberries inside. Next, she pours milk inside. Finally, she adds some sugar. She presses the button. The blender mixes the ingredients. She pours the liquid into a glass. She drinks some. It tastes delicious. She drinks all of it. She cleans the blender."
    },
    {
        "id": "c43332f560e245688e1faa66fa056a6a",
        "title": "Practice Makes Perfect",
        "content": "Everyone knows that practice makes perfect. Michelle practices swimming once every two weeks. She is not that good. She gets third place. Sarah practices once a week. She is better than Michelle. She gets second place. Sharon practices every day. She is very good. She gets first place."
    },
    {
        "id": "8e7510662c5a4ade90a1f78fb7cd083c",
        "title": "A Stuffed Bear",
        "content": "He looks at his stuffed bear. It is six inches tall. It is light brown. It has blue eyes. It is wearing a striped scarf. It is soft. He brings it everywhere. He brings it to school. He brings it to soccer practice. He brings it to restaurants. He even brings it to weddings."
    },
    {
        "id": "d9757ca138614981be2c9bfba672bfab",
        "title": "Lockers Are Awesome",
        "content": "High school students get lockers. Lockers are awesome. You can put books in it. You can put food in it. You can put a first aid kit in it. Thanks to lockers, you don't have to carry so much stuff. You can even decorate your locker. You can stick posters in it."
    },
    {
        "id": "a0614fe24ef54db4983a626dc20e4caa",
        "title": "A Bad Skunk Smell",
        "content": "There are a lot of skunks in the park. The skunks spray their odor. The park smells very bad now. The family goes to the park for a picnic. They have lots of food. They smell something funny. They see the skunks. They do not want to eat anymore. They go home."
    },
    {
        "id": "f161bce4582448eea12a68583a69613e",
        "title": "Bumping Into an Old Friend",
        "content": "Kimberly walks outside. She likes looking at her neighborhood. She also likes the fresh air. She bumps into someone. She looks at him. It is an old friend! He smiles. He says he likes the fresh air, too. They hug. They talk about their memories. They laugh."
    },
    {
        "id": "9ceb1fd665d74f8f874a047fc15380be",
        "title": "Happy People, Sad People",
        "content": "Mary does well on her test. She smiles. Patricia wins the drawing contest. She smiles. David watches a great movie. He smiles. Mary, Patricia, and David are happy. Linda breaks her leg. She goes to the hospital. Barbara gets last place in the race. Jeff does bad on his test. Linda, Barbara, and Jeff are sad."
    },
    {
        "id": "4299e1996c27405aa834a49a43ba68ff",
        "title": "T.V and Turtles",
        "content": "She turns on the T.V. Her favorite T.V. show is on. It is thirty minutes long. It is about the slowest animals on Earth. She has a slow animal herself. It is a turtle! The turtle is quiet and cute. It is green. She watches T.V. with her turtle."
    },
    {
        "id": "ef75e8a34f904c2e978f2fc2959a74b8",
        "title": "She's Good at a Lot of Things",
        "content": "She is very talented. She is good at taking tests. She is good at dancing. She is good at singing. She is good at teaching. She is good at fishing. She is good at playing the cello. She is good at making scarves. She is good at running. She is good at cooking."
    },
    {
        "id": "b5f392f027894c3d9ff72b47f935f874",
        "title": "A Motorcycle on the Road",
        "content": "He hears a loud noise. He looks out the window. He sees a motorcycle. It is on the road. It is black and silver. It has two wheels. There is a man on the motorcycle. He wears a helmet. He wears sunglasses. He wears a leather jacket. He is riding the motorcycle."
    },
    {
        "id": "c1041c046a304f16ba99233acc00ce2f",
        "title": "The Medal",
        "content": "It is time for the awards ceremony. She gets the first place medal. It is circular. It is gold. It has a picture of a ballet dancer. She deserves the medal. The audience cheers. Her parents scream her name. Her brother throws a rose at her. She bows."
    },
    {
        "id": "c7897027bced417db4a3097ba037e199",
        "title": "Dental Care",
        "content": "He eats a lot of candy. He needs to clean his teeth now. He does not want cavities. He goes to the bathroom. He flosses between his teeth. He grabs his toothbrush. He brushes his teeth up and down. He rinses his mouth. His teeth look white. Finally, he uses mouthwash."
    },
    {
        "id": "1272078fe38945feb185a1028f4ffc01",
        "title": "A Ketchup Lover",
        "content": "She loves ketchup. She puts ketchup on fried chicken. She puts ketchup on french fries. She puts ketchup on eggs. She puts ketchup on hamburgers. She puts ketchup on hot dogs. She puts ketchup on fried shrimp. She puts ketchup on sandwiches. She even puts ketchup on candy. Sometimes, she drinks ketchup."
    },
    {
        "id": "2ab21874e9804d4dbde20d9c0d37313b",
        "title": "Peanut Butter Sandwich",
        "content": "She wants  to make a peanut butter sandwich. It is easy to make. She goes to the market. She buys what she needs. She goes back home. She goes to the kitchen. She takes out a knife, and puts it in the peanut butter jar. She spreads the peanut butter on two slices of bread. She puts the slices together, and takes a bite."
    },
    {
        "id": "7abd6d4ebb284e2297ef66e541d6a561",
        "title": "What Is in a Magazine?",
        "content": "Magazines are fun to read! There is usually someone famous on the cover. Sometimes it is an actress. Sometimes it is a politician. Sometimes it is  a chef. You can flip through the pages of a magazine. There are interesting stories. The stories are usually about important events. Some are sad. Some are happy."
    },
    {
        "id": "29b5059ca66342209b2bb03ab425ad7a",
        "title": "Clouds in the Sky",
        "content": "It is daytime. The sky is bright blue. The sun is shining. There are many clouds in the sky. She looks at them. The clouds have different shapes. One of them looks like a heart. Another looks like a bird. She continues to look at the clouds."
    },
    {
        "id": "d1b09fa2a1164e6ba96f56ae6d3efe4e",
        "title": "Leaves Falling",
        "content": "Summer ends. Autumn begins. Autumn is perfect. It is not too hot like summer. It is not too cold like winter. She wakes up. She looks out her window. The leaves are falling. Some leaves are orange. Some leaves are brown. She sees her dad raking the leaves. She goes outside. She helps her dad."
    },
    {
        "id": "bb32f230e5c94e2197cb13ff847dd989",
        "title": "Eating at a Restaurant",
        "content": "The young girl is hungry. Her parents do not feel like cooking. They go to a restaurant nearby. A waitress takes them to an empty table. The family sits down. The waitress gives them menus. The family looks at them. They order spaghetti and lobster. They wait for their foods."
    },
    {
        "id": "af1372d7cf7347fab58292096cb3945e",
        "title": "Working at the Grocery Store",
        "content": "He works at the grocery store. He is the manager. He has a different uniform from his coworkers. His is red. His coworkers' uniforms are blue. He makes sure everyone is doing their job. He tells them how to do better. He goes around the store. He asks customers if they're okay."
    },
    {
        "id": "2f8e9758e1354fac8513abe44b1e90e2",
        "title": "A Fancy Outfit",
        "content": "She is going to a party. She has to dress nicely. She puts on a pearl necklace. She puts red lipstick on her lips. She wears a long, white dress. She puts on sparkly shoes. She puts diamond earrings on her ears. She puts a ruby ring on her finger. She is ready to leave the house."
    },
    {
        "id": "e1a24c87522246029687bb2b7a8760c2",
        "title": "Fighting the Cold Weather",
        "content": "It is snowing. She is cold. She puts on a jacket. She puts a scarf around her neck. She puts mittens on her hands. She sits close to the fireplace. Her dad taps her on the shoulder. She turns around. He gives her a cup of hot chocolate. She is excited."
    },
    {
        "id": "de4bcdd13f3e4e9780a193b2d835fe24",
        "title": "A Lizard from the Backyard",
        "content": "He goes to his backyard. He sees something. It is small and slimy. It is a lizard! He puts it on his hand. He brings it inside his house. He shows it to his parents. He tells them he wants to keep it. They say no. They say lizards need to be outside. He goes to his backyard. He lets the lizard go."
    },
    {
        "id": "3a82baa377bd4568bc31d8cdf8a5df13",
        "title": "The Apple Tree",
        "content": "He likes apples. His neighbor has an apple tree. He walks to his neighbor's house. He knocks on the door. Ms. Parker opens it. She says hello. He asks her if he could get some apples. She lets him. He picks the best apples. He tastes one. It is sweet."
    },
    {
        "id": "5594f14a2d9c4885a25f0890a71de814",
        "title": "A View from the 100th Floor",
        "content": "He lives in a tall building. He lives on the 100th floor. He wakes up. He looks out the window. He sees the sun rise. He sees other buildings. He sees the mountains. He looks down. The people look so small. The stores look small, too. What an interesting view!"
    },
    {
        "id": "532b4021538d411eb1c4c93313dcdec1",
        "title": "Pie-Eating Contest",
        "content": "She goes to the carnival. She enters the pie-eating contest. She sits down on a chair. There are many pies in front of her. She cannot use her hands. She begins to eat. She eats the apple pie first. It takes her five minutes to finish it. She eats ten more pies."
    },
    {
        "id": "ed63eb3f33eb4c298d2acf6cdfb2cc55",
        "title": "A Lot of Jackets",
        "content": "He has two jackets with zippers. One of them is light blue. The other one is brown. He has two jackets without zippers. One of them has his name on it. The other one has his high school's name on it. He has two long jackets. One of them has buttons. The other one does not. He likes all his jackets."
    },
    {
        "id": "e923ddb8aa334208b7246898b1fc27e9",
        "title": "Many Shoes",
        "content": "She has two pairs of high heels. One of them has laces. The other one has a zipper. She has two pairs of running shoes. One of them  is shiny. The other one is bright. She has two pairs of ballet flats. One of them is pink. The other one is brown. She wears her shoes to parties."
    },
    {
        "id": "b990ae490c754007918ebb64a12aae04",
        "title": "Free Throws",
        "content": "He plays basketball. He wants to play for the Los Angeles Lakers. He goes to the basketball court every day. He practices his free throws. He stands before the free throw line. He throws the basketball in the net. He misses. He tries again. It goes in the net this time. He practices for two more hours."
    },
    {
        "id": "177c75024b4c4f4ea2a12409b7b8dc18",
        "title": "Passing the Ball",
        "content": "Basketball is about teamwork. Teammates must be able to pass the ball. Robert is far from the hoop. He passes the ball to Edward. Edward catches it. He is far from the hoop, too. He passes the ball to Mark. Mark catches it. Mark is close to the hoop. He throws the ball in. It goes in the net!"
    },
    {
        "id": "8d7cd39040964380acdf9c6c0c164a42",
        "title": "Tennis for Two",
        "content": "Laura and Donald play tennis together. They go to the tennis court. Laura wants  to practice her serves. She stands behind the line. She throws the ball up. She hits it with the racket. It goes over the net. Donald sees the ball. He hits it with the racket. It goes to Laura's side. The ball keeps going back and forth."
    },
    {
        "id": "6115a17fc1e44327b64dbbf4458dfadf",
        "title": "A Waitress at Duty",
        "content": "She is a waitress. She works at a restaurant. A customer walks in. She walks him to a table. She gives him a menu. She puts a plate, fork, and spoon in front of him. He orders fried chicken. She smiles. She is very quick. She gives him his meal. He finishes eating. He gives her a big tip."
    },
    {
        "id": "b36c18ade50040e2a960c98535d81b20",
        "title": "Clowns Are Cool",
        "content": "Clowns are cool. They look funny. They wear face paint. They wear big shoes. They wear colorful wigs. They do funny things. They juggle balls. They make balloon animals. They do magic tricks. They tell jokes. Clowns work at many places. Sometimes, they perform at parties. Sometimes, they perform at circuses. They make people laugh everywhere."
    },
    {
        "id": "13107d27ff664c21bb26ea32e3da829c",
        "title": "A Boat Ride",
        "content": "She wants to get across the lake. She sees a boat. There is a sailor in it. The sailor stops the boat. She gives him some money. He rows the boat. She sits in the boat. It is brown. It is made of wood. The boat reaches the other side. She thanks the sailor. She gets out."
    },
    {
        "id": "d0d7432ee4e8435a832a0170c9de82a8",
        "title": "Reading Questions",
        "content": "She starts reading a book. It is hard to understand. The words are very advanced. She does not know what they mean. She gets a dictionary. She wants to know what \"facile\" means. She finds the word. It means \"too simple.\" She looks up other difficult words. She rereads the book. She understands it better."
    },
    {
        "id": "0a2bb13f0dc64cdd99e16dde25aec539",
        "title": "Over the Bush",
        "content": "Robert plays catch with William. Robert throws the ball to William. The ball is too high for him to catch. The ball goes over the bush. It is in the neighbor's yard now. The boys knock on the neighbor's door. Mr. Carter opens the door. They ask if they can get their ball back. He is mad. They say sorry. He says it is okay this time."
    },
    {
        "id": "16d73d1466204406be94a72035a46a33",
        "title": "Scared of the Dark",
        "content": "He finishes watching a scary movie. His parents tell him to go to sleep. He goes into his bed. He turns off the lights.  He cannot fall asleep. He keeps thinking about the movie. He is scared of the dark. What if a ghost attacks him? He goes to his parents' room. He sleeps there."
    },
    {
        "id": "3f79c470de0843c8bbae621ee49cd9e2",
        "title": "Snow Globe",
        "content": "Betty opens up her present. It is a snow globe. She shakes it. Glitter falls down. She looks inside the globe. It is Santa Claus! He has a white beard and a big belly. He has a bag of presents. He only gives gifts to good kids. Betty is a good kid. She hopes Santa Claus visits her."
    },
    {
        "id": "0a00f30a02d74a92a1b08dea6335ed1d",
        "title": "Traffic Lights",
        "content": "She gets into her car. She puts on her seatbelt. She starts to drive. She drives at a good speed. It is not safe to drive too fast. It is also not safe to drive too slow. The traffic light is yellow. She slows down. The traffic light turns red. She stops completely. She waits. It turns green. She drives."
    },
    {
        "id": "bc0dc722e22b4887b4bdcb83e5577660",
        "title": "The Beach Is Fun",
        "content": "You can do a lot of things at the beach. You can lie down on a towel. Remember to put sunblock on. You don't want your skin to burn. You can make sandcastles. Show your creativity! You can surf in the water. Watch out for the big waves! Finally, you can watch the sunset."
    },
    {
        "id": "0abd22d9edb04f62a09ad7b846a05b68",
        "title": "Wait for the Pie to Cool",
        "content": "The oven makes a sound. The apple pie must be ready. She puts on an oven mitt. She takes out the pie. She puts it on the table. It smells so good. It looks so good. It is too hot. She must let it cool. She goes up to her room to wait."
    },
    {
        "id": "8cb898022e2a4860a1b481b5b1d90837",
        "title": "A Haircut",
        "content": "She has very long hair. It reaches her waist. She goes to the hair salon. She waits. She reads a magazine. The barber calls her name. She sits down. She says she wants her hair to be short. The barber cuts twelve inches off. The barber asks if she likes her haircut. She looks in the mirror. She likes it."
    },
    {
        "id": "7f355e8433dc42fab65c582b981b8d2d",
        "title": "Going to a Concert",
        "content": "Margaret is at a concert. There are so many people. It is completely dark. Her favorite band is on stage. The guitarist starts strumming. Colorful lights start to appear on stage. The lead singer sings Margaret's favorite song. She cheers for the band. She puts her hands up in the air."
    },
    {
        "id": "bcb855d308ef4209a9e0ad20da0e435d",
        "title": "Different T.V",
        "content": "She turns on the T.V. The news is playing. She thinks the news is boring. She goes to the next channel. A cooking show is playing. The chef is making a cake. She does not like cake. She goes to the next channel. A cartoon show is playing. It is about an elephant and a mouse. It looks funny. She puts the remote control down. She watches."
    }
]