[
    {
        "id": "6ef6a64a65e84d31971cf6360ae086d5",
        "title": "Go Surfing",
        "content": "Today was a nice day. The weather was great. It was a good time to go to the beach. Andrea decided to go surfing. She went with her family. Andrea and her family drove down to the beach. When she got out of the car, she headed straight for the water.\nThe water was cold at first. The waves were great as the wind was perfect. After surfing she ate lunch with her family. They grilled hot dogs. Andrea loved surfing. Today was a fun day for her. Her whole family had a great time surfing. She felt good spending time with her family."
    },
    {
        "id": "ca164ed06c344197953b1898eefd9df4",
        "title": "Lost on the First Day",
        "content": "It is the first day of high school. She is completely lost. She has never been here before. Her first class is Spanish. The class is in the A building. A staff member sees her wandering around. He gives her a map. She looks at it. She finds her Spanish class."
    },
    {
        "id": "8eb4f1f70d8e48ecbaf280b9a90262cc",
        "title": "The Worst Student",
        "content": "Ronald is the worst student. He does not do his homework. Instead, he plays video games. His teacher yells at him. Ronald does not care. He listens to music when the teacher is talking. He does not study. His test scores are bad. He is mean to his classmates too. Charles asks to borrow his eraser. Ronald hits him."
    },
    {
        "id": "c140826fed45428c96a122c1e05b5d2d",
        "title": "Good Manners",
        "content": "Michelle eats with her family. She wants to eat peas. She asks her mom, \"Will you please pass me the peas?\" The mom smiles. She gives her the plate. Michelle gets a gift from her dad. She thanks him. Michelle sees a classmate cry. She gives the classmate a tissue. Michelle has really good manners."
    },
    {
        "id": "7d70def5c7c745dcac9cf065201a7e91",
        "title": "New Phone",
        "content": "Carl Wilson wanted the latest phone. It cost $400. He begged his parents for it. \"Sorry,\" they said. \"It's too expensive.\" Still Carl kept bugging them. He would not give it up. He cried to them like a baby. His parents felt bad. They wanted to make their son happy. Mr. and Mrs. Wilson saved some money. They bought the phone for Carl's birthday. \"Just be careful with it,\" they told him. \"Of course I will be!\" he replied. Carl was so happy. He put the phone in his pocket. He ran to show it off to his friends. The phone slipped out of his pocket. It landed in a sewer."
    },
    {
        "id": "3aba7bbffb8e4fac9e131884d778b575",
        "title": "Using Her Credit Card",
        "content": "Abby's mom gave her a credit card. The credit card is supposed to be for emergencies. Abby went to the mall with her friends. She saw a pretty purse. It was black and shiny. She had to have it. She went inside the store. She looked at the price tag. The purse was $600. She really wanted it. She looked at her credit card. She went up to the cashier. She handed the worker her credit card. He swiped it. She didn't realize that she had to pay for the purse later. The purse showed up on the bill a month later."
    },
    {
        "id": "1263457039a04cf88577191fd5c19f01",
        "title": "Pizza Palace",
        "content": "It was Claire's birthday. She decided to have it at a pizza place. She chose Pizza Palace. Pizza was her favorite food. The party was also pizza themed. She wore a shirt that said pizza queen. Her favorite type of pizza was Hawaiian. She loved pineapples on her pizza.\nAlong with food, Pizza Palace also had an arcade. They had many games. They had air hockey, basketball, and even  dance dance revolution. Claire was so excited. This was the best day ever. She loved spending time with her friends. Claire had a fun time. She could not wait for her next birthday."
    },
    {
        "id": "a9f2b84944bb4292bc87bcc009dafa8f",
        "title": "Take a Drive",
        "content": "She wanted to travel. He asked her where she wanted to go. She said she wanted to just get on the road and drive for a day or two. She wanted to get out of the house and out of the city. They packed a small suitcase. They packed their underwear, shorts, and toothbrushes, among other things. They looked at a map. \"Should we drive into the mountains, or along the coastline?\" he asked. She said it didn't matter. The next day they got up early. They put the suitcase into the trunk. He drove to a gas station and filled up the tank. He drove onto the freeway and headed west. \"So, we're going up the coast?\" she asked. Yes, he told her. \"Maybe we'll see some whales,\" she said. A half hour later, they could see the ocean. They drove north on the two-lane highway. After another hour, he pulled over. They got out of the car and walked onto the beach. Even though it was windy and chilly, they saw surfers in the ocean. They were sitting on their boards, waiting for waves. She was shivering. He put his arm around her to help keep her warm. She smiled at him. \"Let's continue driving,\" she said. \"We can pull over again when the sun is higher.\""
    },
    {
        "id": "12e5572e62bd40d0a9f2d598982864ef",
        "title": "A Scary Movie",
        "content": "She goes to the movie theater. The movie starts  to play. A monster appears on the screen. She screams. She is scared. She continues to watch. The screen is completely black. She reaches for some popcorn. The monster screams, \"Boo!\" She jumps and drops all her popcorn."
    },
    {
        "id": "654b15ae7220453c8b365ebf66df4df2",
        "title": "Birthday Celebration",
        "content": "Barb was celebrating her birthday today. She was turning seven years old. All her friends were coming. Her relatives were also coming. She was going to see her cousins, uncles, and aunts. Even her neighbor was coming. Her parents got her cake with a horse on it. Horses were her favorite animal. Her dad spent all day decorating their house. There were balloons, banners, and streamers. She was so happy when she saw the decorations and everyone. This was her best birthday ever. She had a jumper for her and her friends to play with. She also had party gifts. Barb got a lot of presents. She thanked everyone for coming. She hugged her parents."
    },
    {
        "id": "cf975e07411440a58176b1ee2550fa7b",
        "title": "The Hair Stylist",
        "content": "The hair stylist loves his job. He provides many services. He cuts people's hair shorter. It's very easy for him to do. He charges only $5. He straightens hair. This is hard for him to do. He charges $100. He dyes customers' hair. He lets customers pick any color. He charges $50. People think his prices are fair."
    },
    {
        "id": "e23222170dec4d4f9a21b52b98585cc9",
        "title": "Buying an Apple",
        "content": "She is hungry. She wants an apple. She walks outside. She goes to her car. She drives to the market. She sees a lot of apples. The green apples look sour. The red apples look sweet. She takes a red apple. She goes to the cashier. She gives him money. She eats the apple."
    },
    {
        "id": "e6663da9a4d6403188ff95333f2f28f2",
        "title": "The Homeless Man",
        "content": "He was homeless. He was cold. He was shivering. He was in the park. He was sitting on a bench. A sign was next to him. The sign said, \"Please hire me. I am homeless.\" People walked by. They looked at him. He looked dirty. He looked old. How could this man work? He was too old to work. He was too dirty to work. He needed a bath. He needed some food. One lady stopped. She sat down next to him. She said she belonged to a church. She said to come with her. They both got up. He walked with her to the church. The church was warm. He smelled hot food. She said, \"Our church will help you.\""
    },
    {
        "id": "6637bfaaecd24d978a21452f6c64349e",
        "title": "Fluffy the Rabbit",
        "content": "He has a pet. It is a rabbit. His rabbit's name is Fluffy. Fluffy is female. She is white. She has black eyes. She is very soft. She is playful. She weighs seven pounds. She likes to hop around the house. She likes to eat carrots. He gives Fluffy five carrots a day."
    },
    {
        "id": "0acaaf4e68f04e85ac9014a0e6e5634b",
        "title": "Black Friday",
        "content": "Thanksgiving is one of the biggest holidays in the U.S. It is followed by another major U.S. holiday. This day is known as Black Friday. On this day, stores hold big sales. Then, Americans across the country go crazy. A lot of people get violent on Black Friday. One year, Carol went shopping on the day. She wanted to buy a new coat. \"I hope the mall isn't too crowded,\" she said. She couldn't believe her eyes. Every store was flooded with people. Carol spotted a nice blue coat in one store. It was on sale for twenty dollars. Carol was about to try it on. Suddenly a lady jumped at her and took the coat away. \"I'm going home,\" said Carol."
    },
    {
        "id": "5366239b81854fdcbc4ffe43da58315d",
        "title": "Here Comes the Flu",
        "content": "Jason read the news. He watched the news. He listened to the news. The swine flu was coming. The swine flu was dangerous. The swine flu was a killer. It killed people. Everyone should get a shot. Jason was not worried about the swine flu. He was healthy. \"I am as healthy as a horse,\" he said. \"I never get the flu. I never get sick.\" Jason was a talk show host. He talked on the radio. He talked for three hours every day. He said, \"I'm not getting a swine flu shot.\" A doctor called Jason. The doctor told Jason to get a shot. He said, \"Come to my office. I'll give you a free shot.\" Jason said no. He was as healthy as a horse. One month later, Jason didn't go to work. He didn't go to work for a week. He had the swine flu."
    },
    {
        "id": "1342abe74a0943e6bbd6096432a55081",
        "title": "Milk Gone Bad",
        "content": "She pours the cereal into a bowl. She needs milk. She goes to the refrigerator. She gets the milk. She pours the milk into the bowl. She tastes it. Yuck! It tastes bad. She checks the milk carton. The expiration date was last week. She throws it away. No one should drink it."
    },
    {
        "id": "4af92dd45c83485da91a2623426afb93",
        "title": "Road Trip",
        "content": "It was a sunny day. There were five of them. They were good friends. \"What time is it?\" one of them asked. It was almost nine o'clock. They all looked at each other. It was time to leave. They were all excited. They entered the car. One of them drove. Everybody put on their seatbelts. The radio was turned on. Rock music blared loudly. The car drove off into the distance. It was a road trip to San Francisco. It was everybody's first road trip. It was going to be a long trip. They brought snacks and drinks. They planned to stay for a week in San Francisco. It was a fun trip. They laughed and sang along to the radio. They stopped to eat at diners. They planned where to go next on a road trip."
    },
    {
        "id": "444db616bd0d4237b26fa0588b502021",
        "title": "Pizza Delivery",
        "content": "Tom was hungry, but lazy too. He didn't want to cook. He didn't want to go to a restaurant. He didn't even want to heat up leftovers. He decided to have a pizza delivered to him. He went on a pizza website. He ordered a small pizza. He waited for the pizza to arrive.\nLater, he heard the doorbell ring. He was too lazy to get up at first. He got up after five minutes. He opened the door. The pizza smelled so good. He paid the delivery man. He gave him a good tip, too. Tom sat back down on the couch. He ate the whole pizza. He was full."
    },
    {
        "id": "f4db89bf492848b79a45c0801bca8492",
        "title": "She Gets Coffee",
        "content": "She has to be awake for the whole night. She cannot sleep. She decides to buy coffee. Coffee helps people stay awake. She buys four cups of coffee. There are four different flavors. She adds two pack of sugar in each cup. She takes a sip of coffee. It is hot and good."
    },
    {
        "id": "edd9c86fc73743cc80d0e419a93b0c4d",
        "title": "A Thief on the Sidewalk",
        "content": "She looked at the man walking along the sidewalk next to the nice houses. He didn't live in any of those houses. She had seen this man several times before. He looked like a criminal. She knew not to judge a book by its cover, but this man was no good. She drove by him. He looked at her car as she drove by. She continued driving. She watched him in her rear view mirror. She got to the corner and stopped. She continued to watch him walking in her direction. Suddenly, he turned left up a driveway. A red SUV was parked in the driveway right next to the sidewalk. She saw him walk up to the driver's door. He returned to the sidewalk and continued walking in her direction. What was that all about, she wondered. Then she realized that he had tested the door to see if it was locked. He is a criminal, she thought. That's what he does. He just walks through our neighborhoods looking for cars to break into. She called the police. She described him. The officer said he knew who the man was. Residents called two or three times a week to report him walking by. But the police couldn't arrest him for walking around. They had to catch him with stolen goods. \"But he was testing that SUV door to see if it was unlocked,\" she said. \"I'm sorry,\" said the officer. \"That's not against the law. If you see him actually steal something, give us a call.\""
    },
    {
        "id": "2da3e10cfefe4a0ba53a3b1e62cb9819",
        "title": "The Last Cigarette",
        "content": "Mr. White had a bad habit. He was a chain smoker. Mr. White knew his addiction was unhealthy. He couldn't even take walks anymore. He spent all day coughing. Mr. White spent one year trying to quit smoking. He would always buy a pack and promise himself it would be his last cigarette. Mr. White went to his doctor for a check-up. His doctor asked him to take an x-ray. They found a tumor on his left lung. He had cancer from all the smoking. Mr. White went home scared. He threw out his cigarettes, but he kept one. This would finally be his last cigarette."
    },
    {
        "id": "96740120b99742bd847f710ba94caf48",
        "title": "Easter Eggs",
        "content": "It was Easter Sunday. Mom gave a little basket to Michelle. Mom told her to look for Easter eggs. The Easter eggs were in the back yard. \"What do Easter eggs look like?\" Michelle asked. Mom said, \"They look just like regular eggs. But they are colored. They are red. They are blue. They are yellow. They are many different colors.\" \"Why are they red? Do they come from red hens?\" Michelle asked. \"No,\" Mom said. \"They are red because Daddy and I colored them red. They are blue because we colored them blue. They are yellow because we colored them yellow.\" Michelle asked, \"Why did you color the eggs?\" Mom said, \"It's an Easter tradition. A tradition is something people do every year.\" Michelle went into the back yard. She found six Easter eggs. \"Next year you can help us color the eggs,\" Mom said. \"Oh, yes!\" said Michelle."
    },
    {
        "id": "fd63e80dd64a4c768681c5d7d5b3af14",
        "title": "Buy a New Car",
        "content": "Linda wants to buy a new car. She has an old car. Her old car is a white Honda. Linda wants to buy a new Honda. She wants to buy a new red Honda. She has saved $1,000. She will use $1,000 to help buy the new car. She will give $1,000 to the Honda dealer. The Honda dealer will give her a contract to sign. The contract will require her to pay $400 a month for seven years. Her new red Honda will cost Linda a lot of money. But that's okay, because Linda makes a lot of money."
    },
    {
        "id": "c7b3ca97d0344f26b007ad7d78ee6917",
        "title": "Littering",
        "content": "Laura cared a lot about the environment. She worried about the future of the planet. She made sure to recycle everything she could. She even rode her bike everywhere she went. Laura wanted to do whatever she could to prevent pollution or global warming. One day, Laura was riding her bike home. A truck in front of her threw a bag of trash out their window. This made Laura furious. She picked up the bag and followed the truck. When it finally parked she threw the bag into the window. The driver of the truck turned out to be a cop. He charged her on two counts. One was for assault on an officer. The other was for littering."
    },
    {
        "id": "819b8b43582847f39a73b829b5e3d78c",
        "title": "To Be Independent",
        "content": "Beverly has been in boarding school since she was ten years old. Her parents put her in boarding school to make her a more independent person. Beverly was against it at first. She wanted to stay with her parents like most kids of her age. She started getting used to boarding school when she was about 15 years old. She would only see her parents during winter break and during the summer.\nBeverly is okay with it now, because she is so used to not seeing her parents. Whenever she sees her parents though, they spend almost every day together. However, Beverly is going to attend a university near her parents. In fact, the university is only 20 minutes away from their house. Beverly asked if they wanted her to stay with them. Her parents said that she should live in the dorms to make more friends. Beverly agreed. Even though Beverly lived close to her parents, she barely saw them because she was so busy. She did see them during winter break though.\nBeverly wanted to study abroad in the summer in Italy. She asked her parents if they were okay with that. \"Absolutely not! Being alone in a different country is dangerous!\" her mom said. \"But I have been alone for so long! Isn't this why you put me in boarding school to begin with? I know how to be independent. I am responsible and smart enough to go to Italy alone,\" she said. \"Honey, the truth is, we just wanted to spend summer with you,\" her dad said. That is when Beverly realized that even though her parents wanted her to be independent, they cherished spending time with her a lot."
    },
    {
        "id": "3a13204d09514c6a90f8fa66191cc962",
        "title": "Junk Mail",
        "content": "She heard the mailman. The mailman made noise when he delivered mail. She walked downstairs. She said hello to the mailman. He said hello to her. He said it was a beautiful day. She agreed. The mailman went to the next apartment building. She opened her mailbox. There was a bill from her insurance company. She would send the company a check immediately. There was also junk mail in her mailbox. The junk mail was from her phone company. The phone company sent her junk mail every month. But she wasn't interested. She never opened junk mail. It went straight into the trash. There was also a postcard in the mailbox. It was from her dentist. She saw her dentist twice a year. It was time for her visit. She went back upstairs. She called her dentist. She made an appointment."
    },
    {
        "id": "818de3131bdc45cd9ad07ff4809ca072",
        "title": "His Red Bike",
        "content": "Paul has a red bicycle. He loves his red bicycle. He got the red bicycle for his ninth birthday. His parents gave him his bike when he was nine. He takes care of his bike. He puts air in both tires. He puts air in the front tire. He puts air in the rear tire. He puts oil on the bike chain. He wipes dirt off the bike with a damp rag. He puts water on the rag and wipes all the dirt away. He rides his bike everywhere. He rides it to school. He rides it to the library. He rides it to his friend's house. He really loves his bike."
    },
    {
        "id": "513466804aa1415a8ed5dd260b5b231e",
        "title": "The Career Day",
        "content": "The Career Day was the time when parents of students came into the classroom to talk about their jobs. Jane brought her dad, who was a bus driver. Jane's dad did not like his job when he was first starting out. After five years, he liked it. He liked it because he got to talk to people. Sometimes, though, no one wanted to talk to him. Those days were bad.\nJane's dad talked about what he had to do as a bus driver in front of Jane's classmates. \"Anyone interested in becoming a bus driver?\" Jane's dad asked. No one raised their hand. The next parent going up was Julia's dad. Julia's dad was a firefighter. He dressed up in his firefighter uniform. He talked about his experiences and the crazy fires he had to put out in the past.\nThe students loved Julia's dad. They asked him a ton of questions, and someone even hugged him. Jane's dad felt bad. He left the classroom before the day ended. Jane's teacher ran out of the room to talk to him. \"Mr. Lowell, I just wanted to tell you that I have so much respect for what you do.\" Jane's dad smiled."
    },
    {
        "id": "c2e6cc5b862c4b01a6e6c2815bbf833e",
        "title": "Make Some Coffee",
        "content": "She took the bag of coffee beans out of the freezer. She kept them in the freezer because the instructions on the bag said that is the best place. She poured the beans into the grinder. She pressed the grinder button for 10 seconds. Now she had ground coffee. She put a paper filter into a plastic cone. She put the cone on top of a coffee cup. She poured the ground coffee into the cone. Then she poured hot water into the cone. The hot water dripped through the ground coffee. She waited until the cup was full of hot coffee. She threw away the filter and the ground coffee. She took her cup of coffee to the dining room table. She sipped her coffee while she read the newspaper."
    },
    {
        "id": "a42316985f264552964dab7bd5d22dce",
        "title": "A Cool Laptop",
        "content": "His laptop sat on his desk. His laptop always overheated. It always overheated quickly. How could he keep it cool? He turned on his living room fan. It cooled his laptop. But the fan blew dust around. It blew paper around. He turned off his living room fan. He thought. He thought some more. How could he keep his laptop cool? He had an idea. He bought little plastic blocks. Each block was one inch square. He put the laptop on top of the blocks. One block was under each corner of the laptop. Now the laptop sat a little above the desk. There was space under the laptop. There was space for cool air to flow. The cool air prevented overheating."
    },
    {
        "id": "4976eededae94bc8a132fdb06402c180",
        "title": "Learning to Swim",
        "content": "Summer was a month away. That meant the local pool was going to open soon. All the kids were excited, but Evans was not. Evans did not know how to swim. He signed up for swim lessons. He was very afraid of the deep water. \"Evans,\" said his teacher. \"You need to relax. Nothing will happen to you.\" Evans practiced every day. When the pool finally opened, all the kids ran inside. Evans slowly walked to edge of the pool. The other kids laughed at him for being scared. Evans was embarrassed. To shut them up, he dove into the water from the high board. His swim lessons paid off."
    },
    {
        "id": "0c66c1358bd34739ab0c035ec392143f",
        "title": "The Mean Guy",
        "content": "He is a mean guy. He teases people. He calls people fat. He sends mean messages to his classmates. He trips people in the hallway. He cheats on all his tests. He steals people's money. He never pays attention to his teachers. Teachers do not want him in their classes."
    },
    {
        "id": "67571a2644c34cdfb1c17b9c694ef279",
        "title": "Playing Hide-and-Seek",
        "content": "They play Hide-and-Seek at school. Kyle is the seeker. He closes his eyes and counts to ten. The other people hide. Some people hide behind trees. Some people hide behind the slide. Some people go inside classrooms! The seeker tries to find all his friends. He needs to find all eight of his friends to win."
    },
    {
        "id": "e6b56b80dce146a981a3f532956e5a28",
        "title": "Too Cute",
        "content": "Mia was 4 feet and 11 inches tall, with big cheeks and a high-pitched voice. Even though she was 22 years old, a lot of people thought she was still in high school. People still always called her cute. It was a nice thing to hear, but it came with downsides, too. A lot of times, Mia wasn't taken seriously. She just graduated from university and was doing a lot of interviews for jobs in the engineering field.\nWhen Mia introduced herself in an interview, the interviewer laughed. \"Little girl, you know you have to be at least 18 to apply here, right?\" the interviewer asked. \"I know, I am 22 years old,\" Mia said. The interviewer apologized and continued to ask her questions about her work experience and interest in the job. Mia thought the interview went pretty well.\nAfter a week, Mia didn't hear from the interviewer. She decided to call. She asked if she got hired. The interviewer said she was not. Mia asked why. The interviewer said it was because her co-workers wouldn't take her seriously. He also said that the company needed to have employees who looked mature. Mia was upset5 that her appearance was such a big disadvantage to her."
    },
    {
        "id": "6fabef4dbdec4e8bae13ec1fa60635e1",
        "title": "The Useless and Lazy Man",
        "content": "Mitchell buys a cup of coffee at his local café every morning. He always sees the same homeless man sitting outside. This man waits for people to come out. He asks everyone for change. Although the homeless man is very friendly, Mitchell does not like him. \"He is useless and lazy,\" Mitchell always said. One morning, Mitchell was running late to work. He stormed out of the cafe doors. Then, he ran across the street to his car. Since he was in a hurry, he did not check for traffic. Suddenly all he saw was a big white truck about to run him over. Luckily, the homeless man pushed Mitchell out of the way just in time to save his life. Mitchell gave him five dollars every morning after that."
    },
    {
        "id": "61ea8c3d27654c468abb5e180390c3d8",
        "title": "School Cafeteria",
        "content": "He gets school lunch. It is not good. At least it is free. He looks around the cafeteria. He thinks about sitting with new people. There are a lot of different groups. He could sit with the athletes. He could sit with the drama club kids. He could sit with the rich kids group. He has a lot of choices."
    },
    {
        "id": "b2d5eca12cb343d398530e3f41898a47",
        "title": "A Perfect Day for Hiking",
        "content": "Sol and Victor decided to go hiking. Today was a perfect day for hiking. The weather was a cool 70 degrees. The hike was 3 miles up and 3 miles down. They brought plenty of water for their hike. Sol brought his dog on the hike also.\nThey hiked upwards. At the top there was a waterfall. They admired the view. It was beautiful. When they were done, they hiked back down. After the hike Sol and Victor were tired. They decided to get a healthy fruit smoothie. They went back to Victor's house and made smoothies."
    },
    {
        "id": "7e6089547d13482d8f2f0d581fb47e41",
        "title": "Never Give Up",
        "content": "Kenneth is a good tennis player. He has been playing since he was 7 years old. He is now 16 years old. He competes against other players all around the country. They are also very good. He is competing against the best teen tennis player tomorrow. He is nervous. He has heard rumors about him.\nThe other player is named Antonio. Antonio is mean. He is very competitive. He is not afraid to hurt people. He has punched someone before. Kenneth told his dad he wanted to quit. \"Why? You have been doing so well!\" Kenneth's dad said. \"I'm scared of Antonio,\" he said. \"Never give up,\" Kenneth's dad said."
    },
    {
        "id": "86e054161ec1413cb780d77707976bb8",
        "title": "Picking a Costume",
        "content": "It is Halloween. Nancy is dressed as a princess. She goes trick-or-treating. She walks to one house. She rings the doorbell. A young couple opens the door. Nancy holds out her bag. She receives candy. She says, \"Thank You!\" The couple smiles. Nancy goes to the next house."
    },
    {
        "id": "601d6aa48c6e4343a88d7b24ba55d073",
        "title": "Go to Work",
        "content": "Patricia did not have much time. It was time to go to work. She did not want to be late for work. She would lose her job if she was late. She finished her coffee. She drank the last drop. She put the coffee cup in the kitchen sink. She turned on the kitchen faucet. She poured water into the cup. She turned off the faucet. She picked up her keys. The keys were on the kitchen table. She grabbed her gray coat. Her gray coat was on the chair. The chair was next to the door. She walked outside. She locked her door with her house key."
    },
    {
        "id": "46365120461f4a37baecd9d55998e259",
        "title": "Parade",
        "content": "It was fun going to the parade. He went to the parade every year. He never missed going. The parade was tomorrow. He was going with his girlfriend. His girlfriend's name was Mary. This year, he planned on bringing his little sister. His little sister had not gone to a parade. It was her first time going. She was excited. It was the day before the parade. They made their plan. They had to wake up early. They had to bring snacks and water. They also had to wear comfortable shoes. The parade lasted all day. The day of the parade came. Everything went according to plan. The parade was amazing. They saw marching bands. They saw parade floats. Some of them were big. The parade ended in the afternoon. They were tired, but they were happy. They went back home. \"Can we come back again?\" his little sister asked. He smiled at her. She knew the answer already."
    },
    {
        "id": "43db244930fd4db59cd7e14514178f0c",
        "title": "He Will Work for Gas",
        "content": "Doug went to the gas station. \"Can I have a job?\" he asked. The owner said, \"Maybe you can have a job. Can you count money? Can you put gas in a car?\" \"Yes,\" said Doug. \"I can count money. I can put gas in a car. So, can I have a job?\" \"There is just one problem,\" said the owner. \"I cannot pay you with money.\" \"You cannot pay me with money?\" asked Doug. \"What good is that? What will you pay me withbananas?\" \"No,\" said the owner. \"I won't pay you with bananas. You aren't a monkey, are you? No, I will pay you with gasoline. I have lots of gasoline.\" \"It's a deal. My car uses lots of gasoline,\" said Doug."
    },
    {
        "id": "a46878435c6a4812afcc0ad9adac3a7e",
        "title": "Who Rang the Bell?",
        "content": "He was talking on the phone. The phone was on the table in the dining room. He was talking to his friend. They were talking about the weather. It was raining. There was a knock on his door. Someone was knocking on his door. He went to the door. He opened the door. No one was there. He went back to the phone. The doorbell rang. Someone was ringing his doorbell. He went to the door. He opened the door. No one was there. He went back to the phone. There was another knock on his door. He kept talking. The doorbell rang again. He kept talking. Fool me once, shame on you, he thought. Fool me twice, shame on me, he thought."
    },
    {
        "id": "8975291ae44b4341ac2da47a43f0e77c",
        "title": "Free the Animals",
        "content": "Henry Lopez took his son Mario to the zoo. Mario loved animals. Henry thought the zoo would make his son happy. Instead, Mario was very angry. \"What's wrong?\" asked Henry. \"All the animals look so sad,\" said Mario. \"They want to be free, not stuck in cages.\" Henry was surprised. He looked at the tiger in the cage. Mario was right. Henry had never noticed how sad all the animals looked. By the time Henry looked down at his son, Mario was gone. Suddenly, Henry heard a lot of people yelling. Mario then came running proudly. \"Don't worry, Dad!\" he said. \"I opened the sad lion's door.\""
    },
    {
        "id": "a990cf73f8d94e008aba355fc4aa7225",
        "title": "The Paint Job",
        "content": "Danny's fence needed painting. He wanted to paint it white. He looked in the phone book. He looked under \"P\" for Painters. He called up a painter. \"How much to paint my fence?\" he asked. \"How big is your fence?\" the painter asked. \"It goes all the way around my yard,\" Danny said. \"How big is your yard?\" the painter asked. \"My yard is half as big as a football field,\" Danny said. The painter said $300. \"It will cost $300,\" he said. That was a good deal. Danny said, \"That's a good deal.\" The painter came over the next day. He painted Danny's fence white. It took him only three hours. Danny looked at his white fence. He liked it. \"You did a good job,\" he said to the painter. \"My white fence looks great. How long will this paint last?\" \"It will last a lifetime,\" said the painter."
    },
    {
        "id": "751ec28934034451bc62c1f9f6569540",
        "title": "A Cat Scratch",
        "content": "Kenny was crying. \"Why are you crying?\" Mom asked Kenny. \"The cat scratched me,\" said Kenny. The cat had scratched Kenny on his hand. Kenny showed his hand to his mom. The scratch didn't look too bad. It wasn't a deep scratch. Mom went to the kitchen. Kenny went with her. She turned on the water. She put his hand under the water. She washed the scratch with soap. She rinsed off the soap. She took a Band-Aid out of the kitchen cabinet. She put the Band-Aid on the scratch. She said he would be okay. \"Why did the cat scratch you?\" she asked. Kenny said he didn't know why the cat scratched him. Just then, Kenny's little sister walked into the kitchen. She knew why the cat scratched Kenny. \"I know why Tiger scratched him, Mommy,\" she said. \"He was pulling Tiger's tail!\""
    },
    {
        "id": "98a6f75db2c24787957ae65708e45343",
        "title": "The New Waiter",
        "content": "Mark Smith needed to get a job. There was one problem. Mark was a bit lazy. He wanted to do something easy. \"I know!\" he said. \"I can be a waiter!\" \"I don't think that's the best job for you,\" said his mom. \"Why not?\" Mark replied. He thought the job looked very simple. \"All I have to do is clean tables,\" said Mark. \"Plus, I would get big tips!\" Mark got hired as a waiter in a small cafe. He soon realized his mom was right. Everyone who ate left a big mess on the table. Mark hated cleaning up. He was very slow at it, too. He kept dropping plates on the floor. To top it off, he wasn't very nice to customers. They left him small tips. Mark was fired after three days."
    },
    {
        "id": "c94792cf9f5e40908e26e09936163f11",
        "title": "Getting Bored of the Fish",
        "content": "Jacqueline lives in an apartment with two of her friends. The landlord does not allow them to have pets. Jacqueline was disappointed by this because she always wanted to have a dog. Her roommate Wanda suggested that they get a fish. A fish would be easy to take care of. They never had to worry about the landlord finding out because there were no video cameras inside their apartment.\nJacqueline bought the fish from a pet store. It came in a plastic bag. She put the plastic bag in another bag. That way the landlord would never know even if she watched the security camera that is in the hallway. acqueline and Wanda named the fish Coach after the famous handbag brand. Jacqueline and Wanda took very good care of Coach. They fed him properly and cleaned his tank when they needed to. They took a lot of pictures with the fish, too.\nAfter a couple of weeks, however, they started to get bored of their fish. A fish is not like a dog. You can't run with it or pet it or dress it up. Neither Jacqueline nor Wanda wanted to take care of it. \"It's your turn to feed him!\" Wanda yelled. \"Ugh! Fine!\" Jacqueline said. Jacqueline and Wanda made their third roommate take care of the fish while they went on vacation. When they came back, they found Coach dead. They felt bad, but they didn't care that much."
    },
    {
        "id": "db062d0130114fe1856d1e9e78d43c60",
        "title": "A New Home",
        "content": "He moves to a new city. There are many buildings. There are a lot of people walking. There are many taxis. He feels lonely. Everyone acts so different here. He goes to his new school. He sees a friendly looking person. He asks him to show him around."
    },
    {
        "id": "002ce41e127f44329d4f02b10f90535f",
        "title": "My Family’s House",
        "content": "We have a nice house. It has three bedrooms. It has three bathrooms. It is a one-story house. It doesn't have any stairs. It doesn't have a second floor. It doesn't have a basement. It does have an attic. It has a chimney and a fireplace. It has a kitchen. It has a dining room. It has a living room. The living room has a big sofa and a big TV. Our living room is our family room. We watch TV together. We play games together. We play games like Scrabble and Monopoly. We enjoy those games. They are fun to play. We have a small front yard. We have a big back yard. We don't have a swimming pool. We don't have a garden. We have a two-car garage. My mom has a blue Cadillac. My dad has a red Honda. I have a bicycle and a skateboard. My sister does, too. She's a good skateboarder, for a girl. We live on a quiet street. We never hear police sirens or fire sirens. I go to a nice school. Someday I will get married. I will own a nice house on a quiet street. And I will have a swimming pool in the back yard."
    },
    {
        "id": "76e1190d84d04b48af5d7f86b81bb386",
        "title": "Rock Climbing",
        "content": "Lucas was going rock climbing today. He loved hiking and biking. This was his first time rock climbing. Lucas was not scared though. He was athletic. He was actually excited. He went  with two of his friends. They had to sign a waiver first. They then got their harnesses.\nThey started with the short wall. After they mastered that, they moved on to the larger wall. They raced to the top. Lucas got to the top first. They had a lot of fun. After rock climbing, they decided to go eat. They deserved the food after their good workout."
    },
    {
        "id": "786d481e78254409aacd8db72cea6684",
        "title": "The Baby Bear",
        "content": "The baby bear followed his mama. Mama bear walked through the woods. She was looking for berries to eat. She found some black berries. She started eating them. The baby started eating them, too. They ate all the berries. Baby bear was full. Mama bear was still hungry. She started walking again. She wanted to find more berries to eat. Baby bear lay down. He was full. He wanted to take a nap. But mama bear came back. She growled at baby bear. He understood mama's growl. When mama growled, he obeyed. He got up and followed his mama. Someday he would take a nap after a meal. A squirrel ran up a tree with a nut. It dropped the nut and ran back down to the ground. It picked up the nut and looked at baby bear. Then it ran back up the tree. Baby bear did not like nuts. They were too hard to open."
    },
    {
        "id": "18a8a7a476db4bc89f5782db0c1bd30c",
        "title": "The Flu",
        "content": "Larry has the flu. His nose is running. He coughs a lot. He sneezes a lot. When he coughs, he covers his mouth. When he sneezes, he covers his mouth. When his nose is running, he wipes his nose with a tissue. Larry's mother is taking care of him. She makes hot soup for him. She gives him fresh orange juice. She makes him comfortable in his bed. She turns on the TV so he can watch TV in his bed. She turns out the light so he can sleep in his bed. She gives him medicine so he will get better. Larry will get better soon."
    },
    {
        "id": "de4bcdd13f3e4e9780a193b2d835fe24",
        "title": "A Lizard from the Backyard",
        "content": "He goes to his backyard. He sees something. It is small and slimy. It is a lizard! He puts it on his hand. He brings it inside his house. He shows it to his parents. He tells them he wants to keep it. They say no. They say lizards need to be outside. He goes to his backyard. He lets the lizard go."
    },
    {
        "id": "7164595733964a9eab286f43169ee533",
        "title": "Getting Braces",
        "content": "Martin had very crooked teeth. His dentist wanted to fix them. \"You have to get braces,\" he told Martin. \"Your smile will be perfect!\" Martin did not like this idea. He was scared of getting braces. He had heard they hurt a lot. They were also very expensive. He went to his dad to get some advice. His dad told Martin to get them. He even paid for them himself. When Martin looked at his braces in the mirror, he was unhappy. \"I look ugly now!\" he remarked. \"Stop being ridiculous,\" said his dad. \"You already looked that way before they put the braces on!\""
    },
    {
        "id": "0d68b5356775482ea1b8233cd794bb17",
        "title": "Going to Teach Abroad",
        "content": "Catherine did not know what to do this summer. All her friends either had a job or were going traveling. Catherine was nervous because she did not hear back from any of the organizations she applied for. She applied to a lot of different internships and jobs. The wait was long and agonizing for her.\nFinally, she received an email. The email congratulated her on getting the internship, which was a teaching position in Japan. She was going to be teaching lessons on leadership in Japan to young high school students.\nCatherine was passionate about education and leadership. This internship was perfect for her. She was nervous to travel abroad since this was her first time. She did not know what to expect in a foreign country. She also did not speak Japanese, which may be challenging for her.\nThe challenges did not scare her. She was ready for the internship. She planned her trip early and began to make lists of things she needed to bring and what she needed to do. She also met with past interns to ask them about their experiences. She wanted to be as prepared for the trip as possible. Catherine wanted to do the best job she could and make a big impact on the students."
    },
    {
        "id": "bb036db360aa4fb793cdcf821bfe0da3",
        "title": "Picking a Costume",
        "content": "He slices up tofu in ten pieces. He puts the pan on the stove. He turns on the stove. He puts oil in the pan. He puts the tofu in the pan. He waits for the tofu to turn brown. He flips over the tofu. Now the other side is frying. He waits for the tofu to turn brown again. He turns off the stove."
    },
    {
        "id": "7240549fa3c341e4935a4d665631ca72",
        "title": "A Good Shower",
        "content": "She goes to the market. She buys ingredients for lunch and dinner. She goes to the pharmacy. She picks up her medicine. She goes to school. She takes three tests. She goes to the park. She runs ten laps. She finally goes home. She is tired and sweaty. What a day! She takes a cold shower. She feels good."
    },
    {
        "id": "1d66552f5355473a8450993d9a6dfa81",
        "title": "Working at Movie Theaters",
        "content": "Michelle needed a summer job. She decided to work at movie theaters. She wanted to work there in order to gain experience. She also loved movies. Since she worked at movie theaters, she would be able to watch free movies. It was a part-time job. She still had time to be with her friends and family.\nMichelle had had different jobs. Sometimes she worked as a cashier. She would either sell tickets or food. Michelle liked selling tickets better.  Working with food was messy, and also a fast-paced environment. Sometimes Michelle worked as an usher, which meant she had to clean the theaters."
    },
    {
        "id": "87cb4facf4ad4eb995fe0c34742baaf5",
        "title": "I’ll Call You at 7:00",
        "content": "Carol and Mary are friends. Carol said she would call Mary at 7 o'clock. Carol didn't call at 7:00. She didn't call at 7:15. She finally called at 7:30. She apologized for calling so late. Mary said it was ok. But it wasn't ok. Mary didn't like people to lie. This wasn't the first time Carol had lied. This was the fourth time Carol had lied. Mary did not trust Carol. Carol would never be her best friend. A best friend tells the truth. A best friend doesn't lie. A best friend does not call late. A best friend does not arrive late. A best friend is always on time."
    },
    {
        "id": "b4c0889621b84e06835a69225a237a9d",
        "title": "Family Reunion",
        "content": "He got off the airplane. He stepped on the ground. It was a long flight. There was a baby crying on the flight. He could not sleep. He exited the airport. He called a taxi. It drove him home. He paid the taxi driver and thanked him. He looked at his house. He was glad to be home. The lights were on inside. He saw shadows through the window. His family reunion had started. He knocked on the door. His father opened the door. \"Welcome back home, Greg!\" he said smiling. He went inside. He greeted everybody. He said hello to cousin Alex. He hugged and kissed his grandmother. He shook the hand of his brother-in-law. He hugged his sisters and brothers. He was overjoyed to see his mother. His mom gave him a big kiss. It was a good family reunion. He did not want to go back to California.America is known"
    },
    {
        "id": "d3a94be7d5404ceab0a3148775bb512b",
        "title": "Good Luck Charm",
        "content": "She has an ugly shirt. It is her good luck charm. When she wears it, good things happen. She likes to wear it when something important is happening. She wears it on days when she has tests. She wears it when she wants to impress someone. She wears it when she is feeling sad."
    },
    {
        "id": "2335c71c05d540dd96356c2f2c5820b8",
        "title": "Playing Tennis at the Park",
        "content": "Susan and Felicity are going to play tennis at the park. They have been playing this month. They go to different schools. Susan goes to school in Canada. Felicity goes to school in the United States. They used to go to the same high school. They were on the tennis team.\nNow they only see each other in the summer. Susan visits the United States every summer. It usually does not rain in the summer, but it rained on the day they planned to play tennis. They were upset. They still met each other. They stayed in and talked."
    },
    {
        "id": "6bba1480f3ee45bb966b139925dffdca",
        "title": "Movie Hopping",
        "content": "Movie hopping is seeing multiple movies when you only paid to see one. Many people movie hop. It is very easy to do it. Most of the time you don't get caught. Norma got caught though. She did it a lot. The most movies  she ever saw in one day was seven. She saved so much money. Her friends usually did it with her if it was just two movies. But if it was over two movies, they just left her. They thought three movies were too much.\nNorma went out on a date with Steven, who asked her what she wanted to do. She said she wanted to go to the movie theater. He said okay. They went to see a documentary on whales. After that, Norma suggested seeing another movie. \"Okay, let me just pay for it at the front,\" Steven said. \"No need for that! We can just walk into the next one,\" she said. \"Isn't that illegal?\" Steven asked. \"I mean yes, but everyone does it,\" she said. \"Not me. I think it's wrong. The movie industry loses a lot of money and that affects the employees at the theater, actors, and actresses,\" he said.\n\"Actors and actresses make so much money. They will be fine. Also employees get the same hourly wage no matter what,\" Norma said. \"I don't think I can date you. We have very different ideals,\" he said. \"I agree,\" she said. Steven left the movie theater while Norma stayed. She watched three more movies that day."
    },
    {
        "id": "751a835c8c3e4311a75c6bd53149a68c",
        "title": "The Lunch Lady and the Bully",
        "content": "The big bully enters the cafeteria. He goes to the front of the line. The students do not say anything. They are smaller than him. They are scared. The lunch lady sees the bully being mean. She tells him to get out. The students cheer for the lunch lady."
    },
    {
        "id": "41fa8da14d68462ba6bc65cf89b507ff",
        "title": "Night Sky",
        "content": "He looked up. He saw the night sky. There were many stars in the sky. He looked for a while. The stars were beautiful. They were shining brightly. They looked like diamonds. He remembered a song. He looked at the moon. The moon was in the night sky. It gave the moonlight. The moon looked white. It looked like cheese. He wondered about it. A man had walked on the moon. He imagined walking on the moon. He imagined the moon being cold. He looked at the constellations. There were many of them. Constellations are what groups of stars look like. They have different names. He saw the Big Dipper. He saw the Little Dipper. He also could see Orion's Belt. It was an amazing sight. He looked up every night. He believed in aliens. He hoped to see one. The night sky is full of wonders."
    },
    {
        "id": "2a517665684145b0a7e0da8547c34601",
        "title": "Left Books at the Library",
        "content": "Daniel had a project for school. It was on planets. He had to research one planet and write a report. His planet was Mars. He decided to go to the library and borrow books. He borrowed 3 books. He saw his friend there. They went to lunch. He also went to lunch. After the lunch he realized that he left the books at the lunch room. He went back. They were no longer there. Daniel panicked. He did not want to pay for the books. His parents would get mad at him. He looked everywhere. Later his friend told him maybe they were at the library. Daniel went to the library. He found the books there. He left them there before he went to eat. Daniel was so relieved."
    },
    {
        "id": "a2a92dd2e692493f8fd5f21e45f54fa7",
        "title": "30 Years Late",
        "content": "She found a book in her basement. It was an old book. She opened the book. It was a library book. It was an old library book. The library card was inside the front cover. The due date was on the library card. She looked at the due date. The due date was 30 years ago! Oh my goodness, she thought. I wonder how much money that is, she thought. I wonder how much money I owe. She didn't know what to do. She thought about it. I can just throw the book out, she thought. No one will know. No one will know if I just throw the book out. She threw the book out. She threw the book into the trash can. She thought about it. She felt bad. I shouldn't throw a book into the trash can, she thought. She took it out of the trash can."
    },
    {
        "id": "fd51693ff0f94782aaee19f5c8eb1429",
        "title": "She Likes Running",
        "content": "She puts her running shoes on. She leaves her apartment. She runs to her school. She likes to look at other houses. She likes the feeling of the wind on her face. She gets to the school. She sees her teacher. She does not like that teacher. She runs back home."
    },
    {
        "id": "3f0465a149cc4a10869b935ccda77887",
        "title": "Doing Chores for Money",
        "content": "Jason is twelve years old. He wants to buy a video game. It costs $60. He does not have money. He cannot get a job. He is too young to get one. He tried selling his old things. He only made a dollar. He tried doing homework for people. He got caught. He tried taking online surveys. He ended up getting a computer virus. He tried selling his handmade toys. People thought they were ugly. He tried dancing on the streets. He only managed to get a few pennies. He entered a drawing competition. The prize was $100. He lost. He asked his parents if he could have some money. They said yes. There was a catch. He had to do chores. He said yes. His parents gave him $5 for every hour he worked."
    },
    {
        "id": "3207a2752c5e4e07b8ab97feaa78e55f",
        "title": "A Brush with God?",
        "content": "He dropped his toothbrush. It fell on the floor. He picked up his toothbrush. He rinsed it off. He brushed his teeth. He rinsed his mouth. He walked out of the bathroom. He sat on his bed. He felt something. It was under the sheet. He took the sheet off the bed. Something was in his mattress. It was a brand new mattress. He had bought it yesterday. What is in the mattress, he wondered. He went to the kitchen. He took a knife from the kitchen drawer. He cut open the mattress. What could it be, he wondered. It was small. It was black. It was a book. It was the New Testament. Is God trying to tell me something, he wondered."
    },
    {
        "id": "f4bf6e1888514f8da5f551507094127b",
        "title": "Ferris Wheel",
        "content": "A ferris wheel is a huge rotating wheel. It has many seats. He sits on one of them. His seat is yellow. He is excited. He puts his seatbelt on. He holds on to the metal bar. He wants to be safe. The wheel moves. He starts to go up higher and higher. He looks down. The people are so small. The view is so nice."
    },
    {
        "id": "b744ba6896fb4f3186a4d3fbd9bdf3fd",
        "title": "Dear God",
        "content": "Peggy went to church every Sunday. She loved to go to church. At church she was with her family and friends. At church she was with the saints. She was with the angels. And most of all, Peggy was with God. She always talked to God in church. She always asked God to stop war. She asked God to stop hate. She asked God to stop sickness. But war and hate and sickness did not stop. There were war and hate and sickness every day. \"Mommy, why doesn't God stop war and hate and sickness?\" Peggy asked. \"God will,\" her mom said, \"when more people ask.\""
    },
    {
        "id": "10f1188beaf942b3a688f16d34851e1e",
        "title": "Stealing",
        "content": "He goes into the store. He goes to the video game aisle. He sees the game he likes. He looks around him. There is no one watching him. He puts the video game in his jacket. He is planning on selling the video game. It is a popular one. He walks towards the exit. The alarm goes off."
    },
    {
        "id": "43ee3a6c75c04514a5f7d14d192c1e51",
        "title": "Baby Brother",
        "content": "Gloria is 12 years old. She is now the only child in the family. She is going to have a little brother soon. She has mixed feelings. A part of her wants a baby brother. She will have someone to play with. She can teach him what she knows. She can be less lonely. Another part of her does not want a baby brother. She wants all the attention from her parents. She does not want to share her things. She does not want her parents to like her baby brother more than her. She does not want to hear him cry. She does not want to change his diaper."
    },
    {
        "id": "ce942e9bbf064cce8700b18ea9fb3caf",
        "title": "A Pet Mouse",
        "content": "Betty was not like most kids, who had dogs or cats or fish  as pets. Betty had a mouse. She liked mice because they were small, easy to take care of, and cute. Betty was probably the only one who thought mice were cute. Whenever her friends came over to her house, they were disgusted by her mouse. The mouse was male; his name was Augustus. Augustus was the name  of the founder of the Roman empire.\nWhen Betty went to feed Augustus, he was nowhere to be found. He wasn't under his little dome or running on his wheel. How did he get out? After hours of looking around the house, Betty put up signs around the neighborhood. Her neighbor ripped it off. \"Hey! Why did you do that?\" Betty asked. \"I lost my dog, so I'm going to put my sign up. Besides, no one cares about a mouse. Someone probably ran over it with a car already,\" her neighbor said.\nBetty didn't let what her neighbor said discourage her. She continued putting up \"Lost Mouse\" signs. Betty then heard a scream. \"Ew, it's a mouse!\" someone cried out loud. Betty followed the scream and it led her to the gas station, where she found Augustus. She grabbed him and hugged him tightly."
    },
    {
        "id": "4eca80b429434d13abef617bffe8662b",
        "title": "Running a Marathon",
        "content": "Philip is going to run a marathon, which is about 26 miles. Philip has always been good and fast at running. He knows how to keep a good pace. He is always the fastest one on his track team. In fact, many of his teammates are sure that he is going to run track in college. Philip decided to run a marathon to raise money for charity. The charity was for breast cancer. Philip's mom died of breast cancer, so the cause was important to him.\nPhilip practiced running prior to the marathon. He started off by running 8 miles, then 12, then 20, and finally, 26. He had practiced for three months. On the day of the marathon, Philip felt ready. He wore a comfortable tank top and running shorts. He also wore his lucky red socks. Philip went to the marathon. He stood at the starting line and wished the other participants good luck. Philip started running. He felt really good about himself. Running was like a roller coaster, which was full of ups and downs. The beginning was always really good because he was highly motivated. The middle was harder because he got more tired.\nDuring the middle of the marathon, he smelled something bad. He wondered who it came from. He noticed that people who were running passed him really quickly. He smelled his armpits. It was him. He had forgot to put deodorant on."
    },
    {
        "id": "cf06867648b4406fa5569ee3bbbb163b",
        "title": "Fresh Fish",
        "content": "Mike was ready for bed. It was 11 o'clock. He had to get up early the next day. The next day he was going fishing. Fish wake up early. They look for food early in the day. They look for food late in the day. The best time to fish is early or late in the day. That is when the fish are hungry. Mike set his alarm. He set his alarm for 5 o'clock. The next day he would start fishing at 6 o'clock. He wanted to catch four or five fish. If he caught four or five fish, he could eat fresh fish all week. Fresh fish is the best fish. Mike went to bed."
    },
    {
        "id": "e09f32de9bc74be9b29ff388fd9c6235",
        "title": "A Hot Day",
        "content": "It was a hot day. The sun was shining brightly. There were no clouds in the sky. He walked along the street. He was going home. He was hot and tired. He could not wait to get home. He was almost there. It was nearly one hundred degrees. There was not another soul in sight. Everybody was at home. His car was not working. He had to walk to his bank. He did not know it was so hot. The bank was not too far. The heat made it seem far away. His throat was dry. He was thirsty for water. He walked with sweat on his back. He arrived home. He went straight to the kitchen. He drank a big cup of water. He took off his clothes. He went to the bathroom. He took a cold bath. It was so refreshing. He stayed in the bath."
    },
    {
        "id": "b33025b4db164148930d0cbf9efeeb34",
        "title": "A Lot of People in Line",
        "content": "They went to an amusement park. There are a lot of rides. Some are scary and some are for kids. There are a lot of food choices. There is cotton candy. There are corn dogs. There are so many people. It is Saturday. People are off work and school. There are lines for everything."
    },
    {
        "id": "26c942d877df428194bc036102c529fd",
        "title": "Tanning at the Beach",
        "content": "It is summer. The sun is out and shining. She goes to the beach. She lays a towel on the sand. She puts on sunscreen. It protects her skin. She puts on sunglasses. She does not want the sun to hurt her eyes. She lies down on the towel. She is excited to get tan."
    },
    {
        "id": "9ceb1fd665d74f8f874a047fc15380be",
        "title": "Happy People, Sad People",
        "content": "Mary does well on her test. She smiles. Patricia wins the drawing contest. She smiles. David watches a great movie. He smiles. Mary, Patricia, and David are happy. Linda breaks her leg. She goes to the hospital. Barbara gets last place in the race. Jeff does bad on his test. Linda, Barbara, and Jeff are sad."
    },
    {
        "id": "b5b4e64d710c44e6833c5f59273141e0",
        "title": "The Cool Group Has Money",
        "content": "Jen is poor. Her dad left when she was seven years old. Her mom didn't go to college, so she can't get any good jobs. Jen wishes she could get a job, but she is only 13 years old. Jen also wants to be part of the cool group. The cool group buys expensive clothes, shoes, makeup, and jewelry. Jen always wears really simple things, like a t-shirt.\nOne of the girls in the cool group is Jen's cousin. Her name is Dana. Dana convinced the cool group to invite Jen on a shopping trip. Jen is excited. She wants to convince them that she is cool enough to be a part of the group. When Jen sees them, she feels bad about herself. They are all dressing so much nicer than her. Jen tries to ignore this. She and the cool group go inside Rural Insiders, the most popular store for teenagers. Everything is so expensive though.\nAll of the girls in the group except Jen stand in line to buy something. \"Are you going to buy anything, Jen?\" asks one of the girls. \"Yeah!\" Jen says. She grabs a dress. It is $80! She buys the dress, but she plans to return it."
    },
    {
        "id": "0d60db7dd91d4587a5d85d8640e6faac",
        "title": "A Storm",
        "content": "Laura looked out the window. A storm was coming. The sky was getting darker. The wind was starting to blow. Some trees were bending. Leaves were flying through the air. It was getting cold. She closed all the windows. She went outside. Her car was in the street. She closed the windows in her car. She locked her car. She went back into her house. She turned on the TV. She wanted to see the news about the storm. The TV person said it was a big storm. He said it would rain a lot. He told people to stay home."
    },
    {
        "id": "e255a2a1197d4612a69d872000ba921e",
        "title": "New Hair Color",
        "content": "Susan didn't like the color of her hair. Her hair was changing color. It used to be all black. But now it was turning gray. She didn't like the gray hair. Gray hair made her look older. She didn't want to look older. She made an appointment with the beauty salon. A week later, she went to the beauty salon. The hairdresser colored Susan's hair. She added a little bit of purple color to Susan's hair. When the hairdresser finished, Susan looked at her hair. She liked it. She couldn't see any gray hair. All she could see was black hair with a little bit of purple tint. The purple tint looked nice. Susan hoped her boyfriend would like it."
    },
    {
        "id": "c7897027bced417db4a3097ba037e199",
        "title": "Dental Care",
        "content": "He eats a lot of candy. He needs to clean his teeth now. He does not want cavities. He goes to the bathroom. He flosses between his teeth. He grabs his toothbrush. He brushes his teeth up and down. He rinses his mouth. His teeth look white. Finally, he uses mouthwash."
    },
    {
        "id": "3d47d0b260ed4c178feae782b045f894",
        "title": "Looking For a Roommate",
        "content": "Ronald was moving to college. He needed a place to stay. Every apartment around the school was very expensive. \"I'm going to be a homeless college student,\" he joked. Ronald thought of a solution. He posted an advertisement online. He wrote, \"Looking for roommate around college campus. Must be neat and sane\" Within one day, he had twenty replies. Ronald didn't really want to share an apartment with a stranger. However, this was the only way he could afford anything. \"I just hope he's not dirty or crazy,\" he thought. After interviewing everyone, he picked a guy he really liked. They ended up being friends their whole life."
    },
    {
        "id": "f4871af0a63a4b5999d1428b70a0e9a1",
        "title": "The Rainy Days",
        "content": "The sky had been gloomy all week. The clouds looked stormy and grey. It suggested a forecast of rain and thunder. The next day it began to rain. It did not just sprinkle, it poured. It was raining extremely hard. Most people stayed indoors to avoid the rain. Those who were outside wore heavy raincoats and carried umbrellas. Outside there were rivers that flowed through the streets. When cars drove by, the water splashed on pedestrians.\nFor those that enjoyed rain, it was nice to finally see the rain. Some children loved to jump in puddles and show off their new rain boots to their friends. However, many did not enjoy the rain. It was difficult for people to go out when it was raining. It was inconvenient for those who had to go to work or school. Driving was also harder in the rain. No one was at the park or at the beach. If they did go out, they would get soaked in the rain. The only thing people could do was stay indoors, whether it is the mall or a museum. Some took this opportunity to stay in at home and watch a movie. Others cooked meals or curled up with a good book.\nThe next day, the rain stopped. The sky cleared up. A beautiful rainbow appeared. The sky was blue, and people started to come out. There were no more umbrellas and raincoats. It was not warm yet, and people still needed sweaters, but most were happy to stay dry."
    },
    {
        "id": "65b8e5a11857446ebcf33d5a627e6f32",
        "title": "Se Habla English",
        "content": "Alex wanted to become a citizen. He signed up for a citizenship class. He went to the first class. The teacher spoke only Spanish. All the other students spoke only Spanish. Alex spoke Spanish, too. He asked the teacher, \"Why are you speaking Spanish? We need to speak English. We need to understand English. We need to read English. We need to write English.\" The teacher said, \"Don't worry. English isn't important anymore. My students never fail the interview. Can you say Yes in English? Can you say No in English? Then your English is good enough. You want to become a citizen. That is more important than your English.\" Alex dropped out. He signed up for another citizenship class. The teacher spoke only English."
    },
    {
        "id": "46a5ef93eaf4440bb28de8e678058c5a",
        "title": "Diving Off a Cliff",
        "content": "He took a deep breath. He looked down. The water looked cold. He was nervous. \"Come on, Jump!\" said his friends. He was on a ledge of a cliff. It was a big drop. All his friends had jumped. They were swimming in the water. His friends waited for him. Fifteen minutes had gone by. He had not jumped. \"What are you, chicken?\" teased one of his friends. He was scared indeed. He imagined bad things. He imagined breaking his bones. He imagined drowning. He imagined being eaten by a fish. \"I don't think this is a good idea,\" he said to his friends. His friends then told him not to do it. They were worried. He stepped off the ledge. He climbed down. He safely got in the water. He was safe. He was relieved."
    },
    {
        "id": "b1b8b22626934fbc9c2298d70b41ba88",
        "title": "Fighting Friends",
        "content": "Roland and Miles have been best friends since 9th grade. They bonded over their common interest in video games. They would go to each other's house and play video games after they finished their homework. They did everything together, from eating breakfast to sleeping over at each other's place. Right now, however, they were not speaking to each other. Miles did not pick Roland to be on his basketball team, and Roland was upset. It has been two weeks already.\nMiles has been trying to make it up to him almost every day. He made him breakfast in the morning, offered to drive him to school, and offered to carry his textbooks. Roland just kept pushing him away. Miles didn't know what he could do. Miles directly asked him one day and Roland said, \"Nothing you do can make up for what you did.\" Miles was sad, and he gave up.\nNow, Roland and Miles are about to graduate from high school. It has been a year since they talked. On the last day of school, Roland goes up to Miles. \"Hey, I really miss you, to be honest. Want to play video games after the graduation ceremony?\" Roland asks. Miles smiles and says yes. Sometimes, you can't fix your mistakes right away. Friendship takes time to fix."
    },
    {
        "id": "8d720bd4b89f4ed78a4631bd3f6fab57",
        "title": "Junk Food",
        "content": "Matthew's parents went to the movies. He was home alone. He decided to eat all the junk food. His parents usually yell at him when he eats too much junk food. They tell him it is not healthy to eat too much junk food. He was hungry. He first opened the chips. He had barbeque chips. He opened some chocolate. He had marshmallows. He had some pizza. He was starting to get full. He decided to have some popsicle bars. He ate a strawberry one. Then he felt sick. He knew now why his parents told him not to eat too much. His parents were coming home. He heard the door unlocking. He knew he was going to be in trouble."
    },
    {
        "id": "4299e1996c27405aa834a49a43ba68ff",
        "title": "T.V and Turtles",
        "content": "She turns on the T.V. Her favorite T.V. show is on. It is thirty minutes long. It is about the slowest animals on Earth. She has a slow animal herself. It is a turtle! The turtle is quiet and cute. It is green. She watches T.V. with her turtle."
    },
    {
        "id": "6b383a5a41c34c49a38b6b5614eba9f5",
        "title": "A Boring Day",
        "content": "Ken had no school today. Ken had no chores to do today. Ken was not working today. He was all alone at home. He had the day off. He was usually busy every day. He watched TV for two hours. He got bored. He played video games. He got bored. He went to a cafe. He ordered coffee and bread. He ate it. He got bored. He jogged in the park. He got bored. He called his friends. They were busy. He suddenly wished he was busy. He called his work place. He asked his boss if he could come in. His boss laughed. Ken hung up. What a boring day."
    },
    {
        "id": "c41a2800418548c9b5a1dbe598760720",
        "title": "A School Day",
        "content": "School starts at 8:00 in the morning. His mom woke him up at 6:30. He yawned and got out of bed. He got dressed. He ate breakfast. He ate a bowl of cereal for breakfast. His favorite cereal was Cheerios. He also ate a banana. Bananas are yellow outside and white inside. He drank a glass of orange juice. Oranges are orange outside and orange inside. He ate a piece of toast with butter on it. Brown toast, yellow butter. He drank a glass of milk. Then he brushed his teeth. He kissed his mom goodbye. He walked outside to the school bus stop. It was two blocks away. He met his friend Bobby. They talked while they waited for the bus. The bus arrived. He said hello to the bus driver. He and Bobby sat together on the bus. They talked about baseball. The bus ride took 20 minutes. They got to school at 7:30. The bus driver said, \"Have fun in school.\" They always did."
    },
    {
        "id": "943abecee18e4584a03aa4b9d7fcba24",
        "title": "They Want a Baby",
        "content": "She wanted to have a baby. She wanted to have a baby girl. He wanted to have a baby. He wanted to have a baby boy. He loved her. He said, \"Okay, we will have a baby girl.\" She loved him. She said, \"Okay, we will have a baby boy.\" They both loved each other. They both wanted to make each other happy. He talked to his parents. He asked them what to do. She talked to her parents. She asked them what to do. His parents said, \"No problem. Have two babies. Have a baby girl and a baby boy.\" Her parents said the same thing! So they had two babies. They had a baby girl. Then they had a baby boy."
    },
    {
        "id": "9e6193cba2a845d0b3b67789679b3127",
        "title": "Stealing Was Wrong",
        "content": "Cory was poor. His parents had recently divorced. He lived with his dad. His dad only made $9 an hour. Cory had four other siblings. Rent was expensive. Electricity was expensive. Water was expensive. Everything was expensive. Cory was so hungry. He decided to steal. He knew it was bad, but he was poor.\nHe saw a delicious-looking apple. He looked around him. No one was looking at him. It was safe to steal. He put the apple in his pocket. He walked towards the store's exit. A moment later, he walked back to the apple section. He put the apple back. He did not want to be a bad person. Stealing was wrong."
    },
    {
        "id": "90e9544b11d14640835945b8cd175e3e",
        "title": "Planting Trees",
        "content": "Sarah learned about plants in science class. She learned that plants help people. She learned that every year people destroy rainforests. This includes trees. She learned that without trees there would be no oxygen for us to breathe. She decided to organize a club at her school. It was called Project Green. They would work on planting trees. Although it would not solve all the problems, planting trees was a good way to help the environment. It was also fun to meet with other people. They gathered on saturday. Each person was in charge of a different job. There was only 20 people in the group before. After the school heard about what they did, their club grew. The following week there were a hundred members."
    },
    {
        "id": "ebac0eeca09e4a27a756edbc37f6f5fd",
        "title": "Christmas Time",
        "content": "It is Christmas. Dad gives Tim a toy. The toy is in the box. Tim takes off the lid. He sees the toy. It is a car. The car is red. The car makes noises. The car moves fast. Tim likes the gift. He hugs his dad. Dad smiles."
    }
]