[
    {
        "id": "fabc00cfe2f8451789531226947982de",
        "word": "egg",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/eɡ/",
            "us": "/eɡ/"
        },
        "nearby": [
            {
                "word": "egalitarian",
                "pos": "adjective"
            },
            {
                "word": "egalitarianism",
                "pos": "noun"
            },
            {
                "word": "egg",
                "pos": "noun"
            },
            {
                "word": "egg",
                "pos": "verb"
            },
            {
                "word": "egg-and-spoon race",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small oval object with a thin hard shell produced by a female bird and containing a young bird; a similar object (without a hard shell) produced by a female fish, insect, etc.",
                    "vi": "một vật nhỏ hình bầu dục có vỏ cứng mỏng do chim mái đẻ ra và chứa chim non; một vật tương tự (không có vỏ cứng) do cá cái, côn trùng, v.v."
                },
                "examples": [
                    {
                        "en": "The female sits on the eggs until they hatch.",
                        "vi": "Con cái ngồi trên những quả trứng cho đến khi chúng nở."
                    },
                    {
                        "en": "The fish lay thousands of eggs at one time.",
                        "vi": "Cá đẻ hàng nghìn quả trứng cùng một lúc."
                    },
                    {
                        "en": "crocodile eggs",
                        "vi": "trứng cá sấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bird’s egg, especially one from a chicken, that is eaten as food",
                    "vi": "trứng chim, đặc biệt là trứng gà, được dùng làm thức ăn"
                },
                "examples": [
                    {
                        "en": "a boiled egg",
                        "vi": "một quả trứng luộc"
                    },
                    {
                        "en": "bacon and eggs",
                        "vi": "thịt xông khói và trứng"
                    },
                    {
                        "en": "fried/poached/scrambled eggs",
                        "vi": "trứng chiên / luộc / bác"
                    },
                    {
                        "en": "Bind the mixture together with a little beaten egg.",
                        "vi": "Trộn hỗn hợp với một ít trứng đã đánh tan."
                    },
                    {
                        "en": "You've got some egg on your shirt.",
                        "vi": "Bạn có một số quả trứng trên áo sơ mi của bạn."
                    },
                    {
                        "en": "egg yolks/whites",
                        "vi": "lòng đỏ / lòng trắng trứng"
                    },
                    {
                        "en": "egg noodles",
                        "vi": "mì trứng"
                    },
                    {
                        "en": "hen's/duck/quail eggs",
                        "vi": "trứng gà mái / vịt / cút"
                    },
                    {
                        "en": "a chocolate egg (= made from chocolate in the shape of an egg)",
                        "vi": "một quả trứng sô cô la (= được làm từ sô cô la trong hình dạng của một quả trứng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a cell that combines with a sperm to create a baby or young animal",
                    "vi": "tế bào kết hợp với tinh trùng để tạo ra con non hoặc động vật non"
                },
                "examples": [
                    {
                        "en": "The male sperm fertilizes the female egg.",
                        "vi": "Tinh trùng đực thụ tinh với trứng cái."
                    },
                    {
                        "en": "an egg donor",
                        "vi": "một người hiến trứng"
                    },
                    {
                        "en": "Many women conceive through the use of a donor egg.",
                        "vi": "Nhiều phụ nữ thụ thai thông qua việc sử dụng một quả trứng hiến tặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which it is difficult to tell which one of two things was the cause of the other",
                    "vi": "một tình huống trong đó rất khó để biết một trong hai điều nào là nguyên nhân của điều kia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that has some good parts and some bad ones",
                    "vi": "một cái gì đó có một số phần tốt và một số phần xấu"
                },
                "examples": [
                    {
                        "en": "Their investment plan shows the familiar curate's egg pattern of some bits doing well and others doing badly.",
                        "vi": "Kế hoạch đầu tư của họ cho thấy mô hình trứng của người quản lý quen thuộc là một số bit làm tốt và một số khác hoạt động kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who you know will behave well/badly",
                    "vi": "một người mà bạn biết sẽ cư xử tốt / xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy something that would make you rich, successful, etc.",
                    "vi": "để phá hủy thứ gì đó có thể khiến bạn trở nên giàu có, thành công, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to rely on one particular course of action for success rather than giving yourself several different possibilities",
                    "vi": "dựa vào một quá trình hành động cụ thể để thành công hơn là tạo cho mình một số khả năng khác nhau"
                },
                "examples": [
                    {
                        "en": "I’ve applied for several jobs. I don’t want to put all my eggs in one basket.",
                        "vi": "Tôi đã nộp đơn cho một số công việc. Tôi không muốn bỏ tất cả trứng vào một giỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is definitely true",
                    "vi": "từng nói rằng điều gì đó chắc chắn là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell or show somebody how to do something that they can already do well, and probably better than you can",
                    "vi": "để nói hoặc chỉ cho ai đó cách làm điều gì đó mà họ đã có thể làm tốt và có thể tốt hơn bạn có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you cannot achieve something important without causing a few small problems",
                    "vi": "bạn không thể đạt được điều gì đó quan trọng mà không gây ra một số vấn đề nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "11c382444f5a4980b85b021d3c3fb014",
        "word": "shell",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ʃel/",
            "us": "/ʃel/"
        },
        "nearby": [
            {
                "word": "shelf life",
                "pos": "noun"
            },
            {
                "word": "shelf-stacker",
                "pos": "noun"
            },
            {
                "word": "shell",
                "pos": "noun"
            },
            {
                "word": "shell",
                "pos": "verb"
            },
            {
                "word": "Shell",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard outer part of eggs, nuts, some seeds, and some animals",
                    "vi": "phần bên ngoài cứng của trứng, quả hạch, một số hạt và một số động vật"
                },
                "examples": [
                    {
                        "en": "We collected shells on the beach.",
                        "vi": "Chúng tôi đã thu thập vỏ sò trên bãi biển."
                    },
                    {
                        "en": "snail/oyster/clam shells",
                        "vi": "vỏ ốc / hàu / ngao"
                    },
                    {
                        "en": "walnut shells",
                        "vi": "vỏ quả óc chó"
                    },
                    {
                        "en": "earrings made out of coconut shell",
                        "vi": "bông tai làm từ gáo dừa"
                    },
                    {
                        "en": "the shell of a turtle",
                        "vi": "mai của một con rùa"
                    }
                ]
            },
            {
                "define": {
                    "en": "any object that looks like the shell of a snail or sea creature",
                    "vi": "bất kỳ vật thể nào trông giống như vỏ của ốc sên hoặc sinh vật biển"
                },
                "examples": [
                    {
                        "en": "pasta shells",
                        "vi": "vỏ mì ống"
                    }
                ]
            },
            {
                "define": {
                    "en": "a metal case filled with explosive, to be fired from a large gun",
                    "vi": "một hộp kim loại chứa đầy thuốc nổ, được bắn ra từ một khẩu súng lớn"
                },
                "examples": [
                    {
                        "en": "mortar/artillery shells",
                        "vi": "đạn cối / pháo"
                    },
                    {
                        "en": "A shell burst only yards away from us.",
                        "vi": "Một quả đạn nổ chỉ cách chúng tôi vài thước."
                    },
                    {
                        "en": "Several empty shell casings were found in the area.",
                        "vi": "Một số vỏ đạn rỗng đã được tìm thấy trong khu vực."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tube or case containing explosive and a bullet or shot, for shooting from a gun",
                    "vi": "một ống hoặc hộp đựng thuốc nổ và đạn hoặc súng bắn, để bắn từ súng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the walls or outer structure of something, for example, an empty building or ship after a fire or a bomb attack",
                    "vi": "các bức tường hoặc cấu trúc bên ngoài của một cái gì đó, ví dụ, một tòa nhà trống hoặc một con tàu sau một vụ hỏa hoạn hoặc một cuộc tấn công bằng bom"
                },
                "examples": [
                    {
                        "en": "The house was now a shell gutted by flames.",
                        "vi": "Ngôi nhà giờ chỉ còn là một cái vỏ bị lửa thiêu rụi."
                    },
                    {
                        "en": "(figurative) My life has been an empty shell since he died.",
                        "vi": "(nghĩa bóng) Cuộc sống của tôi đã trở thành một cái vỏ trống rỗng kể từ khi anh ấy chết."
                    },
                    {
                        "en": "The fire reduced the school to a hollow shell.",
                        "vi": "Ngọn lửa đã thu nhỏ ngôi trường thành một lớp vỏ rỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "any structure that forms a hard outer frame",
                    "vi": "bất kỳ cấu trúc nào tạo thành khung cứng bên ngoài"
                },
                "examples": [
                    {
                        "en": "the body shell of a car",
                        "vi": "thân vỏ của một chiếc ô tô"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer layer of somebody’s personality; how they seem to be or feel",
                    "vi": "lớp bên ngoài của nhân cách ai đó; họ có vẻ như thế nào hoặc cảm thấy như thế nào"
                },
                "examples": [
                    {
                        "en": "She had developed a shell of indifference.",
                        "vi": "Cô đã phát triển một lớp vỏ của sự thờ ơ."
                    },
                    {
                        "en": "She had built up a protective shell around herself.",
                        "vi": "Cô đã tự tạo cho mình một lớp vỏ bảo vệ xung quanh mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become less shy and more confident when talking to other people",
                    "vi": "trở nên bớt nhút nhát và tự tin hơn khi nói chuyện với người khác"
                },
                "examples": [
                    {
                        "en": "He’s really come out of his shell since he met Marie.",
                        "vi": "Anh ấy thực sự thoát ra khỏi vỏ bọc của mình kể từ khi anh ấy gặp Marie."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become shyer and avoid talking to other people",
                    "vi": "trở nên nhút nhát hơn và tránh nói chuyện với người khác"
                },
                "examples": [
                    {
                        "en": "Whenever my friends are here, she just withdraws into her shell.",
                        "vi": "Bất cứ khi nào bạn bè của tôi ở đây, cô ấy chỉ rút vào vỏ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "97a61b9d26d54aa1b05ca84ce7ff2e1d",
        "word": "tail",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/teɪl/",
            "us": "/teɪl/"
        },
        "nearby": [
            {
                "word": "t'ai chi ch'uan",
                "pos": "noun"
            },
            {
                "word": "taiga",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "verb"
            },
            {
                "word": "tail away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part that sticks out at the back of the body of a bird, an animal or a fish, which the animal can move from side to side or up and down",
                    "vi": "phần nhô ra ở phía sau cơ thể của một con chim, một con vật hoặc một con cá mà con vật có thể di chuyển từ bên này sang bên kia hoặc lên xuống"
                },
                "examples": [
                    {
                        "en": "The dog ran up, wagging its tail.",
                        "vi": "Con chó chạy đến, vẫy đuôi."
                    },
                    {
                        "en": "My dog loves to chase his tail.",
                        "vi": "Con chó của tôi rất thích đuổi theo đuôi của mình."
                    },
                    {
                        "en": "The male has beautiful tail feathers.",
                        "vi": "Con đực có bộ lông đuôi đẹp."
                    },
                    {
                        "en": "It was black from its nose to the tip of its tail.",
                        "vi": "Nó có màu đen từ mũi đến đầu đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of tail mentioned",
                    "vi": "có loại đuôi được đề cập"
                },
                "examples": [
                    {
                        "en": "a white-tailed eagle",
                        "vi": "đại bàng đuôi trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the back part of a plane, spacecraft, etc.",
                    "vi": "phần sau của máy bay, tàu vũ trụ, v.v."
                },
                "examples": [
                    {
                        "en": "The plane's tail section had broken off.",
                        "vi": "Phần đuôi của chiếc máy bay đã bị gãy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of something that sticks out at the back like a tail",
                    "vi": "một phần của cái gì đó nhô ra ở phía sau như một cái đuôi"
                },
                "examples": [
                    {
                        "en": "the tail of a kite",
                        "vi": "đuôi của một con diều"
                    }
                ]
            },
            {
                "define": {
                    "en": "the last part of something that is moving away from you",
                    "vi": "phần cuối cùng của thứ gì đó đang rời xa bạn"
                },
                "examples": [
                    {
                        "en": "the tail of the procession",
                        "vi": "đuôi của đám rước"
                    },
                    {
                        "en": "the truck at the tail of our convoy",
                        "vi": "chiếc xe tải ở đuôi đoàn xe của chúng tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long jacket divided at the back below the waist into two pieces that become narrower at the bottom, worn by men at very formal events",
                    "vi": "một chiếc áo khoác dài được chia ở phía sau dưới thắt lưng thành hai mảnh trở nên hẹp hơn ở phía dưới, được nam giới mặc tại các sự kiện rất trang trọng"
                },
                "examples": [
                    {
                        "en": "The men all wore top hat and tails.",
                        "vi": "Những người đàn ông đều đội mũ chóp và có đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a coin that does not have a picture of the head of a person on it, used as one choice when a coin is tossed to decide something",
                    "vi": "mặt của đồng xu không có hình đầu người trên đó, được sử dụng như một sự lựa chọn khi tung đồng xu để quyết định điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is sent to follow somebody secretly and find out information about where that person goes, what they do, etc.",
                    "vi": "một người được cử đi theo dõi ai đó một cách bí mật và tìm hiểu thông tin về nơi người đó đi, họ làm gì, v.v."
                },
                "examples": [
                    {
                        "en": "The police have put a tail on him.",
                        "vi": "Cảnh sát đã bắt được hắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to understand something",
                    "vi": "không thể hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't make head nor tail of what he was saying.",
                        "vi": "Tôi không thể hiểu rõ anh ta đang nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very busy but in fact achieve very little",
                    "vi": "rất bận rộn nhưng trên thực tế đạt được rất ít"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance",
                    "vi": "được sử dụng để hỏi ai đó mặt nào của đồng xu mà họ nghĩ sẽ hướng lên trên khi nó được tung ra để quyết định một điều gì đó tình cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if cars, etc. are nose to tail, they are moving slowly in a long line with little space between them",
                    "vi": "nếu ô tô, v.v. hướng mũi vào nhau, chúng đang di chuyển chậm trên một đường dài với rất ít khoảng trống giữa chúng"
                },
                "examples": [
                    {
                        "en": "The traffic was nose to tail for miles.",
                        "vi": "Giao thông nối đuôi nhau hàng dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "following behind somebody very closely, especially in a car",
                    "vi": "theo sau ai đó rất gần, đặc biệt là trong ô tô"
                },
                "examples": [
                    {
                        "en": "There’s been a white van sitting on my tail for the past ten miles.",
                        "vi": "Có một chiếc xe tải màu trắng đang ngồi trên đuôi tôi trong mười dặm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant feature that comes at the end of a story, an event, etc. and makes it less good, successful, etc.",
                    "vi": "một tính năng khó chịu xuất hiện ở cuối câu chuyện, sự kiện, v.v. và làm cho nó kém hay, thành công, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation in which the most important aspect is being influenced and controlled by somebody/something that is not as important",
                    "vi": "được sử dụng để mô tả một tình huống trong đó khía cạnh quan trọng nhất đang bị ảnh hưởng và kiểm soát bởi ai đó / điều gì đó không quan trọng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run away from a fight or dangerous situation",
                    "vi": "để chạy trốn khỏi một cuộc chiến hoặc tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "When they heard the sirens, they turned tail and ran.",
                        "vi": "Khi nghe tiếng còi, chúng quay đầu bỏ chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling ashamed or unhappy because you have been defeated or punished",
                    "vi": "cảm thấy xấu hổ hoặc không vui vì bạn đã bị đánh bại hoặc bị trừng phạt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b78f54512b144351b467ce1fa18e0b52",
        "word": "claw",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/klɔː/",
            "us": "/klɔː/"
        },
        "nearby": [
            {
                "word": "clavichord",
                "pos": "noun"
            },
            {
                "word": "clavicle",
                "pos": "noun"
            },
            {
                "word": "claw",
                "pos": "noun"
            },
            {
                "word": "claw",
                "pos": "verb"
            },
            {
                "word": "claw back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the sharp curved nails on the end of an animal’s or a bird’s foot",
                    "vi": "một trong những móng cong sắc nhọn ở cuối chân động vật hoặc chân chim"
                },
                "examples": [
                    {
                        "en": "The cat lashed out with its claws.",
                        "vi": "Con mèo dùng móng vuốt ra đòn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, sharp curved part of the body of some types of shellfish, used for catching and holding things",
                    "vi": "một số loại động vật có vỏ dài, cong nhọn, dùng để đánh bắt và đựng đồ vật"
                },
                "examples": [
                    {
                        "en": "the claws of a crab",
                        "vi": "càng cua"
                    }
                ]
            },
            {
                "define": {
                    "en": "part of a tool or machine, like a claw, used for holding, pulling or lifting things",
                    "vi": "một phần của công cụ hoặc máy móc, như móng vuốt, được sử dụng để giữ, kéo hoặc nâng vật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a woman gets her claws into a man, she tries hard to make him marry her or to have a relationship with her",
                    "vi": "Nếu một người phụ nữ có móng vuốt của mình vào một người đàn ông, cô ấy sẽ cố gắng rất nhiều để khiến anh ta kết hôn với cô ấy hoặc có một mối quan hệ với cô ấy"
                },
                "examples": [
                    {
                        "en": "She’s really got her claws into you!",
                        "vi": "Cô ấy thực sự có móng vuốt của mình vào bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody severely",
                    "vi": "chỉ trích ai đó nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Wait until the media gets its claws into her.",
                        "vi": "Chờ cho đến khi phương tiện truyền thông có móng vuốt của nó vào cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving opposition or competition that is violent and without sympathy",
                    "vi": "liên quan đến sự chống đối hoặc cạnh tranh bạo lực và không có thiện cảm"
                },
                "examples": [
                    {
                        "en": "nature, red in tooth and claw",
                        "vi": "thiên nhiên, có màu đỏ ở răng và móng"
                    }
                ]
            }
        ]
    },
    {
        "id": "5ea7a1ba17bf4f4bab999a8f186361ab",
        "word": "fin",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɪn/",
            "us": "/fɪn/"
        },
        "nearby": [
            {
                "word": "filtrate",
                "pos": "noun"
            },
            {
                "word": "filtration",
                "pos": "noun"
            },
            {
                "word": "fin",
                "pos": "noun"
            },
            {
                "word": "finagle",
                "pos": "verb"
            },
            {
                "word": "final",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a fish, used for swimming and keeping balance",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi cơ thể cá, dùng để bơi và giữ thăng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thin flat part that sticks out from the body of a vehicle, an aircraft, etc., used for improving its balance and movement",
                    "vi": "một bộ phận phẳng mỏng nhô ra khỏi thân xe, máy bay, v.v., được sử dụng để cải thiện khả năng giữ thăng bằng và chuyển động của nó"
                },
                "examples": [
                    {
                        "en": "tail fins",
                        "vi": "Vây đuôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "3264260bf3d04ff888a6d6fd37fab937",
        "word": "gill",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡɪl/",
            "us": "/ɡɪl/"
        },
        "nearby": [
            {
                "word": "Gill",
                "pos": ""
            },
            {
                "word": "Eric Gill",
                "pos": ""
            },
            {
                "word": "gill1",
                "pos": "noun"
            },
            {
                "word": "gill2",
                "pos": "noun"
            },
            {
                "word": "'Dizzy' Gillespie",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the openings on the side of a fish’s head that it breathes through",
                    "vi": "một trong những khe hở bên đầu cá mà nó thở qua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "until completely full",
                    "vi": "cho đến khi hoàn toàn đầy"
                },
                "examples": [
                    {
                        "en": "I was stuffed to the gills with chocolate cake.",
                        "vi": "Tôi đã bị nhét bánh sô cô la vào mang."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3816138c89a4ffd9ed9a6526ec6d920",
        "word": "scale",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/skeɪl/",
            "us": "/skeɪl/"
        },
        "nearby": [
            {
                "word": "scald",
                "pos": "noun"
            },
            {
                "word": "scalding",
                "pos": "adjective"
            },
            {
                "word": "scale",
                "pos": "noun"
            },
            {
                "word": "scale",
                "pos": "verb"
            },
            {
                "word": "scale down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the size or extent of something, especially when compared with something else",
                    "vi": "kích thước hoặc mức độ của thứ gì đó, đặc biệt là khi so sánh với thứ khác"
                },
                "examples": [
                    {
                        "en": "on a … scale They entertain on a large scale (= they hold expensive parties with a lot of guests).",
                        "vi": "trên quy mô… Họ giải trí trên quy mô lớn (= họ tổ chức những bữa tiệc đắt tiền với rất nhiều khách)."
                    },
                    {
                        "en": "Here was corruption on a grand scale.",
                        "vi": "Đây là tham nhũng ở quy mô lớn."
                    },
                    {
                        "en": "On a global scale, 77 per cent of energy is created from fossil fuels.",
                        "vi": "Trên quy mô toàn cầu, 77% năng lượng được tạo ra từ nhiên liệu hóa thạch."
                    },
                    {
                        "en": "Corporations are borrowing on a massive scale.",
                        "vi": "Các tập đoàn đang vay nợ trên quy mô lớn."
                    },
                    {
                        "en": "Western-style consumerism is unsustainable on a global scale.",
                        "vi": "Chủ nghĩa tiêu dùng kiểu phương Tây không bền vững trên phạm vi toàn cầu."
                    },
                    {
                        "en": "Manufacturing is done on a small scale.",
                        "vi": "Sản xuất được thực hiện ở quy mô nhỏ."
                    },
                    {
                        "en": "His work as a portrait painter is small in scale.",
                        "vi": "Công việc của anh như một họa sĩ chân dung có quy mô nhỏ."
                    },
                    {
                        "en": "to achieve economies of scale in production (= to produce many items so the cost of producing each one is reduced)",
                        "vi": "để đạt được hiệu quả kinh tế theo quy mô trong sản xuất (= sản xuất nhiều mặt hàng để giảm chi phí sản xuất mỗi mặt hàng)"
                    },
                    {
                        "en": "scale of something It was impossible to comprehend the full scale of the disaster.",
                        "vi": "quy mô của một cái gì đó Không thể hiểu được toàn bộ quy mô của thảm họa."
                    },
                    {
                        "en": "It was not until morning that the sheer scale of the damage could be seen (= how great it was).",
                        "vi": "Mãi đến sáng, người ta mới thấy được quy mô thiệt hại tuyệt đối (= nó lớn đến mức nào)."
                    },
                    {
                        "en": "The scale of the problem is difficult to measure.",
                        "vi": "Quy mô của vấn đề rất khó đo lường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a range of levels or numbers used for measuring something",
                    "vi": "một loạt các cấp độ hoặc con số được sử dụng để đo lường thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a five-point pay scale",
                        "vi": "thang lương năm điểm"
                    },
                    {
                        "en": "to evaluate performance on a scale from 1 to 10",
                        "vi": "để đánh giá hiệu suất trên thang điểm từ 1 đến 10"
                    },
                    {
                        "en": "The salary scale goes from £12 000 to £20 000.",
                        "vi": "Thang lương từ £ 12 000 đến £ 20 000."
                    },
                    {
                        "en": "a scale of charges",
                        "vi": "một quy mô phí"
                    },
                    {
                        "en": "Use the following scale to rate each item.",
                        "vi": "Sử dụng thang điểm sau để đánh giá từng mục."
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of all the different levels of something, from the lowest to the highest",
                    "vi": "tập hợp tất cả các cấp độ khác nhau của thứ gì đó, từ mức thấp nhất đến mức cao nhất"
                },
                "examples": [
                    {
                        "en": "At the other end of the scale, life is a constant struggle to get enough to eat.",
                        "vi": "Ở đầu bên kia của quy mô, cuộc sống là một cuộc đấu tranh liên tục để có đủ ăn."
                    },
                    {
                        "en": "You're higher on the social scale than I am.",
                        "vi": "Trên quy mô xã hội, bạn cao hơn tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of marks at regular points on an instrument that is used for measuring",
                    "vi": "một loạt các dấu tại các điểm thông thường trên một dụng cụ được sử dụng để đo"
                },
                "examples": [
                    {
                        "en": "How much does it read on the scale?",
                        "vi": "Nó đọc được bao nhiêu trên thang đo?"
                    },
                    {
                        "en": "He read the altitude in degrees off the scale.",
                        "vi": "Anh ta đọc độ cao theo độ trên thang đo."
                    }
                ]
            },
            {
                "define": {
                    "en": "an instrument for weighing people or things",
                    "vi": "một công cụ để cân người hoặc vật"
                },
                "examples": [
                    {
                        "en": "bathroom/kitchen/weighing scales",
                        "vi": "phòng tắm / nhà bếp / cân trọng lượng"
                    },
                    {
                        "en": "(figurative) the scales of justice (= represented as the two pans on a balance)",
                        "vi": "(nghĩa bóng) các thang đo công lý (= được biểu thị như hai cái chảo trên một cái cân)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the relation between the actual size of something and its size on a map, diagram or model that represents it",
                    "vi": "mối quan hệ giữa kích thước thực tế của một cái gì đó và kích thước của nó trên bản đồ, sơ đồ hoặc mô hình đại diện cho nó"
                },
                "examples": [
                    {
                        "en": "a scale of 1:25 000",
                        "vi": "tỷ lệ 1:25 000"
                    },
                    {
                        "en": "a scale model/drawing",
                        "vi": "một mô hình / bản vẽ tỷ lệ"
                    },
                    {
                        "en": "Both plans are drawn to the same scale.",
                        "vi": "Cả hai kế hoạch được rút ra với cùng một quy mô."
                    },
                    {
                        "en": "to scale Is this diagram to scale? (= are all its parts the same size and shape in relation to each other as they are in the thing represented)",
                        "vi": "để chia tỷ lệ Biểu đồ này có để chia tỷ lệ không? (= là tất cả các bộ phận của nó có cùng kích thước và hình dạng liên quan đến nhau khi chúng ở trong vật thể hiện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of musical notes moving upwards or downwards, with fixed intervals between each note, especially a series of eight starting on a particular note",
                    "vi": "một loạt các nốt nhạc di chuyển lên trên hoặc xuống dưới, với các khoảng thời gian cố định giữa mỗi nốt nhạc, đặc biệt là một chuỗi tám nốt nhạc bắt đầu trên một nốt nhạc cụ thể"
                },
                "examples": [
                    {
                        "en": "the scale of C major",
                        "vi": "quy mô của C major"
                    },
                    {
                        "en": "to practise scales on the piano",
                        "vi": "để thực hành thang âm trên piano"
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the thin plates of hard material that cover the skin of many fish and reptiles",
                    "vi": "bất kỳ tấm mỏng nào bằng vật liệu cứng bao phủ da của nhiều loài cá và bò sát"
                },
                "examples": [
                    {
                        "en": "The beast was a dragon, with great purple and green scales.",
                        "vi": "Con quái vật là một con rồng, với những chiếc vảy màu tím và xanh lục rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hard white substance that is sometimes left inside water pipes and containers for heating water",
                    "vi": "một chất màu trắng cứng đôi khi còn sót lại bên trong đường ống nước và vật chứa để đun nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a hard substance that forms on teeth, especially when they are not cleaned regularly",
                    "vi": "một chất cứng hình thành trên răng, đặc biệt là khi chúng không được làm sạch thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to affect the result of something in one way rather than another",
                    "vi": "ảnh hưởng đến kết quả của điều gì đó theo cách này chứ không phải theo cách khác"
                },
                "examples": [
                    {
                        "en": "In an interview, smart presentation can tip the scales in your favour.",
                        "vi": "Trong một cuộc phỏng vấn, cách trình bày thông minh có thể đưa các thang điểm có lợi cho bạn."
                    },
                    {
                        "en": "New evidence tipped the balance against the prosecution.",
                        "vi": "Bằng chứng mới nghiêng về sự cân bằng chống lại việc truy tố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to weigh a particular amount",
                    "vi": "cân một lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He tipped the scales at just over 80 kilos.",
                        "vi": "Anh ta cho rằng chiếc cân chỉ hơn 80 kg."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b8dc700be5b4181b6af30bb9b999844",
        "word": "tentacle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtentəkl/",
            "us": "/ˈtentəkl/"
        },
        "nearby": [
            {
                "word": "tensor",
                "pos": "noun"
            },
            {
                "word": "tent",
                "pos": "noun"
            },
            {
                "word": "tentacle",
                "pos": "noun"
            },
            {
                "word": "tentative",
                "pos": "adjective"
            },
            {
                "word": "tentatively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, thin part of the body of some creatures, such as squid, used for feeling or holding things, for moving or for getting food",
                    "vi": "một phần dài và mỏng của cơ thể của một số sinh vật, chẳng hạn như mực, được sử dụng để cảm nhận hoặc cầm đồ vật, để di chuyển hoặc để lấy thức ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the influence that a large place, organization or system has and that is hard to avoid",
                    "vi": "ảnh hưởng mà một địa điểm, tổ chức hoặc hệ thống lớn có được và điều đó là khó tránh"
                },
                "examples": [
                    {
                        "en": "The tentacles of satellite television are spreading even wider.",
                        "vi": "Các xúc tu của truyền hình vệ tinh ngày càng lan rộng hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "737a03eb3a5d4ac4800b7cb3a043061b",
        "word": "pincer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪnsə(r)/",
            "us": "/ˈpɪnsər/"
        },
        "nearby": [
            {
                "word": "pinboard",
                "pos": "noun"
            },
            {
                "word": "pince-nez",
                "pos": "noun"
            },
            {
                "word": "pincer",
                "pos": "noun"
            },
            {
                "word": "pincer movement",
                "pos": "noun"
            },
            {
                "word": "pinch",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool made of two crossed pieces of metal, used for holding things and pulling things, for example nails out of wood",
                    "vi": "một công cụ làm bằng hai mảnh kim loại bắt chéo nhau, được sử dụng để giữ đồ vật và kéo đồ vật, ví dụ như đinh đóng từ gỗ"
                },
                "examples": [
                    {
                        "en": "a pair of pincers",
                        "vi": "một cặp kìm"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a pair of curved claws of some types of animal, for example crabs and lobsters",
                    "vi": "một trong những cặp vuốt cong của một số loại động vật, ví dụ như cua và tôm hùm"
                },
                "examples": [
                    {
                        "en": "Crabs normally catch food with their pincers.",
                        "vi": "Cua thường bắt thức ăn bằng kìm của chúng."
                    }
                ]
            }
        ]
    },
    {
        "id": "405f9394771c47358150d17910491c52",
        "word": "sucker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌkə(r)/",
            "us": "/ˈsʌkər/"
        },
        "nearby": [
            {
                "word": "suck",
                "pos": "verb"
            },
            {
                "word": "suck",
                "pos": "noun"
            },
            {
                "word": "sucker",
                "pos": "noun"
            },
            {
                "word": "sucker",
                "pos": "verb"
            },
            {
                "word": "sucker into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is easily tricked or persuaded to do something",
                    "vi": "một người dễ bị lừa hoặc bị thuyết phục làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She always said the lottery was for suckers.",
                        "vi": "Cô ấy luôn nói xổ số là dành cho những kẻ hút máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who cannot resist somebody/something or likes somebody/something very much",
                    "vi": "một người không thể chống lại ai đó / điều gì đó hoặc rất thích ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I've always been a sucker for men with green eyes.",
                        "vi": "Tôi luôn là một kẻ hấp dẫn những người đàn ông có đôi mắt xanh lục."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special organ on the body of some animals that enables them to stick to a surface",
                    "vi": "một cơ quan đặc biệt trên cơ thể của một số động vật giúp chúng có thể bám vào bề mặt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a disc like a cup in shape, usually made of rubber or plastic, that sticks to a surface when you press it against it",
                    "vi": "một chiếc đĩa có hình dạng giống như một chiếc cốc, thường được làm bằng cao su hoặc nhựa, dính vào bề mặt khi bạn ấn nó vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part of a tree or bush that grows from the roots rather than from the main stem or the branches and can form a new tree or bush",
                    "vi": "một phần của cây hoặc bụi mọc từ rễ chứ không phải từ thân chính hoặc cành và có thể hình thành cây hoặc bụi mới"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to refer in a general way to a person or thing, especially for emphasis",
                    "vi": "được sử dụng để chỉ một cách chung chung cho một người hoặc một sự vật, đặc biệt là để nhấn mạnh"
                },
                "examples": [
                    {
                        "en": "The pilot said, ‘I don't know how I got the sucker down safely.’",
                        "vi": "Người phi công nói, 'Tôi không biết làm thế nào tôi hạ được kẻ hút máu một cách an toàn.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a hard round or flat sweet made of boiled sugar on a small stick",
                    "vi": "một viên ngọt cứng hoặc tròn cứng làm bằng đường đun sôi trên một thanh nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be94e0d441224eda919b56d02900fec1",
        "word": "vent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vent/",
            "us": "/vent/"
        },
        "nearby": [
            {
                "word": "venomously",
                "pos": "adverb"
            },
            {
                "word": "venous",
                "pos": "adjective"
            },
            {
                "word": "vent",
                "pos": "noun"
            },
            {
                "word": "vent",
                "pos": "verb"
            },
            {
                "word": "ventilate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening that allows air, gas or liquid to pass out of or into a room, building, container, etc.",
                    "vi": "một khe hở cho phép không khí, khí đốt hoặc chất lỏng đi ra ngoài hoặc đi vào phòng, tòa nhà, thùng chứa, v.v."
                },
                "examples": [
                    {
                        "en": "air/heating vents",
                        "vi": "lỗ thông hơi / sưởi ấm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opening in the body of a bird, fish, reptile or other small animal, through which waste matter is passed out",
                    "vi": "lỗ mở trong cơ thể của chim, cá, bò sát hoặc động vật nhỏ khác, qua đó chất thải được thải ra ngoài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long, thin opening at the bottom of the back or side of a coat or jacket",
                    "vi": "một lỗ dài và mỏng ở dưới cùng của lưng hoặc bên hông của áo khoác hoặc áo khoác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to express a feeling, especially anger, strongly",
                    "vi": "thể hiện một cách mạnh mẽ cảm xúc, đặc biệt là tức giận"
                },
                "examples": [
                    {
                        "en": "Children give vent to their anger in various ways.",
                        "vi": "Trẻ em giải tỏa cơn giận bằng nhiều cách khác nhau."
                    },
                    {
                        "en": "She gave full vent to her feelings in a violent outburst.",
                        "vi": "Cô ấy đã bộc lộ hết cảm xúc của mình trong một cơn bộc phát dữ dội."
                    }
                ]
            }
        ]
    }
]