[
    {
        "id": "c365e0e949a34958ad8bac42a3019325",
        "word": "bored",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/bɔːd/",
            "us": "/bɔːrd/"
        },
        "nearby": [
            {
                "word": "bore",
                "pos": "noun"
            },
            {
                "word": "boreal",
                "pos": "adjective"
            },
            {
                "word": "bored",
                "pos": "adjective"
            },
            {
                "word": "boredom",
                "pos": "noun"
            },
            {
                "word": "borehole",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling tired and impatient because you have lost interest in somebody/something or because you have nothing to do",
                    "vi": "cảm thấy mệt mỏi và mất kiên nhẫn vì bạn đã mất hứng thú với ai đó / điều gì đó hoặc vì bạn không có gì để làm"
                },
                "examples": [
                    {
                        "en": "There was a bored expression on her face.",
                        "vi": "Vẻ mặt cô ấy lộ rõ vẻ chán nản."
                    },
                    {
                        "en": "She plays the role of a bored housewife.",
                        "vi": "Cô vào vai một bà nội trợ buồn chán."
                    },
                    {
                        "en": "She was rather bored with her life in a small town.",
                        "vi": "Cô cảm thấy khá nhàm chán với cuộc sống của mình ở một thị trấn nhỏ."
                    },
                    {
                        "en": "bored with/of somebody/something | bored with/of doing something The children quickly got bored with staying indoors.",
                        "vi": "chán với / của ai đó / cái gì đó | chán với / khi làm điều gì đó Trẻ em nhanh chóng cảm thấy nhàm chán với việc ở trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely frightened or bored",
                    "vi": "cực kỳ sợ hãi hoặc buồn chán"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely bored",
                    "vi": "chán vô cùng"
                },
                "examples": [
                    {
                        "en": "I remember being bored stiff during my entire time at school.",
                        "vi": "Tôi nhớ mình đã rất buồn chán trong suốt thời gian ở trường."
                    },
                    {
                        "en": "She enjoys it. Everyone else is bored silly.",
                        "vi": "Cô ấy thích nó. Mọi người khác đều buồn chán một cách ngớ ngẩn."
                    },
                    {
                        "en": "He walked along, bored out of his mind.",
                        "vi": "Anh bước đi, chán nản ra về."
                    },
                    {
                        "en": "She was alone all day and bored to death.",
                        "vi": "Cô ấy ở một mình cả ngày và buồn chán chết đi được."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea93ad8931804614b0fa6f3d0cd6528e",
        "word": "routine",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ruːˈtiːn/",
            "us": "/ruːˈtiːn/"
        },
        "nearby": [
            {
                "word": "router1",
                "pos": "noun"
            },
            {
                "word": "router2",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "adjective"
            },
            {
                "word": "routinely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the normal order and way in which you regularly do things",
                    "vi": "thứ tự bình thường và cách bạn thường xuyên làm mọi việc"
                },
                "examples": [
                    {
                        "en": "to settle/get/fall into a routine",
                        "vi": "để giải quyết / có được / rơi vào một thói quen"
                    },
                    {
                        "en": "We are trying to get the baby into a routine for feeding and sleeping.",
                        "vi": "Chúng tôi đang cố gắng tạo cho em bé thói quen bú và ngủ."
                    },
                    {
                        "en": "In school, I quickly fell into the routine.",
                        "vi": "Ở trường, tôi nhanh chóng rơi vào nề nếp."
                    },
                    {
                        "en": "Make exercise a part of your daily routine.",
                        "vi": "Hãy tập thể dục trở thành một phần trong thói quen hàng ngày của bạn."
                    },
                    {
                        "en": "A pressing work project had disrupted his normal sleep routine.",
                        "vi": "Một dự án công việc cấp bách đã làm gián đoạn thói quen ngủ bình thường của anh ấy."
                    },
                    {
                        "en": "There's never a bad time to begin a new exercise routine.",
                        "vi": "Không bao giờ là thời điểm xấu để bắt đầu một thói quen tập thể dục mới."
                    },
                    {
                        "en": "We clean and repair the machines as a matter of routine.",
                        "vi": "Chúng tôi vệ sinh và sửa chữa máy móc như một việc thường xuyên."
                    },
                    {
                        "en": "Don't cut back on your regular fitness routine.",
                        "vi": "Đừng cắt giảm thói quen tập thể dục thường xuyên của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which life is boring because things are always done in the same way",
                    "vi": "một tình huống mà cuộc sống tẻ nhạt vì mọi thứ luôn được thực hiện theo cùng một cách"
                },
                "examples": [
                    {
                        "en": "She needed a break from routine.",
                        "vi": "Cô cần nghỉ ngơi khỏi những công việc thường ngày."
                    },
                    {
                        "en": "He tries to escape the dull routine of his office life.",
                        "vi": "Anh ta cố gắng thoát khỏi thói quen buồn tẻ của cuộc sống văn phòng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of movements, jokes, etc. that are part of a performance",
                    "vi": "một loạt các chuyển động, trò đùa, v.v. là một phần của màn biểu diễn"
                },
                "examples": [
                    {
                        "en": "to do/perform a dance routine",
                        "vi": "để làm / thực hiện một thói quen khiêu vũ"
                    },
                    {
                        "en": "We need some new material for our routine.",
                        "vi": "Chúng tôi cần một số tài liệu mới cho thói quen của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of instructions that enable a computer to perform a particular task",
                    "vi": "danh sách các hướng dẫn cho phép máy tính thực hiện một tác vụ cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b570583ff5f4f16a98ae4e96a2f30ec",
        "word": "boredom",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɔːdəm/",
            "us": "/ˈbɔːrdəm/"
        },
        "nearby": [
            {
                "word": "boreal",
                "pos": "adjective"
            },
            {
                "word": "bored",
                "pos": "adjective"
            },
            {
                "word": "boredom",
                "pos": "noun"
            },
            {
                "word": "borehole",
                "pos": "noun"
            },
            {
                "word": "borewell",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of feeling bored; the fact of being very boring",
                    "vi": "trạng thái cảm thấy buồn chán; thực tế là rất nhàm chán"
                },
                "examples": [
                    {
                        "en": "I started to eat too much out of sheer boredom.",
                        "vi": "Tôi bắt đầu ăn quá nhiều vì chán."
                    },
                    {
                        "en": "Television helps to relieve the boredom of the long winter evenings.",
                        "vi": "Ti vi giúp giải tỏa sự nhàm chán của những buổi tối dài mùa đông."
                    },
                    {
                        "en": "I noticed her short attention span and low boredom threshold (= she got bored very quickly).",
                        "vi": "Tôi nhận thấy khoảng thời gian chú ý ngắn và ngưỡng buồn chán thấp của cô ấy (= cô ấy cảm thấy buồn chán rất nhanh)."
                    }
                ]
            }
        ]
    },
    {
        "id": "609c6988a88b453ba2de545be60370e2",
        "word": "cool",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/kuːl/",
            "us": "/kuːl/"
        },
        "nearby": [
            {
                "word": "cook up",
                "pos": "phrasal verb"
            },
            {
                "word": "cookware",
                "pos": "noun"
            },
            {
                "word": "cool",
                "pos": "adjective"
            },
            {
                "word": "cool",
                "pos": "verb"
            },
            {
                "word": "cool",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fairly cold; not hot or warm",
                    "vi": "khá lạnh; không nóng hoặc ấm"
                },
                "examples": [
                    {
                        "en": "cool air/water",
                        "vi": "không khí / nước mát"
                    },
                    {
                        "en": "a cool breeze/drink/climate",
                        "vi": "một làn gió mát / đồ uống / khí hậu"
                    },
                    {
                        "en": "Cooler weather is forecast for the weekend.",
                        "vi": "Thời tiết mát mẻ hơn được dự báo vào cuối tuần."
                    },
                    {
                        "en": "These plants prefer cooler temperatures.",
                        "vi": "Những cây này thích nhiệt độ mát hơn."
                    },
                    {
                        "en": "Let's sit in the shade and keep cool.",
                        "vi": "Hãy ngồi trong bóng râm và mát mẻ."
                    },
                    {
                        "en": "The wooden shutters help keep the building cool.",
                        "vi": "Các cửa chớp bằng gỗ giúp tòa nhà luôn mát mẻ."
                    },
                    {
                        "en": "Store lemons in a cool dry place.",
                        "vi": "Bảo quản chanh ở nơi khô mát."
                    }
                ]
            },
            {
                "define": {
                    "en": "helping you keep cool",
                    "vi": "giúp bạn giữ bình tĩnh"
                },
                "examples": [
                    {
                        "en": "Wear light, cool clothing but try to avoid shorts.",
                        "vi": "Mặc quần áo nhẹ, thoáng mát nhưng cố gắng tránh mặc quần đùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel pleasantly cool",
                    "vi": "làm cho bạn cảm thấy mát mẻ dễ chịu"
                },
                "examples": [
                    {
                        "en": "a room painted in cool greens and blues",
                        "vi": "một căn phòng sơn xanh và xanh lam mát mẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you admire or approve of somebody/something because they are/it is fashionable, attractive and often different",
                    "vi": "được sử dụng để thể hiện rằng bạn ngưỡng mộ hoặc tán thành ai đó / điều gì đó bởi vì họ là / nó là thời trang, hấp dẫn và thường khác biệt"
                },
                "examples": [
                    {
                        "en": "Doesn't she look cool in those sunglasses?",
                        "vi": "Trông cô ấy trông thật ngầu khi đeo cặp kính râm đó sao?"
                    },
                    {
                        "en": "He's a really cool guy.",
                        "vi": "Anh ấy là một chàng trai thực sự tuyệt vời."
                    },
                    {
                        "en": "You look pretty cool with that new haircut.",
                        "vi": "Trông bạn khá tuyệt với kiểu tóc mới đó."
                    },
                    {
                        "en": "It's a cool movie.",
                        "vi": "Đó là một bộ phim thú vị."
                    },
                    {
                        "en": "She has lots of cool ideas.",
                        "vi": "Cô ấy có rất nhiều ý tưởng hay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that you like or enjoy",
                    "vi": "được sử dụng để mô tả một cái gì đó mà bạn thích hoặc thích thú"
                },
                "examples": [
                    {
                        "en": "We had such a cool time with Ed and his friends.",
                        "vi": "Chúng tôi đã có một khoảng thời gian tuyệt vời với Ed và những người bạn của anh ấy."
                    },
                    {
                        "en": "I really hope you can come—it'd be so cool!",
                        "vi": "Tôi thực sự hy vọng bạn có thể đến — nó sẽ rất tuyệt!"
                    },
                    {
                        "en": "it is cool to do something It was totally cool to see him in real life.",
                        "vi": "thật tuyệt khi làm điều gì đó Thật tuyệt khi gặp anh ấy ngoài đời."
                    },
                    {
                        "en": "it is cool (that)… It's really cool you came back!",
                        "vi": "nó thật tuyệt (điều đó)… Thật tuyệt khi bạn đã trở lại!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you approve of something or agree to a suggestion",
                    "vi": "được sử dụng để cho thấy rằng bạn chấp thuận điều gì đó hoặc đồng ý với một đề xuất"
                },
                "examples": [
                    {
                        "en": "We're meeting Jake for lunch and we can go on the yacht in the afternoon.’ ‘Cool!’",
                        "vi": "Chúng ta sẽ gặp Jake để ăn trưa và chúng ta có thể lên du thuyền vào buổi chiều. ' 'Mát lạnh!'"
                    },
                    {
                        "en": "Can you come at 10.30 tomorrow?’ ‘That's cool.’",
                        "vi": "Bạn có thể đến lúc 10h30 ngày mai không? ' \"Thật tuyệt.\""
                    },
                    {
                        "en": "‘Yeah, sure. That sounds cool,’ he replied.",
                        "vi": "Ừ chắc chắn. Điều đó nghe có vẻ tuyệt vời, 'anh ta trả lời."
                    },
                    {
                        "en": "cool with something I was surprised that she got the job, but I'm cool with it (= it's not a problem for me).",
                        "vi": "tuyệt vời với điều gì đó Tôi rất ngạc nhiên khi cô ấy nhận được công việc, nhưng tôi rất tuyệt vời với nó (= đó không phải là vấn đề với tôi)."
                    },
                    {
                        "en": "cool about something She's completely cool about what happened.",
                        "vi": "mát mẻ về điều gì đó Cô ấy hoàn toàn bình tĩnh về những gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "calm; not excited, angry or emotional",
                    "vi": "điềm tĩnh; không vui mừng, tức giận hoặc xúc động"
                },
                "examples": [
                    {
                        "en": "Keep cool!",
                        "vi": "Giữ mát!"
                    },
                    {
                        "en": "Just stay cool and don't panic.",
                        "vi": "Hãy bình tĩnh và đừng hoảng sợ."
                    },
                    {
                        "en": "She tried to remain cool, calm and collected (= calm).",
                        "vi": "Cô ấy cố giữ bình tĩnh, bình tĩnh và thu thập (= bình tĩnh)."
                    },
                    {
                        "en": "He has a cool head (= he stays calm in an emergency).",
                        "vi": "Anh ấy có một cái đầu lạnh (= anh ấy vẫn bình tĩnh trong trường hợp khẩn cấp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "not friendly, interested or enthusiastic",
                    "vi": "không thân thiện, quan tâm hoặc nhiệt tình"
                },
                "examples": [
                    {
                        "en": "They gave the prime minister a cool reception.",
                        "vi": "Họ đã dành cho thủ tướng một sự đón tiếp trọng thị."
                    },
                    {
                        "en": "Her voice was cool and dismissive.",
                        "vi": "Giọng cô ấy thật lạnh lùng và bác bỏ."
                    },
                    {
                        "en": "cool about something She was decidedly cool about the proposal.",
                        "vi": "mát mẻ về điều gì đó Cô ấy đã quyết định rất tuyệt về đề xuất này."
                    },
                    {
                        "en": "cool towards somebody/something He has been cool towards me ever since we had that argument.",
                        "vi": "lạnh lùng với ai đó / điều gì đó Anh ấy đã rất lạnh lùng với tôi kể từ khi chúng tôi có cuộc tranh cãi đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "calm and confident in a way that lacks respect for other people, but makes people admire you even if they don't approve",
                    "vi": "điềm tĩnh và tự tin một cách thiếu tôn trọng người khác nhưng lại khiến người khác ngưỡng mộ bạn dù họ không tán thành."
                },
                "examples": [
                    {
                        "en": "She just took his keys and walked out with them, cool as you please.",
                        "vi": "Cô ấy chỉ lấy chìa khóa của anh ấy và đi ra ngoài với họ, thoải mái tùy ý bạn."
                    },
                    {
                        "en": "He was a cool customer. No one would think to look for him in a city where he’d been arrested for killing a cop.",
                        "vi": "Anh ấy là một khách hàng tuyệt vời. Không ai có thể nghĩ đến việc tìm kiếm anh ta trong một thành phố nơi anh ta đã bị bắt vì giết một cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "used about a sum of money to emphasize how large it is",
                    "vi": "được sử dụng về một khoản tiền để nhấn mạnh nó lớn như thế nào"
                },
                "examples": [
                    {
                        "en": "The car cost a cool thirty thousand.",
                        "vi": "Chiếc xe hơi có giá ba mươi nghìn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very calm and showing control, especially in a difficult situation",
                    "vi": "rất bình tĩnh và thể hiện sự kiểm soát, đặc biệt là trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "George is cool as a cucumber and this should be just another operation for him.",
                        "vi": "George ngầu như một quả dưa chuột và đây chỉ là một ca phẫu thuật khác đối với anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with a situation in a calm way and not show what you are really feeling",
                    "vi": "đối phó với tình huống một cách bình tĩnh và không thể hiện những gì bạn đang thực sự cảm thấy"
                },
                "examples": [
                    {
                        "en": "I decided to play it cool and act like I had actually forgotten all about it.",
                        "vi": "Tôi quyết định chơi nó thật ngầu và hành động như thể tôi đã thực sự quên hết về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider a problem or possibility very carefully and without hurrying",
                    "vi": "xem xét một vấn đề hoặc khả năng rất cẩn thận và không vội vàng"
                },
                "examples": [
                    {
                        "en": "We need to take a long, hard look at all the options.",
                        "vi": "Chúng ta cần phải xem xét kỹ lưỡng và lâu dài về tất cả các lựa chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very fashionable",
                    "vi": "rất thời trang"
                },
                "examples": [
                    {
                        "en": "The assistants look like they're too cool for school.",
                        "vi": "Các trợ lý trông giống như họ quá tuyệt khi đi học."
                    }
                ]
            }
        ]
    },
    {
        "id": "200a9d9f4cdc4306b0b5c49b6550f852",
        "word": "dull",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dʌl/",
            "us": "/dʌl/"
        },
        "nearby": [
            {
                "word": "dulcet",
                "pos": "adjective"
            },
            {
                "word": "dulcimer",
                "pos": "noun"
            },
            {
                "word": "dull",
                "pos": "adjective"
            },
            {
                "word": "dull",
                "pos": "verb"
            },
            {
                "word": "dullard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not interesting or exciting",
                    "vi": "không thú vị hay thú vị"
                },
                "examples": [
                    {
                        "en": "Life in a small town could be deadly dull.",
                        "vi": "Cuộc sống ở một thị trấn nhỏ có thể thật buồn tẻ."
                    },
                    {
                        "en": "The countryside was flat, dull and uninteresting.",
                        "vi": "Vùng nông thôn bằng phẳng, buồn tẻ và không thú vị."
                    },
                    {
                        "en": "The first half of the game was pretty dull.",
                        "vi": "Nửa đầu trận đấu diễn ra khá buồn tẻ."
                    },
                    {
                        "en": "There's never a dull moment when John's around.",
                        "vi": "Không bao giờ có một khoảnh khắc buồn tẻ khi John ở bên."
                    }
                ]
            },
            {
                "define": {
                    "en": "not bright or shiny",
                    "vi": "không sáng hoặc bóng"
                },
                "examples": [
                    {
                        "en": "a dull grey colour",
                        "vi": "một màu xám buồn tẻ"
                    },
                    {
                        "en": "dull, lifeless hair",
                        "vi": "tóc xỉn màu, thiếu sức sống"
                    },
                    {
                        "en": "Her eyes were dull.",
                        "vi": "Đôi mắt cô đờ đẫn."
                    },
                    {
                        "en": "The fire died down to a dull glow.",
                        "vi": "Ngọn lửa đã tàn xuống một ánh sáng buồn tẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not bright, with a lot of clouds",
                    "vi": "không sáng, có nhiều mây"
                },
                "examples": [
                    {
                        "en": "It was a dull, grey day.",
                        "vi": "Đó là một ngày buồn tẻ, xám xịt."
                    },
                    {
                        "en": "The town seemed deserted in the dull afternoon light.",
                        "vi": "Thị trấn dường như vắng vẻ trong ánh chiều tà."
                    }
                ]
            },
            {
                "define": {
                    "en": "not clear or loud",
                    "vi": "không rõ ràng hoặc lớn"
                },
                "examples": [
                    {
                        "en": "The gates shut behind him with a dull thud.",
                        "vi": "Cánh cổng đóng lại sau lưng anh ta với một tiếng thình thịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "not very severe, but continuous",
                    "vi": "không nghiêm trọng lắm, nhưng liên tục"
                },
                "examples": [
                    {
                        "en": "a dull ache/pain",
                        "vi": "một cơn đau / đau âm ỉ"
                    }
                ]
            },
            {
                "define": {
                    "en": "slow in understanding",
                    "vi": "chậm hiểu"
                },
                "examples": [
                    {
                        "en": "a dull pupil",
                        "vi": "một học sinh đần độn"
                    }
                ]
            },
            {
                "define": {
                    "en": "not busy; slow",
                    "vi": "không bận rộn; chậm"
                },
                "examples": [
                    {
                        "en": "Don't sell into a dull market.",
                        "vi": "Đừng bán vào một thị trường buồn tẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not healthy to spend all your time working; you need to relax too",
                    "vi": "không có lợi cho sức khỏe nếu bạn dành toàn bộ thời gian để làm việc; bạn cũng cần thư giãn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely boring",
                    "vi": "cực kỳ nhàm chán"
                },
                "examples": [
                    {
                        "en": "I always found history as dull as ditchwater.",
                        "vi": "Tôi luôn thấy lịch sử buồn tẻ như một con mương."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2574bace1054735af14930de26a8459",
        "word": "repetitive",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈpetətɪv/",
            "us": "/rɪˈpetətɪv/"
        },
        "nearby": [
            {
                "word": "repetitiously",
                "pos": "adverb"
            },
            {
                "word": "repetitiousness",
                "pos": "noun"
            },
            {
                "word": "repetitive",
                "pos": "adjective"
            },
            {
                "word": "repetitively",
                "pos": "adverb"
            },
            {
                "word": "repetitiveness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "saying or doing the same thing many times, so that it becomes boring",
                    "vi": "nói hoặc làm cùng một điều nhiều lần, để nó trở nên nhàm chán"
                },
                "examples": [
                    {
                        "en": "a repetitive task",
                        "vi": "một nhiệm vụ lặp đi lặp lại"
                    }
                ]
            },
            {
                "define": {
                    "en": "repeated many times",
                    "vi": "lặp lại nhiều lần"
                },
                "examples": [
                    {
                        "en": "a repetitive pattern of behaviour",
                        "vi": "một kiểu hành vi lặp đi lặp lại"
                    },
                    {
                        "en": "Travel sickness is caused by the effect of repetitive movements.",
                        "vi": "Chứng say du lịch là do ảnh hưởng của các chuyển động lặp đi lặp lại."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c35fc8ce9514f1ca3ac2d030eba1d03",
        "word": "routine",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ruːˈtiːn/",
            "us": "/ruːˈtiːn/"
        },
        "nearby": [
            {
                "word": "router2",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "adjective"
            },
            {
                "word": "routinely",
                "pos": "adverb"
            },
            {
                "word": "routing number",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done or happening as a normal part of a particular job, situation or process",
                    "vi": "được thực hiện hoặc diễn ra như một phần bình thường của một công việc, tình huống hoặc quy trình cụ thể"
                },
                "examples": [
                    {
                        "en": "routine enquiries/questions/tests/screening",
                        "vi": "yêu cầu / câu hỏi / kiểm tra / sàng lọc thông thường"
                    },
                    {
                        "en": "Don't worry—these are just routine enquiries.",
                        "vi": "Đừng lo lắng — đây chỉ là những câu hỏi thông thường."
                    },
                    {
                        "en": "The fault was discovered during a routine check.",
                        "vi": "Lỗi được phát hiện trong quá trình kiểm tra định kỳ."
                    },
                    {
                        "en": "This equipment requires routine maintenance.",
                        "vi": "Thiết bị này cần được bảo trì định kỳ."
                    },
                    {
                        "en": "The policemen were on a routine patrol.",
                        "vi": "Các cảnh sát đang đi tuần tra định kỳ."
                    },
                    {
                        "en": "It was claimed that torture of detainees was routine.",
                        "vi": "Người ta tuyên bố rằng việc tra tấn những người bị giam giữ là thường lệ."
                    },
                    {
                        "en": "Routine use of antibiotics should be discouraged.",
                        "vi": "Không khuyến khích sử dụng kháng sinh thường xuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "not unusual or different in any way",
                    "vi": "không bất thường hoặc khác biệt theo bất kỳ cách nào"
                },
                "examples": [
                    {
                        "en": "He died of a heart attack during a routine operation.",
                        "vi": "Anh ấy chết vì một cơn đau tim trong một ca phẫu thuật thường lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "ordinary and boring",
                    "vi": "bình thường và nhàm chán"
                },
                "examples": [
                    {
                        "en": "a routine job",
                        "vi": "một công việc thường ngày"
                    },
                    {
                        "en": "This type of work rapidly becomes routine.",
                        "vi": "Loại công việc này nhanh chóng trở thành thói quen."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a7b99a288314b339a2cea2621482fb6",
        "word": "uninterested",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ʌnˈɪntrəstɪd/",
            "us": "/ʌnˈɪntrəstɪd/"
        },
        "nearby": [
            {
                "word": "unintentional",
                "pos": "adjective"
            },
            {
                "word": "unintentionally",
                "pos": "adverb"
            },
            {
                "word": "uninterested",
                "pos": "adjective"
            },
            {
                "word": "uninteresting",
                "pos": "adjective"
            },
            {
                "word": "uninterrupted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not interested; not wanting to know about somebody/something",
                    "vi": "không quan tâm; không muốn biết về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was totally uninterested in sport.",
                        "vi": "Anh ấy hoàn toàn không quan tâm đến thể thao."
                    },
                    {
                        "en": "She seemed cold and uninterested.",
                        "vi": "Cô ấy có vẻ lạnh lùng và không quan tâm."
                    },
                    {
                        "en": "She was completely uninterested in her sister’s career.",
                        "vi": "Cô hoàn toàn không quan tâm đến sự nghiệp của em gái mình."
                    },
                    {
                        "en": "They were totally uninterested in politics.",
                        "vi": "Họ hoàn toàn không quan tâm đến chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "4061f565d73c4226ae4566146eddef0e",
        "word": "bore",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/bɔː(r)/",
            "us": "/bɔːr/"
        },
        "nearby": [
            {
                "word": "borderline personality disorder",
                "pos": "noun"
            },
            {
                "word": "border on",
                "pos": "phrasal verb"
            },
            {
                "word": "bore",
                "pos": "verb"
            },
            {
                "word": "bore",
                "pos": "noun"
            },
            {
                "word": "boreal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel bored, especially by talking too much",
                    "vi": "làm cho ai đó cảm thấy buồn chán, đặc biệt là bằng cách nói quá nhiều"
                },
                "examples": [
                    {
                        "en": "bore somebody I'm not boring you, am I?",
                        "vi": "bore ai đó Tôi không nhàm chán bạn, phải không?"
                    },
                    {
                        "en": "bore somebody with something Has he been boring you with his stories about his trip?",
                        "vi": "làm phiền ai đó với điều gì Anh ấy đã làm bạn nhàm chán với những câu chuyện của anh ấy về chuyến đi của anh ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a long deep hole with a tool or by digging",
                    "vi": "để tạo một hố sâu dài bằng một công cụ hoặc bằng cách đào"
                },
                "examples": [
                    {
                        "en": "bore into/through something The drill is strong enough to bore through solid rock.",
                        "vi": "khoan vào / xuyên qua thứ gì đó Mũi khoan đủ mạnh để khoan xuyên qua đá rắn."
                    },
                    {
                        "en": "bore something (in/through something) to bore a hole in something",
                        "vi": "khoan một cái gì đó (trong / xuyên qua cái gì đó) để khoan một cái gì đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stare in a way that makes somebody feel uncomfortable",
                    "vi": "nhìn chằm chằm theo cách khiến ai đó cảm thấy khó chịu"
                },
                "examples": [
                    {
                        "en": "His blue eyes seemed to bore into her.",
                        "vi": "Đôi mắt xanh của anh như nhìn sâu vào cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "e67019fb9e8642f9bb14d25f56f5316b",
        "word": "bore",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bɔː(r)/",
            "us": "/bɔːr/"
        },
        "nearby": [
            {
                "word": "border on",
                "pos": "phrasal verb"
            },
            {
                "word": "bore",
                "pos": "verb"
            },
            {
                "word": "bore",
                "pos": "noun"
            },
            {
                "word": "boreal",
                "pos": "adjective"
            },
            {
                "word": "bored",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is very boring, usually because they talk too much",
                    "vi": "một người rất nhàm chán, thường là do họ nói quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation or thing that is boring or that annoys you",
                    "vi": "một tình huống hoặc điều gì đó nhàm chán hoặc làm bạn khó chịu"
                },
                "examples": [
                    {
                        "en": "It's such a bore having to stay late this evening.",
                        "vi": "Thật là buồn khi phải ở lại tối nay."
                    },
                    {
                        "en": "It’s a real bore having to meet my aunt for lunch.",
                        "vi": "Thật là buồn khi phải gặp dì tôi để ăn trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hollow inside of a tube, such as a pipe or a gun; the measurement from one side of the hole to the other",
                    "vi": "phần rỗng bên trong của ống, chẳng hạn như ống hoặc súng; phép đo từ bên này sang bên kia của lỗ"
                },
                "examples": [
                    {
                        "en": "a tube with a wide/narrow bore",
                        "vi": "một ống có lỗ khoan rộng / hẹp"
                    },
                    {
                        "en": "a twelve-bore shotgun",
                        "vi": "một khẩu súng ngắn mười hai nòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong, high wave that rushes along a river from the sea at particular times of the year",
                    "vi": "một làn sóng mạnh, cao đổ xô dọc theo một con sông từ biển vào những thời điểm cụ thể trong năm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a deep hole made in the ground, especially to find water or oil",
                    "vi": "một lỗ sâu được tạo ra trong lòng đất, đặc biệt là để tìm nước hoặc dầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very boring person, activity, event or subject",
                    "vi": "một người, hoạt động, sự kiện hoặc chủ đề rất nhàm chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bc56c5ff27544d478416a6a3bebc340c",
        "word": "go on",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "gook",
                "pos": "noun"
            },
            {
                "word": "goolie",
                "pos": "noun"
            },
            {
                "word": "go on",
                "pos": "phrasal verb"
            },
            {
                "word": "goon",
                "pos": "noun"
            },
            {
                "word": "goonda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a performer goes on, they begin their performance",
                    "vi": "khi một nghệ sĩ biểu diễn tiếp tục, họ bắt đầu màn trình diễn của mình"
                },
                "examples": [
                    {
                        "en": "She doesn't go on until Act 2.",
                        "vi": "Cô ấy không tiếp tục cho đến Màn 2."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join a team as a substitute during a game",
                    "vi": "tham gia một đội với tư cách là người thay thế trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "Maguire went on in place of Cahill just before half-time.",
                        "vi": "Maguire vào thay Cahill ngay trước khi hiệp một kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a light, the electricity, etc. goes on, it starts to work",
                    "vi": "khi đèn sáng, điện, v.v., nó bắt đầu hoạt động"
                },
                "examples": [
                    {
                        "en": "Suddenly all the lights went on.",
                        "vi": "Đột nhiên tất cả các đèn bật sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass",
                    "vi": "vượt qua"
                },
                "examples": [
                    {
                        "en": "She became more and more talkative as the evening went on.",
                        "vi": "Càng về tối, cô ấy càng nói nhiều hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen",
                    "vi": "xảy ra"
                },
                "examples": [
                    {
                        "en": "What's going on here?",
                        "vi": "Những gì đang xảy ra ở đây?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a situation goes on, it continues without changing",
                    "vi": "nếu một tình huống tiếp diễn, nó sẽ tiếp tục mà không thay đổi"
                },
                "examples": [
                    {
                        "en": "This cannot be allowed to go on.",
                        "vi": "Điều này không thể được phép tiếp tục."
                    },
                    {
                        "en": "How much longer will this hot weather go on for?",
                        "vi": "Thời tiết nóng bức này sẽ còn tiếp tục trong bao lâu nữa?"
                    },
                    {
                        "en": "We can't go on like this—we seem to be always arguing.",
                        "vi": "Chúng ta không thể tiếp tục như thế này - chúng ta dường như luôn tranh cãi."
                    },
                    {
                        "en": "The flight just seemed to go on and on.",
                        "vi": "Chuyến bay dường như cứ tiếp tục trôi qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue speaking, often after stopping for a short time",
                    "vi": "tiếp tục nói, thường sau khi dừng một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "She hesitated for a moment and then went on.",
                        "vi": "Cô ấy do dự một lúc rồi đi tiếp."
                    },
                    {
                        "en": "+ speech ‘You know,’ he went on, ‘I think my brother could help you.’",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to encourage somebody to do something",
                    "vi": "được sử dụng để khuyến khích ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Go on! Have another drink!",
                        "vi": "Đi tiếp! Uống nữa đi!"
                    },
                    {
                        "en": "Go on—jump!",
                        "vi": "Tiếp tục — nhảy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel in front of somebody else",
                    "vi": "đi du lịch trước mặt người khác"
                },
                "examples": [
                    {
                        "en": "You go on ahead—I'll catch you up in a few minutes.",
                        "vi": "Bạn cứ tiếp tục — tôi sẽ bắt kịp bạn sau vài phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to base an opinion or a judgement on something",
                    "vi": "để đưa ra ý kiến hoặc đánh giá về điều gì đó"
                },
                "examples": [
                    {
                        "en": "The police don't have much to go on.",
                        "vi": "Cảnh sát không có nhiều việc phải làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about somebody/something for a long time, especially in a boring or complaining way",
                    "vi": "để nói về ai đó / điều gì đó trong một thời gian dài, đặc biệt là một cách nhàm chán hoặc phàn nàn"
                },
                "examples": [
                    {
                        "en": "He went on and on about how poor he was.",
                        "vi": "Anh ta cứ nói mãi về việc anh ta nghèo như thế nào."
                    },
                    {
                        "en": "She does go on sometimes!",
                        "vi": "Cô ấy thỉnh thoảng vẫn tiếp tục!"
                    },
                    {
                        "en": "He goes on endlessly about his health problems.",
                        "vi": "Anh ấy không ngừng nói về các vấn đề sức khỏe của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to complain to somebody about their behaviour, work, etc.",
                    "vi": "để phàn nàn với ai đó về hành vi, công việc của họ, v.v."
                },
                "examples": [
                    {
                        "en": "She goes on at him continually.",
                        "vi": "Cô ấy tiếp tục với anh ta liên tục."
                    },
                    {
                        "en": "Stop going on at me about that money.",
                        "vi": "Đừng tiếp tục với tôi về số tiền đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue an activity, especially after a break",
                    "vi": "để tiếp tục một hoạt động, đặc biệt là sau khi nghỉ giải lao"
                },
                "examples": [
                    {
                        "en": "That's enough for now—let's go on with it tomorrow.",
                        "vi": "Bây giờ là đủ rồi - hãy tiếp tục với nó vào ngày mai."
                    },
                    {
                        "en": "We'll go on with the presentations after lunch.",
                        "vi": "Chúng ta sẽ tiếp tục với các bài thuyết trình sau bữa trưa."
                    }
                ]
            }
        ]
    },
    {
        "id": "b5ad81c88a474916a617111a11702bc5",
        "word": "monotonous",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈnɒtənəs/",
            "us": "/məˈnɑːtənəs/"
        },
        "nearby": [
            {
                "word": "monotone",
                "pos": "noun"
            },
            {
                "word": "monotone",
                "pos": "adjective"
            },
            {
                "word": "monotonous",
                "pos": "adjective"
            },
            {
                "word": "monotonously",
                "pos": "adverb"
            },
            {
                "word": "monotony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "never changing and therefore boring",
                    "vi": "không bao giờ thay đổi và do đó nhàm chán"
                },
                "examples": [
                    {
                        "en": "a monotonous voice/diet/routine",
                        "vi": "một giọng nói đơn điệu / chế độ ăn uống / thói quen"
                    },
                    {
                        "en": "monotonous work",
                        "vi": "công việc đơn điệu"
                    },
                    {
                        "en": "New secretaries came and went with monotonous regularity.",
                        "vi": "Các thư ký mới đến và đi với sự đều đặn đơn điệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d4ca37aa0d242d19dac1456a1d72b73",
        "word": "predictable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/prɪˈdɪktəbl/",
            "us": "/prɪˈdɪktəbl/"
        },
        "nearby": [
            {
                "word": "predict",
                "pos": "verb"
            },
            {
                "word": "predictability",
                "pos": "noun"
            },
            {
                "word": "predictable",
                "pos": "adjective"
            },
            {
                "word": "predictably",
                "pos": "adverb"
            },
            {
                "word": "prediction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something is predictable, you know in advance that it will happen or what it will be like",
                    "vi": "nếu điều gì đó có thể dự đoán được, bạn biết trước rằng nó sẽ xảy ra hoặc nó sẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "a predictable result",
                        "vi": "một kết quả có thể đoán trước"
                    },
                    {
                        "en": "The ending of the book was entirely predictable.",
                        "vi": "Cái kết của cuốn sách hoàn toàn có thể đoán trước được."
                    },
                    {
                        "en": "The disease follows a highly predictable pattern.",
                        "vi": "Căn bệnh này diễn ra theo một mô hình rất dễ dự đoán."
                    },
                    {
                        "en": "In March and April, the weather is much less predictable.",
                        "vi": "Vào tháng Ba và tháng Tư, thời tiết khó dự đoán hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving or happening in a way that you would expect and therefore boring",
                    "vi": "hành xử hoặc diễn ra theo cách mà bạn mong đợi và do đó nhàm chán"
                },
                "examples": [
                    {
                        "en": "He's very nice, but I find him rather dull and predictable.",
                        "vi": "Anh ấy rất tốt, nhưng tôi thấy anh ấy khá buồn tẻ và dễ đoán."
                    },
                    {
                        "en": "Rock music is getting so predictable these days.",
                        "vi": "Nhạc rock ngày càng trở nên dễ đoán."
                    },
                    {
                        "en": "She had been in a number of predictable sitcoms.",
                        "vi": "Cô đã tham gia một số bộ phim sitcom có thể đoán trước được."
                    }
                ]
            }
        ]
    },
    {
        "id": "990766f70a7d4bc59e03e6f182dc9cc5",
        "word": "unconcerned",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌʌnkənˈsɜːnd/",
            "us": "/ˌʌnkənˈsɜːrnd/"
        },
        "nearby": [
            {
                "word": "unconcealed",
                "pos": "adjective"
            },
            {
                "word": "unconcern",
                "pos": "noun"
            },
            {
                "word": "unconcerned",
                "pos": "adjective"
            },
            {
                "word": "unconcernedly",
                "pos": "adverb"
            },
            {
                "word": "unconditional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not worried or anxious about something because you feel it does not affect you or is not important",
                    "vi": "không lo lắng hoặc lo lắng về điều gì đó bởi vì bạn cảm thấy nó không ảnh hưởng đến bạn hoặc không quan trọng"
                },
                "examples": [
                    {
                        "en": "He drove on, apparently unconcerned about the noise the engine was making.",
                        "vi": "Anh ta lái xe tiếp tục, dường như không quan tâm đến tiếng động cơ đang tạo ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "not interested in something",
                    "vi": "không quan tâm đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Young people are often unconcerned with political issues.",
                        "vi": "Những người trẻ tuổi thường không quan tâm đến các vấn đề chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "e0f0ac6ee13e461198ab73644c238e9d",
        "word": "apathy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæpəθi/",
            "us": "/ˈæpəθi/"
        },
        "nearby": [
            {
                "word": "apathetic",
                "pos": "adjective"
            },
            {
                "word": "apathetically",
                "pos": "adverb"
            },
            {
                "word": "apathy",
                "pos": "noun"
            },
            {
                "word": "apatosaurus",
                "pos": "noun"
            },
            {
                "word": "APB",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of not being interested in or enthusiastic about something, or things in general",
                    "vi": "cảm giác không quan tâm hoặc không nhiệt tình với một cái gì đó, hoặc những thứ nói chung"
                },
                "examples": [
                    {
                        "en": "There is widespread apathy among the electorate.",
                        "vi": "Có sự thờ ơ rộng rãi giữa các cử tri."
                    },
                    {
                        "en": "public/political/student apathy",
                        "vi": "sự thờ ơ của công chúng / chính trị / sinh viên"
                    }
                ]
            }
        ]
    },
    {
        "id": "0ce06d47e6394df38f140856a3f5db66",
        "word": "brain-dead",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbreɪn ded/",
            "us": "/ˈbreɪn ded/"
        },
        "nearby": [
            {
                "word": "brain damage",
                "pos": "noun"
            },
            {
                "word": "brain-damaged",
                "pos": "adjective"
            },
            {
                "word": "brain-dead",
                "pos": "adjective"
            },
            {
                "word": "brain death",
                "pos": "noun"
            },
            {
                "word": "brain drain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "suffering from serious damage to the brain and needing machines to stay alive",
                    "vi": "bị tổn thương não nghiêm trọng và cần máy móc để duy trì sự sống"
                },
                "examples": [
                    {
                        "en": "Doctors declared her clinically brain-dead.",
                        "vi": "Các bác sĩ tuyên bố cô chết não lâm sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very stupid and boring; not intelligent",
                    "vi": "rất ngu ngốc và nhàm chán; không khôn ngoan"
                },
                "examples": [
                    {
                        "en": "I was afraid of becoming brain-dead after months at home.",
                        "vi": "Tôi sợ mình sẽ chết não sau nhiều tháng ở nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f6dd11349ad44dba26357b5af5ed0bc",
        "word": "disinterested",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪsˈɪntrəstɪd/",
            "us": "/dɪsˈɪntrəstɪd/"
        },
        "nearby": [
            {
                "word": "disinter",
                "pos": "verb"
            },
            {
                "word": "disinterest",
                "pos": "noun"
            },
            {
                "word": "disinterested",
                "pos": "adjective"
            },
            {
                "word": "disinterestedly",
                "pos": "adverb"
            },
            {
                "word": "disinvest",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not influenced by personal feelings, or by the chance of getting some advantage for yourself",
                    "vi": "không bị ảnh hưởng bởi cảm xúc cá nhân, hoặc cơ hội đạt được một số lợi thế cho bản thân"
                },
                "examples": [
                    {
                        "en": "a disinterested onlooker/spectator",
                        "vi": "một người xem / khán giả không quan tâm"
                    },
                    {
                        "en": "Her advice appeared to be disinterested.",
                        "vi": "Lời khuyên của cô ấy tỏ ra không quan tâm."
                    },
                    {
                        "en": "I was merely a disinterested spectator in the whole affair.",
                        "vi": "Tôi chỉ là một khán giả không quan tâm đến toàn bộ cuộc tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "not interested",
                    "vi": "không quan tâm"
                },
                "examples": [
                    {
                        "en": "He is completely uninterested in politics.",
                        "vi": "Anh ấy hoàn toàn không quan tâm đến chính trị."
                    },
                    {
                        "en": "I am not really interested in politics.",
                        "vi": "Tôi không thực sự quan tâm đến chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "056a49f4a5624ea198171f993a2bd6c3",
        "word": "drab",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dræb/",
            "us": "/dræb/"
        },
        "nearby": [
            {
                "word": "DQ",
                "pos": ""
            },
            {
                "word": "Dr",
                "pos": "abbreviation"
            },
            {
                "word": "drab",
                "pos": "adjective"
            },
            {
                "word": "drabness",
                "pos": "noun"
            },
            {
                "word": "drabs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without interest or colour; boring",
                    "vi": "không có lãi hoặc màu sắc; nhàm chán"
                },
                "examples": [
                    {
                        "en": "She longed to be out of the cold, drab little office.",
                        "vi": "Cô khao khát được ra khỏi văn phòng nhỏ buồn tẻ và lạnh lẽo."
                    },
                    {
                        "en": "drab women, dressed in browns and greys",
                        "vi": "phụ nữ buồn tẻ, mặc đồ nâu và xám"
                    }
                ]
            }
        ]
    },
    {
        "id": "dd24c2f4b6b2428381a42c44112cb13a",
        "word": "drag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dræɡ/",
            "us": "/dræɡ/"
        },
        "nearby": [
            {
                "word": "drafty",
                "pos": "adjective"
            },
            {
                "word": "drag",
                "pos": "verb"
            },
            {
                "word": "drag",
                "pos": "noun"
            },
            {
                "word": "drag-and-drop",
                "pos": "adjective"
            },
            {
                "word": "drag by",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a boring person or thing; something that is annoying",
                    "vi": "một người hoặc một thứ nhàm chán; một cái gì đó gây phiền nhiễu"
                },
                "examples": [
                    {
                        "en": "He's such a drag.",
                        "vi": "Anh ấy là một lực kéo."
                    },
                    {
                        "en": "Walking's a drag—let's drive there.",
                        "vi": "Đi bộ là một lực cản — hãy lái xe đến đó."
                    },
                    {
                        "en": "Having to work late every day is a drag.",
                        "vi": "Phải làm việc muộn mỗi ngày là một lực cản."
                    },
                    {
                        "en": "It’s a real drag having to go all the way to London for the interview.",
                        "vi": "Đó là một lực cản thực sự khi phải đi đến tận London để phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that makes progress difficult",
                    "vi": "một người hoặc một việc làm cho sự tiến bộ trở nên khó khăn"
                },
                "examples": [
                    {
                        "en": "He came to be seen as a drag on his own party's prospects.",
                        "vi": "Anh ta được coi là một lực cản đối với triển vọng của đảng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of breathing in smoke from a cigarette, etc.",
                    "vi": "hành động hít khói từ điếu thuốc, v.v."
                },
                "examples": [
                    {
                        "en": "She took a long drag on her cigarette.",
                        "vi": "Cô kéo dài điếu thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "clothes that are usually worn by the opposite sex (usually women’s clothes worn by a man as part of an entertainment)",
                    "vi": "quần áo thường mặc của người khác giới (thường là quần áo của phụ nữ được mặc bởi một người đàn ông như một phần của trò giải trí)"
                },
                "examples": [
                    {
                        "en": "in drag He performed in drag.",
                        "vi": "trong lực kéo Anh ấy đã thực hiện trong lực kéo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the force of the air that acts against the movement of an aircraft or other vehicle",
                    "vi": "lực của không khí chống lại chuyển động của máy bay hoặc phương tiện khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aa6bfdfd472e4d139e2a9ba4261ad2c7",
        "word": "glaze",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡleɪz/",
            "us": "/ɡleɪz/"
        },
        "nearby": [
            {
                "word": "glaucoma",
                "pos": "noun"
            },
            {
                "word": "GlaxoSmithKline",
                "pos": ""
            },
            {
                "word": "glaze",
                "pos": "verb"
            },
            {
                "word": "glaze",
                "pos": "noun"
            },
            {
                "word": "glazed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a person’s eyes glaze or glaze over, the person begins to look bored or tired",
                    "vi": "nếu mắt của một người trừng trừng hoặc trừng trừng, người đó bắt đầu có vẻ buồn chán hoặc mệt mỏi"
                },
                "examples": [
                    {
                        "en": "A lot of people's eyes glaze over if you say you are a feminist.",
                        "vi": "Rất nhiều người sẽ đổ dồn ánh mắt vào nếu bạn nói rằng bạn là một người ủng hộ nữ quyền."
                    },
                    {
                        "en": "‘I'm feeling rather tired,’ he said, his eyes glazing.",
                        "vi": "“Tôi cảm thấy khá mệt mỏi,” anh nói, mắt anh trừng trừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fit sheets of glass into something",
                    "vi": "để lắp các tấm kính vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to glaze a window/house",
                        "vi": "dán cửa sổ / ngôi nhà"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover something with a glaze to give it a shiny surface",
                    "vi": "phủ một thứ gì đó bằng một lớp men để bề mặt sáng bóng"
                },
                "examples": [
                    {
                        "en": "Glaze the pie with beaten egg.",
                        "vi": "Tráng bánh với trứng đã đánh tan."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d26c77f1513488a9c1308e3093adeef",
        "word": "harp on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "Harper's Magazine",
                "pos": ""
            },
            {
                "word": "harpist",
                "pos": "noun"
            },
            {
                "word": "harp on",
                "pos": "phrasal verb"
            },
            {
                "word": "harpoon",
                "pos": "noun"
            },
            {
                "word": "harpoon",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep talking about something in a boring or annoying way",
                    "vi": "tiếp tục nói về điều gì đó một cách nhàm chán hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Don’t keep harping on about my age!",
                        "vi": "Đừng tiếp tục khó chịu về tuổi của tôi!"
                    },
                    {
                        "en": "He is always harping on about the war.",
                        "vi": "Anh ấy luôn nói về chiến tranh."
                    }
                ]
            }
        ]
    },
    {
        "id": "72129bac9e3f4adb8082faad699dd57a",
        "word": "humdrum",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌmdrʌm/",
            "us": "/ˈhʌmdrʌm/"
        },
        "nearby": [
            {
                "word": "humbug",
                "pos": "noun"
            },
            {
                "word": "humdinger",
                "pos": "noun"
            },
            {
                "word": "humdrum",
                "pos": "adjective"
            },
            {
                "word": "David Hume",
                "pos": ""
            },
            {
                "word": "humectant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "boring and always the same",
                    "vi": "nhàm chán và luôn luôn giống nhau"
                },
                "examples": [
                    {
                        "en": "a humdrum existence/job/life",
                        "vi": "một sự tồn tại humdrum / công việc / cuộc sống"
                    },
                    {
                        "en": "the use of computers to perform humdrum tasks",
                        "vi": "việc sử dụng máy tính để thực hiện các tác vụ humdrum"
                    },
                    {
                        "en": "the humdrum business of making money",
                        "vi": "kinh doanh humdrum kiếm tiền"
                    }
                ]
            }
        ]
    },
    {
        "id": "aaaeb2ed75aa4e27b2240804d401d1af",
        "word": "lukewarm",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌluːkˈwɔːm/",
            "us": "/ˌluːkˈwɔːrm/"
        },
        "nearby": [
            {
                "word": "lugworm",
                "pos": "noun"
            },
            {
                "word": "Luke",
                "pos": ""
            },
            {
                "word": "lukewarm",
                "pos": "adjective"
            },
            {
                "word": "lull",
                "pos": "noun"
            },
            {
                "word": "lull",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slightly warm",
                    "vi": "hơi ấm"
                },
                "examples": [
                    {
                        "en": "Our food was only lukewarm.",
                        "vi": "Thức ăn của chúng tôi chỉ hơi ấm."
                    },
                    {
                        "en": "Heat the milk until it is just lukewarm.",
                        "vi": "Đun nóng sữa cho đến khi nó chỉ âm ấm."
                    }
                ]
            },
            {
                "define": {
                    "en": "not interested or enthusiastic",
                    "vi": "không quan tâm hoặc nhiệt tình"
                },
                "examples": [
                    {
                        "en": "a lukewarm response",
                        "vi": "một phản ứng thờ ơ"
                    },
                    {
                        "en": "lukewarm about somebody/something She was lukewarm about the plan.",
                        "vi": "thờ ơ về ai đó / điều gì đó Cô ấy đã trở nên ấm áp về kế hoạch."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3fcc8f667594a64a8827c1111d8bea2",
        "word": "mind-numbing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪnd nʌmɪŋ/",
            "us": "/ˈmaɪnd nʌmɪŋ/"
        },
        "nearby": [
            {
                "word": "mindlessly",
                "pos": "adverb"
            },
            {
                "word": "mind map",
                "pos": "noun"
            },
            {
                "word": "mind-numbing",
                "pos": "adjective"
            },
            {
                "word": "mind-numbingly",
                "pos": "adverb"
            },
            {
                "word": "mind out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very boring",
                    "vi": "rất nhàm chán"
                },
                "examples": [
                    {
                        "en": "mind-numbing conversation",
                        "vi": "cuộc trò chuyện đầu óc"
                    }
                ]
            }
        ]
    },
    {
        "id": "6df953c8beee4892bcb812155874df9e",
        "word": "monotony",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈnɒtəni/",
            "us": "/məˈnɑːtəni/"
        },
        "nearby": [
            {
                "word": "monotonous",
                "pos": "adjective"
            },
            {
                "word": "monotonously",
                "pos": "adverb"
            },
            {
                "word": "monotony",
                "pos": "noun"
            },
            {
                "word": "monotreme",
                "pos": "noun"
            },
            {
                "word": "Monotype",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "boring lack of variety",
                    "vi": "nhàm chán thiếu sự đa dạng"
                },
                "examples": [
                    {
                        "en": "She watches television to relieve the monotony of everyday life.",
                        "vi": "Cô xem tivi để giải tỏa sự đơn điệu của cuộc sống hàng ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "4ff093eb97a04ce3906b7362bbb1550b",
        "word": "ponderous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒndərəs/",
            "us": "/ˈpɑːndərəs/"
        },
        "nearby": [
            {
                "word": "pond",
                "pos": "noun"
            },
            {
                "word": "ponder",
                "pos": "verb"
            },
            {
                "word": "ponderous",
                "pos": "adjective"
            },
            {
                "word": "ponderously",
                "pos": "adverb"
            },
            {
                "word": "ponderousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too slow and careful; serious and boring",
                    "vi": "quá chậm và cẩn thận; nghiêm túc và nhàm chán"
                },
                "examples": [
                    {
                        "en": "He spoke in a slow ponderous voice.",
                        "vi": "Anh ta nói với một giọng trầm ngâm chậm rãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "moving slowly and heavily; able to move only slowly",
                    "vi": "di chuyển chậm và nặng nề; chỉ có thể di chuyển chậm"
                },
                "examples": [
                    {
                        "en": "She watched the cow's ponderous progress.",
                        "vi": "Cô quan sát sự tiến bộ của con bò."
                    }
                ]
            }
        ]
    },
    {
        "id": "7fa6880c27b1478b9933c32241a6399a",
        "word": "rut",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌt/",
            "us": "/rʌt/"
        },
        "nearby": [
            {
                "word": "rustproof",
                "pos": "adjective"
            },
            {
                "word": "rusty",
                "pos": "adjective"
            },
            {
                "word": "rut",
                "pos": "noun"
            },
            {
                "word": "rutabaga",
                "pos": "noun"
            },
            {
                "word": "Rutgers University",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deep track that a wheel makes in soft ground",
                    "vi": "một rãnh sâu mà bánh xe tạo ra trong nền đất yếu"
                },
                "examples": [
                    {
                        "en": "It was difficult to walk in the muddy ruts left by the tractor.",
                        "vi": "Thật khó khăn khi đi trên đường lầy lội do chiếc máy kéo để lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a boring way of life that does not change",
                    "vi": "một lối sống nhàm chán không thay đổi"
                },
                "examples": [
                    {
                        "en": "I gave up my job because I felt I was stuck in a rut.",
                        "vi": "Tôi đã từ bỏ công việc của mình vì tôi cảm thấy mình bị mắc kẹt trong một guồng quay."
                    },
                    {
                        "en": "If you don't go out and meet new people, it's easy to get into a rut.",
                        "vi": "Nếu bạn không ra ngoài và gặp gỡ những người mới, bạn rất dễ rơi vào tình trạng sa đà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time of year when male animals, especially deer, become sexually active",
                    "vi": "thời điểm trong năm khi động vật đực, đặc biệt là hươu, trở nên hoạt động tình dục"
                },
                "examples": [
                    {
                        "en": "stags fighting during the rut",
                        "vi": "cờ chiến đấu trong cuộc đua"
                    }
                ]
            }
        ]
    },
    {
        "id": "0d968ef090cc4802be4d5b6127a8700b",
        "word": "square",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/skweə(r)/",
            "us": "/skwer/"
        },
        "nearby": [
            {
                "word": "squander",
                "pos": "verb"
            },
            {
                "word": "Squanto",
                "pos": ""
            },
            {
                "word": "square",
                "pos": "adjective"
            },
            {
                "word": "square",
                "pos": "noun"
            },
            {
                "word": "square",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having four straight equal sides and four angles of 90°",
                    "vi": "có bốn cạnh thẳng bằng nhau và bốn góc 90 °"
                },
                "examples": [
                    {
                        "en": "a square room",
                        "vi": "một căn phòng vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "forming an angle of 90° exactly or approximately",
                    "vi": "tạo thành một góc 90 ° chính xác hoặc gần đúng"
                },
                "examples": [
                    {
                        "en": "The book had rounded, not square, corners.",
                        "vi": "Cuốn sách được làm tròn, không vuông, các góc."
                    },
                    {
                        "en": "square shoulders",
                        "vi": "vai vuông"
                    },
                    {
                        "en": "He had a firm, square jaw.",
                        "vi": "Anh ta có một cái hàm vuông vức, rắn chắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a number to give a measurement of area",
                    "vi": "được sử dụng sau một số để đo diện tích"
                },
                "examples": [
                    {
                        "en": "an area of 36 square metres/feet/miles/kilometres/inches",
                        "vi": "diện tích 36 mét vuông / feet / dặm / km / inch"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a unit of measurement to say that something measures the same amount on each of four sides",
                    "vi": "được sử dụng sau một đơn vị đo lường để nói rằng một cái gì đó đo cùng một lượng ở mỗi cạnh trong số bốn cạnh"
                },
                "examples": [
                    {
                        "en": "a carpet four metres square",
                        "vi": "một tấm thảm bốn mét vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that is broad or that looks solid in shape",
                    "vi": "được sử dụng để mô tả một cái gì đó rộng hoặc có hình dạng rắn chắc"
                },
                "examples": [
                    {
                        "en": "a man of square build",
                        "vi": "người xây dựng hình vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "level with something or parallel to something",
                    "vi": "mức độ với một cái gì đó hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tables arranged square with the wall",
                        "vi": "bàn sắp xếp hình vuông với tường"
                    }
                ]
            },
            {
                "define": {
                    "en": "if two people are square, neither of them owes money to the other",
                    "vi": "nếu hai người là hình vuông, không ai trong số họ nợ người kia"
                },
                "examples": [
                    {
                        "en": "Here's the £10 I owe you—now we're square.",
                        "vi": "Đây là £ 10 tôi nợ bạn — bây giờ chúng ta đã vuông tròn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two teams are square, they have the same number of points",
                    "vi": "Nếu hai đội là hình vuông, họ có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "The teams were all square at half-time.",
                        "vi": "Tất cả các đội đều có hình vuông trong hiệp một."
                    }
                ]
            },
            {
                "define": {
                    "en": "fair or honest, especially in business matters",
                    "vi": "công bằng hoặc trung thực, đặc biệt là trong các vấn đề kinh doanh"
                },
                "examples": [
                    {
                        "en": "a square deal",
                        "vi": "một thỏa thuận vuông"
                    },
                    {
                        "en": "Are you being square with me?",
                        "vi": "Bạn có đang vuông với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "in agreement with something",
                    "vi": "đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "That isn't quite square with what you said yesterday.",
                        "vi": "Điều đó không hoàn toàn phù hợp với những gì bạn đã nói ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "considered to be boring, for example because they are old-fashioned or work too hard at school",
                    "vi": "được coi là nhàm chán, chẳng hạn như vì họ cổ hủ hoặc làm việc quá sức ở trường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a good meal that satisfies your hunger",
                    "vi": "một bữa ăn ngon giúp bạn thỏa mãn cơn đói"
                },
                "examples": [
                    {
                        "en": "He looks as though he hasn't had a square meal for weeks.",
                        "vi": "Anh ấy trông như thể anh ấy đã không được ăn một bữa no trong nhiều tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who does not feel happy or comfortable in a particular situation, or who is not suitable for it",
                    "vi": "một người không cảm thấy hạnh phúc hoặc thoải mái trong một tình huống cụ thể, hoặc người không phù hợp với nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e6d8b1ae28db4ca88f03956ea364df1c",
        "word": "staid",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/steɪd/",
            "us": "/steɪd/"
        },
        "nearby": [
            {
                "word": "stag night",
                "pos": "noun"
            },
            {
                "word": "stagy",
                "pos": "adjective"
            },
            {
                "word": "staid",
                "pos": "adjective"
            },
            {
                "word": "stain",
                "pos": "verb"
            },
            {
                "word": "stain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not fun or interesting; boring and old-fashioned",
                    "vi": "không vui vẻ hay thú vị; nhàm chán và lỗi thời"
                },
                "examples": [
                    {
                        "en": "The museum is trying to get rid of its staid image.",
                        "vi": "Bảo tàng đang cố gắng thoát khỏi hình ảnh trơ trọi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e6c23ae8bd643129600c0633bba2d65",
        "word": "stuffy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstʌfi/",
            "us": "/ˈstʌfi/"
        },
        "nearby": [
            {
                "word": "stuffiness",
                "pos": "noun"
            },
            {
                "word": "stuffing",
                "pos": "noun"
            },
            {
                "word": "stuffy",
                "pos": "adjective"
            },
            {
                "word": "stultify",
                "pos": "verb"
            },
            {
                "word": "stultifying",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "warm in an unpleasant way and without enough fresh air",
                    "vi": "ấm một cách khó chịu và không có đủ không khí trong lành"
                },
                "examples": [
                    {
                        "en": "a stuffy room",
                        "vi": "một căn phòng ngột ngạt"
                    },
                    {
                        "en": "It gets very hot and stuffy in here in summer.",
                        "vi": "Vào mùa hè ở đây rất nóng và ngột ngạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "very serious, formal, boring or old-fashioned",
                    "vi": "rất nghiêm túc, trang trọng, nhàm chán hoặc cổ hủ"
                },
                "examples": [
                    {
                        "en": "a stuffy, formal family",
                        "vi": "một gia đình trang trọng, ngột ngạt"
                    },
                    {
                        "en": "plain, stuffy clothes",
                        "vi": "quần áo trơn, ngột ngạt"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have a stuffy nose, your nose is blocked because you have a cold",
                    "vi": "Nếu bạn bị nghẹt mũi, nghẹt mũi vì bạn bị cảm lạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c8f13ff680e044d1a4ef8b197f7dd82e",
        "word": "suburban",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈbɜːbən/",
            "us": "/səˈbɜːrbən/"
        },
        "nearby": [
            {
                "word": "the subtropics",
                "pos": "noun"
            },
            {
                "word": "suburb",
                "pos": "noun"
            },
            {
                "word": "suburban",
                "pos": "adjective"
            },
            {
                "word": "suburbanite",
                "pos": "noun"
            },
            {
                "word": "suburbia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in or connected with a suburb",
                    "vi": "trong hoặc kết nối với một vùng ngoại ô"
                },
                "examples": [
                    {
                        "en": "suburban areas",
                        "vi": "Khu vực ngoại thành"
                    },
                    {
                        "en": "a suburban street",
                        "vi": "một con phố ngoại ô"
                    },
                    {
                        "en": "life in suburban London",
                        "vi": "cuộc sống ở ngoại ô London"
                    }
                ]
            },
            {
                "define": {
                    "en": "boring and ordinary",
                    "vi": "nhàm chán và bình thường"
                },
                "examples": [
                    {
                        "en": "a suburban lifestyle",
                        "vi": "một lối sống ngoại ô"
                    }
                ]
            }
        ]
    }
]