[
    {
        "id": "0c06b67e5f3441d88f150a8052628f61",
        "title": "Need to Learn How to Drive",
        "content": "Meryl was a little embarrassed to admit it. She was 37 years old, and didn't know how to drive. When she lived in Queens, it wasn't such a big deal. Everything that she needed was close by. The supermarket was one block away. She would take her shopping cart and get what she needed for the week easily. When she didn't feel like dragging the shopping cart, the supermarket even delivered for free. All she had to do was tip the driver. She would use that same shopping cart to take clothes to and from the laundromat, which was only a block away. While Meryl's job was not a block away, the subway station was. Every day she would walk the block to catch a 45-minute underground train ride to work. She repeated the journey in reverse to return home in the evenings.\nAlhambra sure was different, though. The walk from Meryl's house to the supermarket was nearly a mile. She didn't feel like walking that long a distance while pushing shopping cart full of a week's worth of food. The laundromat was a mile in the other direction. She wasn't going to push her dirty clothes through that many streets. There were no trains nearby to take her to work, just buses. The buses always took a long time to come. For the first few weeks, Meryl was always late everywhere. Sometimes when she had an urgent appointment, Meryl would ask friends to give her a ride somewhere. Almost all of her friends had cars and knew how to drive. Most of them learned it when they were in high school.\nAfter a while, her friends were tired of giving Meryl rides everywhere. \"You need to learn how to drive, Meryl,\" they told her. She knew they were right, but Meryl was scared."
    },
    {
        "id": "473d3c981fe94757bd8e46bc7e6e28d1",
        "title": "A Day at the Beach",
        "content": "\"My dad's taking us to Santa Monica today,\" said Carol. \"Do you want to go with us?\" Laura loved to go to the beach, so she said she would be happy to. Santa Monica beach is one of the most beautiful beaches in California. There are more scenic views on the coastline up and down the state, but many are inaccessible to beachgoers. Santa Monica has a very large beach area that features white sand and lots of room to play. Carol liked to toss a Frisbee around with her friends and to play volleyball.\n\"Do you want to play volleyball, Laura,\" Carol asked when they got there. \"Sure,\" said Laura, \"but who are we going to play with? It takes more than two people to play.\" Carol thought about it, and said that they should start playing and others will join in, so the two girls started playing alone. Just as Carol said, more kids came over and wanted to play with them. Soon they had more than enough people for a game, and they played for hours.\nAfter the game, the girls wanted to cool off, so they decided to jump into the ocean for a little relief. The water was crowded, but that just added to the fun. It was cool and wet, and the waves were just right. Some people were surfing both on surfboards and body boards, while others were swimming out to the buoys. On the coastline, two girls were digging for sea shells and one man was using his metal detector to find hidden treasure. Carol ran up to the man and asked him what he was looking for. He said: \"Anything I can find, young lady.' Carol laughed and asked him if she could try. \"Sure. Why not?\" said the man. So Carol started scanning the beach and soon found a necklace, whcih the man let her keep. \"Why not,\" said the man. \"You found it.\" Carol was very happy and ran to tell Laura."
    },
    {
        "id": "fd603625d25a4a7395aa6ff360ca299b",
        "title": "A Valuable Addition to the Team",
        "content": "Once a person gets the job he or she wants, it then becomes important to be a good employee to the organization. The new employee should be a valuable addition to the team. There are many ways a person can be considered a good employee. Being prompt is a very important aspect of any job. If a person's working hours are from 8:00 a.m. to 4:30 p.m., for instance, it would be wise to be on time or a few minutes earlier. Allowing extra time for your trip to the office is always a good idea. Unexpected delays such as traffic accidents or foul weather can all cause you to be late. Commuter buses and trains could be delayed, too.\nBeing late is never a good idea, but it is also important to be at work and ready to perform your duties every day. Most jobs still adhere to a five-day schedule from Monday through Friday. There are many exceptions depending on the type of position you hold, but again, most people work a standard five-day work week. Some other things a worker can do to be a good employee is to have a positive attitude about your job. An enthusiastic employee is a great asset to the employer. Dressing properly, being trustworthy, following the organization's rules all help you become a good employee.\nOne of the best things a person can have is to find a job that he or she really enjoys. There is an old saying that reads, \"If you love what you do, you'll never work a day in your life.\" Loving your job will be rewarding, satisfying, and it will give you a great attitude."
    },
    {
        "id": "ab1f58a8701d41cd9372a0bac7ec5139",
        "title": "The California College and University System",
        "content": "California is the largest state in the United States of America. It is home to more than 10 percent of the country's total population. It also has the largest education system in the country. The college and university system is divided into four parts. Those parts are the University of California system, the California State University system, the community college system, and private institutions.\nThe UC system has more than 230,000 students at its 10 Campuses. It is considered the more prestigious system in the state. It includes top universities like UC Berkeley, and the University of California, Los Angeles (UCLA). Both schools rank in the top 25 universities in the country, with Berkeley in the top 10. A degree from the UC system is highly sought, and the academic standards are higher than the other systems. They are also more expensive.\nThe California State Universities counts 23 universities in its system. It is a diversified system that includes two polytechnic universities, and a maritime university. These schools offer vocational and maritime education, but also offer traditional, academic programs. The systems enrollment is approximately 450,000 students, with about 45,000 faculty members.\nThe California Community Colleges system is the largest systems of higher education in the state, and the world. It boasts 112 campuses, and serves approximately 2.4 million students. It offers transfer degrees, vocational training, and associates degree programs.\nCalifornia is also home to a large number of privately owned and operated schools. These schools have no ties to the state school system, but some do accept transfer students from community colleges. The most notable and prestigious schools in the state are Stanford University, in Palo Alto, and the University of Southern California, in Los Angeles."
    },
    {
        "id": "3cb6a32d3bba410a92344dd05cf59a0d",
        "title": "Martin Luther King Jr",
        "content": "The third Monday in January is an American federal holiday, Martin Luther King Jr. Day. It falls near the birthday of the civil rights leader, who was assassinated in 1968. King, a minister, became known for non-violently protesting the treatment of African-Americans in the United States and laws that discriminated against Blacks. Specifically, King protested segregation that separated blacks and whites in public restrooms, public pools, public schools, on buses, and at restaurants. King led many marches in the United States, especially in the South where segregation was especially practiced and enforced, and in Washington D.C. His march on Washington D.C. was perhaps his most famous one, where he gave the \"I have a Dream\" speech.\nOn Martin Luther King Jr. Day, federal, state, and local offices are closed, including public schools and post offices. On the holiday many people participate in marches and vigils remembering Dr. King. Others use the day as a day of service and volunteer in their community by cleaning up garbage in a local park or serving food to the homeless. However, the holiday was controversial. Some states didn't want to honor Dr. King and tried to  rename the holiday or combine the day with another holiday.\nOnly two other people have a U.S. national holiday, Christopher Columbus and George Washington. Martin Luther King Jr. Day  became a holiday in 1983 after pressure from civil rights activists and marches, similar to the ones King used to lead. Efforts to create a King holiday began the same year King was killed. The first state to recognize King Day as a holiday was Illinois. The last state to recognize the holiday was Arizona."
    },
    {
        "id": "da453666342b4825a907223632d1d64f",
        "title": "Manhattan, New York City",
        "content": "Manhattan is a small island  that is one part of New York City. New York City, \"the Big Apple\", is actually made up of five sections called boroughs. These boroughs are Manhattan, Queens, Brooklyn, Staten Island, and the Bronx. Manhattan has the most people of all the boroughs, about 1.5 million, even though it is the smallest borough by size. If you send a letter to someone who lives on Manhattan, don't write Manhattan on the envelope. You should write \"New York, New York\", like the famous  Frank Sinatra song.\nBecause the island is so small, most people live and work in tall buildings. Some of these buildings are called skyscrapers because it looks like they are touching the sky. Some famous skyscrapers in Manhattan are Empire State Building, Chrysler Building, 70 Pine Street, Trump Building, GE Building, and Citigroup Center. Manhattan is connected to the other boroughs by a series of bridges and tunnels. The most famous bridge may be the Brooklyn Bridge because of its brick arches. The New York City subway, a massive mass transit system that mostly runs underground, also connects the island to the rest of the boroughs.\nManhattan, like the other boroughs, has many different neighborhoods, many of which are named for the ethnic communities that first lived there. Some of these neighborhoods include Little Italy, Little Germany, Little Brazil, Chinatown, and Koreatown. One of the most famous parts of Manhattan is Times Square. Times Square is called the crossroads of the world. Every year millions of people gather there on New Year's Eve to watch an illuminated crystal ball drop. There are many theaters around Times Square. Most of these theaters are on Broadway, a famous street considered the home of the American theater industry. Another famous Manhattan street is Fifth Avenue. A part of the avenue features expensive designer stores like Tiffany's. Fifth Avenue is also famous for its Museum Mile."
    },
    {
        "id": "0c718fd8ff6246108a5f0c8ebe93623c",
        "title": "Police Stop",
        "content": "Mike and Maria finished watching a movie at the theaters. While watching it, they ate popcorn and drank soda. The movie lasted about two hours. Mike rather enjoyed it, but Maria did not. They had seen an action film that took place in outer space. Mike loved watching action films that featured big explosions and impressive CGI effects. Maria preferred watching romantic films.\nMike and Maria took turns choosing which movie to watch in theaters. Since Mike had seen the movie he wanted, next time it was Maria's turn to choose. The movie had ended on a cliffhanger. The ending left audiences guessing what happened to the main character. This usually meant a sequel was in the works. The people in the theater slowly rose from their seats as soon as the credits starting rolling down the big screen.\nMike and Maria also got up. Little by little, they exited the theater. There were a lot of people walking around. Mike held Maria's hand so they wouldn't get separated. They threw their trash in the trashcan, and went to the restroom. Mike waited for Maria outside the theater.\nShe finally came out after a few minutes, and they both headed towards Mike's car. The car was parked far away from the theater. It was the only parking spot they were able to find. The movie theater always gets full on the weekend. That day was no exception. Mike and Maria got in the car, and drove away."
    },
    {
        "id": "b115cfb27b7b42dfb1d394b85459e6fa",
        "title": "Jane the Living Doll",
        "content": "There once was a little living doll. She lived inside a doll house that was placed in the corner of a little girl's room. The doll's name was Jane, and the little girl's was Diana. Diana and Jane were best friends. No one else knows that Jane can talk and breathe like anyone else. It was a secret between Jane and Diana.\nJane and Diana would play together every day. Sometimes they would play within the doll house. They liked watching movies, playing hide and seek, and painting. They also liked playing outside with toy cars and drawing with chalk on the ground. Since Diana was far too big and Jane far too small, they could not play hide and seek and run over long distances. Instead they enjoyed playing their own version of hide and seek. When they played, it would have to be inside a small room. Jane was always the one to hide since it was easy for her to do so.\nOne day, it was Diana's birthday, and she had several of classmates from school come over to celebrate. Jane stayed hidden from plain sight in Diana's room. At one point, things became rowdy among some of the boys and girls, and they began to chase each other around the house. Then a few of them entered Diana's room and began invading her things. One of the boys got a hold of Jane who was in her doll house and started to toss and play catch with her among the boys. Then Diana came into the room and took notice of what was happening to Jane and immediately yelled for them to stop. They put Jane back down. Jane was so frightened but relieved to be saved.\n150%\"> \"Get out!\" Diana screamed. After everybody left, Diana lifted up Jane and asked her if she was okay. Diana was happy to see that Jane was in one piece. It would be the last time that Diana would bring anyone over to play. This secret was too great to risk its discovery. Nobody could ever know of Jane the living doll."
    },
    {
        "id": "7534346af4374d2b96616f82d9137378",
        "title": "Helping the Needy",
        "content": "Age doesn't matter when it comes to helping out the needy. Shane is a 9-year-old boy that loves to help out. During a school field trip, Shane's class went to visit a warehouse where people donate food and clothes for the homeless. Shane was inspired by the workers he saw there. When he got home, he told his mom all about his field trip. Shane told his mom that he wanted to go help out.\nA week later, Shane's mom told him the good news. They were going to help out at a local kitchen that gave food to the homeless. Shane got excited. He got his coat and shoes. As Shane and his mom were getting to the local kitchen, Shane saw how all the homeless people were living. He saw the tents in the street and how some people didn't even have shoes. He got sad, and told his mom that he was going to make sure everyone had shoes, food, and blankets.\nWhen they got inside, the manager of the kitchen thanked Shane and his mom for coming down to help. They started serving food to the homeless and everyone that passed by thanked Shane for coming down to help. Shane felt safe and started talking to the homeless people. He told them that he wanted to help them. When they finished, Shane didn't want to leave, but they had to.\nShane told his mom that he wanted to do more. During school, Shane asked his teacher to let him say something to the class. He told them about what he had seen. He asked his friends and his teacher if they had any clothes they didn't wear anymore, so that he could donate them. His friends brought some clothes the next day, but his teacher did something better. She brought her friend, who was a reporter, and ran a story on Shane about how much he wanted to help out the homeless. Thousands of people donated clothes and food. Shane and his mother couldn't believe it."
    },
    {
        "id": "7bee4da9e781486c9c128112bc17a9ac",
        "title": "Amelia Earhart: America's Lost Heroine",
        "content": "There is perhaps no greater mystery in the annals of American history as that of the Amelia Earhart story. Earhart's story is one of controversy, and intriguing. She was an accomplished aviator, the first woman to fly across the Atlantic Ocean solo. She accomplished this during a time when women were not highly regarded in the United States. American women during the 1930s did not have the same advantages men had. There were few employment opportunities. Educated women were a scarcity. Women who did find employment during this era were working as grade-school teachers, nannies, and maids for the most part. Amelia Earhart did a lot to change that perception.\nAlthough Earhart was born into a family that did see financial success, but that success was fleeting. There were times in her life when her family struggled to make ends meet because of poor money management. Earhart was home schooled for most of her life, and she gained her pilots license at an early age. In December of 1920, Earhart's father took Amelia to an airshow in Long Beach, California. This is where she first became interested in flying. After earning her aviator's license, she accomplished a feat that only a few men had ever done: flying solo across the Atlantic. She earned national fame for this and was soon a household name.\nTragically, Earhart was lost in an attempt to fly around the world in 1937. She was never found. The theories about how she met her end are countless. Many think she fell victim to the Japanese prior to the start of World War II. This thinking was rooted in the idea that Earhart was a spy. Other outlandish theories include alien kidnapping, but most likely she had mechanical difficulties flying over the Pacific Ocean. Earhart was either killed instantly, or survived, according to one popular theory, and lived out her days on a deserted island."
    },
    {
        "id": "f264ee078c36469aa31b89310047610b",
        "title": "I Hate Summer",
        "content": "Paul Young and Mark Allen were good friends. They both hated summer. Paul hated that it was always hot. Mark hated that the park by his house was always crowded. \"I hate summer,\" Paul told Mark as they played video games in Mark's room. \"I know. Besides not going to school, there is nothing else that's good about summer,\" Mark said.\nAs the two friends played their game, Mark's mom started getting upset with the boys. \"Why don't you boys go outside?\" Mark's mom asked. Mark replied, \"Too many people, and it's too hot.\" Mark's mom had enough; she unplugged the game and told Mark that they had to go outside and do something else. They decided to go to the arcade, because at least there they could play games and be inside an air-conditioned building.\nWhen they got there, they realized that two of their friends were at the arcade, too. It was Susan and Carol. Paul liked Susan; Mark didn't really like Carol that much, but he agreed to stay with Carol, so that Paul could hang out with Susan alone. \"Don't do anything stupid, Mark,\" Paul said. \"Oh, shut up and go talk to Susan,\" Mark said. Paul went up to Susan and asked her if she wanted to play a shooting game with him. She said yes. After they played the game, they went back to meet with Carol and Mark.\n\"You know, Carol and I were about to leave. You guys want to come with us?\" Susan asked the boys. \"Sure, where to?\" Paul asked. Susan said that they were going to the park, because she liked to see all the people having fun there. \"Awesome, I love going to the park during the summer,\" Paul said. He looked at Mark and whispered, \"Shut up, don't say anything.\" They all left, and Mark looked like he was going to cry. \"I hate summer,\" Mark said to himself."
    },
    {
        "id": "5b97463ff6aa46269fcdc5a7447ec03b",
        "title": "Fires that Changed Cities",
        "content": "Fires are destructive. They also create changes. In 1871 a fire burned most of Chicago to the ground. Many people think the fire was started when a cow knocked over a gas lamp. Most of the city at the time was built of wood. This, combined with the famous Chicago winds and a drought, made the city burn down quickly. The fire lasted for three days. 100,000 people were left homeless, and at least 300 were killed. What was amazing was how quickly the city was rebuilt, eventually becoming the third most populous city in the United States.\nThe Great Boston Fire of 1872 created a property damage of $73.5 million,  more than any other fire in the U.S. history. Most of Downtown Boston and the financial district burned down in the fire that began in a warehouse basement. 30 people died, and thousands lost their jobs and their homes. However, the city was rebuilt in two years. It began enforcing building regulations because of the fire.\nThe 1911 Triangle Shirtwaist Factory fire in New York City caused the fourth highest loss of life from an industrial accident in the U.S. history. 123 women and 23 men, all garment workers and mostly poor immigrants, died from the fire, smoke inhalation, or falling or jumping to their deaths. Child labor was not uncommon. The youngest victims were two 14-year-old girls who worked  in the factory. So many people died because the owners of the factory locked the doors to the stairs and exits. This was to prevent the workers from taking breaks and stealing. As a result of the fire and huge loss of life, many people began protesting poor working conditions. The U.S. Congress passed laws improving factory safety conditions. Women workers also formed a union to fight for better working conditions."
    },
    {
        "id": "045010f4a78f44ecb782525a1692e571",
        "title": "Meg Whitman: CEO and Political Hopeful",
        "content": "One of the wealthiest women in the United States is Meg Whitman, Chief Executive Officer of Hewlett-Packard. Whitman is an Ivy League educated individual who is the fourth richest woman in the state of California, and is listed No. 20 on Forbes list of wealthiest women in the United States. She is a graduate of Princeton University, where she earned her Bachelor's Degree in Economics in 1977. After Princeton, Whitman earned her MBA at Harvard Business School in 1979. She originally wanted to study medicine, but changed majors early at Princeton.\nWhitman has found success wherever she has worked. She began her career working at Proctor and Gamble before joining the Walt Disney Corporation where she served as vice-president of strategic planning in 1989. She also worked for Stride Rite, and Hasbro Corporations. Her biggest success was during a 10-year period working for eBay.\nWhen Whitman took eBay over in 1998, the online auction, and retail business was doing approximately $4 million in sales annually. When she left the company in 2008, the business had grown to an $8 billion giant. EBay went from employing 30 employees in 1998 to employing more than 15,000 during her tenure as CEO at the company. Whitman won several awards for her work at eBay, and Forbes Magazine placed her in the top five most powerful women in the country.\nWhitman is a moderate Republican, who endorsed Mitt Romney's failed presidential campaign in 2008. She ran for governor of California in 2010, but lost to Jerry Brown. She hopes to run for president in the future, and is listed as one of the most likely women to become president of the United States."
    },
    {
        "id": "ca007730576d42e886d843a6b4c4472e",
        "title": "The School Dance",
        "content": "Charles and Richard were known around the school for being troublemakers. They weren't allowed to attend the school dance, because they had gotten caught trying to sneak into the girls' locker room. Although Charles and Richard always got in trouble, sometimes they didn't deserve it. They just had a bad reputation. That's what happens when you have a bad reputation. The school dance was coming up. Charles and Richard had a plan on how to sneak in. They were really troublemakers this time.\nIt was the tradition that before each dance, the school band would perform the school's song. Along with the band, our mascot would come out to dance. Our mascot was a bulldog, but we had both a male and a female bulldogs. Charles and Richard decided to go into the dance as the bulldogs. They convinced the students who were going to be the mascots not to go.\nOn the night of the dance, Charles and Richard entered the gym as the mascots. They were dancing and running around the dance floor as mascots are supposed to do. Then the principal came up to say a few words and introduce the school band. Charles and Richard had a plan though. After the band started playing, they got behind the principal and started carrying him. The principal started yelling, but Charles and Richard didn't listen. They started walking closer and closer to the pool that was on the other side of the gym. Before the principal realized what was going to happen, they let him go directly into the pool. Everyone started laughing. Charles and Richard ran out of the gym quickly. No one realized they were Charles and Richard. Of course, the next day they got caught. They were really in trouble."
    },
    {
        "id": "4947a4fabdd044a9a15e20df0c1a081b",
        "title": "Grocery Shopping",
        "content": "Kim was a housekeeper for a family in Beverly Hills. One morning when she went to work, she found a note from her boss. The note asked her to go to the supermarket and pick up a few things. There was a list of things Kim was supposed to buy. The note surprised Kim. She had only been a housekeeper for a week and had never been asked to go shopping before. Kim didn't even know where the nearest grocery store was.  She also didn't know how to drive. Thankfully the note also told her that the boss's driver would take her to the market. There was also a $50 bill.\nOnce at the market Kim walked through looking for the items on her list. She was confused though. The list read \"one pound of apples\". Kim had purchased one kilogram of apples but never a pound. In her country, they used the metric system. She wasn't sure if a pound was more or less than a kilogram. Kim decided to ask one of the grocery workers. The grocery worker was kind and explained that a pound was about half a kilogram.\n\"I wouldn't worry about it though. Just use the scale,\" the grocery worker. Kim went to the scale and was happy to see that the scales didn't use the metric system she was used to.  Kim weighed a pound of apples and put it in the shopping cart.\nThe next item on the list was a gallon of milk. Kim wasn't sure how much a gallon was. She was used to buying a liter of milk. There was also no way to weigh a liter of milk. She was glad that the milk containers were labeled.  She just wished the U.S. used the metric system."
    },
    {
        "id": "77e9ff4f6212492db5fb4f29bf03667c",
        "title": "Andrew Carnegie: From Rags to Riches",
        "content": "Andrew Carnegie was born in Dunfermline, Scotland on November 25, 1835, to a very poor family. His father was a weaver, and his mother mended shoes to help make ends meet. From these humble beginnings, Carnegie became one of the richest men ever to live in the United States. Carnegie was not only very rich; he shared his wealth throughout his lifetime. It is estimated that Carnegie donated approximately 90 percent of his amassed fortune to charity before his death in 1919.\nCarnegie was one of two children born into a family that shared a living space with another weaver's family. The Carnegies lived in one room, which served as living room, kitchen, and bedroom for the entire family. In an attempt to escape extreme poverty, Carnegie's father borrowed some money, and moved his family to the state of Pennsylvania in search of a better life. Once in the United States, Carnegie found work doing odd jobs until he found stable employment working for the railroads. It is here that Carnegie began to earn his fortune.\nBy 1859, at the age of 25, Carnegie had risen to superintendent of the Pennsylvania Railroad Company. It is here where he began making wise investments. He purchased stock in coal, iron, and oil. He also invested in George Pullman's sleeping cars, which became a big success. By the age of 30, Carnegie was a very wealthy man. he founded the Carnegie Steel Company, which eventually became U.S. Steel.\nThroughout his lifetime, Carnegie stressed education. Even though he was not an educated person, his father emphasized reading during his childhood. Carnegie donated freely to education, and founded Carnegie-Mellon University. Carnegie felt it was the duty of the very wealthy to share their fortune with others. Andrew Carnegie is a true philanthropist."
    },
    {
        "id": "2553bf4251964a21aea29a8024811260",
        "title": "Chuck Yeager: Faster than the Speed of Sound",
        "content": "One of the greatest barriers in existence during the infancy of air travel was the speed of sound. It was considered impossible to build and fly an airplane that could exceed this speed, but that was before the world was introduced to Chuck Yeager. Yeager was already an accomplished fighter pilot in World War II, but his greatest achievement was after the war when he served as a test pilot for the United States Air Force. It was thought impossible to fly faster than sound during that period, and no one knew if a pilot could survive flying at that speed, or how it would affect him if he did survive. That did not deter Yeager, though.\nYeager was born on February 13, 1923 in Myra, West Virginia. He served during World War II as a fighter pilot. He did not start out as a pilot, though. Yeager enlisted as a private who worked as an aircraft mechanic in the old Army Air Forces, where Yeager enrolled into a special program that trained enlisted men to become pilots. Yeager benefited greatly from having superior eyesight. He was considered a natural pilot early in his flight career.\nAs a fighter pilot in the European Theater, Yeager was shot down in France by German fighter planes. He avoided capture, and helped a fellow pilot to safety after that pilot had lost his leg in the crash. Yeager was awarded a medal for his actions. He demonstrated exceptional talent as a pilot and once shot down five enemy fighters in a single day. After the war, Yeager began a new career as a test pilot, where he flew the experimental aircraft Bell X-1 into aviation history.\nOn October 14, 1947, Yeager flew his X-1 faster than the speed of sound. He became the first human being to fly faster than sound, and he went on to break more records during his 60-year flight history. Yeager retired from the army with the rank of Brigadier General, and has won many honors for his contributions to aviation."
    },
    {
        "id": "fbba3abc3fdc4a6b9704cd2ae54bf5a8",
        "title": "Leaving for Work",
        "content": "At precisely6 a.m., the sound of the alarm clock pierces the air. Sandy drags herself out of bed and begins her morning routine with a quick shower. After her shower, she prepares a simple breakfast. Grabbing a clean bowl from the dishwasher, she empties into it a packet of instant oatmeal. She pours in a cup of milk, stirs and heats the mixture in the microwave. While waiting for her oatmeal to cook, she dresses for the day, mindful of the weather.\nFully dressed now, she removes her oatmeal from the microwave, which has now cooled just enough to suit her taste. It is her favorite flavor, apple cinnamon. As she savors each bite, she is reminded of her mother, who always made sure Sandy ate a warm breakfast before leaving the house in the morning.\nChecking the time on her phone, she hurriedly swallows the last few mouthful of oatmeal before heading out. As she steps into the street, a gust of wind blows back her hair. She covers her head with the hood of her coat, tightens the scarf around her neck, and braces for her walk to the train station.\nAfter settling into her seat on the train, memories of her mother stir again. She takes out her phone and texts: \"Hey mom, thanks for the scarf you knit me. It came in real handy this morning. Love always.\""
    },
    {
        "id": "f735112cceb64923b8291b3890a2baf5",
        "title": "Funeral Customs in the United States",
        "content": "America is one of the most diversified countries in the world. It is comprised of many different cultures from Latin America,  Europe, Asia, and Africa. It is truly a melting pot of diversity. All these cultures have come together to create a new culture - an American culture. Many of the traditions, customs, religions, and celebrations of these cultures have been adopted into American culture, including funeral traditions.\nTraditional American funerals are basic. They usually include some sort of religious ritual, followed by a procession to the burial grounds, and a small ceremony at the grave site, but these vary depending on the culture. At most American funerals, the deceased person's family sends out a death announcement called an obituary. These obits normally serve to pass information to others about the deceased, and the time and day of the funeral event. At the church service, the deceased is usually eulogized by friends and family. This is where a person goes up to the front of the crowd to say a few things about the deceased, and how he or she affected their life. The procession usually takes the form of a caravan of private cars, and trucks that follow the hearse, which contains the deceased's coffin, and remains.\nAt the gravesite, another small ritual takes place where the deceased is given a blessing from a member of the clergy. Friends and family are then allowed to say goodbye to the deceased. There is an American tradition of picking up a handful of soil, and tossing it on the coffin as a way of saying farewell to the deceased. The family then gathers at a home, or restaurant with some of the attendees to have a meal, and to exchange stories before going on their way. Most cultures in the U.S. have adopted this traditional American funeral ritual, but many include features that are unique to their individual culture."
    },
    {
        "id": "9d81563d7b164b5fa04d3b53ef6bcae1",
        "title": "Playing Catch",
        "content": "My big brother James has always been a good baseball player. He is six years older than me, but he always invites me to go play catch with him. It's one of my favorite things to do. We live next to a park. Whenever we get bored we just cross the street and start throwing the ball around. The last time we went to the park, we were playing catch and also hitting some baseballs with our bats. Some guys came up to us because they wanted to play a game of baseball. They needed two more players, so they asked us to play with them.\nJames asked me if I wanted to play, and I said yes. The guy's name was Christian, and he introduced us to all the guys. James introduced me and gave the guy our names. I asked Christian if I could play catcher. I always liked playing catcher at school. He said that I could and James got first base. During the game, James got a homerun and I was excited for him. I got on the base twice, but I got out all the time. I was sad, but James told me not to worry and that it happens.\nAfter the game, Christian and the guys told James if he wanted to go grab a drink with them. I thought James was going to go because he likes to drink, but he told them that he was going to take me out to eat. We thanked them for the game and Christian asked James for his phone number just in case they ever needed more players for a game. James gave it to him and then we went to go eat at Jim's Burgers.\nI asked James why he didn't go to drink with the guys. He told me that he knew his responsibilities. I didn't know what he meant, but I was glad he didn't go. Now, we could eat burgers and fries."
    },
    {
        "id": "db764809a7e34504887cfab7efb20341",
        "title": "Franklin D",
        "content": "Franklin Delano Roosevelt was the 32nd president of the United States after first being elected in 1932. He is the only president to serve more than two full terms. His presidency spanned from March 4, 1932 to April 12, 1945. When Roosevelt first took office, the country was in a deep, economic depression called the Great Depression. During his first 100 days in office, Roosevelt passed several economic stimulus bills that were designed to improve the American economy by putting people back to work. His economic strategy was called the New Deal, and the economy improved steadily for four years until 1937 when the U.S. fell into a recession.\nRoosevelt presided over the country during one of the darkest periods in American history - World War II. In the years prior to American involvement in the war, Roosevelt was determined to keep the United States neutral in the great war. Roosevelt offered economic and diplomatic support for its allies such as Great Britain, and China, but all that changed on December 7, 1941. That was the day when the Imperial Japanese Army attacked the U.S. naval base in Pearl Harbor, Hawaii. The attack was devastating, and the U.S. had no choice but to join its allies in the war against Nazi Germany, Japan, and Italy. Roosevelt's address to the nation following the sneak attack is considered one of the greatest presidential addresses of all time.\nRoosevelt served as president until his death in 1945. He had suffered from illnesses during his lifetime, and succumbed to a cerebral hemorrhage during a stay at a hospital. His legacy is firmly in place as the man who took a country with more than 13,000,000 unemployed. By the time he left office, less the 2 percent of the workforce was unemployed. He will always be known as the great leader that guided the country through its darkest hours in history."
    },
    {
        "id": "5493d3fcaac54c8f93bf4749a56dc7d5",
        "title": "Private Schools: An Expensive Educational Alternative",
        "content": "Public schools are available for kids from kindergarten through 12th grade free of charge. However, many families choose to pay for their children's primary and secondary education by sending them to private schools. There are many different types of private schools and many different reasons why parents send their kids there. Some private schools are military type and yet others are boarding schools where students live on campus. Some private schools are affiliated with a certain religion. These schools teach a specific faith's  beliefs and traditions as well as the regular academic subjects. There are schools run by Catholics, Protestants, Jewish people, Muslims, and Orthodox Christians. There are also private schools that specialize in teaching disabled students.\nSome parents choose private schools because they feel that they offer a better education than public schools; others choose private schools because they offer a different type of curriculum. Waldorf Schools, for example, only let children play and use items made of natural materials.\nPrivate schools are also called independent schools or non-state schools because they are not run by local, state, or national governments. They can pick what students to go to their schools. They do this through admission examinations and interviews. There is often an admissions application. Some private schools accept anyone who can pay tuition to send their children there. Some schools charge up to $45,000 a year. Private schools charge tuition because they do not get any money collected from local, state, and national taxes. Some private schools offer a limited number of scholarships to help pay for school. Many of these scholarships are need-based, meaning for students who can't afford the tuition. Other scholarships are offered for students with very good grades or for students that have a talent in a sport or art."
    },
    {
        "id": "1ffaa6b391df44a88dd6ce6b1322e1e7",
        "title": "Marriage Is the End",
        "content": "William Moore didn't trust the idea of marriage. He came from a broken family. His mother and father divorced when he was only 10 years old. Both of his two brothers had been married twice; each marriage ended in divorce. \"Marriage is the end,\" William always said. His view on marriage always got in the way of his relationships. He would go out on dates with women who would always be looking for something serious. William wasn't looking for that. He wanted someone to have fun with and that was all.\nWilliam hadn't found someone he felt strongly about in a long time. The last time he truly felt something for a girl was during his last year of college. Her name was Linda. Linda was in William's math class, and she always helped William with his homework. They started hanging out after school, and going on dates every week. When William told Linda about his views on marriage, she didn't get scared. In fact, she liked the idea. \"It's a lot of pressure. A lot of guys think that women just want marriage, you know, I don't. At least not right now,\" Linda said.\nWilliam decided to give Linda a chance. He liked her. They had the same view on marriage. Yet, during the final month of school, Linda got an email that changed her life. She got a chance to go study in Europe. William didn't want Linda to go. Linda said that it was a once-in-a-lifetime opportunity. William even thought about proposing to Linda to see if she would stay, but he knew that she would not change her mind. He let her go. It made William sad. He didn't know if he wanted marriage, but he really wanted to have someone there for him."
    },
    {
        "id": "65646d16a947408699867032a3f567a9",
        "title": "Going to the Amusement Park",
        "content": "It was Friday morning. Mike and Maria were getting ready for the day. Maria did not have school, and Mike got the day off from work. They had wanted to go to the amusement park for a while now and were finally going to go today. While Maria made breakfast, Mike was taking a shower.\nMaria made French toast with bacon and strawberries on the side. When Mike finished showering, he got dressed and joined Maria for breakfast. \"This tastes delicious!\" said Mike. \"Thanks!\" Maria replied. Mike knew how expensive things can be at an amusement park. He thought it would be a good idea to make lunch to have while there. Mike loved going to amusement parks and sometimes told Maria about them and his experiences.\nMaria had never been to an amusement park. From hearing about Mike's stories, Maria was both excited and nervous about all the big rides. They made several sandwiches, a fruit salad, and fruit punch. They also planned to take cookies and extra money in case of any emergencies or expenses.\nOnce they were ready, they headed out the door and drove off towards the amusement park. When arriving, they paid for a parking spot and headed towards the entrance of the amusement park. At the entrance, Mike and Maria paid for their admission tickets, and entered the amusement park."
    },
    {
        "id": "7ecd3ec4aa464e2ca566e4193ad3425c",
        "title": "Summer Job",
        "content": "It was the beginning of summer. David Lopez's dad wanted him to get a summer job. David had just finished school and was looking forward to enjoying his time off school. He wanted to sleep late, he wanted to play video games, and he wanted to spend time with his friends. David's dad decided that he would get a job for David. When he came home, he handed David a uniform for the Burger Hut. David was sad because he didn't want to work at the Burger Hut. He knew all of his friends went there, and he knew that his friends would make fun of him. David knew that his dad was able to get him this job because the owner was his dad's friend. The owner's name is Michael. David didn't really like him that much.\nDavid had the first day at work. Everyone that worked at the Burger Hut had to wear a hat. David's hat fell into the oil where they made the fries. Michael had to get it out with a big spoon. After a week had passed by, David seemed to be getting used to working at the Burger Hut. Michael was impressed with how hard David worked, and told him he could take a day off.\nDuring his day off, David went out with his friends. They went to the park and played some basketball, and then his friends decided to go get something to eat. David asked them where they wanted to go. They said they wanted to go eat at the Burger Hut. David tried to convince them to go somewhere else, but his friends really wanted to go to the Burger Hut.\nWhen they got to the Burger Hut, David put on his sweater and his hat. He sat down in the far corner of the restaurant, and tried to hide himself from his co-workers and his boss. When his friends got their food, they went to sit down with David. Michael came out and saw David. He went up to him and said, \"You just can't get enough of this place, huh, David?\" Michael chuckled and then left. David's friends took a bite out of their burgers, and looked at David. \"You work here?\" One of David's friend asked. His another friend looked at him and said, \"Can you get me a job?\" David smiled and nervously said, \"I'll try.\""
    },
    {
        "id": "f64302c788224bce9a49f7898a5b507c",
        "title": "Renting an Apartment (2)",
        "content": "Once you find an apartment you want to rent, you need to contact the landlord, the person who owns the property. Most landlords are not individuals anymore, but rather are companies that own a number of properties. You and the landlord will set a date to view the place you are interested in renting.\nOn that date you can see the apartment and ask questions. Some landlords will require you to fill out an application. The application will ask questions about your job, salary, and how many people are going to live with you in the apartment. The landlord wants to make sure they have responsible tenants who will pay rent on time. Some landlords will even ask for references, the names and telephone numbers of people who can verify that you have a job and are a responsible person. Most landlords will also run a credit check. A credit check is your history of paying bills on time. If your potential landlord sees that you owe a lot of money to different companies and don't pay your bills on time, they may not want you as a tenant. If you have bad credit or an unstable work history, you may be required to get a co-signer, that is another financially responsible adult to sign the lease, a rental contract, with you. This co-signer is legally responsible for paying the rent if you stop paying.\nIf you cannot afford a full apartment, another option is to rent a room in someone's home. The process to rent a room is like renting an apartment except you only have a room and usually have to share the bathroom and the kitchen. Most apartments and rooms in the U.S. are unfurnished. You are expected to bring your own furniture, including a bed, a dresser, a sofa, and anything else you need."
    },
    {
        "id": "8dbe932972b74a5784362627ffe22026",
        "title": "Phil Jackson: Winning at All Levels",
        "content": "Phil Jackson is an American basketball coach, and general manager. He used to be a basketball player, and played for several seasons in the National Basketball Association during the 1970s. He played for the New York Knicks for most of his career after being drafted by the team in 1967. He was a top reserve player for the Knicks team that won the NBA Championship in 1973. Because of a spinal injury, he did not continue to play for the team. Jackson was an average player, who found some success in the NBA, but his phenomenal success in the league came as a coach.\nAs coach of the Chicago Bulls, Jackson's teams won six titles in nine years. He was hired in 1987 by the Bulls as an assistant coach, and took over the head coaching job in 1989. Helping him win the titles was Michael Jordan. Jordan is one of the most successful athletes ever to play the game of basketball. Many people claim that Jackson was able to win his six titles because of Jordan, while others point out that Jordan preceded Jackson without ever winning a title. In any event, the duo worked, and the rest is NBA history.\nJackson join the Los Angeles Lakers as coach in 2000. The Lakers were in a similar situation as the Bulls during that time. The team had plenty of talent, but lacked leadership. Jackson, once again, provided that. During his time with the Lakers, Jackson's teams won five NBA titles, nearly matching the Bulls run. Jackson also benefited from having Kobe Bryant and other talented players on his roster, but his success was now firmly cemented in basketball lore. Jackson is currently the general manager of his old team, the New York Knicks."
    },
    {
        "id": "236cf50654354b41ba39e362fb417e1e",
        "title": "Carl Sagan: Visionary Astronomer",
        "content": "Carl Sagan was possibly the most famous American astronomer ever. He was an astronomer, scientist, author, cosmologist, and television host. His landmark show \"Cosmos\" was one of the first science shows to gain acceptance by the general public in the United States. Sagan challenged Americans to think about their place in the universe like no other person before him. Using the scientific method, Sagan challenged long-held beliefs about the genesis of life on earth. This he has done to the enlightened scientific community, and to the anger of the religious community. Many of Sagan's teachings contradict the creationist belief of the beginning of life. He was also interested in the search for life beyond the planet earth, and participated in the only human message sent into space intended for an alien race.\nSagan was born in Brooklyn, New York on November 9, 1934. His interest in science began at an early age. He wrote and co-wrote 20 books, and had more than 600 scientific research papers published. His most popular work was \"Contact\", which tells the story of first contact with an intelligent alien species. The book was made into a movie in 1997 starring Jodie Foster. The book and movie angered many religious groups because of its message that human beings are not alone in the universe.\nSagan earned his bachelor's and master's degrees in physics from the University of Chicago in the 1950s. His scientific curiosity led him into developing the television series \"Cosmos\". It was one of the most watched science series, and has been recreated and is currently on the air. His work on the Galileo project lives on today. The spacecraft is speeding its way through infinite space today with his message of greeting to whatever race of beings finds it. Sagan died at the age of 62 from complications resulting from pneumonia."
    },
    {
        "id": "633fe9d699624fecbdb009beee94ca26",
        "title": "Extracurricular Activities",
        "content": "The importance of a student's Grade Point Average (GPA) cannot be understated. This measure of a student's academic performance is an important factor when he or she decides to apply to a university. It is, however, not the only consideration. One of the most important factors universities look at is the student's extracurricular activities. Extracurricular activities are simply the work students do outside his or her academic studies. These activities can include joining campus groups or clubs; community involvement, organizing or participating in social or politically-themed events, or fundraising for a cause important to that student. Extracurricular activities take many forms, and are important to achieving the student's academic goals.\nOne of the easiest ways to get involved in extracurricular activities is to simply join a campus club. There are many clubs on campus that might interest students. To find a list of the clubs your high school or college has to offer, go to the Associated Student Union, a student government organization, to ask for a list. Additionally, nearly every department has a club associated with it. For instance, the Psychology Department probably has a psychology club. The Engineering Department will also have a club or two. The same goes for Math and English Departments, but there are many more available to choose from.\nCommunity involvement is another good way to show university officials your extracurricular activities. There are countless volunteer opportunities students can engage in, which help both the community and the student. Working with the homeless, or disabled residents of the community looks good on a college application. Getting politically involved with a cause or a specific political candidate can also show university officials your commitment to improving your life, and the lives of others. The more a student is involved in extracurricular activities, the better."
    },
    {
        "id": "29bf7c1f09774177b5821e72ac8ccf47",
        "title": "A Night in Las Vegas",
        "content": "Nancy Scott just turned 21 last October. She was excited about finally being able to go to concerts that were strictly 21 and over. She decided that she would go to Las Vegas for her first concert. Jennifer, Nancy's sister, decided to go along with her because she didn't want her sister to go alone and get lost. Jennifer called her friends Matt and Jake, and they all decided to make the drive to Las Vegas.\nAs they arrived in Las Vegas, they parked their car in the parking lot of the hotel they were staying in. Nancy took a shower, and then Jennifer took one. They got dressed and then met both Matt and Jake in the lobby of the hotel. Nancy was so excited; she asked her sister if she wanted to get a drink. Jennifer agreed and said \"OK, but only one.\" Jennifer bought her sister a giant drink that came in a four-foot tall cup, and she got the same. Nancy couldn't believe how big the drink was. \"It's almost as tall as me,\" Nancy said. Jennifer laughed and took a drink from her cup.\nMatt and Jake arrived first at the place where the concert was going to be. They called the sisters, and told them where to meet them. Nancy was excited to see the concert, because one of her favorite bands was playing. As they got in line to get in, Jennifer went to the restroom. When Jennifer was getting back to her friends and sister, she met one of the members of the band named Jill. Jennifer told Jill about Nancy coming all the way to Las Vegas to see this show, and if she could do something special for her. Jill smiled and said sure. She reached into her purse and gave Jennifer four backstage passes. Jennifer hugged Jill and said thank you. Jennifer ran back to Nancy, and told her to close her eyes. When Jennifer told Nancy to open her eyes, she was holding up the backstage passes in front of Nancy. Nancy began jumping up and down with joy."
    },
    {
        "id": "2341a8d8ebb841f2922aff279a26b111",
        "title": "Summer Programs for Kids",
        "content": "School was over for the year. This meant that the school's after-school program, which kept Adriana's daughter June in school until she was done with work, was also over. The after-school program was convenient because June didn't have to leave the school. Adriana didn't have to worry about her daughter being home alone. The after-school program also made sure that June did her homework. This made Adriana's job as a single mother so much easier. All she had to worry about when she picked her daughter up from school was dinner.\nOne of the best things about the after-school program was the cost. It only cost 30 dollars a month. The school did not offer a summer program. Adriana did not have a summer vacation from work so she needed to find a program that would watch June while she was working. Hiring a private babysitter was too expensive.\nAnother mom from June's school gave Adriana information about a local recreational center that was offering a summer program for school-age kids. The program was not as expensive as other summer camp programs, but was more expensive than after-school cost though. The summer program cost 50 dollars per week. Adriana didn't know how she could afford the program.\nJune didn't understand the sacrifices her mother had to make for her. She was just excited to attend the summer program. She had never been in summer camp before. June was especially excited because her friends would be there with her. Sometimes summer was boring especially since her mom worked all day. June heard there would be games and crafts. She was going to make something nice for her mom to thank her."
    },
    {
        "id": "7abb771ab55348238a142331bee41ea3",
        "title": "Cruising the Boulevard",
        "content": "Steven Baker loves his car. He owns a beautiful 1977 Chevrolet Corvette that he bought many years ago. Steve, as he is known to his friends, got a great deal on the car. He bought it from a guy who was the original owner. This is the best possible situation a used car buyer can find. The car culture in California is unique. Detroit automakers look to California for trends to include into their car designs. Many people in California like lower cars, which make them look sleeker and more streamline. This comes from the practice of cruising the boulevard, an activity that is very popular among people of all ages, especially in Southern California.\nIt was Saturday night in August. Steve gave me a call to see what I was doing that night. \"Hey, let's go cruising, brother,\" said Steve. And of course I said yes. I loved cruising in his car. The girls loved that car. It was a two-seater with a T-top roof that is removable. That night we cruised Van Nuys Blvd., a popular street where lots of young people like cruising. This is where guys can meet girls and vice versa. It wasn't long before we spotted a car load of girls in an old Ford Thunderbird. \"Hey!\" I shouted to the girls as we came up near them. \"Anyone want to cruise with us?\" I said, and to my surprise a couple of young blondes jumped in and we drove away. It was a tight fit, but the girls were small and thin. I was in heaven! Before long, I was dating one of them, and Steve dated the other.\nWe went on a few double dates after that, but Steve and his folks moved away one year later and I never heard from him again. That was a sad day in my life, but at least I had a new girlfriend, thanks to him and his 1977 Corvette!"
    },
    {
        "id": "3c01d7a47e01409b9416ed5c7f5e6bff",
        "title": "Not-so-happy Meals",
        "content": "John is a busy lawyer, whose whole day revolves around two things: work and his two daughters. Balancing the two things often proves to be very difficult, so John spends most of his day in a rush to do everything he needs to do, and get everywhere he needs to be. With such a hectic schedule, it is common to find John and his children in line at a McDonald's drive-thru, waiting for some burgers, fries, and shakes.\n\"I know fast food isn't the healthiest thing I could give my daughters,\" admits John. \"But it's the most convenient thing around when we're in a rush. Plus, it makes them happy.\" Unfortunately, this attitude towards the unhealthiness of fast food is one that so many parents in the U.S. hold, and it is easy to understand why.\nNowadays, nearly every single city in America is equipped with its own McDonald's. In Los Angeles alone, it can sometimes feel like there is one on every other corner when you're driving around. As if this didn't already make it hard enough for parents to avoid, McDonald's targets their famous \"Happy Meals\" to children so that every time they drive by the giant golden arches, children demand to go inside to get a new toy with their meal.\nAlthough it may be very hard for parents to have healthier meal options for their children, doing so is a necessity that this country can no longer ignore. Constantly consuming fast food is becoming a norm in American society and is resulting in millions of people suffering from obesity and diabetes for the rest of their lives. Instead of teaching children that it is okay to give in to the temptation of a quick greasy meal, parents should get their children into the habit of healthy eating everywhere they go. In the end, children will be more thankful for living long, healthy, and happy lives, than for getting a cheap toy in a cardboard box."
    },
    {
        "id": "c0f24a68806d447aa1b9535f8598a499",
        "title": "Trick or Treat",
        "content": "It was Laura's first Halloween in the United States. She had seen many portrayals of the late October holiday on television and in movies. She had to admit she was a little excited and nervous about the day. She was excited to see the costumes worn by kids ringing her doorbell; she was also worried about being scared by the costumes. She had watched too many horror movies.\nLaura was renting a room in a house. Her landlady asked her if she could help with the candy. Laura happily agreed. The sun was just starting to set when the first group of kids in costumes rang the doorbell. \"Trick or treat!\" they said enthusiastically when Laura opened the door. The kids all had open bags. \"I want a treat!\" Laura said and grabbed the candy from each of the bag. The landlady came running to the door. \"No, Laura. You give the kids candy, not taking from them,\" she explained gently. Thankfully, none of the kids were upset. They just looked confused. The landlady suggested that Laura should go out with some friends to a local community Halloween carnival. She would handle giving out the candy by herself.\nLaura went to her room to put on her witch costume. She walked to the local recreation center along with Joe and some other friends. The recreation center was decorated with fake spider webs and filled with artificial fog. \"We're going to egg some houses,\" Joe told her. She didn't know that throwing eggs was illegal. She just thought it was another Halloween tradition.\nA few hours later, the landlady opened the door and found Laura accompanied by police. \"Trick or treat?\" Laura asked, looking embarrassed."
    },
    {
        "id": "bf70b1df72db44e4a8bba5c68532886c",
        "title": "Have Points, Will Travel",
        "content": "Carla moved to San Francisco two years ago. All of her family was in Boston. Every year she tried to visit her family twice. She would go once in the summer and once during the Christmas holiday. Traveling cross-country was expensive though. She needed to find a way to save money on her travel. She decided to try and use an airline loyalty program to see if that would help.\nThere was one airline that Carla preferred to travel on. Every time she used that airline, there were hardly any delays and the trip was always comfortable. That airline featured in-seat DIRECTV, so she could watch her favorite television shows while traveling. She could also order food and beverages right from her seat. An extra perk was that each seat had an electric outlet. This made it easy for Carla to plug in her computer and do work on her trip.\nOn her last trip, Carla decided to sign up for that airline's loyalty program. She would earn points for every trip she made. Those points could be used towards air travel. The airline worker informed Carla that she could earn even more points if she signed up for the airline sponsored credit card. The card had a low interest rate and no annual fee. For every dollar Carla spent, she would earn one point to use towards travel. Carla signed up for the credit card. She had good credit, so she was approved. Carla used that credit card to pay for a round-trip ticket to Boston.\nAfter only one trip, Carla had earned enough points for a free one-way ticket. That saved her almost $500. It felt like traveling for free. Carla decided to stay loyal to this airline."
    },
    {
        "id": "2684e6a544964864882abfc8a12362ce",
        "title": "Halloween Costume Party",
        "content": "\"Did you get your costume done last night?\" I asked my girlfriend Audrey in the early morning of October 31. \"Of course, it was ready, but you're not going to see it until tonight,\" she said. That was a real disappointment. I had been looking forward to seeing her latest Halloween creation. Audrey is a fine seamstress, and every year she makes the best costumes for the Halloween parties we try to attend. On the other hand, I usually just put some old rags on and go as a hobo or a pirate, or something lame like that, but not Audrey. She goes all out. Last year, she went as a beautiful witch complete with the pointy hat and witch's broom. She looked beautiful.\nThe Halloween tradition is very old in the United States. No one really knows how it was first celebrated, but it did come from somewhere in Europe. It was originally called \"All Hallows Eve\", and celebrated on last day of October. It precedes \"All Hallows Day\", which is a day to honor dead relatives. Today, it means parties for the adults and \"Trick or treating\" for the kids. \"Trick or treating\" is where kids also dress up in costumes and go door to door to get candy treats. It's a whole lot of fun.\nSome people say Halloween is a Welsh, or Celtic tradition, while others say its roots are Christian, but it doesn't really matter anymore. We just like to get dressed up like fools, go to parties, and eat lots of candy! Audrey finally showed up at my door. She was strikingly beautiful. She was dressed as a fairy princess and was glowing in her white gown. \"You look amazing,\" I told her. She just laughed and said, \"I know,\" and tapped me with her wand."
    },
    {
        "id": "1d9c174a93804988a8c8114878cda025",
        "title": "Going out to the Movies",
        "content": "Robert Lee and his brothers were excited about the new \"Godzilla\" movie that was coming out. The day the movie came out, Robert and his brothers went to the theater early. Robert's brothers wanted to see another movie first, and then they wanted to sneak into \"Godzilla.\" Robert didn't mind, because he liked going to the movies. When they got to the theater, Robert bought his brothers popcorn, soda, and some candy. When they got everything, they went to find their seats.\nRobert's brothers didn't really like the first movie they watched, but they were excited to see \"Godzilla.\" When they got out of the first movie, Robert went to get more soda and popcorn, because his brothers had finished all of it. Robert's brothers snuck into the theater, and they were waiting for Robert to come back with the snacks. When Robert tried to go back in to see \"Godzilla\", a security guard asked him for his ticket. Robert didn't have one for \"Godzilla,\" so the security guard had to kick him out.\nRobert had to go outside and buy another ticket for \"Godzilla.\" He felt embarrassed, because he had to stand in the line with the popcorn and soda. The people in line and the people who worked in the ticket booth looked at Robert and found him funny. Robert knew that they were looking at him, because they knew he got kicked out for trying to sneak into another movie. His face turned red. He thought about calling his brothers to get out, so that they could go home. Robert thought about how his brothers wanted to see the movie too, and so he bought the ticket and went back in. The security guard looked at him again, and asked him for his ticket. Robert showed it to him, and went into the theater. The security guard laughed."
    },
    {
        "id": "f966210e9cd1453cbbdb8ab8cdcaaa6c",
        "title": "Car Chase Television",
        "content": "Car chases in the Los Angeles area are a fairly regular occurrence. In 2013 there were over 700 car chases. Car chases also have become a source of entertainment. Many car chases are captured on video and broadcast live as they are happening. No one has to wait until the six o'clock news comes on anymore to find out about what happened. People can tune in to their local broadcast television station and see it happening in real time. These car chases are often captured with the help of a news channel's helicopter. The helicopter follows and films the chase through the streets, reporting what streets the cars are passing through.\nPeople like watching car chases for many reasons. They are intense, and filled with drama. A viewer never knows what will happen next. Will the driver give up easily? Does the driver have a weapon? Will the driver get into an accident? Will someone crossing the street get hit? Tune in to find out! Many channels see their ratings soar when they air car chases. They are just giving the people what they want.\nPolice are not always happy with the media covering car chases live on the air. Police worry that people trying to escape enjoy the attention. Police feel that broadcasting car chases encourages people to escape. Police also worry that the attention brings innocent bystanders to the street. Someone could get hurt. The media insists they have the right to show car chases. They feel they are informing the public.\nCar chases happen for many reasons. Sometimes police will chase someone who stole a car. Other times the police may try to do a routine traffic stop. However, the driver with the broken taillight may have a warrant for arrest, so off he drives."
    },
    {
        "id": "32b0ea6d3af5418d991a0f4be909460f",
        "title": "Jonas Salk: The Man who Cured the World",
        "content": "During the early part of the 20th Century, polio was considered one of the greatest health threats in the United States of America. Polio was a vicious disease that took its victim's lives, or left them with major disabilities. In 1952, the U.S. suffered one of its harshest epidemics of polio in its history. More than 58,000 cases of polio were reported that year, and 3,145 people lost their lives. Additionally, more than 21,000 people suffered some form of paralysis that ranged from mild paralysis to extreme cases where people became disabled. Dr. Jonas Salk is responsible for ending that plague.\nBorn in New York City on October 28, 1914, Jonas Salk grew up in modest surroundings. His parents were not wealthy, but they were able to put food on the table, and maintain a roof over their children's head. Salk demonstrated great academic success from childhood. By the age of 13, he was enrolled into a school for gifted children. He was considered a perfectionist by his peers, and succeeded academically in a very competitive environment. In college, Salk opted to go into medical school even though his mother wanted him to become an attorney. After graduating from medical school, Salk began his research on polio, which was considered a scourge of western society.\nPolio had baffled medical science since its discovery in the mid-19th Century. When Salk turned his attention to the disease, there was little hope that anyone could find an adequate cure. Salk developed his vaccine in the early 1950s, and in April of 1955, his accomplishment was heralded in newspapers across the country. Salk became a national hero. His vaccine effectively ended the polio epidemic in the United States and many countries around the world."
    },
    {
        "id": "6dbe27e6bf8641929bdc81827a95df81",
        "title": "New York City - The Big Apple",
        "content": "Apples don't grow in New York City, so that's not why it is called the Big Apple. There are many legends about how the city that never sleeps got its name. One story says that a famous brothel owner named Eve gave the city its name. Another version of history claims the name has its roots in show business with performers calling New York the \"Big Apple\" since it was the best place to get noticed. There is one legend that says the city got its name because of the large number of unemployed selling apples on the streets of New York City during the Great Depression.\nThe term more likely has its roots in horse racing from the 1920's. Prizes were called \"apples\" and a newspaper reporter when writing about races often would call the big prize the big apple. In fact, the \"big apple\" soon was used to mean any big city. In the late 1920s through the 1940s, \"The Big Apple\" was not just a nickname for New York, it was also the name of a song, a dance, and a place to dance and sing. New York City was the heart of the jazz music scene in the 1930's and 1940s. In Harlem, uptown Manhattan, there was a club called \"The Big Apple\". There was also a 1938 short film of the same name featuring black jazz  musicians and dancers.\nIn the 1970s, the city tourism agency began using the term the \"Big Apple\" on purpose. There is even a street corner in Manhattan called \"Big Apple Corner\". One New York City baseball team, the New York Mets, have a big red apple that pops out whenever the Mets hit a home run in their stadium Citifield. While the origins of the \"Big Apple\" nickname are unclear, it seems to be here to stay."
    },
    {
        "id": "bd52c7e5ad3447b7b590a52c6d2b1379",
        "title": "Finding a New Home",
        "content": "Most people in the United States live in several different homes throughout their lifetime. Going from one home to another is a difficult task, but it can be manageable if it's done properly. The best thing to do is to create a checklist for all the different things that must be taken care of when you move from one place to another. Utility bills, which include gas, light, and water, must be transferred from your old place to the new one. Additionally, cable and Internet service companies should be notified if you choose to continue your service with the same company. The U.S. Postal Service should also be notified of your new address so that your mail can be forwarded to your new address without much interruption of service.\nIn addition to getting all your services transferred to your new home, you should shop for the best possible price from a moving company. Moving company rates vary greatly and it could become very expensive to move from one home to another. Some of the factors moving companies use to establish your costs are distance to the new home and the amount of goods that are being transported. Another option would be to rent a moving vehicle and doing the work yourself. This will certainly cut down your costs, but it is a lot of heavy work.\nThe last thing you need to do when moving to a new place is to inform your family and friends of your new address. This is a courtesy for the most part, but it could help you in the long run. Be sure to change the locks on your new apartment or house. You never want to keep the same locks because you never want strangers to have access to your new home."
    },
    {
        "id": "7e841bc446a045c5bca88ccd1b2e9991",
        "title": "Jerry Springer: The Man Behind the Show",
        "content": "Perhaps no other name in daytime variety shows brings out more emotion than Jerry Springer. Springer has been a talk show host for several years on the show that bears his name, the Jerry Springer Show. His show is described as a tabloid talk show because of the controversial subjects covered, and because of the people who appear on the show. Springer does not invite celebrities to his show. Instead, he opts to showcase regular Americans from all walks of life. He is a former politician who served one term as mayor of the city of Cincinnati, Ohio, in the 1970s.\nHis show debuted in 1991 as a politically themed talk show, where he invited celebrities such as Oliver North, and the Reverend Jesse Jackson. The show was designed to mimic another popular daytime talk show, the Phil Donahue show. The show found moderate success, but in 1994, in order to boost ratings, the show transitioned to a more sensational format. In this new format, everyday people were confronted by family members, and friends, about controversial subjects.\nThe show has been highly-rated for decades now, but has also come under fire from many groups who claim the subjects are not appropriate for daytime television. Springer does not shy away from any subject. Guests are confronted about subjects such as adultery, prostitution, homosexuality, and hate group membership. Often, these confrontations become violent, where guests engaged in physical confrontations. The Springer show has spawned numerous copycat shows over the years, but it still out-rates every other show of its kind.\nIn May of 2000, controversy hit the show when a female guest on the Springer show was murdered by her ex-husband after viewing the episode. Springer, his producer, and the network were sued by the woman's children. The suit alleged that the controversial nature of the show led to the murder, eventually though, the suit was dropped."
    },
    {
        "id": "474b216f36bb432aa3b0221d8700e05d",
        "title": "The Parade",
        "content": "The hockey team Los Angeles Kings won the 2014 Stanley Cup, and had a parade last Monday in Los Angeles to celebrate the victory. During the parade, fans from all over California came out to support and celebrate with their favorite hockey team. According to the Los Angeles Police Department, over 200 uniformed officers were sent to the parade to make sure everything went okay. Although the parade went by without a problem, the LAPD's Public Information Officer said that there was an increase in alcohol related arrests than when the Kings won the Stanley Cup in 2012.\nAccording to Christopher Harris, who attended the parade with his family, a lot of people who attended the parade had gone to the bars surrounding the Staples Center, and had gotten drunk before attending the parade. \"I saw one person throw up on the street in front of a policeman. They put him in the back of the police car,\" Harris said. The cheers from the crowd started getting louder and louder as the players from the Kings started passing by.\nRobert Lopez, who attended the parade even though he was rooting for the New York Rangers, said that the Kings fans started getting really annoying. He was pretty sure it was because of the alcohol; everyone seemed pretty drunk. Lopez said that he was glad that he didn't bring his New York Rangers jersey, as he originally planned on, because he said people would have definitely thrown stuff at him.\nA public relations worker for Los Angeles Kings issued a statement for the hockey organization saying that they do not condone people to drink before going to attend the parade. He went on to say that they took the precaution of having the parade start earlier than it did in 2012 so that people didn't have a chance to go get a drink. It seems as if it still failed."
    },
    {
        "id": "3abec26490204c0cbafd7e4b1ac8cad6",
        "title": "Oprah Winfrey: Her Incredible Life",
        "content": "Oprah Winfrey is one of the most successful women in the history of the United States of America. Winfrey was born in a small town in Mississippi in 1954 into a poor family. She is now one of the richest people in the world, and the richest black Americans in the country. She was also named as the richest African American in the 20th Century. Winfrey is known to most Americans through her daytime show called \"The Oprah Winfrey Show.\" Her show is very popular among television viewers because she likes to tackle the tough issues many other daytime TV hosts avoid.\nWinfrey's early life was difficult. She lived with her mother and grandmother at times. While living with her grandmother, she learned to read by the age of three, and had memorized many bible passages. Her mother was an unwed teenager at the time of her birth, and had a difficult time raising her. Winfrey had two half-sisters. One died young as a result of cocaine addiction, and she did not learn about her other sister until 2010. Winfrey also was not certain who her father was.\nWinfrey suffered from sexual abuse from her uncle, cousin, and family friend, and became pregnant at 14. She lost her baby shortly after birth though. Winfrey survived her early years, and at 17 won a local beauty contest before getting her first break in the media industry as a radio newscaster. This was her first step into the media market.\nHer show began in Chicago in 1983, and within a few years, it became the No. 1 daytime, talk show in the country. She has interviewed some of the most famous people in the country on her popular show. Winfrey starred in the movie The Color Purple, and now owns her own production company called Harpo Films. She is a philanthropist who is famous for her generosity, and remains one of the most influential Americans in the country."
    },
    {
        "id": "7164cfce70e74502b27ebe92fc9ac704",
        "title": "Watching Three Movies at the Theater",
        "content": "Betty Gonzalez likes going to the movies. She likes to wait until there are multiple movies she wants to see. She'll usually go early in the day in order to see at least two movies. Betty is proud that her record is seeing four movies in one day. She usually sneaks in snacks to eat at the movie theater. Betty doesn't care if no one wants to go with her; she'll go alone and have fun.\nIt was Saturday morning. Betty saw that there were three movies she wanted to see showing at the theater. Betty got her purse and made herself two sandwiches, bought a soda, got her sweater, and went to the movies. After she had seen two of the movies, she bought a soda and was going to sneak into the next movie. As Betty walked up to the room where the movie was showing, she noticed that a man was checking for tickets. Betty began to get nervous.\nBetty didn't have a ticket, but she really wanted to see this movie. She did not like the other two movies; she knew she was going to like this one, because her favorite actor was in it. The man that was checking for tickets stopped Betty as she tried to pass him. He asked her for her ticket. Betty didn't know what to do. The man was speaking in English, so Betty decided to speak in Spanish.\nShe told the man something in Spanish, and then walked off while she was still talking. The man was confused, and he didn't know what to do. Betty looked like she was mad at the man, so he didn't want to do anything else to get her even angrier. He just let her go through. When Betty got to her seat, her heart was still beating fast. She started laughing. She took a sip of soda and watched the movie in peace."
    },
    {
        "id": "381e12afcb87411cb925be6c364b6e69",
        "title": "Maria's Childhood Friend",
        "content": "A few weeks ago, Maria had met up with a childhood friend. Maria ran into her at a store. Her name was Mary. Mary and Maria had attended high school together. The two were inseparable back in those days. After high school, Maria and Mary went their own separate ways. Maria worked for a couple of years and then decided to go to college. Mary pursued a career in writing.\nMaria regretted not keeping touch with her best friend after high school. She was thrilled to see her when she ran into her at the store. Mary recognized Maria as soon as she saw her waiting in line for the register. The two shared a bit of small talk and decided to get together soon. They exchanged cell phone numbers and said their goodbyes. Then weeks passed by, and Maria, busy with school and her boyfriend, still had not taken the time to dial Mary's number. And then one day she finally did, and Mary answered the phone.\n\"Hello,\" Mary answered. \"Mary, it's Maria calling. Want to have lunch together this afternoon?\" \"Sure! I don't see why not?\" Mary replied. Maria and Mary agreed to meet up at a sandwich shop at two o'clock. Maria looked forward to talking to her old friend again. Meanwhile, Mike was lounging in the living room watching the local news. He noticed Maria was getting ready to leave soon. \"Where are you going?\" he asked, casually. \"I'm going out with a friend,\" she replied. \"This better not be a guy,\" he said, jokingly.\nMaria told him not to worry; that it was an old girlfriend from high school. Maria grabbed her bag and said goodbye to Mike. \"I'll be back in a couple of hours,\" she said, kissing him. She drove her car a few miles to the sandwich shop. She sat down at a table and waited for Mary to arrive. A few minutes later, Mary walked in through the door and spotted Maria sitting down. She walked over to her."
    },
    {
        "id": "93951df6ef8c485fbd03e25db3d0566b",
        "title": "Richard M",
        "content": "Richard Milhous Nixon was the 37th president of the United States, and the only one to resign from office in the history of the country. Born on January 9, 1913 in Yorba Linda, California, Nixon was a Republican Party member who served as vice president under President Dwight David Eisenhower in the 1950s. Nixon ran for president for the first time in 1960, losing to the very charismatic and young Democrat, John F. Kennedy. The 1960 election was one of the closest elections in history. Kennedy went on to become one of the most popular presidents ever.\nDespite his loss to Kennedy in 1960, Nixon bounced back in the 1968 election when he defeated Democrat, Hubert Humphrey in a landslide victory. The country was in turmoil during the 60s. The conflict in Vietnam was raging, the country was reeling from the assassinations of John F. Kennedy, and his brother Senator Robert Kennedy, and Martin Luther King Jr. Nixon's victory indicated the country was ready for a conservative leadership during these tough times.\nNixon won the 1972 election over Democrat George McGovern in another landslide victory, which seemed to establish Nixon's legacy as a great president. Among his accomplishments was to open trade with China, and his promise to end the conflict in Vietnam. However, Nixon would end up resigning from office just a year after his victory.\nIt was discovered that the Republican Party, with Nixon's knowledge, had secretly recorded the Democratic headquarters at the Watergate Hotel in Washington D.C. during the weeks leading up to the election. Nixon tried to cover up the scandal, but the pressure was too great. Nixon was forced to resign in disgrace rather than be impeached from office, which means to be removed from office by the U.S. Congress. He became the first president ever to quit while serving in office."
    },
    {
        "id": "053d5a17340d41b886d5c21feae820b6",
        "title": "Hungry Abel",
        "content": "one day, Abel opened his refrigerator and gasped when he noticed there wasn't anything in there. \"Who ate all the food?\" Abel asked his brother Mel, who was in the living room sitting down on the couch watching cartoons. \"You probably woke up in the middle of the night and ate it all!\" Mel humorously responded. Abel was not amused. His stomach was growling and he had no time for Mel's childish quips. \"I'm so hungry! I could eat a horse!\" Abel proclaimed. \"I bet you can easily eat two,\" Mel jokingly said. \"You are so funny,\" Abel sarcastically replied.\nAbel thought of ordering a pepperoni pizza by phone, but soon realized he had only five dollars. He needed ten dollars to make the purchase. He was short by five dollars. Abel asked his brother if he could pitch in for the rest, but he had no cash. \"Are you even hungry?\" Abel asked Mel. \"I already ate,\" Mel said. This made Abel jealous and a bit angry. \"What did you eat?\" Abel inquired, with furrowed brows. \"A ten-dollar Pizza,\" Mel casually replied. \"You must be kidding,\" Abel said, almost yelling. Mel just sat there watching a recording of an episode from The Simpsons.\n\"When is mom coming back?\" Abel asked Mel. \"I don't know\" he replied. Abel could now only hope that his mom would come to the rescue and bring a large fresh pizza from Pizza Mountain. Abel plopped down next to Mel on the couch and started watching television with him. They both laughed out loud at the cartoon's funny characters. Abel was enjoying himself so much that he had forgotten that he was hungry. Then commercials began playing. Abel's stomach started calling for food again. \"I'm going to starve to death,\" Abel said, as the front door to his house started opening. \"I'm back, and I brought pizza!\" Abel's mom said as she came in through the door. Abel could not wait to get his hands on the pizza."
    },
    {
        "id": "4fec7aa1a6c2469eb7eb025b780ddb0a",
        "title": "A Housewarming Party",
        "content": "A housewarming party is a special party to be held when someone buys or moves into a new apartment or house. The person or people who bought the property or moved are the ones who throw the party. The party is an opportunity for friends and family to congratulate the person on the new home. It also gives people a chance to see what the new home looks like. It is an opportunity to fill the new space with love  and hopefully presents.\nIt is traditional to bring a gift to a housewarming party. Some people register a list of items they want or need for their new home at a local store or stores. Some common items people will put on a gift registry include kitchen tools like knives and items like curtains. Even if there isn't a registry, a good housewarming gift is something to decorate the new house with like a piece of art or a plant. You can also bring food or drinks to share with the other guests. This is often appreciated since at a housewarming there isn't a lot of food served, usually just appetizers or sandwiches. There are usually no planned activities like games at a house warming party. The host or hostess of the party will, however, probably give all the guests a tour of their new home. Sometimes, because a housewarming party happens shortly after a person moves into their new home, people may be asked to help unpack boxes. This isn't usual though.\nHousewarming parties get their name from the fact that a long time ago people would actually bring firewood to a new home as a gift. This was so that the person could keep their home warm for the winter. Now most homes have central heating and don't use fires to keep warm."
    },
    {
        "id": "352133918c524b4193135337684c880b",
        "title": "A Day at the Library",
        "content": "Claudette's dad didn't let her have a boyfriend. He told her that 12-year-olds aren't supposed to have boyfriends. Claudette always wanted a boyfriend, but didn't want to get her dad mad. She would always go to the library after school to study and wait for her dad to pick her up. One day, a boy named Steven decided to go up to Claudette and say hi.\n\"Hello, my name is Steven. I've seen you here before,\" he said. \"Oh, hello. My name is Claudette. I always come here to study and wait for my dad. I live a bit far,\" she said.\nSteven asked Claudette if he could sit with her, so he didn't have to study alone. Claudette said yes. They started studying and started talking. Soon they weren't studying at all. They began talking about music, books, movies, and what they liked to do for fun. Steven had to leave before Claudette's dad came to pick her up, and he asked her if she would be back tomorrow, so that they could study together again. Claudette said yes.\nThe next day, Steven showed up and saw Claudette. He sat down and she smiled at him and said hello. They began talking about their classes, and what they were learning at school. After they talked for an hour, Claudette told him she had to go look for a book, and if he could go with her. Steven agreed, and went to look for the book with Claudette.\nAs they were looking for the book, Claudette was in one aisle and Steven was in another. Claudette took out a book and saw Steven was looking at her. She smiled and he told her she was beautiful. She was happy he said that, because she really liked him. Claudette asked him if he wanted to be her boyfriend. Steven said yes. As they were hugging, Claudette's dad came in and saw them. He split them up and took Claudette by the hand. He told Steven that he wouldn't be able to see her again. Steven was sad."
    },
    {
        "id": "02c6e89e8b6e4b378065f93509bbb5a5",
        "title": "Johnny's Long Hair (1)",
        "content": "\"When are you going to get a haircut?\" Johnny's relatives would ask whenever they saw him. Johnny's reply was always the same, \"When pigs start to fly.\" Although Johnny was aware that his relatives thought he was funny, he was also aware of their concern regarding his long shoulder-length hair. Johnny's hair was black and wavy. He began growing it after high school. Two years had passed since then, and Johnny had no intention of cutting it anytime soon.\nJohnny loved his long hair, and took good care of it. Every day he would wash it and brush it fifty times. Johnny felt so cool with his long hair. It made him look like a rock star. While in high school, Johnny always had short hair. Although it did not look unappealing, he was not too fond of his short hair, and desired to grow it out one day. He made a promise to himself to do so after graduation. Johnny had gone through with his promise.\nJohnny's hair received plenty of attention. As he walked down the street, he often heard \"Nice hair kid,\" from strangers. \"Thank you very much,\" Johnny would reply, feeling flattered. Once, Johnny passed by a group of girls who giggled and looked at him. \"I like your hair,\" one of them said to Johnny as he walked away. Being the cool cat that he now was, Johnny loved every minute of having long hair.\nJohnny wondered why he didn't decide to let his hair grow sooner. It was the best decision he had ever made, and nothing in the world could make him cut it."
    },
    {
        "id": "8562ddbffd7c442bad613ed3c3e467ff",
        "title": "Memorial Day - A Holiday to Remember Fallen Soldiers",
        "content": "Memorial Day is a United States holiday to remember the men and women who have died while serving in the armed forces. The armed forces include all branches of the U.S. military. Those branches are Army, Navy, Marines, Air Force, and Coast Guard. Memorial Day is a federal holiday, which means government offices, banks, post offices, and schools are closed. Memorial Day is always observed on the last Monday of May. Memorial Day has its roots in the U.S. Civil War when a holiday, Decoration Day, was established to honor both Union and Confederate soldiers who died. On Decoration Day people used to \"decorate\" the graves of deceased soldiers with flags and flowers. The name Memorial Day became more widely used after World War II in the late 1940s. However, the holiday wasn't officially called Memorial Day until 1967.\nMemorial Day is commemorated by ceremonies in cemeteries across the country. The most well-known one is held in Arlington National Cemetery near Washington D.C. Arlington is a military cemetery, meaning only military personnel are buried there. Volunteers place U.S. flags on military graves at Arlington and other national cemeteries. There are also parades in honor of fallen service people held in different towns and cities. Another Memorial Day tradition is flying the U.S. flag at half staff until noon, meaning it is flown at half its normal height. This is considered a sign of mourning. The flag is raised to its full height after noon as a sign that the military will rise up despite the loss. There is also a national Memorial Day concert that takes place on the lawn of the U.S. Capital.\nMemorial Day is also known as the unofficial start of the summer season. Many beaches and pools open up for Memorial Day weekend. Many people also host barbecues on Memorial Day weekend."
    },
    {
        "id": "01cc44d00f6748aa9492c7101eb8d830",
        "title": "Beyonce Knowles: Beauty and Talent Personified",
        "content": "Beyonce Knowles is an American singer, songwriter, and performer, who was born in Houston, Texas in 1981. She is one of the biggest female stars on the American music scene today. Knowles began her singing career in her hometown of Houston as a child. She was encouraged by her parents to cultivate her musical talents, and her parents are still a big part of her life. Her father serves as her personal manager, while her mother designs many of the costumes she wears on her concert tours, and in her music videos.\nShe first found fame as a member of the R&B group Destiny's Child, which was one of the most popular girl groups in the history of American music. Beyonce began her solo career during her time with Destiny's Child. After their break-up in 2005, the artist went completely solo. She found instant success in the music industry because of her unbridled enthusiasm for her work. She is a tireless worker, and a talented musician. Knowles is also one of the most beautiful women in the music industry.\nBeyonce won her first award at the age of seven while in elementary school. By the age of eight, Beyonce, along with two childhood friends, auditioned for an all-girls group. The group won the competition, and was featured on \"Star Search\", a popular, American talent search show of the time. Although the group did not win the Star Search competition, Beyonce and the original members of Destiny's Child had their start.\nSome of Beyonce's biggest hits were Deja Vu, Irreplaceable, and Beautiful Liar. She has won many awards, including nine American Music Awards, 16 BET Awards, and 18 Billboard Music Awards. In all, Beyonce has won more than 262 awards, and has been nominated for 361."
    },
    {
        "id": "9aafe3d012884951831115e8e551cd0a",
        "title": "Mark Twain: A Great American Author",
        "content": "Samuel Langhorne Clemens, best known as Mark Twain, is an American author and humorist. He wrote two of the most significant novels, The Adventures of Tom Sawyer, and Adventures of Huckleberry Finn. He grew up in Hannibal, Missouri, which provided the settings for his novels.\nClemens held a variety of odd jobs as a young man. He was a journalist, miner, printer's apprentice, and typesetter, but journalism was what he liked doing best. His writing style earned him praise from critics worldwide. William Faulkner, another great American author, called him \"The Father of American Literature.\"\nTwain was already a very successful writer when he wrote The Adventures of Tom Sawyer. The main character Tom Sawyer was based on his own experiences as a child. His best friends were also based on real-life friends Twain grew up with. Huckleberry Finn, the main character of his finest work, was also based on a childhood friend.\nTwain was a prolific writer who penned several books, and other publications. Most of his writing was taken from his life in the western part of the United States while traveling with his brother Orion. He was born Christian, but later in life questioned his faith, and developed negative feelings toward organized religion. He was once quoted as saying, \"If Christ were here, now there is one thing he would not be - Christian.\" Twain died in 1910 from a heart attack at the age of 74."
    },
    {
        "id": "ef4f1cd387554514a2b1219e279b1a3c",
        "title": "The Titanic",
        "content": "One of the world's greatest tragedies was the sinking of the luxury liner Titanic. Although it was a British ship, many Americans were on board during that terrible night of April 15, 1912. The ship was on its maiden voyage on that night when it struck an iceberg in the deep waters of the North Atlantic Ocean. The ship was in route to New York City from Southampton, UK when it hit the iceberg, killing more than 1,500 of the 2,224 passengers. The ship was the largest ship ever built to that date, and was thought to be unsinkable.\nThe ship's passengers varied from some of the richest people in the world at the time, to thousands of immigrant workers who were trying to find work in the United States. The Titanic was equipped with technological safety features like remote control watertight doors, and watertight compartments, but it did not carry enough lifeboats for all passengers. Because of the immense size of the ship, it was thought to be unsinkable, a fact that contributed to the small number of lifeboats carried on the ship. Additionally, many of the lifeboats were not filled to capacity when they were launched, causing more loss of life.\nMost of those killed that night were men. The protocol followed by the ship's officers required \"women and children first,\" when loading lifeboats. The accident was met by international shock and grief. Many of today's maritime rules were put into place because of this disaster. Only 705 passengers floating on lifeboats were saved that night. The ship broke into two parts before it went under. It remains more than a mile deep in the North Atlantic. The sinking of the Titanic has been documented in film and literature over the years."
    },
    {
        "id": "9eaf519d6a404691be55dbb3eaa9f9b5",
        "title": "Mario's First Car",
        "content": "When Mario was 19 years old, he bought his first car. It was a brand-new 1985 Toyota Corolla. He was on top of the world! It was beautiful, and was really fast and fun to drive. Living in Southern California without a car is not a good idea. The region is so spread out that it could take hours getting from one part of town to another if you use public transportation. You are not anyone in Los Angeles if you don't have a car, or at least that is what some people say.\nBefore that, Mario had never owned or bought a car in his life. His father warned him about the sales people. \"Don't ever pay the asking price, son,\" he said. Mario looked at him with disbelief. \"What do you take me for, dad? I am not an idiot. I know not to pay the first offer,\" he screamed back. His dad offered to go with him to the car dealer, but Mario wanted to go alone. It was his money and his car, and he was determined to do this alone.\nWhen Mario got to the car dealer, a nice man came up to him and asked if he wanted to take the car he was looking at for a test drive. Mario said, \"Yes, of course.\" So they went for a drive. Mario fell in love with the car and the salesman knew immediately that he was going to make some money. It turns out that you should never let a salesman know you're interested in anything you want to purchase. Mario didn't know how to negotiate and wound up paying too much for the car. He really didn't care, though. He owned his first car. When he told his dad what he paid for it, he thought his dad was going to be mad, but he just said, \"That's okay, son. That same dealer ripped me off when I bought my first car, too.\""
    },
    {
        "id": "b4227430faae413f830a81f52cb6a084",
        "title": "Should I Rent or Lease?",
        "content": "Getting into a new place to live is a very exciting time. This is especially true if the person looking for a new home or apartment is a first-time renter. Having a place to call your own gives you a great feeling of independence. The question that arises when looking for an apartment or home to live in is, \"Is it better to rent or lease.\" Both options have advantages and disadvantages. The best way to go about making this decision is to base it on your own personal situation.\nRenting is a simple process that usually does not require the person to stay in that space for a specific length of time. In California, and in most states, this is called a month-to-month rental agreement. A landlord will generally require the new renter to pay two months of rent in advance. The property owner is also likely to ask for a security or cleaning deposit, or both. The advantage of a month-to-month rental is that the renter can get out of the agreement by simply giving the owner a one-month notice to vacate. The same applies to the owner. If the owner asks the renter to leave, all he or she has to do is to ask the renter to vacate in 30 days.\nA lease works a bit differently. It's usually signed for one year, so both the renter and the landlord agree to a pre-determined length of time the renter will occupy the unit. The renter signs a contract agreeing not to move out of the home for the one-year period. After that, it works much like renting. There are consequences on the part of both parties if the lease is terminated early though, so it is better to wait your lease out than to terminate it early."
    },
    {
        "id": "c6d373b6a5994d9f83737ddea1501b67",
        "title": "Drive on the Right Side of the Street",
        "content": "Unlike many countries in the world, the United States traffic flows on the right-hand side of the road. This may cause some confusion for persons who come from a country that drives on the left. The tradition of driving on the right goes back to before the advent of the automobile. The first law enacted to require people to drive on the right was passed in the city of Philadelphia in 1792. Cities throughout the country soon followed, and the tradition became common.\nIn addition to driving on the right, most Americans use various lights installed into vehicles to signal other drivers of their intentions. The most used lights on a car are the headlights, high beams, turn signals, emergency flashers, and backup lights. Headlights and high beams are used in night driving. It is illegal to drive with high beams constantly on because they can blind drivers driving in the opposite direction, but headlights are required at all times after dark. Turn signals let other drivers know you are about to make a turn to either the right or the left. These signals should be used every time a vehicle is about to make a turn.\nEmergency flashers are continuously blinking yellow lights that drivers use when their vehicle is disabled, or they are experiencing an emergency. Backup lights are white lights that come on whenever the car's transmission is put into the reverse mode. These lights help the driver see what's behind them when backing up. All of these signal lights are important for the safe operation of a motor vehicle. By using these tools properly, a driver can make driving for all people a safe and enjoyable experience."
    },
    {
        "id": "0e8fe10a4f2b413595bb975f5ed41a9a",
        "title": "Johnny's Long Hair (2)",
        "content": "Johnny enjoyed walking around with his long black hair. He also enjoyed the attention strangers and friends would give him. Strolling down the street was never the same after he started doing it with long hair. Johnny never wanted to cut his hair short ever again. He could think of no good reason to do so. This would all change with one conversation on a Saturday morning while having breakfast with his parents.\nIt seemed like any other regular Saturday morning at Johnny's house. Mom was cooking pancakes; dad was reading the newspaper; Johnny was waiting, sitting at the table drinking some orange juice. \"Johnny, it is time for you to get a job,\" Johnny's dad said all of a sudden, without any warning. Johnny nearly spit out his orange juice after hearing his dad's startling remark. \"What?\" Johnny said after gulping.\n\"There comes a time in every boy's life when he must finally cut his hair and get a job,\" Johnny's dad told him. \"But, dad!\" Johnny said, trying reasoning. \"No buts,\" Johnny's dad snapped. That afternoon Johnny's parents took him to a barber shop to get a haircut. He tried his best to hold back his tears on the way to the barber shop.\nJohnny reluctantly sat down on the barber's chair wearing a frown on his face. \"Why the long face?\" asked the barber. \"He doesn't want to get a haircut,\" Johnny's mom replied. \"It's just hair. It'll grow back one day,\" the barber said, trying to cheer him up.\nJohnny reluctantly sat down on the barber's chair wearing a frown on his face. \"Why the long face?\" asked the barber. \"He doesn't want to get a haircut,\" Johnny's mom replied. \"It's just hair. It'll grow back one day,\" the barber said, trying to cheer him up."
    },
    {
        "id": "19ebf51fe0cc4bb1a0032e9f292d2b98",
        "title": "Fires that Changed Cities",
        "content": "Fires are destructive. They also create changes. In 1871 a fire burned most of Chicago to the ground. Many people think the fire was started when a cow knocked over a gas lamp. Most of the city at the time was built of wood. This, combined with the famous Chicago winds and a drought, made the city burn down quickly. The fire lasted for three days. 100,000 people were left homeless, and at least 300 were killed. What was amazing was how quickly the city was rebuilt, eventually becoming the third most populous city in the United States.\nThe Great Boston Fire of 1872 created a property damage of $73.5 million,  more than any other fire in the U.S. history. Most of Downtown Boston and the financial district burned down in the fire that began in a warehouse basement. 30 people died, and thousands lost their jobs and their homes. However, the city was rebuilt in two years. It began enforcing building regulations because of the fire.\nThe 1911 Triangle Shirtwaist Factory fire in New York City caused the fourth highest loss of life from an industrial accident in the U.S. history. 123 women and 23 men, all garment workers and mostly poor immigrants, died from the fire, smoke inhalation, or falling or jumping to their deaths. Child labor was not uncommon. The youngest victims were two 14-year-old girls who worked  in the factory. So many people died because the owners of the factory locked the doors to the stairs and exits. This was to prevent the workers from taking breaks and stealing. As a result of the fire and huge loss of life, many people began protesting poor working conditions. The U.S. Congress passed laws improving factory safety conditions. Women workers also formed a union to fight for better working conditions."
    },
    {
        "id": "af4711bab2914e02ad69800111a6f4d7",
        "title": "Woodstock: Defining a Generation",
        "content": "The Woodstock Music and Art Fair, commonly called Woodstock, was an American music and art celebration that took place from August 15  18, 1969. It was billed as \"3 Days of Peace and Music,\" and was a defining event for the young generation of Americans of the time.\nThe 1960s was an impactful era in American history. Many of the events that took place during those controversial 10 years profoundly affect modern American society today. The war in Vietnam was raging in the 60s, and the popular president, John F. Kennedy was assassinated in 1963. These are just two of the events that defined the decade. There were many more historic events during that era that deeply divided the country. Woodstock was designed to show how the young generation can coexist with the older generation of Americans by living in harmony with one another.\nAlthough the event did not occur in the town of Woodstock, New York, the city has become synonymous with the celebration. More than 400,000 young people gathered at the dairy farm in the small town of White Lake, New York to witness music history in the making. Rolling Stone Magazine listed the event as one of \"the 50 Moments that Changed the History of Rock n' Roll.\" Some of the biggest names in rock history performed at the three-day event, including The Who, the Grateful Dead, Janis Joplin, Jefferson Airplane, and Jimi Hendrix. In all, 32 acts performed at the outdoor festival, and it was free of charge to all.\nTwo soundtracks were released in the following two years. Both albums featured the live performances with introductions. The documentary film \"Woodstock\" was released in 1970, and received an Oscar in the Academy Award for Feature Documentary category. It was also deemed a Culturally Significant, by the United States, Library of Congress."
    },
    {
        "id": "2299723b04c94e21903c1decedba593b",
        "title": "Wedding Day",
        "content": "The day started out like any other. The sun rose in the east, shining its light over the city of Pasadena where Mike and Maria would be getting married later today. Mike and Maria awoke from their slumber, looking at each other with love and joy. They knew what a special day it was. They were expecting it to be nothing less than the happiest day of their lives.\"\nAre you ready for today?\" Maria asked Mike who was still gazing into her eyes. Mike smiled and reached out with his hand to caress his lover's face. \"I was born ready for this day,\" he said, kindly. He got out of bed and jumped into the shower. Maria knew what she had to do, too. But before she could leave the apartment, she also had to shower and eat breakfast. Mike finished showering quickly, kissed Maria on the cheek as she stepped inside the bathroom, and went to the kitchen to fix something to eat.\n\"I love you,\" he said to her. Maria mouthed the same words back to him and smiled. Mike decided to make breakfast for two. Maria soon joined Mike at the kitchen table to eat. They enjoyed a casual conversation about ordinary things, well aware of what an extraordinary day this was for them. Maria and Mike finished their breakfast and said their goodbyes to each other. Following tradition, they weren't to see each other again until the actual wedding ceremony. \"I'll see you later,\" Maria said to Mike as she headed out the door. \"Do you promise?\" Mike asked her before she could walk out the door. Maria turned herself around and nodded ever so nicely. The next time Mike would see Maria, she would be walking down the church's aisle in a wedding dress escorted by her father.\nAnd so, later that day, just before the ceremony began, Mike and Maria's family and friends gathered together to witness their holy matrimony. Mike stood beside his best man and friend, Doug, in front of the seated guests. \"Cannon in D\" began to play as Maria walked down the aisle, looking as beautiful as ever in her snow-white dress. Her high school friend, Mary, beaming with pride, was her maid of honor. Mike's surfer friend, the one he and Maria had met in Malibu, smiled, as the bride walked past him. With tears in her eyes she walked up to Mike who was also beginning to tear up. They both looked at each with love as the priest began to say the words that would unite them together."
    },
    {
        "id": "8aa4fa161c12449e9d4e8ac8206db05c",
        "title": "Jim Carrey: From Homeless to Superstardom",
        "content": "One of the greatest comedic talents alive today is the irrepressible Jim Carrey. Although not an American citizen, Carrey has spent most of his life living, and working in the United States. He has starred in some of the biggest box office hits in recent Hollywood history, and is showing no signs of slowing down. He got his start by doing stand-up comedy in his home country of Canada, but life before then was not easy for the megastar.\nBorn on January 17, 1962 in Newmarket, Ontario, Canada, Carrey's early life was what he described as lower middle class. His father Percy was a musician, who got a job as an accountant, and provided well for the family until he lost his job when Carrey was a boy. That is when Carrey's life changed dramatically. With no steady income, the family eventually lost their home, and was living out of a van. Carrey quit high school at the age of 15 to take a job as a janitor to help support his family. Carrey described himself as being very angry at his situation in life at that time.\nThroughout his childhood, Carrey had his comedy. He began doing his routine in Ontario in small clubs, while moving up to better things. He got a break in 1979 when he became the opening act for famous stand-up comedians Rodney Dangerfield, and Buddy Hackett. His biggest break came when he decided to move to Los Angeles to try to break into the entertainment industry in 1983. His first major appearances came when he landed regular work in the comedy series In Living Color in 1991.\nAfter his successful run on the Fox show, Carrey became well-known, and was in demand.  He starred in hit films such as Ace Ventura: Pet Detective, The Mask, Liar Liar, The Cable Guy, Bruce Almighty, and Batman Forever."
    },
    {
        "id": "d22a4622f646439298cf6c4505aaae3b",
        "title": "Bill Clinton: Popular Modern American President",
        "content": "William Jefferson \"Bill\" Clinton was the 43rd American president, presiding over the country for eight years from 1993 to 2001. He was the third youngest president to hold the office, behind Theodore Roosevelt and John F. Kennedy. Clinton was a very popular president, who led the country during one of the most successful eras in American history. His economic policies contributed greatly to the country's economic strength during his tenure. Clinton is a member of the Democratic Party, and served as governor of the state of Arkansas for two five-year terms. He is credited with overhauling the state's education system during his tenure.\nClinton presided over the longest, peacetime economic expansion in American history. He is married to Hillary Clinton who he met at Yale Law School. Hillary Clinton was Secretary of State from 2009 to 2013, after serving as senator of the state of New York from 2001 to 2009. Additionally, Hillary Clinton is considered one of the top prospects to gain the Democratic nomination for the presidential election in 2016. When Bill Clinton left office in 2001, he enjoyed the highest approval rating from the American public in the history of the United States, but his presidency was not without controversy.\nBill Clinton's presidency was marred by the Monica Lewinsky affair. Lewinski was a White House intern who engaged in sexual activity with the president. Bill Clinton denied any wrongdoing, but his political opponents, the Republicans, pursued Clinton in an effort to damage his reputation and the Democratic Party in general. Republican politicians tried to have Clinton impeached from office and dogged him for years. In the end, Clinton survived the controversy, and completed his successful term as president. Hillary stood by him during the dark times, and the couple remains together to this day."
    },
    {
        "id": "5c294bb261384d3599884260594f08f1",
        "title": "Arnold Schwarzenegger: From Terminator to Governor",
        "content": "Arnold Schwarzenegger is one of the most recognizable celebrities in the United States of America. The Austrian-born star came to the U.S. in the late 1960s when he was an international star in the body-building circuit. Since then, Schwarzenegger has had multiple careers as an actor, politician, and philanthropist.\nSchwarzenegger began weight training at the age of 15. By the time he was 20 years old, he had won the prestigious Mr. Universe title. The professional body-building honor is awarded annually, but this was not his only body-building title on his resume. He won seven Mr. Olympia titles during his body-building career. Additionally, he wrote several books on the subject. His body-building career spanned from 1965 to 1980.\nHis film career began in 1970 when he starred in a little-known movie called Hercules in New York. However, from these beginnings, Schwarzenegger cultivated a long, and successful career as an action movie star in Hollywood. His movies are some of the most popular films to ever show in the U.S. His most recognizable role was arguably as the Terminator in the film series of the same name. Following a long and successful film career, Schwarzenegger, who was always interested in politics, began a political career that culminated with his election to two terms as California's Governor.\nSchwarzenegger was first elected governor in October, 2003, running on a Republican Party platform. He enjoyed moderate success as governor in his first years, but struggled greatly after that. He had many political opponents who cited that he had no political experience, and had won the elections simply because of his popularity. Schwarzenegger's term in office was rocked by sexual misconduct allegations that tainted his political career. He remains a very popular cultural figure in the United States."
    },
    {
        "id": "f6045a8c8f82475f84e598b6736e18cd",
        "title": "Cruising the Boulevard",
        "content": "Steven Baker loves his car. He owns a beautiful 1977 Chevrolet Corvette that he bought many years ago. Steve, as he is known to his friends, got a great deal on the car. He bought it from a guy who was the original owner. This is the best possible situation a used car buyer can find. The car culture in California is unique. Detroit automakers look to California for trends to include into their car designs. Many people in California like lower cars, which make them look sleeker and more streamline. This comes from the practice of cruising the boulevard, an activity that is very popular among people of all ages, especially in Southern California.\nIt was Saturday night in August. Steve gave me a call to see what I was doing that night. \"Hey, let's go cruising, brother,\" said Steve. And of course I said yes. I loved cruising in his car. The girls loved that car. It was a two-seater with a T-top roof that is removable. That night we cruised Van Nuys Blvd., a popular street where lots of young people like cruising. This is where guys can meet girls and vice versa. It wasn't long before we spotted a car load of girls in an old Ford Thunderbird. \"Hey!\" I shouted to the girls as we came up near them. \"Anyone want to cruise with us?\" I said, and to my surprise a couple of young blondes jumped in and we drove away. It was a tight fit, but the girls were small and thin. I was in heaven! Before long, I was dating one of them, and Steve dated the other.\nWe went on a few double dates after that, but Steve and his folks moved away one year later and I never heard from him again. That was a sad day in my life, but at least I had a new girlfriend, thanks to him and his 1977 Corvette!"
    },
    {
        "id": "81622231e23d47df9214d9edc4daabcb",
        "title": "Superstore",
        "content": "For the past month Mark King had been receiving flyers in the mail about a new superstore that was opening up in his neighborhood. The flyers confused him. He had never heard the term superstore before. Later on, he found out that a superstore is a large retail store that sells a variety of products, usually at discount prices. Sometimes superstores are also called big box stores. Many times they are chain stores owned by one company.\nThe flyers all had different messages about the superstore opening. One set of flyers invited him and others to apply for jobs at the store. The jobs paid well and even offered some benefits. Mark thought this was a good thing since he knew many people were looking for work. Another set of flyers included coupons to be used on opening day. The store had many bargains for common items like paper towels, but also for big screen televisions. Mark thought this too was a good thing. It seemed like a good idea to be able to get a variety of things in one place instead of going from one store to another. It would save time and money. Superstores could sell groceries and clothes under one roof.\nAnother set of flyers contradicted the positive messages about the superstore though. Some local residents were organizing a protest of the superstore. The flyers said that the superstore was bad for the community because it threatened the business of smaller stores in the area. Mark thought about Mr. Hernandez who owned a small grocery store down the block. That was where Mark bought staple food items like eggs and milk. He didn't want Mr. Hernandez's store to be closed, but he also wanted to save money."
    },
    {
        "id": "fdb5d66004364efd8ec4af34edcafbb0",
        "title": "Meeting the Neighbor",
        "content": "It was a bright and sunny day in the city of Pasadena. The wind made the trees sway back and forth outside the happy couple's apartment. The neighborhood where they lived was peaceful. Mike and Maria were enjoying a Sunday afternoon in the comfort of their cozy, one-bedroom apartment. Despite having two months living there, Mike and Maria had yet to meet any of their neighbors.\nMaria once brought up the issue to Mike one night. Mike simply brushed the matter aside. He was content being left alone with Maria. He did not feel the need to interact with any strangers. Maria felt otherwise. She suggested the idea of going to their neighbor's house one day and knocking on their front door. Mike thought this was a terrible idea. He did not want to intrude on anybody's time. Maria tried convincing him that a friendly greeting is not intrusive.\nAfter much effort, Mike finally budged. He agreed to go meet the neighbors one day. It was that sunny afternoon on a Sunday that Maria remembered Mike's promise. She reminded Mike of the promise he had made. Since they were not doing anything that day, she told him now would be a good time to go meet the neighbors.\nMike had completely forgotten about the conversation and let out a reluctant groan. \"Do we have to, Maria? How about we do it next week?\" he said. \"No, we could do it today, right now,\" she replied. Maria went to the bedroom to quickly put on her shoes. She came back with Mike's shoes as well and threw them in front of him. He reluctantly put them on. Maria pulled Mike off the couch and dragged him all the way to their neighbor's front door. She rang the doorbell. A man answered the door."
    },
    {
        "id": "76338f6d6e43400e9a444760c58a4c62",
        "title": "Attachment Parenting",
        "content": "Having your kid physically attached to you probably doesn't sound like fun, but an American pediatrician, William Sears, promotes a style of parenting that keeps small children as physically attached as possible. This is called attachment parenting.\nThe idea behind attachment parenting is that if a small baby feels protected and safe by physical contact with their parent, especially their mother, that child will grow up to be a more independent adult. One way parents are encouraged to be close to their babies is by using a sling or a wrap to carry the baby around instead of putting the baby in a carriage. This is often called \"wearing\" your baby. Parents are also encouraged to sleep with their babies. Parents are too big to fit in a crib, so instead parents are told to bring the baby into the adult bed. This is supposed to teach the baby about sleep regulation as well since the baby will learn to mimic adult sleep patterns. This co-sleeping is controversial though. There are concerns that babies sleeping with adults could suffocate, accidentally get crushed, or fall off the bed. There is also concern about sudden infant death syndrome, or SIDS, where babies just suddenly stop breathing.\nAnother marker of attachment parenting is not worrying about spoiling a baby. Many times parents feel that paying attention to a baby's every cry makes them too needy or spoiled. Attachment parenting feels that every baby's cry should be responded to and that the baby should never be left to \"cry it out.\" Instead, the baby should be comforted and crying should be taken as a signal that the baby needs something. Most attachment parents also breastfeed on demand, feeling that not only is this physically healthier, but also promotes a bond between mother and child."
    },
    {
        "id": "2dcb2c07e5644596a512a8d717f53fca",
        "title": "Middle Schools in the U.S.",
        "content": "Once a child finishes 5th or 6th grade in elementary school, they graduate and go on to middle school or junior high school. This school is a separate building or set of buildings. Most students in middle school are between the ages of 10 and 14. The grade system continues in middle school. Middle school usually starts with 6th or 7th grade and ends with 8th grade. While they are less common, some elementary schools go from kindergarten to 8th grade.\nMost students are assigned a middle school based on where they live. However, there are charter, private, and specialized public middle schools that have an application process. The purpose of middle school is to provide a transition period between elementary school and high school. Middle school prepares students for high school life. In middle school students don't stay in one classroom all day with one teacher. Students change classrooms for different subjects and have different teachers for each subject. In middle school some students may even be able to choose some of their own classes, called electives. There is a set of core classes that all students have to take. These include English, math, science, and social studies or history classes. Gym or physical education classes are also required.\nA common feature of middle school is a homeroom, which is a classroom students visit at a scheduled time once a day or once a week. A homeroom teacher takes attendance and makes announcements of things students need to know. The homeroom also helps students feel like there is one common place and one common teacher they see regularly. This is to help with the transition from elementary school to secondary school. Once a student finishes middle school, they have a graduation ceremony and go to a high school assigned to them or a high school they picked."
    },
    {
        "id": "26e50a78bf274d67b96d2f09f1b8e43b",
        "title": "Shopping on Black Friday",
        "content": "Janice was one of those people that loved getting up early for the Black Friday sales stores have after Thanksgiving Day. She loved going to her favorite stores to see what she could get on sale. A friend told her that her favorite store was going to have an amazing sale. They were going to sell an 60-inch television for $300. Janice wanted to make sure she was there early. She went to the store during the night and set up a tent to sleep over night.\nJanice noticed that no one else had showed up when she was getting her tent ready, but she didn't care. She loved being there. She was so excited about the sales that she couldn't get any sleep. At around 3:30 a.m. she finally fell asleep. She set the alarm on her phone to wake her up at 6 a.m., but because she left her music playing when she fell asleep, her phone ran out of battery.\nAt around 8 a.m. a man who worked at the store came out and woke Janice up. She was surprised and asked him what time it was. He said it was 8 a.m. and she couldn't believe it. She went into the store and left her tent behind. She wanted to see if they still had the televisions. Janice saw that they didn't. People started looking at her, because her hair was a mess. She felt embarrassed and went back to get her stuff.\nWhile she was going back home, she noticed another store that was open. She decided to go in, and was surprised to see that they had the television she wanted. It was $500, instead of $300. She bought the television and asked one of the workers if they could take it out to her truck. She went home and asked her brother to help her move the television. Once she got the television into her home, she climbed into bed and fell asleep."
    },
    {
        "id": "e252fd9c6c0d433ead17c211ec98089f",
        "title": "Learning to Ride Bike",
        "content": "It was a hot summer day in Los Angeles. The temperature for the day was about 95 degrees Fahrenheit. Suzie, a little girl, loved sitting on the porch to watch the boys playing in the yard. Today, her friends were riding their bikes up and down the street. The two boys were Joey and Bob, and they were trying to see who could ride their bikes faster. On one race, Bobby got out to a big lead, but Joey was getting closer. Bobby was getting tired and Joey was able to pass him. Suzie was having fun watching them when her mother came outside and asked her what she was doing. Im watching the boys ride their bicycles, Mommy, she said. Then Suzie asked her mom if she could teach her how to ride. Her mom thought about it for a while. She was thinking that Suzie might be too young to learn how to ride, but in the end, she thought it was time for her to learn.\nSuzie was only four years old at the time. She was a little scared at first, but she loved the bike her mother had bought her and was very excited. Her mom held onto the bike as Suzie slowly started to peddle. She gained speed and was having fun when she fell on the sidewalk scraping her knee. Suzie began to cry from the pain, but her mom told her she was okay. After a few minutes, Suzie stopped crying and got back on her bike and started peddling again. She fell a few more times, but didnt cry much after that. She just kept getting up and tried again and again. Suzie was learning how to keep her balance and was riding along when she noticed that her mother wasnt holding the bike anymore. She got scared, but soon realized she could ride a bike all by herself. Suzie was very happy."
    },
    {
        "id": "6f75434efa684358bb8653b9db60e604",
        "title": "The Friendship",
        "content": "Tony was really excited to see his friend Kevin. They had been friends since elementary all the way through high school. When they started college, they both headed their separate ways. Tony wanted to study in electrical engineering, and Kevin wanted to become a doctor. Their career choices led them into different directions, but their friendship was still intact.\nTony and Kevin had been very close friends in elementary. They started their friendship while doing a small painting assignment. When Kevin noticed Tony painting a really nice rocket, Kevin complimented him on it and the two started talking about their interest in other things. What really kept them together at that moment was when Tony acknowledged Kevin's reaction when Tony accidentally dropped his set of paints on the classroom floor. Tony was embarrassed and terrified, but Kevin wasn't hesitant to help him out by cleaning it up.\nGrowing up, Tony and Kevin shared similar interests. When they were in elementary, they both shared a dream of becoming astronauts and flying in spaceships to discover unknown galaxies and unknown life forms. In middle school, they both shared the dream of becoming famous basketball players. Then, in high school, they both had the urge to become famous rock stars.\nIt wasn't always a cheerful friendship. Sometimes, they both fought and shared different views about different things. Despite their differences, Tony and Kevin didn't tear their friendship apart. In moments of grief and doubts, they were there to support each other.\nTony and Kevin have both recently received their bachelor's degree. They have kept in contact up until now, and have decided to get together and catch up on lost time."
    },
    {
        "id": "50e071b531484876a47b90cc16d0ce91",
        "title": "George Washington Carver: From Slave to Inventor",
        "content": "The exact birth date of the American inventor, educator, and scientist, George Washington Carver, is unknown. This is because Carver was born into a state of slavery, and many slave owners did not record the dates their slaves were born. Carver's claim to fame was the development of alternative crops for southern farmers, whose main cash crop was cotton. Cotton farming is hard on the land. It depletes the soil of its richness from over-farming, and leaves the farmland useless after multiple uses. Carver recognized this, and began working on other crops that were more soil friendly.\nHe conducted extensive research, and promoted such crops as peanuts, soybean, and sweet potatoes for small farms in an attempt to improve the farmer's quality of life. By growing these crops instead of cotton, the soil would remain nutritious, and as an added bonus, the crops could be consumed by the farmers to help sustain a healthier diet.\nBorn in either 1864, or 1865, Carver was one of 11 children born to his slave parents in Diamond, Missouri. Tragedy hit his family hard. All 10 of Carver's brothers and sisters died at a young age. When he was just one-week old, Carver, and his mother, and a sister were kidnapped, and sold in Kentucky. The family was aided by anti-slavery sympathizers, and the family was reunited in Missouri. Shortly after that, slavery was abolished, and Carver was encouraged to continue his education. He tried enrolling into a public school in Missouri, but was turned away because he was black.\nEven though slavery was abolished, blacks were still discriminated against. Carver was forced to attend a sub-standard school for blacks only. Carver's struggles in education continued throughout his academic career, but that did not deter him. He graduated from the Tuskegee Institute, and began his crop research shortly after graduation."
    },
    {
        "id": "0d47c3e9d6a441e1b3ee889cc364caf9",
        "title": "Mary, Tom, and Buddy (2)",
        "content": "Mary and Tom became fast friends after their nightly meet-up. Every night at seven o'clock, Tom would pick up Mary at her house and the two would walk Buddy around the neighborhood for about an hour. Mary no longer walked Buddy alone at night, and Tom no longer followed Mary.\nOne night, as they were walking Buddy, Mary and Tom decided to grab a bite to eat because they were hungry. \"Where do you want to eat?\" Tom asked Marry. \"Let's go to Pizza Mountain,\" she replied. \"I don't feel like eating pizza right now,\" Tom said. \"Do you have any suggestions?\" Mary asked. \"How about going back to my house? I'll cook our own food!\" Tom said. Mary thought this was a great idea. The two headed back to the street where they lived and thought about what to cook on the way.\nWhen they arrived, they had decided on making hamburgers. Mary wrote down a list of ingredients they were going to need to make the hamburgers. Tom went to the refrigerator and took out all the ingredients that he had. \"Where are the buns?\" Mary asked when she saw they were missing. \"I'll run to the market and get some hamburger buns,\" Tom said. By the time Tom came back from the market, Mary had prepared the food. All they needed to do now was to put the food between the buns.\nMary and Tom were about to take their first bites into their burgers when Buddy came in through the door wagging his tail and salivating. \"I think he wants a burger,\" Tom said. Mary rose from her seat and made a burger for Buddy. Buddy ate the burger in one bite as soon as Mary handed it to him."
    },
    {
        "id": "eecef40bb6154a508749a90ebd067f57",
        "title": "Online Classes",
        "content": "Barbara dropped out of college 17 years ago when she had her first daughter. She always regretted dropping out. She had been a good student, and enjoyed going to classes in college. However, when she had her daughter, she didn't have time to continue with her studies. She needed to find a full-time job.\nBarbara also regretted dropping out of college because it was hard to find a good job without a college degree. While Barbara was lucky enough to always find work, some of the jobs she had didn't pay well. Most of them didn't offer benefits like vacation pay and health insurance. Barbara was sure that if she had a college degree, finding a better-paying job with benefits would be easier.\nBarbara's daughter was now a teenager. She was beginning to look at colleges. This inspired Barbara to go back to school herself. Barbara wanted to finally get her bachelor's degree. Since her daughter was in high school, Barbara had more time. She didn't have to constantly watch over her daughter. However, even as a teenager, Barbara's daughter still needed to eat and needed clothes, so going to college on a regular schedule was not an option for Barbara.\nBarbara went to the local community college to learn about her options. A college counselor told her that she could take online classes to finish her degree. Barbara was worried that these classes wouldn't give the same credit as a traditional college class would. The counselor told her the credits were the same, and online classes were good for non-traditional students like her. Barbara enrolled and became a student again."
    },
    {
        "id": "9cbaf66b4e4145bb9f0e1d8ce8e3ac94",
        "title": "Working Out in L.A.",
        "content": "One of the major trends happening today in the United States is physical fitness. For many years, Americans led the world in deaths due to heart disease related to obesity. America is a society on the move; so many people do not take the time to eat properly. What happens in a typical day is that Americans turn to fast food restaurants whenever they are in a rush. Some of the more popular fast food restaurants are McDonald's, Burger King, Wendy's, Jack-in-the-Box, Carl's Jr., and White Castle. All these places offer a quick bite to eat at an economical price. However, the quality of the food has been suspected for years.\nThe fitness craze began as early as the 1970s, when people became aware that the fast food giants were serving food that promoted obesity. Coupled with beverage industry companies like Coca Cola, Pepsi, and 7UP, Americans were consuming too much salt in their food, and too much sugar in their beverages. Having realized the problem, Americans began making healthier eating choices. Those companies have also made major adjustments in the food they offer. Today, along with the old menu items such as hamburgers, fries, and sodas, the fast food restaurants now offer grilled chicken sandwiches and salads, too.\nMore Americans exercise on a regular basis these days, which helps promote a healthy metabolism and improve stamina. It also helps control blood pressure and blood sugar levels. Because of the healthy eating and exercise trends going on in America today, death rate has been reduced significantly. Most Americans grew up on fried, greasy food, but more and more people are making the right food choices. Americans are adaptable people."
    },
    {
        "id": "25df9edcdd2d44d29e5372706e3f4051",
        "title": "What are Friends?",
        "content": "Friends make life easier, or at least they should. My best friend's name is Susan. I call her Suzy. Suzy and I would always hang out together. Just to clarify, my name is Michael. Yes, I am a boy, and Susan is a girl. Everyone that knew us always thought we were in a relationship, but that wasn't the case. I loved Suzy like a sister, and she loved me like a brother. Well, I used to think she did.\nIt all started when Suzy got a boyfriend. I was happy for her, because she was sad and lonely. Those were her words, not mine. When she introduced me to Richard, her boyfriend, I tried my best to get along with him. Although I tried my best, Richard didn't seem to like me. Maybe his friends told him that Suzy and I were always hanging around, and they thought we were secretly in love with each other.\nRichard became increasingly jealous whenever my name was mentioned. It started tearing up their relationship. Suzy began to stay away from me. I would call her, go over to her house, or wait for her outside of school, but she was always busy with Richard. She would say, \"Sorry, Mike. I'll call you when I get home, okay?\" I knew it was a lie. Suzy and I haven't spoken in a month. As I knew Suzy had always wanted to go to Las Vegas, so I was going to surprise Suzy by telling her that I was going to take her. However, it seemed that the ship had sailed. I heard Suzy and Richard were going to Las Vegas for her birthday.\nI'm moving on, and I'm hanging out with some other friends. It's not the same, but I guess anyone who chooses a relationship over a friendship was never a good friend to begin with. Yet, I find myself questioning \"What are Friends?\""
    },
    {
        "id": "ede964088d1e4170978a78e8015a5932",
        "title": "Veterans Day - A Holiday Honoring All Soldiers",
        "content": "Veterans Day is an official United States holiday observed on November 11th every year. While Memorial Day remembers those who have died while serving in any of the branches of the U.S. Armed Forces -- Army, Navy, Marines, and Coast Guard, Veterans Day honors all members of the armed forces, especially the living. As a U.S. federal holiday, government offices and schools are closed, and most people have the day off from work. Banks are also closed. If November 11th falls on a Sunday, then the holiday is observed on the following Monday.\nThe holiday was first observed after World War I, which ended On November 11 1918. It was called Armistice Day then and was more about celebrating the absence of war and honoring those that served in that one war. It didn't become known as Veterans Day until 1954 after World War II and the Korean War, when there were many more members of the armed forces.\nMany restaurants offer free meals to veterans on the date. There is always a special ceremony at Arlington National Military Cemetery in Washington D.C. This ceremony involves a wreath being placed over the grave of The Unknown Soldier. Many major cities also hold parades on this date. The U.S. flag is usually flown at half-mast as a remembrance to those soldiers who have died and many ceremonies observe a moment of silence for the same reason. In Canada the holiday is called Remembrance Day. One symbol of the day is the poppy flower. The red poppy flower is said to represent or be a symbol of the blood of soldiers. Many people wear or give out poppy flowers on the day."
    },
    {
        "id": "5bd9ce3094e74a25b07e257b0de7a4aa",
        "title": "Going Back to School",
        "content": "Dennis had always been a terrible student. When he was a kid, his parents sent him to a Catholic school. He didn't know much about the school. Of course he didn't know much about anything when he was 6 years old, but he did know one thing -- all his friends from the neighborhood went to a public school. Dennis was the only boy that went to a private school, and his friends would often tease him about it. \"You're not one of us! You're not one of us,\" they would sometimes chant. He wasn't really alone, though. His friend Patricia also went to the Catholic school, but she was a girl. After a while, they began walking to the small school together every morning. Pat was the first girl friend Dennis had ever had. She wasn't his girlfriend. She was just a friend who happened to be a girl.\nThe nuns at the school were very mean. They ruled the school like it was a prison. Dennis was afraid to even raise his hand to ask a question. His mother was often called into meetings with the principal about Dennis, who would also sit in the office listening to the principal telling his mother how smart he was, but was very lazy. Needless to say, Dennis didn't do well in school and ended up going to a junior college after high school. He didn't do very well there either, and soon dropped out.\nThat all changed after Dennis grew up and started working. He had worked for many years before deciding he wanted to earn a degree after all. Dennis went back to school at the age of 30, and soon was a college graduate with a degree. It turned out Dennis wasn't as lazy as those nuns thought he was."
    },
    {
        "id": "d613077ba5034246a6bd55cc755ac43a",
        "title": "The Big Move",
        "content": "Andrea's big day was finally here. She had been accepted into the medical school of her dream in Boston, and was about to fly there to begin her new life. She had gotten the news of her acceptance two months ago, but had spent all that time so busy preparing for the move that she hadn't had time to realize how nervous she really was. It wasn't until it was time for her to get up from the plane seat that she realized her legs were shaking, her heart was racing, and her forehead was sweating.\n\"Keep calm!\" she kept repeating to herself the whole way to her new apartment. She had worked so hard to get here, and she knew that she had nothing to be afraid of. Still, as she looked out of her new living-room window, the world outside looked much too scary to face. Having grown up on the West Coast her whole life, she was not prepared for how everything looked here. The warm, bright sun that she was so used to seeing out this time of year was nowhere to be seen. Everyone's accents seemed completely unfamiliar, and the people even seemed taller than normal.\nShe decided to stay in the safety of her apartment that night and didn't go outside until it was time for her class the following afternoon. As the professor asked some basic questions to see what level everyone was at, Andrea's mind went completely blank. \"Oh no!\" she thought to herself. \"I'm not even supposed to be here! Everyone knows so much more than me.\" Just then, the professor pointed at her and asked her a question about the functions of the spinal cord. As frightened as she was, the answer was just blurted out of her mouth instinctively. \"Impressive!\" says the teacher. \"You'll do just great here.\" she assured her. As the teacher walked away, one of the pesky giant ants crawled across Andrea's desk. She quickly flicked it off the edge, and then smiled confidently."
    },
    {
        "id": "e823af95e38d492995bfbdaf017fe363",
        "title": "Calm and Relaxed",
        "content": "Anthony was a senior at high school and had a car. Even though Anthony wasn't 21, which is the legal age to buy alcohol, he would occasionally have a drink with his friends. Anthony was excited, because today was his prom day. He had his tuxedo on, and had a flower for his date. He got into his car and went to pick up his friend Jacob, and then to pick up Jennifer, his date.\nWhen they showed up to the prom, Jacob's date and Jennifer went to the restroom. Jacob took out a small bottle of whiskey from his jacket pocket and told Anthony to take a drink. Anthony took some and didn't like it, but he still drank. As Anthony and Jennifer danced, he began to feel dizzy. He was drunk. \"Anthony, are you okay?\" Jennifer asked. Anthony looked at her and laughed. She figured out that he was drunk, and decided to leave with Jacob's date.\nAnthony got mad and decided to leave. He got in his car and left. As he was driving down Mentel Avenue, he saw a police car following him. He got nervous and started chewing gum. Anthony was looking at the police car through his mirror so much that he almost took a red light. When the police saw this, he stopped Anthony.\nThe police gave him a few tests to see if he had been drinking, and Anthony failed them. The police took him away. His father picked him up and they went to talk to a lawyer. The lawyer said that Anthony would have to take alcohol education classes, go to Alcoholics Anonymous, do community service, and pay a fine. Anthony's father said that Anthony would have to get a job as well to pay for the fine. Anthony decided never to drink after that. He said that it wasn't worth it."
    },
    {
        "id": "38be9bf53fa74dfcb3691ef6908dc2ea",
        "title": "Special Education",
        "content": "Emma felt really bad when someone from her daughter Jessica's school informed her that Jessica needed special education services. Emma felt like she had failed as a mother. It was true that Jessica was always delayed when it came to learning to talk and walk. Emma just thought that her child was different. Every child develops at its own rate. Jessica was five years old now, but still was not speaking in complete sentences. Jessica would not be attending a regular kindergarten in a regular school. Instead, she would be attending kindergarten in a special education school.\nWhile this bothered Emma at first, she soon learned to appreciate the school. Jessica had a specialized learning plan called an Individualized Education Plan or IEP. This plan set up specific goals for Jessica, like learning how to feed herself. Jessica also received a lot of individual attention. Instead of her being in a classroom with 20 students, there were only 8 students in her class. All of these students also were delayed like Jessica. In addition, the class had two teacher's assistants to help the classroom teacher.\nThe special education school also scheduled speech therapy sessions for Jessica. Once a day a specialist would come in and work with Jessica to help her practice learning how to move her mouth and tongue and ask for what she needed and wanted. An occupational therapist helped Jessica learn to feed herself and other age appropriate self-sufficiency skills. A physical therapist also came in to help Jessica.\nEmma may have been embarrassed at first that her daughter was in a special education school, but after a year, Emma realized it was the best thing for her. While Jessica still was a little behind other kids of her age, at the end of kindergarten, she was able to attend a non-special education school."
    },
    {
        "id": "bfcf85e292864e96983231443f5b2e52",
        "title": "Martin Luther King Jr.: Civil Rights Leader",
        "content": "Martin Luther King Jr. is one of the most famous Americans ever. He was a pastor, and a humanitarian, but is known mostly for being a civil rights activist. King was the leader of the African-American Civil Rights Movement during the 1950s and 60s. His use of non-violent protest to affect social change was based on his Christian beliefs. King was born Michael King, but his father changed his name in honor of the German reformer, Martin Luther.\nKing lived during the most divisive era in American history. The white and the southern culture in the United States wanted nothing to do with social change during the 60s. Segregation laws were in place that prohibited black Americans from eating at the same restaurants as whites, or to ride in the same section on public buses with white Americans. King led the famous 1955 Montgomery Bus Boycott in reaction to Rosa Park's refusal to surrender her bus seat to a white passenger as was required by law in Montgomery, Alabama at the time.\nKing started his activism while serving as a Baptist minister for the Dexter Avenue Baptist Church. He believed strongly in the Christian belief that loving thy neighbor as yourself, which was a philosophy he used throughout his civil rights years. He was also a great speaker. His \"I Have a Dream\" speech is regarded as one of the most famous oratory in American history. In it, he speaks of how his dream is for white and black Americans to walk together hand in hand as brothers. The speech also declared how it was his dream for all Americans to be judged, not by the color of their skin, but by the content of their character.\nOn October 14, 1964, King was awarded the Nobel Peace Prize for his involvement in combating racial inequality in the United States. He was assassinated in April, 1968, in Memphis, Tennessee at the age of 39."
    },
    {
        "id": "f18ab6a5ae1f4589854a325a402fb672",
        "title": "A Workaholic Dad",
        "content": "David must have been the only kid in America that did not like summer vacation.Every year, between the beginning of June through the end of August, school kids were on vacation. Only to David, summer vacation meant work, work, and more work! His dad was a workaholic. He had two jobs most of the time. He had one job during the day and the other at night, but sometimes he worked on weekends, too. The man had more energy than any persons alive. When he wasn't working on weekends at his third job, he worked at home and that was why David hated summer vacation.\nHis dad was always building something, or tearing something down. If he wasn't tearing down a wall, or adding a new room to the house, he was putting in a new driveway or garage. It was living hell for a 13-year-old kid. While all of David's friends were off playing baseball or riding their bicycles, he was usually hauling bricks or mixing cement. That's what he remembers about his childhood.\nDavid always knew he was in trouble whenever he heard \"Where's David!\" His dad's voice seemed to carry down the street. That phrase could only mean it was time to get to work. Of course David learned throughout the years how to make himself disappear at just the right times, but his dad usually found him anyway. \"But dad,I want to go to the park to play with my friends,\" David would say. \"You can waste time with your buddies some other time. It's time to get to work now,\" his dad would respond. It got so bad that David would intentionally fail classes so he would have to go to summer school. Summer school was for students who didn't do well during the regular school year, but he didn't care. It meant less work. It meant freedom!"
    },
    {
        "id": "f1cef4b994db4a8984dbb1e4e03ac945",
        "title": "The Dentist Will See You Now",
        "content": "Making an appointment to see the dentist is usually one of the smartest decisions a person could make for his or her health. However, for Marek, booking his dentist appointment ended up being one of the worst mistakes in his life. This was because of the fact that the dentist Marek chose to visit was his ex-girlfriend whom he had recently broken up with to be with another woman. This silly mistake resulted in Marek walking out of the dentist's office with all the 32 teeth missing.\n\"I didn't have any reason to doubt her,\" says Marek. \"I mean I thought she was a professional\". Quite on the contrary, his ex-girlfriend decided that this was the perfect chance to get her revenge for having been heart-broken. She gave him a heavy dose of anesthesia, pulled out all of his teeth, and bandaged his whole face up with gauze so that her work wouldn't be noticed until the bandages were all pulled off. \"The bandages are to protect your gums,\" she told Marek, who then left the office, still heavily numbed by the effects of the anesthesia.\nAs the anesthesia wore off on his way home, he could tell something was terribly wrong because he couldn't feel any teeth. One can only imagine the panic he must have felt after uncovering his ex's work under all the gauze. After reporting the event to the police, his ex is now facing the possibility of three years in prison for a doctor's malpractice suit. On the bright side for her, she might be spending those three years behind bars pleased at knowing that her shocking stunt was very effective in terms of getting even with Marek. After seeing that he no longer had any teeth, his new girlfriend broke up with him."
    },
    {
        "id": "99069687d0074a05bc1b91db18b75f24",
        "title": "Paintballing in the City Streets",
        "content": "Scott received a paintball gun and some paintballs from his mom for his 16th birthday. When his mom gave him the present, she told him that she would take him to a paintball range with some of his friends.  The range was in an open field and the company that owned the range provided safety equipment like padding and facemasks. Getting hit by a paintball hurt and could cause serious injury. The paintball range was 20 miles away, and Scott had to wait till the weekend to try out his new equipment. He didn't want to wait that long. He wanted to play with his new toy now.\nWhen his mom was taking a nap, he texted a friend who lived down the block to meet him in front of his house. \"I want to show you what I got for my birthday,\" Scott told his friend. He loaded up the paintball gun with the colored balls filled with brightly colored paint.  He started shooting it at the trashcans that were on the curb. Just then a police patrol car was driving down the street. Scott missed the trashcans and ended up shooting a paintball right at the police car. The police thought they were under attack. Scott knew he had done something wrong and ran inside the house with his friend. Soon a police helicopter was flying overhead, and Scott could hear police sirens approaching his house.\nThe sounds of the helicopter and the sirens woke up Scott's mother. She looked out her window and saw a spotlight right on her house, and three police cars arrived. \"What is going on?\" she wondered aloud. She went to the living room and turned on the local news to see if there was any information about what was happening in her neighborhood."
    },
    {
        "id": "2578d3d78d9c462c95712d3548a1dba2",
        "title": "Pasadena Rose Parade",
        "content": "Each New Year's Day, the city of Pasadena in California hosts a celebration to welcome the year with a series of events that includes the Rose Parade. The parade takes place in the center of the city on Colorado Blvd, and features numerous floats, marching bands, equestrian teams, celebrities, and honorees. It is the most popular parade in the country. It has spawned several other  New Year's Day parades throughout the country. In Miami, it's the Orange Bowl Parade; in New Orleans, it is the Sugar Bowl Parade; in Arizona, it's called the Fiesta Bowl Parade. However, the Rose Parade is the oldest and best parade. Many people like to camp out in tents or in sleeping bags the night before to get the best locations to view the Rose Parade.\nTo brave the cold weather, some people bring portable heaters to keep them warm. It can get into the low 40s at night in Pasadena during the winter, so many people dress warm for the occasion. Food is another big feature at the pre-parade celebration on New Year's Eve. People bring their portable grills to cook their favorite outdoor meals right on the sidewalk. The rich aroma of the grilling food fills the night air, and most people are willing to share their food with other overnight campers. It is fun to sample different dishes from other grillers.\nAs night turns into morning, there is still electricity in the air. People are excited about the start of the parade, which begins at 8 a.m. sharp. The floats are beautifully decorated in flowers, while the dancers and other performers dress in colorful costumes, some of which are made just for the parade. The marching bands come from nearby cities, high schools, and colleges. It is considered a great honor to participate in the Rose Parade."
    },
    {
        "id": "e9a766ecf4184dcdb73847735fa71216",
        "title": "Car Troubles",
        "content": "Mike's car had been his pride and joy from the moment he bought it, shiny and new off the lot. It took him everywhere he needed to be and never failed to do so. It was a nice, black car with four doors, leather seats, and a stick shift for changing gears. Mike was cautious about who he allowed to drive his car. In fact, he hardly let his own fiance, Maria, drive it.\nOne day, as Mike was lounging in the living room, Maria asked to borrow his car. \"Mike, I need to use your car because mine is out of gas, she asked, sweetly. Mike, cautious as he was, was reluctant to lend out his car. He questioned Maria in hopes that she would take back her request. \"Your car has absolutely no gas?\" he said, sounding mildly irritated. Maria assured him that the car had completely run out of gas, and that she needed to go buy a gallon of gas from the gas station.\nMike thought for a few seconds and proposed an alternative solution to his soon-to-be wife. \"Why don't I just go to the station to buy the gas, saving you the trouble of going yourself?\" he said. Maria did not mind this solution and was happy to let her soon-to-be husband go to the gas station for her. She thanked Mike and kissed him goodbye before he stepped out the door. \"Drive safely, Mike,\" she said from the door as he got inside his car. \"You know I always do, honey,\" he cheerfully replied with a smirk showing his confidence.\nMike pulled out of the driveway and made his way to the gas station. He returned thirty minutes later with the gas can in hand. On the drive back, Mike had noticed a noise hed never heard his car make before. Out of concern, he decided to take the car to his mechanic that afternoon. \"Maria, I'll be back. I'm going to the mechanic to see what's wrong with my car,\" he said after handing her the can of gas. Maria, knowing how much Mike loved his car, tried to console him."
    },
    {
        "id": "d9cff15454904e378bf83e15385dcf4d",
        "title": "Vinyl Hunting",
        "content": "Adrian loves to collect vinyl records. He got his first record from his grandpa. It was a record of Louis Armstrong. His grandpa even gave him a record player to play his records. The only thing Adrian didn't like was that he lived in a small town, so there weren't any stores that sold records. His brother told him to try looking on Craigslist.\nAdrian looked on Craigslist for people who were selling records of his favorite bands. He had to look for sellers in the nearest city, and found one. His brother went into the city every week. Adrian asked his brother if he could go with him next time. His brother said yes. The person he found was selling his whole record collection for $200. Adrian was excited and took out the money he had been saving. Adrian's brother told him he had read about bad stuff happening to people over Craigslist.\nThey emailed the guy that was selling the records and told him to meet at a Starbucks. When Adrian and his brother got there, they saw the guy outside of the Starbucks drinking a coffee. He had a box of records with him. The guy told him that it actually wasn't his collection; it belonged to his brother who had passed away. He wanted to sell it to someone who would appreciate them and listen to them every day, like his brother once had. Adrian said that he would play one record a day.\nWhen Adrian got into his brother's car, he started looking through the records. He saw a copy of \"Abbey Road,\" by The Beatles and was happy. When he took the record out, he couldn't believe what he saw. It was autographed by all four members of the band."
    },
    {
        "id": "c38962352eee431cb0a45f44f0fbb870",
        "title": "Community Colleges (2)",
        "content": "These days many people attend community colleges with plans to transfer to a four-year college or university to get a bachelor's degree. It's kind of like a stepping-stone. There are many reasons why people do this. One reason is that some community colleges have transfer agreements with private and state colleges and universities that guarantee admission. Even if a community college doesn't have that agreement of a guaranteed spot in a four-year college, it has articulation agreements with four-year schools. These agreements tell you exactly what classes a student in a community college needs to take in order to be able to transfer. These agreements make sure that students don't waste time taking classes that won't transfer. Most of these classes one needs to take before transferring are general education classes, like math and English.\nAnother reason why many students start their undergraduate degree at a community college is a financial one. A four-year college or university is much more expensive than a two-year college. This is especially true for immigrant students, who don't qualify for financial aid, loans or scholarships. Also community colleges tend to offer more evening classes so they can accommodate people who have to work while attending school. They are also a good option for older students with families, who need a more flexible schedule while taking care of children. Community colleges also tend to be commuter schools, meaning people don't have to live on campus in dorms. Attending a community college means you can still live at home with your parents, which can save the family a huge amount of money.\nIf a student didn't do well in high school, a community college would provide him or her with another opportunity to enter a four-year university. Community colleges offer many classes to help students develop their math and writing skills. When you attend a four-year college, you are expected to have those skills already. Community college will prepare students to successfully graduate from a four-year school."
    },
    {
        "id": "c3595fecb2e94bd6b06871bd4e1d9994",
        "title": "Lottery - A Chance at Millions",
        "content": "In the United States,  43 states, Washington D.C., Puerto Rico, and the U.S. Virgin Islands, all have their own lottery. A lottery is used for states to raise money. Licensed stores sell numbered tickets, or people can pay to choose their own numbers. When you let a machine pick your numbers, it is usually called a Quick Pick. Many people play lucky numbers, numbers associated with birthdates or other important numbers to them. The money earned from selling lottery tickets goes to pay for schools, roads, bridges, and other public services. Once a week or more, a drawing is held where the numbers are randomly picked. If your ticket has those numbers, you could win a cash prize.\nThere are different types of lotteries, such as Powerball, Mega Millions, and Lotto. Powerball and Mega Millions are known for their large payouts. There are also instant lottery tickets that are scratch-off cards. The winnings tend to be less money, but they are extremely popular.\nIn the United States, you can play the lottery, or buy a ticket if you are 18 years or older. If you win, usually you have the option of being paid the entire amount in one lump sum or of being paid smaller amounts over a number of years. Lottery winnings are taxable, meaning the amount you actually get is smaller than the jackpot number. People can buy lottery tickets or play the lottery at many convenience stores. Lotteries are also very popular since they advertise. There are many television commercials, radio commercials, and billboards urging people to play.\nLotteries have been controversial since they are essentially a form of legalized gambling. There is concern that it can lead to people becoming addicted to gambling. There are also illegal lottery games, usually run by some forms of organized crime."
    },
    {
        "id": "71af0796f4964eeb8a16ef47731055a8",
        "title": "The La Brea Tar Pits",
        "content": "There is perhaps no other place on earth like the La Brea Tar Pits in Los Angeles, California. The tar pits are located on Wilshire Blvd in the heart of the city, and offer a snapshot into life in the city of L.A. 10,000 years ago. The George C. Page museum was built around the tar pits specifically to research the ancient attraction.\nLocated in the Hancock Park district of L.A., the tar pits are a continuous flow from deep inside the earth's crust that frequently uncovers prehistoric animals that were caught in the tar. Many of these animals' remains are on exhibit at the Page Museum, and excavation of new fossils is an ongoing process. The site is registered as a National Natural Landmark by the U.S. government.\nIn 2009, the Page Museum, which is part of L.A.'s Natural History Museum, announced the discovery of 16 fossil deposits in 2006 unearthed during the construction of an underground parking garage. A saber-toothed cat, six dire wolves, a bison, horses, giant sloth, and an American lion were among the animals discovered. A nearly complete mammoth was also unearthed at that time. The artifacts are now part of the Page Museum exhibit, and museum officials are certain there are more fossils to be found under the streets of L.A.\nThe museum is a major attraction to visitors to L.A., and is a primary science attraction for schools, clubs and other organizations interested in the past. It is a piece of living history that is in a constant state of change because of new discoveries. It is a good place to spend a leisurely afternoon in the City of Angels, which is open all year round."
    },
    {
        "id": "0397c4004835497988229eb10fd73c93",
        "title": "Father's Day - A Holiday to Honor Fatherhood",
        "content": "Father's Day is a holiday observed in the United States to honor fathers, fatherhood, and other paternal figures like grandfathers, stepfathers, and uncles. It is observed on the third Sunday in June.\nIn the early 20th century there was a mining accident in West Virginia that killed almost 400 men. A push for a day to remember the men killed, who were mostly husbands and fathers, was the start of a push for a national holiday. This was in 1908. It wasn't until 1972, however, that Father's Day was recognized by law as a national holiday. This is due in part to the fact that people were resistant to what they saw as another overly invented holiday meant to just make people spend money. It wasn't seen as a way to remember the dead or to honor living fathers and father figures. People weren't entirely wrong. Organizations representing men's clothing manufacturers put in a lot of money for the holiday to become popular.\nLike Mother's Day, it indeed is a holiday that has become highly commercialized. There are greeting cards to mark the day, and stores advertise gifts for Dad. These gifts traditionally include electronics, ties, and tools. In schools, children often make cards and other gifts. Father's Day is not a federal holiday even though it is widely celebrated. Some of the ways Father's Day is celebrated is with meals, especially barbecues since the holiday falls at the beginning of the summer."
    },
    {
        "id": "7bdce32fb7c14732865dfe0c0c4f42f4",
        "title": "Las Vegas, Nevada",
        "content": "For many years, gambling in the United States was legal only in the state of Nevada. Nevada is a western state that is east of California, south of Oregon and Idaho, west of Utah, and north of Arizona. It is a desert state where little rain falls during the year. It is a little more than 275 miles from the city of Los Angeles, which is where most of its visitors come from. Driving from Los Angeles is about four hours. Las Vegas, which means the Meadows in Spanish, was established by the Mexicans in the mid-1800s. Much of what is now the southwestern part of the United States was then part of the Mexican Empire. The city was a railroad town established in 1905, and the first legal casino appeared in 1931.\nLas Vegas is now a gambling town, where people from all over the United States come to vacation. Its population is under 2,000,000, making it the 30th largest city in the country. Its original population in 1905 was only 5,000. Much of the city's growth is due to the gambling industry. Many states have since legalized gambling, including New Jersey, and California, but Las Vegas remains the No. 1 tourist city for gamblers in the U.S. Today some of its largest and most beautiful hotels include Bellagio, Flamingo, Caesars Palace, Treasure Island, Mandalay Bay, and Wynn. These hotels are on Las Vegas Boulevard, which is commonly called \"The Strip.\" With its nearly year-round sunshine, beautiful casinos, and variety of gaming options, Las Vegas remains the best location for gambling in the U.S."
    },
    {
        "id": "3ddadb59a1dc4652b5e0d83bf5e0ce9d",
        "title": "A Kid's Party for Adults",
        "content": "Not all kids' birthday parties in the U.S. are created equal. Sometimes it seems like the birthday parties are about showing off and entertaining the parents of kids in addition to children.\nMost children's birthday parties are held in the home of the birthday boy or girl. It used to be that children's parties were just for children. Parents would drop their kids off and come back when the party was over to bring them home. Now it is more common for the parents of guests to stay for the party as well. This gives the adults time and space to socialize while the kids play games. Kids and adults don't always have the same tastes in food. So when adults are invited to stay for a child's birthday party, there is usually fancier food for the adults like cheese, crackers, and fruit platters. Meanwhile the kids eat hot dogs and potato chips. While the children drink punch, juice, or soda, the parents may be sipping cocktails, beer, or wine.\nEntertainment for a party of mixed adults and children also goes beyond the usual clown or magician. Sometimes there will be a DJ, and the adults  will dance. Party games are not just for the kids, either. While the children play traditional games like pin the tail on the donkey, the adults may play casino-type games like blackjack or poker.\nNot everyone likes this trend of adults and children partying together. Some feel that the parties should be kept separate. Some people worry about adults getting drunk in front of the kids. Others worry about kids getting abused by adults they don't know. For others, it is just about allowing a kid to have their special day. There is also a concern that these mixed parties encourage a sense of competition among parents in a community."
    },
    {
        "id": "5d3d896e1f5e45d8a2298d5844b315a5",
        "title": "The Los Angeles Memorial Coliseum",
        "content": "One of the great Los Angeles landmarks is the Memorial Coliseum. The coliseum was first commissioned in 1921, and completed in 1923. The original seating capacity was more than 75,000 seats, and was built as a memorial to World War I veterans. It has since been rededicated as a memorial for all American veterans from all wars. It is a historic stadium, and arguably the most famous outdoor sports arena in the country. Los Angeles was picked by the International Olympic Committee to host the 1932 Olympics. The city leaders realized the stadium was too small, and began a major renovation. It is the only stadium to have hosted two modern Olympic games in the world, but it is much more than that.\nThe coliseum has also played host to other major league sporting events. It was the site of the 1959 World Series between the Los Angeles Dodgers and the Chicago White Sox. It played host to the original Super Bowl game in 1967 between the Green Bay Packers and the Kansas City Chiefs. The game was not called the Super Bowl at the time. It was known as the First AFL-NFL World Championship Game. It started what is now the largest annual sporting event in the country, if not the world. Baseball was king during those years, and was, and is still called the Great American Pastime.\nThe stadium is home  to the University of Southern California Trojan football team, which is one of the most historic college teams in the history of the sport. It also was the home field of the UCLA Bruin football team for a number of years. In 1984, the city of Los Angeles and the Coliseum played host to the XXIII Olympic Games, becoming the only stadium to hold that honor. The stadium has played host to World Cup games,  boxing matches, and countless concerts, and outdoor events. It is an American tradition that lives on today."
    },
    {
        "id": "0847b02a947a4e3596d23c7b0ef9202a",
        "title": "Going to College",
        "content": "Two years ago, I graduated from high school. My father, mother, and sisters all came to see me walk up the stage to receive my diploma. Most of my extended family was there too, including my aunts and uncles, and some of my best friends.\nTo my surprise, my friend Eddie, who graduated from the same school the year before, came up to congratulate me as soon as the ceremony was over. \"Hey! Feels great, doesn't it?\" said Eddie. \"It sure does,\" I responded excitedly. Eddie was like a big brother to me. He joined the Navy after graduation. now that I was out of high school, he came back specifically to talk to me about my plans. I had no idea he was coming because he wanted it to be a surprise, and it sure was.\n\"Okay, now that you're out of high school, what are you going to do with your life?\" he asked. To tell the truth, I didn't have a clue. Most of my classmates knew exactly where they wanted to go to college, or if they were going to join the military. Some of them were like me  clueless. No one had ever been interested enough in me to try to give me some guidance except Eddie. He told me about college and I should consider going to a community college since I hadn't applied to a four-year university. I was very interested, but confused. \"You never went to college, Eddie. How do you know it's the right thing to do?\" I asked. Eddie just smiled and said he just knew and that I needed to trust him on this one.\nSince I trusted him like a brother, I took his advice and enrolled in a community college. It's been quite an experience. I must admit, Eddie was right. I will be transferring to UCLA next semester and things are looking up for me. I owe it all to my \"big brother\" Eddie."
    },
    {
        "id": "9ad53175cfec47e6b66b794ae7c63d2e",
        "title": "Helen the Gardner",
        "content": "Helen was outside watering her lawn like she does every other day. She loves her lawn and her garden. She has the prettiest house on the block, but it's only because she works at it very hard. Helen is in her mid-40s but you wouldn't know it by looking at her. Her face is nearly wrinkle-free, and it seems she has more energy than people half her age.\n\"Good morning, Helen.\" I said as I walked outside on my way to work. \"Hi Robert, how are you?\" she asked. \"Fine!I'm doing fine. Your yard is looking good,\" I said. And it was. Sometimes it really bothers me that I can't get my lawn to look as nice as hers. \"What's your secret, Helen?\" I asked. \"Secret to what?\" She answered. \"To having such a beautiful lawn! I water mine, I seed mine every year and I still can't get it to look as good as yours. I'm jealous!\" I said with a smile. Helen just nodded and had this funny little look on her face that suggested she was just better at keeping her lawn nice than I was.\nI didn't like that look, but I guess it's okay that she feels that way. I've known Helen since she was a little girl and things have not gone well with her lately. She's been alone for a long time. She wasn't very pretty when she was young. She had terrible acne that covered her face from ear to ear. It made her very self-conscious so she didn't go out on dates very much, but that all changed when she met Josh. They were together for more than 10 years until, sadly, they went their separate ways. Since then, Helen has nurtured and tended her garden as if it were her child.\nWhen I got home later that day, she was outside working on her roses. I said hello to her as I walked to my door, and she smiled brightly. She looked beautiful."
    },
    {
        "id": "2f306a42bc5842429fca70578f95a914",
        "title": "Driving in the United States",
        "content": "Driving in the U.S. can be confusing not just because of all the rules and laws that drivers must follow, but also because of driving customs. Many people in the U.S. are really dependent on their cars to get to work and school. In fact most American workers spend an hour driving to work each day. In order to drive in the U.S., you have to go to your local Department of Motor Vehicles first, and take a written test to get your learner's permit. If you pass this test, you can practice driving so you can pass a road test and get your license. The Department of Motor Vehicles or DMV has free booklets you can go and get to study for your learner's permit. You can also access the information online and even take a practice written exam. To prepare for the road test, you can have a friend teach you to drive or pay to take classes at a driving school. You cannot, however, practice driving by yourself. If you are caught driving with only a learner's permit, you can get into trouble with the law.\nOnce you get your driver's license in one state, you can use it to drive in all of the United States. Wherever you drive, you will see signs posted along the road indicating the speed limit. These numbers are not a suggestion. Generally you can drive faster on a highway than on local streets. Local police use special equipment to detect your speed. If they detect you are speeding or driving over the speed limit, police can stop you and give you a ticket. You will have to pay a fine, and some of the fines are more than $100. The lines painted on the road are not just to keep cars in their lanes.  They send a message. For example, a double solid yellow line means that it is against the law to pass another car here.to pass another car here."
    }
]