[
    {
        "id": "f06068f48ff649878d0a849a58d90efc",
        "title": "America: Land of Opportunity",
        "content": "America is known as the land of opportunity, where one could achieve anything they put their mind to, no matter who they are. Thousands of people immigrate to the United States every year from different parts of the world to have access to these kinds of opportunities. This is what is known as \"the American dream\". One of the many reasons America is such a great country is the diversity you see all around. America is one big melting pot of citizens from different backgrounds.\nAmerica is also home to many of the world's top colleges and universities. The California Institute of Technology is a top world-ranked college that focuses highly on science and engineering. It is located in the city of Pasadena. Harvard University is another top world-ranked college that you might be familiar with. The buildings at Harvard date all the way back to the year 1636, making Harvard the oldest university in the United States. It is located in the state of Massachusetts. University of California, Los Angeles is another institute worthy of recognition. Located next to Hollywood, UCLA has distinguished itself as a prestigious and selective university due to the number of people who apply for admission throughout the United States. The universities mentioned are but a few of the many other excellent schools that make the United States so outstanding.\nAmerica is also known for being at the forefront of freedom and equality. Although our history may be contradictory to these ideals, we have progressed and now live in a land of equal opportunity. Whether you wish to become a doctor, a lawyer, or a librarian, America is the best place to be at to achieve these dreams."
    },
    {
        "id": "fb62062884054e1b9ce85f54a54b268e",
        "title": "The Fourth of July",
        "content": "The Fourth of July is  the United States' celebration of its independence from England. It is the day when the Declaration of Independence was adopted by the new country's forefathers, and is a national holiday. It has been celebrated every year since 1776. Americans hold this day as one of the most revered holidays in the country.\nIndependence Day celebrations include firework shows that are held by various organizations throughout the country. The shows are held at stadiums, recreational parks, and private homes. Additionally, many businesses have giveaways and special discounts for all residents on this day. The firework shows are best at stadiums, where they attract a large number of people. This is a recent change in the way Americans celebrate the day. In the past, most people bought their own fireworks from vendors who sell their goods in supermarket parking lots.\nThe reason many cities no longer allow the sales, or use of fireworks is because of the fire hazards they pose. This is why the large, professional celebrations stadiums and parks have become popular in recent years. Of course, many people still celebrate at home though. There are some cities where sales and use of fireworks are still legal, and many Americans take full advantage of this.\nAnother Fourth of July tradition is the backyard barbeque. The holiday occurs in the middle of summer, and Americans love to grill outdoors to avoid the heat inside the house. Hamburgers and hot dogs are the food of choice, but steaks are also prepared often. There is nothing better than a great American meal and a cold drink celebrating the Fourth of July. It is a popular holiday, and it is one that has great meaning to most Americans."
    },
    {
        "id": "7df7737aa3ac46f1a274c1107ea93c9c",
        "title": "The U.S. Federal Government",
        "content": "The United States government is composed of three major sections. It is based on the Constitution of the United States of America that was put into effect in May, 1789. The three parts of the U.S. Government are the executive, legislative, and judicial branches. Each branch works independently of the other two, and each has its own responsibilities. This system is in place to ensure that no branch can carry more power than the other. This is called the separation of powers, which was written into the Constitution.\nThe executive branch is  the branch that most Americans are familiar with. It includes the president of the United States, the vice-president, and the cabinet. The president is the leader of the country and is the commander-in-chief of the U.S. military. The vice-president is second-in-command, and will act as president if the president dies, resigns, or is removed from office. The cabinet acts as agents of the U.S. President, and carry out the duties they are entrusted with.\nThe legislative branch of government consists of the House of Representatives, and the Senate. Together they form the congress, which can levy and collect taxes, mint money, and establish federal courts. It can also declare war, and raise and support the army, navy, and air force to protect the country. The House of Representatives has 435 members, and the Senate consists of 100 senators, with two from each of the states. Any legislation, or new law, must be approved by both the House of Representatives and the Senate."
    },
    {
        "id": "bc7f2f909b814144836ed666d2b424d2",
        "title": "Christmas: A Holiday of Traditions",
        "content": "Christmas, observed on December 25, is a Christian holiday that celebrates the birth of Jesus Christ. Christians of different denominations go to church on Christmas. Many Catholics go to midnight mass. In the United States, however, the holiday has a much more secular tone, and is celebrated  throughout the country. Many people, regardless of their religion, put up and decorate a Christmas tree. The tree can be a real evergreen or it can be an artificial tree. Lights, strings, tinsel, and even popcorn can be used to decorate a Christmas tree. On the top of the tree is a star or an angel. The decorations are usually  red and green.\nThe purpose of a Christmas tree is to have a central location to place gifts. According to legend, a jolly fat man with a beard, named Santa Claus, leaves presents under the tree. Children in the U.S. often write lists of things they want Santa to bring them. Many parents bring their children to shopping malls across the country to tell a man dressed as Santa what they want. These children are often also  photographed with the mall Santa as a keepsake. On Christmas Eve many children leave milk and cookies for Santa. Of course it is the parents that buy the gifts from the wish lists, and even eat the cookies and drink the milk. On Christmas Day children usually wake up early and run to the tree so they can see what Santa brought them. Adults can also exchange gifts at this time.\nPeople don't just decorate a tree at Christmas. Many also elaborately decorate their homes with lights. Some of the displays are even synchronized to Christmas songs called carols. Originally these songs were religious, but now they are about the spirit of the season."
    },
    {
        "id": "ef00141f8d1c4add8a019a9fe3c3c160",
        "title": "New Year's Day: A Holiday of New Beginnings",
        "content": "New Year's Day officially begins as soon as people yell \"Happy New Year\" at midnight. Most people continue partying well after midnight into the wee hours of the first day of the new year. In fact, many New Year's parties include breakfast or brunch. Sometimes at the stroke of midnight there will be fireworks and couples often kiss. One of the most famous New Year's celebrations takes place in New York City's Time Square, where a huge cut crystal ball drops at midnight in front of millions of people standing in the cold. Many more millions watch on television. Some groups, called Polar Bear Clubs, jump into the cold ocean water on New Year's Day as a literal way  to start the new year fresh.\nNew Year's Day, January 1, is a national holiday in the United States. This means that schools, banks, government offices, and post offices are closed. Given how much people tend to drink alcohol on New Year's Eve, many people wake up on New Year's Day with a hangover. The national holiday is a good day to recover.\nMany people go out partying with their friends on New Year's Eve; many people use New Year's Day to visit family members. New Year's Day is also when many people start on their New Year's resolutions. A resolution is a promise to change a lifestyle habit. The most common resolution is to lose weight. Many people also join gyms as part of their resolutions.\nOn New Year's Day there are also parades such as the famous Tournament of Roses Parade in Pasadena, California, where all the floats are made of different colored roses and they compete for awards. Many people also watch college and professional football games, including the Rose Bowl, which is also held in Pasadena, California."
    },
    {
        "id": "1299098eb2af426ba1bab55c86e9440c",
        "title": "Martin Luther King Jr",
        "content": "The third Monday in January is an American federal holiday, Martin Luther King Jr. Day. It falls near the birthday of the civil rights leader, who was assassinated in 1968. King, a minister, became known for non-violently protesting the treatment of African-Americans in the United States and laws that discriminated against Blacks. Specifically, King protested segregation that separated blacks and whites in public restrooms, public pools, public schools, on buses, and at restaurants. King led many marches in the United States, especially in the South where segregation was especially practiced and enforced, and in Washington D.C. His march on Washington D.C. was perhaps his most famous one, where he gave the \"I have a Dream\" speech.\nOn Martin Luther King Jr. Day, federal, state, and local offices are closed, including public schools and post offices. On the holiday many people participate in marches and vigils remembering Dr. King. Others use the day as a day of service and volunteer in their community by cleaning up garbage in a local park or serving food to the homeless. However, the holiday was controversial. Some states didn't want to honor Dr. King and tried to  rename the holiday or combine the day with another holiday.\nOnly two other people have a U.S. national holiday, Christopher Columbus and George Washington. Martin Luther King Jr. Day  became a holiday in 1983 after pressure from civil rights activists and marches, similar to the ones King used to lead. Efforts to create a King holiday began the same year King was killed. The first state to recognize King Day as a holiday was Illinois. The last state to recognize the holiday was Arizona."
    },
    {
        "id": "1c2a048a3a654cea893fc11f76db9b94",
        "title": "Valentine's Day: A Holiday of Love and Friendship",
        "content": "Valentine's Day, February 14, is a holiday that celebrates love and friendship in the United States. Most people think of it as a romantic day to show the one you love how much you care by purchasing cards and gifts. Valentine's Day is also an extremely commercial holiday. People spend money on flowers, balloons, chocolate, stuffed animals, and jewelry. People also go out for expensive dinners. Valentine's Day is even celebrated by school children, who give thank-you cards to their teachers. Some high schools have Valentine's Day dances. Classmates give each other little cards. These cards can be purchased at any store with famous cartoon characters. It is considered much more thoughtful to have kids make handmade cards to give to friends and teachers.\nValentine's Day is also a great day to announce your love to someone like a secret crush. Some people even get married on Valentine's Day. However, you don't have to be in love to share in the festivities. You can say \"Happy Valentine's Day\" to friends and coworkers.\nValentine's Day is not an official holiday though in the U.S., meaning government offices and schools are open as usual. The date used to be the celebration of a Saint named Valentine who allegedly saved a young girl's life. It wasn't until the Middle Ages that romance somehow got mixed in with the date and lovers would send each other handwritten love notes. Back then you couldn't just go to the store and buy a card  the way you can now."
    },
    {
        "id": "1f8a97514d0847d0aa956083f36c4bd1",
        "title": "St. Patrick's Day: A Holiday to Celebrate the Irish",
        "content": "Saint Patrick's Day, March 17, is a Christian religious holiday that celebrates the patron saint of Ireland. According to the legend, St. Patrick drove all the snakes out of Ireland. St. Patrick's Day has also become, especially in the United States, a day to celebrate Irish culture. In major cities across the country like in New York and Boston, there are parades and festivals. People wear green and decorate with shamrocks, a type of three-leaf clover. Some people wear buttons or tee shirts that say \"Kiss me, I'm Irish\". In the U.S. St. Patrick's Day is not a legal holiday, meaning government offices and schools are open.\nThe biggest and oldest parade takes place in New York City. It actually began about 250 years ago before the U.S. was even its own country. Every year thousands gather along to watch hundreds of Irish step dancers and bagpipe players march. Irish step dancing is done in groups or solo. Dancers perform complicated moves with their feet and legs while keeping their upper bodies stiff. The parade has also been a source of controversy because the parade is associated with the Catholic Church in New York City; gay and lesbian organizations have not been  allowed to march. Many people protest the parade or boycott it.\nSt. Patrick's Day has also become associated with the drinking of a lot of alcohol, specifically beer. One drink that is often seen around the holiday is \"Green Beer\". This is really  just regular beer with green food coloring. Many people feel like the holiday celebrates stereotypes about the Irish, like the myth that they all like to drink and get drunk. Others complain that the holiday has become too focused on drinking, with public drunkenness as a problem in major cities around the holiday."
    },
    {
        "id": "670e3f9a8d004e0e8735217ce4c08580",
        "title": "Passover: A Jewish Holiday of Remembering",
        "content": "Passover is a Jewish holiday that remembers and celebrates their liberation from ancient Egyptian slavery as described in the Old Testament of the Bible. It is traditionally celebrated in the spring and lasts about a week.\nAccording to the story in the Bible, God punished ancient Egypt with 10 plagues. The last plague killed Egyptian first-born males. Jewish people were told to mark their doors with lamb's blood so that God would know to pass over these houses and not kill any first-born males inside. This is where the name of the holiday, Passover, comes from. After this last plague the Egyptian king, known as the Pharaoh, agreed to release the ancient Jews from bondage. The Bible story also says that the Jewish people left their homes in such a rush after they were freed that they didn't have time to wait for the bread to rise. This is why at the commemorative Passover meal, Jewish people eat matzo, bread without yeast, also known as unleavened bread. The matzo and other foods are eaten at a special meal called a seder.\nThere are very specific rituals that happen at the Seder meal. These rituals are all in a book called the Haggadah. Inside the Haggadah is also the story of the Jewish exodus from Egypt. During the seder meal parts of the Haggadah are read aloud. The first part of the meal is a blessing over wine. The second part of the meal is the washing of hands. The third part of the meal is when someone dips some sort of vegetable in salt water and then eats the vegetable. The vegetable symbolizes the humble origins of the Jewish people. The water symbolizes their tears. The fourth part of the meal is when three pieces of matzo are broken."
    },
    {
        "id": "a10c658c32874ad8badc33c82e0ae811",
        "title": "Easter: An Important Christian Holiday",
        "content": "Easter is a Christian holiday that celebrates the resurrection of the dead of Jesus Christ as told in the Bible. Christians are found in church on Easter. Some Christians participate in an Easter vigil or nighttime mass, sometimes held by candlelight. Easter is never on a set date. It is observed on a Sunday between the end of March and the end of April. The exact date is calculated based on a different calendar. Many public schools in the U.S. have a week-long vacation around Easter time. Sometimes this break is called Easter or Spring break.\nIn the United States, Easter is also celebrated as a secular holiday. It is associated with the beginning of spring and symbolized by bunnies, flowers, and dyed eggs. Many children in the U.S. believe in a fictional character called the Easter Bunny. According to the myth the Easter Bunny leaves baskets full of candy for children. Sometimes these baskets are hidden and the children have to find them on Easter Sunday morning. Candy that is usually inside an Easter basket can include chocolate in the shape of bunnies or chicks, jellybeans,  and marshmallows.\nAnother activity associated with Easter is an Easter egg hunt. According to popular mythology, the Easter Bunny hides painted eggs and children need to find them. While real eggs used to be used, now it is common to use plastic eggs filled with candy. There are usually public Easter egg hunts in parks across the country. The White House even hosts an Easter egg hunt. Another Easter tradition associated with Easter is dying real eggs in different, usually pastel, colors like light pink, blue and yellow.\nIn New York City, people take to Fifth Avenue to participate in the Easter Parade. The Easter Parade isn't a parade with marching bands and floats. People walk up and down Fifth Avenue showing off elaborately decorated hats or Easter bonnets."
    },
    {
        "id": "5a84f565f0b84820af7a858119d2d5e3",
        "title": "Mother's Day: A Holiday to Honor Motherhood",
        "content": "Mother's Day is a holiday that celebrates and honors mothers in the United States. It is celebrated on the second Sunday in May. It became an official holiday in the country at the start of the 20th century as a way to honor mothers whose sons had died in war.\nThe holiday is celebrated in a number of ways.  People give mothers gifts like flowers, cards, and jewelry to thank them for all their hard work. A popular symbol of the holiday is the carnation. This is because when the holiday first began in the U.S. people were encouraged to wear a red carnation if their mother was alive or a white carnation if their mother was dead. Many people take their mothers out for a special meal. In fact, Mother's Day is the most popular date in the U.S. for people to go out and eat and it is estimated that people spend billions on meals and gifts. Mother's Day is also the most popular day to make long distance calls in the U.S. It is the second most popular gift-giving day after Christmas.\nSince its establishment, Mother's Day has been criticized for becoming highly commercialized. In fact, the founder of the U.S. holiday, Anna Jarvis, began protesting the holiday and was even arrested for disturbing the peace for demonstrating. Jarvis's own mother started the campaign to establish a mother's holiday during the American Civil War.\nMothers are not the only people celebrated on this day. All mother figures including grandmothers, great-grandmothers, stepmothers, and foster mothers are honored on the holiday. In schools many students make special gifts, including handmade cards. While widely recognized, Mother's Day is not a federal holiday. Many other countries around the world have their own version of Mother's Day."
    },
    {
        "id": "86e14e3837d741468634de531e3990bc",
        "title": "Father's Day: A Holiday to Honor Fatherhood",
        "content": "Father's Day is a holiday observed in the United States to honor fathers, fatherhood, and other paternal figures like grandfathers, stepfathers, and uncles. It is observed on the third Sunday in June.\nIn the early 20th century there was a mining accident in West Virginia that killed almost 400 men. A push for a day to remember the men killed, who were mostly husbands and fathers, was the start of a push for a national holiday. This was in 1908. It wasn't until 1972, however, that Father's Day was recognized by law as a national holiday. This is due in part to the fact that people were resistant to what they saw as another overly invented holiday meant to just make people spend money. It wasn't seen as a way to remember the dead or to honor living fathers and father figures. People weren't entirely wrong. Organizations representing men's clothing manufacturers put in a lot of money for the holiday to become popular.\nLike Mother's Day, it indeed is a holiday that has become highly commercialized. There are greeting cards to mark the day, and stores advertise gifts for Dad. These gifts traditionally include electronics, ties, and tools. In schools, children often make cards and other gifts. Father's Day is not a federal holiday even though it is widely celebrated. Some of the ways Father's Day is celebrated is with meals, especially barbecues since the holiday falls at the beginning of the summer."
    },
    {
        "id": "46f9e38a49e74e6187bf343773901aad",
        "title": "Memorial Day: A Holiday to Remember Fallen Soldiers",
        "content": "Memorial Day is a United States holiday to remember the men and women who have died while serving in the armed forces. The armed forces include all branches of the U.S. military. Those branches are Army, Navy, Marines, Air Force, and Coast Guard. Memorial Day is a federal holiday, which means government offices, banks, post offices, and schools are closed. Memorial Day is always observed on the last Monday of May. Memorial Day has its roots in the U.S. Civil War when a holiday, Decoration Day, was established to honor both Union and Confederate soldiers who died. On Decoration Day people used to \"decorate\" the graves of deceased soldiers with flags and flowers. The name Memorial Day became more widely used after World War II in the late 1940s. However, the holiday wasn't officially called Memorial Day until 1967.\nMemorial Day is commemorated by ceremonies in cemeteries across the country. The most well-known one is held in Arlington National Cemetery near Washington D.C. Arlington is a military cemetery, meaning only military personnel are buried there. Volunteers place U.S. flags on military graves at Arlington and other national cemeteries. There are also parades in honor of fallen service people held in different towns and cities. Another Memorial Day tradition is flying the U.S. flag at half staff until noon, meaning it is flown at half its normal height. This is considered a sign of mourning. The flag is raised to its full height after noon as a sign that the military will rise up despite the loss. There is also a national Memorial Day concert that takes place on the lawn of the U.S. Capital.\nMemorial Day is also known as the unofficial start of the summer season. Many beaches and pools open up for Memorial Day weekend. Many people also host barbecues on Memorial Day weekend."
    },
    {
        "id": "6140736780d6424ab5c840be5add7ce8",
        "title": "Labor Day: A Holiday to Honor Workers",
        "content": "Labor Day is observed on the first Monday of September. It is a holiday meant to honor the contributions, both economic and social, of U.S. workers. It has been an official federal holiday since 1894, meaning that government offices including post offices and schools are closed.\nIt is also widely thought that Labor Day was created as an alternative holiday to May Day. May Day, especially in the 1800s, had become a protest day, when workers marched to demand better rights and working conditions. There were often strikes that ended in violence. At the time, the U.S. government was afraid that May Day was being led by communists and was having a bad influence on workers. Some people feel September was also chosen since there are no other holidays between Fourth of July and Thanksgiving in November.\nOn Labor Day there are usually parades in major cities around the country. Politicians and labor leaders make speeches and hold press conferences. Labor Day is also considered the unofficial end of summer. Many people celebrate Labor Day with trips to the beaches, picnics, and barbecues. Many towns and cities host fireworks on this day. Many people also take their last summer vacations around this time. Labor Day is also the beginning of the professional and college football season in the U.S.\nLabor Day has also become an important retail holiday. Many stores have Labor Day sales to coincide with the start of the school year for many children in the U.S. This means that many store workers, while their holiday is being celebrated, have to work long hours."
    },
    {
        "id": "d61c71dc630247d8be7201d91e6b023b",
        "title": "Columbus Day:A Holiday to Remember an Explorer",
        "content": "Columbus Day is observed on the second Monday of October in the United States, and in some other countries around the world. For a long time it was observed on a specific date, October 12. It is named after Christopher Columbus, the Italian sailor who led three Spanish ships to claim new lands in 1492. There is even a child's poem remembering the date. It reads, \"In 1492, Columbus sailed the ocean blue\". Some people say Columbus \"discovered\" North America, although not everyone agrees with this interpretation. For example, Columbus never landed on North America proper. He only got as far as to the islands in the Caribbean Sea.\nColumbus Day has been a federal holiday since 1937; government offices, schools, and post offices are closed. Many Italians take the day as a day to celebrate their own ethnic heritage since Columbus was born in Genoa, Italy. Columbus's explorations, however, were conducted in the name of Spain. Major cities, like New York City and San Francisco, host large parades. Some cities, like New York City, also hold a parade celebrating the Hispanic or Latino community.\nNot everyone thinks Christopher Columbus should be honored. Some states like South Dakota do not observe the holiday at all. Instead they call the day Native American Day or Indigenous Peoples Day. In Hawaii the holiday is also known as Landing Day or Discoverer's Day. This is because European arrival in North America meant the loss of land and lives for many Native people. Many people hold protests or vigils on this day to remember the Native Americans that were killed or enslaved as a result of the European arrival. Another name for the holiday is \"Dia de la Raza\" which translates into English as Day of the Race."
    },
    {
        "id": "023934ec562c46b5a1b3161250c09858",
        "title": "Halloween: A Holiday for Costumes and Candy",
        "content": "Halloween is on October 31. It is also called All Hallows' Eve or All Saints' Eve. This is because, according to some, the holiday has its roots in a Christian holiday that remembers the dead. Others say the holiday has its roots in the ancient harvest season traditions of Ireland. In the U.S. though, the focus is less on memories of the dearly departed or agriculture. It is about kids dressing up in scary costumes and going door-to-door asking for candy. This is called trick-or-treating. When children knock on the door of a house or ring the doorbell, they usually say \"Trick or Treat\". The \"trick\" part is a fake threat signaling that the kids will commit a prank if they aren't given something delicious. Homeowners then give the children candy, raisins, or some other food treat. Many homeowners decorate their houses to prepare for the holiday and let kids know that they are participating and can ring the bell for candy. Traditional decorations often include jack-o'-lanterns, which are pumpkins with faces carved into them and candles inside. Jack-o' lanterns were thought to scare away evil spirits when Halloween was first celebrated among the ancient Christians. Also turnips, not pumpkins, were originally used. People often decorate using the colors black and orange.\nHalloween is not just for kids;  adults get in on the fun by attending costume parties. There are often contests for who has the best costume. There are also games bobbing for apples, where people have to get an apple using only their teeth from a large bucket of water. Other people celebrate by scaring themselves by going to haunted houses, homes where people dressed up as ghosts, zombies, and werewolves and jump out to frighten guests. People also tell scary stories or watch horror movies."
    },
    {
        "id": "b9463710714841999bb7cb1c1656673c",
        "title": "Veterans Day: A Holiday Honoring All Soldiers",
        "content": "Veterans Day is an official United States holiday observed on November 11th every year. While Memorial Day remembers those who have died while serving in any of the branches of the U.S. Armed Forces -- Army, Navy, Marines, and Coast Guard, Veterans Day honors all members of the armed forces, especially the living. As a U.S. federal holiday, government offices and schools are closed, and most people have the day off from work. Banks are also closed. If November 11th falls on a Sunday, then the holiday is observed on the following Monday.\nThe holiday was first observed after World War I, which ended On November 11 1918. It was called Armistice Day then and was more about celebrating the absence of war and honoring those that served in that one war. It didn't become known as Veterans Day until 1954 after World War II and the Korean War, when there were many more members of the armed forces.\nMany restaurants offer free meals to veterans on the date. There is always a special ceremony at Arlington National Military Cemetery in Washington D.C. This ceremony involves a wreath being placed over the grave of The Unknown Soldier. Many major cities also hold parades on this date. The U.S. flag is usually flown at half-mast as a remembrance to those soldiers who have died and many ceremonies observe a moment of silence for the same reason. In Canada the holiday is called Remembrance Day. One symbol of the day is the poppy flower. The red poppy flower is said to represent or be a symbol of the blood of soldiers. Many people wear or give out poppy flowers on the day."
    },
    {
        "id": "7f8692c0032f4500a5fe10619abae824",
        "title": "Chanukah: A Holiday of Lights",
        "content": "Chanuka, which can also be spelled as Hanukkah, is an 8-day Jewish holiday. It is known as the Festival of Lights, which celebrates the dedication of an ancient Jewish temple in Jerusalem thousands of years ago. According to the Hebrew, or Jewish Bible, a miracle took place then. A one-day supply of oil miraculously lasted eight days. The dates of Hanukkah always change, but usually occur anywhere in late November to Late December.\nThe main way people observe the holiday is by lighting a candle on a candelabra, a special candle holder with space for 9 candles on each of the 8 nights. This candelabra is called a menorah. Now there are also electric menorahs. Some people also use oil lamps. The 9th candle space is usually higher than the others and is lit on every night. This 9th candle is there so that people can see the other candles they are lighting. So, two lights are lit on the first night, three on the second and so on. Some families have the head of household light the candles. Other families share the responsibility. The menorah is supposed to be placed somewhere visible like in a window facing the street. The candles are supposed to stay lit for at least 30 minutes after it gets dark. There are also special prayers people say and holy songs sung when the candles are lit.\nSchools and government offices are open for Hanukkah since the observances happen at night. Some families exchange gifts on each night of the holiday. Some foods traditionally eaten on Hanukkah include latkes, fried potato pancakes, and doughnuts. These and other fried foods are eaten because they are cooked in oil and remind people of the oil that lasted for 8 nights. Children play with a special four-sided spinning top called a dreidel."
    },
    {
        "id": "dd180f9232f44bf6a6fbd86eafa55699",
        "title": "Thanksgiving: Families Coming Together",
        "content": "Thanksgiving is a holiday celebrated by many people in the United States and Canada. In the United States it is celebrated on the fourth Thursday in November and marks the start of the Christmas season. Some people celebrate Thanksgiving to remember the first harvest of the pilgrims and puritans, groups of people from England who immigrated to North America in the 1600s. Some people recreate the first Thanksgiving and dress up as pilgrims, puritans, and the Native Americans who are said to have helped the new arrivals find food to survive their first winter.\nMost people, however, see Thanksgiving as one day a year to reflect upon what they are thankful for. Some families will sit together and take turns saying aloud what they are thankful for. An important part of Thanksgiving is families coming together. Extended family members often travel long distances to share the day with their loved ones. In the United States Thanksgiving is the busiest travel day of the year. People travel in planes, trains, buses, and cars to share a very special meal  - Thanksgiving dinner.\nWhat most Thanksgiving celebrations have in common is the food. On Thanksgiving many families prepare large, elaborate dinners to share with friends and loved ones. Many of these dinners use ingredients associated with the fall harvest, like cranberries, potatoes, sweet potatoes, corn, and blueberries. Roast turkey is the traditional meat served. It is so common that some people call Thanksgiving Day \"Turkey Day\". The turkey is usually served with gravy and stuffing. Pies are usually served for dessert. The most common pies served are sweet potato, apple, pecan, and pumpkin.\nThanksgiving is not just celebrated in the privacy of people's homes. Every year the President of the United States pardons a turkey, saving it from becoming someone's meal. In New York City, Macy's, a department store, holds a large parade with huge balloons of various cartoon characters floating down the street."
    },
    {
        "id": "d4b30824da934e7986b461bafe94ce49",
        "title": "Lottery: A Chance at Millions",
        "content": "In the United States,  43 states, Washington D.C., Puerto Rico, and the U.S. Virgin Islands, all have their own lottery. A lottery is used for states to raise money. Licensed stores sell numbered tickets, or people can pay to choose their own numbers. When you let a machine pick your numbers, it is usually called a Quick Pick. Many people play lucky numbers, numbers associated with birthdates or other important numbers to them. The money earned from selling lottery tickets goes to pay for schools, roads, bridges, and other public services. Once a week or more, a drawing is held where the numbers are randomly picked. If your ticket has those numbers, you could win a cash prize.\nThere are different types of lotteries, such as Powerball, Mega Millions, and Lotto. Powerball and Mega Millions are known for their large payouts. There are also instant lottery tickets that are scratch-off cards. The winnings tend to be less money, but they are extremely popular.\nIn the United States, you can play the lottery, or buy a ticket if you are 18 years or older. If you win, usually you have the option of being paid the entire amount in one lump sum or of being paid smaller amounts over a number of years. Lottery winnings are taxable, meaning the amount you actually get is smaller than the jackpot number. People can buy lottery tickets or play the lottery at many convenience stores. Lotteries are also very popular since they advertise. There are many television commercials, radio commercials, and billboards urging people to play.\nLotteries have been controversial since they are essentially a form of legalized gambling. There is concern that it can lead to people becoming addicted to gambling. There are also illegal lottery games, usually run by some forms of organized crime."
    },
    {
        "id": "df028a5271844023a9b29860b1e001f9",
        "title": "One Country, Many Taxes",
        "content": "Taxes are special fees charged by a government on the people who live in a country, state or city. These fees help pay for public services like police, road and bridge repair, and public schools. In the United States people have to pay national, state, and local taxes. Income tax is a tax applied to how much money a person earns in a year. There are both federal and state income taxes. These have to be paid every year by April 15th. There are special forms the Internal Revenue Service (IRS), the government agency in charge of collecting taxes, asks people to fill out. There are tax credits that people with low income, college students, and parents can get. These credits could mean actually getting money back from the government. This money is called a tax refund. People can get both a federal and state tax refund. Anyone who works has to be taxed regardless of the immigration status. Not paying income taxes could mean a fine or even jail time.\nPayroll taxes are taxes that are taken right out of a person's paycheck. There are federal and state payroll taxes. These include Social Security and Medicare taxes. Social Security taxes pay for the retirement and disability benefits received by millions of Americans each year. Medicare taxes pay for the federal health insurance program that covers the elderly and the disabled.\nPeople who own houses pay property taxes. The amount paid depends on how much the property is worth. This tax is usually paid once a year. Sales tax is a tax almost everyone pays. Sales tax is a specific extra percentage charged on nearly all purchases. Everything from soap to furniture has a sales tax attached when bought. The amount of the sales tax is different across states and cities."
    },
    {
        "id": "d43720c5d2d84455821da30b2e80a4eb",
        "title": "Medical Insurance: Making it Easier to Get Health Care",
        "content": "Health insurance is one way to pay for health care. Health care includes visits to the doctor, prescription medication, and emergency services. People can pay for medicine and doctor visits directly in cash or they can use health insurance. Health insurance usually means you pay less for these services. There are different types of health insurance. At some jobs, companies offer health insurance plans as part of a benefits package. Individuals can also buy health insurance. The elderly, and disabled can get government-run health insurance through programs like Medicaid and Medicare. There are many different health insurance companies or plans. Each health plan has a set of doctors they work with. Once a person picks a plan, they pay a premium, which is a fixed amount of money every month. Once in a plan, a person picks a doctor they want to see from that plan. That doctor is the person's primary care provider.\nObamacare, or the Affordable Care Act, is a recently passed law that makes it easier for people to get health insurance. The law requires all Americans have health insurance by 2014. Those that do not get health insurance by the end of the year will have to pay a fine in the form of an extra tax when they file their income taxes. Through Obamacare, people can still get insurance through their jobs, privately, or through Medicaid and Medicare. They can also buy health insurance through state marketplaces, where people can get help choosing a plan based on their income and health care needs. These marketplaces also create an easy way to compare what different plans offer. If people cannot afford to buy health insurance, they may qualify for government programs that offer free health insurance like Medicaid, Medicare or for children, a special program called the Children's Health Insurance Program (CHIP)."
    },
    {
        "id": "d0be93ffd0a24473a2c3726a72f667f8",
        "title": "Immigration: A Broken System",
        "content": "Immigration in the United States is a complicated and controversial issue. Since the founding of the country people have come from different countries in search of a better life and opportunities. Immigration laws, however, are always changing and are complicated. This leads to many people coming into the U.S. without proper legal status. While some people call immigrants who come and stay in the U.S. without the proper papers \"illegals\", many consider this term offensive. The more acceptable term is \"undocumented\" since they do not have the correct legal documents.\nIt is estimated that there are more than 11 million undocumented people in the Unites States. While some people will say there is no reason for immigrants to be undocumented in the U.S., there are limits on the number of Green Cards, or legal permanent  resident cards, people from certain countries can get. There are also long waiting lists, up to 14 years in some cases, for people coming from certain countries, to apply for legal status in the U.S. Additionally there are a limited amount of visas, or permits, for people coming into the U.S. with manual labor skills. Millions of undocumented people have been deported, or sent back to their country of origin under President Obama.\nIn 2013, the U.S. Senate passed an immigration reform bill. The law adds extra border security along the U.S.-Mexico border, and also makes it easier for immigrants to become citizens. The bill, which also has to be approved by the House of Representatives, has not yet been presented or voted on by Congress. Because of this, many are asking President Obama to take action to protect some of the undocumented, many of whom have been in the U.S. for many years and have children that are U.S. citizens."
    },
    {
        "id": "aafb3889be3b4e43be25eb8bba7e4e38",
        "title": "Community Colleges (1)",
        "content": "The American community college system is a place for second chances. Community colleges are two-year schools that thrived in California after the end of World War II. Many American military personnel were returning to civilian life after their service to the country. Some of these young people decided not to go to college after high school so that they could serve their country during that time of need. When they returned, many of them turned to the community college system in California to continue their education.\nThe United States government introduced the G.I. Bill at that time giving returning servicemen and women educational benefits to help them get back to school. Soon community colleges and new school districts began appearing throughout the country. Community colleges helped ease returning military personnel back into college life. It was a low cost, less stressful alternative to going back to a four-year university.\nToday, community colleges attract students from all parts of the world. In California, a large population of students comes from Asia and Latin America. These schools provide a second chance to international students who may have experienced difficulties attending college in their native countries. American students who may have not done well academically in high school, and did not enter a university, can turn to community college for a second chance, too.\nCommunity colleges provide a much-needed resource for all these students. Former military personnel, international students, and high school students alike, are all welcome. One of the best things about community colleges is that they accept anyone at anytime. This means people who have not found what they want to do in life can try more than one area of study. If they don't like one course of study, they can always try something else. That is the beauty of community colleges."
    },
    {
        "id": "719a602814654c37a41f714f7d3e4ff7",
        "title": "Community Colleges (2)",
        "content": "These days many people attend community colleges with plans to transfer to a four-year college or university to get a bachelor's degree. It's kind of like a stepping-stone. There are many reasons why people do this. One reason is that some community colleges have transfer agreements with private and state colleges and universities that guarantee admission. Even if a community college doesn't have that agreement of a guaranteed spot in a four-year college, it has articulation agreements with four-year schools. These agreements tell you exactly what classes a student in a community college needs to take in order to be able to transfer. These agreements make sure that students don't waste time taking classes that won't transfer. Most of these classes one needs to take before transferring are general education classes, like math and English.\nAnother reason why many students start their undergraduate degree at a community college is a financial one. A four-year college or university is much more expensive than a two-year college. This is especially true for immigrant students, who don't qualify for financial aid, loans or scholarships. Also community colleges tend to offer more evening classes so they can accommodate people who have to work while attending school. They are also a good option for older students with families, who need a more flexible schedule while taking care of children. Community colleges also tend to be commuter schools, meaning people don't have to live on campus in dorms. Attending a community college means you can still live at home with your parents, which can save the family a huge amount of money.\nIf a student didn't do well in high school, a community college would provide him or her with another opportunity to enter a four-year university. Community colleges offer many classes to help students develop their math and writing skills. When you attend a four-year college, you are expected to have those skills already. Community college will prepare students to successfully graduate from a four-year school."
    },
    {
        "id": "f6277804b23943c3a5569aeaa1a26d9d",
        "title": "Elementary Schools in the U.S.",
        "content": "Most children in the U.S.  begin school at age 5, when they go to kindergarten. This is the beginning of elementary or primary school. Most children stay in elementary schools till they are about 11 years old. Elementary schools are divided by grades. The youngest children begin in kindergarten at 5, and then go to first grade, second grade and so on. Most elementary schools go up to fifth or sixth grade.\nThe focus of an elementary school is basic academic and socialization skills. Mostly children learn how to read, write, count, add, subtract, multiply, and divide. Students also learn the rules of English grammar, spelling, and vocabulary. Children also learn basic social studies or history, science, art, and music skills, and participate in gym or physical education. In elementary schools children also learn how to follow directions, share, and work in groups. Students usually stay in one classroom all day with one teacher who stays with them throughout the year. Students may leave the classroom to visit the school library, the school gym, and attend special science, art, and music classes. Students also usually leave the classroom for lunch and recess. For lunch students sit at tables, separated by grade, in a large cafeteria. Recess is usually a half hour when children go out into a yard to play. The typical school day starts at about 8:00 in the morning and ends at about 3:00 p.m. Students go to school from Monday to Friday and have the weekends off.\nElementary school teachers are licensed by the state where they work. They have to graduate from college, or even graduate school taking special classes in Early Childhood and Elementary Education. Before teachers can be in a classroom with students, they have to pass a background check and take an exam."
    },
    {
        "id": "2dcb2c07e5644596a512a8d717f53fca",
        "title": "Middle Schools in the U.S.",
        "content": "Once a child finishes 5th or 6th grade in elementary school, they graduate and go on to middle school or junior high school. This school is a separate building or set of buildings. Most students in middle school are between the ages of 10 and 14. The grade system continues in middle school. Middle school usually starts with 6th or 7th grade and ends with 8th grade. While they are less common, some elementary schools go from kindergarten to 8th grade.\nMost students are assigned a middle school based on where they live. However, there are charter, private, and specialized public middle schools that have an application process. The purpose of middle school is to provide a transition period between elementary school and high school. Middle school prepares students for high school life. In middle school students don't stay in one classroom all day with one teacher. Students change classrooms for different subjects and have different teachers for each subject. In middle school some students may even be able to choose some of their own classes, called electives. There is a set of core classes that all students have to take. These include English, math, science, and social studies or history classes. Gym or physical education classes are also required.\nA common feature of middle school is a homeroom, which is a classroom students visit at a scheduled time once a day or once a week. A homeroom teacher takes attendance and makes announcements of things students need to know. The homeroom also helps students feel like there is one common place and one common teacher they see regularly. This is to help with the transition from elementary school to secondary school. Once a student finishes middle school, they have a graduation ceremony and go to a high school assigned to them or a high school they picked."
    },
    {
        "id": "8ee6de8276d34605a526d1d9e3ab4424",
        "title": "High School in the U.S.",
        "content": "After middle or junior high school, U.S. students go to high school. Going to school is free in the United States, including high schools. Students do not need to pay tuitions, and even textbooks and lunches are free. Of course, we are talking about public schools. If parents choose to send their kids to private schools, they need to pay very expensive tuitions. High school is the last four years of school that students in the U.S. are required to attend by law.\nHigh school students are divided by grades. It begins at 9th grade and finishes with 12th grade. Some high schools, even public high schools, have admission exams or an application process. Public schools admit students based on where they live. In order to successfully complete high school, students have to complete a series of core classes including math, English, science, history, a foreign language, and gym or physical education. Students usually can also choose to take electives, or specialized courses in a subject that interests them. Some high schools in the U.S. have exit exams that students are required to pass in addition to completing their courses in order to graduate and earn a high school diploma. A law called the No Child Left Behind Act requires high schools that get federal money to make students take a standardized exam every year. A high school diploma is required for students who want to continue on to college and is considered a minimum requirement for any jobs.\nHigh schools classes are designed to prepare students for college. Some high schools offer specialized skills so that students can find work after graduation without going to college. Those are called vocational high schools. In high school, some students have the opportunity to take Advanced Placement (AP) classes. These are college level classes. If the students pass an exam after taking AP classes, they can get college credit. In high school, students move from class to class throughout the school day."
    },
    {
        "id": "de41997d838c4ebfa43b3a1f64bb7a24",
        "title": "Homeschooling",
        "content": "Not every parent looks forward to the day when their child goes off to school. In fact some parents are not sending their students to school at all. Instead they are choosing to teach their children at home. This is called homeschooling. Parents, caregivers, or private tutors educate children individually at home instead of sending them off to be formally educated in public or private schools. In the U.S. only about  three percent of children are homeschooled.\nThere are many reasons why some parents choose to homeschool. One reason is that some parents do not feel their children are safe in school because of bullying and a growing trend of police in school. Other parents want their child's education to be based on their religion or moral beliefs. Yet other parents feel like the education in school is not good enough. Homeschooling is also seen as a choice for families that live in rural areas, and families that travel, like actors.\nThere are many different ways to homeschool, and homeschooling allows parents to customize lessons based on their children's needs. Families can purchase textbooks to use or create their own materials. Some parents follow a philosophy called unschooling, which allows a child to determine when, and how they want to learn based on their natural curiosity. Some worry that homeschooling means students won't have opportunities to socialize. To answer this concern, some families have created cooperatives, where a group of homeschooled students will learn and play together and participate in activities that would normally happen in school like field trips and prom.\nBeing homeschooled doesn't mean a student cannot go to college. Most colleges accept homeschooled students. It is important, however, for parents and students to create a portfolio or proof of what has been learned."
    },
    {
        "id": "4649fd32ce19452398cc2e947fc95b75",
        "title": "Parent-Teacher Conferences",
        "content": "When parents send their children to school, often they don't know what happens day to day. Parents rely on what their children tell them about how they are doing and what they are learning. Generally schools will host parent-teacher conferences at least twice a year. Parent-teacher conferences are short meetings between parents and their children's teachers. Usually parent-teacher conferences are held when teachers give out a student's grades for the term. The parent-teacher conferences give teachers an opportunity to let parents know how their child is doing. A teacher will let a parent know the student's strengths and bring to the parent's attention any problems  with grades or behavior. The meetings also offer parents the opportunity to ask questions and see what their child is learning.\nWhen it is almost time for parent-teacher conferences, the school will send parents a note and usually give them an appointment time. There are appointments during the day and in the evening. Evening appointments are used for parents who work during the day. Parent-teacher conferences do not last very long. Normally they do not last longer than 10 minutes. This is why it is important for parents to make sure they arrive at their appointments on time and come prepared with questions. If a parent needs more than 10 minutes, he or she should try to schedule another meeting with the teacher. Keeping a teacher for more than 10 minutes when there are parents waiting is disrespectful.\nMost children do not go along with their parents to the meetings. This allows both the parent and teacher to talk honestly about the child's progress without making the child feel bad. Usually a teacher will offer advice to the parent on how to support their child's education."
    },
    {
        "id": "5493d3fcaac54c8f93bf4749a56dc7d5",
        "title": "Private Schools: An Expensive Educational Alternative",
        "content": "Public schools are available for kids from kindergarten through 12th grade free of charge. However, many families choose to pay for their children's primary and secondary education by sending them to private schools. There are many different types of private schools and many different reasons why parents send their kids there. Some private schools are military type and yet others are boarding schools where students live on campus. Some private schools are affiliated with a certain religion. These schools teach a specific faith's  beliefs and traditions as well as the regular academic subjects. There are schools run by Catholics, Protestants, Jewish people, Muslims, and Orthodox Christians. There are also private schools that specialize in teaching disabled students.\nSome parents choose private schools because they feel that they offer a better education than public schools; others choose private schools because they offer a different type of curriculum. Waldorf Schools, for example, only let children play and use items made of natural materials.\nPrivate schools are also called independent schools or non-state schools because they are not run by local, state, or national governments. They can pick what students to go to their schools. They do this through admission examinations and interviews. There is often an admissions application. Some private schools accept anyone who can pay tuition to send their children there. Some schools charge up to $45,000 a year. Private schools charge tuition because they do not get any money collected from local, state, and national taxes. Some private schools offer a limited number of scholarships to help pay for school. Many of these scholarships are need-based, meaning for students who can't afford the tuition. Other scholarships are offered for students with very good grades or for students that have a talent in a sport or art."
    },
    {
        "id": "ab1f58a8701d41cd9372a0bac7ec5139",
        "title": "The California College and University System",
        "content": "California is the largest state in the United States of America. It is home to more than 10 percent of the country's total population. It also has the largest education system in the country. The college and university system is divided into four parts. Those parts are the University of California system, the California State University system, the community college system, and private institutions.\nThe UC system has more than 230,000 students at its 10 Campuses. It is considered the more prestigious system in the state. It includes top universities like UC Berkeley, and the University of California, Los Angeles (UCLA). Both schools rank in the top 25 universities in the country, with Berkeley in the top 10. A degree from the UC system is highly sought, and the academic standards are higher than the other systems. They are also more expensive.\nThe California State Universities counts 23 universities in its system. It is a diversified system that includes two polytechnic universities, and a maritime university. These schools offer vocational and maritime education, but also offer traditional, academic programs. The systems enrollment is approximately 450,000 students, with about 45,000 faculty members.\nThe California Community Colleges system is the largest systems of higher education in the state, and the world. It boasts 112 campuses, and serves approximately 2.4 million students. It offers transfer degrees, vocational training, and associates degree programs.\nCalifornia is also home to a large number of privately owned and operated schools. These schools have no ties to the state school system, but some do accept transfer students from community colleges. The most notable and prestigious schools in the state are Stanford University, in Palo Alto, and the University of Southern California, in Los Angeles."
    },
    {
        "id": "2f306a42bc5842429fca70578f95a914",
        "title": "Driving in the United States",
        "content": "Driving in the U.S. can be confusing not just because of all the rules and laws that drivers must follow, but also because of driving customs. Many people in the U.S. are really dependent on their cars to get to work and school. In fact most American workers spend an hour driving to work each day. In order to drive in the U.S., you have to go to your local Department of Motor Vehicles first, and take a written test to get your learner's permit. If you pass this test, you can practice driving so you can pass a road test and get your license. The Department of Motor Vehicles or DMV has free booklets you can go and get to study for your learner's permit. You can also access the information online and even take a practice written exam. To prepare for the road test, you can have a friend teach you to drive or pay to take classes at a driving school. You cannot, however, practice driving by yourself. If you are caught driving with only a learner's permit, you can get into trouble with the law.\nOnce you get your driver's license in one state, you can use it to drive in all of the United States. Wherever you drive, you will see signs posted along the road indicating the speed limit. These numbers are not a suggestion. Generally you can drive faster on a highway than on local streets. Local police use special equipment to detect your speed. If they detect you are speeding or driving over the speed limit, police can stop you and give you a ticket. You will have to pay a fine, and some of the fines are more than $100. The lines painted on the road are not just to keep cars in their lanes.  They send a message. For example, a double solid yellow line means that it is against the law to pass another car here.to pass another car here."
    },
    {
        "id": "2578d3d78d9c462c95712d3548a1dba2",
        "title": "Pasadena Rose Parade",
        "content": "Each New Year's Day, the city of Pasadena in California hosts a celebration to welcome the year with a series of events that includes the Rose Parade. The parade takes place in the center of the city on Colorado Blvd, and features numerous floats, marching bands, equestrian teams, celebrities, and honorees. It is the most popular parade in the country. It has spawned several other  New Year's Day parades throughout the country. In Miami, it's the Orange Bowl Parade; in New Orleans, it is the Sugar Bowl Parade; in Arizona, it's called the Fiesta Bowl Parade. However, the Rose Parade is the oldest and best parade. Many people like to camp out in tents or in sleeping bags the night before to get the best locations to view the Rose Parade.\nTo brave the cold weather, some people bring portable heaters to keep them warm. It can get into the low 40s at night in Pasadena during the winter, so many people dress warm for the occasion. Food is another big feature at the pre-parade celebration on New Year's Eve. People bring their portable grills to cook their favorite outdoor meals right on the sidewalk. The rich aroma of the grilling food fills the night air, and most people are willing to share their food with other overnight campers. It is fun to sample different dishes from other grillers.\nAs night turns into morning, there is still electricity in the air. People are excited about the start of the parade, which begins at 8 a.m. sharp. The floats are beautifully decorated in flowers, while the dancers and other performers dress in colorful costumes, some of which are made just for the parade. The marching bands come from nearby cities, high schools, and colleges. It is considered a great honor to participate in the Rose Parade."
    },
    {
        "id": "09e53904c0e54b82a94a76fe54cc4df2",
        "title": "Selfies",
        "content": "The self-portrait is nothing new. Painters and photographers have always used themselves as subjects. Today, however, almost everyone walks around with a camera in his or her pocket. This is because most cell phones have cameras on them. The fact that most people have cell phone cameras with them all the time has led to the rise of the selfie. A selfie is a self-portrait usually taken with a cell phone.\nSince the pictures are usually taken on a cell phone, many people tend to share these photographs with friends and even strangers on different social networking websites. Some of the popular social networking platforms people use to share selfies include Instagram, Snapchat, and Facebook.\nPeople usually take selfies when they are engaged in normal day-to-day activities. They take selfies of their commutes to work or school. People take selfies of themselves eating. Other people take selfies to show what they are wearing or whom they are hanging out with.\nThe most common way to take a selfie is by holding a cell phone at arm's length. Some people take selfies by taking a picture of their reflection in a mirror. In these pictures, you can usually see the phone the person is taking a picture with. Selfies taken using a mirror often are taken in a bathroom, which some people think is offensive. The bathroom is a very private place, not a place to take pictures.\nSome people think that selfies are a sign that people are becoming vain or superficial. It is not often that people take pictures of themselves that make them look bad. When people take pictures of themselves, they usually are trying to present themselves in the best light. However, some people use selfies to show what they really look like. Some people are trying to challenge stereotypes of what makes someone attractive."
    },
    {
        "id": "d791cc68e65a4c4f9df3cc8c74a37ef9",
        "title": "Apartment Pets",
        "content": "In U.S. cities like New York City and Los Angeles, many people live in small apartments. Despite not having homes with big yards, some apartment dwellers still seek the companionship that domesticated animals like dogs and cats offer. Some people feel that having a pet, even in a small space, is good for teaching children responsibility.\nHowever, many landlords forbid tenants from having pets, specifically cats and dogs, because of the damage the animals can do to carpets. Some landlords even forbid birds because of the noise they make. Many landlords charge an extra fee, known as a pet deposit, to tenants who want to keep pets. This is to pay for repairs or cleaning caused by the pet.\nMany times apartment dwellers will choose animals, like fish, hermit crabs, guinea pigs or hamsters, that make little noise, little mess, and won't chew up the furniture. Other people keep lizards as pets, since they don't require much space and can be kept in small cages or tanks. Another benefit of these smaller pets is that they don't need to be walked. However, some people who live in apartments have pets that are not so ordinary. Some of these less than ordinary pets include mammals like hedgehogs, amphibians like frogs, and spiders like tarantulas. Not all exotic pets are legal though.\nIn order to maintain public safety, some cities and states have laws banning specific animals as pets. New York City, for example, bans people from keeping ferrets, snapping turtles, pythons, and scorpions as pets. It seems unlikely that a family would have a polar bear named Fluffy or a whale named Bubbles as a pet, New York City has specific laws banning these wild animals from residences. These laws exist for a good reason. In 2003, a man in a Manhattan apartment  was discovered to have a 350-pound Bengal tiger as a pet."
    },
    {
        "id": "392371c2899c4d57bb4df6d43b27463e",
        "title": "Non-traditional Wakes",
        "content": "A wake is when people go to a deceased person's home or a funeral parlor to pay their last respects. A funeral parlor is a place where the preparation of the corpse for burial takes place. Part of the preparation can be dressing the deceased, doing their makeup, and placing them in a coffin for people to see. Some people do have a closed casket wake, where you can't see the dead person; some people are not even choosing coffins for their dearly departed loved ones.\nIn the United States, more and more families are choosing not to have traditional wakes. There is a recent trend of people having non-traditional wakes with the deceased person posed doing something they loved doing when they were alive. For example, a family in New Orleans had their dead loved one posed at a table with a cigarette between her fingers and a can of beer. One funeral home in Puerto Rico has become famous for its non-traditional wakes. It all started in 2008, when a family asked for their dead loved one to be propped up against the wall of their home for the wake. When a paramedic died, his family had his dead body in the driver's seat of an ambulance. Another family had a man propped up in a fake boxing ring for his wake. One dead man was posed on top of his motorcycle. Recently, a grandmother was posed sitting in her rocking chair.\nThese non-traditional wakes have their critics though. Some people think they are disrespectful. They think of death as a solemn and sad occasion, not a time to pose the dead as if they were toys. Fans feel it helps them remember the dead as they were when they were alive."
    },
    {
        "id": "30bb7e929f4f43d19c9abc7362d81dcd",
        "title": "Homelessness in Los Angeles",
        "content": "It is very common to see homeless people on the streets of Los Angeles. This is a problem that has persisted in the city since the beginning of the 20th century. Back in that time, California was known for offering many job opportunities in farming, and many young men were hopping on trains from all over the country to arrive in Los Angeles. Unfortunately, many of those men often ended up finding themselves without a job, a place to stay, or even food to eat. To help these people, many churches began to establish shelters in the area of Los Angeles that would eventually become Downtown. Even as the farm landscape changed to a big city environment, these shelters remained a refuge for many individuals that found themselves homeless\nNowadays, the homeless population of Los Angeles is made up of much more than just young men looking for work. Many economic and social changes have resulted in both men and women of all ages turning to the streets of Los Angeles. Some of them are there as a result of substance abuse that has left them moneyless and jobless. Others are veterans from various wars that cannot find the resources to get back to their normal lives. Additionally, many of these people suffer from mental disabilities that limit them from finding a job or being accepted in the rest of society.\nSince there are a lot of different causes that lead to homelessness, it is easy to see why finding solutions to helping all of the homeless people is so difficult. Although there are many programs that focus on providing the homeless food daily, it is much harder to find programs that try to assist the homeless in finding jobs, and stable housing. In order to finally find a solution that will effectively help decrease the number of homeless people in the city, a lot more individualized attention must be placed on individuals based on their physical and mental health, and circumstance."
    },
    {
        "id": "1fa23776e12e4115a22f0d9b76a19aec",
        "title": "Paramedics",
        "content": "Some of the everyday heroes in the United States are the country's paramedics. These young men and women are usually the first people who respond to medical emergencies suffered by citizens. Paramedics must complete a very extensive physical training program that is designed to weed out those who cannot make the cut. A paramedic must be in fit condition, and be mentally strong to perform his or her duties in the face of danger. Many of these heroes must endure life-threatening situations when responding to emergencies. Paramedics are usually attached to a county, or city fire department, but there are also some private paramedic organizations.\nIn Southern California, there are two primary schools for paramedic training. They are UCLA's Daniel Freeman Paramedic program and the Paramedic Training Institute. Both of these schools provide candidates for the Los Angeles County and City Fire Departments. To become a paramedic for a county or city organization, candidates must also pass a psychological screening and a physical training program.\nSome of the equipment paramedics carry is very specialized. They carry basic and advanced life support gear such as forcible entry tools so they can reach people in peril, saws to cut through obstacles, and other emergency equipment. Paramedics provide a valuable service to the communities they serve. They must be certified in Cardiopulmonary Resuscitation (CPR) techniques, and be trained to handle all situations.\nSome paramedics are trained to respond to what is called Mass Casualty Incidents (MCI). These emergencies occur whenever there is a tragic event such as the September 11, 2001 attacks on the country, and other emergencies like earthquakes, mudslides, or floods. Paramedics  can also be sent to emergency situations by citizens who call the 911 emergency phone number."
    },
    {
        "id": "2191d35173b54234a20762d3bb89bad9",
        "title": "September 11th",
        "content": "One of the darkest days in American history was September 11, 2001. This is \"a day that will live in infamy\" for most Americans. It was the most tragic day in the history of the country since December 7, 1941 when the Japanese attacked Pearl Harbor. September 11th was the day Muslim extremists hijacked four commercial airliners in an attempt to destroy the American spirit by slamming those jets into four buildings. Three of the four jets reached their targets, while one was stopped by a group of everyday heroes who gave their lives for their country.\nIn the early morning hours on September 11, 2001, American Airlines Flight 11 slammed into the north tower of the World Trade Center in New York City. A few minutes later, Flight 175, also an American Airlines flight, struck the south tower. Both suicide attacks brought the towers down, but not immediately. It took time for the extreme heat from the burning jet fuel to weaken the towers to their eventual collapse. At about the same time, American Airlines, Flight 77 crashed into the Pentagon, which is a government building in the country's capitol, Washington D.C.\nThe fourth flight, United Airlines Flight 93, was also headed for the capitol city. Most people think its target was either the capitol building, or the White House, the president's home. A group of brave passengers, upon hearing the news of what was happening in the country, decided to take down the giant airplane even though they knew they would not survive. They stormed the cockpit and took the controls from the hijackers. The plane flew out of control, crashing into a field in the state of Pennsylvania, where all passengers were killed.\nIn all, about 3,000 Americans lost their lives on that day, but the American spirit was not suppressed. Those responsible for the attacks were quickly dealt with, and the country soon began its journey to recovery. September 11, 2001, a day America will never forget."
    },
    {
        "id": "983f1676b5234801a59f31382f1f03ea",
        "title": "The California Redwoods and Giant Sequoias",
        "content": "Some of the most majestic landscape views in California are the great California Redwood and Sequoia trees. These trees can be seen up close at Sequoia National Park in the southern Sierra Nevada mountain range, of Visalia. This central California region boasts more than 400,000 acres of natural beauty that is uniquely Californian. The park is known as the Land of the Giants because of its beautiful trees. The landscape features great mountains, foothills, deep canyons, a large cavern system, and, of course, the world's largest trees.\nThe park sits side by side with King's Canyon National Park in the stunning San Joaquin Valley. Sequoia National Park was officially established as a national park in the 1890s. It features 14 campsites that include picnic tables, fire rings for outdoor cooking, and food storage boxes. It is a great place for a family vacation with many of its campsites open year round. But the most popular attractions are its forests. The ancient trees are some of the oldest living organisms on earth, and draw millions of visitors worldwide. Redwood trees can reach heights of more than 375 feet. They are closely related to the Giant Sequoia trees, and are often mistaken for each other. They both are uniquely Californian, as they do not grow naturally in any other region in the world.\nRedwood trees live up to 2,000 years, and have branches that grow up to five feet in diameter. Its bark can grow up to 12 inches thick. The Giant Sequoia trees can live up to an astonishing 3,000 years, and have branches up to eight feet in diameter. Its bark can grow to an amazing thickness of three feet. Both trees have dark brown bark, and look very similar, but the Redwood thrives in coastal climate, while the Sequoia exists in more mountainous areas. In either case, they are a must-see California attraction."
    },
    {
        "id": "d66b5fc783e14760b8070b112ac7c93e",
        "title": "The California Highway Patrol",
        "content": "There are many law enforcement agencies in the United States, and especially in California. Some of the largest agencies in Southern California are the Los Angeles Police Department, and the Los Angeles County Sheriff's Department. Both of these police forces are some of the largest in the country. They handle a full-range of police duties ranging from traffic citations to murder, rape, and robbery cases. There are also a number of smaller police agencies operating side by side with the LAPD and L.A. County Sheriff's Department. Cities, such as Monterey Park, have their own police force, while smaller cities depend on the Sheriff's Department for their law enforcement needs. Because of the unique nature of the state, California created the California Highway Patrol.\nThe CHP, as it is usually called, is a police agency that is entrusted with patrolling the vast number of freeway miles that exist in California. The state was built during a time of great mobility after the advent of the personal vehicle. Because of this, the state has more freeway miles than any other states in the United States with the exception of Texas. However, California has the most licensed drivers, and by far, the most registered vehicles. This made it necessary to create a police force dedicated to its highways.\nCHP officers are endowed with the same powers other police officers have. However, they do not have a crime investigation team for any offense other than traffic-related crimes. Whenever the CHP first responds to a crime that is not traffic-related, its officers perform the same duties a regular officer does. It then turns investigations over to the LAPD, or Sheriff's office depending on the location of the crime. The CHP has a long, and storied history. Many young Californians, both male and female, are attracted to the CHP, and enroll into its academy in Sacramento, the state's capital."
    },
    {
        "id": "0789fa4309c94334a288adfbb6cb855e",
        "title": "The Golden Gate Bridge",
        "content": "One of the most beautiful, and recognizable California landmarks is the Golden Gate Bridge in the city of San Francisco. The bridge spans the San Francisco Bay, and is part of a network of five main bridges that cross the bay in the San Francisco and Oakland area. The region with its bay has one of the most breathtaking views in the world, and part of which is the historic Golden Gate Bridge.\nIt is perhaps the most iconic and recognizable landmark in the entire United States. Construction on the bridge began in 1933, while the country was deeply mired in the Great Depression. Many people think the bridge was, in large part, responsible for the country's economic recovery because of the number of workers employed. The material used to build the bridge also contributed to the manufacturing, distribution, and transportation.\nThe bridge connects San Francisco to the San Francisco peninsula in Marin County through both California State Route 1, and U.S. Route 101. Before the bridge was built, the only way to get from one location to the other was to go around the bay, or to take a ferry across. Construction of the bridge was controversial at the time. Many thought the project was simply too complex, expensive, and dangerous to build. The construction plan approved concentrated on safety for the workers who would be involved in the construction, and it worked well until February 17, 1937. Remarkably, only one worker had died up to that date, but on that date, a scaffolding collapsed killing 10 men in the tragic accident.\nThe bridge was completed later that year, and has been in use ever since. It is one of California's great landmarks with people from all over the world drawn to see it."
    },
    {
        "id": "da758cbc144e443bb525f6fb804cdf99",
        "title": "The San Francisco Cable Cars",
        "content": "One of the most historic, and significant landmarks in the United States is the San Francisco cable car system. It is the world's only, manually operated cable car system. It is run by the San Francisco Municipal Transportation Agency. The system dates back to 1878, when the California Street line first opened. In all, there are three lines currently operating in the city, and boasts a fleet of 12 cable cars. There used to be 23 lines in use throughout the city connecting the diverse communities that make up San Francisco. The open-air cars are a major tourist attraction, and are still used by San Francisco commuters on a daily basis.\nThe simple reason cable cars were first used in the city was because of its landscape. San Francisco is very hilly, which makes it impossible for municipal buses to scale. The solution for this problem was the cable car. These cars are literally pulled by cable, up and down the steep hills of the city, making it easier for people to get from one end of the city to the other.\nThere are two types of cars in use today. Single-ended cars and double-ended cars. The single-ended cars have open-sided sections with seats that face outward to the street. The rear section of these cars is enclosed with seats facing the interior of the car. These cars seat 29 passengers. They travel in both directions by using a swivel-based turntable that turns the car at the end of the line. The double-ended cars are a bit larger, and can hold up to 68 passengers. It has 34 seats, and grips for an additional 34 standing passengers. The best feature of these cars is the pure fun they are to ride. People who ride the San Francisco cable cars are stepping into part of California's history."
    },
    {
        "id": "f966210e9cd1453cbbdb8ab8cdcaaa6c",
        "title": "Car Chase Television",
        "content": "Car chases in the Los Angeles area are a fairly regular occurrence. In 2013 there were over 700 car chases. Car chases also have become a source of entertainment. Many car chases are captured on video and broadcast live as they are happening. No one has to wait until the six o'clock news comes on anymore to find out about what happened. People can tune in to their local broadcast television station and see it happening in real time. These car chases are often captured with the help of a news channel's helicopter. The helicopter follows and films the chase through the streets, reporting what streets the cars are passing through.\nPeople like watching car chases for many reasons. They are intense, and filled with drama. A viewer never knows what will happen next. Will the driver give up easily? Does the driver have a weapon? Will the driver get into an accident? Will someone crossing the street get hit? Tune in to find out! Many channels see their ratings soar when they air car chases. They are just giving the people what they want.\nPolice are not always happy with the media covering car chases live on the air. Police worry that people trying to escape enjoy the attention. Police feel that broadcasting car chases encourages people to escape. Police also worry that the attention brings innocent bystanders to the street. Someone could get hurt. The media insists they have the right to show car chases. They feel they are informing the public.\nCar chases happen for many reasons. Sometimes police will chase someone who stole a car. Other times the police may try to do a routine traffic stop. However, the driver with the broken taillight may have a warrant for arrest, so off he drives."
    },
    {
        "id": "9bf56ba3a49e48a7b1589357745dc8ba",
        "title": "Los Angeles Coroner's Office",
        "content": "In Los Angeles, places associated with death are often popular. One such popular place is the Department of Medical Examiner-Coroner. When someone dies and the cause of death is undetermined or suspicious, the body is brought here for examination. It is the coroner's job to determine the time, cause, and manner of death. Sometimes the coroner will have to perform an autopsy, which is like an operation on a dead body to try to figure out how the person died. One of the reasons the L.A. Coroner's Office is so popular is because of the number of famous people who have been examined there. Some of those people include Marilyn Monroe, Robert F. Kennedy, Michael Jackson, and Whitney Houston.\nThe Los Angeles Coroner's Office is so popular that there is even a gift shop where visitors can buy items like shirts, caps, and mugs with the Coroner's logo on them. One tee-shirt people can buy even says, \"Our bodies of work speak for themselves\". They even sell beach towels with body outlines. The store is open five days a week. They also have a website and a paper catalog for those who are not close enough to visit. The Coroner's Office claims the purpose of the store is to tell people how fragile life is and to create awareness and responsibility toward one's actions. Some people feel that having a store in the same place where dead people are is disrespectful.\nThere have been a number of television shows about the L.A. Coroner's Office. Some of these are reality TV shows featuring what workers really do there. An example is called \"Death Detectives\". Other shows are fictional like \"Quincy M.E.\" The M.E. stands for medical examiner, the person who performs the autopsies."
    },
    {
        "id": "00ca85b274b842fbb64ffd11d01f6f8c",
        "title": "Museum Mile in New York City",
        "content": "On one of New York City's most famous avenues, Fifth Avenue, is Museum Mile. Museum Mile is a 23-block stretch that holds some of the most famous museums in the world. Museum Mile begins at 85th Street and Fifth Avenue with the massive Metropolitan Museum of Art. Inside is thousands of years worth of art and artifacts. A visitor can visit an entire Egyptian tomb, sit in a Japanese style garden, view Renaissance paintings, and ancient Greek and Roman sculptures. There is even a gallery featuring musical instruments. In the summer, there is a rooftop garden where there are spectacular views of the city, especially of Central Park.\nThe Guggenheim, on 88th Street and Fifth Avenue, looks a little bit like a snail's shell from the outside. When it opened in the 1950's, the swirling architecture, designed by Frank Lloyd Wright, was thought to be ugly by many. This museum focuses on modern art, but sometimes features special exhibits like one they had a few years ago of ancient Mexican ruins. The National Academy Museum and School of Fine Arts on 91st Street and Fifth Avenue is the city's oldest art school, dating back to 1825. The Jewish Museum on 93rd Street and Fifth Avenue, tells 4,000 years worth of Jewish History. Up ten blocks on 103rd Street and Fifth Avenue is the Museum of the City of New York, showcasing the history of the Big Apple from its colonial start.\nOne block up on 104th Street and Fifth Avenue is El Museo del Barrio. This museum started as a space to reflect the city's large Puerto Rican migrant community. Now it features exhibits focusing on art from all over Latin America. Across the avenue is the Central Park Conservatory Garden, with a fountain that has a sculpture of three dancing life-size women."
    },
    {
        "id": "ef909143ba6f48048aa18ed2e3fd2928",
        "title": "A Building for the Empire State",
        "content": "The Empire State Building may be the most famous building in New York City. It is called the Empire State Building because New York State is called the Empire State. It is 1,454 feet tall. Many people think it is the tallest building in the world. This was true when it was built in 1931. In 1970, when the World Trade Center was built, that became the tallest building. Now, the Empire State Building is the fourth tallest building in the U.S. and the 23rd tallest in the world. Inside the building is mostly occupied by offices and stores.\nPeople can go to the top of the building, where there is an observation deck. From the top there are beautiful views of New York City, especially at night. Most people take one of 73 elevators to the top. It takes less than one minute by elevator to get to the 80th floor. That is where there is a gift shop. Some people walk 1,860 steps to the top. Every year there is even a race, with people competing to see who can walk up to the top the fastest.\nThe landmark is not just famous because of its height. In 1945, a small plane crashed into it. More than 30 people have tried to kill themselves by jumping off the building. In 1933 it was featured in the movie King Kong, where a giant gorilla climbs to the top and falls to his death after being attacked by airplanes. The building was also in the movie Sleepless in Seattle with Tom Hanks.\nAt night, the top of the Empire State Building is lit up in different colors. It is red and green on Christmas, red for Lunar New Year, and blue for Hanukkah. On the Fourth of July it is red, white, and blue."
    },
    {
        "id": "ee4905719a0747c0ab5155d07836b7e3",
        "title": "The Statue of Liberty Enlightening the World",
        "content": "Most people don't know that the full name of the Statue of Liberty is \"The Statue of Liberty Enlightening the World\". She is a symbol of freedom, especially for many immigrants. When many immigrants came to the United States in the late 1800s, Lady Liberty in New York Harbor was a sign to tell them that they had made it to America. Inside the base of the statue there is a plaque with a famous poem written on it. The poem is \"The New Colossus\" by Emma Lazarus. Many immigrants feel this poem speaks to them the reasons they came to America. One line of the poem is: \"Give me your tired, your poor, your huddled masses yearning to breathe free\". Lady Liberty was not always green. She used to be copper colored, but the years have caused the copper that the statue is made of to change color.\nThe 151-foot tall sculpture was a 100th birthday gift from France to the United States in 1886. It is located on Liberty Island right off the southern tip of Manhattan, New York City. The only way to get there is to take a ferry. Inside the base of the statue is a museum. To get to the crown, people have to climb 377 steps up a double spiral staircase from the feet of the statue. There is no elevator. People need to be in good shape to climb to the top. People used to be able to climb up to the torch of the statue, but it was shut down because it was too easy to fall off.\nAbout four million people visit the Statue of Liberty every year. People who can't go to New York can see replicas in Las Vegas and other parts of the world."
    },
    {
        "id": "c6e93cde799f4616a03c08d67701d672",
        "title": "Rockefeller Center: Top of the Rock",
        "content": "Rockefeller Center is a complex of 19 buildings. It is named for a famous New York City business magnate, John D. Rockefeller, who built the group of buildings from 1930-1939. The most famous building in the complex is the General Electric building where NBC television studios are based. It is smack in the middle of Manhattan, New York City, between Fifth and Sixth Avenues and between 48th and 51st Streets. The address of the GE building is 30 Rockefeller Plaza. That's how the show \"30 Rock\" got its name. The show was filmed there. Saturday Night Live, a popular American late night show, is also filmed there. Visitors can get tickets to see a show being taped and can also tour the studios.\nVisitors to Rockefeller Center can visit the plaza, which becomes an ice skating rink in the winter. Every year a huge Christmas tree is placed there and thousands of people attend the tree lighting ceremony, which always features famous singers. In the spring, summer, and fall, the plaza becomes a cafe. In the middle of the plaza is a statue of the Greek god Prometheus. His myth states that he brought fire to the world. 200 flags from all countries of the United Nations surround the plaza.\nRadio City Music Hall is another famous building in Rockefeller Center. Many musicians give concerts here, but it is best known as the home of the Rockettes, a dance company named for Rockefeller Center. They are famous for their kick lines and are best known for performing in the Radio City Christmas Spectacular, an annual musical holiday stage show."
    },
    {
        "id": "73112d2a5faf4643ac32664fa1c4a37f",
        "title": "Manhattan, New York City",
        "content": "Manhattan is a small island  that is one part of New York City. New York City, \"the Big Apple\", is actually made up of five sections called boroughs. These boroughs are Manhattan, Queens, Brooklyn, Staten Island, and the Bronx. Manhattan has the most people of all the boroughs, about 1.5 million, even though it is the smallest borough by size. If you send a letter to someone who lives on Manhattan, don't write Manhattan on the envelope. You should write \"New York, New York\", like the famous  Frank Sinatra song.\nBecause the island is so small, most people live and work in tall buildings. Some of these buildings are called skyscrapers because it looks like they are touching the sky. Some famous skyscrapers in Manhattan are Empire State Building, Chrysler Building, 70 Pine Street, Trump Building, GE Building, and Citigroup Center. Manhattan is connected to the other boroughs by a series of bridges and tunnels. The most famous bridge may be the Brooklyn Bridge because of its brick arches. The New York City subway, a massive mass transit system that mostly runs underground, also connects the island to the rest of the boroughs.\nManhattan, like the other boroughs, has many different neighborhoods, many of which are named for the ethnic communities that first lived there. Some of these neighborhoods include Little Italy, Little Germany, Little Brazil, Chinatown, and Koreatown. One of the most famous parts of Manhattan is Times Square. Times Square is called the crossroads of the world. Every year millions of people gather there on New Year's Eve to watch an illuminated crystal ball drop. There are many theaters around Times Square. Most of these theaters are on Broadway, a famous street considered the home of the American theater industry. Another famous Manhattan street is Fifth Avenue. A part of the avenue features expensive designer stores like Tiffany's. Fifth Avenue is also famous for its Museum Mile."
    },
    {
        "id": "855faaed884743a1822eeaf75e092e21",
        "title": "Las Vegas, Nevada",
        "content": "For many years, gambling in the United States was legal only in the state of Nevada. Nevada is a western state that is east of California, south of Oregon and Idaho, west of Utah, and north of Arizona. It is a desert state where little rain falls during the year. It is a little more than 275 miles from the city of Los Angeles, which is where most of its visitors come from. Driving from Los Angeles is about four hours. Las Vegas, which means the Meadows in Spanish, was established by the Mexicans in the mid-1800s. Much of what is now the southwestern part of the United States was then part of the Mexican Empire. The city was a railroad town established in 1905, and the first legal casino appeared in 1931.\nLas Vegas is now a gambling town, where people from all over the United States come to vacation. Its population is under 2,000,000, making it the 30th largest city in the country. Its original population in 1905 was only 5,000. Much of the city's growth is due to the gambling industry. Many states have since legalized gambling, including New Jersey, and California, but Las Vegas remains the No. 1 tourist city for gamblers in the U.S. Today some of its largest and most beautiful hotels include Bellagio, Flamingo, Caesars Palace, Treasure Island, Mandalay Bay, and Wynn. These hotels are on Las Vegas Boulevard, which is commonly called \"The Strip.\" With its nearly year-round sunshine, beautiful casinos, and variety of gaming options, Las Vegas remains the best location for gambling in the U.S."
    },
    {
        "id": "aac01bdfaa8a4345a02fe7b331cf5198",
        "title": "Mr",
        "content": "Mr. Rogers' Neighborhood was one of the most successful and well-liked children's show in the history of Public Television. Public TV differs from the more common commercial television in that it is not funded by advertising revenue. Public Television is a network of television stations throughout the country that is dedicated to bringing alternative programming to the people of the United States.\nMr. Rogers' Neighborhood ran from February 1968 through August 2001, and was hosted by the show's namesake, Fred Rogers. It was a half-hour children's show that featured the popular Rogers as host. It is often referred to as the Mr. Rogers show.\nRogers began his show in 1953 on a PBS station in the northeast part of the country as the Children's Corner. He performed as a puppeteer, and it was aired on live television. There Rogers developed many of the characters that would become famous as his show progressed. In 1967, his show went on the national TV stage, and remained there until 2001.\nRogers' style and calm demeanor made him an instant celebrity who was well-liked by both children and adults. In his early life, Rogers studied to become a Presbyterian minister, but didn't like how children's programming was being presented. He began writing children's songs, and soon began his own local show on public television. During the next three decades, Rogers became a true American icon through his show. His great compassion, morality, and patience were possibly his most liked characteristics.\nRogers was not only a great TV personality, he was also a human rights advocate. He received the Presidential Medal of Freedom, as well as the Peabody Award for meritorious public service. Rogers was inducted into the Television Hall of Fame, and has received approximately 40 honorary degrees."
    },
    {
        "id": "b1f59f74dbef4ddc95bfae1dd6453b3b",
        "title": "The Cinco de Mayo Celebration",
        "content": "The Cinco de Mayo, or Fifth of May, is a holiday celebrated by Mexicans in the United States. Before 1776, much of the southern and western states, such as Texas, New Mexico, Colorado, Nevada, Arizona, and California were part of Mexico. Following the war between the U.S. and Mexico in the 1800s, these states became part of the United States, but there still remained a very large Mexican population.\nThe Latino population is the largest, single ethnic group in the country. It accounts for 17 percent of the nation's population, and 63 percent of those Latinos are of Mexican origins. The Cinco de Mayo is a large celebration in the country's southwest region. It celebrates the Mexican victory in the Battle of Puebla, against France on May 5, 1862. Curiously, the day is celebrated more in the United States than it is in Mexico itself.\nIn Los Angeles, the city celebrates the event with the Fiesta Broadway, which is the largest Cinco de Mayo celebration in the world. More than half a million people come to downtown L.A. to participate in the street fair that covers 24 square blocks. The celebration takes place on the last Sunday of April. There are rides, games, and especially food at this celebration and it is growing every year. Los Angeles is not the only Southland city to host Cinco de Mayo celebrations. The cities of Corona, West Los Angeles, and Commerce also have events, and the famous Olvera Street celebration in downtown L.A. is also very popular.\nOne of the most unique Cinco de Mayo events takes place in the Hancock Park district of Los Angeles. It is called the Single de Mayo. This celebration is an annual charity event that began in 1999. It is a private party that benefits the homeless by providing shelter and support. Cinco de Mayo is a truly American celebration."
    },
    {
        "id": "9109305fbc414585861750f06df432db",
        "title": "The Attack on Pearl Harbor",
        "content": "On December 7, 1941, the United States of America was attacked by the Imperial Japanese Navy at Pearl Harbor, Hawaii. The surprise attack was intended to destroy the American Pacific Fleet that stood in the way of Japan's complete domination of the Pacific Ocean during the 1940s. The attack was coordinated with attacks in the Philippines, Malaysia, Singapore, and Hong Kong. Pearl Harbor was attacked by more than 350 Japanese airplane fighters, bombers and torpedo planes that were launched from six aircraft carriers.\nThe early-morning attack sank four U.S. battleships, and four more were heavily damaged. Six of the eight battleships were restored, and returned to service, but the Japanese also destroyed, or damaged three cruisers, three destroyers, a minelayer, and an anti-aircraft training ship. In addition, 188 U.S. aircraft were destroyed, with many of them on the ground. The attack was devastating. It took the U.S. years to recover from all the damage caused on that fateful morning. However, the Japanese were unable to destroy their main targets, the Navy's aircraft carriers. By what some call a stroke of luck, the U.S. carrier fleet was out to sea at the time of the attack.\nThe country was in shock at the news of the disaster. U.S. President Franklin Delano Roosevelt called the attack cowardly, and declared December 7th as \"A day that will live in infamy.\" On December 8, the United States formally declared war on Japan. This plummeted the country into World War II, which Roosevelt had long hoped to avoid. Soon after the United States' declaration of war against Japan, Germany, which was a Japanese ally, declared war on the U.S. and the country was now fully involved in the greatest war in the history of the world."
    },
    {
        "id": "bbb15c7b5afa4a0ea131f071de1621f4",
        "title": "Funeral Customs in the United States",
        "content": "America is one of the most diversified countries in the world. It is comprised of many different cultures from Latin America,  Europe, Asia, and Africa. It is truly a melting pot of diversity. All these cultures have come together to create a new culture - an American culture. Many of the traditions, customs, religions, and celebrations of these cultures have been adopted into American culture, including funeral traditions.\nTraditional American funerals are basic. They usually include some sort of religious ritual, followed by a procession to the burial grounds, and a small ceremony at the grave site, but these vary depending on the culture. At most American funerals, the deceased person's family sends out a death announcement called an obituary. These obits normally serve to pass information to others about the deceased, and the time and day of the funeral event. At the church service, the deceased is usually eulogized by friends and family. This is where a person goes up to the front of the crowd to say a few things about the deceased, and how he or she affected their life. The procession usually takes the form of a caravan of private cars, and trucks that follow the hearse, which contains the deceased's coffin, and remains.\nAt the gravesite, another small ritual takes place where the deceased is given a blessing from a member of the clergy. Friends and family are then allowed to say goodbye to the deceased. There is an American tradition of picking up a handful of soil, and tossing it on the coffin as a way of saying farewell to the deceased. The family then gathers at a home, or restaurant with some of the attendees to have a meal, and to exchange stories before going on their way. Most cultures in the U.S. have adopted this traditional American funeral ritual, but many include features that are unique to their individual culture."
    },
    {
        "id": "aa4f62db173f4c19b7c7dc466625736e",
        "title": "The John F",
        "content": "One of the most significant dates in the history of the United States is November 22, 1963. That is the day President John Fitzgerald Kennedy was assassinated in Dallas, Texas while riding in an open-air car. The president was visiting Texas for the first time since his inauguration in January, 1961. Kennedy was one of the most popular presidents in the history of the United States, and still remains so today. His death shocked the nation for several reasons, but mostly because it was televised on a live broadcast. Kennedy was the first president to appear on television at a time when most Americans owned a TV. He was not the first president to be televised, but previous presidents who appeared on TV did not reach the general public because before 1960, not many Americans owned a set.\nKennedy was warned not to ride in an open-air car that day by his bodyguards, but he wanted the public to see him live. He did not want to be hidden behind an armored car. According to the official government commission, Kennedy fell victim to a single assassin, Lee Harvey Oswald, but many Americans dispute that finding to this date. Police say Oswald shot the president from a building while Kennedy rode in his car with his wife. The mood was festive at the time as the city of Dallas welcomed the president to Texas. Kennedy was a handsome, young president who was the youngest man ever to reach the presidency.\nOswald later killed a Dallas police officer during his escape from the crime scene, but was soon found hiding in a movie theater. He required police protection from an outraged public, and was held in protective custody. Oswald, who was a former member of the U.S. military, was unhappy with the president for his policies, but never admitted to being the assassin. Conspiracy theories involving rival political parties, the Cuban government, and organized crime have also been advanced as to who actually killed Kennedy."
    },
    {
        "id": "033e0ca4fd554aad9eca635facb680c9",
        "title": "Social Class in the United States",
        "content": "Generally people's \"class\" is defined by how much money they make. In the U.S. generally there are three classes: poor, middle class, and rich. Some people also think there is another class in between poor and middle class called working class. United States culture is based on the idea that people can move up the economic ladder and become middle class or even rich if they were born poor. This is the idea of going from \"rags to riches\". Moving up the class ladder is not easy though. Higher education needed to get a good paying job is expensive.\nClass in the United States is more than just how much money a person makes though. Education, what job a person has, where they live, and the culture, all play a role in what class a person will be classified as. For example, a person with only a high school diploma and a low-paying service job may be considered poor or low class. While a person with a Ph.D., who owns their own company, would be considered high class or wealthy.  In a way this makes sense because high-paying jobs usually require a high-level education. But for some people, class is something you are born with. For example, the children of billionaire Donald Trump were born rich and upper class without having done anything to earn that status.\nGender plays a role too in how someone can move up the economic ladder. Women earn less than men do, so it is harder for them to accumulate wealth. Race also plays a role in how much people earn and their ability to move up the economic ladder. In the United States, most families require both the man and woman to work in order to support the household."
    },
    {
        "id": "f133c0b911724977b845cae214ace530",
        "title": "Rosa Parks and the Civil Rights Movement",
        "content": "Rosa Parks is a prime example of how an ordinary American can change the world around her. She was born in 1913, in the southern state of Alabama. Parks became famous for challenging a discriminatory policy in the city of Montgomery, Alabama. During the 1950s, Black Americans in the south were not allowed to ride in the front seats of public buses if a white person needed that seat. Blacks were expected to get out of their seats, and go to the back of the bus, which was designated as \"Colored Only.\"\nOn December 1, 1955, Parks refused to obey the bus drivers order to surrender her seat to a white passenger who had boarded the bus. Even though Parks was seated in the Colored Only section, the bus was filled, and she was required by law to give her seat to the white rider. Parks was arrested, and charged with civil disobedience. She later said  she had grown \"tired of giving in.\"\nHer arrest and subsequent trial made Parks a national symbol for the Civil Rights Movement. Her arrest also lead to the Montgomery Bus Boycott that was a political and social protest campaign against racial segregation. Although the boycott only lasted 21 days, it was instrumental in the Supreme Court decision to declare Alabama's practice of segregation unconstitutional.\nParks has remained a symbol for the Civil Rights Movement even after her death in 2005 at the age of 92. She has been called the \"First Lady of Civil Rights,\" by the United States Congress, and \"The Mother of the Freedom Movement.\" She has been honored by the U.S. government with prestigious awards such as the Presidential Medal of Freedom, and Congressional Gold Medal. She has been honored with her own museum in Michigan, and has received several other civil rights awards both before and after her death."
    },
    {
        "id": "87c1a32dab75427da96ef8b2062d1961",
        "title": "Chicago: The Windy City",
        "content": "Chicago is known as the \"Windy City\". Some people think this is because of the breeze that blows almost constantly. The city is located in the state of Illinois on the shore of one of the Great Lakes, Lake Michigan, which is the fifth largest freshwater body in the world. Chicago may also be called the windy city because of the wind tunnel effect created in downtown by many tall buildings.\nSkyscrapers are an important part of Chicago's history. The first skyscraper in the U.S. was built in the city in 1884. At only 10 stories, it was impressive for its time.  The skycraper was eventually demolished. Chicago is the home of other famous firsts. It was the birthplace of the refrigerated rail car, mail-order catalogs, the car radio, the TV remote control, the first Ferris wheel, the first steel rail road, the first planetarium in the Western Hemisphere. Chicago is also the home to the first blood bank and the first drive-in bank. It is also the home to The Lincoln Park Zoo, the oldest public zoo in the U.S. Maybe the windy city should be called the city of firsts.\nChicago is the third most populous city in the U.S., after New York City and Los Angeles. A little more than two and a half million people live in the city that has more than 100 neighborhoods. President Barack Obama used to live in Chicago.\nNearly 40 million people visit Chicago every year.  Many of them visit the Willis Tower. Formally known as the Sears Tower, it is the tallest building in the Western Hemisphere. It takes only a minute to get up to the 103rd floor Skydeck thanks to some of the fastest elevators in the world. From the Skydeck visitors can see four states: Indiana, Illinois, Michigan, and Wisconsin."
    },
    {
        "id": "8a1a7b8f4a2c480fb81a67e8d8146126",
        "title": "Boston: A Revolutionary City",
        "content": "Boston is the capital of Massachusetts. It is the largest city in the New England state and is rich with history. This is why over 12 million people visit the city every year. It is a very old city, founded in 1630 by English colonists fleeing religious persecution. The American Revolution, when colonists, known as patriots, fought for their independence from the British, began in Boston with the Battle of Lexington. Other key events in the revolution occurred in the city. One was the Boston Massacre, when British troops fired upon protesters, killing five. The Boston Tea Party, when colonists dumped an entire shipment of British tea into the harbor to protest taxes, was not a party at all. Paul Revere's \"midnight ride\", where he warned colonists of British troops approaching, also happened in Boston. Many of these sites can be accessed by taking a walk down the \"Freedom Trail\", a red line of bricks embedded in the ground through the city.\nBoston is also a city of notable firsts. America's first public school was founded in Boston in 1635. Boston Common, where British troops camped during the American Revolution and where early colonists hanged people, is the oldest public park in the United States. Boston is also home to the oldest subway system in the United States.\nLike many cities in the United States, immigrants played a large role in its development. Irish immigrants who settled in Boston, for example, played a large role in both local and national politics. Boston also has a large and active Puerto Rican community and Italian community. President John F. Kennedy and his family have ties to Boston.\nBoston is also   well known for many colleges and universities that surround it. Some of the most famous are Harvard and the Massachusetts Institute of Technology. Boston attracts more than 350,000 college students from around the world."
    },
    {
        "id": "2881bb25a00e437dabd12c0453a920b4",
        "title": "A Nation is Born",
        "content": "The American Revolution was a war of independence fought by those living in the 13 colonies of North America against Great Britain. Those living in the colonies were especially angry about taxes the British were forcing them to pay. People felt taxes were unfair because there was no colonial representation in the British parliament. One tax was the stamp tax, which taxed printed materials such as newspapers. The colonists called this \"taxation without representation\". Colonists who wanted freedom from English rule were known as Patriots. Those who supported British rule were known as Loyalists. Before full scale war broke out, there were many acts of protest by patriots, like the Boston Tea Party when Bostonians boarded British ships and dumped 342 chests of tea into the harbor because of a tea tax. On April 19 the first shots were fired in Lexington and Concord, Massachusetts, which officially started the war.\nMany people were involved in the struggle for independence. Benjamin Franklin, Thomas Jefferson, and John Adams worked together to write the Declaration of Independence. On July 4, 1776, patriots declared themselves free. Most people know George Washington was the first president of the United States. Before that he was the commander-in-chief of the patriot army. Most of the battles in the American Revolution were fought in the northeast in places near Boston, and New York.\nThe British, known as redcoats because of their red uniform jackets, had help from German mercenary soldiers called Hessians. Patriots had support from other Europeans. France entered the American Revolution on the side of the colonists in 1778. This helped force the British surrender at Yorktown, Virginia, in 1779. However, fighting would not formally end until 1783 with the Treaty of Paris when Great Britain recognized the United States as an independent nation."
    },
    {
        "id": "6c7ee448bc10416e97063bbdc0db65bf",
        "title": "The American Civil War",
        "content": "The American Civil War happened from 1861 to 1865. The main cause was Southern states feeling that the U.S. federal government in Washington D.C. should not have the power to tell them what to do. This was especially true about two issues, taxes and slavery. The Southern economy was based on agriculture while the Northern economy was based on manufacturing. Southern crops  like cotton were sold to factories and then Southerners had to pay taxes on the finished goods sold back to them like clothing. Many Southerners felt this was unfair. Additionally the agricultural economy in the south was reliant on the labor of enslaved Africans and their descendants. Many people, especially from the North, felt this was wrong and that slavery needed to be abolished. Southerners felt the abolitionists were threatening their way of life. Seven Southern slave states, banded together, declared their secession and formed the Confederate States of America. The government in Washington D.C. and its army was known as the Union, since they were fighting to keep the country united.\nAbraham Lincoln was president of the United States during the Civil War. The President of the Confederate States was Jefferson Davis. The first battle was the Battle of Fort Sumter. During the war President Lincoln issued the Emancipation Proclamation, which declared the freedom of slaves in the Confederate States of America. This action was supposed to show that Lincoln was still in charge of the entire United States.\nThe Civil War was the bloodiest war fought inside the United States. 620,000 were killed and millions more were injured. One of the bloodiest battles of the Civil War was the Battle of Gettysburg in Pennsylvania. 51,000 people from both sides died, more than in any other battle. The Civil War ended in 1865 when General Robert E. Lee of the Confederate Army surrendered."
    },
    {
        "id": "5b97463ff6aa46269fcdc5a7447ec03b",
        "title": "Fires that Changed Cities",
        "content": "Fires are destructive. They also create changes. In 1871 a fire burned most of Chicago to the ground. Many people think the fire was started when a cow knocked over a gas lamp. Most of the city at the time was built of wood. This, combined with the famous Chicago winds and a drought, made the city burn down quickly. The fire lasted for three days. 100,000 people were left homeless, and at least 300 were killed. What was amazing was how quickly the city was rebuilt, eventually becoming the third most populous city in the United States.\nThe Great Boston Fire of 1872 created a property damage of $73.5 million,  more than any other fire in the U.S. history. Most of Downtown Boston and the financial district burned down in the fire that began in a warehouse basement. 30 people died, and thousands lost their jobs and their homes. However, the city was rebuilt in two years. It began enforcing building regulations because of the fire.\nThe 1911 Triangle Shirtwaist Factory fire in New York City caused the fourth highest loss of life from an industrial accident in the U.S. history. 123 women and 23 men, all garment workers and mostly poor immigrants, died from the fire, smoke inhalation, or falling or jumping to their deaths. Child labor was not uncommon. The youngest victims were two 14-year-old girls who worked  in the factory. So many people died because the owners of the factory locked the doors to the stairs and exits. This was to prevent the workers from taking breaks and stealing. As a result of the fire and huge loss of life, many people began protesting poor working conditions. The U.S. Congress passed laws improving factory safety conditions. Women workers also formed a union to fight for better working conditions."
    },
    {
        "id": "94de45d6a5584e5da43039ec7bbf7620",
        "title": "A Bewitched City",
        "content": "Salem in the state of Massachusetts is called the \"Witch City\", but don't be afraid. There aren't women wearing pointy black hats riding around on brooms. The New England city is called the Witch City because of an infamous set of trials that happened there in 1692 to 1693. At the time, the city was just a town in the British colony of Massachusetts. The Salem Witch Trials accused more than 200 people of being witches. People believed witchcraft was real and was criminal. Among the accused were women, men, and even children. Nineteen people were sentenced to death. They were all hanged. One of the accused was tortured with heavy rocks being placed on him until he was crushed underneath the weight. Seven others died in jail.\nThere was never any proof that those accused, and convicted were really witches. Historians think that people would accuse people because of family feuds. Other historians think that a domino effect occurred, with people becoming hysterical after one accusation. Fear of witches spread like a disease.\nThe Salem Witch Trials have become a part of the city's history. \"The Crucible\", a play about the trials by Arthur Miller, has been turned into a movie. The city is not ashamed of its past, but rather uses it to teach tolerance and earn some tourist dollars. There is a memorial dedicated to the innocent people who died because of the witch-hunts. There is a \"Witch Museum\" that tells the story of what happened. Many people visit Salem around Halloween. Salem police cars have witch logos. A local public school is known as the Witchcraft Heights Elementary School, and the Salem High School sports teams are named the Witches. Films and television shows featuring fictional witches have been filmed in Salem, including \"Hocus Pocus\" and \"Bewitched\"."
    },
    {
        "id": "6efaca6a77b1419aab46286e78b74feb",
        "title": "The United Nations in New York City",
        "content": "The United Nations, an international organization founded in 1945 after the Second World War by 51 countries, has its headquarters along the East River in New York City. Technically anyone who visits UN Headquarters is not in New York anymore. They are not even in the United States. That is because the land and buildings are considered international territory. The United Nations has its own flag, its own post office and its own postage stamps. There is no need to change currency, however. The UN uses the U.S. Dollar. Six official languages are used at the United Nations. They are Arabic, Chinese, English, French, Russian, and Spanish. UN rules override the laws of New York City. This does not mean that people can commit crimes there and get away with it. There is no immunity to those who commit crimes there.\nThe property where the United Nations now stands used to belong to a slaughterhouse. The current buildings were completed in 1952. The perimeter of the UN is lined with flagpoles with the flags of all 193 UN member states and the UN flag. They are arranged in alphabetical order in English.\nSome may think it's great to be a neighbor to a peacekeeping agency like the UN. Many New Yorkers don't always think so though. Every time a dignitary like a president or prime minister visits, streets are closed, making it hard to get around and to find parking.\nYou don't need to be a diplomat to visit the UN though. There are tours Monday through Friday and not just in English. Guided tours are available in English, French, German, Italian, Japanese, Korean, Mandarin, Portuguese, Russian, Spanish, and Swedish. Visitors can have a meal at the Delegate's Dining Room featuring a buffet of food from all over the world."
    },
    {
        "id": "00f1617ba367439d9db69545578385db",
        "title": "New York City: The Big Apple",
        "content": "Apples don't grow in New York City, so that's not why it is called the Big Apple. There are many legends about how the city that never sleeps got its name. One story says that a famous brothel owner named Eve gave the city its name. Another version of history claims the name has its roots in show business with performers calling New York the \"Big Apple\" since it was the best place to get noticed. There is one legend that says the city got its name because of the large number of unemployed selling apples on the streets of New York City during the Great Depression.\nThe term more likely has its roots in horse racing from the 1920's. Prizes were called \"apples\" and a newspaper reporter when writing about races often would call the big prize the big apple. In fact, the \"big apple\" soon was used to mean any big city. In the late 1920s through the 1940s, \"The Big Apple\" was not just a nickname for New York, it was also the name of a song, a dance, and a place to dance and sing. New York City was the heart of the jazz music scene in the 1930's and 1940s. In Harlem, uptown Manhattan, there was a club called \"The Big Apple\". There was also a 1938 short film of the same name featuring black jazz  musicians and dancers.\nIn the 1970s, the city tourism agency began using the term the \"Big Apple\" on purpose. There is even a street corner in Manhattan called \"Big Apple Corner\". One New York City baseball team, the New York Mets, have a big red apple that pops out whenever the Mets hit a home run in their stadium Citifield. While the origins of the \"Big Apple\" nickname are unclear, it seems to be here to stay."
    },
    {
        "id": "e726d30cd42e4d0ea739f416bca18b91",
        "title": "The World Trade Center",
        "content": "The original World Trade Center opened in New York City in 1973. The most famous part of the complex of buildings was the Twin Towers. They were named because there were almost exactly the same. The only difference is that one had a tall antenna on the top.\nWhen they were built, the 1,368-foot tall buildings were the tallest in the world. Such tall buildings needed a way for people to travel in them. The towers had 95 elevators in total. Visitors used to travel to the 107th and 110th floors, where there were observation decks from which one could see the entire city and New Jersey. Inside there were offices, shops, a hotel, and on the top floor of one of the towers there was a restaurant called \"Windows on the World\". The restaurant even hosted a salsa night on Thursdays. A number of subway lines ran underneath the towers. The World Trade Center Complex, with a total of seven buildings, was so large that it had its own zip code. In 1974 a French man walked a tightrope between the twin towers.\nThe World Trade Center survived a bombing in 1993. The skyline and spirit of New York City were changed after September 11, 2001. That morning, two planes crashed into the World Trade Center in downtown Manhattan. At first the top floors of the buildings were in flames. Soon they came tumbling down, covering lower Manhattan in hot metal and ash. A total of 2,753 people died. For weeks the air smelled of burnt metal and plastic. It took eight months for the site to be cleaned. Years later, The World Trade Center is rebuilding. There is a new tower, called the Freedom Tower. There is also a memorial and museum to honor those who died in the 2001 attack."
    },
    {
        "id": "70a6926398474c98abc138ca37ee1b22",
        "title": "Central Park",
        "content": "Green isn't the first word that pops into most people's head when they think of New York City. Yet, in the middle of Manhattan Island is the most visited park in the United States, with 35 million visitors a year. Central Park, a National Historical Landmark, takes up 843 acres of land. It is a green space where people go to escape the noise and crowds of urban life. Before it opened in 1857, it wasn't an empty space. People lived on that land. They were mostly poor free blacks, Irish, and Italian immigrants. They were forced off the land to construct the park.\nOne section of the park is called Sheep Meadow. Now it's just a grassy area where people can lie in the sun, but actual sheep used to graze there from 1864 to 1934. The sheep from there were eventually moved to another park in the city. Many events take place in Central Park, especially in the warm spring and summer months. There is an outdoor theater, where Shakespeare's plays are performed. The plays are free, which causes such high demand that people line up for hours before performances to get inside. There are also free music concerts. Every summer a stage is set up. These Summer Stage concerts feature musicians from all over the world. Both the New York Philharmonic Orchestra and the Metropolitan Opera also host free performances in the park in the spring and summer. There are also two small zoos inside the park, and a number of small lakes in the park. One of the lakes rents out small mechanical sailboats. There is also a puppet theater and a carousel for kids.\nThe park is not dead in the winter. When it snows, families often go to sled or to go ice-skating in an outdoor rink owned by Donald Trump."
    },
    {
        "id": "8dbd2062789f40d0bf4660444a1e3669",
        "title": "The Marlboro Man",
        "content": "The Marlboro Man was a fictional character who appeared in several advertising campaigns for the Philip Morris Corporation. His ads ran on television from 1964 through 1999, effectively entering the collective conscience of the American people for generations. Philip Morris is one of the largest tobacco producing companies in the world, and the corporation used the Marlboro Man with great success over the years.\nThe Marlboro Man was a strong, rugged-looking man who rode a mighty horse, and traveled throughout the country promoting tobacco products. He appeared in television, radio, print, and billboard ads for decades. When the United States Surgeon General deemed tobacco smoke as unhealthy in the 1960s, the beginning of the end for the Marlboro Man had begun. The Surgeon General began an anti-smoking campaign by requiring all cigarette companies to place its warning label on each package sold in the country. The warning included the wording that \"Tobacco smoke can cause lung cancer.\" Soon the pressure was on the tobacco companies to curb their advertising campaigns.\nIn 1955, tobacco sales reached $15 billion in the United States alone. After the Marlboro Man was introduced to the American public, that total reached $20 billion. This increase was largely based on the Marlboro Man campaign. The company also started an advertising scheme by offering genuine Marlboro Man gear for sale. These commodities were of high quality that appealed to the outdoor type of person. The gear ranged from camping equipment, hats, to outdoor clothing. It was very successful in its time. This success came at a great expense though. Four men who portrayed the Marlboro Man died of lung cancer, earning Marlboro cigarettes as the cowboy killer. The Marlboro Man is still popular in some parts of Europe and Japan, where smoking is still in vogue."
    },
    {
        "id": "f07b1d37a07b45b8903fdb88b4939b49",
        "title": "The Beatles",
        "content": "The Beatles are an English group of musicians from Liverpool, England. It took America by storm with their appearance on the Ed Sullivan Show on primetime television. The group's first appearance was seen by more than 73 million viewers in February, 1964, introducing the band to the American people. In the months to follow, the group became the biggest Rock N' Roll band ever to hit the United States.\nThe group's success opened the door for other British bands to make their way to America. Bands such as the Rolling Stones, The Who, The Kinks and The Dave Clark Five were soon playing their music to American audiences.\nThe Beatles were made up by four of the finest musicians to ever play rock music. Their lead singer was Paul McCartney, and drummer Ringo Starr. Both still play to this day. Two of the original members, singers and songwriters, John Lennon, and George Harrison, have tragically passed away, but their music lives in American culture to this day. The Beatles have sold more records in the United States than any other country in the world.\nThere was controversy in the U.S. prior to the group's first appearance. Conservative Americans viewed the Beatles as upstarts, with brash, new ideas, lyrics, and sound. The young generation of the time was ready for a change, and the Beatles gave them what they wanted. They were nicknamed the \"Mop Tops\" because of their long, bowl-like haircuts that flew in the face of convention in the 60s. Nothing was going to stop the Beatles though. Their music is as popular today as it was 50 plus years ago. This February, the Grammy Awards presented a special telecast celebrating the 50th anniversary of the group's first appearance on the Ed Sullivan Show."
    },
    {
        "id": "8fb34ab99342451690dccec95cc4249e",
        "title": "The Griffith Observatory",
        "content": "The Griffith Observatory is a planetarium, and an exhibit hall located in Los Angeles's Griffith Park. It features several astronomical displays and telescopes in the Hollywood Hills in the Los Feliz district of the city. The Observatory was built on land donated by Griffith J. Griffith in 1896. Griffith was a Welsh-born philanthropist and mining tycoon, who wanted to give the public access to a state-of-the-art observatory, so it was free of charge to visitors. He felt common people should be able to enjoy the wonders of the universe, and not be solely for the scientific community.\nGriffith donated 3,015 acres of land specifically to house the observatory that opened on May 14, 1935. During the first five days after the opening, the planetarium averaged more than 13,000 visitors a day. One of the major attractions was the Foucault Pendulum that is designed to show the earth's rotation and the Zeiss reflecting telescope. The observatory has a striking view of Los Angeles and Hollywood, and the Pacific Ocean can be seen on clear days from there.\nIn 2002 the planetarium was subjected to a $93 million renovation and expansion, which closed the museum for four years. After it reopened in 2006, the facility expanded underground with new exhibits, a cafe, a gift shop, and a theater. The Wilder Hall of the Eye section concentrates on the astronomical aspect of the observatory. It is where people can view the stars through the observatory's telescope, and features an interactive exhibit that is very popular. The Ahmanson Hall of the Sky is another popular attraction for viewing images in the night sky that are visible to the naked eye. The observatory frequently stages viewing nights when the public is invited to bring their own telescopes. It is open daily, and remains free of charge."
    },
    {
        "id": "366a3ea8d9ae4dd18ec389c4deeacb51",
        "title": "One Country, Many Religions",
        "content": "The United States is a country that has people from all over the world. Not only do many people speak different languages, many people practice different religions. Most people in the U.S. identify as being Christian, but only half of those people attend church on a regular basis. The second most popular religion is Judaism. The third most common religion in the U.S. is Islam. Other religions practiced in the U.S include Hinduism, and Buddhism. About 20 percent of all people in the U.S. say they don't practice any religion. One of the founding principles of the United States is religious freedom, which means people can practice whatever religion they want without being discriminated against. This is even guaranteed in the U.S. Constitution. This is one reason why the United States has no official religion.\nBecause there are so many different religions in the United States, there are many different types of houses of worship. Christians attend churches. Jews and Hindus attend temples. Muslims attend mosques. Many people use what they wear to reflect their religious beliefs. For example, some Islamic women wear a scarf called \"hijab\" to cover their head. It is disrespectful to ask a Muslim woman to take off her hijab or ask for her to show you what is under it. Male followers of an Indian religion called \"Sikhism\" usually wear cotton turbans. Again it is wrong to take a person's turban off or ask that they take it off. Male followers of Hasidism, a branch of Judaism, have long curls on the side of their heads. They wear a fringed prayer shawl. Other Jewish men may wear a small cap on their heads called a yarmulke. This is supposed to be a constant reminder that God is above them."
    },
    {
        "id": "3ae43608b1914f8ba053537072accc94",
        "title": "Woodstock: Defining a Generation",
        "content": "The Woodstock Music and Art Fair, commonly called Woodstock, was an American music and art celebration that took place from August 15  18, 1969. It was billed as \"3 Days of Peace and Music,\" and was a defining event for the young generation of Americans of the time.\nThe 1960s was an impactful era in American history. Many of the events that took place during those controversial 10 years profoundly affect modern American society today. The war in Vietnam was raging in the 60s, and the popular president, John F. Kennedy was assassinated in 1963. These are just two of the events that defined the decade. There were many more historic events during that era that deeply divided the country. Woodstock was designed to show how the young generation can coexist with the older generation of Americans by living in harmony with one another.\nAlthough the event did not occur in the town of Woodstock, New York, the city has become synonymous with the celebration. More than 400,000 young people gathered at the dairy farm in the small town of White Lake, New York to witness music history in the making. Rolling Stone Magazine listed the event as one of \"the 50 Moments that Changed the History of Rock n' Roll.\" Some of the biggest names in rock history performed at the three-day event, including The Who, the Grateful Dead, Janis Joplin, Jefferson Airplane, and Jimi Hendrix. In all, 32 acts performed at the outdoor festival, and it was free of charge to all.\nTwo soundtracks were released in the following two years. Both albums featured the live performances with introductions. The documentary film \"Woodstock\" was released in 1970, and received an Oscar in the Academy Award for Feature Documentary category. It was also deemed a Culturally Significant, by the United States, Library of Congress."
    },
    {
        "id": "1183e8cb9f394be8885826d5648cfb9f",
        "title": "The Veteran's Administration",
        "content": "The United States Department of Veterans Affairs, more commonly known as the Veterans Administration, is an organization dedicated to provide services for all veterans of the U.S. military. It was formed in July 1930, and today employs approximately 280,000 people at hundreds of its offices throughout the U.S. Its annual budget for the 2014 fiscal year  is nearly $153 billion, making it one of the largest government agencies in existence today.\nThe Department is broken into three main subdivisions. It consists of the Veterans Health Administration, the Veterans Benefits Administration, and the National Cemetery Administration. The VA Health Administration is responsible for providing veterans with all health care issues, while the Benefits Administration is designed to help veterans in areas such as guaranteed home loans, insurance vocational rehabilitation and educational benefits. The National Cemetery Administration provides burial and memorial benefits, and is entrusted with the maintenance of the VA's cemeteries.\nThe VA has served U.S. veterans from several wars beginning with survivors of World War I. It has continued the tradition of serving former military members by providing services for those veterans who need help readjusting to civilian life. Many of these veterans, especially those who saw combat during their time in the military, are in need of basic medical services for wounds suffered in conflicts. This was the original concept for the creation of the VA.\nSince that time, the VA has expanded greatly, and now provides additional services such as educational benefits, and home-buying assistance. It also helps those veterans who had become homeless after their service to their country ended. There are approximately 30 million military veterans living in the U.S. today. That number represents nearly 10 percent of the population of the country today."
    },
    {
        "id": "a299046cad194c37a1101be28059e73a",
        "title": "Married With Children",
        "content": "One of the most impactful television series ever to run on American TV was Married with Children. The show aired on the FOX Channel for 11 years, and many believe it was responsible for keeping the news station alive during the early years.\nIn 1987, commercial TV in the United States was dominated by the big three: the American Broadcasting Company (ABC), the National Broadcasting Company (NBC), and the Columbia Broadcasting Company (CBS). When the FOX Channel appeared on the scene, few people gave it much chance to survive in the face of its stiff competition, but Married with Children changed all that.\nThe show followed the exploits of a dysfunctional family that lived in a fictional suburb of Chicago. The main character was the father, Al Bundy, who was a lovable loser living with his self-centered wife, and bratty kids. Together, the family makes Al's life miserable as he stumbles, and fumbles his way through life. Al works as a shoe salesman that pays very little, and has little chance of promotion.\nAl is an endearing character who gained the adoration of the American public for many years. The actor Ed O'Neil, who played Al, said that people still approach him to this day calling him Al, or Mr. Bundy. O'Neil also said that playing the character for so many years made it difficult for him to find work once the series ended because people associated him with Al.\nOne of the things that made the show so popular is that no subject was off-limits to the writers. It was a controversial show  that dealt with controversial subjects. Many people boycotted the show because of its racy content, but FOX continued on. The show has cultivated a cult-like following that began in the 80s, and continues today."
    },
    {
        "id": "4b40fd9c9dc54c23b1b29c3f99ed48f9",
        "title": "Facebook",
        "content": "One of the most recent social changes taking place in the United States, and in the world, is social networking. Social networking in itself is not a new development. These types of groups have been in existence for at least 150 years, and probably longer than that. In the times before the invention of the personal computer, and the advent of the World Wide Web, social networking was done in person. People who had similar likes and interests  would gather together to share experiences, make new contacts, and promote themselves, or their businesses.\nOn the Internet, social networking websites made their first appearances during the late 1990s. The first major social networking website in the United States was MySpace. MySpace was a comprehensive, social networking site that allowed its users to exchange messages, share pictures, and make new friends in a way that was never thought of in the past. With MySpace, people who did not go out much could reach out to others from the comfort of their own homes.\nIn 2004, Facebook was created. It was originally a website created for use by Harvard University students, graduates, and faculty, but it soon expanded to include just about everyone. Facebook is an elaborate social networking site that has grown incredibly fast. It is now larger than some of the largest companies in the world. It is a website that is in constant change. New features are added regularly. Facebook has revolutionized the way people stay connected with each other and the rest of the world. The way it works is simple. Users can set up a new account easily. All a new user needs is an email address to start. Once a person has created an account, he, or she can invite friends by sending a request out to people they know who also have their own Facebook pages. Once you get started, making new friends will come easily."
    },
    {
        "id": "c10a1acc5e9242bbb6e4bd92a1de64fd",
        "title": "Don't be Tardy to the Party",
        "content": "In the United States, people love to throw parties for many reasons. Of course there are the usual birthday parties, but some people even have parties to celebrate divorces! No matter what kind of party you are going to, it's a good idea to make sure you are actually invited. It's considered rude to just show up unless the host, the person giving the party, invited you. You will either get a paper, email or verbal invitation to a party. Alternately, you can also go as a guest of someone else invited, like as his or her date. Once invited, it is very important to let the host know if you are actually going to show up. Many times hosts have a party catered, which means other people prepare the food. They need to know how much food to have. Letting them know if you are  showing up or not helps the host and is considered polite.\nIt's also important to be relatively punctual for a party. Most parties in the U.S. never start exactly when they say they will. Many people like to be \"fashionably late\", that is, showing up about 30 minutes after the party is supposed to start. People like to do this to make a big entrance. Showing up more than 30 minutes before or after is considered rude though. If you show up too early, you are likely to interrupt valuable preparation time of the host. If you show up too late, you are just being rude.\nEven if it is not a birthday party, it is polite to bring a gift for the host. It doesn't need to be a fancy gift. A bottle of wine, or even flowers, is polite and will be appreciated."
    },
    {
        "id": "c6d9e3de2a844a5598e2c3bdac888988",
        "title": "A Bridal Shower",
        "content": "A bridal shower is a party when a woman who is about to get married is \"showered\" with gifts and well wishes. A bride-to-be will often register at one or several department stores and create a list of things she would like people to give her as presents. This makes it easy for guests of both the bridal shower and the wedding itself to know what kind of things the bride wants. A registry also makes sure that there are no duplicate presents. A bride may want a blender, but she sure doesn't want to receive three and have to deal with the hassle of returning extras. Most bridal shower gifts are items that a newly married couple needs to start their life together. These gifts include dishes, pots, pans, and even appliances like toasters and microwave ovens.  Many brides also look forward to receiving some money. Cash or checks are considered appropriate gifts for a bridal shower. The money comes in handy to help pay for an expensive wedding. Sometimes people bring tasteless gifts like lingerie to bridal showers. Some people think those gifts are good because they help the new couple \"spice up\" their married life. Others find these types of presents embarrassing.\nWhile many bridal showers are surprises, others are planned with input from the bride-to-be. A bridal shower can be small and intimate and held in someone's home. It can also be a larger affair held at a restaurant or a catering hall. Sometimes snacks and desserts are served or a full meal can be offered. Traditionally bridal showers were women only affairs. However, more and more showers are no co-ed, with men and women. Traditionally men are not invited to bridal showers but now more showers include men and the groom-to-be. Like many parties in the U.S., there would be no dancing at the bridal shower, just eating and people chatting. Some bridal showers even have games."
    },
    {
        "id": "45daa4eb88ca44b9bc385616549030f9",
        "title": "A Baby Shower",
        "content": "While many women are involved in planning their bridal showers, a baby shower usually comes as a complete surprise. A baby shower is a party where a pregnant woman is \"showered\" with gifts and good wishes. A baby shower is usually given by a close female friend or relative of the mother-to-be. Sometimes co-workers of a pregnant person will also throw a baby shower.\nThe baby shower is usually given when the mother-to-be is between 6 and 9 months pregnant. Sometimes though, because predicting the due date of a baby isn't always exact, a baby shower can happen after the baby is born. A baby shower can be held in someone's home or outside, like in a restaurant or catering hall. Traditionally only women are invited to a baby shower. However, more and more baby showers are also including the father-to-be. Like with a bridal shower, a mother-to-be will often register a wish list of things she wants at one or several stores. This list usually consists of things the mother wants for her baby including clothes, diapers and even furniture like high chairs and cribs. This way friends and family members can go to the store and buy something from the list. Registering helps make sure that there aren't repeat items, like 30 bottles when a new mom only needed 15.\nSome baby showers also feature a paper mache wishing well. This is not just for decoration. People can  put cards inside with wishes for the new baby and mom. Most of these cards also contain money or gift cards to help the mom-to-be buy whatever else she needs for the baby. Sometimes there are games at a baby shower. In one game everyone guesses the due date of the baby. Another game has people taste  baby food and guess the flavor"
    },
    {
        "id": "66c364a33ba248c1ae18cfd64acc8025",
        "title": "A Housewarming Party",
        "content": "A housewarming party is a special party to be held when someone buys or moves into a new apartment or house. The person or people who bought the property or moved are the ones who throw the party. The party is an opportunity for friends and family to congratulate the person on the new home. It also gives people a chance to see what the new home looks like. It is an opportunity to fill the new space with love  and hopefully presents.\nIt is traditional to bring a gift to a housewarming party. Some people register a list of items they want or need for their new home at a local store or stores. Some common items people will put on a gift registry include kitchen tools like knives and items like curtains. Even if there isn't a registry, a good housewarming gift is something to decorate the new house with like a piece of art or a plant. You can also bring food or drinks to share with the other guests. This is often appreciated since at a housewarming there isn't a lot of food served, usually just appetizers or sandwiches. There are usually no planned activities like games at a house warming party. The host or hostess of the party will, however, probably give all the guests a tour of their new home. Sometimes, because a housewarming party happens shortly after a person moves into their new home, people may be asked to help unpack boxes. This isn't usual though.\nHousewarming parties get their name from the fact that a long time ago people would actually bring firewood to a new home as a gift. This was so that the person could keep their home warm for the winter. Now most homes have central heating and don't use fires to keep warm."
    },
    {
        "id": "ed60a9cce6404656b45dd3b00fe6c8d1",
        "title": "The Wedding Reception (1)",
        "content": "The religious or civil ceremony that makes people legally a married couple is just one part of the actual wedding. After the wedding comes the reception. A wedding reception is a party held immediately after the marriage ceremony. Usually there is a little bit of time, about an hour, between the ceremony and the reception to give people enough time to travel from the ceremony location to the reception location. Most wedding receptions are held at a catering hall, which is a place that specializes in hosting big parties. However, wedding receptions can be held in restaurants, parks, and even in museums or zoos. A wedding reception is usually not held at the same place as the ceremony, but sometimes they do.\nWhen guests arrive at the reception, the bride and groom are usually not there to meet them. Right after the ceremony the newly married couple, the bridesmaids, and the groomsmen will go somewhere to have photographs taken. While this is happening, guests are usually treated to a cocktail hour at the reception site. During this time appetizers and drinks are served. This also gives guests a chance to socialize. After the cocktail hour, the main dining hall is opened. At a wedding reception the seating is usually prearranged. Each guest will receive a card telling him or her where they are expected to sit. Tables are arranged by numbers. In front of the reception hall, there is a special table for the bride and groom.\nOnce everyone is seated, waiters begin to serve salad or bread and drinks. Some receptions have an open bar, meaning the alcohol is free. Other receptions have a case bar, meaning non-alcoholic beverages are free; guests are expected to pay for their own alcoholic drinks."
    },
    {
        "id": "3c37f90882644ac89cf93ddb42ee52a3",
        "title": "The Wedding Reception (2)",
        "content": "There can be different kinds of entertainment at a wedding reception. Usually there will be a Master of Ceremonies, or MC, who helps move the reception along by making announcements of what will happen next. For example, the MC will announce when the newly married couple enters the reception hall, and all the guests will stand up and applaud. A wedding reception usually has music and guests are expected to dance. The music can be provided by a DJ or by a live band. Sometimes the DJ or live band will accept requests from guests to play a certain song. When the newly married couple enters the reception, they will share a dance by themselves to a song they picked beforehand. Usually the song is something romantic and represents the couple's love for one another. Sometimes the bride will share a dance with her father and the groom will share a dance with his mother. After these special dances, the guests are invited to the dance floor.\nFood at a wedding reception can be buffet style, where everyone serves himself or herself, or it can be a sit-down meal served by waiters. Guests get to choose among a meat, chicken or fish deal. Guests generally make their choices when they respond to the initial wedding invitations.\nDuring a wedding, guests shouldn't expect to spend too much time with the bride and groom. The new couple is usually very busy greeting all of their guests. Sometimes the couple doesn't even get a chance to eat. What almost every newly married couple does get to eat at their wedding reception is the wedding cake. The bride and groom traditionally cut through the wedding cake together, and then feed the other person a bite."
    },
    {
        "id": "ac19f35343524cc6b69af5ef34f4d090",
        "title": "Bride and Groom Traditions",
        "content": "There are many traditions that U.S. brides and grooms are expected to follow at their wedding. One of the most well-known traditions is for a bride to toss her bridal bouquet to the unmarried female guests attending her reception. According to the tradition, the single woman who catches the bouquet will be the next woman to be married. The flowers thrown may not be actually the same flowers the bride carries down the aisle during the wedding ceremony. An identical bouquet is created for the bride to toss. This is because many times the bride wants to keep her original bouquet as a remembrance. Many women take the flower toss very seriously. There have been videos documenting how women will sometimes even  fight each other for the bridal bouquet.\nThe groom has something to toss at the wedding reception, too. One tradition is the groom takes a garter from his new wife's leg and toss the garter to the unmarried men attending the reception. According to the tradition, the single man who catches the garter will be the next man to get married. Sometimes the groom will remove the garter from his wife's leg with his teeth. At some wedding receptions, the man who catches the garter has to place it on the leg of the woman who catches the bridal bouquet. Some people think this is too sexual, and just skip this part. It is the decision of the bride and groom.\nThe bride and groom often toast each other with champagne before the end of the reception. Sometimes a bride and groom will leave the reception before it is over. They go right to the airport to begin their honeymoon, a special vacation celebrating their new life together."
    },
    {
        "id": "3faba751337a42cfaeaf6570762c6d18",
        "title": "Theme Parties",
        "content": "Who says adult parties have to be boring. More and more adults are reliving their childhoods or creating memories they didn't have as children by having theme parties for their birthday or other occasions.\nTheme parties are based on an idea, a television show, a fictional character, or really anything. Sometimes guests are expected to dress according to the theme as well. For example, the Toga party is a type of theme party where guests are expected to dress in togas, really just white sheets. Toga parties used to be especially popular among college students. In a masquerade party, everyone wears a mask and has to guess who is behind it. The mystery is part of the fun. Speaking of mystery, there are murder mystery parties, where the guests have to solve a fake murder. Some adults throw parties based on seasons. A summer beach party, for example, might feature guests wearing their swimsuits. Another popular type of theme party is the game night party. In this type of party, people get together to play  various board games. A variation of the game night party is the casino party, where adults play games typically found in a casino-like blackjack or poker.\nAnother theme party could focus on a specific region or country. For example, a Mexican theme party might feature tacos, the colors of the Mexican flag and Mexican music. Guests should be careful when dressing up for these types of theme parties though. Dressing up like a certain ethnic or racial group is usually considered offensive. It's better to just enjoy the food, and not portray a stereotype."
    },
    {
        "id": "991a7b7b517648fc98130f277f3bb57d",
        "title": "Helicopter versus Free Range Moms",
        "content": "The parenting styles of parents in the United States are often criticized. One type of parenting that is criticized is a helicopter parent. This kind of parents hover over their children like helicopters, which means these parents are always on top of their children.\nWhile being an aware and involved parent is not a bad thing, helicopter parents take it to the extreme. The actions of helicopter parents actually hurt children, by not teaching them to be responsible for their actions. For example, a helicopter parents would call their adult college-age child to wake them up to go to class when part of college is learning to be responsible and learning to manage your own time. Helicopter parents are also overly worried about their kids getting hurt. This means helicopter parents hold back their child's natural curiosity. Part of growing up  means your kid has to get hurt, physically and emotionally. This is how lessons are learned. Instead, the kids of helicopter parents can grow up to be overly needy, dependent adults. Some people blame the rise of helicopter parenting on the rise of cell phones. Mobile phones make it easier for parents to track their kids all the time.\nThe opposite of the helicopter mom is the free-range mom. The free-range mom follows a slow parenting style, meaning she lets her kids explore the world at their own pace with little direction. The name free-range comes from the idea that kids should have the freedom to explore their world or range in a way that makes sense to them. This often means that free-range moms will not schedule activities like extra classes or play dates for their kids. Instead a free-range mom will just let her child play in a park. There is less of an emphasis on things like the latest toys."
    },
    {
        "id": "0aa257ef146c4879a9f7d79b9f3edb6d",
        "title": "Attachment Parenting",
        "content": "Having your kid physically attached to you probably doesn't sound like fun, but an American pediatrician, William Sears, promotes a style of parenting that keeps small children as physically attached as possible. This is called attachment parenting.\nThe idea behind attachment parenting is that if a small baby feels protected and safe by physical contact with their parent, especially their mother, that child will grow up to be a more independent adult. One way parents are encouraged to be close to their babies is by using a sling or a wrap to carry the baby around instead of putting the baby in a carriage. This is often called \"wearing\" your baby. Parents are also encouraged to sleep with their babies. Parents are too big to fit in a crib, so instead parents are told to bring the baby into the adult bed. This is supposed to teach the baby about sleep regulation as well since the baby will learn to mimic adult sleep patterns. This co-sleeping is controversial though. There are concerns that babies sleeping with adults could suffocate, accidentally get crushed, or fall off the bed. There is also concern about sudden infant death syndrome, or SIDS, where babies just suddenly stop breathing.\nAnother marker of attachment parenting is not worrying about spoiling a baby. Many times parents feel that paying attention to a baby's every cry makes them too needy or spoiled. Attachment parenting feels that every baby's cry should be responded to and that the baby should never be left to \"cry it out.\" Instead, the baby should be comforted and crying should be taken as a signal that the baby needs something. Most attachment parents also breastfeed on demand, feeling that not only is this physically healthier, but also promotes a bond between mother and child."
    },
    {
        "id": "3ddadb59a1dc4652b5e0d83bf5e0ce9d",
        "title": "A Kid's Party for Adults",
        "content": "Not all kids' birthday parties in the U.S. are created equal. Sometimes it seems like the birthday parties are about showing off and entertaining the parents of kids in addition to children.\nMost children's birthday parties are held in the home of the birthday boy or girl. It used to be that children's parties were just for children. Parents would drop their kids off and come back when the party was over to bring them home. Now it is more common for the parents of guests to stay for the party as well. This gives the adults time and space to socialize while the kids play games. Kids and adults don't always have the same tastes in food. So when adults are invited to stay for a child's birthday party, there is usually fancier food for the adults like cheese, crackers, and fruit platters. Meanwhile the kids eat hot dogs and potato chips. While the children drink punch, juice, or soda, the parents may be sipping cocktails, beer, or wine.\nEntertainment for a party of mixed adults and children also goes beyond the usual clown or magician. Sometimes there will be a DJ, and the adults  will dance. Party games are not just for the kids, either. While the children play traditional games like pin the tail on the donkey, the adults may play casino-type games like blackjack or poker.\nNot everyone likes this trend of adults and children partying together. Some feel that the parties should be kept separate. Some people worry about adults getting drunk in front of the kids. Others worry about kids getting abused by adults they don't know. For others, it is just about allowing a kid to have their special day. There is also a concern that these mixed parties encourage a sense of competition among parents in a community."
    },
    {
        "id": "e88452c50ab549b4bc8570866462108f",
        "title": "When a Kid Becomes an Adult",
        "content": "In the United States someone legally becomes an adult when they turn 18 years old. At 18, U.S. citizens can vote. They can also serve in the military and go fight in wars for the country. An 18-year old can also buy cigarettes and other tobacco products, but 18-year-olds cannot buy alcoholic beverages. People in the U.S. need to wait until they are 21 to be able to do that.\nAt the age of 18, people can legally live on their own, work, and get married. However, turning 18 doesn't mean everyone is ready to take on adult responsibilities. At the age of 18, most people are just graduating from high school. Many will go to college. Some young people choose to go to college far from their homes and live in dormitories. Others pick a college close to home and stay with their parents to save money. Yet others will choose to live on their own. Legally, a parent does not have to provide for their child when the child turns 18.\nSome parents in the U.S. take this very seriously and expect their children to move out as soon as they turn 18. Some parents will even forcibly kick their kids out when the kids turn 18. There tends to be some difference about this depending on if the kid is female or male. It is considered more acceptable for a female to stay living with her parents after her 18th birthday. Many females aren't expected to leave their parents' house until they get married. There is still an expectation for young men, however, to go out and live independent lives as soon as they can. With the economy of the U.S. struggling, some adult children are returning to their parents' home in their 20s and 30s. These are called boomerang kids, since like a boomerang, they return where they came from."
    },
    {
        "id": "476257a3e273477e9aa5f9f3a2bb6967",
        "title": "Who Will Take Care of Mom and Dad",
        "content": "In the United States, the baby boomer generation includes those that were born in the time after World War II. Those babies are now reaching the retirement age. As these adults age, many of their adult children worry about how they will take care of their aging parents. In the United States it is not common for multiple generations to live under one roof. Once children grow up and get married, they move out, leaving their aging parents to fend for themselves. When these aging parents can no longer take care of themselves because of age or illness, it is not uncommon for adult children in the U.S. to place their elderly parents in a nursing home.\nA nursing home is a facility that offers care for the elderly and ill 24 hours a day. As the name suggests, nursing homes has medical nurses, doctors, social workers, and therapists to help aging adults deal with the challenges of daily life. Most nursing homes also have social activities for the elderly to engage in and keep active. These activities range from games to dance classes, and movie nights. Nursing homes are supposed to provide three nutritious meals for their residents.\nNursing homes are controversial, however. There have been cases across the country of staff in nursing homes abusing and even robbing the elderly residents. There are different states and federal agencies that are supposed to oversee nursing home facilities. Some people feel that it should be the responsibility of family members, especially adult children, to care for their aging or ill parents. However, many adult children have their own children and families to take care of, and do not have the means to care for their elderly parents; others worry about medical skills needed if their elderly parents are seriously ill."
    },
    {
        "id": "b0ca1bc6fb00464cbde04af362dd2f08",
        "title": "Vacation Time",
        "content": "The stereotype is that Americans are lazy, but studies show that people in the U.S. get less vacation time than people in other parts of the world. A typical American worker gets two or three weeks off out of a whole year for vacation. Most U.S. workers cannot take those two or three weeks consecutively. They usually have to be spread out throughout the year. Even when U.S. workers are on vacation, they are often expected to be in communication with their boss. This means checking in via email and mobile phone. Most U.S. businesses do not encourage their employees to take all the vacation days they are entitled to. In fact, most U.S. companies discourage it.\nOther countries, especially countries in Europe, have much more vacation time. In Germany many people have six weeks of paid vacation. At least three of these weeks can be taken consecutively. Maybe this is why Europeans and other travelers vacation in far-off exotic places.  Most American families tend to stay closer to home, rarely leaving the country.\nThe difference in the amount of vacation time is legal. Most companies in countries outside the U.S. have to give paid time off to their employees or else pay hefty fines. However, in the U.S. there is no federal law requiring employers to give workers paid vacation. In fact the U.S. is the only developed country that doesn't guarantee yearly time off to workers. There have been efforts to pass laws giving U.S. workers one week of paid vacation by law, but so far those efforts have not been successful.\nEven when U.S. workers do have time off, many are afraid to take it because they worry they may be seen as non-productive workers and lose their job. Other workers worry about going on vacation and having a mountain of work when they return."
    },
    {
        "id": "3f0e5fcf7fd74354804a95ceeaf0286a",
        "title": "Camping",
        "content": "Camping is a popular way for many people in the United States to spend their vacation. Camping involves people leaving the comfort of their home and driving to spend a few nights or more in the great outdoors.\nWhen people camp, they can sleep in a tent, a camper, or if they want to be fancier, they can sleep in a cabin. Some people like to really \"rough it\" and use no shelter except for a sleeping bag and sleep under the stars. Some people drive across the U.S. in what is known as a recreational vehicle or RV, which is a trailer. Inside there are beds, a tiny bathroom and a kitchen.\nThere are campgrounds all over the United States. These are places where campers gather together and usually pay a fee to pitch a tent or place a camper in a designated outdoor spot. Many of these campgrounds have water hoses and electric hookups so that people can wash dishes and themselves and plug in a radio or their computers.  Most campsites also have a fire ring or pit, which is a hole in the ground where people can safely make a fire for roasting marshmallows, a popular camping activity. There usually is also a picnic table for people to eat their meals. Many of these campgrounds also have shared bathrooms complete with showers. Some campgrounds have playgrounds, pools, and game rooms. Some also organize activities for people who like sing-alongs, where people will gather together and sing songs. Usually it is illegal to camp in a place not designated as an official campsite, meaning you can't just pitch a tent in a forest.\nWhen people go camping they often do other outdoor activities like fishing, canoeing, hiking, kayaking, swimming, horseback riding and mountain biking."
    },
    {
        "id": "810cc68a522c4bf580dcd686cab6f919",
        "title": "Renting an Apartment (1)",
        "content": "Having your own space is a sign of success in the United States. However, renting an apartment is not easy. There are a number of steps you need to take. First, you need to figure out how much you can pay per month.\nWhen you first move into a new place, most landlords, or property owners expect you, the tenant, to pay a security deposit. A security deposit is an amount of money you pay a landlord sort of as insurance that you won't destroy their property while you are living there. Usually the security deposit is equal to the amount of one-month rent. If when you move out, the apartment is in the same condition as when you moved in, the landlord will return your security deposit. If the apartment has any damage whatsoever, including holes in the walls because you hung up posters, the landlord can legally use that money to fix the apartment.\nOnce you know how much you can afford, you can begin looking for apartments for rent. You can look in the newspaper or online. Also walk around a neighborhood you want to live in and be on the lookout for \"For Rent\" signs.\nThere are two ways to rent an apartment. Most landlords rent out apartments on an annual basis. This means you will sign a document called a lease, which says you will stay in the property for one year and pay rent on a monthly basis. If you decide that you want to break the lease, or leave before your year is up, there are usually fines you will have to pay. Another way to rent an apartment is on a month-to-month basis. This means that you pay by month, and are not obligated to stay for more than a month at a time."
    },
    {
        "id": "f64302c788224bce9a49f7898a5b507c",
        "title": "Renting an Apartment (2)",
        "content": "Once you find an apartment you want to rent, you need to contact the landlord, the person who owns the property. Most landlords are not individuals anymore, but rather are companies that own a number of properties. You and the landlord will set a date to view the place you are interested in renting.\nOn that date you can see the apartment and ask questions. Some landlords will require you to fill out an application. The application will ask questions about your job, salary, and how many people are going to live with you in the apartment. The landlord wants to make sure they have responsible tenants who will pay rent on time. Some landlords will even ask for references, the names and telephone numbers of people who can verify that you have a job and are a responsible person. Most landlords will also run a credit check. A credit check is your history of paying bills on time. If your potential landlord sees that you owe a lot of money to different companies and don't pay your bills on time, they may not want you as a tenant. If you have bad credit or an unstable work history, you may be required to get a co-signer, that is another financially responsible adult to sign the lease, a rental contract, with you. This co-signer is legally responsible for paying the rent if you stop paying.\nIf you cannot afford a full apartment, another option is to rent a room in someone's home. The process to rent a room is like renting an apartment except you only have a room and usually have to share the bathroom and the kitchen. Most apartments and rooms in the U.S. are unfurnished. You are expected to bring your own furniture, including a bed, a dresser, a sofa, and anything else you need."
    },
    {
        "id": "c7a751bbf77b417885a4b97999d87268",
        "title": "What is in a Lease (1)",
        "content": "If you want to rent an apartment, you need to sign a lease, which is a legally binding contract between you and the landlord, the person who owns the property. A lease is usually good for a set time. Some leases are on a month-to-month basis, but most are for a period of one year or two years.\nThe lease or rental agreement lists out your responsibilities as a tenant and the landlord's responsibilities. The lease  will tell you how much the monthly rent is, when it is due, and how you can pay it. Some landlords will only take a certified check or money order, and others will accept a personal check or cash. If you pay your rent late, there is usually a late fee. The amount of the late fee is also usually in the lease. The lease will also tell you how much the security deposit is. Usually it is the amount of one month's rent. The lease will tell you if you can have pets or not. Many places do not allow pets. If you bring one in anyway, they can fine you or kick you out. If your apartment does allow pets, most likely you will have to pay an extra amount of money, called a pet deposit, to cover any damages caused by the animal. Other rules that may be included in a lease include whether you are allowed to smoke inside the property and whether you are allowed to make any changes like paint. Many landlords do not allow you to paint or even make holes in the wall to hang up pictures.\nA lease is proof that you legally live somewhere. Sometimes you need a lease to show a school that you live within a certain area. Make sure you get a copy of the signed lease from your landlord."
    },
    {
        "id": "a9ad2544131c46909e182aa9842d8862",
        "title": "What is in a Lease (2)",
        "content": "When you rent an apartment, you need to check the lease for rules and responsibilities. For example, some landlords do not want you to have guests spend the night. This is because the landlord doesn't know who your guests are. If they damage the apartment in any way, you will be responsible. Also sometimes a friend who wants to crash on your couch ends up staying for a really long time, and ends up becoming another tenant.\nYou are responsible for all the utilities you use while living in a rental apartment. This means you will have to pay for the electricity and gas you use. If the landlord pays for any utilities, it will say so in the lease. Once you move in, you will have to call the electric company and the gas company so they can put accounts in your name. Also if you want a phone line, cable or Internet, you will have to call those companies and pay for those services yourself unless the lease says that is included in your rent.\nYour landlord is supposed to have access to the apartment you are renting from them. This doesn't mean they can just barge in whenever. It does mean though that with notice, the landlord is allowed to come into the apartment during a reasonable time, meaning not in the middle of the night when you are sleeping. During this time the landlord will inspect the apartment to make sure you are following the rules, and the landlord can also make any necessary repairs. All of this should be written out on the lease. If it is not, do not be afraid to ask the landlord to add that information. It protects both the landlord and you."
    },
    {
        "id": "0616818eacf649f3829bd1317fc07250",
        "title": "Public Housing",
        "content": "If you have a low income, are elderly, or are disabled, there are a number of public housing options in the United States. Public housing options are run by the federal, state, and city government agencies. Living in public housing is often called \"living in the projects\", but this is a negative term based on stereotypes. Not all public housing options mean living in huge, run-down buildings with lots of crime.\nPublic housing programs come in all sizes and types. One type is a single-family house. Another type includes living in a high-rise building, or apartments in tall buildings. All public housing options are rental options, meaning you do not own the place where you live.\nEligibility for public housing is based on a number of factors. One factor is your annual gross income, meaning how much money you make in a year. Another factor is if you are elderly or have a disability. Another factor taken into consideration is your U.S. citizenship or eligible immigration status. Most public housing options are only available to U.S. citizens or U.S. legal residents. Like with any rental, your references are checked to make sure you and your family will be good tenants. This means looking at your credit history and your criminal record. People with criminal records are usually banned or not allowed to use public housing options.\nTo find out if you are eligible for public housing, you need to visit a government housing assistance office close to you. You can find your local housing assistance office by checking the yellow pages or by looking online. You will have to fill out an application. On the application you will need to list the names, gender, and date of birth of all people who would be living in the house or apartment."
    },
    {
        "id": "61f60f9550a44921b76681e2d6e99e68",
        "title": "Applying for Public Housing",
        "content": "When you apply for public housing, on the application you need to give the names and ages of everyone who will live with you. You will also need to give the address of where you currently live and a phone number which you can be contacted with.\nIn your application, you need to explain why you think you qualify for public housing help. Some reasons can include being a veteran, being poor, or living in bad conditions. Bad conditions can mean that the place you are living now is dangerous or it can mean that you are in a domestic violence situation. The government will also want to know the name and contact information of your current landlord and any landlords you had in the past. This is so that the government can find out if you are a good tenant. You will also need to tell the government how much money you make in a year and how you make that money. You can't just make that information up. You will need to provide your boss's information, old checks, and bank statements.\nThe government may visit you in your current home and interview you and people you live with. Other things the government will ask for are your birth certificate and the birth certificates of all people who will live with you and proof that you pay taxes, like a tax return. If you are eligible for any public housing assistance, you will get a letter. If you're approved, you'll be put on a waiting list. You may be on the waiting list for a long time before you actually can move into a public housing unit. This is because there are many people applying and eligible for help. Sometimes you can be waiting for years."
    },
    {
        "id": "f0fe9ae6c2c6494099295698af1424ef",
        "title": "Section 8",
        "content": "Section 8 is also called the housing choice voucher program. Very poor families, the elderly, and disabled people can get up to about 2,000 dollars a month to help pay rent in single-family homes and apartments. Families who qualify do not get a completely free ride though. In order to qualify, you must be able  to pay about 30 percent of the rent yourself. The rest of the rent is paid directly by the government to a landlord. Not all landlords accept Section 8. If you qualify for Section 8, it is your responsibility to find a landlord who accepts the program.\nEligibility for the program depends on your annual income and how many people are in your family. To qualify you have to be a U.S. citizen or a legal resident of the U.S. If you are undocumented or have a tourist visa, you cannot apply for this program. Like with all public housing programs, you will have to fill out an application to see if you qualify. On the application you will have to say how much money you make, how much money you have in the bank, and how many people are in your family. You will have to give proof of how much you make. The government will ask to speak to your boss, see your bank statements and proof that you pay taxes.\nIf you qualify, you will probably be put on a waiting list. Section 8, like other public housing programs, has many people applying for them. You could be waiting many years before you actually get a voucher, which is like a coupon that says how much rent the government is willing to pay for you. If a landlord accepts you and your Section 8 voucher, you still have to sign a lease, or rental contract."
    },
    {
        "id": "bb0d855dc959451c9a6da089954ac1a6",
        "title": "Baseball: The National Pastime",
        "content": "The game of baseball in the United States is the oldest major league sport in the country. Major League Baseball traces its roots back to the 1880s, but the game had been enjoyed by Americans for decades before then. The origins of the game are in question. For many years a 19th Century American named Abner Doubleday was credited with creating the game, but this has been proven  inaccurate today.\nOne theory is that the game was brought across the Atlantic Ocean during the great European migration of the 18th Century, and that it is based on the British game of cricket. Cricket is a very popular sport in England, but it is played by mostly the upper-class members of that society, and it is unlikely that the poor immigrants from England played the game very much. However, it more closely resembles the game of rounders, which is another English sport that shares many common features as the American game of baseball.\nIn any event, the game became very popular in the United States. By the 20th Century, the American League, and the National League were taking the country by storm. The greatest single team in either league's history is the New York Yankees. The Yankees have won more World Series titles than any other team in history.\nThe World Series is a seven-game competition with the two top teams from either league. The first team to win four games is declared the World Series Champion. In 1903, The Boston Americans won the first World Series beating the Pittsburgh Pirates. This was the start of an annual series matchup between the two leagues. To date, the Yankees have won 27 championships in 40 appearances, with the team's most recent title coming in 2009. The St. Louis Cardinals lead the National League with 11 titles in 19 appearances, with its last title coming in 2011."
    }
]