[
    {
        "id": "69d39726e07b4c3d8d2067d125d9c58c",
        "word": "Association football",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/əˌsəʊsieɪʃn ˈfʊtbɔːl/",
            "us": "/əˌsəʊsieɪʃn ˈfʊtbɔːl/"
        },
        "nearby": [
            {
                "word": "Associate's degree",
                "pos": "noun"
            },
            {
                "word": "association",
                "pos": "noun"
            },
            {
                "word": "Association football",
                "pos": "noun"
            },
            {
                "word": "associationism",
                "pos": "noun"
            },
            {
                "word": "associative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the formal name for football/soccer",
                    "vi": "tên chính thức của bóng đá / bóng đá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8a99f71940e04d07aba2e86fec40fd64",
        "word": "football",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈfʊtbɔːl/",
            "us": "/ˈfʊtbɔːl/"
        },
        "nearby": [
            {
                "word": "footage",
                "pos": "noun"
            },
            {
                "word": "foot-and-mouth disease",
                "pos": "noun"
            },
            {
                "word": "football",
                "pos": "noun"
            },
            {
                "word": "the Football Association",
                "pos": ""
            },
            {
                "word": "football boot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game played by two teams of 11 players, using a round ball that players kick up and down the playing field. Teams try to kick the ball into the other team’s goal.",
                    "vi": "một trò chơi được chơi bởi hai đội gồm 11 cầu thủ, sử dụng một quả bóng tròn mà các cầu thủ đá lên và xuống sân chơi. Các đội cố gắng sút bóng vào khung thành của đội kia."
                },
                "examples": [
                    {
                        "en": "The kids were outside playing football.",
                        "vi": "Những đứa trẻ ở bên ngoài chơi bóng đá."
                    },
                    {
                        "en": "The team played some impressive football.",
                        "vi": "Toàn đội đã chơi một thứ bóng đá ấn tượng."
                    },
                    {
                        "en": "We settled down to watch the football on TV.",
                        "vi": "Chúng tôi ổn định để xem bóng đá trên TV."
                    },
                    {
                        "en": "On Saturday we went to a football match.",
                        "vi": "Vào thứ bảy, chúng tôi đã đi xem một trận đấu bóng đá."
                    },
                    {
                        "en": "a Premier League football team",
                        "vi": "một đội bóng đá Premier League"
                    },
                    {
                        "en": "a football player",
                        "vi": "một cầu thủ bóng đá"
                    },
                    {
                        "en": "I'm not a big football fan.",
                        "vi": "Tôi không phải là một người hâm mộ bóng đá lớn."
                    },
                    {
                        "en": "This was the best game of football I have seen all season.",
                        "vi": "Đây là trận đấu hay nhất của bóng đá mà tôi từng xem trong cả mùa giải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game played by two teams of 11 players, using an oval ball which players kick, throw, or carry. Teams try to put the ball over the other team’s line.",
                    "vi": "một trò chơi được chơi bởi hai đội gồm 11 người chơi, sử dụng một quả bóng hình bầu dục để người chơi đá, ném hoặc mang. Các đội cố gắng đưa bóng qua vạch vôi của đội kia."
                },
                "examples": [
                    {
                        "en": "He played football for Iowa State University.",
                        "vi": "Anh ấy đã chơi bóng đá cho Đại học Bang Iowa."
                    },
                    {
                        "en": "We often go to football games together.",
                        "vi": "Chúng tôi thường đi xem các trận bóng đá cùng nhau."
                    },
                    {
                        "en": "a football player/coach",
                        "vi": "một cầu thủ / huấn luyện viên bóng đá"
                    },
                    {
                        "en": "a football field/stadium",
                        "vi": "một sân bóng đá / sân vận động"
                    }
                ]
            },
            {
                "define": {
                    "en": "a form of football played in Canada, similar to American football, but with twelve players on each team",
                    "vi": "một hình thức bóng đá được chơi ở Canada, tương tự như bóng đá Mỹ, nhưng với mười hai cầu thủ trong mỗi đội"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large round or oval ball made of leather or plastic and filled with air",
                    "vi": "một quả bóng tròn hoặc bầu dục lớn làm bằng da hoặc nhựa và chứa đầy không khí"
                },
                "examples": [
                    {
                        "en": "As a child he was always kicking a football.",
                        "vi": "Khi còn nhỏ, anh ấy luôn đá bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an issue or a problem that frequently causes people to disagree or argue",
                    "vi": "một vấn đề hoặc một vấn đề thường xuyên khiến mọi người không đồng ý hoặc tranh luận"
                },
                "examples": [
                    {
                        "en": "Healthcare should not become a political football.",
                        "vi": "Chăm sóc sức khỏe không nên trở thành một thứ bóng đá chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "778d306dfe2547dc9e9446469c41f1fd",
        "word": "result",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/rɪˈzʌlt/",
            "us": "/rɪˈzʌlt/"
        },
        "nearby": [
            {
                "word": "rest upon",
                "pos": "phrasal verb"
            },
            {
                "word": "rest with",
                "pos": "phrasal verb"
            },
            {
                "word": "result",
                "pos": "noun"
            },
            {
                "word": "result",
                "pos": "verb"
            },
            {
                "word": "resultant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is caused or produced because of something else",
                    "vi": "một thứ được gây ra hoặc được tạo ra do một thứ khác"
                },
                "examples": [
                    {
                        "en": "And did your intervention produce the desired result?",
                        "vi": "Và sự can thiệp của bạn có mang lại kết quả như mong muốn không?"
                    },
                    {
                        "en": "to yield/achieve a result",
                        "vi": "để mang lại / đạt được một kết quả"
                    },
                    {
                        "en": "result of something The company's failure was a direct result of bad management.",
                        "vi": "kết quả của điều gì đó Sự thất bại của công ty là kết quả trực tiếp của việc quản lý tồi."
                    },
                    {
                        "en": "This book is the result of 25 years of research.",
                        "vi": "Cuốn sách này là kết quả của 25 năm nghiên cứu."
                    },
                    {
                        "en": "The end result (= the final one) of her hard work was a place at medical school.",
                        "vi": "Kết quả cuối cùng (= kết quả cuối cùng) cho sự chăm chỉ của cô ấy là một suất vào trường y."
                    },
                    {
                        "en": "as a result He made one big mistake, and, as a result, lost his job.",
                        "vi": "kết quả là anh ta đã mắc một sai lầm lớn, và kết quả là anh ta bị mất việc làm."
                    },
                    {
                        "en": "as a result of something She died as a result of her injuries.",
                        "vi": "do hậu quả của một cái gì đó Cô ấy đã chết vì những vết thương của cô ấy."
                    },
                    {
                        "en": "with the result that… The farm was flooded, with the result that the crop was lost.",
                        "vi": "với kết quả là… Trang trại bị ngập lụt, kết quả là mùa màng bị mất trắng."
                    },
                    {
                        "en": "with… results He decided to get involved, with disastrous results.",
                        "vi": "với… kết quả Anh ấy quyết định tham gia, với kết quả thảm hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the final score or the name of the winner in a sports event, competition, election, etc.",
                    "vi": "điểm số cuối cùng hoặc tên của người chiến thắng trong một sự kiện thể thao, cuộc thi, cuộc bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "the election results",
                        "vi": "kết quả bầu cử"
                    },
                    {
                        "en": "The announcer was reading out the football results.",
                        "vi": "Phát thanh viên đang đọc kết quả bóng đá."
                    },
                    {
                        "en": "result of something They will announce the result of the vote tonight.",
                        "vi": "kết quả của một cái gì đó Họ sẽ công bố kết quả của cuộc bỏ phiếu vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a victory or a success",
                    "vi": "một chiến thắng hoặc một thành công"
                },
                "examples": [
                    {
                        "en": "We badly need to get a result from this match.",
                        "vi": "Chúng tôi rất cần có được một kết quả từ trận đấu này."
                    },
                    {
                        "en": "This was a great result for us.",
                        "vi": "Đây là một kết quả tuyệt vời cho chúng tôi."
                    },
                    {
                        "en": "He left. Result! (= used when you are happy something has happened)",
                        "vi": "Anh ấy đã đi. Kết quả! (= được sử dụng khi bạn vui vì điều gì đó đã xảy ra)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mark or grade you get in an exam or in a number of exams",
                    "vi": "điểm hoặc điểm bạn đạt được trong một kỳ thi hoặc trong một số kỳ thi"
                },
                "examples": [
                    {
                        "en": "Have you had your results yet?",
                        "vi": "Bạn đã có kết quả của mình chưa?"
                    },
                    {
                        "en": "When do you get your exam results?",
                        "vi": "Khi nào bạn nhận được kết quả kỳ thi của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a scientific test or piece of research",
                    "vi": "thông tin mà bạn nhận được từ một thử nghiệm khoa học hoặc một phần của nghiên cứu"
                },
                "examples": [
                    {
                        "en": "Other research has yielded similar results.",
                        "vi": "Nghiên cứu khác cũng cho kết quả tương tự."
                    },
                    {
                        "en": "The doctor will explain your blood test results.",
                        "vi": "Bác sĩ sẽ giải thích kết quả xét nghiệm máu của bạn."
                    },
                    {
                        "en": "a positive/negative test result",
                        "vi": "một kết quả xét nghiệm dương tính / âm tính"
                    },
                    {
                        "en": "result of something the results of a study",
                        "vi": "kết quả của một cái gì đó kết quả của một nghiên cứu"
                    },
                    {
                        "en": "The results of our experiment indicate that environmental factors play a part.",
                        "vi": "Kết quả thí nghiệm của chúng tôi chỉ ra rằng các yếu tố môi trường đóng một vai trò quan trọng."
                    },
                    {
                        "en": "The results obtained were compared with previous results.",
                        "vi": "Kết quả thu được được so sánh với kết quả trước đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a computer search",
                    "vi": "thông tin mà bạn nhận được từ tìm kiếm trên máy tính"
                },
                "examples": [
                    {
                        "en": "My search produced several thousand results.",
                        "vi": "Tìm kiếm của tôi cho ra vài nghìn kết quả."
                    },
                    {
                        "en": "The user can control how the search results are displayed.",
                        "vi": "Người dùng có thể kiểm soát cách hiển thị kết quả tìm kiếm."
                    },
                    {
                        "en": "the first page of search results",
                        "vi": "trang đầu tiên của kết quả tìm kiếm"
                    }
                ]
            },
            {
                "define": {
                    "en": "things that are achieved successfully",
                    "vi": "những điều đạt được thành công"
                },
                "examples": [
                    {
                        "en": "The project is beginning to show results.",
                        "vi": "Dự án đang bắt đầu cho thấy kết quả."
                    },
                    {
                        "en": "a coach who knows how to get results from his players",
                        "vi": "một huấn luyện viên biết cách thu được kết quả từ các cầu thủ của mình"
                    },
                    {
                        "en": "For best results, defrost fully before use.",
                        "vi": "Để có kết quả tốt nhất, hãy rã đông hoàn toàn trước khi sử dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of profit or loss made by a business over a particular period of time",
                    "vi": "số tiền lãi hoặc lỗ của một doanh nghiệp trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "Companies are required by law to report their financial results on a quarterly basis.",
                        "vi": "Theo luật, các công ty phải báo cáo kết quả tài chính của họ hàng quý."
                    },
                    {
                        "en": "The company will publish its interim results (= before the final results are known) on Monday.",
                        "vi": "Công ty sẽ công bố kết quả tạm thời (= trước khi biết kết quả cuối cùng) vào thứ Hai."
                    },
                    {
                        "en": "The corporation is expected to announce improved results for the last quarter.",
                        "vi": "Công ty dự kiến sẽ công bố kết quả cải thiện trong quý cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "19237fe51f4c45a099369ee4a66f0cb3",
        "word": "field",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/fiːld/",
            "us": "/fiːld/"
        },
        "nearby": [
            {
                "word": "fiduciary",
                "pos": "noun"
            },
            {
                "word": "fief",
                "pos": "noun"
            },
            {
                "word": "field",
                "pos": "noun"
            },
            {
                "word": "The Field",
                "pos": ""
            },
            {
                "word": "field",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land in the country used for growing crops or keeping animals in, usually surrounded by a fence, etc.",
                    "vi": "một khu vực đất trong nước được sử dụng để trồng trọt hoặc nuôi gia súc, thường có hàng rào bao quanh, v.v."
                },
                "examples": [
                    {
                        "en": "We had to walk across a ploughed field.",
                        "vi": "Chúng tôi phải đi ngang qua một cánh đồng đã được cày xới."
                    },
                    {
                        "en": "in a field We camped in a field near the village.",
                        "vi": "trên một cánh đồng Chúng tôi cắm trại ở một cánh đồng gần làng."
                    },
                    {
                        "en": "People were working in the fields.",
                        "vi": "Mọi người đang làm việc trên cánh đồng."
                    },
                    {
                        "en": "field of something We saw golden fields of wheat.",
                        "vi": "cánh đồng của cái gì đó Chúng tôi đã thấy những cánh đồng lúa mì vàng."
                    },
                    {
                        "en": "He planted a field of beans.",
                        "vi": "Anh ta trồng một cánh đồng đậu."
                    },
                    {
                        "en": "a rice/wheat field",
                        "vi": "một cánh đồng lúa / lúa mì"
                    },
                    {
                        "en": "The house overlooks the sugar cane fields.",
                        "vi": "Ngôi nhà nhìn ra ruộng mía."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land used for the purpose mentioned",
                    "vi": "diện tích đất được sử dụng cho mục đích nêu trên"
                },
                "examples": [
                    {
                        "en": "a landing field",
                        "vi": "một bãi đáp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of land covered with the thing mentioned; an area from which the thing mentioned is obtained",
                    "vi": "một khu đất rộng lớn được bao phủ bởi vật được đề cập; một khu vực mà từ đó thứ được đề cập đến được"
                },
                "examples": [
                    {
                        "en": "The territory is covered with snow, bare rock and ice fields.",
                        "vi": "Lãnh thổ được bao phủ bởi tuyết, đá trơ trụi và những cánh đồng băng."
                    },
                    {
                        "en": "Prisoners were sent to work in the gas fields in the north.",
                        "vi": "Các tù nhân được gửi đến làm việc trong các mỏ khí đốt ở phía bắc."
                    },
                    {
                        "en": "the discovery of the oil and gas fields in the North Sea",
                        "vi": "phát hiện ra các mỏ dầu và khí đốt ở Biển Bắc"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land used for playing a sport on",
                    "vi": "một khu đất được sử dụng để chơi một môn thể thao trên"
                },
                "examples": [
                    {
                        "en": "a football/soccer/sports field",
                        "vi": "một sân bóng đá / bóng đá / thể thao"
                    },
                    {
                        "en": "a baseball/cricket/rugby field",
                        "vi": "sân bóng chày / cricket / bóng bầu dục"
                    },
                    {
                        "en": "on/off the field Every player on the field did their best today.",
                        "vi": "trong / ngoài sân Mọi cầu thủ trên sân đã thi đấu hết mình trong ngày hôm nay."
                    },
                    {
                        "en": "Players need discipline both on and off the field (= when they are playing and also in their free time).",
                        "vi": "Người chơi cần có kỷ luật cả trong và ngoài sân đấu (= khi họ đang chơi và cả khi họ rảnh rỗi)."
                    },
                    {
                        "en": "There was huge excitement as the teams came onto the field.",
                        "vi": "Có một sự phấn khích tột độ khi các đội bước ra sân."
                    },
                    {
                        "en": "Today they take the field (= go on to the field to play a game) against county champions Essex.",
                        "vi": "Hôm nay họ thi đấu (= tiếp tục đến sân để chơi một trò chơi) với nhà vô địch hạt Essex."
                    }
                ]
            },
            {
                "define": {
                    "en": "the team that is trying to catch the ball rather than hit it",
                    "vi": "đội đang cố gắng bắt bóng hơn là đánh nó"
                },
                "examples": [
                    {
                        "en": "He took the ball early and hit it through a gap in the field.",
                        "vi": "Anh ấy đã nhận bóng sớm và đánh nó qua một khoảng trống trên sân."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the people or animals competing in a particular sports event",
                    "vi": "tất cả những người hoặc động vật thi đấu trong một sự kiện thể thao cụ thể"
                },
                "examples": [
                    {
                        "en": "The strong field includes three world record holders.",
                        "vi": "Lĩnh vực mạnh mẽ bao gồm ba người giữ kỷ lục thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land where a battle is fought",
                    "vi": "một vùng đất diễn ra trận chiến"
                },
                "examples": [
                    {
                        "en": "in the field a medal for bravery in the field",
                        "vi": "trong lĩnh vực này huy chương cho sự dũng cảm trong lĩnh vực này"
                    },
                    {
                        "en": "on the field to die on the field of battle",
                        "vi": "trên chiến trường chết trên chiến trường"
                    },
                    {
                        "en": "a field ambulance/kitchen",
                        "vi": "xe cấp cứu dã chiến / nhà bếp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular subject or activity that somebody works in or is interested in",
                    "vi": "một chủ đề hoặc hoạt động cụ thể mà ai đó làm việc hoặc quan tâm đến"
                },
                "examples": [
                    {
                        "en": "Child development is such an interesting field.",
                        "vi": "Phát triển trẻ em là một lĩnh vực thú vị."
                    },
                    {
                        "en": "Genetic science has developed dramatically since I entered the field 40 years ago.",
                        "vi": "Khoa học di truyền đã phát triển vượt bậc kể từ khi tôi bước vào lĩnh vực này cách đây 40 năm."
                    },
                    {
                        "en": "in a field All of them are experts in their chosen field.",
                        "vi": "trong một lĩnh vực Tất cả họ đều là chuyên gia trong lĩnh vực mà họ đã chọn."
                    },
                    {
                        "en": "He was awarded a Nobel Prize for his work in this field.",
                        "vi": "Ông đã được trao giải Nobel cho công việc của mình trong lĩnh vực này."
                    },
                    {
                        "en": "in the field of something She works in the field of adult education.",
                        "vi": "trong lĩnh vực gì đó Cô ấy làm việc trong lĩnh vực giáo dục người lớn."
                    },
                    {
                        "en": "I enjoy meeting people in other fields of business.",
                        "vi": "Tôi thích gặp gỡ mọi người trong các lĩnh vực kinh doanh khác."
                    },
                    {
                        "en": "field of something This discovery has opened up a whole new field of study.",
                        "vi": "lĩnh vực gì đó Khám phá này đã mở ra một lĩnh vực nghiên cứu hoàn toàn mới."
                    },
                    {
                        "en": "‘How big was the bomb, if it did all that damage?’ ‘I don’t know. Not my field’ (= that is not one of the subjects I know about).",
                        "vi": "Quả bom lớn đến mức nào, nếu nó gây ra tất cả những thiệt hại đó?' 'Tôi không biết. Không phải lĩnh vực của tôi '(= đó không phải là một trong những chủ đề tôi biết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of people doing practical work or study, rather than working in a library or laboratory",
                    "vi": "thực tế là mọi người đang làm việc hoặc nghiên cứu thực tế, thay vì làm việc trong thư viện hoặc phòng thí nghiệm"
                },
                "examples": [
                    {
                        "en": "a field study/experiment",
                        "vi": "một nghiên cứu / thử nghiệm thực địa"
                    },
                    {
                        "en": "field recordings/observations",
                        "vi": "ghi chép / quan sát hiện trường"
                    },
                    {
                        "en": "Her findings were based on extensive field and laboratory work.",
                        "vi": "Những phát hiện của cô ấy dựa trên các công việc trong phòng thí nghiệm và thực địa rộng lớn."
                    },
                    {
                        "en": "We then tested the questionnaire in field conditions.",
                        "vi": "Sau đó, chúng tôi đã kiểm tra bảng câu hỏi trong điều kiện thực địa."
                    },
                    {
                        "en": "in the field tests carried out in the field",
                        "vi": "trong các cuộc kiểm tra hiện trường được thực hiện tại hiện trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "all the people or products competing in a particular area of business",
                    "vi": "tất cả những người hoặc sản phẩm cạnh tranh trong một lĩnh vực kinh doanh cụ thể"
                },
                "examples": [
                    {
                        "en": "They lead the field in home entertainment systems.",
                        "vi": "Họ dẫn đầu trong lĩnh vực hệ thống giải trí gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area within which the force mentioned has an effect",
                    "vi": "một khu vực trong đó lực được đề cập có tác dụng"
                },
                "examples": [
                    {
                        "en": "the earth’s gravitational field",
                        "vi": "trường hấp dẫn của trái đất"
                    },
                    {
                        "en": "an electromagnetic field",
                        "vi": "một trường điện từ"
                    },
                    {
                        "en": "Weak electric fields are emitted by all living organisms.",
                        "vi": "Điện trường yếu được phát ra bởi tất cả các cơ thể sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "part of a record that is a separate item of data",
                    "vi": "một phần của bản ghi là một mục dữ liệu riêng biệt"
                },
                "examples": [
                    {
                        "en": "You will need to create separate fields for first name, surname and address.",
                        "vi": "Bạn sẽ cần tạo các trường riêng biệt cho tên, họ và địa chỉ."
                    },
                    {
                        "en": "the use of keys to move between fields",
                        "vi": "việc sử dụng các phím để di chuyển giữa các trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "to enable somebody to be successful in a particular area of activity because other people or groups have given up competing with them",
                    "vi": "để cho phép ai đó thành công trong một lĩnh vực hoạt động cụ thể vì những người hoặc nhóm khác đã từ bỏ việc cạnh tranh với họ"
                },
                "examples": [
                    {
                        "en": "The complete disarray of the opposition parties leaves the field clear for the government to implement urgent reforms.",
                        "vi": "Sự hỗn loạn hoàn toàn của các đảng đối lập khiến chính phủ trở nên rõ ràng để thực hiện các cải cách khẩn cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a situation where everyone has the same opportunities",
                    "vi": "để tạo ra một tình huống mà mọi người đều có cơ hội như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have sexual relationships with a lot of different people",
                    "vi": "quan hệ tình dục với nhiều người khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "69a7735c1bb342f09b8314e19daaa7e2",
        "word": "football boot",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfʊtbɔːl buːt/",
            "us": "/ˈfʊtbɔːl buːt/"
        },
        "nearby": [
            {
                "word": "football",
                "pos": "noun"
            },
            {
                "word": "the Football Association",
                "pos": ""
            },
            {
                "word": "football boot",
                "pos": "noun"
            },
            {
                "word": "footballer",
                "pos": "noun"
            },
            {
                "word": "footballing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a leather shoe with studs (= pieces of plastic or metal) on the bottom to stop it from slipping, worn for playing football (soccer)",
                    "vi": "một chiếc giày da có đinh tán (= miếng nhựa hoặc kim loại) ở phía dưới để giúp giày không bị trượt, dùng để chơi bóng đá (bóng đá)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9ab5678e503b41b890f28c7abd950e73",
        "word": "kick",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/kɪk/",
            "us": "/kɪk/"
        },
        "nearby": [
            {
                "word": "kibosh",
                "pos": "noun"
            },
            {
                "word": "kick-start",
                "pos": "noun"
            },
            {
                "word": "kick",
                "pos": "verb"
            },
            {
                "word": "kick",
                "pos": "noun"
            },
            {
                "word": "kick about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit somebody/something with your foot",
                    "vi": "đánh ai đó / cái gì đó bằng chân của bạn"
                },
                "examples": [
                    {
                        "en": "Stop kicking—it hurts!",
                        "vi": "Đừng đá nữa - đau quá!"
                    },
                    {
                        "en": "kick somebody/something She was punched and kicked by her attackers.",
                        "vi": "kick somebody / something Cô ấy bị những kẻ tấn công đấm và đá."
                    },
                    {
                        "en": "kick somebody/something + adv./prep./adj. The boys were kicking a ball around in the yard.",
                        "vi": "đá ai đó / cái gì đó + adv./prep./adj. Các cậu bé đang đá một quả bóng quanh sân."
                    },
                    {
                        "en": "Vandals had kicked the door down.",
                        "vi": "Kẻ phá hoại đã đạp đổ cánh cửa."
                    },
                    {
                        "en": "She had to kick the door open because her hands were full.",
                        "vi": "Cô phải đá tung cánh cửa vì hai tay cô đầy."
                    },
                    {
                        "en": "kick + adv./prep. She kicked at the loose pebbles by the roadside.",
                        "vi": "kick + adv./prep. Cô đá vào những viên sỏi bên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move your legs as if you were kicking something",
                    "vi": "di chuyển chân của bạn như thể bạn đang đá một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The child was dragged away, kicking and screaming.",
                        "vi": "Đứa trẻ bị lôi đi, đá và la hét."
                    },
                    {
                        "en": "kick something The dancers kicked their legs in the air.",
                        "vi": "kick something Các vũ công đá chân lên trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be annoyed with yourself because you have done something stupid, missed an opportunity, etc.",
                    "vi": "khó chịu với bản thân vì bạn đã làm điều gì đó ngu ngốc, bỏ lỡ cơ hội, v.v."
                },
                "examples": [
                    {
                        "en": "He'll kick himself when he finds out he could have had the job.",
                        "vi": "Anh ấy sẽ đá chính mình khi anh ấy phát hiện ra rằng anh ấy có thể đã có công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to score points by kicking the ball",
                    "vi": "ghi điểm bằng cách đá bóng"
                },
                "examples": [
                    {
                        "en": "to kick a penalty/goal",
                        "vi": "sút phạt / ghi bàn"
                    },
                    {
                        "en": "He kicked 23 points, ensuring victory for New Zealand.",
                        "vi": "Anh đá chính 23 điểm, đảm bảo chiến thắng cho New Zealand."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something harmful that you have done for a long time",
                    "vi": "ngừng làm điều gì đó có hại mà bạn đã làm trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "He had been smoking for 15 years and wanted to kick the habit.",
                        "vi": "Anh ta đã hút thuốc 15 năm và muốn bỏ thói quen này."
                    },
                    {
                        "en": "to kick the drug/booze",
                        "vi": "phê thuốc / uống rượu"
                    }
                ]
            },
            {
                "define": {
                    "en": "very active, healthy or popular",
                    "vi": "rất năng động, lành mạnh hoặc phổ biến"
                },
                "examples": [
                    {
                        "en": "My mother is still alive and kicking.",
                        "vi": "Mẹ tôi vẫn còn sống và đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody/something very hard",
                    "vi": "đánh ai đó / cái gì đó rất khó"
                },
                "examples": [
                    {
                        "en": "He was a dirty player and loved to kick hell out of the opposition.",
                        "vi": "Anh ta là một cầu thủ bẩn thỉu và thích đá văng khỏi địa ngục của phe đối lập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in a way that is aggressive or full of energy",
                    "vi": "hành động theo cách hung hăng hoặc tràn đầy năng lượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to succeed or win in an impressive way",
                    "vi": "để thành công hoặc giành chiến thắng một cách ấn tượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to punish or defeat somebody",
                    "vi": "trừng phạt hoặc đánh bại ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to die",
                    "vi": "chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to delay dealing with a problem",
                    "vi": "trì hoãn việc giải quyết một vấn đề"
                },
                "examples": [
                    {
                        "en": "This is another attempt to kick the can down the road and leave it to the next generation.",
                        "vi": "Đây là một nỗ lực khác để đá chiếc lon xuống đường và để lại nó cho thế hệ tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have nothing to do while you are waiting for somebody/something",
                    "vi": "không có gì để làm trong khi bạn đang đợi ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "We were kicking our heels, waiting for some customers.",
                        "vi": "Chúng tôi đang đá gót, chờ đợi một số khách hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you drag somebody kicking and screaming to do something, they only do it with great protests because they don't really want to do it at all",
                    "vi": "nếu bạn lôi ai đó đá và la hét để làm điều gì đó, họ chỉ làm điều đó với sự phản đối kịch liệt bởi vì họ không thực sự muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "The president had to be dragged kicking and screaming to the signing ceremony.",
                        "vi": "Tổng thống đã bị kéo đá và la hét đến buổi lễ ký kết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody badly or fail to give them help when they need it",
                    "vi": "đối xử tệ với ai đó hoặc không giúp đỡ họ khi họ cần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reject something or treat it as not important; to stop dealing with a problem",
                    "vi": "từ chối một cái gì đó hoặc coi nó là không quan trọng; ngừng đối phó với một vấn đề"
                },
                "examples": [
                    {
                        "en": "He tends to deal with disputes by kicking them into the long grass.",
                        "vi": "Anh ấy có xu hướng giải quyết các tranh chấp bằng cách đá chúng vào mặt cỏ dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to behave badly and refuse to accept any discipline or control",
                    "vi": "bắt đầu cư xử tồi tệ và từ chối chấp nhận bất kỳ kỷ luật hoặc kiểm soát nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to test the quality of something to see whether it is suitable for you before you buy it",
                    "vi": "để kiểm tra chất lượng của thứ gì đó để xem liệu nó có phù hợp với bạn hay không trước khi bạn mua nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to complain loudly about something",
                    "vi": "lớn tiếng phàn nàn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "They’ll usually give you your money back if you threaten to kick up a stink.",
                        "vi": "Họ thường sẽ trả lại tiền cho bạn nếu bạn đe dọa sẽ bốc mùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be relaxed and enjoy yourself",
                    "vi": "để được thư giãn và tận hưởng bản thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move somebody to a job that seems to be more important but that actually has less power or influence",
                    "vi": "để chuyển ai đó đến một công việc có vẻ quan trọng hơn nhưng thực sự có ít quyền lực hoặc ảnh hưởng hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to hurt somebody when they are already defeated, etc.",
                    "vi": "để tiếp tục làm tổn thương ai đó khi họ đã bị đánh bại, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f85ff7a8caa0401789651d70ce21f9dc",
        "word": "soccer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈsɒkə(r)/",
            "us": "/ˈsɑːkər/"
        },
        "nearby": [
            {
                "word": "SOCA",
                "pos": ""
            },
            {
                "word": "so-called",
                "pos": "adjective"
            },
            {
                "word": "soccer",
                "pos": "noun"
            },
            {
                "word": "soccer mom",
                "pos": "noun"
            },
            {
                "word": "sociability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game played by two teams of 11 players, using a round ball which players kick up and down the playing field. Teams try to kick the ball into the other team’s goal.",
                    "vi": "một trò chơi được chơi bởi hai đội gồm 11 người chơi, sử dụng một quả bóng tròn để các cầu thủ đá lên và xuống sân chơi. Các đội cố gắng sút bóng vào khung thành của đội kia."
                },
                "examples": [
                    {
                        "en": "I played soccer when I was younger.",
                        "vi": "Tôi đã chơi bóng đá khi tôi còn nhỏ."
                    },
                    {
                        "en": "a soccer team/club/player/fan",
                        "vi": "một đội bóng đá / câu lạc bộ / cầu thủ / người hâm mộ"
                    },
                    {
                        "en": "a soccer match/game",
                        "vi": "một trận đấu / trò chơi bóng đá"
                    },
                    {
                        "en": "a soccer field",
                        "vi": "một sân bóng đá"
                    },
                    {
                        "en": "a soccer pitch/stadium",
                        "vi": "sân bóng đá / sân vận động"
                    },
                    {
                        "en": "They were watching a game of soccer on TV.",
                        "vi": "Họ đang xem một trận bóng trên TV."
                    }
                ]
            }
        ]
    },
    {
        "id": "b76b5308a32547c79dd7d13536bdebd5",
        "word": "footballer",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfʊtbɔːlə(r)/",
            "us": "/ˈfʊtbɔːlər/"
        },
        "nearby": [
            {
                "word": "the Football Association",
                "pos": ""
            },
            {
                "word": "football boot",
                "pos": "noun"
            },
            {
                "word": "footballer",
                "pos": "noun"
            },
            {
                "word": "footballing",
                "pos": "adjective"
            },
            {
                "word": "the Football League",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who plays football, especially as a profession",
                    "vi": "một người chơi bóng đá, đặc biệt là một nghề"
                },
                "examples": [
                    {
                        "en": "a professional footballer",
                        "vi": "một cầu thủ bóng đá chuyên nghiệp"
                    }
                ]
            }
        ]
    },
    {
        "id": "9fc6e3496345487babe0ff21e161a347",
        "word": "footballing",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfʊtbɔːlɪŋ/",
            "us": "/ˈfʊtbɔːlɪŋ/"
        },
        "nearby": [
            {
                "word": "football boot",
                "pos": "noun"
            },
            {
                "word": "footballer",
                "pos": "noun"
            },
            {
                "word": "footballing",
                "pos": "adjective"
            },
            {
                "word": "the Football League",
                "pos": ""
            },
            {
                "word": "football pools",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the game of football (soccer)",
                    "vi": "kết nối với trò chơi bóng đá (bóng đá)"
                },
                "examples": [
                    {
                        "en": "footballing skills",
                        "vi": "kỹ năng bóng đá"
                    }
                ]
            }
        ]
    },
    {
        "id": "2b0ae127294e4592a91add379a8334da",
        "word": "assistant referee",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˌsɪstənt refəˈriː/",
            "us": "/əˌsɪstənt refəˈriː/"
        },
        "nearby": [
            {
                "word": "assistant",
                "pos": "adjective"
            },
            {
                "word": "assistant professor",
                "pos": "noun"
            },
            {
                "word": "assistant referee",
                "pos": "noun"
            },
            {
                "word": "assistantship",
                "pos": "noun"
            },
            {
                "word": "assisted area",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official name for a linesman (= an official who helps the referee, for example in deciding whether or where a ball has passed outside the field of play)",
                    "vi": "tên chính thức của một trọng tài biên (= một trọng tài giúp trọng tài, chẳng hạn trong việc quyết định xem bóng đã qua bên ngoài sân thi đấu hay chưa)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0d2eae4dd10b40b8afb326032138d2d5",
        "word": "corner",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɔːnə(r)/",
            "us": "/ˈkɔːrnər/"
        },
        "nearby": [
            {
                "word": "corned beef",
                "pos": "noun"
            },
            {
                "word": "cornelian",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "verb"
            },
            {
                "word": "cornerback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of something where two or more sides, lines or edges join",
                    "vi": "một phần của thứ gì đó có hai hoặc nhiều cạnh, đường hoặc cạnh nối với nhau"
                },
                "examples": [
                    {
                        "en": "the four corners of a square",
                        "vi": "bốn góc của một hình vuông"
                    },
                    {
                        "en": "I hit my knee on the corner of the table.",
                        "vi": "Tôi đập đầu gối vào góc bàn."
                    },
                    {
                        "en": "Write your address in the top right-hand corner of the letter.",
                        "vi": "Viết địa chỉ của bạn ở góc trên cùng bên phải của bức thư."
                    },
                    {
                        "en": "the left/right corner",
                        "vi": "góc trái / phải"
                    },
                    {
                        "en": "the north-west/north-east/south-east/south-west corner",
                        "vi": "góc tây bắc / đông bắc / nam đông / tây nam"
                    },
                    {
                        "en": "A smile lifted the corner of his mouth.",
                        "vi": "Một nụ cười nhếch lên khóe miệng."
                    },
                    {
                        "en": "in the corner of something a speck of dirt in the corner of her eye",
                        "vi": "trong góc của thứ gì đó có một đốm bẩn trong khóe mắt của cô ấy"
                    },
                    {
                        "en": "He scored with a shot into the bottom corner of the goal.",
                        "vi": "Anh ấy đã ghi bàn bằng một cú sút vào góc thấp khung thành."
                    },
                    {
                        "en": "She tucked the ball into the corner of the net.",
                        "vi": "Cô ấy đệm bóng vào góc lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the number of corners mentioned; involving the number of groups mentioned",
                    "vi": "với số lượng các góc đã nêu; liên quan đến số lượng các nhóm được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-cornered hat",
                        "vi": "một chiếc mũ ba góc"
                    },
                    {
                        "en": "a three-cornered fight",
                        "vi": "một cuộc chiến ba góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the place inside a room or a box where two sides join; the area around this place",
                    "vi": "nơi bên trong một căn phòng hoặc một cái hộp mà hai bên tham gia vào nhau; khu vực xung quanh nơi này"
                },
                "examples": [
                    {
                        "en": "A large desk occupies another corner of the room.",
                        "vi": "Một bàn làm việc lớn chiếm một góc khác của căn phòng."
                    },
                    {
                        "en": "He found a quiet corner and got on with his work.",
                        "vi": "Anh tìm một góc yên tĩnh và tiếp tục với công việc của mình."
                    },
                    {
                        "en": "in the corner They made straight for the table in the corner.",
                        "vi": "ở góc Họ đã làm thẳng cho cái bàn trong góc."
                    },
                    {
                        "en": "in the corner of something She spotted him sitting in the corner of the bar.",
                        "vi": "trong góc của cái gì đó Cô phát hiện ra anh ta đang ngồi trong góc của quầy bar."
                    },
                    {
                        "en": "We found an empty booth in a dark corner of the pub.",
                        "vi": "Chúng tôi tìm thấy một gian hàng trống trong một góc tối của quán rượu."
                    },
                    {
                        "en": "There was a television in the far corner of the bedroom.",
                        "vi": "Có một chiếc tivi ở góc xa của phòng ngủ."
                    },
                    {
                        "en": "a corner table/seat/cupboard",
                        "vi": "một cái bàn / chỗ ngồi / cái tủ ở góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two streets join",
                    "vi": "một nơi mà hai con phố nối với nhau"
                },
                "examples": [
                    {
                        "en": "The wind hit him as he turned the corner.",
                        "vi": "Gió ập vào anh khi anh rẽ vào góc đường."
                    },
                    {
                        "en": "corner of A and B the last house before the corner of Beach Road and Hill Avenue",
                        "vi": "căn góc A và B căn nhà cuối cùng trước góc đường Beach và đại lộ Hill"
                    },
                    {
                        "en": "on the corner There was a group of youths standing on the street corner.",
                        "vi": "ở góc phố Có một nhóm thanh niên đang đứng ở góc phố."
                    },
                    {
                        "en": "on the corner of something There’s a hotel on the corner of my street.",
                        "vi": "ở góc của cái gì đó Có một khách sạn ở góc đường của tôi."
                    },
                    {
                        "en": "at the corner (of something) Turn right at the corner of Sunset and Crescent Heights Boulevards.",
                        "vi": "ở góc (của một cái gì đó) Rẽ phải ở góc của Đại lộ Hoàng hôn và Lưỡi liềm."
                    },
                    {
                        "en": "around/round the corner The bus stop is around the corner, I think.",
                        "vi": "xung quanh / vòng quanh góc Trạm xe buýt ở quanh góc, tôi nghĩ."
                    },
                    {
                        "en": "around/round the corner from something the bookshop around the corner from our hotel",
                        "vi": "xung quanh / vòng quanh góc từ một cái gì đó hiệu sách xung quanh góc từ khách sạn của chúng tôi"
                    },
                    {
                        "en": "(at the) corner with something the big tree at the corner with Hill Street",
                        "vi": "(ở góc) với một cái gì đó cái cây lớn ở góc với Phố Hill"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road",
                    "vi": "một khúc cua gấp trên một con đường"
                },
                "examples": [
                    {
                        "en": "The car was taking the corners too fast.",
                        "vi": "Chiếc xe đã vào góc quá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a region or an area of a place (sometimes used for one that is far away or difficult to reach)",
                    "vi": "một khu vực hoặc một khu vực của một địa điểm (đôi khi được sử dụng cho một địa điểm ở xa hoặc khó tiếp cận)"
                },
                "examples": [
                    {
                        "en": "She lives in a quiet corner of rural Yorkshire.",
                        "vi": "Cô sống ở một góc yên tĩnh của vùng nông thôn Yorkshire."
                    },
                    {
                        "en": "Students come here from the four corners of the world.",
                        "vi": "Sinh viên đến đây từ bốn phương."
                    },
                    {
                        "en": "He knew every corner of the old town.",
                        "vi": "Anh biết mọi ngóc ngách của khu phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation",
                    "vi": "Một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "to back/drive/force somebody into a corner",
                        "vi": "lùi / lái xe / buộc ai đó vào một góc"
                    },
                    {
                        "en": "They had got her in a corner, and there wasn't much she could do about it.",
                        "vi": "Họ đã dồn cô ấy vào một góc, và cô ấy không thể làm được gì nhiều."
                    },
                    {
                        "en": "He was used to talking his way out of tight corners.",
                        "vi": "Anh ấy đã quen với việc nói theo cách của mình từ những góc hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a free kick or hit that you take from the corner of your opponent’s end of the field",
                    "vi": "một quả đá phạt hoặc cú đánh mà bạn thực hiện từ góc cuối sân của đối phương"
                },
                "examples": [
                    {
                        "en": "Moore took the corner.",
                        "vi": "Moore thực hiện quả phạt góc."
                    },
                    {
                        "en": "The referee awarded a corner.",
                        "vi": "Trọng tài cho hưởng quả phạt góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four corners of a ring; the supporters who help in the corner",
                    "vi": "bất kỳ trong bốn góc của một chiếc nhẫn; những người ủng hộ giúp đỡ trong góc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very near",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "Her house is just around the corner.",
                        "vi": "Nhà cô ấy ở ngay góc phố."
                    },
                    {
                        "en": "(figurative) There were good times around the corner (= they would soon come).",
                        "vi": "(nghĩa bóng) Đã có những khoảng thời gian tuyệt vời (= họ sẽ sớm đến)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support and encourage somebody; to have somebody who supports and encourages you",
                    "vi": "để hỗ trợ và khuyến khích ai đó; để có ai đó ủng hộ và khuyến khích bạn"
                },
                "examples": [
                    {
                        "en": "He's been in my corner all these years and I can never thank him enough.",
                        "vi": "Anh ấy đã ở trong góc của tôi suốt những năm qua và tôi không bao giờ có thể cảm ơn anh ấy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go across the corner of an area and not around the sides of it, because it is quicker",
                    "vi": "để đi qua góc của một khu vực chứ không phải xung quanh các cạnh của nó, bởi vì nó nhanh hơn"
                },
                "examples": [
                    {
                        "en": "There’s a worn patch on the grass because everyone cuts (off) the corner.",
                        "vi": "Có một mảng cỏ đã mòn vì mọi người cắt bỏ (cắt bỏ) góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out",
                    "vi": "để làm điều gì đó theo cách dễ nhất, rẻ nhất hoặc nhanh nhất, thường bằng cách bỏ qua các quy tắc hoặc bỏ qua điều gì đó"
                },
                "examples": [
                    {
                        "en": "To be competitive, they paid low wages and cut corners on health and safety.",
                        "vi": "Để cạnh tranh, họ trả lương thấp và cắt giảm sức khỏe và an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defend your/somebody’s position against other people",
                    "vi": "để bảo vệ lập trường của bạn / ai đó trước những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft corner for you.",
                        "vi": "Cô ấy luôn có một góc mềm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    },
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it",
                    "vi": "nhìn thấy vật gì đó một cách tình cờ hoặc không rõ ràng lắm vì bạn nhìn thấy vật đó từ phía bên mắt mình và không nhìn thẳng vào vật đó"
                },
                "examples": [
                    {
                        "en": "Out of the corner of her eye, she saw him coming closer.",
                        "vi": "Qua khóe mắt, cô thấy anh đang tiến lại gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass a very important point in an illness or a difficult situation and begin to improve",
                    "vi": "vượt qua một điểm rất quan trọng trong một căn bệnh hoặc một tình huống khó khăn và bắt đầu cải thiện"
                },
                "examples": [
                    {
                        "en": "The country's economy has finally turned the corner.",
                        "vi": "Nền kinh tế của đất nước cuối cùng cũng đã rẽ vào ngõ ngách."
                    }
                ]
            }
        ]
    },
    {
        "id": "5822e44a7a6c45f4ae5c16425e01210b",
        "word": "corner kick",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɔːnə kɪk/",
            "us": "/ˈkɔːrnər kɪk/"
        },
        "nearby": [
            {
                "word": "corner",
                "pos": "verb"
            },
            {
                "word": "cornerback",
                "pos": "noun"
            },
            {
                "word": "corner kick",
                "pos": "noun"
            },
            {
                "word": "corner shop",
                "pos": "noun"
            },
            {
                "word": "cornerstone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a free kick that you take from the corner of your opponent’s end of the field",
                    "vi": "một quả đá phạt mà bạn thực hiện từ góc cuối sân của đối phương"
                },
                "examples": [
                    {
                        "en": "Pogba scored off a corner kick in the 29th minute.",
                        "vi": "Pogba ghi bàn từ quả phạt góc ở phút 29."
                    }
                ]
            }
        ]
    },
    {
        "id": "169477f78bc34d3cbff3af7de43c7aa8",
        "word": "goal area",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡəʊl eəriə/",
            "us": "/ˈɡəʊl eriə/"
        },
        "nearby": [
            {
                "word": "go-ahead",
                "pos": "noun"
            },
            {
                "word": "goal",
                "pos": "noun"
            },
            {
                "word": "goal area",
                "pos": "noun"
            },
            {
                "word": "goalball",
                "pos": "noun"
            },
            {
                "word": "goal difference",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in front of the goal from which goal kicks must be taken",
                    "vi": "một khu vực phía trước khung thành mà từ đó phải thực hiện các quả phát bóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e17dfa618454e1787be271b06a6e5f1",
        "word": "goalkeeping",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡəʊlkiːpɪŋ/",
            "us": "/ˈɡəʊlkiːpɪŋ/"
        },
        "nearby": [
            {
                "word": "goal difference",
                "pos": "noun"
            },
            {
                "word": "goalkeeper",
                "pos": "noun"
            },
            {
                "word": "goalkeeping",
                "pos": "noun"
            },
            {
                "word": "goal kick",
                "pos": "noun"
            },
            {
                "word": "goalless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the job of stopping the ball from going into your own team's goal",
                    "vi": "công việc ngăn chặn bóng đi vào khung thành của đội bạn"
                },
                "examples": [
                    {
                        "en": "goalkeeping techniques",
                        "vi": "kỹ thuật thủ môn"
                    }
                ]
            }
        ]
    },
    {
        "id": "de962d925a434179a7ffd21c06e02944",
        "word": "goal kick",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡəʊl kɪk/",
            "us": "/ˈɡəʊl kɪk/"
        },
        "nearby": [
            {
                "word": "goalkeeper",
                "pos": "noun"
            },
            {
                "word": "goalkeeping",
                "pos": "noun"
            },
            {
                "word": "goal kick",
                "pos": "noun"
            },
            {
                "word": "goalless",
                "pos": "adjective"
            },
            {
                "word": "goal line",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kick taken by one team after the ball has been kicked over their goal line by the other team without a goal being scored",
                    "vi": "một cú đá được thực hiện bởi một đội sau khi bóng đã được đội kia đá qua đường khung thành của họ mà không có bàn thắng được ghi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an attempt to kick a goal",
                    "vi": "một nỗ lực để đá một mục tiêu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bd723b6af8044cdb968f6f0f13468f0b",
        "word": "goalpost",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡəʊlpəʊst/",
            "us": "/ˈɡəʊlpəʊst/"
        },
        "nearby": [
            {
                "word": "go along with",
                "pos": "phrasal verb"
            },
            {
                "word": "goal poacher",
                "pos": "noun"
            },
            {
                "word": "goalpost",
                "pos": "noun"
            },
            {
                "word": "goalscorer",
                "pos": "noun"
            },
            {
                "word": "goaltender",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the two posts that form part of a goal",
                    "vi": "một trong hai bài đăng tạo thành một phần của mục tiêu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change the rules for something, or conditions under which it is done, so that the situation becomes more difficult for somebody",
                    "vi": "để thay đổi các quy tắc cho một cái gì đó hoặc các điều kiện mà nó được thực hiện, để tình hình trở nên khó khăn hơn đối với ai đó"
                },
                "examples": [
                    {
                        "en": "I manage to get on top of the job, and then they move the goalposts again.",
                        "vi": "Tôi xoay sở để hoàn thành công việc, và sau đó họ lại di chuyển các cột mục tiêu."
                    }
                ]
            }
        ]
    },
    {
        "id": "5932c4ed508f42ac90b1f0badceb2de5",
        "word": "injury time",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɪndʒəri taɪm/",
            "us": "/ˈɪndʒəri taɪm/"
        },
        "nearby": [
            {
                "word": "injurious",
                "pos": "adjective"
            },
            {
                "word": "injury",
                "pos": "noun"
            },
            {
                "word": "injury time",
                "pos": "noun"
            },
            {
                "word": "injustice",
                "pos": "noun"
            },
            {
                "word": "ink",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "time added at the end of a game of football (soccer), hockey, etc. because the game has been interrupted by injured players needing treatment",
                    "vi": "thời gian được thêm vào khi kết thúc trận đấu bóng đá (bóng đá), khúc côn cầu, v.v. do trận đấu bị gián đoạn do các cầu thủ bị thương cần được điều trị"
                },
                "examples": [
                    {
                        "en": "They scored two goals in injury time.",
                        "vi": "Họ ghi hai bàn trong những phút bù giờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6a267cfc56ea46d184b99313ca026675",
        "word": "own goal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌəʊn ˈɡəʊl/",
            "us": "/ˌəʊn ˈɡəʊl/"
        },
        "nearby": [
            {
                "word": "owner-occupier",
                "pos": "noun"
            },
            {
                "word": "ownership",
                "pos": "noun"
            },
            {
                "word": "own goal",
                "pos": "noun"
            },
            {
                "word": "own-label",
                "pos": "adjective"
            },
            {
                "word": "own up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a goal that is scored by mistake by a player against his or her own team",
                    "vi": "một bàn thắng được ghi do nhầm lẫn bởi một cầu thủ trong đội của họ"
                },
                "examples": [
                    {
                        "en": "Vega scored an unfortunate own goal when he slipped as he tried to clear the ball.",
                        "vi": "Vega đã phản lưới nhà đáng tiếc khi anh ấy trượt chân khi cố gắng phá bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you do that achieves the opposite of what you wanted and that brings you a disadvantage",
                    "vi": "điều gì đó mà bạn làm đạt được điều ngược lại với những gì bạn muốn và điều đó mang lại cho bạn một bất lợi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fadc9cf6f3134b09b6182b338e808cca",
        "word": "referee’s assistant",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌrefəriːz əˈsɪstənt/",
            "us": "/ˌrefəriːz əˈsɪstənt/"
        },
        "nearby": [
            {
                "word": "referee",
                "pos": "noun"
            },
            {
                "word": "referee",
                "pos": "verb"
            },
            {
                "word": "referee's assistant",
                "pos": "noun"
            },
            {
                "word": "reference",
                "pos": "noun"
            },
            {
                "word": "reference",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official name for a linesman (= an official who helps the referee, for example in deciding whether or where a ball has passed outside the field of play)",
                    "vi": "tên chính thức của một trọng tài biên (= một trọng tài giúp trọng tài, chẳng hạn trong việc quyết định xem bóng đã qua bên ngoài sân thi đấu hay chưa)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "056d4e10984c43749a2a63e097e34610",
        "word": "area",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈeəriə/",
            "us": "/ˈeriə/"
        },
        "nearby": [
            {
                "word": "are1",
                "pos": "verb"
            },
            {
                "word": "are2",
                "pos": "noun"
            },
            {
                "word": "area",
                "pos": "noun"
            },
            {
                "word": "area code",
                "pos": "noun"
            },
            {
                "word": "Area of Outstanding Natural Beauty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "part of a place, town, etc., or a region of a country or the world",
                    "vi": "một phần của địa điểm, thị trấn, v.v., hoặc một khu vực của quốc gia hoặc thế giới"
                },
                "examples": [
                    {
                        "en": "to improve access to services in rural areas",
                        "vi": "cải thiện khả năng tiếp cận các dịch vụ ở khu vực nông thôn"
                    },
                    {
                        "en": "urban/metropolitan/residential areas",
                        "vi": "khu đô thị / đô thị / khu dân cư"
                    },
                    {
                        "en": "The farm and surrounding area were flooded.",
                        "vi": "Trang trại và khu vực xung quanh bị ngập lụt."
                    },
                    {
                        "en": "She knows the local area very well.",
                        "vi": "Cô ấy biết rất rõ về khu vực địa phương."
                    },
                    {
                        "en": "area around… the area around San Francisco",
                        "vi": "khu vực xung quanh… khu vực xung quanh San Francisco"
                    },
                    {
                        "en": "Large areas of the city were destroyed in the earthquake.",
                        "vi": "Các khu vực rộng lớn của thành phố đã bị phá hủy trong trận động đất."
                    },
                    {
                        "en": "over a… area Wreckage from the plane was scattered over a wide area.",
                        "vi": "trên một… khu vực Mảnh vỡ từ máy bay nằm rải rác trên một khu vực rộng lớn."
                    },
                    {
                        "en": "Thousands of tourists visit the area every year.",
                        "vi": "Hàng ngàn khách du lịch đến thăm khu vực này mỗi năm."
                    },
                    {
                        "en": "in the area There are lots of things to do in the area.",
                        "vi": "trong khu vực Có rất nhiều hoạt động trong khu vực."
                    },
                    {
                        "en": "Ted has lived in this area all his life.",
                        "vi": "Ted đã sống ở khu vực này cả đời."
                    },
                    {
                        "en": "People who live in remote areas of the country may not have access to electricity.",
                        "vi": "Những người sống ở các vùng sâu vùng xa của đất nước có thể không được sử dụng điện."
                    },
                    {
                        "en": "A lot of new people have moved into the area recently.",
                        "vi": "Rất nhiều người mới đã chuyển đến sống trong khu vực gần đây."
                    },
                    {
                        "en": "John is the London area manager.",
                        "vi": "John là quản lý khu vực London."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a room, building or particular space that is used for a special purpose",
                    "vi": "một phần của căn phòng, tòa nhà hoặc không gian cụ thể được sử dụng cho một mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "the hotel reception area",
                        "vi": "khu vực lễ tân khách sạn"
                    },
                    {
                        "en": "a play/parking/dining area",
                        "vi": "một khu vui chơi / bãi đậu xe / ăn uống"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular place on an object",
                    "vi": "một vị trí cụ thể trên một đối tượng"
                },
                "examples": [
                    {
                        "en": "The treatment targets the affected areas of the brain.",
                        "vi": "Việc điều trị nhắm vào các khu vực bị ảnh hưởng của não."
                    },
                    {
                        "en": "The tumour had not spread to other areas of the body.",
                        "vi": "Khối u đã không di căn đến các vùng khác của cơ thể."
                    },
                    {
                        "en": "Move the cursor to a blank area of the computer screen.",
                        "vi": "Di chuyển con trỏ đến vùng trống trên màn hình máy tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular subject or activity, or an aspect of it",
                    "vi": "một chủ đề hoặc hoạt động cụ thể hoặc một khía cạnh của nó"
                },
                "examples": [
                    {
                        "en": "Finance is Mark's area.",
                        "vi": "Tài chính là lĩnh vực của Mark."
                    },
                    {
                        "en": "The course covers two main subject areas.",
                        "vi": "Khóa học bao gồm hai lĩnh vực chủ đề chính."
                    },
                    {
                        "en": "area of something The report focuses on three key areas of concern.",
                        "vi": "lĩnh vực nào đó Báo cáo tập trung vào ba lĩnh vực chính cần quan tâm."
                    },
                    {
                        "en": "That's outside my specific area of expertise.",
                        "vi": "Điều đó nằm ngoài lĩnh vực chuyên môn cụ thể của tôi."
                    },
                    {
                        "en": "area for something We have identified several areas for improvement.",
                        "vi": "lĩnh vực nào đó Chúng tôi đã xác định một số lĩnh vực cần cải thiện."
                    },
                    {
                        "en": "in this area More research is needed in this area.",
                        "vi": "trong lĩnh vực này Cần có nhiều nghiên cứu hơn trong lĩnh vực này."
                    },
                    {
                        "en": "in the area of something to improve skills in the areas of critical thinking and problem-solving",
                        "vi": "trong lĩnh vực nào đó để cải thiện kỹ năng trong các lĩnh vực tư duy phản biện và giải quyết vấn đề"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of space covered by a flat surface or piece of land, described as a measurement",
                    "vi": "khoảng không gian được bao phủ bởi một bề mặt phẳng hoặc một mảnh đất, được mô tả như một phép đo"
                },
                "examples": [
                    {
                        "en": "the area of a triangle",
                        "vi": "diện tích của một tam giác"
                    },
                    {
                        "en": "Measure the surface area.",
                        "vi": "Đo diện tích bề mặt."
                    },
                    {
                        "en": "The estate covers an area of 106 acres.",
                        "vi": "Khu đất có diện tích 106 mẫu Anh."
                    },
                    {
                        "en": "in area The room is 12 square metres in area.",
                        "vi": "trong khu vực Căn phòng có diện tích 12 mét vuông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area in front of the goal. If the defending team breaks the rules within this area, the other team is given a penalty.",
                    "vi": "khu vực phía trước khung thành. Nếu đội phòng thủ vi phạm các quy tắc trong khu vực này, đội kia sẽ được hưởng một quả phạt đền."
                },
                "examples": [
                    {
                        "en": "He shot from just outside the area.",
                        "vi": "Anh ta bắn từ bên ngoài khu vực."
                    }
                ]
            }
        ]
    },
    {
        "id": "84abb52a5f09477ab0311bdddf324710",
        "word": "bench",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bentʃ/",
            "us": "/bentʃ/"
        },
        "nearby": [
            {
                "word": "Ben",
                "pos": ""
            },
            {
                "word": "Ben & Jerry's",
                "pos": ""
            },
            {
                "word": "bench",
                "pos": "noun"
            },
            {
                "word": "benchmark",
                "pos": "noun"
            },
            {
                "word": "benchmark",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long seat for two or more people, usually made of wood",
                    "vi": "một chỗ ngồi dài cho hai người trở lên, thường làm bằng gỗ"
                },
                "examples": [
                    {
                        "en": "a park bench",
                        "vi": "một băng ghế công viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a judge in court or the seat where he/she sits; the position of being a judge or magistrate",
                    "vi": "một thẩm phán tại tòa án hoặc nơi người đó ngồi; vị trí của một thẩm phán hoặc thẩm phán"
                },
                "examples": [
                    {
                        "en": "His lawyer turned to address the bench.",
                        "vi": "Luật sư của anh ta quay sang nói chuyện với băng ghế."
                    },
                    {
                        "en": "She has recently been appointed to the bench.",
                        "vi": "Cô ấy gần đây đã được bổ nhiệm vào băng ghế dự bị."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the British parliament) a seat where a particular group of politicians sit",
                    "vi": "(trong quốc hội Anh) một ghế nơi một nhóm chính trị gia cụ thể ngồi"
                },
                "examples": [
                    {
                        "en": "There was cheering from the Opposition benches.",
                        "vi": "Có sự cổ vũ từ các băng ghế của phe đối lập."
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats where players sit when they are not playing in the game",
                    "vi": "ghế mà người chơi ngồi khi họ không chơi trong trò chơi"
                },
                "examples": [
                    {
                        "en": "the substitutes’ bench",
                        "vi": "băng ghế dự bị của người thay thế"
                    },
                    {
                        "en": "He started the game on the bench but finished as the team’s top scorer.",
                        "vi": "Anh ấy bắt đầu trận đấu trên băng ghế dự bị nhưng đã kết thúc với tư cách là cầu thủ ghi bàn hàng đầu của đội."
                    },
                    {
                        "en": "He's sick of spending every game on the bench.",
                        "vi": "Anh ấy chán ngấy việc ngồi dự bị mỗi trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long heavy table used for doing practical jobs, working with tools, etc.",
                    "vi": "một chiếc bàn dài nặng được sử dụng để làm các công việc thực tế, làm việc với các công cụ, v.v."
                },
                "examples": [
                    {
                        "en": "a carpenter’s bench",
                        "vi": "băng ghế của thợ mộc"
                    }
                ]
            }
        ]
    },
    {
        "id": "9ed69c7a3b244c638f4ef28adaf25f7e",
        "word": "book",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/bʊk/",
            "us": "/bʊk/"
        },
        "nearby": [
            {
                "word": "boohoo",
                "pos": "exclamation"
            },
            {
                "word": "book",
                "pos": "noun"
            },
            {
                "word": "book",
                "pos": "verb"
            },
            {
                "word": "bookable",
                "pos": "adjective"
            },
            {
                "word": "bookbinder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to arrange to have or use something on a particular date in the future; to buy a ticket in advance",
                    "vi": "sắp xếp để có hoặc sử dụng một cái gì đó vào một ngày cụ thể trong tương lai; mua vé trước"
                },
                "examples": [
                    {
                        "en": "Book early to avoid disappointment.",
                        "vi": "Đăng kí sớm để tránh sự thất vọng."
                    },
                    {
                        "en": "book something She booked a flight to Chicago.",
                        "vi": "đặt một cái gì đó Cô ấy đã đặt một chuyến bay đến Chicago."
                    },
                    {
                        "en": "He booked tickets for his trip to New York.",
                        "vi": "Anh ấy đã đặt vé cho chuyến đi của mình đến New York."
                    },
                    {
                        "en": "Most customers now book their holidays online.",
                        "vi": "Hầu hết khách hàng bây giờ đặt ngày nghỉ của họ trực tuyến."
                    },
                    {
                        "en": "The performance is booked up (= there are no more tickets available).",
                        "vi": "Buổi biểu diễn đã được đặt trước (= không còn vé nữa)."
                    },
                    {
                        "en": "I'm sorry—we're fully booked.",
                        "vi": "Tôi xin lỗi — chúng tôi đã đặt hết chỗ."
                    },
                    {
                        "en": "(British English) I'd like to book a table for two for 8 o'clock tonight.",
                        "vi": "(Anh Anh) Tôi muốn đặt bàn cho hai người lúc 8 giờ tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange for somebody to have a seat on a plane, etc.",
                    "vi": "sắp xếp cho ai đó có một chỗ ngồi trên máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "book somebody + adv./prep. I've booked you on the 10 o'clock flight.",
                        "vi": "đặt chỗ cho ai đó + adv./prep. Tôi đã đặt chỗ cho bạn trên chuyến bay 10 giờ."
                    },
                    {
                        "en": "book somebody something + adv./prep. I've booked you a room at the Park Hotel.",
                        "vi": "book somebody something + adv./prep. Tôi đã đặt cho bạn một phòng ở khách sạn Park."
                    },
                    {
                        "en": "book somebody something Have you told the office to book you a flight?",
                        "vi": "đặt cho ai đó một cái gì đó Bạn đã nói với văn phòng để đặt cho bạn một chuyến bay chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange for a singer, etc. to perform on a particular date",
                    "vi": "để sắp xếp cho một ca sĩ, v.v. biểu diễn vào một ngày cụ thể"
                },
                "examples": [
                    {
                        "en": "We've booked a band for the wedding reception.",
                        "vi": "Chúng tôi đã đặt một ban nhạc cho tiệc cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write down somebody’s name and address because they have committed a crime or an offence",
                    "vi": "viết ra tên và địa chỉ của ai đó vì họ đã phạm tội hoặc phạm tội"
                },
                "examples": [
                    {
                        "en": "He was booked for possession of cocaine.",
                        "vi": "Anh ta đã bị buộc tội tàng trữ cocaine."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write down in an official book the name of a player who has broken the rules of the game",
                    "vi": "viết ra trong một cuốn sách chính thức tên của một người chơi đã vi phạm các quy tắc của trò chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7fb0d4e4845f43daaf6079d08d214ca5",
        "word": "booking",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊkɪŋ/",
            "us": "/ˈbʊkɪŋ/"
        },
        "nearby": [
            {
                "word": "bookie",
                "pos": "noun"
            },
            {
                "word": "book in",
                "pos": "phrasal verb"
            },
            {
                "word": "booking",
                "pos": "noun"
            },
            {
                "word": "booking office",
                "pos": "noun"
            },
            {
                "word": "book into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that you make in advance to buy a ticket to travel somewhere, go to the theatre, etc.",
                    "vi": "một sự sắp xếp mà bạn thực hiện trước để mua vé đi du lịch đâu đó, đi xem phim, v.v."
                },
                "examples": [
                    {
                        "en": "a booking form/hall/clerk",
                        "vi": "một biểu mẫu đặt phòng / hội trường / thư ký"
                    },
                    {
                        "en": "Can I make a booking for Friday?",
                        "vi": "Tôi có thể đặt chỗ cho thứ Sáu không?"
                    },
                    {
                        "en": "Early booking is recommended.",
                        "vi": "Nên đặt chỗ sớm."
                    },
                    {
                        "en": "No advance booking is necessary.",
                        "vi": "Không cần đặt trước."
                    },
                    {
                        "en": "We can't take any more bookings.",
                        "vi": "Chúng tôi không thể nhận thêm bất kỳ đơn đặt hàng nào nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement for somebody to perform at a theatre, in a concert, etc.",
                    "vi": "sắp xếp để ai đó biểu diễn tại nhà hát, trong một buổi hòa nhạc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of the referee writing a player’s name in a book, as a punishment because an offence has been committed",
                    "vi": "hành động của trọng tài ghi tên cầu thủ vào sách, như một hình phạt vì một hành vi phạm tội đã được thực hiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41137b5e59ec4681b615017bda7225bf",
        "word": "dive",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/daɪv/",
            "us": "/daɪv/"
        },
        "nearby": [
            {
                "word": "Divali",
                "pos": "noun"
            },
            {
                "word": "divan",
                "pos": "noun"
            },
            {
                "word": "dive",
                "pos": "verb"
            },
            {
                "word": "dive",
                "pos": "noun"
            },
            {
                "word": "dive-bomb",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to jump into water with your head and arms going in first",
                    "vi": "nhảy xuống nước với đầu và cánh tay của bạn đi vào đầu tiên"
                },
                "examples": [
                    {
                        "en": "dive (from/off something) (into something) We dived into the river to cool off.",
                        "vi": "lặn (từ / tắt cái gì đó) (vào cái gì đó) Chúng tôi lặn xuống sông để tắm mát."
                    },
                    {
                        "en": "dive off something He dived off the bridge.",
                        "vi": "lặn khỏi cái gì đó Anh ấy đã lặn khỏi cây cầu."
                    },
                    {
                        "en": "dive in Sam walked to the deep end of the pool and dived in.",
                        "vi": "lặn trong Sam đi bộ đến cuối vực sâu và lặn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to swim underwater wearing breathing equipment, collecting or looking at things",
                    "vi": "bơi dưới nước đeo thiết bị thở, thu thập hoặc nhìn mọi thứ"
                },
                "examples": [
                    {
                        "en": "to dive for pearls",
                        "vi": "lặn tìm ngọc trai"
                    },
                    {
                        "en": "The main purpose of his holiday to Greece was to go diving.",
                        "vi": "Mục đích chính trong kỳ nghỉ của anh đến Hy Lạp là để đi lặn biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a deeper level underwater",
                    "vi": "để đi đến một tầng sâu hơn dưới nước"
                },
                "examples": [
                    {
                        "en": "The submarine dived to avoid being seen.",
                        "vi": "Chiếc tàu ngầm lặn xuống để tránh bị nhìn thấy."
                    },
                    {
                        "en": "The whale dived as the harpoon struck it.",
                        "vi": "Con cá voi lao xuống khi chiếc lao đâm vào nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go steeply down through the air",
                    "vi": "đi xuống dốc trong không khí"
                },
                "examples": [
                    {
                        "en": "The seagulls soared then dived.",
                        "vi": "Những con hải âu bay vút lên rồi lặn xuống."
                    },
                    {
                        "en": "The plane dived down to attack.",
                        "vi": "Máy bay lao xuống tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or jump quickly in a particular direction, especially to avoid something, to try to catch a ball, etc.",
                    "vi": "để di chuyển hoặc nhảy nhanh theo một hướng cụ thể, đặc biệt là để tránh thứ gì đó, cố gắng bắt bóng, v.v."
                },
                "examples": [
                    {
                        "en": "dive for something We heard an explosion and dived for cover (= got into a place where we would be protected).",
                        "vi": "lặn tìm thứ gì đó Chúng tôi nghe thấy một tiếng nổ và lặn tìm chỗ ẩn nấp (= vào một nơi mà chúng tôi sẽ được bảo vệ)."
                    },
                    {
                        "en": "The goalie dived for the ball, but missed it.",
                        "vi": "Thủ môn đã lao xuống tìm bóng nhưng lại trượt."
                    },
                    {
                        "en": "+ adv./prep. It started to rain so we dived into the nearest cafe.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "He dived headlong into the ditch.",
                        "vi": "Anh ta lao thẳng xuống mương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall deliberately when somebody tackles you",
                    "vi": "cố tình ngã khi ai đó xử lý bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall suddenly",
                    "vi": "đột ngột rơi"
                },
                "examples": [
                    {
                        "en": "The share price dived from 75p to an all-time low of 50p.",
                        "vi": "Giá cổ phiếu giảm từ 75p xuống mức thấp nhất mọi thời đại là 50p."
                    }
                ]
            }
        ]
    },
    {
        "id": "c8cac822e0444719997c375009af8ffc",
        "word": "five-a-side",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌfaɪv ə ˈsaɪd/",
            "us": "/ˌfaɪv ə ˈsaɪd/"
        },
        "nearby": [
            {
                "word": "five",
                "pos": "number"
            },
            {
                "word": "five-and-dime",
                "pos": "noun"
            },
            {
                "word": "five-a-side",
                "pos": "noun"
            },
            {
                "word": "the Five Civilized Tribes",
                "pos": ""
            },
            {
                "word": "fivefold",
                "pos": "adjective, adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game of football (soccer) played indoors with five players on each team",
                    "vi": "một trò chơi bóng đá (bóng đá) chơi trong nhà với năm cầu thủ mỗi đội"
                },
                "examples": [
                    {
                        "en": "a five-a-side tournament",
                        "vi": "một giải đấu năm bên"
                    }
                ]
            }
        ]
    },
    {
        "id": "1c536b11564442d0b402098b4afae79b",
        "word": "header",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhedə(r)/",
            "us": "/ˈhedər/"
        },
        "nearby": [
            {
                "word": "headdress",
                "pos": "noun"
            },
            {
                "word": "headed",
                "pos": "adjective"
            },
            {
                "word": "header",
                "pos": "noun"
            },
            {
                "word": "headgear",
                "pos": "noun"
            },
            {
                "word": "head girl",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of hitting the ball with your head",
                    "vi": "một hành động đánh bóng bằng đầu của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a line or block of text that appears at the top of every page in a book or document",
                    "vi": "một dòng hoặc một khối văn bản xuất hiện ở đầu mỗi trang trong một cuốn sách hoặc tài liệu"
                },
                "examples": [
                    {
                        "en": "The header gives the page number and date of the document.",
                        "vi": "Tiêu đề cho biết số trang và ngày tháng của tài liệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba72d3224f374fb0861e1ba4784514c6",
        "word": "midfield",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɪdfiːld/",
            "us": "/ˈmɪdfiːld/"
        },
        "nearby": [
            {
                "word": "the Middle West",
                "pos": "noun"
            },
            {
                "word": "middling",
                "pos": "adjective"
            },
            {
                "word": "midfield",
                "pos": "noun"
            },
            {
                "word": "midfielder",
                "pos": "noun"
            },
            {
                "word": "midge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the central part of a sports field; the group of players in this position",
                    "vi": "phần trung tâm của sân thể thao; nhóm người chơi ở vị trí này"
                },
                "examples": [
                    {
                        "en": "(in) midfield He plays (in) midfield.",
                        "vi": "(ở) hàng tiền vệ Anh ấy chơi (ở) hàng tiền vệ."
                    },
                    {
                        "en": "The team's midfield looks strong.",
                        "vi": "Hàng tiền vệ của đội có vẻ mạnh mẽ."
                    },
                    {
                        "en": "a midfield player",
                        "vi": "một cầu thủ tiền vệ"
                    }
                ]
            }
        ]
    },
    {
        "id": "fde638d84f3241668d1a033c50379e84",
        "word": "penalty",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpenəlti/",
            "us": "/ˈpenəlti/"
        },
        "nearby": [
            {
                "word": "penal code",
                "pos": "noun"
            },
            {
                "word": "penalize",
                "pos": "verb"
            },
            {
                "word": "penalty",
                "pos": "noun"
            },
            {
                "word": "penalty area",
                "pos": "noun"
            },
            {
                "word": "penalty box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a punishment for breaking a law, rule or contract",
                    "vi": "hình phạt nếu vi phạm luật, quy tắc hoặc hợp đồng"
                },
                "examples": [
                    {
                        "en": "to impose a penalty",
                        "vi": "áp dụng một hình phạt"
                    },
                    {
                        "en": "Assault carries a maximum penalty of seven years' imprisonment.",
                        "vi": "Hành hung bị phạt tù cao nhất là bảy năm."
                    },
                    {
                        "en": "penalty for (doing) something The penalty for travelling without a ticket is £200.",
                        "vi": "hình phạt cho (làm) điều gì đó. Hình phạt cho việc đi du lịch không có vé là £ 200."
                    },
                    {
                        "en": "Contractors who fall behind schedule incur heavy financial penalties.",
                        "vi": "Các nhà thầu chậm tiến độ sẽ bị phạt nặng về tài chính."
                    },
                    {
                        "en": "Harsher penalties are being imposed for crimes involving firearms.",
                        "vi": "Các hình phạt khắc nghiệt hơn đang được áp dụng cho các tội danh liên quan đến súng."
                    },
                    {
                        "en": "a penalty clause in a contract",
                        "vi": "một điều khoản phạt trong hợp đồng"
                    },
                    {
                        "en": "without penalty You can withdraw money from the account at any time without penalty.",
                        "vi": "không bị phạt Bạn có thể rút tiền từ tài khoản bất cứ lúc nào mà không bị phạt."
                    },
                    {
                        "en": "on penalty of something The Romans prohibited the teaching of the Torah on penalty of death.",
                        "vi": "về hình phạt của một cái gì đó Người La Mã cấm giảng dạy Kinh Torah về hình phạt tử hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disadvantage suffered as a result of something",
                    "vi": "một thiệt thòi phải chịu do hậu quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "One of the penalties of fame is loss of privacy.",
                        "vi": "Một trong những hình phạt của sự nổi tiếng là mất quyền riêng tư."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disadvantage given to a player or a team when they break a rule",
                    "vi": "một bất lợi cho người chơi hoặc một đội khi họ vi phạm quy tắc"
                },
                "examples": [
                    {
                        "en": "He incurred a ten-second penalty in the first round.",
                        "vi": "Anh ta đã phải chịu một quả phạt đền mười giây trong hiệp đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chance to score a goal or point without any defending players, except the goalkeeper, trying to stop it; the goal or point that is given if it is successful. This chance is given because the other team has broken the rules.",
                    "vi": "cơ hội ghi bàn hoặc dứt điểm mà không có cầu thủ phòng ngự nào, ngoại trừ thủ môn, cố gắng cản phá; mục tiêu hoặc điểm được đưa ra nếu nó thành công. Cơ hội này được trao vì đội khác đã phạm luật."
                },
                "examples": [
                    {
                        "en": "Two minutes later Ford equalized with a penalty.",
                        "vi": "Hai phút sau, Ford gỡ hòa bằng một quả phạt đền."
                    },
                    {
                        "en": "We were awarded a penalty after a late tackle.",
                        "vi": "Chúng tôi đã được hưởng một quả phạt đền sau một pha bóng muộn."
                    },
                    {
                        "en": "I volunteered to take the penalty (= be the person who tries to score the goal/point)",
                        "vi": "Tôi tình nguyện thực hiện hình phạt (= là người cố gắng ghi bàn thắng / điểm)"
                    },
                    {
                        "en": "He missed a penalty in the last minute of the game.",
                        "vi": "Anh ấy đã bỏ lỡ một quả phạt đền ở phút cuối cùng của trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suffer because of bad luck, a mistake or something you have done",
                    "vi": "đau khổ vì không may mắn, một sai lầm hoặc điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "He looked terrible this morning. I think he's paying the penalty for all those late nights.",
                        "vi": "Anh ấy trông thật kinh khủng vào sáng nay. Tôi nghĩ anh ta phải trả giá phạt cho tất cả những đêm muộn đó."
                    },
                    {
                        "en": "They're now paying the price for past mistakes.",
                        "vi": "Giờ đây, họ đang phải trả giá cho những sai lầm trong quá khứ."
                    },
                    {
                        "en": "She thinks that any inconvenience is a price worth paying for living in such a beautiful place.",
                        "vi": "Cô cho rằng bất kỳ sự bất tiện nào cũng là cái giá phải trả khi sống ở một nơi đẹp đẽ như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "899efd4ead074e279f6691b409ff89e5",
        "word": "penalty area",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpenəlti eəriə/",
            "us": "/ˈpenəlti eriə/"
        },
        "nearby": [
            {
                "word": "penalize",
                "pos": "verb"
            },
            {
                "word": "penalty",
                "pos": "noun"
            },
            {
                "word": "penalty area",
                "pos": "noun"
            },
            {
                "word": "penalty box",
                "pos": "noun"
            },
            {
                "word": "penalty kick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area in front of the goal. If the defending team breaks the rules within this area, the other team is given a penalty.",
                    "vi": "khu vực phía trước khung thành. Nếu đội phòng thủ vi phạm các quy tắc trong khu vực này, đội kia sẽ được hưởng một quả phạt đền."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f36c7c6e520346d696677ffe0f7c06f8",
        "word": "penalty kick",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpenəlti kɪk/",
            "us": "/ˈpenəlti kɪk/"
        },
        "nearby": [
            {
                "word": "penalty area",
                "pos": "noun"
            },
            {
                "word": "penalty box",
                "pos": "noun"
            },
            {
                "word": "penalty kick",
                "pos": "noun"
            },
            {
                "word": "penalty point",
                "pos": "noun"
            },
            {
                "word": "penalty shoot-out",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kick that is taken as a penalty in the game of football (soccer)",
                    "vi": "một cú đá được thực hiện như một quả phạt đền trong trò chơi bóng đá (bóng đá)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "39f8df75d6694349a7492fc628def783",
        "word": "penalty shoot-out",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpenəlti ˈʃuːt aʊt/",
            "us": "/ˌpenəlti ˈʃuːt aʊt/"
        },
        "nearby": [
            {
                "word": "penalty kick",
                "pos": "noun"
            },
            {
                "word": "penalty point",
                "pos": "noun"
            },
            {
                "word": "penalty shoot-out",
                "pos": "noun"
            },
            {
                "word": "penalty spot",
                "pos": "noun"
            },
            {
                "word": "penance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of deciding the winner when both teams have the same score at the end of a game. Each team is given a number of chances to kick the ball into the goal and the team that scores the most goals wins.",
                    "vi": "một cách phân định thắng thua khi cả hai đội có cùng số điểm khi kết thúc trò chơi. Mỗi đội được tạo một số cơ hội để sút bóng vào khung thành và đội nào ghi được nhiều bàn thắng nhất sẽ thắng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "033bec8329af450c8f7ee930e321cd99",
        "word": "red card",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌred ˈkɑːd/",
            "us": "/ˌred ˈkɑːrd/"
        },
        "nearby": [
            {
                "word": "redbush",
                "pos": "noun"
            },
            {
                "word": "redcap",
                "pos": "noun"
            },
            {
                "word": "red card",
                "pos": "noun"
            },
            {
                "word": "red carpet",
                "pos": "noun"
            },
            {
                "word": "red cell",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a card shown by the referee to a player who has broken the rules of the game and is not allowed to play for the rest of the game",
                    "vi": "một thẻ được trọng tài đưa ra cho một người chơi đã vi phạm luật của trò chơi và không được phép chơi trong phần còn lại của trò chơi"
                },
                "examples": [
                    {
                        "en": "He received a red card for a foul on the goalkeeper.",
                        "vi": "Anh nhận thẻ đỏ vì phạm lỗi với thủ môn."
                    },
                    {
                        "en": "The referee showed her the red card.",
                        "vi": "Trọng tài đã rút thẻ đỏ cho cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "b729de2958cc4fb28d800f50e08457a7",
        "word": "tie",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/taɪ/",
            "us": "/taɪ/"
        },
        "nearby": [
            {
                "word": "tidy up",
                "pos": "phrasal verb"
            },
            {
                "word": "tie",
                "pos": "verb"
            },
            {
                "word": "tie",
                "pos": "noun"
            },
            {
                "word": "tiebreak",
                "pos": "noun"
            },
            {
                "word": "tiebreaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, narrow piece of cloth worn around the neck, especially by men, with a knot in front",
                    "vi": "một mảnh vải dài và hẹp đeo quanh cổ, đặc biệt là của nam giới, với một nút ở phía trước"
                },
                "examples": [
                    {
                        "en": "He was dressed impeccably in a suit and tie.",
                        "vi": "Anh ta ăn mặc hoàn hảo trong bộ vest và thắt cà vạt."
                    },
                    {
                        "en": "They prefer their employees to wear a shirt and tie.",
                        "vi": "Họ thích nhân viên của mình mặc áo sơ mi và thắt cà vạt."
                    },
                    {
                        "en": "a striped silk tie",
                        "vi": "cà vạt lụa sọc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of string or wire used for fastening or tying something",
                    "vi": "một đoạn dây hoặc dây được sử dụng để buộc hoặc buộc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "ties for closing plastic bags",
                        "vi": "dây buộc để đóng túi nhựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong connection between people or organizations",
                    "vi": "một kết nối mạnh mẽ giữa mọi người hoặc tổ chức"
                },
                "examples": [
                    {
                        "en": "family ties",
                        "vi": "quan hệ gia đình"
                    },
                    {
                        "en": "diplomatic/economic/bilateral ties",
                        "vi": "quan hệ ngoại giao / kinh tế / song phương"
                    },
                    {
                        "en": "emotional ties",
                        "vi": "quan hệ tình cảm"
                    },
                    {
                        "en": "the ties of friendship",
                        "vi": "mối quan hệ của tình bạn"
                    },
                    {
                        "en": "tie with somebody/something The firm has close ties with an American corporation.",
                        "vi": "tie with somebody / something Công ty có quan hệ chặt chẽ với một tập đoàn của Mỹ."
                    },
                    {
                        "en": "Although he was raised as a Roman Catholic, he has cut his ties with the Church.",
                        "vi": "Mặc dù lớn lên như một người Công giáo La Mã, nhưng ông đã cắt đứt quan hệ của mình với Giáo hội."
                    },
                    {
                        "en": "tie between somebody/something There is a strong tie between her and her daughters.",
                        "vi": "ràng buộc giữa ai đó / cái gì đó Có một sự ràng buộc chặt chẽ giữa cô ấy và các con gái của cô ấy."
                    },
                    {
                        "en": "Ties between the two countries remain very strong.",
                        "vi": "Mối quan hệ giữa hai nước vẫn rất bền chặt."
                    },
                    {
                        "en": "tie to somebody/something giant corporations with close ties to the administration",
                        "vi": "ràng buộc với ai đó / cái gì đó các tập đoàn khổng lồ có quan hệ chặt chẽ với chính quyền"
                    },
                    {
                        "en": "Both sides agreed to strengthen political ties.",
                        "vi": "Cả hai bên nhất trí tăng cường quan hệ chính trị."
                    },
                    {
                        "en": "They severed ties after a dispute.",
                        "vi": "Họ cắt đứt quan hệ sau một cuộc tranh cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that limits somebody’s freedom of action",
                    "vi": "một thứ hạn chế quyền tự do hành động của ai đó"
                },
                "examples": [
                    {
                        "en": "He was still a young man and he did not want any ties.",
                        "vi": "Anh vẫn còn trẻ và anh không muốn có bất kỳ ràng buộc nào."
                    },
                    {
                        "en": "They have broken the ties that bound them.",
                        "vi": "Họ đã phá vỡ những sợi dây ràng buộc họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in a game or competition when two or more players have the same score",
                    "vi": "một tình huống trong trò chơi hoặc cuộc thi khi hai hoặc nhiều người chơi có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "The match ended in a tie.",
                        "vi": "Trận đấu kết thúc với tỷ số hòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sports match, especially a football (soccer) match, that is part of a larger competition",
                    "vi": "một trận đấu thể thao, đặc biệt là một trận bóng đá (bóng đá), là một phần của một cuộc thi lớn hơn"
                },
                "examples": [
                    {
                        "en": "the first leg of the tie between Leeds and Roma",
                        "vi": "trận lượt đi giữa Leeds và Roma"
                    },
                    {
                        "en": "They have a second round tie away to Ipswich Town.",
                        "vi": "Họ có trận hòa thứ hai trên sân khách trước Ipswich Town."
                    }
                ]
            },
            {
                "define": {
                    "en": "a curved line written over two notes of the same pitch (= how high or low a note is) to show that they are to be played or sung as one note",
                    "vi": "một đường cong được viết trên hai nốt nhạc có cùng cao độ (= mức độ cao hoặc thấp của một nốt nhạc) để thể hiện rằng chúng sẽ được chơi hoặc hát như một nốt nhạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the heavy pieces of wood or concrete on which the rails (= metal bars) on a railway track are laid",
                    "vi": "một trong những miếng gỗ hoặc bê tông nặng trên đó đặt đường ray (= thanh kim loại) trên đường ray"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47ce0d656246461db9816144b42bbbbb",
        "word": "transfer",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/trænsˈfɜː(r)/",
            "us": "/trænsˈfɜːr/"
        },
        "nearby": [
            {
                "word": "transexual",
                "pos": "noun"
            },
            {
                "word": "trans-fatty acid",
                "pos": "noun"
            },
            {
                "word": "transfer",
                "pos": "verb"
            },
            {
                "word": "transfer",
                "pos": "noun"
            },
            {
                "word": "transferability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move from one place to another; to move something/somebody from one place to another",
                    "vi": "để di chuyển từ nơi này đến nơi khác; để di chuyển một cái gì đó / ai đó từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "transfer (to something) The film studio is transferring to Hollywood.",
                        "vi": "transfer (to something) Xưởng phim đang chuyển đến Hollywood."
                    },
                    {
                        "en": "(especially North American English) If I spend a semester in Madrid, will my credits transfer?",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) Nếu tôi dành một học kỳ ở Madrid, các khoản tín chỉ của tôi có được chuyển không?"
                    },
                    {
                        "en": "transfer from something to something The system only allows air to go one way, preventing air from transferring from one tire to another.",
                        "vi": "chuyển từ vật này sang lốp khác Hệ thống chỉ cho phép không khí đi theo một chiều, ngăn không khí truyền từ lốp này sang lốp khác."
                    },
                    {
                        "en": "transfer something/somebody from something to something How can I transfer money from my bank account to his?",
                        "vi": "chuyển cái gì đó / ai đó từ cái gì sang cái gì đó Làm cách nào để chuyển tiền từ tài khoản ngân hàng của tôi sang tài khoản của anh ấy?"
                    },
                    {
                        "en": "transfer something/somebody to something The patient was transferred to another hospital.",
                        "vi": "chuyển cái gì đó / ai đó sang cái gì đó Bệnh nhân đã được chuyển đến bệnh viện khác."
                    },
                    {
                        "en": "transfer something/somebody from something (especially North American English) I couldn't transfer all my credits from junior college.",
                        "vi": "chuyển một cái gì đó / ai đó từ một cái gì đó (đặc biệt là tiếng Anh Bắc Mỹ) Tôi không thể chuyển tất cả các tín chỉ của mình từ trường đại học cơ sở."
                    },
                    {
                        "en": "transfer something Assets can be transferred overseas.",
                        "vi": "chuyển một cái gì đó Tài sản có thể được chuyển ra nước ngoài."
                    },
                    {
                        "en": "transfer something into/onto something She transferred the sauce into a china jug.",
                        "vi": "chuyển thứ gì đó vào / lên thứ gì đó Cô ấy đã chuyển nước sốt vào một cái bình sành sứ."
                    },
                    {
                        "en": "transfer something between A and B The honeybee transfers pollen between flowers.",
                        "vi": "chuyển một cái gì đó giữa A và B Con ong mật chuyển phấn hoa giữa các bông hoa."
                    },
                    {
                        "en": "Customers still can't easily transfer money between accounts.",
                        "vi": "Khách hàng vẫn không thể dễ dàng chuyển tiền giữa các tài khoản."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move from one job, school, situation, etc. to another; to arrange for somebody to move",
                    "vi": "để chuyển từ công việc, trường học, hoàn cảnh này sang công việc khác; sắp xếp cho ai đó di chuyển"
                },
                "examples": [
                    {
                        "en": "transfer to something Children usually transfer to secondary school at 11 or 12.",
                        "vi": "chuyển sang thứ gì đó Trẻ em thường chuyển đến trường cấp hai lúc 11 hoặc 12."
                    },
                    {
                        "en": "transfer from something This is her first season in the Ohio State team after transferring from Tennessee.",
                        "vi": "chuyển từ một cái gì đó Đây là mùa giải đầu tiên của cô ấy trong đội Ohio State sau khi chuyển từ Tennessee."
                    },
                    {
                        "en": "transfer from something to something Students can transfer from a community college to a university.",
                        "vi": "chuyển từ thứ gì đó sang thứ gì đó Học sinh có thể chuyển từ trường cao đẳng cộng đồng sang trường đại học."
                    },
                    {
                        "en": "He transferred to UCLA after his freshman year.",
                        "vi": "Anh ấy chuyển đến UCLA sau năm thứ nhất của mình."
                    },
                    {
                        "en": "transfer somebody from something Ten employees are being transferred from the sales department.",
                        "vi": "thuyên chuyển ai đó từ một cái gì đó Mười nhân viên đang được chuyển từ bộ phận bán hàng."
                    },
                    {
                        "en": "transfer somebody to something His superiors transferred him to easier assignments.",
                        "vi": "thuyên chuyển ai đó sang việc gì đó Cấp trên của anh ấy đã chuyển anh ấy sang những nhiệm vụ dễ dàng hơn."
                    },
                    {
                        "en": "transfer somebody from something to something She was promoted and transferred from the department of law to the Institute of Legal Studies.",
                        "vi": "thuyên chuyển ai đó từ cái gì đó sang cái gì đó Cô ấy được thăng chức và chuyển từ khoa luật sang Viện nghiên cứu pháp lý."
                    },
                    {
                        "en": "transfer somebody 98 percent of our patients are admitted, transferred, or discharged within four hours.",
                        "vi": "chuyển ai đó 98 phần trăm bệnh nhân của chúng tôi được nhận, chuyển viện hoặc xuất viện trong vòng bốn giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change to a different vehicle during a journey; to arrange for somebody to change to a different vehicle during a journey",
                    "vi": "đổi sang một phương tiện khác trong hành trình; sắp xếp để ai đó đổi sang một phương tiện khác trong một cuộc hành trình"
                },
                "examples": [
                    {
                        "en": "transfer from something to something It was a relief, after transferring from ship to ship, to just sit and relax.",
                        "vi": "chuyển từ thứ gì đó sang thứ gì đó Thật nhẹ nhõm, sau khi chuyển từ tàu này sang tàu khác, chỉ cần ngồi và thư giãn."
                    },
                    {
                        "en": "I transferred at Bahrain for a flight to Singapore.",
                        "vi": "Tôi chuyển đến Bahrain để đáp chuyến bay đến Singapore."
                    },
                    {
                        "en": "transfer somebody from something to something Passengers are transferred from the airport to the hotel by taxi.",
                        "vi": "chuyển ai đó từ thứ gì đó sang thứ gì đó Hành khách được chuyển từ sân bay đến khách sạn bằng taxi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy information, music, an idea, etc. from one method of recording or presenting it to another; to be recorded or presented in a different way",
                    "vi": "sao chép thông tin, âm nhạc, một ý tưởng, v.v. từ một phương pháp ghi hoặc trình bày nó sang một phương pháp khác; được ghi lại hoặc trình bày theo một cách khác"
                },
                "examples": [
                    {
                        "en": "transfer something to something You can transfer data to a memory stick in a few seconds.",
                        "vi": "chuyển thứ gì đó sang thứ gì đó Bạn có thể chuyển dữ liệu vào thẻ nhớ trong vài giây."
                    },
                    {
                        "en": "transfer something Data is easily transferred electronically.",
                        "vi": "chuyển một cái gì đó Dữ liệu có thể dễ dàng chuyển qua điện tử."
                    },
                    {
                        "en": "transfer something from something (to something) You can transfer songs from your computer to a phone.",
                        "vi": "chuyển một cái gì đó từ cái gì đó (sang cái gì đó) Bạn có thể chuyển bài hát từ máy tính sang điện thoại."
                    },
                    {
                        "en": "transfer to something The novel does not transfer well to the movies.",
                        "vi": "chuyển giao cho một cái gì đó Cuốn tiểu thuyết không chuyển giao tốt cho các bộ phim."
                    },
                    {
                        "en": "An audio file should transfer in a matter of minutes.",
                        "vi": "Tệp âm thanh sẽ được chuyển trong vài phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you transfer a feeling, a disease, or power, etc. from one person to another, the second person has it, often instead of the first",
                    "vi": "nếu bạn chuyển một cảm giác, một căn bệnh hoặc sức mạnh, v.v. từ người này sang người khác, thì người thứ hai có nó, thường thay vì người thứ nhất"
                },
                "examples": [
                    {
                        "en": "Joe had already transferred his affections from Lisa to Cleo.",
                        "vi": "Joe đã chuyển tình cảm của mình từ Lisa sang Cleo."
                    },
                    {
                        "en": "I decided to transfer my loyalty to my local team.",
                        "vi": "Tôi quyết định chuyển sự trung thành của mình cho đội bóng địa phương của mình."
                    },
                    {
                        "en": "This disease is sometimes transferred from mother to baby (= so that the baby has it as well as the mother).",
                        "vi": "Bệnh này đôi khi được truyền từ mẹ sang con (= để đứa trẻ mắc bệnh cũng như người mẹ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially arrange for something to belong to somebody else or for somebody else to control something",
                    "vi": "chính thức sắp xếp để thứ gì đó thuộc về người khác hoặc để người khác kiểm soát thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He transferred the property to his son.",
                        "vi": "Ông đã chuyển tài sản cho con trai mình."
                    },
                    {
                        "en": "Sovereignty was formally transferred on December 27.",
                        "vi": "Chủ quyền được chính thức chuyển giao vào ngày 27 tháng 12."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, or to move somebody, to a different sports team, especially a professional football (soccer) team",
                    "vi": "để di chuyển hoặc chuyển ai đó sang một đội thể thao khác, đặc biệt là đội bóng đá (bóng đá) chuyên nghiệp"
                },
                "examples": [
                    {
                        "en": "transfer (from…) (to…) He transferred to Everton for £60 million.",
                        "vi": "chuyển (từ…) (đến…) Anh ấy chuyển đến Everton với giá 60 triệu bảng."
                    },
                    {
                        "en": "transfer somebody (from…) (to…) He was transferred from Spurs to Arsenal for a huge fee.",
                        "vi": "chuyển ai đó (từ…) (đến…) Anh ấy đã được chuyển từ Spurs sang Arsenal với một khoản phí rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send a phone call that you have received to another phone number",
                    "vi": "để gửi một cuộc gọi điện thoại mà bạn đã nhận được đến một số điện thoại khác"
                },
                "examples": [
                    {
                        "en": "I'll just transfer you to customer service.",
                        "vi": "Tôi sẽ chuyển bạn sang dịch vụ khách hàng."
                    },
                    {
                        "en": "Customers are able to transfer calls from their landline to their mobile.",
                        "vi": "Khách hàng có thể chuyển cuộc gọi từ điện thoại cố định sang điện thoại di động của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "f88ce5c26abd411ab5bcb9d042a31640",
        "word": "transfer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtrænsfɜː(r)/",
            "us": "/ˈtrænsfɜːr/"
        },
        "nearby": [
            {
                "word": "trans-fatty acid",
                "pos": "noun"
            },
            {
                "word": "transfer",
                "pos": "verb"
            },
            {
                "word": "transfer",
                "pos": "noun"
            },
            {
                "word": "transferability",
                "pos": "noun"
            },
            {
                "word": "transferable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of moving somebody/something from one place, group or job to another; an occasion when this happens",
                    "vi": "hành động di chuyển ai đó / cái gì đó từ nơi này, nhóm hoặc công việc sang nơi khác; một dịp khi điều này xảy ra"
                },
                "examples": [
                    {
                        "en": "electronic data transfer",
                        "vi": "chuyển dữ liệu điện tử"
                    },
                    {
                        "en": "transfer of something After the election there was a swift transfer of power.",
                        "vi": "chuyển giao một cái gì đó Sau cuộc bầu cử, đã có một cuộc chuyển giao quyền lực nhanh chóng."
                    },
                    {
                        "en": "transfer to something He has asked for a transfer to the company's Paris branch.",
                        "vi": "chuyển đến một cái gì đó Anh ấy đã yêu cầu chuyển đến chi nhánh Paris của công ty."
                    },
                    {
                        "en": "transfer of something from something to something the transfer of currency from one country to another",
                        "vi": "chuyển thứ gì đó từ thứ gì đó sang thứ gì đó chuyển tiền từ nước này sang nước khác"
                    },
                    {
                        "en": "transfer from something to something I asked for a transfer from my company to one of their California offices.",
                        "vi": "chuyển từ một cái gì đó sang một cái gì đó mà tôi đã yêu cầu chuyển từ công ty của tôi đến một trong những văn phòng ở California của họ."
                    },
                    {
                        "en": "I did a file transfer from one PC to another.",
                        "vi": "Tôi đã thực hiện chuyển tệp từ PC này sang PC khác."
                    },
                    {
                        "en": "transfer (of something) between somebody/something the transfer of property between private buyers",
                        "vi": "chuyển nhượng (của cái gì đó) giữa ai đó / cái gì đó việc chuyển giao tài sản giữa những người mua tư nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of changing to a different place, vehicle or route when you are travelling",
                    "vi": "hành động thay đổi địa điểm, phương tiện hoặc tuyến đường khác khi bạn đang đi du lịch"
                },
                "examples": [
                    {
                        "en": "The transfer from the airport to the hotel is included in the price.",
                        "vi": "Dịch vụ đưa đón từ sân bay đến khách sạn đã được bao gồm trong giá."
                    },
                    {
                        "en": "The hotel can arrange airport transfers.",
                        "vi": "Khách sạn có thể sắp xếp dịch vụ đưa đón sân bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ticket that allows a passenger to continue their journey on another bus or train",
                    "vi": "một vé cho phép hành khách tiếp tục hành trình của họ trên một chuyến xe buýt hoặc xe lửa khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the act of moving a sports player from one club or team to another",
                    "vi": "hành động di chuyển một cầu thủ thể thao từ câu lạc bộ hoặc đội bóng này sang câu lạc bộ hoặc đội khác"
                },
                "examples": [
                    {
                        "en": "It was the first goal he had scored since his transfer from Chelsea.",
                        "vi": "Đó là bàn thắng đầu tiên anh ghi được kể từ khi chuyển đến từ Chelsea."
                    },
                    {
                        "en": "His club have given him a free transfer.",
                        "vi": "Câu lạc bộ của anh ấy đã chuyển nhượng miễn phí cho anh ấy."
                    },
                    {
                        "en": "a transfer fee",
                        "vi": "phí chuyển tiền"
                    },
                    {
                        "en": "to be on the transfer list (= available to join another club)",
                        "vi": "có tên trong danh sách chuyển nhượng (= có thể tham gia câu lạc bộ khác)"
                    },
                    {
                        "en": "the January transfer window (= a period in the year when transfers can take place)",
                        "vi": "thời hạn chuyển nhượng tháng Giêng (= khoảng thời gian trong năm mà việc chuyển nhượng có thể diễn ra)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture or design that can be removed from a piece of paper and stuck onto a surface, for example by being pressed or heated",
                    "vi": "một hình ảnh hoặc thiết kế có thể được lấy ra khỏi mảnh giấy và dán lên một bề mặt, chẳng hạn như bằng cách ép hoặc làm nóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the process of using behaviour that has already been learnt in one situation in a new situation",
                    "vi": "quá trình sử dụng hành vi đã được học trong một tình huống trong một tình huống mới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23d5d3ecc4ae4c09b1ee96c728233e6a",
        "word": "yellow card",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌjeləʊ ˈkɑːd/",
            "us": "/ˌjeləʊ ˈkɑːrd/"
        },
        "nearby": [
            {
                "word": "yellow-belly",
                "pos": "noun"
            },
            {
                "word": "the Yellow Brick Road",
                "pos": ""
            },
            {
                "word": "yellow card",
                "pos": "noun"
            },
            {
                "word": "yellow fever",
                "pos": "noun"
            },
            {
                "word": "yellowfin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a card shown by the referee to a player as a warning about bad behaviour",
                    "vi": "một thẻ được trọng tài đưa ra cho một cầu thủ như một lời cảnh báo về hành vi xấu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9fbedf5908a04b9899b0d17e805cc14f",
        "word": "assist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsɪst/",
            "us": "/əˈsɪst/"
        },
        "nearby": [
            {
                "word": "assimilation",
                "pos": "noun"
            },
            {
                "word": "assist",
                "pos": "verb"
            },
            {
                "word": "assist",
                "pos": "noun"
            },
            {
                "word": "assistance",
                "pos": "noun"
            },
            {
                "word": "assistance dog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action in ice hockey, football (soccer), etc. in which a player passes the ball in a way that helps another player on the same team to score a goal",
                    "vi": "một hành động trong khúc côn cầu trên băng, bóng đá (bóng đá), v.v. trong đó một cầu thủ chuyền bóng theo cách giúp một cầu thủ khác trong cùng đội ghi bàn"
                },
                "examples": [
                    {
                        "en": "He had/made ten assists.",
                        "vi": "Anh ấy đã / thực hiện mười pha kiến tạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action in baseball in which a player throws the ball to another member of the team who gets an opponent out either by stepping onto the base before the runner reaches it, or by touching the runner with the ball before he or she reaches the base",
                    "vi": "một hành động trong bóng chày, trong đó một cầu thủ ném bóng cho một thành viên khác của đội, người này khiến đối thủ bị loại bằng cách bước lên đế trước khi người chạy với nó hoặc bằng cách chạm vào người chạy với bóng trước khi người đó đến chân trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "03e270b1ffca4501aa3eae0638b0851e",
        "word": "centre back",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsentə ˈbæk/",
            "us": "/ˌsentər ˈbæk/"
        },
        "nearby": [
            {
                "word": "centre",
                "pos": "noun"
            },
            {
                "word": "centre",
                "pos": "verb"
            },
            {
                "word": "centre back",
                "pos": "noun"
            },
            {
                "word": "centreboard",
                "pos": "noun"
            },
            {
                "word": "centred",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player or position in the middle of the back line of players",
                    "vi": "một người chơi hoặc vị trí ở giữa hàng sau của người chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2d230167d714efebf948bcd3209f016",
        "word": "centre forward",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsentə ˈfɔːwəd/",
            "us": "/ˌsentər ˈfɔːrwərd/"
        },
        "nearby": [
            {
                "word": "centre field",
                "pos": "noun"
            },
            {
                "word": "centrefold",
                "pos": "noun"
            },
            {
                "word": "centre forward",
                "pos": "noun"
            },
            {
                "word": "centre half",
                "pos": "noun"
            },
            {
                "word": "centre-left",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player or position in the middle of the front line of players",
                    "vi": "một cầu thủ hoặc vị trí ở giữa hàng đầu của các cầu thủ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47b06aebe1324310a4d80dd981c29730",
        "word": "centre half",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsentə ˈhɑːf/",
            "us": "/ˌsentər ˈhæf/"
        },
        "nearby": [
            {
                "word": "centrefold",
                "pos": "noun"
            },
            {
                "word": "centre forward",
                "pos": "noun"
            },
            {
                "word": "centre half",
                "pos": "noun"
            },
            {
                "word": "centre-left",
                "pos": "adjective"
            },
            {
                "word": "centre-left",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player or position in the middle of the back line of players",
                    "vi": "một người chơi hoặc vị trí ở giữa hàng sau của người chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4dee5d373cd7426488a11d2859e249ff",
        "word": "clear",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/klɪə(r)/",
            "us": "/klɪr/"
        },
        "nearby": [
            {
                "word": "clean-up",
                "pos": "noun"
            },
            {
                "word": "clear",
                "pos": "adjective"
            },
            {
                "word": "clear",
                "pos": "verb"
            },
            {
                "word": "clear",
                "pos": "adverb"
            },
            {
                "word": "clear",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove things that are not wanted or needed from something",
                    "vi": "để loại bỏ những thứ không muốn hoặc không cần thiết khỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "clear something The settlers cleared the land and planted crops.",
                        "vi": "dọn sạch một cái gì đó Những người định cư đã khai phá đất và trồng hoa màu."
                    },
                    {
                        "en": "It was several hours before the road was cleared after the accident.",
                        "vi": "Phải vài giờ sau vụ tai nạn mới thông đường."
                    },
                    {
                        "en": "It's your turn to clear the table (= to take away the dirty plates, etc. after a meal).",
                        "vi": "Đến lượt bạn dọn bàn (= dọn sạch đĩa bẩn, v.v. sau bữa ăn)."
                    },
                    {
                        "en": "They started clearing a path through the dense jungle.",
                        "vi": "Họ bắt đầu dọn một con đường xuyên qua khu rừng rậm rạp."
                    },
                    {
                        "en": "The work of clearing the debris is in its final stages.",
                        "vi": "Công việc dọn dẹp các mảnh vỡ đang trong giai đoạn cuối cùng."
                    },
                    {
                        "en": "She cleared a space on the sofa for him to sit down.",
                        "vi": "Cô dọn một khoảng trống trên ghế sofa để anh ngồi xuống."
                    },
                    {
                        "en": "I had cleared my desk before I left.",
                        "vi": "Tôi đã dọn sạch bàn làm việc của mình trước khi rời đi."
                    },
                    {
                        "en": "clear A of B I cleared my desk of papers.",
                        "vi": "clear A of BI đã dọn sạch bàn giấy tờ của tôi."
                    },
                    {
                        "en": "The streets had been cleared of snow.",
                        "vi": "Đường phố đã được dọn sạch tuyết."
                    },
                    {
                        "en": "clear B from/off A Clear all those papers off the desk.",
                        "vi": "xóa B khỏi / tắt A Xóa tất cả những giấy tờ đó khỏi bàn làm việc."
                    },
                    {
                        "en": "The remains of the snow had been cleared from the streets.",
                        "vi": "Phần còn lại của tuyết đã được dọn sạch khỏi các đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make people leave a place",
                    "vi": "để làm cho mọi người rời khỏi một nơi"
                },
                "examples": [
                    {
                        "en": "Security officials tried to clear the area, fearing more bomb attacks.",
                        "vi": "Các quan chức an ninh đã cố gắng thu dọn khu vực này vì lo ngại sẽ có thêm nhiều vụ đánh bom."
                    },
                    {
                        "en": "After the bomb warning, police cleared the streets.",
                        "vi": "Sau khi cảnh báo có bom, cảnh sát đã dọn sạch các đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move freely again; to no longer be blocked",
                    "vi": "để di chuyển tự do một lần nữa; để không còn bị chặn"
                },
                "examples": [
                    {
                        "en": "The traffic took a long time to clear after the accident.",
                        "vi": "Rất lâu sau vụ tai nạn mới thông xe."
                    },
                    {
                        "en": "The boy's lungs cleared and he began to breathe more easily.",
                        "vi": "Phổi của cậu bé thông thoáng và cậu bắt đầu thở dễ dàng hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "when smoke, fog, etc. clears, it disappears so that it is easier to see things",
                    "vi": "khi khói, sương mù, v.v. tan biến, nó sẽ biến mất để dễ dàng nhìn thấy mọi thứ hơn"
                },
                "examples": [
                    {
                        "en": "The mist will clear by mid-morning.",
                        "vi": "Sương mù sẽ tan vào giữa buổi sáng."
                    },
                    {
                        "en": "The fog was beginning to clear away.",
                        "vi": "Sương mù bắt đầu tan dần."
                    },
                    {
                        "en": "As the dust cleared, we saw that the whole ceiling had come down.",
                        "vi": "Khi lớp bụi tan đi, chúng tôi thấy toàn bộ trần nhà đã sụp xuống."
                    },
                    {
                        "en": "As the smoke cleared, two fighter planes came into view.",
                        "vi": "Khi làn khói tan đi, hai máy bay chiến đấu xuất hiện trong tầm nhìn."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the sky or the weather clears, it becomes brighter and free of cloud or rain",
                    "vi": "khi bầu trời hoặc thời tiết quang đãng, trời trở nên sáng sủa hơn và không có mây hoặc mưa"
                },
                "examples": [
                    {
                        "en": "The next day the weather cleared.",
                        "vi": "Ngày hôm sau trời quang mây tạnh."
                    },
                    {
                        "en": "The sky cleared after the storm.",
                        "vi": "Trời quang mây tạnh sau cơn bão."
                    },
                    {
                        "en": "The rain is clearing slowly.",
                        "vi": "Mưa đang từ từ tan."
                    },
                    {
                        "en": "The clouds had not yet cleared.",
                        "vi": "Mây vẫn chưa tan."
                    },
                    {
                        "en": "Hopefully the storm would clear soon.",
                        "vi": "Hy vọng rằng cơn bão sẽ sớm tan."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a liquid clears, it becomes transparent and you can see through it",
                    "vi": "khi chất lỏng trong suốt, nó trở nên trong suốt và bạn có thể nhìn xuyên qua nó"
                },
                "examples": [
                    {
                        "en": "The muddy water slowly cleared.",
                        "vi": "Nước bùn từ từ trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your head or mind clears, or you clear it, you become free of thoughts that worry or confuse you or the effects of alcohol, a hit on the head, etc. and you are able to think clearly",
                    "vi": "nếu đầu hoặc trí óc của bạn sáng suốt, hoặc bạn xóa sạch nó, bạn sẽ không còn những suy nghĩ làm bạn lo lắng hoặc bối rối hoặc ảnh hưởng của rượu, một cú đánh vào đầu, v.v. và bạn có thể suy nghĩ rõ ràng"
                },
                "examples": [
                    {
                        "en": "As her mind cleared, she remembered what had happened.",
                        "vi": "Khi đầu óc tỉnh táo, cô nhớ lại những gì đã xảy ra."
                    },
                    {
                        "en": "clear something I went for a walk to clear my head.",
                        "vi": "rõ ràng một cái gì đó tôi đã đi bộ để giải tỏa đầu óc của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your face or expression clears, you stop looking angry or worried",
                    "vi": "nếu khuôn mặt hoặc biểu cảm của bạn rõ ràng, bạn không còn trông tức giận hoặc lo lắng nữa"
                },
                "examples": [
                    {
                        "en": "His face suddenly cleared as understanding dawned.",
                        "vi": "Khuôn mặt anh ta đột nhiên sáng tỏ khi sự hiểu biết bừng sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prove that somebody is innocent",
                    "vi": "để chứng minh rằng ai đó vô tội"
                },
                "examples": [
                    {
                        "en": "She was cleared of all charges against her.",
                        "vi": "Cô ấy đã được xóa bỏ mọi cáo buộc chống lại cô ấy."
                    },
                    {
                        "en": "Throughout his years in prison, he fought to clear his name.",
                        "vi": "Trong suốt những năm ở trong tù, anh đã chiến đấu để thanh minh cho tên tuổi của mình."
                    },
                    {
                        "en": "He has finally been cleared of any wrongdoing.",
                        "vi": "Cuối cùng anh ta đã được xóa bỏ bất kỳ hành vi sai trái nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or get official approval for something to be done",
                    "vi": "để cung cấp hoặc nhận được sự chấp thuận chính thức cho một cái gì đó sẽ được thực hiện"
                },
                "examples": [
                    {
                        "en": "clear something His appointment had been cleared by the board.",
                        "vi": "xóa một cái gì đó Cuộc hẹn của anh ấy đã được xóa bởi hội đồng quản trị."
                    },
                    {
                        "en": "clear something with somebody/something I'll have to clear it with the manager.",
                        "vi": "xóa một cái gì đó với ai đó / cái gì đó tôi sẽ phải xóa nó với người quản lý."
                    },
                    {
                        "en": "I'll have to clear it with the manager before I can refund your money.",
                        "vi": "Tôi sẽ phải giải quyết vấn đề này với người quản lý trước khi có thể hoàn lại tiền cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give official permission for a person, a ship, a plane or goods to leave or enter a place",
                    "vi": "cho phép chính thức một người, một con tàu, một chiếc máy bay hoặc hàng hóa rời hoặc vào một địa điểm"
                },
                "examples": [
                    {
                        "en": "The plane had been cleared for take-off.",
                        "vi": "Máy bay đã được dọn dẹp để cất cánh."
                    },
                    {
                        "en": "The goods had been cleared through customs.",
                        "vi": "Hàng hóa đã được thông quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide officially, after finding out information about somebody, that they can be given special work or allowed to see secret papers",
                    "vi": "quyết định chính thức, sau khi tìm hiểu thông tin về ai đó, rằng họ có thể được giao công việc đặc biệt hoặc được phép xem các giấy tờ bí mật"
                },
                "examples": [
                    {
                        "en": "She hasn't been cleared by security.",
                        "vi": "Cô ấy vẫn chưa được an ninh xóa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a payment that is made into your bank account clears, or a bank clears it, the money is available for you to use",
                    "vi": "nếu một khoản thanh toán được thực hiện vào tài khoản ngân hàng của bạn bị xóa hoặc ngân hàng xóa khoản đó, thì số tiền đó sẽ có sẵn để bạn sử dụng"
                },
                "examples": [
                    {
                        "en": "Cheques usually take three working days to clear.",
                        "vi": "Séc thường mất ba ngày làm việc để hoàn thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gain or earn a sum of money as profit",
                    "vi": "để đạt được hoặc kiếm được một khoản tiền dưới dạng lợi nhuận"
                },
                "examples": [
                    {
                        "en": "She cleared £1 000 on the deal.",
                        "vi": "Cô ấy đã bỏ ra 1 000 bảng cho thỏa thuận này."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you clear a debt or a loan, you pay all the money back",
                    "vi": "nếu bạn xóa một khoản nợ hoặc một khoản vay, bạn sẽ trả lại tất cả số tiền"
                },
                "examples": [
                    {
                        "en": "They sold $25 million in holdings in order to clear colossal bank debts.",
                        "vi": "Họ đã bán 25 triệu đô la nắm giữ để thanh toán các khoản nợ ngân hàng khổng lồ."
                    },
                    {
                        "en": "We are economizing for a few months to try to clear our overdraft.",
                        "vi": "Chúng tôi đang tiết kiệm trong một vài tháng để cố gắng xóa khoản thấu chi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to jump over or get past something without touching it",
                    "vi": "để nhảy qua hoặc vượt qua thứ gì đó mà không cần chạm vào nó"
                },
                "examples": [
                    {
                        "en": "The horse cleared the fence easily.",
                        "vi": "Con ngựa đã dọn hàng rào một cách dễ dàng."
                    },
                    {
                        "en": "The car only just cleared (= avoided hitting) the gatepost.",
                        "vi": "Chiếc xe chỉ vừa dọn (= tránh va phải) trụ cổng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you clear a ball, or a ball clears, it is kicked or hit away from the area near your own goal",
                    "vi": "nếu bạn phá bóng, hoặc bóng bị phá, nó sẽ được đá hoặc đánh ra xa khu vực gần khung thành của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help somebody have a fresh, lively state of mind again",
                    "vi": "để giúp ai đó có một trạng thái tinh thần tươi mới, sống động trở lại"
                },
                "examples": [
                    {
                        "en": "A brisk walk should blow the cobwebs away.",
                        "vi": "Đi bộ nhanh sẽ thổi bay mạng nhện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to improve a difficult or tense situation by talking about worries, doubts, etc.",
                    "vi": "để cải thiện một tình huống khó khăn hoặc căng thẳng bằng cách nói về những lo lắng, nghi ngờ, v.v."
                },
                "examples": [
                    {
                        "en": "This meeting will be an opportunity to clear the air and start the healing process.",
                        "vi": "Cuộc gặp gỡ này sẽ là cơ hội để giải tỏa không khí và bắt đầu quá trình chữa bệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the air less dirty or less humid (= warm and wet)",
                    "vi": "để làm cho không khí bớt bẩn hơn hoặc bớt ẩm hơn (= ấm và ướt)"
                },
                "examples": [
                    {
                        "en": "Storms were supposed to clear the air.",
                        "vi": "Bão đã được cho là để làm sạch không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare for an activity, event, etc. by removing anything that is not essential to it",
                    "vi": "để chuẩn bị cho một hoạt động, sự kiện, v.v. bằng cách loại bỏ bất cứ thứ gì không cần thiết đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cough (= to force out air noisily through your throat) so that you can speak clearly",
                    "vi": "ho (= để đẩy không khí ồn ào qua cổ họng của bạn) để bạn có thể nói rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove things that are stopping the progress or movement of something",
                    "vi": "để loại bỏ những thứ đang ngăn chặn tiến trình hoặc chuyển động của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The ruling could clear the way for extradition proceedings.",
                        "vi": "Phán quyết có thể dọn đường cho thủ tục dẫn độ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2c34294651304b098cc4e458ba30c8cc",
        "word": "clearance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklɪərəns/",
            "us": "/ˈklɪrəns/"
        },
        "nearby": [
            {
                "word": "clear",
                "pos": "adverb"
            },
            {
                "word": "clear",
                "pos": "noun"
            },
            {
                "word": "clearance",
                "pos": "noun"
            },
            {
                "word": "the Clearances",
                "pos": ""
            },
            {
                "word": "clear and present danger",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of removing things that are not wanted",
                    "vi": "quá trình loại bỏ những thứ không mong muốn"
                },
                "examples": [
                    {
                        "en": "forest clearances",
                        "vi": "phát quang rừng"
                    },
                    {
                        "en": "slum clearance (= the process of removing houses that are in very bad condition in an area of a town)",
                        "vi": "giải tỏa khu ổ chuột (= quá trình dỡ bỏ những ngôi nhà đang ở trong tình trạng rất tồi tệ trong một khu vực của thị trấn)"
                    },
                    {
                        "en": "Landscape gardeners have begun a clearance of the overgrown ground to make way for a new park.",
                        "vi": "Những người làm vườn cảnh đã bắt đầu giải phóng mặt bằng mọc um tùm để nhường chỗ cho một công viên mới."
                    },
                    {
                        "en": "a clearance sale (= in a shop, when goods are sold cheaply to get rid of them quickly)",
                        "vi": "giảm giá (= trong một cửa hàng, khi hàng hóa được bán với giá rẻ để nhanh chóng loại bỏ chúng)"
                    },
                    {
                        "en": "These coats are on clearance.",
                        "vi": "Những chiếc áo khoác này đang được giải phóng mặt bằng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of space or distance that is needed between two objects so that they do not touch each other",
                    "vi": "khoảng không gian hoặc khoảng cách cần thiết giữa hai đối tượng để chúng không chạm vào nhau"
                },
                "examples": [
                    {
                        "en": "There is not much clearance for vehicles passing under this bridge.",
                        "vi": "Không có nhiều tĩnh không cho các phương tiện lưu thông dưới cây cầu này."
                    },
                    {
                        "en": "a clearance of one metre",
                        "vi": "khoảng cách một mét"
                    }
                ]
            },
            {
                "define": {
                    "en": "official permission that is given to somebody before they can work somewhere, have particular information, or do something they want to do",
                    "vi": "sự cho phép chính thức được cấp cho ai đó trước khi họ có thể làm việc ở đâu đó, có thông tin cụ thể hoặc làm điều gì đó họ muốn làm"
                },
                "examples": [
                    {
                        "en": "I'm waiting for clearance from headquarters.",
                        "vi": "Tôi đang chờ thông quan từ trụ sở chính."
                    },
                    {
                        "en": "All employees at the submarine base require security clearance.",
                        "vi": "Tất cả các nhân viên tại căn cứ tàu ngầm đều yêu cầu được thông quan an ninh."
                    }
                ]
            },
            {
                "define": {
                    "en": "official permission for a person, vehicle or goods to enter or leave an airport or a country",
                    "vi": "sự cho phép chính thức cho một người, phương tiện hoặc hàng hóa ra vào sân bay hoặc một quốc gia"
                },
                "examples": [
                    {
                        "en": "The pilot was waiting for clearance for take-off.",
                        "vi": "Phi công đang chờ thông quan để cất cánh."
                    },
                    {
                        "en": "How long will customs clearance take?",
                        "vi": "Thủ tục hải quan sẽ mất bao lâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of a payment into a bank account being confirmed by the bank, so the money is available for you to use",
                    "vi": "quy trình thanh toán vào tài khoản ngân hàng được ngân hàng xác nhận, vì vậy bạn có thể sử dụng tiền"
                },
                "examples": [
                    {
                        "en": "Clearance will take seven days.",
                        "vi": "Việc thông quan sẽ mất bảy ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a clearance in football (soccer) and some other sports is when a player kicks or hits the ball away from the goal of his or her own team",
                    "vi": "cản phá trong bóng đá (bóng đá) và một số môn thể thao khác là khi một cầu thủ đá hoặc đánh bóng ra xa khung thành của đội mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6824e9b7bb0d4ae1babce1c6ab6bbd00",
        "word": "cross",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/krɒs/",
            "us": "/krɔːs/"
        },
        "nearby": [
            {
                "word": "cross-breed",
                "pos": "noun"
            },
            {
                "word": "cross-country",
                "pos": "noun"
            },
            {
                "word": "cross",
                "pos": "verb"
            },
            {
                "word": "cross",
                "pos": "noun"
            },
            {
                "word": "cross",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go across; to pass or stretch from one side to the other",
                    "vi": "Đi ngang qua; để vượt qua hoặc kéo dài từ bên này sang bên kia"
                },
                "examples": [
                    {
                        "en": "As soon as traffic slowed down enough to safely cross, I started walking.",
                        "vi": "Ngay khi xe cộ giảm tốc độ đủ để băng qua một cách an toàn, tôi bắt đầu đi bộ."
                    },
                    {
                        "en": "cross over I waved and she crossed over (= crossed the road towards me).",
                        "vi": "cross over Tôi vẫy tay và cô ấy băng qua (= băng qua đường về phía tôi)."
                    },
                    {
                        "en": "cross (over) from … He crossed over from the other side of the road.",
                        "vi": "băng qua (qua) từ… Anh ta băng qua từ phía bên kia đường."
                    },
                    {
                        "en": "cross (over) from… to/into… We crossed from Dover to Calais.",
                        "vi": "băng qua (qua) từ… đến / vào… Chúng tôi đã vượt từ Dover đến Calais."
                    },
                    {
                        "en": "cross (over) to/into… She crossed to the other side of the room.",
                        "vi": "băng qua (qua) đến / vào… Cô ấy băng qua phía bên kia của căn phòng."
                    },
                    {
                        "en": "cross something to cross the road/street",
                        "vi": "băng qua một cái gì đó để băng qua đường / phố"
                    },
                    {
                        "en": "to cross the sea/mountains",
                        "vi": "băng qua biển / núi"
                    },
                    {
                        "en": "to cross France by train",
                        "vi": "đi qua nước Pháp bằng tàu hỏa"
                    },
                    {
                        "en": "The bridge crosses the River Dee.",
                        "vi": "Cây cầu bắc qua sông Dee."
                    },
                    {
                        "en": "He was caught trying to cross the border illegally.",
                        "vi": "Anh ta bị bắt khi cố gắng vượt biên trái phép."
                    },
                    {
                        "en": "More than 150 000 people crossed the bridge that day.",
                        "vi": "Hơn 150 000 người đã đi qua cầu vào ngày hôm đó."
                    },
                    {
                        "en": "A look of annoyance crossed her face.",
                        "vi": "Một cái nhìn khó chịu thoáng qua khuôn mặt cô."
                    },
                    {
                        "en": "They crossed the finishing line together (= in a race).",
                        "vi": "Họ cùng nhau vượt qua vạch đích (= trong một cuộc đua)."
                    },
                    {
                        "en": "cross over something He crossed over the road and joined me.",
                        "vi": "băng qua một cái gì đó Anh ấy băng qua đường và tham gia với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass across each other",
                    "vi": "đi ngang qua nhau"
                },
                "examples": [
                    {
                        "en": "The roads cross just outside the town.",
                        "vi": "Các con đường cắt ngang ngay bên ngoài thị trấn."
                    },
                    {
                        "en": "cross over The straps cross over at the back and are tied at the waist.",
                        "vi": "vắt chéo Các dây đai bắt chéo ở phía sau và được buộc ở thắt lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or place something across or over something else",
                    "vi": "đặt hoặc đặt một cái gì đó ngang hoặc đè lên một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "to cross your arms/legs (= place one arm or leg over the other)",
                        "vi": "khoanh tay / chân của bạn (= đặt một cánh tay hoặc chân lên bên kia)"
                    },
                    {
                        "en": "She sat with her legs crossed.",
                        "vi": "Cô ấy ngồi khoanh chân."
                    },
                    {
                        "en": "a flag with a design of two crossed keys",
                        "vi": "một lá cờ với thiết kế hai phím chéo"
                    }
                ]
            },
            {
                "define": {
                    "en": "to oppose somebody or speak against them or their plans or wishes",
                    "vi": "chống lại ai đó hoặc nói chống lại họ hoặc kế hoạch hoặc mong muốn của họ"
                },
                "examples": [
                    {
                        "en": "She's really nice until you cross her.",
                        "vi": "Cô ấy thực sự tốt cho đến khi bạn vượt qua cô ấy."
                    },
                    {
                        "en": "(literary) He had been crossed in love (= the person he loved was not faithful to him).",
                        "vi": "(văn học) Anh ấy đã bị yêu (= người anh ấy yêu không chung thủy với anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make two different types of animal breed (= produce young) together; to mix two types of plant to form a new one",
                    "vi": "để tạo ra hai loại động vật khác nhau (= sản xuất con non) với nhau; trộn hai loại cây để tạo thành một loại cây mới"
                },
                "examples": [
                    {
                        "en": "A mule is the product of a horse crossed with a donkey.",
                        "vi": "Một con la là sản phẩm của một con ngựa lai với một con lừa."
                    },
                    {
                        "en": "(figurative) He behaved like an army officer crossed with a professor.",
                        "vi": "(nghĩa bóng) Anh ta cư xử như một sĩ quan quân đội qua lại với một giáo sư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kick or pass a ball to the side across the field",
                    "vi": "đá hoặc chuyền bóng sang bên kia sân"
                },
                "examples": [
                    {
                        "en": "Sissoko crossed from the left.",
                        "vi": "Sissoko căng ngang từ cánh trái."
                    },
                    {
                        "en": "cross something He could not get to the line to cross the ball.",
                        "vi": "qua một cái gì đó Anh ấy không thể nhận được đến đường để cắt bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to draw a line across something",
                    "vi": "để vẽ một đường ngang qua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to cross your t’s (= the letters in writing)",
                        "vi": "để vượt qua chữ t của bạn (= các chữ cái trong văn bản)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the sign of the cross (= the Christian symbol) on your chest",
                    "vi": "để làm dấu thánh giá (= biểu tượng Cơ đốc giáo) trên ngực của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something that is not considered to be acceptable behaviour",
                    "vi": "làm điều gì đó không được coi là hành vi có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "He crossed the line by making details of their very private conversation public.",
                        "vi": "Anh ta vượt qua ranh giới bằng cách công khai chi tiết cuộc trò chuyện rất riêng tư của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hope that your plans will be successful (sometimes putting one finger across another as a sign of hoping for good luck)",
                    "vi": "để hy vọng rằng kế hoạch của bạn sẽ thành công (đôi khi đặt ngón tay này qua ngón tay khác như một dấu hiệu của hy vọng may mắn)"
                },
                "examples": [
                    {
                        "en": "I'm crossing my fingers that my proposal will be accepted.",
                        "vi": "Tôi chắc chắn rằng lời cầu hôn của tôi sẽ được chấp nhận."
                    },
                    {
                        "en": "Keep your fingers crossed!",
                        "vi": "Giữ ngón tay của bạn vượt qua!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you are telling the truth or will do what you promise",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn đang nói sự thật hoặc sẽ làm những gì bạn hứa"
                },
                "examples": [
                    {
                        "en": "I saw him do it—cross my heart.",
                        "vi": "Tôi đã thấy anh ấy làm điều đó - trái tim tôi rất vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come into your mind",
                    "vi": "xuất hiện trong tâm trí bạn"
                },
                "examples": [
                    {
                        "en": "It never crossed my mind that she might lose (= I was sure that she would win).",
                        "vi": "Tôi chưa bao giờ nghĩ đến việc cô ấy có thể thua (= Tôi chắc chắn rằng cô ấy sẽ thắng)."
                    },
                    {
                        "en": "The thought never crossed my mind!",
                        "vi": "Ý nghĩ đó không bao giờ xuất hiện trong đầu tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody money so that they will do you a favour, especially tell your fortune",
                    "vi": "cho ai đó tiền để họ sẽ giúp đỡ bạn, đặc biệt là nói về vận may của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody crosses somebody’s path or their paths cross, they meet by chance",
                    "vi": "nếu ai đó băng qua con đường của ai đó hoặc con đường của họ cắt ngang, họ gặp nhau một cách tình cờ"
                },
                "examples": [
                    {
                        "en": "I hope I never cross her path again.",
                        "vi": "Tôi hy vọng tôi sẽ không bao giờ vượt qua con đường của cô ấy nữa."
                    },
                    {
                        "en": "Our paths were to cross again many years later.",
                        "vi": "Con đường của chúng tôi lại phải cắt nhau nhiều năm sau đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight or argue with somebody",
                    "vi": "chiến đấu hoặc tranh luận với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to worry about a problem when it actually happens and not before",
                    "vi": "lo lắng về một vấn đề khi nó thực sự xảy ra chứ không phải trước đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pay attention to the small details when you are finishing a task",
                    "vi": "chú ý đến những chi tiết nhỏ khi bạn đang hoàn thành một nhiệm vụ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become confused about what somebody has said to you so that you think they meant something else",
                    "vi": "trở nên bối rối về những gì ai đó đã nói với bạn để bạn nghĩ rằng họ có ý khác"
                },
                "examples": [
                    {
                        "en": "We seem to have got our wires crossed. I thought you were coming on Tuesday.",
                        "vi": "Chúng tôi dường như đã có dây của chúng tôi vượt qua. Tôi nghĩ bạn sẽ đến vào thứ Ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "5620c5d19e8245748df2e471ed3f5fcb",
        "word": "cross",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krɒs/",
            "us": "/krɔːs/"
        },
        "nearby": [
            {
                "word": "cross-country",
                "pos": "noun"
            },
            {
                "word": "cross",
                "pos": "verb"
            },
            {
                "word": "cross",
                "pos": "noun"
            },
            {
                "word": "cross",
                "pos": "adjective"
            },
            {
                "word": "cross-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mark or an object formed by two lines crossing each other (X or +); the mark (X) is often used on paper to show something",
                    "vi": "một dấu hiệu hoặc một đối tượng được tạo thành bởi hai đường thẳng chéo nhau (X hoặc +); dấu (X) thường được sử dụng trên giấy để thể hiện điều gì đó"
                },
                "examples": [
                    {
                        "en": "I've put a cross on the map to show where the hotel is.",
                        "vi": "Tôi đã đặt một dấu thập trên bản đồ để hiển thị vị trí của khách sạn."
                    },
                    {
                        "en": "Put a tick if the answer is correct and a cross if it's wrong.",
                        "vi": "Đánh dấu chọn nếu câu trả lời đúng và gạch chéo nếu câu trả lời sai."
                    },
                    {
                        "en": "Sign your name on the form where I've put a cross.",
                        "vi": "Ký tên của bạn trên biểu mẫu mà tôi đã đặt một cây thánh giá."
                    },
                    {
                        "en": "Those who could not write signed with a cross.",
                        "vi": "Những người không thể viết được ký tên bằng cây thánh giá."
                    },
                    {
                        "en": "Put a cross beside the name of the candidate you wish to vote for.",
                        "vi": "Đặt một dấu thập bên cạnh tên của ứng cử viên mà bạn muốn bỏ phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long straight piece of wood with one end in the ground and a shorter piece joined across it from side to side near the top. In the past people were hung on crosses and left to die as a punishment.",
                    "vi": "một mảnh gỗ dài thẳng với một đầu ở dưới đất và một mảnh ngắn hơn ghép ngang nó từ bên này sang bên kia gần đầu. Trong quá khứ, người ta bị treo trên thập tự giá và để chết như một hình phạt."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the cross that Jesus Christ died on, used as a symbol of Christianity",
                    "vi": "Thập tự giá mà Chúa Giê-su Christ đã chết, được sử dụng như một biểu tượng của Cơ đốc giáo"
                },
                "examples": [
                    {
                        "en": "The priest blessed her, and made the sign of the cross over her.",
                        "vi": "Vị linh mục đã ban phước cho cô và làm dấu thánh giá trên cô."
                    },
                    {
                        "en": "a painting of Christ on the cross",
                        "vi": "một bức tranh của Chúa Kitô trên thập tự giá"
                    }
                ]
            },
            {
                "define": {
                    "en": "an object, a design, a piece of jewellery, etc. in the shape of a cross, used as a symbol of Christianity",
                    "vi": "một đồ vật, một thiết kế, một món đồ trang sức, v.v. có hình chữ thập, được dùng làm biểu tượng của Cơ đốc giáo"
                },
                "examples": [
                    {
                        "en": "She wore a small gold cross on a chain around her neck.",
                        "vi": "Cô đeo một cây thánh giá nhỏ bằng vàng trên dây chuyền quanh cổ."
                    },
                    {
                        "en": "The grave was marked with a stone cross.",
                        "vi": "Ngôi mộ được đánh dấu bằng một cây thánh giá bằng đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small decoration in the shape of a cross that is given to somebody as an honour for doing something very brave",
                    "vi": "một trang trí nhỏ hình thánh giá được tặng cho ai đó như một vinh dự vì đã làm một việc rất dũng cảm"
                },
                "examples": [
                    {
                        "en": "He was awarded the Military Cross.",
                        "vi": "Ông đã được tặng thưởng Quân Thập Tự."
                    },
                    {
                        "en": "He was awarded the Victoria Cross for bravery.",
                        "vi": "Anh đã được trao tặng giải thưởng Victoria Cross cho sự dũng cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mixture of two different things, breeds (= types) of animal, etc.",
                    "vi": "hỗn hợp của hai thứ khác nhau, giống (= loại) động vật, v.v."
                },
                "examples": [
                    {
                        "en": "The play was a cross between a farce and a tragedy.",
                        "vi": "Vở kịch là sự giao thoa giữa một trò hề và một bi kịch."
                    },
                    {
                        "en": "A mule is a cross between a horse and a donkey.",
                        "vi": "Con la là con lai giữa ngựa và lừa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a kick or hit of the ball across the field rather than up or down it",
                    "vi": "một cú đá hoặc đánh bóng qua sân chứ không phải lên hoặc xuống"
                },
                "examples": [
                    {
                        "en": "Webster's low cross was fired into the net by Varney.",
                        "vi": "Quả tạt tầm thấp của Webster đã được Varney sút vào lưới."
                    },
                    {
                        "en": "a deep cross from Sterling",
                        "vi": "một quả tạt sâu từ Sterling"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a difficult problem that makes you worried or unhappy but that you have to deal with",
                    "vi": "gặp một vấn đề khó khăn khiến bạn lo lắng hoặc không vui nhưng bạn phải giải quyết"
                },
                "examples": [
                    {
                        "en": "We all have our crosses to bear.",
                        "vi": "Tất cả chúng ta đều có những thập giá của mình phải chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "ecb65a79903549a0bf12363c6ba802af",
        "word": "division",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈvɪʒn/",
            "us": "/dɪˈvɪʒn/"
        },
        "nearby": [
            {
                "word": "divinity",
                "pos": "noun"
            },
            {
                "word": "divisible",
                "pos": "adjective"
            },
            {
                "word": "division",
                "pos": "noun"
            },
            {
                "word": "divisional",
                "pos": "adjective"
            },
            {
                "word": "division bell",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process or result of dividing into separate parts; the process or result of dividing something or sharing it out",
                    "vi": "quá trình hoặc kết quả của việc phân chia thành các phần riêng biệt; quá trình hoặc kết quả của việc phân chia thứ gì đó hoặc chia sẻ nó ra"
                },
                "examples": [
                    {
                        "en": "The organism begins as a single cell and grows by cell division.",
                        "vi": "Sinh vật bắt đầu như một tế bào đơn lẻ và phát triển bằng cách phân chia tế bào."
                    },
                    {
                        "en": "division of something We need to ensure a fair division of time and resources.",
                        "vi": "phân chia thứ gì đó Chúng ta cần đảm bảo sự phân chia hợp lý về thời gian và nguồn lực."
                    },
                    {
                        "en": "division (of something) between A and B the division of labour between the sexes",
                        "vi": "sự phân chia (của một cái gì đó) giữa A và B Sự phân công lao động giữa hai giới"
                    },
                    {
                        "en": "The living room is divided from a large terrace by glass walls so division between inside and outside is blurred.",
                        "vi": "Phòng khách được ngăn với khoảng sân thượng lớn bằng vách kính nên sự phân chia giữa bên trong và bên ngoài bị mờ đi."
                    },
                    {
                        "en": "division (of something) among somebody His will detailed his assets and gave instructions for their division among his children.",
                        "vi": "sự phân chia (của một cái gì đó) cho một người nào đó Di chúc của Ngài đã trình bày chi tiết tài sản của mình và đưa ra các chỉ dẫn về việc phân chia chúng cho các con của Ngài."
                    },
                    {
                        "en": "The fund is available for discretionary division among members.",
                        "vi": "Quỹ có sẵn để phân chia tùy ý giữa các thành viên."
                    },
                    {
                        "en": "division of something into something This division of the population into age groups is obviously convenient for marketing purposes.",
                        "vi": "sự phân chia của một cái gì đó thành một cái gì đó Việc phân chia dân số thành các nhóm tuổi rõ ràng là thuận tiện cho các mục đích tiếp thị."
                    },
                    {
                        "en": "division into something This is a distinction which cuts right across the familiar division into arts and sciences.",
                        "vi": "sự phân chia thành một cái gì đó Đây là sự phân biệt cắt ngang qua sự phân chia quen thuộc thành nghệ thuật và khoa học."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of dividing one number by another",
                    "vi": "quá trình chia một số cho một số khác"
                },
                "examples": [
                    {
                        "en": "the division sign (÷)",
                        "vi": "dấu phân chia (÷)"
                    },
                    {
                        "en": "division by something division by three",
                        "vi": "chia cho một cái gì đó chia cho ba"
                    }
                ]
            },
            {
                "define": {
                    "en": "a disagreement or difference in opinion, way of life, etc., especially between members of a society or an organization",
                    "vi": "sự bất đồng hoặc khác biệt về quan điểm, cách sống, v.v., đặc biệt là giữa các thành viên của một xã hội hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "We choose peace over hatred and division.",
                        "vi": "Chúng tôi chọn hòa bình hơn hận thù và chia rẽ."
                    },
                    {
                        "en": "division (in something) (over something) There are deep divisions in the party over the war.",
                        "vi": "sự chia rẽ (trong điều gì đó) (về điều gì đó) Có sự chia rẽ sâu sắc trong đảng vì chiến tranh."
                    },
                    {
                        "en": "division within something the work of healing the divisions within society",
                        "vi": "chia rẽ trong một cái gì đó công việc hàn gắn những chia rẽ trong xã hội"
                    },
                    {
                        "en": "division between A and B divisions between rich and poor",
                        "vi": "sự phân chia giữa A và B Sự phân chia giàu nghèo"
                    },
                    {
                        "en": "The party was weakened by division between various factions.",
                        "vi": "Đảng đã bị suy yếu do sự chia rẽ giữa các phe phái khác nhau."
                    },
                    {
                        "en": "Her comments appeared to have deepened divisions between the two countries.",
                        "vi": "Những bình luận của bà dường như đã làm sâu sắc thêm sự chia rẽ giữa hai nước."
                    },
                    {
                        "en": "division among somebody/something He has tried to sow division among the people.",
                        "vi": "chia rẽ giữa ai đó / điều gì đó Anh ta đã cố gắng gieo rắc sự chia rẽ giữa mọi người."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large and important unit or section of an organization",
                    "vi": "một đơn vị hoặc bộ phận lớn và quan trọng của một tổ chức"
                },
                "examples": [
                    {
                        "en": "the organized crime division of the Austrian police force",
                        "vi": "bộ phận tội phạm có tổ chức của lực lượng cảnh sát Áo"
                    },
                    {
                        "en": "The company's sales division is going to be restructured.",
                        "vi": "Bộ phận bán hàng của công ty sẽ được tái cấu trúc."
                    },
                    {
                        "en": "the head of the crime division in West Yorkshire police",
                        "vi": "người đứng đầu bộ phận tội phạm của cảnh sát West Yorkshire"
                    }
                ]
            },
            {
                "define": {
                    "en": "part of a city, county, or country that is regarded as a separate area for administration purposes",
                    "vi": "một phần của thành phố, quận hoặc quốc gia được coi là một khu vực riêng biệt cho các mục đích quản lý"
                },
                "examples": [
                    {
                        "en": "Oldham is one of the police divisions of Greater Manchester.",
                        "vi": "Oldham là một trong những đơn vị cảnh sát của Greater Manchester."
                    },
                    {
                        "en": "Nagpur is the most eastern division in the state.",
                        "vi": "Nagpur là phân khu phía đông nhất của bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of teams or competitors in a sports competition who compete against each other. Divisions may be organized by ability, geography or weight, depending on the sport.",
                    "vi": "một nhóm các đội hoặc các đối thủ trong một cuộc thi thể thao thi đấu với nhau. Các bộ phận có thể được tổ chức theo khả năng, địa lý hoặc trọng lượng, tùy thuộc vào môn thể thao."
                },
                "examples": [
                    {
                        "en": "the premier division",
                        "vi": "bộ phận hàng đầu"
                    },
                    {
                        "en": "The club will finish second in Division One.",
                        "vi": "Câu lạc bộ sẽ về nhì tại Division One."
                    },
                    {
                        "en": "a first-division team",
                        "vi": "một đội hạng nhất"
                    },
                    {
                        "en": "one of the most competitive weight divisions in judo",
                        "vi": "một trong những hạng cân cạnh tranh nhất trong judo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of an army, consisting of several brigades or regiments",
                    "vi": "một đơn vị của quân đội, bao gồm một số lữ đoàn hoặc trung đoàn"
                },
                "examples": [
                    {
                        "en": "the Guards Armoured Division",
                        "vi": "Sư đoàn thiết giáp cận vệ"
                    },
                    {
                        "en": "The commander of the fourth infantry division defied orders.",
                        "vi": "Tư lệnh sư đoàn 4 bộ binh bất chấp mệnh lệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line that divides something",
                    "vi": "một đường phân chia một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A hedge forms the division between their land and ours.",
                        "vi": "Một hàng rào tạo nên sự phân chia giữa đất đai của họ và của chúng ta."
                    },
                    {
                        "en": "(figurative) Sometimes there is no simple division between good and evil.",
                        "vi": "(nghĩa bóng) Đôi khi không có sự phân chia đơn giản giữa thiện và ác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of separating members of the British parliament into groups to vote for or against something",
                    "vi": "hành động tách các thành viên của quốc hội Anh thành các nhóm để bỏ phiếu ủng hộ hoặc chống lại điều gì đó"
                },
                "examples": [
                    {
                        "en": "The Bill was read without a division.",
                        "vi": "Dự luật đã được đọc mà không có sự phân chia."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab164b8046934ffab5233594dcfa8f2e",
        "word": "dribble",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɪbl/",
            "us": "/ˈdrɪbl/"
        },
        "nearby": [
            {
                "word": "Nancy Drew",
                "pos": ""
            },
            {
                "word": "drey",
                "pos": "noun"
            },
            {
                "word": "dribble",
                "pos": "verb"
            },
            {
                "word": "dribble",
                "pos": "noun"
            },
            {
                "word": "dribs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to let saliva or another liquid come out of your mouth and run down your chin",
                    "vi": "để nước bọt hoặc chất lỏng khác chảy ra khỏi miệng và chảy xuống cằm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall in small drops or in a thin stream",
                    "vi": "rơi từng giọt nhỏ hoặc trong một dòng suối mỏng"
                },
                "examples": [
                    {
                        "en": "Melted wax dribbled down the side of the candle.",
                        "vi": "Sáp nóng chảy chảy xuống thành nến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pour something slowly, in drops or a thin stream",
                    "vi": "đổ một thứ gì đó từ từ, nhỏ giọt hoặc một dòng mỏng"
                },
                "examples": [
                    {
                        "en": "Dribble a little olive oil over the salad.",
                        "vi": "Nhỏ một chút dầu ô liu lên món salad."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move the ball along with several short kicks, hits or bounces",
                    "vi": "di chuyển bóng cùng với một số cú đá ngắn, đánh hoặc trả lại"
                },
                "examples": [
                    {
                        "en": "She dribbled the ball the length of the field.",
                        "vi": "Cô ấy rê bóng theo chiều dài của sân."
                    },
                    {
                        "en": "He dribbled past two defenders and scored a magnificent goal.",
                        "vi": "Anh đi bóng qua hai hậu vệ và ghi một bàn thắng tuyệt đẹp."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd7ee6b86f2e48d4b4277a7824735677",
        "word": "dribble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɪbl/",
            "us": "/ˈdrɪbl/"
        },
        "nearby": [
            {
                "word": "drey",
                "pos": "noun"
            },
            {
                "word": "dribble",
                "pos": "verb"
            },
            {
                "word": "dribble",
                "pos": "noun"
            },
            {
                "word": "dribs",
                "pos": "noun"
            },
            {
                "word": "dried",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small amount of liquid, in a thin stream",
                    "vi": "một lượng rất nhỏ chất lỏng, ở dạng dòng chảy mỏng"
                },
                "examples": [
                    {
                        "en": "a dribble of blood",
                        "vi": "một giọt máu"
                    },
                    {
                        "en": "Add just a dribble of oil.",
                        "vi": "Thêm một chút dầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "saliva (= liquid) from a person’s mouth",
                    "vi": "nước bọt (= chất lỏng) từ miệng của một người"
                },
                "examples": [
                    {
                        "en": "There was dribble all down the baby's front.",
                        "vi": "Có giọt nước chảy xuống tất cả các phía trước của em bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of dribbling the ball in a sport",
                    "vi": "hành động lừa bóng trong một môn thể thao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f56424cbd87f420baa7a6feadaf9a3d0",
        "word": "dugout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʌɡaʊt/",
            "us": "/ˈdʌɡaʊt/"
        },
        "nearby": [
            {
                "word": "dug",
                "pos": "verb"
            },
            {
                "word": "dugong",
                "pos": "noun"
            },
            {
                "word": "dugout",
                "pos": "noun"
            },
            {
                "word": "duh",
                "pos": "exclamation"
            },
            {
                "word": "DUI",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rough shelter made by digging a hole in the ground and covering it, used by soldiers",
                    "vi": "một nơi trú ẩn thô sơ được làm bằng cách đào một cái lỗ trên mặt đất và đắp nó, được sử dụng bởi những người lính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shelter by the side of a football (soccer) or baseball field where a team’s manager, etc. can sit and watch the game",
                    "vi": "nơi trú ẩn bên cạnh sân bóng đá (bóng đá) hoặc sân bóng chày, nơi quản lý của đội, v.v. có thể ngồi và xem trận đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a canoe (= type of light narrow boat) made by cutting out the inside of a tree trunk",
                    "vi": "một chiếc ca nô (= loại thuyền hẹp nhẹ) được làm bằng cách khoét phần bên trong của một thân cây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "edef2a4d25ba4d2fac2c861662c2f2c6",
        "word": "fantasy football",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfæntəsi ˈfʊtbɔːl/",
            "us": "/ˌfæntəsi ˈfʊtbɔːl/"
        },
        "nearby": [
            {
                "word": "fantastically",
                "pos": "adverb"
            },
            {
                "word": "fantasy",
                "pos": "noun"
            },
            {
                "word": "fantasy football",
                "pos": "noun"
            },
            {
                "word": "fanzine",
                "pos": "noun"
            },
            {
                "word": "FAO",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a competition in which you choose players to make your own imaginary team, and score points according to the performance of the real players",
                    "vi": "một cuộc thi trong đó bạn chọn người chơi để tạo thành đội tưởng tượng của riêng bạn và ghi điểm theo hiệu suất của những người chơi thực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0244ba1eb1d34e78a4c249379f9ae142",
        "word": "footie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊti/",
            "us": "/ˈfʊti/"
        },
        "nearby": [
            {
                "word": "foothill",
                "pos": "noun"
            },
            {
                "word": "foothold",
                "pos": "noun"
            },
            {
                "word": "footie",
                "pos": "noun"
            },
            {
                "word": "footing",
                "pos": "noun"
            },
            {
                "word": "footlights",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "football (= soccer)",
                    "vi": "bóng đá (= bóng đá)"
                },
                "examples": [
                    {
                        "en": "a game of footie",
                        "vi": "một trò chơi của footie"
                    }
                ]
            }
        ]
    },
    {
        "id": "7d3745bcae4d47f7978e36ceb681d0e3",
        "word": "footy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊti/",
            "us": "/ˈfʊti/"
        },
        "nearby": [
            {
                "word": "footwear",
                "pos": "noun"
            },
            {
                "word": "footwork",
                "pos": "noun"
            },
            {
                "word": "footy",
                "pos": "noun"
            },
            {
                "word": "foo yong",
                "pos": "noun"
            },
            {
                "word": "fop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "football (= soccer)",
                    "vi": "bóng đá (= bóng đá)"
                },
                "examples": [
                    {
                        "en": "a game of footie",
                        "vi": "một trò chơi của footie"
                    }
                ]
            }
        ]
    },
    {
        "id": "b6782473a59a4fffa43610d9a925e020",
        "word": "futsal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfuːtsɔːl/",
            "us": "/ˈfuːtsɔːl/"
        },
        "nearby": [
            {
                "word": "futility",
                "pos": "noun"
            },
            {
                "word": "futon",
                "pos": "noun"
            },
            {
                "word": "futsal",
                "pos": "noun"
            },
            {
                "word": "future-proof",
                "pos": "verb"
            },
            {
                "word": "future",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a version of football (soccer) that is usually played indoors on a smaller pitch with five players on each team",
                    "vi": "một phiên bản của bóng đá (bóng đá) thường được chơi trong nhà trên một sân nhỏ hơn với năm cầu thủ trong mỗi đội"
                },
                "examples": [
                    {
                        "en": "The ball in futsal is smaller and heavier than a regular football.",
                        "vi": "Quả bóng trong môn futsal nhỏ hơn và nặng hơn bóng đá thông thường."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb61190637d244e7b702dc6ec6284605",
        "word": "get/keep somebody onside",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnˈsaɪd/",
            "us": "/ˌɑːnˈsaɪd/"
        },
        "nearby": [
            {
                "word": "onshore",
                "pos": "adjective"
            },
            {
                "word": "onshore",
                "pos": "adverb"
            },
            {
                "word": "onside",
                "pos": "adjective"
            },
            {
                "word": "onside",
                "pos": "adverb"
            },
            {
                "word": "onslaught",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in some sports, for example football (soccer) and ice hockey, a player who is onside is in a position where playing the ball or puck is allowed",
                    "vi": "trong một số môn thể thao, chẳng hạn như bóng đá (bóng đá) và khúc côn cầu trên băng, một cầu thủ đang thi đấu ở vị trí được phép chơi bóng hoặc đánh bóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get/keep somebody’s support",
                    "vi": "để có được / giữ sự ủng hộ của ai đó"
                },
                "examples": [
                    {
                        "en": "The party needs to keep the major national newspapers onside if it's going to win the next election.",
                        "vi": "Đảng cần phải cập nhật các tờ báo lớn của quốc gia nếu họ giành chiến thắng trong cuộc bầu cử tiếp theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "89c065681d504ec0930646c61cb1c3f0",
        "word": "goal difference",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡəʊl dɪfrəns/",
            "us": "/ˈɡəʊl dɪfrəns/"
        },
        "nearby": [
            {
                "word": "goal area",
                "pos": "noun"
            },
            {
                "word": "goalball",
                "pos": "noun"
            },
            {
                "word": "goal difference",
                "pos": "noun"
            },
            {
                "word": "goalkeeper",
                "pos": "noun"
            },
            {
                "word": "goalkeeping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the difference between the number of goals that a team has scored and the number of goals that have been scored against them over a series of games, sometimes used to decide the team’s position in the league table",
                    "vi": "hiệu số giữa số bàn thắng mà một đội đã ghi được và số bàn thắng đã ghi vào lưới của họ trong một loạt trận đấu, đôi khi được sử dụng để quyết định vị trí của đội đó trên bảng xếp hạng"
                },
                "examples": [
                    {
                        "en": "Russia lead Group G on goal difference from Montenegro.",
                        "vi": "Nga dẫn đầu bảng G về hiệu số bàn thắng bại so với Montenegro."
                    }
                ]
            }
        ]
    },
    {
        "id": "d2e5b8d322764f84a6740795953b02ec",
        "word": "golden goal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɡəʊldən ˈɡəʊl/",
            "us": "/ˌɡəʊldən ˈɡəʊl/"
        },
        "nearby": [
            {
                "word": "the Golden Gate Bridge",
                "pos": ""
            },
            {
                "word": "Golden Globe Award",
                "pos": "noun"
            },
            {
                "word": "golden goal",
                "pos": "noun"
            },
            {
                "word": "golden goose",
                "pos": "noun"
            },
            {
                "word": "golden handcuffs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first goal scored during extra time, which ends the game and gives victory to the team that scores the goal",
                    "vi": "bàn thắng đầu tiên được ghi trong hiệp phụ, kết thúc trận đấu và mang về chiến thắng cho đội ghi bàn thắng"
                },
                "examples": [
                    {
                        "en": "Italy lost on a golden goal to France in the semi-final.",
                        "vi": "Ý đã thua Pháp với bàn thắng vàng trong trận bán kết."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ca4a0f5b4b24b1ba2a13ee86e7f584d",
        "word": "handball",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhændbɔːl/",
            "us": "/ˈhændbɔːl/"
        },
        "nearby": [
            {
                "word": "handbag",
                "pos": "noun"
            },
            {
                "word": "hand baggage",
                "pos": "noun"
            },
            {
                "word": "handball",
                "pos": "noun"
            },
            {
                "word": "handbasin",
                "pos": "noun"
            },
            {
                "word": "handbasket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a team game for two teams of seven players, usually played indoors, in which players try to score goals by throwing a ball with their hand",
                    "vi": "một trò chơi đồng đội dành cho hai đội gồm bảy người chơi, thường chơi trong nhà, trong đó người chơi cố gắng ghi bàn bằng cách ném bóng bằng tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a game in which players hit a small ball against a wall with their hand",
                    "vi": "một trò chơi trong đó người chơi dùng tay đập một quả bóng nhỏ vào tường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the offence of touching the ball with your hands",
                    "vi": "vi phạm khi chạm vào bóng bằng tay của bạn"
                },
                "examples": [
                    {
                        "en": "a penalty for handball",
                        "vi": "một hình phạt cho bóng ném"
                    },
                    {
                        "en": "He was penalized for handball.",
                        "vi": "Anh ta bị phạt vì chơi bóng bằng tay."
                    }
                ]
            }
        ]
    },
    {
        "id": "93e30cdd0065435ba45d95424f27c748",
        "word": "head",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/hed/",
            "us": "/hed/"
        },
        "nearby": [
            {
                "word": "head",
                "pos": "noun"
            },
            {
                "word": "-head",
                "pos": "suffix"
            },
            {
                "word": "head",
                "pos": "verb"
            },
            {
                "word": "headache",
                "pos": "noun"
            },
            {
                "word": "Head and Shoulders",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move in a particular direction",
                    "vi": "để di chuyển theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "Where are we heading?",
                        "vi": "Chúng ta đang tiến về đâu?"
                    },
                    {
                        "en": "Where are you two headed?",
                        "vi": "Hai bạn đang đi đâu?"
                    },
                    {
                        "en": "Let's head back home.",
                        "vi": "Hãy trở về nhà."
                    },
                    {
                        "en": "They woke early and headed off for breakfast.",
                        "vi": "Họ thức dậy sớm và đi ăn sáng."
                    },
                    {
                        "en": "She headed for the door.",
                        "vi": "Cô ấy tiến ra cửa."
                    },
                    {
                        "en": "We headed north.",
                        "vi": "Chúng tôi đi về phía bắc."
                    },
                    {
                        "en": "Head towards the mall.",
                        "vi": "Đi về phía trung tâm mua sắm."
                    },
                    {
                        "en": "The boat was heading out to sea.",
                        "vi": "Con thuyền đang ra khơi."
                    },
                    {
                        "en": "(figurative) Can you forecast where the economy is heading?",
                        "vi": "(nghĩa bóng) Bạn có thể dự báo nền kinh tế đang đi tới đâu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or be in charge of something",
                    "vi": "lãnh đạo hoặc phụ trách một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She has been appointed to head the research team.",
                        "vi": "Cô ấy đã được chỉ định làm trưởng nhóm nghiên cứu."
                    },
                    {
                        "en": "to head a committee/delegation",
                        "vi": "đứng đầu một ủy ban / phái đoàn"
                    },
                    {
                        "en": "to head an investigation/inquiry",
                        "vi": "đứng đầu một cuộc điều tra / cuộc điều tra"
                    },
                    {
                        "en": "a terrorist group headed by a former army officer",
                        "vi": "một nhóm khủng bố do một cựu sĩ quan quân đội đứng đầu"
                    },
                    {
                        "en": "He heads up the bank's corporate arm.",
                        "vi": "Anh ấy đứng đầu chi nhánh công ty của ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be at the top of a list of names or at the front of a line of people",
                    "vi": "đứng đầu danh sách tên hoặc ở đầu dòng người"
                },
                "examples": [
                    {
                        "en": "Italy heads the table after two games.",
                        "vi": "Ý đứng đầu bảng sau hai trận."
                    },
                    {
                        "en": "Orlando, Florida, heads the list of most popular summer destinations.",
                        "vi": "Orlando, Florida, đứng đầu danh sách các điểm đến mùa hè nổi tiếng nhất."
                    },
                    {
                        "en": "to head a march/procession",
                        "vi": "đứng đầu một cuộc diễu hành / đám rước"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a word or words at the top of a page or section of a book as a title",
                    "vi": "để đặt một từ hoặc các từ ở đầu trang hoặc phần của sách làm tiêu đề"
                },
                "examples": [
                    {
                        "en": "be headed… The chapter was headed ‘My Early Life’.",
                        "vi": "đứng đầu… Chương này đứng đầu là “My Early Life”."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit a football with your head",
                    "vi": "đánh bóng bằng đầu của bạn"
                },
                "examples": [
                    {
                        "en": "Walsh headed the ball into an empty goal.",
                        "vi": "Walsh đánh đầu đưa bóng đi chệch khung thành trong gang tấc."
                    }
                ]
            }
        ]
    },
    {
        "id": "c962fd03b9a14d309cc06840865349ef",
        "word": "kick off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "kicking",
                "pos": "adjective"
            },
            {
                "word": "kicking",
                "pos": "noun"
            },
            {
                "word": "kick off",
                "pos": "phrasal verb"
            },
            {
                "word": "kick-off",
                "pos": "noun"
            },
            {
                "word": "kick out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a football (soccer) game or a team, etc. kicks off, the game starts",
                    "vi": "khi một trận bóng đá (bóng đá) hoặc một đội, v.v. bắt đầu, trò chơi bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly become angry or violent",
                    "vi": "đột nhiên trở nên tức giận hoặc bạo lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start",
                    "vi": "để bắt đầu"
                },
                "examples": [
                    {
                        "en": "What time shall we kick off?",
                        "vi": "Mấy giờ chúng ta sẽ bắt đầu?"
                    },
                    {
                        "en": "And then it all kicked off.",
                        "vi": "Và sau đó tất cả bắt đầu."
                    },
                    {
                        "en": "Tom will kick off with a few comments.",
                        "vi": "Tom sẽ bắt đầu với một vài nhận xét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something by kicking",
                    "vi": "để loại bỏ một cái gì đó bằng cách đá"
                },
                "examples": [
                    {
                        "en": "They dropped their bags in the front hall and kicked off their shoes.",
                        "vi": "Họ bỏ túi xách của họ ở sảnh trước và đá giày của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start a discussion, a meeting, an event, etc.",
                    "vi": "để bắt đầu một cuộc thảo luận, một cuộc họp, một sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "Who is going to kick off the discussion?",
                        "vi": "Ai sẽ bắt đầu cuộc thảo luận?"
                    }
                ]
            }
        ]
    },
    {
        "id": "5ce07c8641e2423c9f156acbe10c6844",
        "word": "knock-down",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnɒk daʊn/",
            "us": "/ˈnɑːk daʊn/"
        },
        "nearby": [
            {
                "word": "knob",
                "pos": "noun"
            },
            {
                "word": "knobbly",
                "pos": "adjective"
            },
            {
                "word": "knock-down",
                "pos": "noun"
            },
            {
                "word": "knock",
                "pos": "verb"
            },
            {
                "word": "knock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of falling to the ground after being hit",
                    "vi": "một hành động rơi xuống đất sau khi bị đánh"
                },
                "examples": [
                    {
                        "en": "He took a count of two after a 10th-round knock-down.",
                        "vi": "Anh ta đếm được hai sau một hiệp thứ 10 hạ gục."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting a high ball down to the ground or to another player",
                    "vi": "hành động đánh quả bóng cao xuống đất hoặc vào người chơi khác"
                },
                "examples": [
                    {
                        "en": "The striker's knock-down opened up an opportunity for a shot on goal.",
                        "vi": "Cú hạ gục của tiền đạo này đã mở ra cơ hội cho một cú sút trúng khung thành."
                    }
                ]
            }
        ]
    },
    {
        "id": "839d5506637948bba9ed95d56ec00b9a",
        "word": "offside",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒfˈsaɪd/",
            "us": "/ˌɔːfˈsaɪd/"
        },
        "nearby": [
            {
                "word": "offshore",
                "pos": "adverb"
            },
            {
                "word": "offshoring",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adjective"
            },
            {
                "word": "offside",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in some sports, for example football (soccer) and ice hockey, a player is offside if they are in a position, usually ahead of the ball, that is not allowed",
                    "vi": "trong một số môn thể thao, ví dụ như bóng đá (bóng đá) và khúc côn cầu trên băng, một cầu thủ việt vị nếu họ ở trong một vị trí, thường là trước quả bóng, điều đó không được phép"
                },
                "examples": [
                    {
                        "en": "He was offside when he scored.",
                        "vi": "Anh ấy đã việt vị khi ghi bàn."
                    },
                    {
                        "en": "the offside rule",
                        "vi": "luật việt vị"
                    }
                ]
            },
            {
                "define": {
                    "en": "on the side of a vehicle that is furthest from the edge of the road",
                    "vi": "ở bên một chiếc xe cách xa mép đường nhất"
                },
                "examples": [
                    {
                        "en": "the offside mirror",
                        "vi": "gương việt vị"
                    }
                ]
            }
        ]
    },
    {
        "id": "cec8aab960414f3a9b826df2fb2faf60",
        "word": "offside",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒfsaɪd/",
            "us": "/ˈɔːfsaɪd/"
        },
        "nearby": [
            {
                "word": "offshoring",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adjective"
            },
            {
                "word": "offside",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adverb"
            },
            {
                "word": "offsider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being offside in a game such as football (soccer) or ice hockey",
                    "vi": "thực tế là việt vị trong một trò chơi như bóng đá (bóng đá) hoặc khúc côn cầu trên băng"
                },
                "examples": [
                    {
                        "en": "The goal was disallowed for offside.",
                        "vi": "Mục tiêu không được phép vì việt vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a vehicle that is furthest from the edge of the road",
                    "vi": "mặt của một chiếc xe xa nhất từ mép đường"
                },
                "examples": [
                    {
                        "en": "The offside was damaged.",
                        "vi": "Lỗi việt vị đã bị hỏng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c929c269e3d243ac806d12dd0a340bd4",
        "word": "onside",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnˈsaɪd/",
            "us": "/ˌɑːnˈsaɪd/"
        },
        "nearby": [
            {
                "word": "onshore",
                "pos": "adjective"
            },
            {
                "word": "onshore",
                "pos": "adverb"
            },
            {
                "word": "onside",
                "pos": "adjective"
            },
            {
                "word": "onside",
                "pos": "adverb"
            },
            {
                "word": "onslaught",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in some sports, for example football (soccer) and ice hockey, a player who is onside is in a position where playing the ball or puck is allowed",
                    "vi": "trong một số môn thể thao, chẳng hạn như bóng đá (bóng đá) và khúc côn cầu trên băng, một cầu thủ đang thi đấu ở vị trí được phép chơi bóng hoặc đánh bóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get/keep somebody’s support",
                    "vi": "để có được / giữ sự ủng hộ của ai đó"
                },
                "examples": [
                    {
                        "en": "The party needs to keep the major national newspapers onside if it's going to win the next election.",
                        "vi": "Đảng cần phải cập nhật các tờ báo lớn của quốc gia nếu họ giành chiến thắng trong cuộc bầu cử tiếp theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "f379773a52a74a23bfc30e27b3db3a5c",
        "word": "onside",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnˈsaɪd/",
            "us": "/ˌɑːnˈsaɪd/"
        },
        "nearby": [
            {
                "word": "onshore",
                "pos": "adverb"
            },
            {
                "word": "onside",
                "pos": "adjective"
            },
            {
                "word": "onside",
                "pos": "adverb"
            },
            {
                "word": "onslaught",
                "pos": "noun"
            },
            {
                "word": "onstage",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a position where playing the ball or puck is allowed",
                    "vi": "ở vị trí cho phép chơi bóng hoặc chọc khe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf8dd2b74c234eedb821d967114b8b29",
        "word": "penalty spot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpenəlti spɒt/",
            "us": "/ˈpenəlti spɑːt/"
        },
        "nearby": [
            {
                "word": "penalty point",
                "pos": "noun"
            },
            {
                "word": "penalty shoot-out",
                "pos": "noun"
            },
            {
                "word": "penalty spot",
                "pos": "noun"
            },
            {
                "word": "penance",
                "pos": "noun"
            },
            {
                "word": "pen-and-ink",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the point on the pitch from which a player takes a penalty",
                    "vi": "điểm trên sân mà một cầu thủ thực hiện quả phạt đền"
                },
                "examples": [
                    {
                        "en": "Raúl García scored from the penalty spot after he was fouled by Sergio Ramos.",
                        "vi": "Raúl García ghi bàn từ chấm phạt đền sau khi anh bị Sergio Ramos phạm lỗi."
                    }
                ]
            }
        ]
    },
    {
        "id": "d63fb8b94a2841aaaf2c889beeccd46d",
        "word": "pool",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/puːl/",
            "us": "/puːl/"
        },
        "nearby": [
            {
                "word": "pooh-pooh",
                "pos": "verb"
            },
            {
                "word": "Poohsticks",
                "pos": "noun"
            },
            {
                "word": "pool",
                "pos": "noun"
            },
            {
                "word": "pool",
                "pos": "verb"
            },
            {
                "word": "Poole",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of water that has been created for people to swim in",
                    "vi": "một vùng nước đã được tạo ra để mọi người bơi vào"
                },
                "examples": [
                    {
                        "en": "an indoor/outdoor pool",
                        "vi": "một hồ bơi trong nhà / ngoài trời"
                    },
                    {
                        "en": "Does the hotel have a pool?",
                        "vi": "Khách sạn có hồ bơi không?"
                    },
                    {
                        "en": "relaxing by the pool",
                        "vi": "thư giãn bên hồ bơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the building that contains a public pool",
                    "vi": "tòa nhà có một hồ bơi công cộng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small area of still water, especially one that has formed naturally",
                    "vi": "một vùng nước tĩnh nhỏ, đặc biệt là vùng nước đã hình thành tự nhiên"
                },
                "examples": [
                    {
                        "en": "freshwater/thermal pools",
                        "vi": "hồ bơi nước ngọt / nước nóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of liquid or light lying on a surface",
                    "vi": "một lượng nhỏ chất lỏng hoặc ánh sáng nằm trên bề mặt"
                },
                "examples": [
                    {
                        "en": "pool of something The body was lying in a pool of blood.",
                        "vi": "vũng máu. Cái xác nằm trong vũng máu."
                    },
                    {
                        "en": "a pool of light",
                        "vi": "một hồ bơi ánh sáng"
                    },
                    {
                        "en": "The water ran down out of their clothes and formed a pool on floor.",
                        "vi": "Nước chảy xuống quần áo của họ và tạo thành một hồ bơi trên sàn nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a supply of things or money that is shared by a group of people and can be used when needed",
                    "vi": "nguồn cung cấp đồ vật hoặc tiền bạc được chia sẻ bởi một nhóm người và có thể được sử dụng khi cần"
                },
                "examples": [
                    {
                        "en": "a pool of cars used by the firm’s sales force",
                        "vi": "một nhóm xe hơi được sử dụng bởi lực lượng bán hàng của công ty"
                    },
                    {
                        "en": "a pool car",
                        "vi": "một chiếc xe hồ bơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people available for work when needed",
                    "vi": "một nhóm người sẵn sàng làm việc khi cần thiết"
                },
                "examples": [
                    {
                        "en": "a pool of cheap labour",
                        "vi": "một nhóm lao động giá rẻ"
                    },
                    {
                        "en": "I started my career in the typing pool (= a group of people who shared a company’s typing work) over 40 years ago.",
                        "vi": "Tôi bắt đầu sự nghiệp của mình trong nhóm đánh máy (= một nhóm người chia sẻ công việc đánh máy của một công ty) hơn 40 năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game for two people played with 16 balls on a table, often in pubs and bars. Players use cues (= long sticks) to try to hit the balls into pockets at the edge of the table.",
                    "vi": "một trò chơi dành cho hai người chơi với 16 quả bóng trên bàn, thường ở các quán rượu và quán bar. Người chơi sử dụng các gợi ý (= gậy dài) để cố gắng đánh bóng vào túi ở mép bàn."
                },
                "examples": [
                    {
                        "en": "a pool table",
                        "vi": "một bàn bi-a"
                    },
                    {
                        "en": "to shoot (= play) pool",
                        "vi": "bắn (= chơi) hồ bơi"
                    },
                    {
                        "en": "Do you play pool?",
                        "vi": "Bạn có chơi bi-a không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a form of gambling in the UK in which people try to win money by saying what the results of football matches will be",
                    "vi": "một hình thức đánh bạc ở Vương quốc Anh trong đó mọi người cố gắng thắng tiền bằng cách nói kết quả của các trận đấu bóng đá sẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "He does the pools every week.",
                        "vi": "Anh ấy làm hồ bơi mỗi tuần."
                    },
                    {
                        "en": "a pools winner",
                        "vi": "một người chiến thắng hồ bơi"
                    }
                ]
            }
        ]
    },
    {
        "id": "d1976a4889ae4c8b8ea0f264444528e3",
        "word": "premiership",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpremiəʃɪp/",
            "us": "/prɪˈmɪrʃɪp/"
        },
        "nearby": [
            {
                "word": "premiere",
                "pos": "verb"
            },
            {
                "word": "the Premier League",
                "pos": "noun"
            },
            {
                "word": "premiership",
                "pos": "noun"
            },
            {
                "word": "premise",
                "pos": "noun"
            },
            {
                "word": "premised",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the period or position of being prime minister",
                    "vi": "thời kỳ hoặc vị trí thủ tướng"
                },
                "examples": [
                    {
                        "en": "during Theresa May's premiership",
                        "vi": "trong nhiệm kỳ thủ tướng của Theresa May"
                    }
                ]
            },
            {
                "define": {
                    "en": "the former name for the football league in England and Wales that has the best teams in it, now called the Premier League",
                    "vi": "tên cũ của giải đấu bóng đá ở Anh và xứ Wales có các đội mạnh nhất trong đó, bây giờ được gọi là Premier League"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a professional league for the best Rugby Union teams in England",
                    "vi": "một giải đấu chuyên nghiệp dành cho các đội Rugby Union tốt nhất ở Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c24d0e05413744eebfbd3c1f9f7ac30a",
        "word": "relegate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrelɪɡeɪt/",
            "us": "/ˈrelɪɡeɪt/"
        },
        "nearby": [
            {
                "word": "release",
                "pos": "noun"
            },
            {
                "word": "release candidate",
                "pos": "noun"
            },
            {
                "word": "relegate",
                "pos": "verb"
            },
            {
                "word": "relegation",
                "pos": "noun"
            },
            {
                "word": "relent",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody a lower or less important position, rank, etc. than before",
                    "vi": "để cung cấp cho ai đó một vị trí, cấp bậc, v.v. thấp hơn hoặc ít quan trọng hơn trước đây"
                },
                "examples": [
                    {
                        "en": "She was then relegated to the role of assistant.",
                        "vi": "Sau đó cô ấy bị hạ xuống vai trò trợ lý."
                    },
                    {
                        "en": "He relegated the incident to the back of his mind.",
                        "vi": "Anh ta giải thích sự việc trong tâm trí của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move a sports team from playing with one group of teams to playing in a lower group",
                    "vi": "để chuyển một đội thể thao từ chơi với một nhóm đội sang chơi ở một nhóm thấp hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "362d7a3472664832962a47cf5e0b9502",
        "word": "spot kick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspɒt kɪk/",
            "us": "/ˈspɑːt kɪk/"
        },
        "nearby": [
            {
                "word": "spot check",
                "pos": "noun"
            },
            {
                "word": "spot-fixing",
                "pos": "noun"
            },
            {
                "word": "spot kick",
                "pos": "noun"
            },
            {
                "word": "spotless",
                "pos": "adjective"
            },
            {
                "word": "spotlessly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kick that is taken as a penalty in the game of football (soccer)",
                    "vi": "một cú đá được thực hiện như một quả phạt đền trong trò chơi bóng đá (bóng đá)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47f9ab53aa4d4a5596d723c78e6e8dab",
        "word": "striker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstraɪkə(r)/",
            "us": "/ˈstraɪkər/"
        },
        "nearby": [
            {
                "word": "strike out",
                "pos": "phrasal verb"
            },
            {
                "word": "strikeout",
                "pos": "noun"
            },
            {
                "word": "striker",
                "pos": "noun"
            },
            {
                "word": "strike rate",
                "pos": "noun"
            },
            {
                "word": "strike through",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a worker who has stopped working because of argument over pay or conditions",
                    "vi": "một công nhân đã ngừng làm việc vì tranh cãi về tiền lương hoặc các điều kiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a player whose main job is to attack and try to score goals",
                    "vi": "một cầu thủ có công việc chính là tấn công và cố gắng ghi bàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4cb35003e07647b89f79561b4e984bee",
        "word": "sweeper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈswiːpə(r)/",
            "us": "/ˈswiːpər/"
        },
        "nearby": [
            {
                "word": "sweep aside",
                "pos": "phrasal verb"
            },
            {
                "word": "sweep away",
                "pos": "phrasal verb"
            },
            {
                "word": "sweeper",
                "pos": "noun"
            },
            {
                "word": "sweeping",
                "pos": "adjective"
            },
            {
                "word": "sweep out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to sweep something",
                    "vi": "một người có công việc là quét một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a road sweeper",
                        "vi": "một người quét đường"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that sweeps something",
                    "vi": "một thứ quét cái gì đó"
                },
                "examples": [
                    {
                        "en": "a carpet sweeper",
                        "vi": "một người quét thảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a player who plays behind the other defending players in order to try and stop anyone who passes them",
                    "vi": "một cầu thủ chơi phía sau các cầu thủ phòng ngự khác để cố gắng ngăn chặn bất kỳ ai vượt qua họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a37686e404f4fa59062f27ec74a8bfd",
        "word": "terrace",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈterəs/",
            "us": "/ˈterəs/"
        },
        "nearby": [
            {
                "word": "ternary form",
                "pos": "noun"
            },
            {
                "word": "terpsichorean",
                "pos": "adjective"
            },
            {
                "word": "terrace",
                "pos": "noun"
            },
            {
                "word": "terraced",
                "pos": "adjective"
            },
            {
                "word": "terraced house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a continuous row of similar houses that are joined together in one block",
                    "vi": "một dãy nhà giống nhau liên tục được nối với nhau trong một khối"
                },
                "examples": [
                    {
                        "en": "12 Albert Terrace",
                        "vi": "12 Albert Terrace"
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat, hard area, especially outside a house or restaurant, where you can sit, eat and enjoy the sun",
                    "vi": "một khu vực bằng phẳng, cứng, đặc biệt là bên ngoài một ngôi nhà hoặc nhà hàng, nơi bạn có thể ngồi, ăn và tận hưởng ánh nắng mặt trời"
                },
                "examples": [
                    {
                        "en": "Close to the villa is a big pool with a sun terrace around it.",
                        "vi": "Gần biệt thự là một hồ bơi lớn với sân hiên tắm nắng xung quanh."
                    },
                    {
                        "en": "The view from the roof terrace is spectacular.",
                        "vi": "Khung cảnh từ sân thượng thật ngoạn mục."
                    },
                    {
                        "en": "All rooms have a balcony or terrace.",
                        "vi": "Tất cả các phòng đều có ban công hoặc sân hiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the wide steps where people can stand to watch the game",
                    "vi": "những bậc thang rộng, nơi mọi người có thể đứng xem trận đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of a series of flat areas of ground that are cut into the side of a hill like steps so that crops can be grown there",
                    "vi": "một trong một loạt các khu đất bằng phẳng được khoét vào sườn đồi giống như các bậc thang để có thể trồng trọt ở đó"
                },
                "examples": [
                    {
                        "en": "The villagers had dug terraces in the hillside.",
                        "vi": "Dân làng đã đào ruộng bậc thang trên sườn đồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "ecca0110174e4a15b314a464c6686d2f",
        "word": "wing back",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪŋ bæk/",
            "us": "/ˈwɪŋ bæk/"
        },
        "nearby": [
            {
                "word": "wing",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "verb"
            },
            {
                "word": "wing back",
                "pos": "noun"
            },
            {
                "word": "wing chair",
                "pos": "noun"
            },
            {
                "word": "wing collar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player who plays near the edge of the field and who both attacks and defends",
                    "vi": "một cầu thủ chơi gần mép sân, vừa tấn công vừa phòng thủ"
                },
                "examples": []
            }
        ]
    }
]