[
    {
        "id": "a4119d4a4572448795fc57d776aed9fb",
        "word": "grow",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡrəʊ/",
            "us": "/ɡrəʊ/"
        },
        "nearby": [
            {
                "word": "grovel",
                "pos": "verb"
            },
            {
                "word": "grovelling",
                "pos": "adjective"
            },
            {
                "word": "grow",
                "pos": "verb"
            },
            {
                "word": "grow apart",
                "pos": "phrasal verb"
            },
            {
                "word": "grow away from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to increase in size, number, strength or quality",
                    "vi": "để tăng kích thước, số lượng, sức mạnh hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "The sector is growing at a phenomenal rate.",
                        "vi": "Lĩnh vực này đang phát triển với tốc độ phi thường."
                    },
                    {
                        "en": "The performance improved as their confidence grew.",
                        "vi": "Hiệu suất được cải thiện khi sự tự tin của họ tăng lên."
                    },
                    {
                        "en": "Opposition to the latest proposals is growing steadily.",
                        "vi": "Sự phản đối các đề xuất mới nhất đang tăng lên một cách đều đặn."
                    },
                    {
                        "en": "The market is growing rapidly.",
                        "vi": "Thị trường đang phát triển nhanh chóng."
                    },
                    {
                        "en": "Sales are growing fast.",
                        "vi": "Doanh số bán hàng đang tăng nhanh."
                    },
                    {
                        "en": "The business has grown exponentially over the past ten years.",
                        "vi": "Việc kinh doanh đã phát triển theo cấp số nhân trong mười năm qua."
                    },
                    {
                        "en": "Fears are growing for the safety of a teenager who disappeared a week ago.",
                        "vi": "Nỗi sợ hãi ngày càng lớn đối với sự an toàn của một thiếu niên đã mất tích một tuần trước."
                    },
                    {
                        "en": "grow by something The economy is growing by roughly 2 per cent a year.",
                        "vi": "tăng trưởng bởi cái gì đó Nền kinh tế đang tăng trưởng khoảng 2% một năm."
                    },
                    {
                        "en": "The company profits grew by 5 per cent last year.",
                        "vi": "Lợi nhuận của công ty đã tăng 5% trong năm ngoái."
                    },
                    {
                        "en": "grow in something The family has grown in size recently.",
                        "vi": "phát triển trong một cái gì đó Gia đình đã phát triển về quy mô gần đây."
                    },
                    {
                        "en": "This approach is growing in popularity.",
                        "vi": "Cách tiếp cận này đang ngày càng phổ biến."
                    },
                    {
                        "en": "She is growing in confidence all the time.",
                        "vi": "Cô ấy ngày càng tự tin hơn mọi lúc."
                    },
                    {
                        "en": "grow from something Her media empire grew from quite small beginnings.",
                        "vi": "phát triển từ một cái gì đó Đế chế truyền thông của cô ấy phát triển từ những ngày đầu còn khá nhỏ."
                    },
                    {
                        "en": "grow to something That number will grow to two billion users in 2025.",
                        "vi": "phát triển thành một thứ gì đó Con số đó sẽ tăng lên hai tỷ người dùng vào năm 2025."
                    },
                    {
                        "en": "grow from something to something The city's population has grown from about 50 000 to over a million in 20 years.",
                        "vi": "phát triển từ thứ gì đó thành thứ gì đó Dân số của thành phố đã tăng từ khoảng 50.000 người lên hơn một triệu người trong 20 năm."
                    },
                    {
                        "en": "+ adj. to grow larger/stronger",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The company is growing bigger all the time.",
                        "vi": "Công ty đang phát triển lớn mạnh hơn mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become bigger or taller and develop into an adult",
                    "vi": "trở nên lớn hơn hoặc cao hơn và phát triển thành người lớn"
                },
                "examples": [
                    {
                        "en": "You've grown since the last time I saw you!",
                        "vi": "Bạn đã trưởng thành kể từ lần cuối cùng tôi nhìn thấy bạn!"
                    },
                    {
                        "en": "The puppies grow quickly during the first six months.",
                        "vi": "Những chú chó con phát triển nhanh chóng trong sáu tháng đầu tiên."
                    },
                    {
                        "en": "+ noun Nick's grown almost an inch in the last month.",
                        "vi": "danh từ Nick đã tăng gần một inch trong tháng trước."
                    },
                    {
                        "en": "+ adj. to grow bigger/taller/older",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to exist and develop in a particular place; to make plants grow",
                    "vi": "để tồn tại và phát triển ở một nơi cụ thể; để làm cho cây cối phát triển"
                },
                "examples": [
                    {
                        "en": "The region is too dry for plants to grow.",
                        "vi": "Khu vực này quá khô để thực vật phát triển."
                    },
                    {
                        "en": "Tomatoes grow best in direct sunlight.",
                        "vi": "Cà chua phát triển tốt nhất dưới ánh nắng trực tiếp."
                    },
                    {
                        "en": "grow to something These roses grow to a height of 6 feet.",
                        "vi": "phát triển đến một cái gì đó Những bông hồng này phát triển đến chiều cao 6 feet."
                    },
                    {
                        "en": "grow from something This is a tree that grows well from cuttings.",
                        "vi": "mọc từ cái gì Đây là cây phát triển tốt từ giâm cành."
                    },
                    {
                        "en": "grow something The land is used to grow crops.",
                        "vi": "trồng cái gì đó Đất được sử dụng để trồng trọt."
                    },
                    {
                        "en": "We need to grow our food more efficiently.",
                        "vi": "Chúng ta cần trồng thực phẩm hiệu quả hơn."
                    },
                    {
                        "en": "I didn't know they grew rice in France.",
                        "vi": "Tôi không biết họ trồng lúa ở Pháp."
                    },
                    {
                        "en": "The plants were grown in controlled conditions.",
                        "vi": "Các cây được trồng trong điều kiện có kiểm soát."
                    },
                    {
                        "en": "grow something from something I grew all these flowers from one packet of seeds.",
                        "vi": "trồng một cái gì đó từ một cái gì đó Tôi đã trồng tất cả những bông hoa này từ một gói hạt giống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become longer; to allow something to become longer by not cutting it",
                    "vi": "trở nên dài hơn; để cho phép một cái gì đó trở nên dài hơn bằng cách không cắt nó"
                },
                "examples": [
                    {
                        "en": "I've decided to let my hair grow.",
                        "vi": "Tôi đã quyết định để tóc của mình phát triển."
                    },
                    {
                        "en": "grow something I've decided to grow my hair.",
                        "vi": "phát triển một cái gì đó Tôi đã quyết định để phát triển tóc của tôi."
                    },
                    {
                        "en": "I didn't recognize him—he's grown a beard.",
                        "vi": "Tôi không nhận ra anh ta - anh ta mọc râu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have a particular quality or feeling over a period of time",
                    "vi": "bắt đầu có chất lượng hoặc cảm giác cụ thể trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "He had grown old and fat.",
                        "vi": "Anh ấy đã già đi và béo lên."
                    },
                    {
                        "en": "They were growing tired of her unreasonable behaviour.",
                        "vi": "Họ ngày càng mệt mỏi vì hành vi vô lý của cô ấy."
                    },
                    {
                        "en": "My eyes soon grew accustomed to the darkness.",
                        "vi": "Đôi mắt của tôi đã sớm quen với bóng tối."
                    },
                    {
                        "en": "Mark and Jenny were growing closer every day.",
                        "vi": "Mark và Jenny ngày càng thân thiết hơn."
                    },
                    {
                        "en": "As time went on he grew more and more impatient.",
                        "vi": "Thời gian trôi qua anh ấy càng ngày càng mất kiên nhẫn."
                    },
                    {
                        "en": "The skies grew dark and it began to rain.",
                        "vi": "Bầu trời tối dần và trời bắt đầu mưa."
                    },
                    {
                        "en": "She grew braver with time.",
                        "vi": "Cô ấy trở nên dũng cảm hơn theo thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gradually begin to do something",
                    "vi": "dần dần bắt đầu làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'm sure you'll grow to like her in time.",
                        "vi": "Tôi chắc rằng bạn sẽ thích cô ấy theo thời gian."
                    },
                    {
                        "en": "He grew to understand her reasons for leaving.",
                        "vi": "Anh càng ngày càng hiểu lý do ra đi của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop and improve particular qualities or skills",
                    "vi": "để phát triển và cải thiện các phẩm chất hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "She continues to grow as an artist.",
                        "vi": "Cô ấy tiếp tục phát triển như một nghệ sĩ."
                    },
                    {
                        "en": "A secure background will help a child to grow emotionally.",
                        "vi": "Một nền tảng vững chắc sẽ giúp một đứa trẻ phát triển về mặt tình cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the size, quality or number of something",
                    "vi": "để tăng kích thước, chất lượng hoặc số lượng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "We are trying to grow the business.",
                        "vi": "Chúng tôi đang cố gắng phát triển doanh nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something large and successful often begins in a very small way",
                    "vi": "một cái gì đó lớn và thành công thường bắt đầu từ một cách rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody not to use something or spend money carelessly because you do not have a lot of it",
                    "vi": "được sử dụng để nói với ai đó không sử dụng một cái gì đó hoặc tiêu tiền một cách bất cẩn bởi vì bạn không có nhiều tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not delay in getting things done",
                    "vi": "để không bị trì hoãn trong việc hoàn thành công việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d593a4915d234ca39f350eb9e051f945",
        "word": "fall",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/fɔːl/",
            "us": "/fɔːl/"
        },
        "nearby": [
            {
                "word": "the Falkland Islands",
                "pos": ""
            },
            {
                "word": "the Falklands War",
                "pos": ""
            },
            {
                "word": "fall",
                "pos": "verb"
            },
            {
                "word": "fall",
                "pos": "noun"
            },
            {
                "word": "fall about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to drop down from a higher level to a lower level",
                    "vi": "để giảm từ cấp cao hơn xuống cấp thấp hơn"
                },
                "examples": [
                    {
                        "en": "The rain was falling steadily.",
                        "vi": "Mưa rơi đều đều."
                    },
                    {
                        "en": "They were injured by falling rocks.",
                        "vi": "Họ bị thương do đá rơi xuống."
                    },
                    {
                        "en": "fall + adv./prep. Several of the books had fallen onto the floor.",
                        "vi": "ngã + adv./prep. Một số cuốn sách đã rơi xuống sàn."
                    },
                    {
                        "en": "The label must have fallen off.",
                        "vi": "Nhãn chắc hẳn đã bị rơi ra."
                    },
                    {
                        "en": "The leaves were falling from the trees.",
                        "vi": "Những chiếc lá rơi khỏi cây."
                    },
                    {
                        "en": "The seeds fall to the ground and germinate.",
                        "vi": "Hạt rơi xuống đất và nảy mầm."
                    },
                    {
                        "en": "One of the kids fell into the river.",
                        "vi": "Một trong những đứa trẻ bị rơi xuống sông."
                    },
                    {
                        "en": "+ noun He fell 20 metres onto the rocks below.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly stop standing",
                    "vi": "đột ngột ngừng đứng"
                },
                "examples": [
                    {
                        "en": "She slipped on the ice and fell.",
                        "vi": "Cô ấy trượt chân trên mặt băng và ngã xuống."
                    },
                    {
                        "en": "A tree fell, just missing his car.",
                        "vi": "Một cái cây bị ngã, chỉ thiếu xe của anh ta."
                    },
                    {
                        "en": "fall + adv./prep. I fell over and cut my knee.",
                        "vi": "ngã + adv./prep. Tôi bị ngã và bị cắt đầu gối."
                    },
                    {
                        "en": "The house looked as if it was about to fall down.",
                        "vi": "Căn nhà trông như sắp đổ sập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decrease in amount, number or strength",
                    "vi": "để giảm số lượng, số lượng hoặc sức mạnh"
                },
                "examples": [
                    {
                        "en": "Prices continued to fall on the stock market today.",
                        "vi": "Giá tiếp tục giảm trên thị trường chứng khoán hôm nay."
                    },
                    {
                        "en": "The temperature fell sharply in the night.",
                        "vi": "Nhiệt độ giảm mạnh trong đêm."
                    },
                    {
                        "en": "Falling birth rates could have an impact on future economic growth.",
                        "vi": "Tỷ lệ sinh giảm có thể có tác động đến tăng trưởng kinh tế trong tương lai."
                    },
                    {
                        "en": "Reputations rise and fall for a variety of reasons.",
                        "vi": "Danh tiếng lên xuống vì nhiều lý do."
                    },
                    {
                        "en": "fall by something Their profits have fallen by 30 per cent.",
                        "vi": "giảm bởi cái gì đó Lợi nhuận của họ đã giảm 30%."
                    },
                    {
                        "en": "fall + noun Share prices fell 30p.",
                        "vi": "Fall + danh từ Giá cổ phiếu giảm 30p."
                    },
                    {
                        "en": "Petroleum sales fell almost 11 per cent.",
                        "vi": "Doanh số bán xăng dầu giảm gần 11%."
                    },
                    {
                        "en": "fall against something The dollar fell slightly against the yen.",
                        "vi": "giảm so với một cái gì đó Đồng đô la giảm nhẹ so với đồng yên."
                    },
                    {
                        "en": "fall to something Her voice fell to a whisper.",
                        "vi": "rơi xuống thứ gì đó Giọng cô ấy rơi xuống thì thầm."
                    },
                    {
                        "en": "Unemployment fell to its lowest level in 30 years.",
                        "vi": "Tỷ lệ thất nghiệp giảm xuống mức thấp nhất trong 30 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass into a particular state; to begin to be something",
                    "vi": "để chuyển vào một trạng thái cụ thể; bắt đầu trở thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "fall + adj. He had fallen asleep on the sofa.",
                        "vi": "mùa thu + adj. Anh đã ngủ quên trên ghế sofa."
                    },
                    {
                        "en": "She fell ill soon after and did not recover.",
                        "vi": "Cô ấy đổ bệnh ngay sau đó và không hồi phục."
                    },
                    {
                        "en": "The room had fallen silent.",
                        "vi": "Căn phòng im lặng."
                    },
                    {
                        "en": "When the rent fell due, she couldn't pay.",
                        "vi": "Khi tiền thuê đến hạn, cô ấy không thể trả."
                    },
                    {
                        "en": "The book fell open at a page of illustrations.",
                        "vi": "Cuốn sách mở ra ở một trang minh họa."
                    },
                    {
                        "en": "fall into something I had fallen into conversation with a man on the train.",
                        "vi": "rơi vào một cái gì đó mà tôi đã rơi vào cuộc trò chuyện với một người đàn ông trên tàu."
                    },
                    {
                        "en": "The house had fallen into disrepair.",
                        "vi": "Ngôi nhà đã rơi vào tình trạng hư hỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hang down",
                    "vi": "treo xuống"
                },
                "examples": [
                    {
                        "en": "Her hair fell over her shoulders in a mass of curls.",
                        "vi": "Tóc cô ấy xõa qua vai thành một lọn to."
                    }
                ]
            },
            {
                "define": {
                    "en": "to slope downwards",
                    "vi": "dốc xuống"
                },
                "examples": [
                    {
                        "en": "The land falls away sharply towards the river.",
                        "vi": "Đất lùi hẳn về phía sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be defeated or captured",
                    "vi": "bị đánh bại hoặc bị bắt"
                },
                "examples": [
                    {
                        "en": "The coup failed but the government fell shortly afterwards.",
                        "vi": "Cuộc đảo chính thất bại nhưng chính phủ thất bại ngay sau đó."
                    },
                    {
                        "en": "fall to somebody Troy finally fell to the Greeks.",
                        "vi": "rơi vào tay ai đó Cuối cùng thành Troy cũng rơi vào tay quân Hy Lạp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die in battle; to be shot",
                    "vi": "chết trong trận chiến; bị bắn"
                },
                "examples": [
                    {
                        "en": "a memorial to those who fell in the two world wars",
                        "vi": "một đài tưởng niệm những người đã ngã xuống trong hai cuộc chiến tranh thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "to come quickly and suddenly",
                    "vi": "đến nhanh chóng và đột ngột"
                },
                "examples": [
                    {
                        "en": "A sudden silence fell.",
                        "vi": "Một khoảng lặng đột ngột ập xuống."
                    },
                    {
                        "en": "Darkness falls quickly in the tropics.",
                        "vi": "Bóng tối giảm nhanh chóng ở vùng nhiệt đới."
                    },
                    {
                        "en": "fall on somebody/something An expectant hush fell on the guests.",
                        "vi": "rơi vào ai đó / cái gì đó Một sự im lặng mong đợi rơi vào những vị khách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen or take place",
                    "vi": "xảy ra hoặc diễn ra"
                },
                "examples": [
                    {
                        "en": "My birthday falls on a Monday this year.",
                        "vi": "Sinh nhật của tôi rơi vào thứ Hai năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move in a particular direction or come in a particular position",
                    "vi": "để di chuyển theo một hướng cụ thể hoặc đến một vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "My eye fell on (= I suddenly saw) a curious object.",
                        "vi": "Mắt tôi rơi vào (= Tôi đột nhiên nhìn thấy) một vật thể tò mò."
                    },
                    {
                        "en": "Which syllable does the stress fall on?",
                        "vi": "Trọng âm rơi vào âm tiết nào?"
                    },
                    {
                        "en": "A shadow fell across her face.",
                        "vi": "Một bóng đen đổ xuống khuôn mặt cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to belong to a particular class, group or area of responsibility",
                    "vi": "thuộc về một lớp, nhóm hoặc lĩnh vực trách nhiệm cụ thể"
                },
                "examples": [
                    {
                        "en": "Out of over 400 staff there are just seven that fall into this category.",
                        "vi": "Trong số hơn 400 nhân viên, chỉ có bảy người thuộc loại này."
                    },
                    {
                        "en": "This case falls outside my jurisdiction.",
                        "vi": "Trường hợp này nằm ngoài thẩm quyền của tôi."
                    },
                    {
                        "en": "This falls under the heading of scientific research.",
                        "vi": "Điều này thuộc nhóm nghiên cứu khoa học."
                    }
                ]
            }
        ]
    },
    {
        "id": "c1fb41dc36dc4536899fb3d3eb8acc65",
        "word": "go down",
        "pos": "phrasal verb",
        "level": "a2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "god-man",
                "pos": "noun"
            },
            {
                "word": "godmother",
                "pos": "noun"
            },
            {
                "word": "go down",
                "pos": "phrasal verb"
            },
            {
                "word": "godown",
                "pos": "noun"
            },
            {
                "word": "go down with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the price of something, the temperature, etc. goes down, it becomes lower",
                    "vi": "nếu giá của một thứ gì đó, nhiệt độ, v.v. giảm xuống, nó sẽ trở nên thấp hơn"
                },
                "examples": [
                    {
                        "en": "The price of oil is going down.",
                        "vi": "Giá dầu đang giảm."
                    },
                    {
                        "en": "Oil is going down in price.",
                        "vi": "Dầu đang giảm giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall to the ground",
                    "vi": "rơi xuống đất"
                },
                "examples": [
                    {
                        "en": "She tripped and went down with a bump.",
                        "vi": "Cô ấy đã vấp ngã và đi xuống với một vết sưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a ship, etc. goes down, it disappears below the water",
                    "vi": "nếu một con tàu, v.v. bị chìm, nó sẽ biến mất dưới mặt nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when the sun or moon goes down, it disappears below the horizon",
                    "vi": "khi mặt trời hoặc mặt trăng lặn, nó biến mất bên dưới đường chân trời"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if food or drink will/will not go down, it is easy/difficult to swallow",
                    "vi": "nếu thức ăn hoặc thức uống sẽ / không giảm xuống, rất dễ / khó nuốt"
                },
                "examples": [
                    {
                        "en": "A glass of wine would go down very nicely (= I would very much like one).",
                        "vi": "Một ly rượu vang sẽ rất ngon (= Tôi rất thích một ly)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get worse in quality",
                    "vi": "để trở nên tồi tệ hơn về chất lượng"
                },
                "examples": [
                    {
                        "en": "The neighbourhood has gone down a lot recently.",
                        "vi": "Khu phố đã đi xuống rất nhiều gần đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop working temporarily",
                    "vi": "tạm thời ngừng làm việc"
                },
                "examples": [
                    {
                        "en": "The system is going down in ten minutes.",
                        "vi": "Hệ thống sẽ ngừng hoạt động trong 10 phút nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen",
                    "vi": "xảy ra"
                },
                "examples": [
                    {
                        "en": "You really don't know what's going down?",
                        "vi": "Bạn thực sự không biết những gì đang xảy ra?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be sent to prison",
                    "vi": "bị đưa đến nhà tù"
                },
                "examples": [
                    {
                        "en": "She went down for ten years.",
                        "vi": "Cô ấy đã đi xuống trong mười năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a university, especially Oxford or Cambridge, at the end of a term or after finishing your studies",
                    "vi": "rời khỏi một trường đại học, đặc biệt là Oxford hoặc Cambridge, vào cuối kỳ học hoặc sau khi học xong"
                },
                "examples": [
                    {
                        "en": "She went down (from Cambridge) in 2018.",
                        "vi": "Cô ấy đã đi xuống (từ Cambridge) vào năm 2018."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be written in something; to be recorded or remembered in something",
                    "vi": "được viết bằng một thứ gì đó; được ghi lại hoặc ghi nhớ trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It all goes down (= she writes it all) in her notebook.",
                        "vi": "Tất cả ghi xuống (= cô ấy viết tất cả) vào sổ tay của cô ấy."
                    },
                    {
                        "en": "He will go down in history as a great statesman.",
                        "vi": "Ông sẽ đi vào lịch sử với tư cách là một chính khách vĩ đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform oral sex on somebody (= to use the mouth to give somebody sexual pleasure)",
                    "vi": "để thực hiện quan hệ tình dục bằng miệng với ai đó (= sử dụng miệng để mang lại cho ai đó khoái cảm tình dục)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be defeated by somebody, especially in a game or competition",
                    "vi": "bị ai đó đánh bại, đặc biệt là trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "Italy went down to Brazil by three goals to one.",
                        "vi": "Ý đã hạ Brazil với cách biệt ba bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go from one place to another, especially further south or from a city or large town to a smaller place",
                    "vi": "để đi từ nơi này đến nơi khác, đặc biệt là xa hơn về phía nam hoặc từ một thành phố hoặc thị trấn lớn đến một nơi nhỏ hơn"
                },
                "examples": [
                    {
                        "en": "They've gone down to Brighton for a couple of days.",
                        "vi": "Họ đã đến Brighton trong một vài ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be received in a particular way by somebody",
                    "vi": "được ai đó đón nhận theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "The suggestion didn't go down very well with her boss.",
                        "vi": "Đề xuất không được lòng sếp cho lắm."
                    },
                    {
                        "en": "The novel went down well with the public.",
                        "vi": "Cuốn tiểu thuyết đã đi xuống tốt với công chúng."
                    }
                ]
            }
        ]
    },
    {
        "id": "726af9ac6a294a478897bf04864bb8cf",
        "word": "go up",
        "pos": "phrasal verb",
        "level": "a2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "Stephen Jay Gould",
                "pos": ""
            },
            {
                "word": "go under",
                "pos": "phrasal verb"
            },
            {
                "word": "go up",
                "pos": "phrasal verb"
            },
            {
                "word": "gourd",
                "pos": "noun"
            },
            {
                "word": "gourmand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the price of something, the temperature, etc. goes up, it becomes higher",
                    "vi": "nếu giá của một thứ gì đó, nhiệt độ, v.v. tăng lên, nó sẽ trở nên cao hơn"
                },
                "examples": [
                    {
                        "en": "The price of cigarettes is going up.",
                        "vi": "Giá thuốc lá đang tăng lên."
                    },
                    {
                        "en": "Cigarettes are going up in price.",
                        "vi": "Thuốc lá đang tăng giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be built",
                    "vi": "được xây dựng"
                },
                "examples": [
                    {
                        "en": "New office buildings are going up everywhere.",
                        "vi": "Các tòa nhà văn phòng mới mọc lên khắp nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the curtain across the stage in a theatre goes up, it is raised or opened",
                    "vi": "Khi tấm màn ngang qua sân khấu trong nhà hát được kéo lên, nó sẽ được kéo lên hoặc mở ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be destroyed by fire or an explosion",
                    "vi": "bị phá hủy bởi lửa hoặc một vụ nổ"
                },
                "examples": [
                    {
                        "en": "The whole building went up in flames.",
                        "vi": "Cả tòa nhà chìm trong biển lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrive at a university, especially Oxford or Cambridge, at the beginning of a term or in order to begin your studies",
                    "vi": "để đến một trường đại học, đặc biệt là Oxford hoặc Cambridge, vào đầu kỳ học hoặc để bắt đầu việc học của bạn"
                },
                "examples": [
                    {
                        "en": "She went up (to Oxford) in 2008.",
                        "vi": "Cô ấy đã lên (đến Oxford) vào năm 2008."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go from one place to another, especially further north or to a city or large town from a smaller place",
                    "vi": "để đi từ nơi này đến nơi khác, đặc biệt là xa hơn về phía bắc hoặc đến một thành phố hoặc thị trấn lớn từ một nơi nhỏ hơn"
                },
                "examples": [
                    {
                        "en": "When are you next going up to Scotland?",
                        "vi": "Khi nào bạn tới Scotland tiếp theo?"
                    },
                    {
                        "en": "We went up to London last weekend.",
                        "vi": "Chúng tôi đã đến London vào cuối tuần trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "081a0952a947480e9941be20699173c1",
        "word": "increase",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪnˈkriːs/",
            "us": "/ɪnˈkriːs/"
        },
        "nearby": [
            {
                "word": "incorruptibility",
                "pos": "noun"
            },
            {
                "word": "incorruptible",
                "pos": "adjective"
            },
            {
                "word": "increase",
                "pos": "verb"
            },
            {
                "word": "increase",
                "pos": "noun"
            },
            {
                "word": "increased",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become greater in amount, number, value, etc.; to make something greater in amount, number, value, etc.",
                    "vi": "trở nên lớn hơn về số lượng, số lượng, giá trị, v.v.; để làm cho thứ gì đó lớn hơn về số lượng, số lượng, giá trị, v.v."
                },
                "examples": [
                    {
                        "en": "Costs have increased significantly.",
                        "vi": "Chi phí đã tăng lên đáng kể."
                    },
                    {
                        "en": "to increase dramatically/substantially",
                        "vi": "tăng đáng kể / đáng kể"
                    },
                    {
                        "en": "The price of oil increased.",
                        "vi": "Giá dầu tăng."
                    },
                    {
                        "en": "increase in something Oil increased in price.",
                        "vi": "tăng giá Dầu tăng giá."
                    },
                    {
                        "en": "increase by something The rate of inflation increased by 2 per cent.",
                        "vi": "tăng bởi một cái gì đó Tỷ lệ lạm phát tăng 2 phần trăm."
                    },
                    {
                        "en": "increase from A to B The population has increased from 1.2 million to 1.8 million.",
                        "vi": "tăng từ A đến B Dân số đã tăng từ 1,2 triệu lên 1,8 triệu."
                    },
                    {
                        "en": "increase with something Disability increases with age (= the older somebody is, the more likely they are to be disabled).",
                        "vi": "tăng theo thứ gì đó Khuyết tật tăng theo tuổi (= ai đó càng lớn tuổi thì càng có nhiều khả năng bị tàn tật)."
                    },
                    {
                        "en": "increase something Sun exposure may increase the risk of skin cancer.",
                        "vi": "tăng một cái gì đó Tiếp xúc với ánh nắng mặt trời có thể làm tăng nguy cơ ung thư da."
                    },
                    {
                        "en": "Our aim is to increase the number of women in the sport.",
                        "vi": "Mục đích của chúng tôi là tăng số lượng phụ nữ tham gia môn thể thao này."
                    },
                    {
                        "en": "The company plans to significantly increase product availability over the next year.",
                        "vi": "Công ty có kế hoạch tăng đáng kể tính sẵn có của sản phẩm trong năm tới."
                    },
                    {
                        "en": "increase something by something They've increased the price by 50 per cent.",
                        "vi": "tăng thứ gì đó bằng thứ gì đó Họ đã tăng giá lên 50%."
                    },
                    {
                        "en": "increase something from A to B Last month the reward was increased from $20 000 to $40 000.",
                        "vi": "tăng thứ gì đó từ A lên B Tháng trước, phần thưởng đã tăng từ 20 000 đô la lên 40 000 đô la."
                    },
                    {
                        "en": "An increasing number of people live alone.",
                        "vi": "Ngày càng có nhiều người sống một mình."
                    },
                    {
                        "en": "increasing levels of carbon dioxide in the earth’s atmosphere",
                        "vi": "tăng mức độ carbon dioxide trong bầu khí quyển của trái đất"
                    }
                ]
            }
        ]
    },
    {
        "id": "fd89d83f0be0452c8fd4eb2d380f3cff",
        "word": "increase",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɪŋkriːs/",
            "us": "/ˈɪŋkriːs/"
        },
        "nearby": [
            {
                "word": "incorruptible",
                "pos": "adjective"
            },
            {
                "word": "increase",
                "pos": "verb"
            },
            {
                "word": "increase",
                "pos": "noun"
            },
            {
                "word": "increased",
                "pos": "adjective"
            },
            {
                "word": "increasingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rise in the amount, number or value of something",
                    "vi": "sự gia tăng về số lượng, số lượng hoặc giá trị của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "price/tax/wage increases",
                        "vi": "giá / thuế / tăng lương"
                    },
                    {
                        "en": "Profits show a steady increase.",
                        "vi": "Lợi nhuận cho thấy một sự gia tăng ổn định."
                    },
                    {
                        "en": "increase in something Last year the business saw a 3% increase in turnover.",
                        "vi": "tăng một cái gì đó Năm ngoái, doanh nghiệp này đã có doanh thu tăng 3%."
                    },
                    {
                        "en": "a substantial increase in the number of products on the market",
                        "vi": "sự gia tăng đáng kể về số lượng sản phẩm trên thị trường"
                    },
                    {
                        "en": "There has been a significant increase in oil prices.",
                        "vi": "Giá dầu đã tăng đáng kể."
                    },
                    {
                        "en": "The tax has resulted in a dramatic increase in rents.",
                        "vi": "Việc đánh thuế đã khiến giá thuê nhà tăng chóng mặt."
                    },
                    {
                        "en": "increase of something an increase of 2p in the pound on income tax",
                        "vi": "tăng một cái gì đó, tăng 2p bảng Anh đối với thuế thu nhập"
                    },
                    {
                        "en": "increase on something The figure is a ten-fold increase on the earlier amount.",
                        "vi": "tăng trên một cái gì đó Con số là một sự gia tăng gấp mười lần so với số tiền trước đó."
                    },
                    {
                        "en": "increase of something on something This is an increase of 12% on the previous year.",
                        "vi": "tăng của một cái gì đó vào một cái gì đó Đây là mức tăng 12% so với năm trước."
                    },
                    {
                        "en": "increase over something This represents a 14% increase over last year.",
                        "vi": "tăng hơn so với thứ gì đó. Con số này thể hiện mức tăng 14% so với năm ngoái."
                    },
                    {
                        "en": "increase from something They report a massive increase from last year.",
                        "vi": "tăng từ một cái gì đó Họ báo cáo một sự gia tăng lớn so với năm ngoái."
                    },
                    {
                        "en": "on the increase Homelessness is on the increase (= increasing).",
                        "vi": "ngày càng tăng Tình trạng vô gia cư đang gia tăng (= ngày càng tăng)."
                    },
                    {
                        "en": "The rate of increase is accelerating.",
                        "vi": "Tốc độ gia tăng ngày càng nhanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "66a7d37c28a24ff79e48418a77e474fc",
        "word": "rise",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/raɪz/",
            "us": "/raɪz/"
        },
        "nearby": [
            {
                "word": "rip up",
                "pos": "phrasal verb"
            },
            {
                "word": "Rip Van Winkle",
                "pos": "noun"
            },
            {
                "word": "rise",
                "pos": "verb"
            },
            {
                "word": "rise",
                "pos": "noun"
            },
            {
                "word": "rise above",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come or go upwards; to reach a higher level or position",
                    "vi": "đến hoặc đi lên; để đạt đến cấp độ hoặc vị trí cao hơn"
                },
                "examples": [
                    {
                        "en": "The curtain rose to reveal an empty stage.",
                        "vi": "Bức màn kéo lên để lộ một sân khấu trống rỗng."
                    },
                    {
                        "en": "+ adv./prep. Smoke was rising from the chimney.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The river has risen by several metres.",
                        "vi": "Nước sông đã dâng cao vài mét."
                    },
                    {
                        "en": "A stream of bubbles rose to the surface.",
                        "vi": "Một dòng bong bóng nổi lên trên bề mặt."
                    },
                    {
                        "en": "The flood waters were rising fast.",
                        "vi": "Nước lũ lên nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase in amount or number",
                    "vi": "để tăng số lượng hoặc số lượng"
                },
                "examples": [
                    {
                        "en": "Prices are still rising.",
                        "vi": "Giá cả vẫn đang tăng."
                    },
                    {
                        "en": "rising fuel bills",
                        "vi": "hóa đơn nhiên liệu tăng"
                    },
                    {
                        "en": "The price of gas rose.",
                        "vi": "Giá xăng tăng."
                    },
                    {
                        "en": "rise in something Gas rose in price.",
                        "vi": "tăng trong một cái gì đó Gas tăng giá."
                    },
                    {
                        "en": "The shares have risen in value.",
                        "vi": "Cổ phiếu đã tăng giá trị."
                    },
                    {
                        "en": "Global temperatures could rise three degrees or more.",
                        "vi": "Nhiệt độ toàn cầu có thể tăng từ ba độ trở lên."
                    },
                    {
                        "en": "rise by something Unemployment rose by 3 per cent.",
                        "vi": "tăng bởi một cái gì đó Tỷ lệ thất nghiệp tăng 3%."
                    },
                    {
                        "en": "rise to something Interest rates rose to a six-year high.",
                        "vi": "tăng lãi suất lên mức cao nhất trong sáu năm."
                    },
                    {
                        "en": "to rise sharply/dramatically/rapidly/steeply",
                        "vi": "tăng mạnh / đột ngột / nhanh chóng / dốc"
                    },
                    {
                        "en": "to rise steadily/slightly",
                        "vi": "tăng đều đặn / nhẹ"
                    },
                    {
                        "en": "We are seeing a rising tide of online crime (= a large increase in it).",
                        "vi": "Chúng tôi đang chứng kiến làn sóng tội phạm trực tuyến ngày càng gia tăng (= số lượng tội phạm gia tăng lớn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the sun, moon, etc. rises, it appears above the horizon",
                    "vi": "khi mặt trời, mặt trăng, v.v. mọc lên, nó xuất hiện phía trên đường chân trời"
                },
                "examples": [
                    {
                        "en": "The sun rises in the east.",
                        "vi": "Mặt trời mọc ở phía đông."
                    },
                    {
                        "en": "It was almost dark and the moon was just rising.",
                        "vi": "Trời gần như tối và mặt trăng vừa lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more successful, important, powerful, etc.",
                    "vi": "để trở nên thành công hơn, quan trọng hơn, mạnh mẽ hơn, v.v."
                },
                "examples": [
                    {
                        "en": "a rising young politician",
                        "vi": "một chính trị gia trẻ đang lên"
                    },
                    {
                        "en": "+ adv./prep. He rose to prominence in the 90s.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "to rise to fame/power",
                        "vi": "để vươn lên danh tiếng / quyền lực"
                    },
                    {
                        "en": "You could rise to the top if you work hard.",
                        "vi": "Bạn có thể vươn lên dẫn đầu nếu bạn làm việc chăm chỉ."
                    },
                    {
                        "en": "He rose to the rank of general.",
                        "vi": "Ông đã lên đến cấp tướng."
                    },
                    {
                        "en": "She has risen to a position of great responsibility.",
                        "vi": "Cô ấy đã vươn lên với một vị trí đầy trách nhiệm."
                    },
                    {
                        "en": "She rose through the ranks to become managing director.",
                        "vi": "Cô đã vượt qua các cấp bậc để trở thành giám đốc điều hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get up from a lying, sitting or kneeling position",
                    "vi": "đứng dậy từ tư thế nằm, ngồi hoặc quỳ"
                },
                "examples": [
                    {
                        "en": "He was accustomed to rising (= getting out of bed) early.",
                        "vi": "Anh ấy đã quen với việc dậy sớm (= ra khỏi giường) sớm."
                    },
                    {
                        "en": "They rose from the table.",
                        "vi": "Họ đã đứng lên khỏi bàn."
                    },
                    {
                        "en": "She rose to her feet.",
                        "vi": "Cô đứng dậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a meeting",
                    "vi": "để kết thúc một cuộc họp"
                },
                "examples": [
                    {
                        "en": "The House (= members of the House of Commons) rose at 10 p.m.",
                        "vi": "Hạ viện (= các thành viên của Hạ viện) tăng lúc 10 giờ tối"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sound rises, it becomes louder and higher",
                    "vi": "nếu một âm thanh tăng lên, nó trở nên to hơn và cao hơn"
                },
                "examples": [
                    {
                        "en": "Her voice rose angrily.",
                        "vi": "Giọng cô ấy nổi lên một cách giận dữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the wind rises, it begins to blow more strongly",
                    "vi": "nếu gió nổi lên, nó bắt đầu thổi mạnh hơn"
                },
                "examples": [
                    {
                        "en": "The wind is rising—I think there's a storm coming.",
                        "vi": "Gió đang nổi lên — tôi nghĩ sắp có bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a feeling rises inside you, it begins and gets stronger",
                    "vi": "nếu một cảm giác trỗi dậy bên trong bạn, nó sẽ bắt đầu và trở nên mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "He felt anger rising inside him.",
                        "vi": "Anh cảm thấy sự tức giận đang dâng lên trong mình."
                    },
                    {
                        "en": "Her spirits rose (= she felt happier) at the news.",
                        "vi": "Tinh thần của cô ấy phấn chấn (= cô ấy cảm thấy hạnh phúc hơn) khi biết tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your colour rises, your face becomes pink or red because you are embarrassed",
                    "vi": "nếu sắc mặt của bạn tăng lên, mặt bạn trở nên hồng hoặc đỏ vì bạn xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if hair rises, it stands up instead of lying flat",
                    "vi": "nếu tóc mọc lên, nó sẽ dựng đứng thay vì nằm phẳng"
                },
                "examples": [
                    {
                        "en": "The hair on the back of my neck rose when I heard the scream.",
                        "vi": "Tôi dựng tóc gáy khi nghe thấy tiếng hét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to fight against your government or leader or against a foreign army",
                    "vi": "bắt đầu chiến đấu chống lại chính phủ hoặc nhà lãnh đạo của bạn hoặc chống lại quân đội nước ngoài"
                },
                "examples": [
                    {
                        "en": "The peasants rose in revolt.",
                        "vi": "Nông dân nổi dậy khởi nghĩa."
                    },
                    {
                        "en": "He called on the people to rise up against the invaders.",
                        "vi": "Ông kêu gọi nhân dân vùng lên chống quân xâm lược."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be seen above everything that is around",
                    "vi": "để có thể được nhìn thấy trên mọi thứ xung quanh"
                },
                "examples": [
                    {
                        "en": "Mountains rose in the distance.",
                        "vi": "Những ngọn núi nhô lên ở phía xa."
                    }
                ]
            },
            {
                "define": {
                    "en": "if land rises, it slopes upwards",
                    "vi": "nếu đất tăng lên, nó sẽ dốc lên"
                },
                "examples": [
                    {
                        "en": "The ground rose steeply all around.",
                        "vi": "Mặt đất dốc lên xung quanh."
                    },
                    {
                        "en": "Behind the house the ground rises steeply to the north.",
                        "vi": "Sau nhà, nền đất dốc lên về phía bắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a river rises where it begins to flow",
                    "vi": "một dòng sông dâng lên nơi nó bắt đầu chảy"
                },
                "examples": [
                    {
                        "en": "The Thames rises in the Cotswold hills.",
                        "vi": "Sông Thames nổi lên trên các ngọn đồi Cotswold."
                    }
                ]
            },
            {
                "define": {
                    "en": "when bread, cakes, etc. rise, they become larger and rounder because of the action of yeast or baking powder",
                    "vi": "khi bánh mì, bánh ngọt, ... nổi lên, chúng trở nên to hơn và tròn hơn do tác động của men hoặc bột nở"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to come to life again",
                    "vi": "sống lại"
                },
                "examples": [
                    {
                        "en": "to rise from the dead",
                        "vi": "trỗi dậy từ cõi chết"
                    },
                    {
                        "en": "(figurative) Can a new party rise from the ashes of the old one?",
                        "vi": "(nghĩa bóng) Liệu một đảng mới có thể trỗi dậy từ đống tro tàn của đảng cũ không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stand straight and tall in order to show that you are determined, powerful or important",
                    "vi": "đứng thẳng và cao để thể hiện rằng bạn là người quyết tâm, mạnh mẽ hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "He drew himself up to his full height and glared at us.",
                        "vi": "Anh ta dựng người lên hết cỡ và nhìn chằm chằm vào chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody feels so angry about something that they feel physically sick",
                    "vi": "ai đó cảm thấy tức giận về điều gì đó đến nỗi họ cảm thấy mệt mỏi về thể chất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become angry",
                    "vi": "trở nên giận dữ"
                },
                "examples": [
                    {
                        "en": "Ben felt his hackles rise as the speaker continued.",
                        "vi": "Ben cảm thấy tiếng hack của mình tăng lên khi người nói tiếp tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "usually used in orders to tell somebody to get out of bed and be active",
                    "vi": "thường được sử dụng để yêu cầu ai đó ra khỏi giường và hoạt động"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c3e53c6819a0431f80ab7ae5e7a31622",
        "word": "cycle",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsaɪkl/",
            "us": "/ˈsaɪkl/"
        },
        "nearby": [
            {
                "word": "cyborg",
                "pos": "noun"
            },
            {
                "word": "cyclamen",
                "pos": "noun"
            },
            {
                "word": "cycle",
                "pos": "noun"
            },
            {
                "word": "cycle",
                "pos": "verb"
            },
            {
                "word": "cycle lane",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bicycle or motorcycle",
                    "vi": "một chiếc xe đạp hoặc xe máy"
                },
                "examples": [
                    {
                        "en": "He was riding his cycle home when he was hit by a lorry.",
                        "vi": "Anh ấy đang đạp xe về nhà thì bị một chiếc xe tải đâm."
                    },
                    {
                        "en": "We went for a cycle ride on Sunday.",
                        "vi": "Chúng tôi đã đi đạp xe vào Chủ nhật."
                    },
                    {
                        "en": "on a cycle Lots of people arrived in cars or on cycles.",
                        "vi": "trên một chu kỳ Rất nhiều người đã đến trên ô tô hoặc theo chu kỳ."
                    },
                    {
                        "en": "by cycle They completed their journey by cycle.",
                        "vi": "theo chu kỳ Họ đã hoàn thành hành trình của mình theo chu kỳ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of a series of events being repeated many times, always in the same order",
                    "vi": "thực tế là một chuỗi các sự kiện được lặp đi lặp lại nhiều lần, luôn theo cùng một thứ tự"
                },
                "examples": [
                    {
                        "en": "Every business goes through cycles.",
                        "vi": "Mọi doanh nghiệp đều trải qua các chu kỳ."
                    },
                    {
                        "en": "cycle of something the cycle of the seasons",
                        "vi": "chu kỳ của một cái gì đó chu kỳ của các mùa"
                    },
                    {
                        "en": "The argument is that reprisals simply perpetuate the cycle of violence.",
                        "vi": "Lập luận cho rằng sự trả đũa chỉ đơn giản là kéo dài chu kỳ bạo lực."
                    },
                    {
                        "en": "They could not break the cycle of harvest failure, food shortage, price increase and misery.",
                        "vi": "Họ không thể phá vỡ chu kỳ mất mùa, thiếu lương thực, tăng giá và khốn đốn."
                    },
                    {
                        "en": "in a cycle Front runners generally establish themselves early in the election cycle.",
                        "vi": "trong một chu kỳ Các ứng cử viên của Mặt trận thường thành lập sớm trong chu kỳ bầu cử."
                    },
                    {
                        "en": "The percentage of companies being downgraded was typical for this point in the economic cycle.",
                        "vi": "Tỷ lệ công ty bị tụt hạng là điển hình cho thời điểm này trong chu kỳ kinh tế."
                    },
                    {
                        "en": "different phases of the cell cycle",
                        "vi": "các giai đoạn khác nhau của chu kỳ tế bào"
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set or series, for example of movements in a machine",
                    "vi": "một bộ hoặc một loạt hoàn chỉnh, ví dụ về các chuyển động trong máy"
                },
                "examples": [
                    {
                        "en": "eight cycles per second",
                        "vi": "tám chu kỳ mỗi giây"
                    },
                    {
                        "en": "the rinse cycle (= in a washing machine)",
                        "vi": "chu kỳ xả (= trong máy giặt)"
                    }
                ]
            }
        ]
    },
    {
        "id": "59e933fc56ee465c974da9f0973c5bca",
        "word": "rise",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/raɪz/",
            "us": "/raɪz/"
        },
        "nearby": [
            {
                "word": "Rip Van Winkle",
                "pos": "noun"
            },
            {
                "word": "rise",
                "pos": "verb"
            },
            {
                "word": "rise",
                "pos": "noun"
            },
            {
                "word": "rise above",
                "pos": "phrasal verb"
            },
            {
                "word": "riser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an increase in an amount, a number or a level",
                    "vi": "sự gia tăng một số lượng, một con số hoặc một cấp độ"
                },
                "examples": [
                    {
                        "en": "The industry is feeling the effects of recent price rises.",
                        "vi": "Ngành công nghiệp đang cảm thấy ảnh hưởng của việc tăng giá gần đây."
                    },
                    {
                        "en": "a tax rise",
                        "vi": "tăng thuế"
                    },
                    {
                        "en": "an interest rate rise",
                        "vi": "tăng lãi suất"
                    },
                    {
                        "en": "the rise and fall of daily temperatures",
                        "vi": "sự tăng và giảm của nhiệt độ hàng ngày"
                    },
                    {
                        "en": "a rapid temperature rise",
                        "vi": "nhiệt độ tăng nhanh"
                    },
                    {
                        "en": "Sea level rises threaten low-lying communities.",
                        "vi": "Mực nước biển dâng đe dọa các cộng đồng ở vùng trũng thấp."
                    },
                    {
                        "en": "rise in something There has been a sharp rise in the number of people out of work.",
                        "vi": "tăng lên trong một cái gì đó Đã có một sự gia tăng mạnh mẽ trong số những người không có việc làm."
                    },
                    {
                        "en": "a steep/dramatic/sudden rise in something",
                        "vi": "một cái gì đó tăng dốc / kịch tính / đột ngột"
                    },
                    {
                        "en": "a steady/gradual rise in something",
                        "vi": "một sự gia tăng ổn định / dần dần trong một cái gì đó"
                    },
                    {
                        "en": "a five per cent rise in train fares",
                        "vi": "giá vé tàu hỏa tăng năm phần trăm"
                    },
                    {
                        "en": "rise of something a rise of 10 per cent",
                        "vi": "sự gia tăng của một cái gì đó tăng 10 phần trăm"
                    },
                    {
                        "en": "Insulin is used to control the rise of glucose levels in the blood.",
                        "vi": "Insulin được sử dụng để kiểm soát sự gia tăng nồng độ glucose trong máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "an increase in the money you are paid for the work you do",
                    "vi": "tăng số tiền bạn được trả cho công việc bạn làm"
                },
                "examples": [
                    {
                        "en": "I'm going to ask for a rise.",
                        "vi": "Tôi sẽ yêu cầu tăng."
                    },
                    {
                        "en": "He criticized the huge pay rises awarded to industry bosses.",
                        "vi": "Ông chỉ trích mức tăng lương khổng lồ được trao cho các ông chủ trong ngành."
                    },
                    {
                        "en": "Wage rises have been held at 1 per cent.",
                        "vi": "Tăng lương đã được giữ ở mức 1%."
                    },
                    {
                        "en": "rise of something The union is demanding an across-the-board rise of 5 per cent.",
                        "vi": "sự gia tăng của một cái gì đó Công đoàn đang yêu cầu mức tăng trên toàn bảng là 5%."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of becoming more important, successful, powerful, etc.",
                    "vi": "hành động trở nên quan trọng hơn, thành công, mạnh mẽ hơn, v.v."
                },
                "examples": [
                    {
                        "en": "rise of somebody/something The film traces the rise of fascism in Europe.",
                        "vi": "sự trỗi dậy của ai đó / cái gì đó Bộ phim theo dõi sự trỗi dậy của chủ nghĩa phát xít ở Châu Âu."
                    },
                    {
                        "en": "the rise and fall of the British Empire",
                        "vi": "sự trỗi dậy và sụp đổ của Đế quốc Anh"
                    },
                    {
                        "en": "the rise and rise (= continuing success without any failures) of social media",
                        "vi": "sự trỗi dậy và vươn lên (= tiếp tục thành công mà không gặp bất kỳ thất bại nào) của mạng xã hội"
                    },
                    {
                        "en": "rise to something the party's rise to power",
                        "vi": "vươn lên một cái gì đó mà đảng lên nắm quyền"
                    },
                    {
                        "en": "her meteoric rise to stardom",
                        "vi": "sự nổi lên như vũ bão của cô ấy để trở thành ngôi sao"
                    },
                    {
                        "en": "London's rise to prominence as a financial centre",
                        "vi": "Luân Đôn vươn lên trở thành một trung tâm tài chính"
                    },
                    {
                        "en": "The book charts his rise to the top of his sport.",
                        "vi": "Cuốn sách xếp hạng sự thăng tiến của anh ấy đến đỉnh cao trong môn thể thao của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a movement upwards",
                    "vi": "một chuyển động lên trên"
                },
                "examples": [
                    {
                        "en": "She watched the gentle rise and fall of his chest as he slept.",
                        "vi": "Cô ngắm nhìn sự lên xuống nhẹ nhàng của lồng ngực anh khi anh ngủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land that slopes upwards",
                    "vi": "một vùng đất dốc lên"
                },
                "examples": [
                    {
                        "en": "The church was built at the top of a small rise.",
                        "vi": "Nhà thờ được xây dựng trên đỉnh của một ngôi nhà nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody react in an angry way by saying something that you know will annoy them, especially as a joke",
                    "vi": "để khiến ai đó phản ứng theo cách tức giận bằng cách nói điều gì đó mà bạn biết sẽ làm họ khó chịu, đặc biệt là như một trò đùa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause something to happen or exist",
                    "vi": "để gây ra một cái gì đó xảy ra hoặc tồn tại"
                },
                "examples": [
                    {
                        "en": "The novel's success gave rise to a number of sequels.",
                        "vi": "Thành công của cuốn tiểu thuyết đã dẫn đến một số phần tiếp theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "e72b03b0437544349fc3736fec3bcefc",
        "word": "trend",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/trend/",
            "us": "/trend/"
        },
        "nearby": [
            {
                "word": "trench fever",
                "pos": "noun"
            },
            {
                "word": "trench foot",
                "pos": "noun"
            },
            {
                "word": "trend",
                "pos": "noun"
            },
            {
                "word": "trend",
                "pos": "verb"
            },
            {
                "word": "trendily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a general direction in which a situation is changing or developing",
                    "vi": "một hướng chung trong đó một tình huống đang thay đổi hoặc phát triển"
                },
                "examples": [
                    {
                        "en": "social/economic/political/demographic trends",
                        "vi": "xu hướng xã hội / kinh tế / chính trị / nhân khẩu học"
                    },
                    {
                        "en": "fashion/market trends",
                        "vi": "xu hướng thời trang / thị trường"
                    },
                    {
                        "en": "trend towards something There is a growing trend towards later retirement.",
                        "vi": "xu hướng hướng tới một cái gì đó Có một xu hướng ngày càng tăng đối với việc nghỉ hưu sau này."
                    },
                    {
                        "en": "trend in something The article discusses current trends in language teaching",
                        "vi": "xu hướng trong một cái gì đó Bài báo thảo luận về các xu hướng hiện nay trong việc giảng dạy ngôn ngữ"
                    },
                    {
                        "en": "This downward trend in sales is likely to continue.",
                        "vi": "Xu hướng giảm doanh số này có thể sẽ tiếp tục."
                    },
                    {
                        "en": "There has been an upward trend in the number of accidents reported.",
                        "vi": "Số vụ tai nạn được báo cáo có xu hướng tăng lên."
                    },
                    {
                        "en": "Predicting long-term trends in consumer behaviour is more difficult.",
                        "vi": "Dự đoán xu hướng dài hạn trong hành vi của người tiêu dùng khó hơn."
                    },
                    {
                        "en": "trend for something A trend for romance and nostalgia has emerged.",
                        "vi": "xu hướng cho một cái gì đó Một xu hướng cho sự lãng mạn và hoài cổ đã xuất hiện."
                    },
                    {
                        "en": "trend for somebody/something to do something There is an increasing trend for students to live at home.",
                        "vi": "xu hướng cho ai đó / việc gì đó làm điều gì đó Ngày càng có nhiều sinh viên xu hướng sống ở nhà."
                    },
                    {
                        "en": "You seem to have set (= started) a new trend.",
                        "vi": "Có vẻ như bạn đã thiết lập (= bắt đầu) một xu hướng mới."
                    },
                    {
                        "en": "This trend is being reversed (= is going in the opposite direction).",
                        "vi": "Xu hướng này đang bị đảo ngược (= đang đi theo hướng ngược lại)."
                    },
                    {
                        "en": "One region is attempting to buck (= oppose or resist) the trend of economic decline.",
                        "vi": "Một khu vực đang cố gắng chống lại (= phản đối hoặc chống lại) xu hướng suy giảm kinh tế."
                    },
                    {
                        "en": "Inflation continued its downward trend last month.",
                        "vi": "Lạm phát tiếp tục xu hướng giảm trong tháng trước."
                    },
                    {
                        "en": "Regional growth figures are following the national trend.",
                        "vi": "Các số liệu tăng trưởng của khu vực đang theo xu hướng chung của cả nước."
                    },
                    {
                        "en": "The number of visitors to the city is showing an upward trend.",
                        "vi": "Số lượng du khách đến thành phố đang có xu hướng tăng lên."
                    },
                    {
                        "en": "The underlying trend of inflation is still upwards.",
                        "vi": "Xu hướng cơ bản của lạm phát vẫn là tăng."
                    },
                    {
                        "en": "If this trend continues, the species could soon become extinct.",
                        "vi": "Nếu xu hướng này tiếp tục, loài này có thể sớm bị tuyệt chủng."
                    },
                    {
                        "en": "on trend Linen is on trend (= fashionable) again this summer.",
                        "vi": "về xu hướng Vải lanh lại là xu hướng (= thời trang) vào mùa hè này."
                    }
                ]
            }
        ]
    },
    {
        "id": "1e74663f8ff944f29be6f72d94451d2a",
        "word": "climb",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/klaɪm/",
            "us": "/klaɪm/"
        },
        "nearby": [
            {
                "word": "climax",
                "pos": "noun"
            },
            {
                "word": "climax",
                "pos": "verb"
            },
            {
                "word": "climb",
                "pos": "verb"
            },
            {
                "word": "climb",
                "pos": "noun"
            },
            {
                "word": "climb down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go up something towards the top",
                    "vi": "để đi lên một cái gì đó hướng tới đỉnh"
                },
                "examples": [
                    {
                        "en": "climb (up) something to climb a mountain/tree",
                        "vi": "trèo lên một cái gì đó để leo lên một ngọn núi / cây"
                    },
                    {
                        "en": "She climbed up the stairs.",
                        "vi": "Cô leo lên cầu thang."
                    },
                    {
                        "en": "to climb a ladder/wall",
                        "vi": "trèo lên một cái thang / bức tường"
                    },
                    {
                        "en": "They climbed the steps to the front door.",
                        "vi": "Họ leo lên các bậc thang để đến cửa trước."
                    },
                    {
                        "en": "The car slowly climbed the hill.",
                        "vi": "Xe từ từ lên đồi."
                    },
                    {
                        "en": "The boarding party began to climb up the side of the ship.",
                        "vi": "Đoàn lên tàu bắt đầu leo lên mạn tàu."
                    },
                    {
                        "en": "climb (up) As they climbed higher, the air became cooler.",
                        "vi": "trèo lên (lên) Khi họ lên cao hơn, không khí trở nên mát mẻ hơn."
                    },
                    {
                        "en": "You can climb to the top of the tower and take in the view.",
                        "vi": "Bạn có thể leo lên đỉnh tháp và phóng tầm mắt ra xa."
                    },
                    {
                        "en": "He climbed up and inspected the damage to the roof.",
                        "vi": "Anh trèo lên và kiểm tra mức độ hư hại của mái nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go up mountains or climb rocks as a hobby or sport",
                    "vi": "lên núi hoặc leo đá như một sở thích hoặc một môn thể thao"
                },
                "examples": [
                    {
                        "en": "He likes to go climbing most weekends.",
                        "vi": "Anh ấy thích đi leo núi nhất vào cuối tuần."
                    },
                    {
                        "en": "He goes climbing every summer.",
                        "vi": "Anh ấy đi leo núi vào mỗi mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somewhere, especially with difficulty or effort, using hands as well as feet",
                    "vi": "để di chuyển đến một nơi nào đó, đặc biệt là với khó khăn hoặc nỗ lực, sử dụng tay cũng như chân"
                },
                "examples": [
                    {
                        "en": "I climbed through the window.",
                        "vi": "Tôi trèo qua cửa sổ."
                    },
                    {
                        "en": "She opened the passenger door and climbed in.",
                        "vi": "Cô mở cửa hành khách và leo vào."
                    },
                    {
                        "en": "The boys climbed over the wall.",
                        "vi": "Các cậu bé trèo qua tường."
                    },
                    {
                        "en": "Sue climbed into bed.",
                        "vi": "Sue leo lên giường."
                    },
                    {
                        "en": "Can you climb down?",
                        "vi": "Bạn có thể leo xuống không?"
                    },
                    {
                        "en": "He finished digging the grave and climbed out.",
                        "vi": "Anh đào huyệt xong trèo ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase in value or amount",
                    "vi": "để tăng giá trị hoặc số lượng"
                },
                "examples": [
                    {
                        "en": "The paper's circulation continues to climb.",
                        "vi": "Vòng tuần hoàn của tờ báo tiếp tục tăng cao."
                    },
                    {
                        "en": "climb + adv./prep. Interest rates climbed to 8 per cent.",
                        "vi": "leo lên + adv./prep. Lãi suất tăng lên 8%."
                    },
                    {
                        "en": "The temperature had climbed above 30 degrees.",
                        "vi": "Nhiệt độ đã lên trên 30 độ."
                    },
                    {
                        "en": "Prices have climbed sharply in recent months.",
                        "vi": "Giá đã tăng mạnh trong những tháng gần đây."
                    },
                    {
                        "en": "The dollar has been climbing all week.",
                        "vi": "Đồng đô la đã tăng giá cả tuần."
                    },
                    {
                        "en": "Membership is climbing steadily.",
                        "vi": "Tư cách thành viên đang tăng dần đều."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move to a higher position in a chart, table, society or organization",
                    "vi": "để chuyển lên vị trí cao hơn trong biểu đồ, bảng, xã hội hoặc tổ chức"
                },
                "examples": [
                    {
                        "en": "climb to something The team has now climbed to fourth in the league.",
                        "vi": "leo lên thứ gì đó Đội hiện đã leo lên vị trí thứ 4 trên BXH."
                    },
                    {
                        "en": "In a few years he had climbed to the top of his profession.",
                        "vi": "Trong vài năm, anh ấy đã leo lên đỉnh cao của nghề nghiệp của mình."
                    },
                    {
                        "en": "climb something The song also climbed the charts in North America.",
                        "vi": "leo lên thứ gì Bài hát cũng leo lên các bảng xếp hạng ở Bắc Mỹ."
                    },
                    {
                        "en": "(figurative) to climb the corporate/career ladder",
                        "vi": "(nghĩa bóng) để leo lên nấc thang công ty / sự nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to go higher in the sky",
                    "vi": "để đi cao hơn trên bầu trời"
                },
                "examples": [
                    {
                        "en": "The plane climbed to 33 000 feet.",
                        "vi": "Máy bay đã leo lên độ cao 33 000 feet."
                    },
                    {
                        "en": "The sun climbed higher in the sky.",
                        "vi": "Mặt trời lên cao hơn trên bầu trời."
                    },
                    {
                        "en": "The plane took off and climbed to 20 000 feet.",
                        "vi": "Máy bay đã cất cánh và leo lên độ cao 20 000 feet."
                    }
                ]
            },
            {
                "define": {
                    "en": "to slope upwards",
                    "vi": "dốc lên"
                },
                "examples": [
                    {
                        "en": "From here the path climbs steeply to the summit.",
                        "vi": "Từ đây con đường leo dốc lên đến đỉnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow up a wall or frame",
                    "vi": "để lớn lên một bức tường hoặc khung"
                },
                "examples": [
                    {
                        "en": "a climbing rose",
                        "vi": "một bông hồng leo"
                    }
                ]
            },
            {
                "define": {
                    "en": "to join others in doing something that is becoming fashionable because you hope to become popular or successful yourself",
                    "vi": "tham gia cùng những người khác làm điều gì đó đang trở thành mốt vì bạn hy vọng bản thân trở nên nổi tiếng hoặc thành công"
                },
                "examples": [
                    {
                        "en": "politicians eager to jump on the environmental bandwagon",
                        "vi": "các chính trị gia háo hức nhảy vào cuộc chiến môi trường"
                    }
                ]
            }
        ]
    },
    {
        "id": "6dc095f6e74941f4907a2fc498954add",
        "word": "decline",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈklaɪn/",
            "us": "/dɪˈklaɪn/"
        },
        "nearby": [
            {
                "word": "declension",
                "pos": "noun"
            },
            {
                "word": "decline",
                "pos": "verb"
            },
            {
                "word": "decline",
                "pos": "noun"
            },
            {
                "word": "Decline and Fall",
                "pos": ""
            },
            {
                "word": "The Decline and Fall of the Roman Empire",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a continuous decrease in the number, value, quality, etc. of something",
                    "vi": "sự sụt giảm liên tục về số lượng, giá trị, chất lượng, v.v. của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "decline in something There has been a 5 per cent decline in student numbers.",
                        "vi": "sa sút về thứ gì đó Đã có sự sụt giảm 5% về số lượng học sinh."
                    },
                    {
                        "en": "decline of something the decline of seabird populations",
                        "vi": "sự suy giảm của một cái gì đó sự suy giảm của quần thể chim biển"
                    },
                    {
                        "en": "a sharp/steep/rapid decline",
                        "vi": "giảm mạnh / dốc / nhanh chóng"
                    },
                    {
                        "en": "a steady/gradual decline",
                        "vi": "sự suy giảm đều đặn / dần dần"
                    },
                    {
                        "en": "They have experienced decades of economic decline.",
                        "vi": "Họ đã trải qua nhiều thập kỷ suy giảm kinh tế."
                    },
                    {
                        "en": "in decline Industry in Britain has been in decline since the 1970s.",
                        "vi": "suy giảm Công nghiệp ở Anh đã suy giảm kể từ những năm 1970."
                    },
                    {
                        "en": "Many of the city's magnificent buildings fell into decline.",
                        "vi": "Nhiều tòa nhà tráng lệ của thành phố rơi vào cảnh suy tàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "640c022643994c47a22b33b2b2ec69d3",
        "word": "decrease",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈkriːs/",
            "us": "/dɪˈkriːs/"
        },
        "nearby": [
            {
                "word": "decoy",
                "pos": "verb"
            },
            {
                "word": "decoy",
                "pos": "noun"
            },
            {
                "word": "decrease",
                "pos": "verb"
            },
            {
                "word": "decrease",
                "pos": "noun"
            },
            {
                "word": "decree",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become smaller in size, number, etc.; to make something smaller in size, number, etc.",
                    "vi": "để trở nên nhỏ hơn về kích thước, số lượng, v.v.; để làm cho thứ gì đó nhỏ hơn về kích thước, số lượng, v.v."
                },
                "examples": [
                    {
                        "en": "Donations have decreased significantly over the past few years.",
                        "vi": "Các khoản quyên góp đã giảm đáng kể trong vài năm qua."
                    },
                    {
                        "en": "a decreasing population",
                        "vi": "dân số giảm"
                    },
                    {
                        "en": "decrease (from something) (to something) The number of new students decreased from 210 to 160 this year.",
                        "vi": "giảm (từ cái gì đó) (đến cái gì đó) Số lượng sinh viên mới giảm từ 210 xuống 160 trong năm nay."
                    },
                    {
                        "en": "decrease by something The price of wheat has decreased by 5 per cent.",
                        "vi": "giảm một chút Giá lúa mì đã giảm 5%."
                    },
                    {
                        "en": "decrease in something This species of bird is decreasing in numbers every year.",
                        "vi": "giảm một cái gì đó Loài chim này đang giảm số lượng mỗi năm."
                    },
                    {
                        "en": "to decrease in size/value",
                        "vi": "để giảm kích thước / giá trị"
                    },
                    {
                        "en": "decrease with something Fertility decreases with age.",
                        "vi": "giảm theo thứ gì đó Khả năng sinh sản giảm dần theo độ tuổi."
                    },
                    {
                        "en": "decrease something The drug did not significantly decrease the risk of heart attack.",
                        "vi": "giảm cái gì đó Thuốc không làm giảm đáng kể nguy cơ đau tim."
                    },
                    {
                        "en": "People should decrease the amount of fat they eat.",
                        "vi": "Mọi người nên giảm lượng chất béo họ ăn."
                    },
                    {
                        "en": "to decrease the incidence/likelihood/rate of something",
                        "vi": "để giảm tỷ lệ / khả năng xảy ra / tỷ lệ của một cái gì đó"
                    }
                ]
            }
        ]
    },
    {
        "id": "aec1c7e70562474ea0912ec05cb2fafd",
        "word": "decrease",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdiːkriːs/",
            "us": "/ˈdiːkriːs/"
        },
        "nearby": [
            {
                "word": "decoy",
                "pos": "noun"
            },
            {
                "word": "decrease",
                "pos": "verb"
            },
            {
                "word": "decrease",
                "pos": "noun"
            },
            {
                "word": "decree",
                "pos": "noun"
            },
            {
                "word": "decree",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of reducing something; the amount that something is reduced by",
                    "vi": "quá trình giảm bớt một thứ gì đó; số tiền mà một cái gì đó được giảm bớt bởi"
                },
                "examples": [
                    {
                        "en": "Sales for May show a decrease compared with the same month last year.",
                        "vi": "Doanh số bán hàng trong tháng 5 cho thấy có sự sụt giảm so với cùng tháng năm ngoái."
                    },
                    {
                        "en": "decrease in something There has been some decrease in military spending this year.",
                        "vi": "giảm một số thứ Đã có một số giảm trong chi tiêu quân sự trong năm nay."
                    },
                    {
                        "en": "a decrease in the number/level/rate of something",
                        "vi": "giảm số lượng / mức độ / tỷ lệ của một cái gì đó"
                    },
                    {
                        "en": "There has been a dramatic decrease in activity among our kids.",
                        "vi": "Đã có một sự giảm sút đáng kể hoạt động trong số trẻ em của chúng tôi."
                    },
                    {
                        "en": "decrease of something (in something) There has been a decrease of nearly 6 per cent in the number of visitors to the museum.",
                        "vi": "giảm một cái gì đó (trong một cái gì đó) Số lượng khách đến thăm bảo tàng đã giảm gần 6%."
                    },
                    {
                        "en": "decrease (from something) (to something) a decrease from 62% to just under half",
                        "vi": "giảm (từ một cái gì đó) (cho một cái gì đó) giảm từ 62% xuống chỉ còn dưới một nửa"
                    },
                    {
                        "en": "on the decrease Marriage is still on the decrease (= decreasing).",
                        "vi": "về sự suy giảm Hôn nhân vẫn đang giảm (= đang giảm dần)."
                    }
                ]
            }
        ]
    },
    {
        "id": "2c48eb59b1644ea9836d2b2eff730f02",
        "word": "drop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/drɒp/",
            "us": "/drɑːp/"
        },
        "nearby": [
            {
                "word": "droopy",
                "pos": "adjective"
            },
            {
                "word": "drop",
                "pos": "verb"
            },
            {
                "word": "drop",
                "pos": "noun"
            },
            {
                "word": "drop away",
                "pos": "phrasal verb"
            },
            {
                "word": "drop back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small amount of liquid that forms a round shape",
                    "vi": "một lượng rất nhỏ chất lỏng tạo thành hình tròn"
                },
                "examples": [
                    {
                        "en": "The first drops of rain fell.",
                        "vi": "Những giọt mưa đầu tiên rơi xuống."
                    },
                    {
                        "en": "There was a drop of blood on his finger.",
                        "vi": "Có một giọt máu trên ngón tay anh ta."
                    },
                    {
                        "en": "a drop of water/oil/sweat",
                        "vi": "một giọt nước / dầu / mồ hôi"
                    },
                    {
                        "en": "Mix a few drops of milk into the cake mixture.",
                        "vi": "Trộn một vài giọt sữa vào hỗn hợp bánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small quantity of a liquid",
                    "vi": "một lượng nhỏ chất lỏng"
                },
                "examples": [
                    {
                        "en": "Could I have a drop more milk in my coffee, please?",
                        "vi": "Làm ơn cho tôi thêm một giọt sữa vào cà phê được không?"
                    },
                    {
                        "en": "She carried it across the room without spilling a drop.",
                        "vi": "Cô ấy mang nó khắp phòng mà không làm đổ một giọt nào."
                    },
                    {
                        "en": "drop of something Would you like a drop of brandy?",
                        "vi": "giọt gì đó Bạn có muốn một giọt rượu mạnh không?"
                    },
                    {
                        "en": "I haven't touched a drop (= drunk any alcohol) all evening.",
                        "vi": "Tôi đã không đụng đến một giọt (= uống rượu) cả buổi tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fall or reduction in the amount, level or number of something",
                    "vi": "giảm hoặc giảm số lượng, mức độ hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "drop in something a sharp/steep drop in profits",
                        "vi": "rơi vào thứ gì đó, lợi nhuận giảm mạnh / giảm mạnh"
                    },
                    {
                        "en": "We've seen a 15 per cent drop in price since May.",
                        "vi": "Chúng tôi đã thấy giá giảm 15% kể từ tháng Năm."
                    },
                    {
                        "en": "a dramatic drop in sales/temperature/market share",
                        "vi": "doanh số bán hàng / nhiệt độ / thị phần giảm mạnh"
                    },
                    {
                        "en": "They reported a significant drop in passenger traffic.",
                        "vi": "Họ báo cáo lưu lượng hành khách giảm đáng kể."
                    },
                    {
                        "en": "drop against something The pound has suffered a big drop against the euro.",
                        "vi": "giảm so với thứ gì đó Đồng bảng Anh đã bị sụt giảm mạnh so với đồng euro."
                    }
                ]
            },
            {
                "define": {
                    "en": "a distance straight down from a high point to a lower point",
                    "vi": "khoảng cách thẳng xuống từ điểm cao đến điểm thấp hơn"
                },
                "examples": [
                    {
                        "en": "There was a sheer drop of fifty metres to the rocks below.",
                        "vi": "Đã có một cú rơi tuyệt đối ở độ cao 50 mét xuống những tảng đá bên dưới."
                    },
                    {
                        "en": "There was a twenty-foot drop onto the stones beneath.",
                        "vi": "Có một vụ rơi xuống những tảng đá bên dưới hai mươi foot."
                    }
                ]
            },
            {
                "define": {
                    "en": "a liquid medicine that you put one drop at a time into your eyes, ears or nose",
                    "vi": "thuốc dạng lỏng mà bạn nhỏ từng giọt một vào mắt, tai hoặc mũi"
                },
                "examples": [
                    {
                        "en": "eye drops",
                        "vi": "thuốc nhỏ mắt"
                    },
                    {
                        "en": "Use the drops three times a day.",
                        "vi": "Sử dụng các giọt ba lần một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of delivering somebody/something in a vehicle or by plane; the act of dropping something",
                    "vi": "hành động đưa ai đó / cái gì đó trên xe hoặc bằng máy bay; hành động đánh rơi thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Aid agencies are organizing food drops to civilians in the war zone.",
                        "vi": "Các cơ quan cứu trợ đang tổ chức giảm lương thực cho dân thường trong vùng chiến sự."
                    },
                    {
                        "en": "a parachute drop",
                        "vi": "thả dù"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small round sweet of the type mentioned",
                    "vi": "một loại ngọt tròn nhỏ được đề cập"
                },
                "examples": [
                    {
                        "en": "fruit drops",
                        "vi": "giọt trái cây"
                    },
                    {
                        "en": "cough drops (= sweets to help a cough)",
                        "vi": "thuốc giảm ho (= kẹo giúp giảm ho)"
                    }
                ]
            },
            {
                "define": {
                    "en": "immediately; without hesitating",
                    "vi": "ngay lập tức; không do dự"
                },
                "examples": [
                    {
                        "en": "The company can't expect me to move my home and family at the drop of a hat.",
                        "vi": "Công ty không thể mong đợi tôi chuyển nhà và gia đình của mình ngay lập tức."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of something that is too small or unimportant to make any real difference to a situation",
                    "vi": "một số lượng quá nhỏ hoặc không quan trọng để tạo ra bất kỳ sự khác biệt thực sự nào đối với một tình huống"
                },
                "examples": [
                    {
                        "en": "The amount of money raised was a drop in the ocean compared to what we needed.",
                        "vi": "Số tiền quyên góp được là một giọt nước biển so với những gì chúng tôi cần."
                    }
                ]
            }
        ]
    },
    {
        "id": "79328eb7b825479d8ca68def6507e5be",
        "word": "steady",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstedi/",
            "us": "/ˈstedi/"
        },
        "nearby": [
            {
                "word": "steadily",
                "pos": "adverb"
            },
            {
                "word": "steadiness",
                "pos": "noun"
            },
            {
                "word": "steady",
                "pos": "adjective"
            },
            {
                "word": "steady",
                "pos": "verb"
            },
            {
                "word": "steady",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "developing, growing, etc. gradually and in an even and regular way",
                    "vi": "phát triển, phát triển, v.v. dần dần và theo một cách đồng đều và thường xuyên"
                },
                "examples": [
                    {
                        "en": "We've had five years of steady economic growth.",
                        "vi": "Chúng tôi đã có năm năm tăng trưởng kinh tế ổn định."
                    },
                    {
                        "en": "The last decade has seen a steady decline in the number of birds nesting here.",
                        "vi": "Thập kỷ qua đã chứng kiến sự sụt giảm đều đặn về số lượng các loài chim làm tổ ở đây."
                    },
                    {
                        "en": "There has been a gradual but steady increase in prices.",
                        "vi": "Đã có sự tăng giá từ từ nhưng ổn định."
                    },
                    {
                        "en": "We are making slow but steady progress.",
                        "vi": "Chúng tôi đang đạt được tiến độ chậm nhưng ổn định."
                    },
                    {
                        "en": "The castle receives a steady stream of visitors.",
                        "vi": "Lâu đài nhận được một lượng khách tham quan ổn định."
                    },
                    {
                        "en": "There seemed to be a steady flow of customers all day.",
                        "vi": "Dường như có một lượng khách hàng ổn định cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "not changing and not interrupted",
                    "vi": "không thay đổi và không bị gián đoạn"
                },
                "examples": [
                    {
                        "en": "His breathing was steady.",
                        "vi": "Hơi thở của anh đều đặn."
                    },
                    {
                        "en": "a steady job/income",
                        "vi": "một công việc / thu nhập ổn định"
                    },
                    {
                        "en": "She drove at a steady 50 mph.",
                        "vi": "Cô ấy đã lái xe với tốc độ ổn định 50 dặm / giờ."
                    },
                    {
                        "en": "They set off at a steady pace.",
                        "vi": "Họ khởi hành với một tốc độ ổn định."
                    },
                    {
                        "en": "a steady boyfriend/girlfriend (= with whom you have a serious relationship or one that has lasted a long time)",
                        "vi": "bạn trai / bạn gái ổn định (= người mà bạn có một mối quan hệ nghiêm túc hoặc một mối quan hệ đã kéo dài một thời gian dài)"
                    },
                    {
                        "en": "to have a steady relationship",
                        "vi": "để có một mối quan hệ ổn định"
                    }
                ]
            },
            {
                "define": {
                    "en": "fixed in a place or position, supported or balanced; controlled and not shaking or likely to fall down",
                    "vi": "cố định ở một nơi hoặc vị trí, được hỗ trợ hoặc cân bằng; được kiểm soát và không bị rung lắc hoặc có khả năng rơi xuống"
                },
                "examples": [
                    {
                        "en": "He held the boat steady as she got in.",
                        "vi": "Anh giữ vững con thuyền khi cô vào."
                    },
                    {
                        "en": "I met his steady gaze.",
                        "vi": "Tôi bắt gặp ánh mắt kiên định của anh ấy."
                    },
                    {
                        "en": "Such fine work requires a good eye and a steady hand.",
                        "vi": "Những công việc tốt như vậy đòi hỏi một con mắt tinh tường và một đôi tay vững vàng."
                    },
                    {
                        "en": "She’s not very steady on her feet these days.",
                        "vi": "Cô ấy không ổn định lắm trên đôi chân của mình những ngày này."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible; who can be relied on",
                    "vi": "hợp lý; ai có thể dựa vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what you say to tell people to start a race",
                    "vi": "những gì bạn nói để nói với mọi người bắt đầu một cuộc đua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely steady and calm; that you can rely on",
                    "vi": "cực kỳ vững vàng và bình tĩnh; mà bạn có thể dựa vào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb96b90238264a78a4e9c2dd87b5eb4f",
        "word": "steady",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstedi/",
            "us": "/ˈstedi/"
        },
        "nearby": [
            {
                "word": "steady",
                "pos": "adjective"
            },
            {
                "word": "steady",
                "pos": "verb"
            },
            {
                "word": "steady",
                "pos": "adverb"
            },
            {
                "word": "steady",
                "pos": "exclamation"
            },
            {
                "word": "steak",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is steady and does not change or shake",
                    "vi": "theo cách ổn định và không thay đổi hoặc rung chuyển"
                },
                "examples": [
                    {
                        "en": "In trading today the dollar held steady against the yen.",
                        "vi": "Trong giao dịch hôm nay, đồng đô la giữ ổn định so với đồng yên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a romantic or sexual relationship with somebody, in which you see the other person regularly",
                    "vi": "có một mối quan hệ lãng mạn hoặc tình dục với ai đó, trong đó bạn gặp người kia thường xuyên"
                },
                "examples": [
                    {
                        "en": "They’ve been going steady for a year now.",
                        "vi": "Họ đã ổn định trong một năm nay."
                    }
                ]
            }
        ]
    },
    {
        "id": "ad2bc2ccdea541758efd1d1c352adb21",
        "word": "climb",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/klaɪm/",
            "us": "/klaɪm/"
        },
        "nearby": [
            {
                "word": "climax",
                "pos": "verb"
            },
            {
                "word": "climb",
                "pos": "verb"
            },
            {
                "word": "climb",
                "pos": "noun"
            },
            {
                "word": "climb down",
                "pos": "phrasal verb"
            },
            {
                "word": "climbdown",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of climbing up a mountain, rock or large number of steps; a period of time spent climbing",
                    "vi": "hành động leo lên núi, đá hoặc nhiều bậc thang; một khoảng thời gian dành cho việc leo núi"
                },
                "examples": [
                    {
                        "en": "an exhausting climb",
                        "vi": "một cuộc leo núi mệt mỏi"
                    },
                    {
                        "en": "It's an hour's climb to the summit.",
                        "vi": "Mất một giờ leo lên đến đỉnh."
                    },
                    {
                        "en": "After a steep climb we reached a plateau.",
                        "vi": "Sau khi leo dốc, chúng tôi đến một cao nguyên."
                    },
                    {
                        "en": "climb up something We began our climb up the hill.",
                        "vi": "trèo lên cái gì đó Chúng tôi bắt đầu leo lên đồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mountain or rock which people climb up for sport",
                    "vi": "một ngọn núi hoặc tảng đá mà mọi người leo lên để chơi thể thao"
                },
                "examples": [
                    {
                        "en": "Titan's Wall is the mountain's hardest rock climb.",
                        "vi": "Bức tường Titan là núi đá khó leo nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "an increase in value or amount",
                    "vi": "sự gia tăng giá trị hoặc số lượng"
                },
                "examples": [
                    {
                        "en": "the dollar’s climb against the euro",
                        "vi": "sự leo thang của đồng đô la so với đồng euro"
                    }
                ]
            },
            {
                "define": {
                    "en": "progress to a higher status, standard or position",
                    "vi": "tiến tới một trạng thái, tiêu chuẩn hoặc vị trí cao hơn"
                },
                "examples": [
                    {
                        "en": "a rapid climb to stardom",
                        "vi": "nhanh chóng leo lên ngôi sao"
                    },
                    {
                        "en": "the long slow climb out of the recession",
                        "vi": "sự leo thang chậm chạp trong thời gian dài thoát khỏi suy thoái"
                    }
                ]
            }
        ]
    },
    {
        "id": "e7c7810cb61243fa946ab5dd9055ab29",
        "word": "dip",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪp/",
            "us": "/dɪp/"
        },
        "nearby": [
            {
                "word": "dioxide",
                "pos": "noun"
            },
            {
                "word": "dioxin",
                "pos": "noun"
            },
            {
                "word": "dip",
                "pos": "verb"
            },
            {
                "word": "dip",
                "pos": "noun"
            },
            {
                "word": "DIP",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put something quickly into a liquid and take it out again",
                    "vi": "để nhanh chóng đặt một cái gì đó vào chất lỏng và lấy nó ra một lần nữa"
                },
                "examples": [
                    {
                        "en": "dip something (into something) He dipped the brush into the paint.",
                        "vi": "nhúng cái gì đó (vào cái gì đó) Anh ấy nhúng cọ vào sơn."
                    },
                    {
                        "en": "dip something (in) Dip your hand in to see how hot the water is.",
                        "vi": "nhúng một cái gì đó (vào) Nhúng tay vào để xem nước nóng như thế nào."
                    },
                    {
                        "en": "The fruit had been dipped in chocolate.",
                        "vi": "Trái cây đã được nhúng trong sô cô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go downwards or to a lower level; to make something do this",
                    "vi": "để đi xuống hoặc xuống một cấp độ thấp hơn; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "(+ adv./prep.) The sun dipped below the horizon.",
                        "vi": "(+ adv./prep.) Mặt trời lặn xuống dưới đường chân trời."
                    },
                    {
                        "en": "Sales for this quarter have dipped from 38.7 million to 33 million.",
                        "vi": "Doanh số bán hàng trong quý này đã giảm từ 38,7 triệu xuống 33 triệu."
                    },
                    {
                        "en": "The road dipped suddenly as we approached the town.",
                        "vi": "Con đường đột ngột sụt giảm khi chúng tôi đến gần thị trấn."
                    },
                    {
                        "en": "dip something (+ adv./prep.) The plane dipped its wings.",
                        "vi": "nhúng cái gì đó (+ adv./prep.) Máy bay nhúng đôi cánh của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you dip your headlights when driving a car at night, you make the light from them point down so that other drivers do not have the light in their eyes",
                    "vi": "Nếu bạn nhúng đèn pha khi lái xe ô tô vào ban đêm, bạn sẽ làm cho ánh sáng từ đèn hướng xuống để những người lái xe khác không nhìn thấy ánh sáng của họ."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when farmers dip animals, especially sheep, they put them in a bath of a liquid containing chemicals in order to kill insects, etc.",
                    "vi": "Khi người nông dân nhúng động vật, đặc biệt là cừu, họ cho chúng vào bồn nước có chứa hóa chất để diệt côn trùng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to spend some of your own money on something",
                    "vi": "chi tiêu một số tiền của riêng bạn cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was forced to dip into her own pocket to pay for the repairs.",
                        "vi": "Cô buộc phải tự bỏ tiền túi ra để trả tiền sửa chữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start doing something very carefully to see if it will be successful or not",
                    "vi": "bắt đầu làm điều gì đó thật cẩn thận để xem liệu nó có thành công hay không"
                },
                "examples": [
                    {
                        "en": "We decided to dip a toe in the computer games market.",
                        "vi": "Chúng tôi quyết định tham gia vào thị trường trò chơi máy tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "dcd1a5a083944c8ca294a1b38e155191",
        "word": "dive",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/daɪv/",
            "us": "/daɪv/"
        },
        "nearby": [
            {
                "word": "Divali",
                "pos": "noun"
            },
            {
                "word": "divan",
                "pos": "noun"
            },
            {
                "word": "dive",
                "pos": "verb"
            },
            {
                "word": "dive",
                "pos": "noun"
            },
            {
                "word": "dive-bomb",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to jump into water with your head and arms going in first",
                    "vi": "nhảy xuống nước với đầu và cánh tay của bạn đi vào đầu tiên"
                },
                "examples": [
                    {
                        "en": "dive (from/off something) (into something) We dived into the river to cool off.",
                        "vi": "lặn (từ / tắt cái gì đó) (vào cái gì đó) Chúng tôi lặn xuống sông để tắm mát."
                    },
                    {
                        "en": "dive off something He dived off the bridge.",
                        "vi": "lặn khỏi cái gì đó Anh ấy đã lặn khỏi cây cầu."
                    },
                    {
                        "en": "dive in Sam walked to the deep end of the pool and dived in.",
                        "vi": "lặn trong Sam đi bộ đến cuối vực sâu và lặn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to swim underwater wearing breathing equipment, collecting or looking at things",
                    "vi": "bơi dưới nước đeo thiết bị thở, thu thập hoặc nhìn mọi thứ"
                },
                "examples": [
                    {
                        "en": "to dive for pearls",
                        "vi": "lặn tìm ngọc trai"
                    },
                    {
                        "en": "The main purpose of his holiday to Greece was to go diving.",
                        "vi": "Mục đích chính trong kỳ nghỉ của anh đến Hy Lạp là để đi lặn biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a deeper level underwater",
                    "vi": "để đi đến một tầng sâu hơn dưới nước"
                },
                "examples": [
                    {
                        "en": "The submarine dived to avoid being seen.",
                        "vi": "Chiếc tàu ngầm lặn xuống để tránh bị nhìn thấy."
                    },
                    {
                        "en": "The whale dived as the harpoon struck it.",
                        "vi": "Con cá voi lao xuống khi chiếc lao đâm vào nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go steeply down through the air",
                    "vi": "đi xuống dốc trong không khí"
                },
                "examples": [
                    {
                        "en": "The seagulls soared then dived.",
                        "vi": "Những con hải âu bay vút lên rồi lặn xuống."
                    },
                    {
                        "en": "The plane dived down to attack.",
                        "vi": "Máy bay lao xuống tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or jump quickly in a particular direction, especially to avoid something, to try to catch a ball, etc.",
                    "vi": "để di chuyển hoặc nhảy nhanh theo một hướng cụ thể, đặc biệt là để tránh thứ gì đó, cố gắng bắt bóng, v.v."
                },
                "examples": [
                    {
                        "en": "dive for something We heard an explosion and dived for cover (= got into a place where we would be protected).",
                        "vi": "lặn tìm thứ gì đó Chúng tôi nghe thấy một tiếng nổ và lặn tìm chỗ ẩn nấp (= vào một nơi mà chúng tôi sẽ được bảo vệ)."
                    },
                    {
                        "en": "The goalie dived for the ball, but missed it.",
                        "vi": "Thủ môn đã lao xuống tìm bóng nhưng lại trượt."
                    },
                    {
                        "en": "+ adv./prep. It started to rain so we dived into the nearest cafe.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "He dived headlong into the ditch.",
                        "vi": "Anh ta lao thẳng xuống mương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall deliberately when somebody tackles you",
                    "vi": "cố tình ngã khi ai đó xử lý bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall suddenly",
                    "vi": "đột ngột rơi"
                },
                "examples": [
                    {
                        "en": "The share price dived from 75p to an all-time low of 50p.",
                        "vi": "Giá cổ phiếu giảm từ 75p xuống mức thấp nhất mọi thời đại là 50p."
                    }
                ]
            }
        ]
    },
    {
        "id": "1acaf858ddb9479ea32572ba9a3753f8",
        "word": "fluctuate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈflʌktʃueɪt/",
            "us": "/ˈflʌktʃueɪt/"
        },
        "nearby": [
            {
                "word": "flub",
                "pos": "noun"
            },
            {
                "word": "flub",
                "pos": "verb"
            },
            {
                "word": "fluctuate",
                "pos": "verb"
            },
            {
                "word": "fluctuation",
                "pos": "noun"
            },
            {
                "word": "flue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change frequently in size, amount, quality, etc., especially from one extreme to another",
                    "vi": "để thay đổi thường xuyên về kích thước, số lượng, chất lượng, v.v., đặc biệt là từ cực này sang cực khác"
                },
                "examples": [
                    {
                        "en": "fluctuating prices",
                        "vi": "biến động giá cả"
                    },
                    {
                        "en": "The documentary follows the fluctuating fortunes of one marketing company.",
                        "vi": "Bộ phim tài liệu kể về vận may đầy biến động của một công ty tiếp thị."
                    },
                    {
                        "en": "fluctuate between A and B During the crisis, oil prices fluctuated between $20 and $40 a barrel.",
                        "vi": "dao động giữa A và B Trong thời kỳ khủng hoảng, giá dầu dao động trong khoảng $ 20 đến $ 40 một thùng."
                    },
                    {
                        "en": "+ adv./prep. Temperatures can fluctuate by as much as 10 degrees.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "My weight fluctuated wildly depending on how much I ate.",
                        "vi": "Cân nặng của tôi dao động dữ dội tùy thuộc vào lượng tôi ăn."
                    },
                    {
                        "en": "My mood seems to fluctuate from day to day.",
                        "vi": "Tâm trạng của tôi dường như thay đổi từ ngày này sang ngày khác."
                    },
                    {
                        "en": "The rate of inflation has been fluctuating around 4% for some time.",
                        "vi": "Tỷ lệ lạm phát đã dao động quanh mức 4% trong một thời gian."
                    }
                ]
            }
        ]
    },
    {
        "id": "37aef5efdabc433dbda60ce2e18ec6ba",
        "word": "fluctuation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌflʌktʃuˈeɪʃn/",
            "us": "/ˌflʌktʃuˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "flub",
                "pos": "verb"
            },
            {
                "word": "fluctuate",
                "pos": "verb"
            },
            {
                "word": "fluctuation",
                "pos": "noun"
            },
            {
                "word": "flue",
                "pos": "noun"
            },
            {
                "word": "fluency",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of several changes in size, amount, quality, etc. that happen frequently, especially from one extreme to another; the act of changing frequently like this",
                    "vi": "một trong những thay đổi về kích thước, số lượng, chất lượng, v.v. thường xuyên xảy ra, đặc biệt là từ cực này sang cực khác; hành động thay đổi thường xuyên như thế này"
                },
                "examples": [
                    {
                        "en": "wild fluctuations in interest rates",
                        "vi": "biến động dữ dội trong lãi suất"
                    },
                    {
                        "en": "the constant fluctuation of oil prices",
                        "vi": "sự biến động liên tục của giá dầu"
                    },
                    {
                        "en": "currency/temperature fluctuations",
                        "vi": "biến động tiền tệ / nhiệt độ"
                    }
                ]
            }
        ]
    },
    {
        "id": "d8f0d44dabe541e9bbfa071c55d40547",
        "word": "level off",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "leveller",
                "pos": "noun"
            },
            {
                "word": "levelly",
                "pos": "adverb"
            },
            {
                "word": "level off",
                "pos": "phrasal verb"
            },
            {
                "word": "level out",
                "pos": "phrasal verb"
            },
            {
                "word": "level up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop rising or falling and remain level",
                    "vi": "ngừng tăng hoặc giảm và duy trì mức"
                },
                "examples": [
                    {
                        "en": "The plane levelled off at 1 500 feet.",
                        "vi": "Máy bay chững lại ở độ cao 1 500 feet."
                    },
                    {
                        "en": "After the long hill, the road levelled out.",
                        "vi": "Sau ngọn đồi dài, con đường đã san bằng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay at a steady level of development or progress after a period of sharp rises or falls",
                    "vi": "để duy trì mức độ phát triển hoặc tiến bộ ổn định sau một thời gian tăng hoặc giảm mạnh"
                },
                "examples": [
                    {
                        "en": "Sales have levelled off after a period of rapid growth.",
                        "vi": "Doanh số bán hàng đã chững lại sau một thời gian tăng trưởng nhanh chóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ded858d4edb74c878c0ef308f967976a",
        "word": "level out",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "levelly",
                "pos": "adverb"
            },
            {
                "word": "level off",
                "pos": "phrasal verb"
            },
            {
                "word": "level out",
                "pos": "phrasal verb"
            },
            {
                "word": "level up",
                "pos": "phrasal verb"
            },
            {
                "word": "level with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop rising or falling and remain level",
                    "vi": "ngừng tăng hoặc giảm và duy trì mức"
                },
                "examples": [
                    {
                        "en": "The plane levelled off at 1 500 feet.",
                        "vi": "Máy bay chững lại ở độ cao 1 500 feet."
                    },
                    {
                        "en": "After the long hill, the road levelled out.",
                        "vi": "Sau ngọn đồi dài, con đường đã san bằng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay at a steady level of development or progress after a period of sharp rises or falls",
                    "vi": "để duy trì mức độ phát triển hoặc tiến bộ ổn định sau một thời gian tăng hoặc giảm mạnh"
                },
                "examples": [
                    {
                        "en": "Sales have levelled off after a period of rapid growth.",
                        "vi": "Doanh số bán hàng đã chững lại sau một thời gian tăng trưởng nhanh chóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "48101455d2a547f696582845e43eea51",
        "word": "peak",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/piːk/",
            "us": "/piːk/"
        },
        "nearby": [
            {
                "word": "pea-green",
                "pos": "adjective"
            },
            {
                "word": "peahen",
                "pos": "noun"
            },
            {
                "word": "peak",
                "pos": "noun"
            },
            {
                "word": "peak",
                "pos": "verb"
            },
            {
                "word": "peak",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the point when somebody/something is best, most successful, strongest, etc.",
                    "vi": "thời điểm ai đó / điều gì đó tốt nhất, thành công nhất, mạnh nhất, v.v."
                },
                "examples": [
                    {
                        "en": "Traffic reaches its peak between 8 and 9 in the morning.",
                        "vi": "Giao thông đạt mức cao nhất vào khoảng từ 8 đến 9 giờ sáng."
                    },
                    {
                        "en": "the peaks and troughs of married life",
                        "vi": "đỉnh cao và đỉnh cao của cuộc sống hôn nhân"
                    },
                    {
                        "en": "at the peak of something She's at the peak of her career.",
                        "vi": "ở đỉnh cao của cái gì đó Cô ấy đang ở đỉnh cao của sự nghiệp."
                    },
                    {
                        "en": "Membership of the club has fallen from a peak of 600 people in 2006.",
                        "vi": "Số lượng thành viên của câu lạc bộ đã giảm từ mức đỉnh điểm là 600 người vào năm 2006."
                    }
                ]
            },
            {
                "define": {
                    "en": "the pointed top of a mountain; a mountain with a pointed top",
                    "vi": "đỉnh núi nhọn; một ngọn núi có đỉnh nhọn"
                },
                "examples": [
                    {
                        "en": "a mountain peak",
                        "vi": "một đỉnh núi"
                    },
                    {
                        "en": "snow-capped/jagged peaks",
                        "vi": "đỉnh núi tuyết phủ / lởm chởm"
                    },
                    {
                        "en": "The climbers made camp halfway up the peak.",
                        "vi": "Những người leo núi đã cắm trại ở lưng chừng đỉnh."
                    },
                    {
                        "en": "We looked up at the rocky peaks towering above us.",
                        "vi": "Chúng tôi nhìn lên những đỉnh núi đá sừng sững phía trên."
                    }
                ]
            },
            {
                "define": {
                    "en": "any narrow and pointed shape, edge, etc.",
                    "vi": "bất kỳ hình dạng hẹp và nhọn, cạnh, v.v."
                },
                "examples": [
                    {
                        "en": "Whisk the egg whites into stiff peaks.",
                        "vi": "Đánh bông lòng trắng trứng thành các đỉnh cứng."
                    },
                    {
                        "en": "He combed his hair into a peak.",
                        "vi": "Anh chải tóc thành đỉnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the stiff front part of a cap that sticks out above your eyes",
                    "vi": "phần trước cứng của một chiếc mũ lưỡi trai nhô ra khỏi mắt bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1d92b27912334317b6d1c9be3689fec5",
        "word": "peak",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/piːk/",
            "us": "/piːk/"
        },
        "nearby": [
            {
                "word": "peahen",
                "pos": "noun"
            },
            {
                "word": "peak",
                "pos": "noun"
            },
            {
                "word": "peak",
                "pos": "verb"
            },
            {
                "word": "peak",
                "pos": "adjective"
            },
            {
                "word": "the Peak District",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to reach the highest point or value",
                    "vi": "để đạt đến điểm hoặc giá trị cao nhất"
                },
                "examples": [
                    {
                        "en": "Oil production peaked in the early 1980s.",
                        "vi": "Sản lượng dầu đạt đỉnh vào đầu những năm 1980."
                    },
                    {
                        "en": "Unemployment peaked at 17 per cent.",
                        "vi": "Tỷ lệ thất nghiệp lên tới 17%."
                    },
                    {
                        "en": "an athlete who peaks (= produces his or her best performance) at just the right time",
                        "vi": "một vận động viên đạt đỉnh cao (= tạo ra thành tích tốt nhất của mình) vào đúng thời điểm"
                    }
                ]
            }
        ]
    },
    {
        "id": "e6c774aa3c944e40811645f2d1af06d8",
        "word": "peak",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/piːk/",
            "us": "/piːk/"
        },
        "nearby": [
            {
                "word": "peak",
                "pos": "noun"
            },
            {
                "word": "peak",
                "pos": "verb"
            },
            {
                "word": "peak",
                "pos": "adjective"
            },
            {
                "word": "the Peak District",
                "pos": ""
            },
            {
                "word": "peaked",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe the highest level of something, or a time when the greatest number of people are doing something or using something",
                    "vi": "được sử dụng để mô tả cấp độ cao nhất của điều gì đó hoặc thời điểm mà số lượng người lớn nhất đang làm điều gì đó hoặc sử dụng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "It was a time of peak demand for the product.",
                        "vi": "Đó là thời điểm nhu cầu cao nhất đối với sản phẩm."
                    },
                    {
                        "en": "March is one of the peak periods for our business.",
                        "vi": "Tháng 3 là một trong những giai đoạn cao điểm đối với hoạt động kinh doanh của chúng tôi."
                    },
                    {
                        "en": "The athletes are all in peak condition.",
                        "vi": "Các vận động viên đều ở trạng thái đỉnh cao."
                    },
                    {
                        "en": "We need extra help during the peak season.",
                        "vi": "Chúng tôi cần thêm trợ giúp trong mùa cao điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "ffc779a6477b4b48a2505d3500acf16b",
        "word": "soar",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/sɔː(r)/",
            "us": "/sɔːr/"
        },
        "nearby": [
            {
                "word": "soapsuds",
                "pos": "noun"
            },
            {
                "word": "soapy",
                "pos": "adjective"
            },
            {
                "word": "soar",
                "pos": "verb"
            },
            {
                "word": "soaraway",
                "pos": "adjective"
            },
            {
                "word": "sob",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the value, amount or level of something soars, it rises very quickly",
                    "vi": "nếu giá trị, số lượng hoặc mức độ của một thứ gì đó tăng vọt, nó sẽ tăng rất nhanh"
                },
                "examples": [
                    {
                        "en": "soaring costs/prices/temperatures",
                        "vi": "chi phí / giá cả / nhiệt độ tăng vọt"
                    },
                    {
                        "en": "Air pollution will soon soar above safety levels.",
                        "vi": "Ô nhiễm không khí sẽ sớm tăng cao trên mức an toàn."
                    },
                    {
                        "en": "Unemployment has soared to 18 per cent.",
                        "vi": "Tỷ lệ thất nghiệp đã tăng lên 18%."
                    }
                ]
            },
            {
                "define": {
                    "en": "to rise quickly and smoothly up into the air",
                    "vi": "bay lên nhanh chóng và thuận lợi trong không khí"
                },
                "examples": [
                    {
                        "en": "The rocket soared (up) into the air.",
                        "vi": "Tên lửa bay lên không trung."
                    },
                    {
                        "en": "(figurative) Her spirits soared (= she became very happy and excited).",
                        "vi": "(nghĩa bóng) Tinh thần của cô ấy tăng vọt (= cô ấy trở nên rất vui vẻ và phấn khích)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly very high in the air or remain high in the air",
                    "vi": "bay rất cao trong không trung hoặc ở trên cao"
                },
                "examples": [
                    {
                        "en": "an eagle soaring high above the cliffs",
                        "vi": "đại bàng bay lên cao trên vách đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very high or tall",
                    "vi": "rất cao hoặc cao"
                },
                "examples": [
                    {
                        "en": "soaring mountains",
                        "vi": "những ngọn núi cao vút"
                    },
                    {
                        "en": "The building soared above us.",
                        "vi": "Tòa nhà cao vút phía trên chúng tôi."
                    },
                    {
                        "en": "The cliffs soared upward.",
                        "vi": "Những vách đá cao vút lên trên."
                    }
                ]
            },
            {
                "define": {
                    "en": "when music soars, it becomes higher or louder",
                    "vi": "khi âm nhạc bay lên, nó trở nên cao hơn hoặc to hơn"
                },
                "examples": [
                    {
                        "en": "soaring strings",
                        "vi": "dây cao vút"
                    },
                    {
                        "en": "Her voice would soar over the orchestra with little effort.",
                        "vi": "Giọng của cô ấy sẽ bay lên khắp dàn nhạc mà không cần cố gắng nhiều."
                    }
                ]
            }
        ]
    },
    {
        "id": "3411df0ebf254dd196ed230db9d77030",
        "word": "boom and bust",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/buːm/",
            "us": "/buːm/"
        },
        "nearby": [
            {
                "word": "Boolean",
                "pos": "adjective"
            },
            {
                "word": "Boolean operator",
                "pos": "noun"
            },
            {
                "word": "boom",
                "pos": "noun"
            },
            {
                "word": "boom",
                "pos": "verb"
            },
            {
                "word": "boom box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden increase in trade and economic activity; a period of wealth and success",
                    "vi": "sự gia tăng đột biến trong thương mại và hoạt động kinh tế; một thời kỳ giàu có và thành công"
                },
                "examples": [
                    {
                        "en": "Living standards improved rapidly during the post-war boom.",
                        "vi": "Mức sống được cải thiện nhanh chóng trong thời kỳ bùng nổ sau chiến tranh."
                    },
                    {
                        "en": "boom in something a boom in car sales",
                        "vi": "bùng nổ cái gì đó bùng nổ doanh số bán xe hơi"
                    },
                    {
                        "en": "a boom year (for trade, exports, etc.)",
                        "vi": "một năm bùng nổ (đối với thương mại, xuất khẩu, v.v.)"
                    },
                    {
                        "en": "a property/housing boom",
                        "vi": "sự bùng nổ bất động sản / nhà ở"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period when something such as a sport or a type of music suddenly becomes very popular and successful",
                    "vi": "thời kỳ mà một thứ gì đó chẳng hạn như một môn thể thao hoặc một loại âm nhạc đột nhiên trở nên rất phổ biến và thành công"
                },
                "examples": [
                    {
                        "en": "The only way to satisfy the golf boom was to build more courses.",
                        "vi": "Cách duy nhất để đáp ứng sự bùng nổ của môn golf là xây dựng nhiều sân hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long pole that the bottom of a sail is attached to and that you move to change the position of the sail",
                    "vi": "một cái sào dài mà đáy của một cánh buồm được gắn vào và bạn di chuyển để thay đổi vị trí của cánh buồm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a loud deep sound",
                    "vi": "một âm thanh sâu lớn"
                },
                "examples": [
                    {
                        "en": "the distant boom of the guns",
                        "vi": "tiếng nổ xa của súng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a floating barrier that is placed across a river or the entrance to a harbour to prevent ships or other objects from coming in or going out",
                    "vi": "một rào chắn nổi được đặt qua sông hoặc lối vào bến cảng để ngăn tàu hoặc các vật thể khác ra vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long pole that carries a microphone or other equipment",
                    "vi": "một cột dài mang micrô hoặc thiết bị khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which a period of rapid economic growth is followed by one of sudden decline",
                    "vi": "một tình huống trong đó một giai đoạn tăng trưởng kinh tế nhanh chóng được theo sau bởi một sự suy giảm đột ngột"
                },
                "examples": [
                    {
                        "en": "High house prices encourage boom and bust and leave the economy vulnerable.",
                        "vi": "Giá nhà cao khuyến khích bùng nổ và phá sản và khiến nền kinh tế dễ bị tổn thương."
                    },
                    {
                        "en": "Amid the inevitable boom and bust cycle, families are facing pay cuts and job losses.",
                        "vi": "Giữa chu kỳ bùng nổ và phá sản không thể tránh khỏi, các gia đình đang phải đối mặt với việc cắt giảm lương và mất việc làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "a03de4b38f714f84aff2d870c27cec4e",
        "word": "bottom out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bottomless",
                "pos": "adjective"
            },
            {
                "word": "bottom line",
                "pos": "noun"
            },
            {
                "word": "bottom out",
                "pos": "phrasal verb"
            },
            {
                "word": "bottom-up",
                "pos": "adjective"
            },
            {
                "word": "botulin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop getting worse",
                    "vi": "để ngừng trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "The recession is finally beginning to show signs of bottoming out.",
                        "vi": "Suy thoái kinh tế cuối cùng cũng bắt đầu có dấu hiệu chạm đáy."
                    }
                ]
            }
        ]
    },
    {
        "id": "242d0823e0fa4e99b7af1e93bb0fbfe5",
        "word": "bounce back",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bounce",
                "pos": "verb"
            },
            {
                "word": "bounce",
                "pos": "noun"
            },
            {
                "word": "bounce back",
                "pos": "phrasal verb"
            },
            {
                "word": "bouncebackability",
                "pos": "noun"
            },
            {
                "word": "bounce house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become healthy, successful or confident again after being ill or having difficulties",
                    "vi": "để trở nên khỏe mạnh, thành công hoặc tự tin trở lại sau khi bị ốm hoặc gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "He's had a lot of problems, but he always seems to bounce back pretty quickly.",
                        "vi": "Anh ấy đã gặp rất nhiều vấn đề, nhưng dường như anh ấy luôn hồi phục khá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to their previous high level or value after a period of difficulty",
                    "vi": "để trở lại mức hoặc giá trị cao trước đây của họ sau một thời gian khó khăn"
                },
                "examples": [
                    {
                        "en": "The airline's shares have bounced back from two days of heavy losses.",
                        "vi": "Cổ phiếu của hãng hàng không này đã tăng trở lại sau hai ngày thua lỗ nặng nề."
                    }
                ]
            }
        ]
    },
    {
        "id": "1a54acb4e16d43d4b164ff80504b75cf",
        "word": "dip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪp/",
            "us": "/dɪp/"
        },
        "nearby": [
            {
                "word": "dioxin",
                "pos": "noun"
            },
            {
                "word": "dip",
                "pos": "verb"
            },
            {
                "word": "dip",
                "pos": "noun"
            },
            {
                "word": "DIP",
                "pos": "noun"
            },
            {
                "word": "DipHE",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a quick swim",
                    "vi": "bơi nhanh"
                },
                "examples": [
                    {
                        "en": "Let's go for a dip before breakfast.",
                        "vi": "Hãy đi ngâm mình trước khi ăn sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decrease in the amount or success of something, usually for only a short period",
                    "vi": "giảm số lượng hoặc mức độ thành công của một việc gì đó, thường chỉ trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Share prices have taken a slight dip.",
                        "vi": "Giá cổ phiếu đã giảm nhẹ."
                    },
                    {
                        "en": "dip in something a sharp dip in profits",
                        "vi": "nhúng vào một cái gì đó giảm mạnh trong lợi nhuận"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a surface suddenly drops to a lower level and then rises again",
                    "vi": "nơi có bề mặt đột ngột giảm xuống mức thấp hơn và sau đó tăng trở lại"
                },
                "examples": [
                    {
                        "en": "a dip in the road",
                        "vi": "ngâm mình trên đường"
                    },
                    {
                        "en": "The village lay in a dip among the hills.",
                        "vi": "Ngôi làng nằm ngâm mình giữa những ngọn đồi."
                    },
                    {
                        "en": "Puddles had formed in the dips.",
                        "vi": "Các vũng nước đã hình thành trong khoảng thời gian chìm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thick mixture into which pieces of food are dipped before being eaten",
                    "vi": "một hỗn hợp đặc mà các miếng thực phẩm được nhúng trước khi ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a liquid containing a chemical into which sheep and other animals can be dipped in order to kill insects on them",
                    "vi": "một chất lỏng có chứa một chất hóa học mà cừu và các động vật khác có thể được nhúng vào để giết côn trùng trên chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a quick look at something",
                    "vi": "nhìn nhanh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A brief dip into history serves to confirm this view.",
                        "vi": "Việc tìm hiểu kỹ lịch sử sẽ xác nhận quan điểm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quick movement of something down and up",
                    "vi": "một chuyển động nhanh của một cái gì đó xuống và lên"
                },
                "examples": [
                    {
                        "en": "He gave a dip of his head.",
                        "vi": "Anh ta cúi đầu xuống."
                    }
                ]
            }
        ]
    },
    {
        "id": "28c67a354f81486c826f856f207b817a",
        "word": "double-dip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʌbl ˈdɪp/",
            "us": "/ˌdʌbl ˈdɪp/"
        },
        "nearby": [
            {
                "word": "dotty",
                "pos": "adjective"
            },
            {
                "word": "Dotty",
                "pos": ""
            },
            {
                "word": "double-dip",
                "pos": "noun"
            },
            {
                "word": "double",
                "pos": "adjective"
            },
            {
                "word": "double",
                "pos": "determiner"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ice cream cone with two balls of ice cream",
                    "vi": "một que kem với hai viên kem"
                },
                "examples": [
                    {
                        "en": "a double-dip vanilla",
                        "vi": "một quả vani nhúng hai lần"
                    }
                ]
            },
            {
                "define": {
                    "en": "a recession (= difficult time for the economy of a country) during which a period of economic decline is followed by a brief period of economic growth, before the economy starts to decline again",
                    "vi": "suy thoái (= thời gian khó khăn đối với nền kinh tế của một quốc gia) trong đó một giai đoạn suy giảm kinh tế được theo sau bởi một giai đoạn tăng trưởng kinh tế ngắn, trước khi nền kinh tế bắt đầu suy giảm trở lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed05fb15454f449089e4fa364a729a43",
        "word": "double-dip recession",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʌbl dɪp rɪˈseʃn/",
            "us": "/ˌdʌbl dɪp rɪˈseʃn/"
        },
        "nearby": [
            {
                "word": "double digits",
                "pos": "noun"
            },
            {
                "word": "double-dip",
                "pos": "verb"
            },
            {
                "word": "double-dip recession",
                "pos": "noun"
            },
            {
                "word": "double-double",
                "pos": "noun"
            },
            {
                "word": "double down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a recession (= difficult time for the economy of a country) during which a period of economic decline is followed by a brief period of economic growth, before the economy starts to decline again",
                    "vi": "suy thoái (= thời gian khó khăn đối với nền kinh tế của một quốc gia) trong đó một giai đoạn suy giảm kinh tế được theo sau bởi một giai đoạn tăng trưởng kinh tế ngắn, trước khi nền kinh tế bắt đầu suy giảm trở lại"
                },
                "examples": [
                    {
                        "en": "The country has now officially entered a double-dip recession.",
                        "vi": "Đất nước này hiện đã chính thức bước vào cuộc suy thoái kép."
                    },
                    {
                        "en": "The US managed to avoid a double-dip recession.",
                        "vi": "Hoa Kỳ đã cố gắng tránh được một cuộc suy thoái kép."
                    }
                ]
            }
        ]
    },
    {
        "id": "7564e0a78c4746b3893bac2eda35bd7b",
        "word": "plateau",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplætəʊ/",
            "us": "/plæˈtəʊ/"
        },
        "nearby": [
            {
                "word": "plate",
                "pos": "noun"
            },
            {
                "word": "plate",
                "pos": "verb"
            },
            {
                "word": "plateau",
                "pos": "noun"
            },
            {
                "word": "plateau",
                "pos": "verb"
            },
            {
                "word": "plateful",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of flat land that is higher than the land around it",
                    "vi": "diện tích đất bằng cao hơn đất xung quanh"
                },
                "examples": [
                    {
                        "en": "The summit is a windswept plateau of scattered rocks.",
                        "vi": "Đỉnh núi là một cao nguyên lộng gió với những tảng đá rải rác."
                    },
                    {
                        "en": "From a narrow fringe of coastal plain, the main island rises to a central plateau.",
                        "vi": "Từ một dải đồng bằng ven biển hẹp, đảo chính vươn lên thành cao nguyên trung tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a time of little or no change after a period of growth or progress",
                    "vi": "một thời gian ít hoặc không thay đổi sau một thời gian tăng trưởng hoặc tiến bộ"
                },
                "examples": [
                    {
                        "en": "Inflation has reached a plateau.",
                        "vi": "Lạm phát đã đạt đến mức bình nguyên."
                    },
                    {
                        "en": "The children's standard of reading seems to have reached a plateau.",
                        "vi": "Tiêu chuẩn đọc của trẻ em dường như đã đạt đến mức cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "df676aa39a164545a2b0899c53b6e02a",
        "word": "plateau",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplætəʊ/",
            "us": "/plæˈtəʊ/"
        },
        "nearby": [
            {
                "word": "plate",
                "pos": "verb"
            },
            {
                "word": "plateau",
                "pos": "noun"
            },
            {
                "word": "plateau",
                "pos": "verb"
            },
            {
                "word": "plateful",
                "pos": "noun"
            },
            {
                "word": "plate glass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay at a steady level after a period of growth or progress",
                    "vi": "để duy trì ở mức ổn định sau một thời gian tăng trưởng hoặc tiến bộ"
                },
                "examples": [
                    {
                        "en": "Unemployment has at last plateaued out.",
                        "vi": "Tỷ lệ thất nghiệp cuối cùng đã chấm dứt."
                    },
                    {
                        "en": "Prices have pretty much plateaued for now.",
                        "vi": "Giá đã ổn định khá nhiều vào lúc này."
                    }
                ]
            }
        ]
    },
    {
        "id": "77bf8fa19dc441cfb9aa48ec0a65caaa",
        "word": "plummet",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplʌmɪt/",
            "us": "/ˈplʌmɪt/"
        },
        "nearby": [
            {
                "word": "plume",
                "pos": "noun"
            },
            {
                "word": "plumed",
                "pos": "adjective"
            },
            {
                "word": "plummet",
                "pos": "verb"
            },
            {
                "word": "plummy",
                "pos": "adjective"
            },
            {
                "word": "plump",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to fall suddenly and quickly from a high level or position",
                    "vi": "rơi đột ngột và nhanh chóng từ độ cao hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "Share prices plummeted to an all-time low.",
                        "vi": "Giá cổ phiếu giảm mạnh xuống mức thấp nhất mọi thời đại."
                    },
                    {
                        "en": "Her spirits plummeted at the thought of meeting him again.",
                        "vi": "Tinh thần cô sa sút khi nghĩ đến việc gặp lại anh."
                    },
                    {
                        "en": "The jet plummeted into a row of houses.",
                        "vi": "Máy bay phản lực lao thẳng vào một dãy nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "115df7b9b22c44e8ab5a7ce65835011e",
        "word": "slump",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/slʌmp/",
            "us": "/slʌmp/"
        },
        "nearby": [
            {
                "word": "slumber party",
                "pos": "noun"
            },
            {
                "word": "slumlord",
                "pos": "noun"
            },
            {
                "word": "slump",
                "pos": "verb"
            },
            {
                "word": "slump",
                "pos": "noun"
            },
            {
                "word": "slumped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to fall in price, value, number, etc., suddenly and by a large amount",
                    "vi": "giảm giá, giá trị, số lượng, v.v., đột ngột và một lượng lớn"
                },
                "examples": [
                    {
                        "en": "Sales have slumped this year.",
                        "vi": "Doanh số bán hàng đã sụt giảm trong năm nay."
                    },
                    {
                        "en": "slump by something Profits slumped by over 50 per cent.",
                        "vi": "sụt giảm bởi một cái gì đó Lợi nhuận giảm hơn 50%."
                    },
                    {
                        "en": "slump (from something) (to something) The paper's circulation has slumped to 90 000.",
                        "vi": "slump (từ cái gì đó) (đến cái gì đó) Lượng phát hành của tờ giấy đã giảm xuống còn 90 000."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit or fall down heavily",
                    "vi": "ngồi hoặc ngã xuống một cách nặng nề"
                },
                "examples": [
                    {
                        "en": "The old man slumped down in his chair.",
                        "vi": "Ông già ngồi phịch xuống ghế."
                    },
                    {
                        "en": "She slumped to her knees.",
                        "vi": "Cô khuỵu xuống."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3d2c106310c43a88d07e52620bb98c6",
        "word": "slump",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slʌmp/",
            "us": "/slʌmp/"
        },
        "nearby": [
            {
                "word": "slumlord",
                "pos": "noun"
            },
            {
                "word": "slump",
                "pos": "verb"
            },
            {
                "word": "slump",
                "pos": "noun"
            },
            {
                "word": "slumped",
                "pos": "adjective"
            },
            {
                "word": "slung",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden fall in sales, prices, the value of something, etc.",
                    "vi": "doanh số bán hàng, giá cả, giá trị của thứ gì đó giảm đột ngột, v.v."
                },
                "examples": [
                    {
                        "en": "a slump in profits",
                        "vi": "lợi nhuận sụt giảm"
                    },
                    {
                        "en": "This is the worst slump in property prices since the 1990s.",
                        "vi": "Đây là đợt giảm giá bất động sản tồi tệ nhất kể từ những năm 1990."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period when a country’s economy or a business is doing very badly",
                    "vi": "thời kỳ mà nền kinh tế của một quốc gia hoặc một doanh nghiệp đang hoạt động rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "the slump of the 1930s",
                        "vi": "sự sụt giảm của những năm 1930"
                    },
                    {
                        "en": "Housing sales are finally coming out of a three-month slump.",
                        "vi": "Doanh số bán nhà cuối cùng cũng thoát khỏi tình trạng sụt giảm trong ba tháng."
                    },
                    {
                        "en": "The toy industry is in a slump.",
                        "vi": "Ngành công nghiệp đồ chơi đang trong tình trạng tụt dốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "db51ab80e743419a8d6b499e3949e170",
        "word": "take a dive",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/daɪv/",
            "us": "/daɪv/"
        },
        "nearby": [
            {
                "word": "divan",
                "pos": "noun"
            },
            {
                "word": "dive",
                "pos": "verb"
            },
            {
                "word": "dive",
                "pos": "noun"
            },
            {
                "word": "dive-bomb",
                "pos": "verb"
            },
            {
                "word": "dive-bomber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a jump into deep water with your head first and your arms in front of you",
                    "vi": "nhảy xuống nước sâu với đầu của bạn trước và cánh tay của bạn ở phía trước"
                },
                "examples": [
                    {
                        "en": "a spectacular high dive (= from high above the water)",
                        "vi": "lặn trên cao ngoạn mục (= từ trên cao trên mặt nước)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of going underwater and swimming there with special equipment",
                    "vi": "hành động đi dưới nước và bơi ở đó với thiết bị đặc biệt"
                },
                "examples": [
                    {
                        "en": "a dive to a depth of 18 metres",
                        "vi": "lặn xuống độ sâu 18 mét"
                    },
                    {
                        "en": "We did a deep dive to see if we could find the wreckage.",
                        "vi": "Chúng tôi đã lặn sâu để xem liệu chúng tôi có thể tìm thấy mảnh vỡ hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of suddenly flying downwards",
                    "vi": "một hành động đột ngột bay xuống"
                },
                "examples": [
                    {
                        "en": "The pilot seemed to be having difficulty in pulling out of the dive.",
                        "vi": "Phi công dường như gặp khó khăn trong việc rút ra khỏi thiết bị lặn."
                    },
                    {
                        "en": "The plane went into a steep dive.",
                        "vi": "Máy bay lao dốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bar, music club, etc. that is cheap, and perhaps dark or dirty",
                    "vi": "một quán bar, câu lạc bộ âm nhạc, v.v. rẻ tiền và có thể tối tăm hoặc bẩn thỉu"
                },
                "examples": [
                    {
                        "en": "The band played in every smoky dive in town.",
                        "vi": "Ban nhạc đã chơi trong mỗi buổi lặn đầy khói trong thị trấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a deliberate fall that a player makes when somebody tackles them",
                    "vi": "một cú ngã có chủ ý mà một người chơi thực hiện khi ai đó xử lý họ"
                },
                "examples": [
                    {
                        "en": "Kane's dive won England a penalty.",
                        "vi": "Cú nhào lộn của Kane đã giúp Anh được hưởng quả phạt đền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly move or jump forward to do something or reach somebody/something",
                    "vi": "đột ngột di chuyển hoặc nhảy về phía trước để làm điều gì đó hoặc tiếp cận ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The goalkeeper made a dive for the ball.",
                        "vi": "Thủ môn đã lao xuống bắt bóng."
                    },
                    {
                        "en": "Paul made a dive for the fridge to get a drink.",
                        "vi": "Paul lao vào tủ lạnh để lấy đồ uống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly get worse",
                    "vi": "đột nhiên trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "Profits really took a dive last year.",
                        "vi": "Lợi nhuận thực sự sụt giảm vào năm ngoái."
                    },
                    {
                        "en": "The market is volatile and profits could take a dive.",
                        "vi": "Thị trường đang biến động và lợi nhuận có thể giảm."
                    }
                ]
            }
        ]
    },
    {
        "id": "98e47c588a1e41c5b920f1ab021621cb",
        "word": "trough",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/trɒf/",
            "us": "/trɔːf/"
        },
        "nearby": [
            {
                "word": "troublesome",
                "pos": "adjective"
            },
            {
                "word": "trouble spot",
                "pos": "noun"
            },
            {
                "word": "trough",
                "pos": "noun"
            },
            {
                "word": "trounce",
                "pos": "verb"
            },
            {
                "word": "troupe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, narrow open container for animals to eat or drink from",
                    "vi": "một hộp dài và hẹp mở rộng cho động vật ăn hoặc uống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long narrow region of low air pressure between two regions of higher pressure",
                    "vi": "một vùng khí áp thấp hẹp dài giữa hai vùng khí áp cao hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a period of time when the level of something is low, especially a time when a business or the economy is not growing",
                    "vi": "một khoảng thời gian mà mức độ của một cái gì đó thấp, đặc biệt là thời điểm khi một doanh nghiệp hoặc nền kinh tế không phát triển"
                },
                "examples": [
                    {
                        "en": "There have been peaks and troughs in the long-term trend of unemployment.",
                        "vi": "Đã có những đỉnh và đáy trong xu hướng thất nghiệp dài hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a low area between two waves in the sea, or two hills",
                    "vi": "một khu vực thấp giữa hai con sóng trên biển, hoặc hai ngọn đồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say that people have their noses in the trough, you mean that they are trying to get a lot of money for themselves",
                    "vi": "nếu bạn nói rằng mọi người có cái mũi của họ, bạn có nghĩa là họ đang cố gắng kiếm thật nhiều tiền cho mình"
                },
                "examples": []
            }
        ]
    }
]