[
    {
        "id": "ad0505fd289646faab7227a321fbdd06",
        "word": "scared",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/skeəd/",
            "us": "/skerd/"
        },
        "nearby": [
            {
                "word": "scare away",
                "pos": "phrasal verb"
            },
            {
                "word": "scarecrow",
                "pos": "noun"
            },
            {
                "word": "scared",
                "pos": "adjective"
            },
            {
                "word": "scaredy-cat",
                "pos": "noun"
            },
            {
                "word": "scare into doing",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "frightened of something or afraid that something bad might happen",
                    "vi": "sợ hãi điều gì đó hoặc sợ rằng điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The thieves got scared and ran away.",
                        "vi": "Những tên trộm đã sợ hãi và bỏ chạy."
                    },
                    {
                        "en": "He looked scared and hid behind Jesse.",
                        "vi": "Anh ta trông sợ hãi và trốn sau Jesse."
                    },
                    {
                        "en": "scared of doing something She is scared of going out alone.",
                        "vi": "sợ làm điều gì đó Cô ấy sợ ra ngoài một mình."
                    },
                    {
                        "en": "scared of somebody/something He's scared of heights.",
                        "vi": "sợ ai đó / cái gì đó Anh ấy sợ độ cao."
                    },
                    {
                        "en": "scared to do something People are scared to use the buses late at night.",
                        "vi": "sợ hãi khi làm điều gì đó Mọi người sợ hãi khi sử dụng xe buýt vào ban đêm."
                    },
                    {
                        "en": "Some victims are too scared to speak out.",
                        "vi": "Một số nạn nhân quá sợ hãi không dám lên tiếng."
                    },
                    {
                        "en": "scared (that)… I’m scared (that) I’m going to fall.",
                        "vi": "sợ hãi (điều đó)… Tôi sợ hãi (điều đó) Tôi sắp ngã."
                    },
                    {
                        "en": "scared at something He was scared at the prospect of running out of food.",
                        "vi": "sợ hãi trước điều gì đó Anh ấy sợ hãi trước viễn cảnh hết thức ăn."
                    },
                    {
                        "en": "scared at doing something Anne was scared at seeing her father crying.",
                        "vi": "sợ hãi khi làm điều gì đó Anne sợ hãi khi nhìn thấy cha mình khóc."
                    },
                    {
                        "en": "scared for something We were scared for our lives (= thought we would die).",
                        "vi": "sợ hãi vì điều gì đó Chúng tôi đã sợ hãi cho cuộc sống của mình (= nghĩ rằng chúng tôi sẽ chết)."
                    },
                    {
                        "en": "a scared look",
                        "vi": "một cái nhìn sợ hãi"
                    },
                    {
                        "en": "I was scared to death (= very frightened).",
                        "vi": "Tôi sợ chết khiếp (= rất hoảng sợ)."
                    },
                    {
                        "en": "We were scared stiff (= very frightened).",
                        "vi": "Chúng tôi sợ hãi cứng đờ (= rất sợ hãi)."
                    },
                    {
                        "en": "He's scared out of his mind (= very frightened).",
                        "vi": "Anh ấy sợ hãi mất trí (= rất sợ hãi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very easily frightened; to be very nervous",
                    "vi": "rất dễ sợ hãi; rất lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very frightened; to frighten somebody very much",
                    "vi": "rất sợ hãi; làm ai đó sợ hãi rất nhiều"
                },
                "examples": [
                    {
                        "en": "I was scared out of my wits!",
                        "vi": "Tôi sợ hết hồn!"
                    },
                    {
                        "en": "The latest news has scared the wits out of investors.",
                        "vi": "Tin tức mới nhất đã khiến các nhà đầu tư sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely frightened or bored",
                    "vi": "cực kỳ sợ hãi hoặc buồn chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "17f2f1df5ac244ee8a0f2d3f0a789953",
        "word": "frightened",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfraɪtnd/",
            "us": "/ˈfraɪtnd/"
        },
        "nearby": [
            {
                "word": "frighten away",
                "pos": "phrasal verb"
            },
            {
                "word": "frighten away from",
                "pos": "phrasal verb"
            },
            {
                "word": "frightened",
                "pos": "adjective"
            },
            {
                "word": "frighteners",
                "pos": "noun"
            },
            {
                "word": "frightening",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "afraid; feeling fear",
                    "vi": "sợ; cảm thấy sợ hãi"
                },
                "examples": [
                    {
                        "en": "a frightened child",
                        "vi": "một đứa trẻ sợ hãi"
                    },
                    {
                        "en": "Don't be frightened.",
                        "vi": "Đừng sợ hãi."
                    },
                    {
                        "en": "He sounded frightened.",
                        "vi": "Anh ta có vẻ sợ hãi."
                    },
                    {
                        "en": "frightened of something What are you frightened of?",
                        "vi": "sợ hãi điều gì đó Bạn đang sợ hãi điều gì?"
                    },
                    {
                        "en": "frightened of doing something I'm frightened of walking home alone in the dark.",
                        "vi": "sợ hãi khi làm điều gì đó Tôi sợ hãi khi đi bộ về nhà một mình trong bóng tối."
                    },
                    {
                        "en": "frightened about something I was nervous and frightened about the future.",
                        "vi": "sợ hãi về điều gì đó Tôi lo lắng và sợ hãi về tương lai."
                    },
                    {
                        "en": "frightened about doing something She said she was frightened about having the baby.",
                        "vi": "sợ hãi khi làm điều gì đó Cô ấy nói rằng cô ấy rất sợ hãi về việc sinh con."
                    },
                    {
                        "en": "frightened to do something I'm too frightened to ask him now.",
                        "vi": "sợ hãi làm điều gì đó Tôi quá sợ hãi để hỏi anh ta bây giờ."
                    },
                    {
                        "en": "frightened that… She was frightened that the plane would crash.",
                        "vi": "sợ rằng… Cô sợ rằng máy bay sẽ gặp nạn."
                    },
                    {
                        "en": "frightened for somebody I'm frightened for him (= that he will be hurt, etc.).",
                        "vi": "sợ hãi cho ai đó Tôi sợ hãi cho anh ta (= rằng anh ta sẽ bị thương, v.v.)."
                    },
                    {
                        "en": "(informal) I'd never do that. I'd be frightened to death.",
                        "vi": "(không chính thức) Tôi sẽ không bao giờ làm điều đó. Tôi sợ chết khiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very easily frightened; to be very nervous",
                    "vi": "rất dễ sợ hãi; rất lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very frightened; to frighten somebody very much",
                    "vi": "rất sợ hãi; làm ai đó sợ hãi rất nhiều"
                },
                "examples": [
                    {
                        "en": "I was scared out of my wits!",
                        "vi": "Tôi sợ hết hồn!"
                    },
                    {
                        "en": "The latest news has scared the wits out of investors.",
                        "vi": "Tin tức mới nhất đã khiến các nhà đầu tư sợ hãi."
                    }
                ]
            }
        ]
    },
    {
        "id": "f53fbc148a634fcea8a972a476135c6b",
        "word": "excited",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪkˈsaɪtɪd/",
            "us": "/ɪkˈsaɪtɪd/"
        },
        "nearby": [
            {
                "word": "excitable",
                "pos": "adjective"
            },
            {
                "word": "excite",
                "pos": "verb"
            },
            {
                "word": "excited",
                "pos": "adjective"
            },
            {
                "word": "excitedly",
                "pos": "adverb"
            },
            {
                "word": "excitement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing happiness and enthusiasm",
                    "vi": "cảm thấy hoặc thể hiện sự hạnh phúc và nhiệt tình"
                },
                "examples": [
                    {
                        "en": "Staff got excited when they heard they were getting a bonus.",
                        "vi": "Nhân viên rất phấn khích khi biết tin họ nhận được tiền thưởng."
                    },
                    {
                        "en": "excited about something I am really excited about the opportunity to work with her.",
                        "vi": "hào hứng về điều gì đó Tôi thực sự hào hứng với cơ hội được làm việc với cô ấy."
                    },
                    {
                        "en": "excited about doing something The children were excited about opening their presents.",
                        "vi": "hào hứng khi làm điều gì đó Các trẻ em rất hào hứng khi mở quà của mình."
                    },
                    {
                        "en": "excited at something I'm really excited at the prospect of working abroad.",
                        "vi": "hào hứng với điều gì đó Tôi thực sự hào hứng với viễn cảnh được làm việc ở nước ngoài."
                    },
                    {
                        "en": "excited at doing something She was very excited at becoming a great aunt.",
                        "vi": "hào hứng khi làm điều gì đó Cô ấy rất hào hứng khi trở thành một người cô tuyệt vời."
                    },
                    {
                        "en": "excited by something Don't get too excited by the sight of your name in print.",
                        "vi": "phấn khích bởi điều gì đó Đừng quá phấn khích khi nhìn thấy tên của bạn trên bản in."
                    },
                    {
                        "en": "excited for somebody I'm so excited for you!",
                        "vi": "vui mừng cho ai đó Tôi rất vui mừng cho bạn!"
                    },
                    {
                        "en": "excited for something I woke up bright and early, excited for the day ahead.",
                        "vi": "phấn khích vì điều gì đó Tôi thức dậy sớm và sáng, hào hứng cho một ngày phía trước."
                    },
                    {
                        "en": "excited to do something He was very excited to be asked to play for Wales.",
                        "vi": "hào hứng làm điều gì đó Anh ấy rất hào hứng khi được mời chơi cho xứ Wales."
                    },
                    {
                        "en": "excited (that)… He is very excited that he will get to meet his idol.",
                        "vi": "vui mừng (điều đó)… Anh ấy rất vui mừng vì anh ấy sẽ được gặp thần tượng của mình."
                    },
                    {
                        "en": "The new restaurant is nothing to get excited about (= not particularly good).",
                        "vi": "Nhà hàng mới không có gì đáng phấn khởi (= không tốt lắm)."
                    },
                    {
                        "en": "An excited crowd of people gathered around her.",
                        "vi": "Một đám đông hào hứng tụ tập xung quanh cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "nervous or upset and unable to relax",
                    "vi": "lo lắng hoặc khó chịu và không thể thư giãn"
                },
                "examples": [
                    {
                        "en": "Some horses become excited when they're in traffic.",
                        "vi": "Một số con ngựa trở nên phấn khích khi chúng tham gia giao thông."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling sexual desire",
                    "vi": "cảm thấy ham muốn tình dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "45c6c5561a5c402995fe66d2b060f395",
        "word": "fearful",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɪəfl/",
            "us": "/ˈfɪrfl/"
        },
        "nearby": [
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            },
            {
                "word": "fearful",
                "pos": "adjective"
            },
            {
                "word": "fearfully",
                "pos": "adverb"
            },
            {
                "word": "fearfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous and afraid",
                    "vi": "lo lắng và sợ hãi"
                },
                "examples": [
                    {
                        "en": "fearful (for somebody) Parents are ever fearful for their children.",
                        "vi": "sợ hãi (đối với ai đó) Cha mẹ luôn lo sợ cho con cái của họ."
                    },
                    {
                        "en": "fearful (of something/of doing something) fearful of an attack",
                        "vi": "sợ hãi (về điều gì đó / làm điều gì đó) sợ hãi về một cuộc tấn công"
                    },
                    {
                        "en": "Fearful of continued unrest, the government imposed a state of emergency.",
                        "vi": "Lo sợ tình trạng bất ổn tiếp tục xảy ra, chính phủ đã áp đặt tình trạng khẩn cấp."
                    },
                    {
                        "en": "fearful (about something) They were understandably fearful about the future.",
                        "vi": "sợ hãi (về điều gì đó) Họ sợ hãi một cách dễ hiểu về tương lai."
                    },
                    {
                        "en": "fearful (that…) She was fearful that she would fail.",
                        "vi": "sợ hãi (điều đó…) Cô ấy sợ rằng mình sẽ thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "terrible and frightening",
                    "vi": "khủng khiếp và đáng sợ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely bad",
                    "vi": "thực sự rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "We made a fearful mess of the room.",
                        "vi": "Chúng tôi đã làm cho căn phòng trở nên lộn xộn một cách đáng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ecea0c1c51c34c25a68ccfa30f7f7129",
        "word": "nerve",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/nɜːv/",
            "us": "/nɜːrv/"
        },
        "nearby": [
            {
                "word": "nerd",
                "pos": "noun"
            },
            {
                "word": "nerdy",
                "pos": "adjective"
            },
            {
                "word": "nerve",
                "pos": "noun"
            },
            {
                "word": "nerve",
                "pos": "verb"
            },
            {
                "word": "nerve agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the long fibres that carry messages between the brain and parts of the body, enabling you to move, feel pain, etc.",
                    "vi": "bất kỳ sợi dài nào mang thông điệp giữa não và các bộ phận của cơ thể, cho phép bạn cử động, cảm thấy đau, v.v."
                },
                "examples": [
                    {
                        "en": "the optic nerve",
                        "vi": "dây thần kinh thị giác"
                    },
                    {
                        "en": "He's off work with a trapped nerve in his neck.",
                        "vi": "Anh ấy đang nghỉ việc với một dây thần kinh bị kẹt ở cổ."
                    },
                    {
                        "en": "Every nerve in her body was tense.",
                        "vi": "Mọi dây thần kinh trong cơ thể cô đều căng thẳng."
                    },
                    {
                        "en": "The illness kills nerve cells and causes chronic fatigue.",
                        "vi": "Căn bệnh này giết chết các tế bào thần kinh và gây ra tình trạng mệt mỏi mãn tính."
                    },
                    {
                        "en": "Pain occurs when the nerve fibres are damaged.",
                        "vi": "Đau xảy ra khi các sợi thần kinh bị tổn thương."
                    },
                    {
                        "en": "Signals are transmitted from the nerve endings to the brain.",
                        "vi": "Tín hiệu được truyền từ đầu dây thần kinh đến não."
                    },
                    {
                        "en": "The disease can also cause nerve damage.",
                        "vi": "Bệnh cũng có thể gây tổn thương dây thần kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of worry or stress",
                    "vi": "cảm giác lo lắng hoặc căng thẳng"
                },
                "examples": [
                    {
                        "en": "Even after years as a singer, he still suffers from nerves before a performance.",
                        "vi": "Ngay cả sau nhiều năm làm ca sĩ, anh ấy vẫn bị căng thẳng trước một buổi biểu diễn."
                    },
                    {
                        "en": "I need something to calm my nerves.",
                        "vi": "Tôi cần thứ gì đó để xoa dịu thần kinh của mình."
                    },
                    {
                        "en": "to settle/soothe/steady your nerves",
                        "vi": "để giải quyết / làm dịu / ổn định thần kinh của bạn"
                    },
                    {
                        "en": "Everyone's nerves were on edge (= everyone felt tense).",
                        "vi": "Mọi người đều căng thẳng (= mọi người đều cảm thấy căng thẳng)."
                    },
                    {
                        "en": "He lives on his nerves (= is always worried).",
                        "vi": "Anh ấy sống dựa vào thần kinh của mình (= luôn lo lắng)."
                    },
                    {
                        "en": "By the end of the meal her nerves were completely frayed.",
                        "vi": "Đến cuối bữa ăn, thần kinh của cô hoàn toàn không còn sức lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage to do something difficult or dangerous",
                    "vi": "can đảm để làm điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It took a lot of nerve to take the company to court.",
                        "vi": "Phải rất căng thẳng để đưa công ty ra tòa."
                    },
                    {
                        "en": "I was going to have a go at parachuting but lost my nerve at the last minute.",
                        "vi": "Tôi đã định nhảy dù nhưng bị mất thần kinh vào phút cuối."
                    },
                    {
                        "en": "He held his nerve to win the final set 6–4.",
                        "vi": "Anh ấy đã cố gắng để giành chiến thắng trong set 6–4 cuối cùng."
                    },
                    {
                        "en": "Investors largely kept their nerve and stayed with the company.",
                        "vi": "Các nhà đầu tư chủ yếu giữ vững tâm lý và ở lại với công ty."
                    },
                    {
                        "en": "It was an amazing journey which tested her nerves to the full.",
                        "vi": "Đó là một cuộc hành trình tuyệt vời đã kiểm tra thần kinh của cô ấy một cách đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that other people think is rude or not appropriate",
                    "vi": "một cách cư xử mà người khác cho là thô lỗ hoặc không phù hợp"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the nerve to show your face after what you said!",
                        "vi": "Tôi không biết làm thế nào bạn có đủ can đảm để lộ ra khuôn mặt của bạn sau những gì bạn nói!"
                    },
                    {
                        "en": "He's got a nerve asking us for money!",
                        "vi": "Anh ta có gan đòi tiền chúng tôi!"
                    },
                    {
                        "en": "‘Then she demanded to see the manager!’ ‘What a nerve!’",
                        "vi": "Sau đó cô ấy yêu cầu gặp người quản lý!' 'Thật là một thần kinh!'"
                    },
                    {
                        "en": "He had some nerve to insult Mina's cooking.",
                        "vi": "Anh ta có chút gan dạ để xúc phạm công việc nấu nướng của Mina."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "By the time of the interview, I was a bundle of nerves.",
                        "vi": "Vào thời điểm phỏng vấn, tôi đã bó tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "That music is starting to get on my nerves.",
                        "vi": "Âm nhạc đó đang bắt đầu làm tôi lo lắng."
                    },
                    {
                        "en": "It really gets on my nerves when people talk loudly on the phone in public.",
                        "vi": "Tôi thực sự lo lắng khi mọi người nói chuyện điện thoại ồn ào ở nơi công cộng."
                    },
                    {
                        "en": "His endless whining really gets on my nerves.",
                        "vi": "Tiếng rên rỉ bất tận của anh ấy thực sự làm tôi lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to remain calm in a difficult or dangerous situation",
                    "vi": "để có thể giữ bình tĩnh trong một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "You need nerves of steel to be a good poker player.",
                        "vi": "Bạn cần có thần kinh thép để trở thành một người chơi poker giỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention a subject that makes somebody feel angry, upset, embarrassed, etc.",
                    "vi": "đề cập đến một chủ đề khiến ai đó cảm thấy tức giận, khó chịu, xấu hổ, v.v."
                },
                "examples": [
                    {
                        "en": "You touched a raw nerve when you mentioned his first wife.",
                        "vi": "Bạn đã xúc động mạnh khi nhắc đến người vợ đầu tiên của anh ấy."
                    },
                    {
                        "en": "My remarks about divorce had unwittingly touched a raw nerve.",
                        "vi": "Những nhận xét của tôi về việc ly hôn đã vô tình chạm vào một dây thần kinh thô."
                    },
                    {
                        "en": "The article struck a raw nerve as it revived unpleasant memories.",
                        "vi": "Bài báo đánh vào một dây thần kinh thô khi nó làm sống lại những ký ức khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try as hard as you can to do something",
                    "vi": "cố gắng hết sức có thể để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He strained every nerve to snatch victory from defeat.",
                        "vi": "Anh ta căng mọi dây thần kinh để giành lấy chiến thắng từ thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a strong effect",
                    "vi": "để có một hiệu ứng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His work strikes a nerve with people who are attracted to nostalgia.",
                        "vi": "Tác phẩm của anh gây ấn tượng mạnh với những người bị thu hút bởi sự hoài cổ."
                    },
                    {
                        "en": "It seems I struck a nerve with my last post about cell phones.",
                        "vi": "Có vẻ như tôi đã giật mình với bài viết cuối cùng của tôi về điện thoại di động."
                    },
                    {
                        "en": "Nissan may well strike a popular nerve here.",
                        "vi": "Nissan cũng có thể tấn công một thần kinh phổ biến ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence",
                    "vi": "nỗ lực đánh bại đối thủ của bạn bằng cách gây áp lực lên họ để họ mất can đảm hoặc tự tin"
                },
                "examples": [
                    {
                        "en": "The union has been fighting a war of nerves with the management over pay.",
                        "vi": "Công đoàn đã phải đối mặt với một cuộc chiến căng thẳng với việc quản lý quá mức lương."
                    }
                ]
            }
        ]
    },
    {
        "id": "9908b932e71b4ba89e1bd0888bf75fc5",
        "word": "pessimism",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpesɪmɪzəm/",
            "us": "/ˈpesɪmɪzəm/"
        },
        "nearby": [
            {
                "word": "peso",
                "pos": "noun"
            },
            {
                "word": "pessary",
                "pos": "noun"
            },
            {
                "word": "pessimism",
                "pos": "noun"
            },
            {
                "word": "pessimist",
                "pos": "noun"
            },
            {
                "word": "pessimistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling that bad things will happen and that something will not be successful",
                    "vi": "cảm giác rằng điều tồi tệ sẽ xảy ra và điều gì đó sẽ không thành công"
                },
                "examples": [
                    {
                        "en": "There is a mood of pessimism in the company about future job prospects.",
                        "vi": "Có tâm trạng bi quan trong công ty về triển vọng công việc trong tương lai."
                    },
                    {
                        "en": "This widespread pessimism does not seem justified.",
                        "vi": "Sự bi quan lan rộng này dường như không được biện minh."
                    }
                ]
            }
        ]
    },
    {
        "id": "4987883221a943508ecc76219191ef49",
        "word": "pessimist",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpesɪmɪst/",
            "us": "/ˈpesɪmɪst/"
        },
        "nearby": [
            {
                "word": "pessary",
                "pos": "noun"
            },
            {
                "word": "pessimism",
                "pos": "noun"
            },
            {
                "word": "pessimist",
                "pos": "noun"
            },
            {
                "word": "pessimistic",
                "pos": "adjective"
            },
            {
                "word": "pessimistically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who always expects bad things to happen",
                    "vi": "một người luôn mong đợi những điều tồi tệ sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "You don't have to be a pessimist to realize that we're in trouble.",
                        "vi": "Bạn không cần phải là một người bi quan để nhận ra rằng chúng ta đang gặp khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c67c101d8c5409188ce91f4a502c32f",
        "word": "uncomfortable",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ʌnˈkʌmftəbl/",
            "us": "/ʌnˈkʌmftəbl/"
        },
        "nearby": [
            {
                "word": "uncoloured",
                "pos": "adjective"
            },
            {
                "word": "uncombed",
                "pos": "adjective"
            },
            {
                "word": "uncomfortable",
                "pos": "adjective"
            },
            {
                "word": "uncomfortably",
                "pos": "adverb"
            },
            {
                "word": "uncommitted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not letting you feel physically comfortable; unpleasant to wear, sit on, etc.",
                    "vi": "không để bạn cảm thấy thoải mái về thể chất; khó chịu khi mặc, ngồi, v.v."
                },
                "examples": [
                    {
                        "en": "uncomfortable shoes",
                        "vi": "giày không thoải mái"
                    },
                    {
                        "en": "uncomfortable to do something The headphones can be uncomfortable to wear.",
                        "vi": "không thoải mái khi làm việc gì đó Tai nghe có thể không thoải mái khi đeo."
                    },
                    {
                        "en": "I couldn't sleep because the bed was so uncomfortable.",
                        "vi": "Tôi không thể ngủ được vì chiếc giường quá khó chịu."
                    },
                    {
                        "en": "I find these chairs incredibly uncomfortable.",
                        "vi": "Tôi thấy những chiếc ghế này khó chịu vô cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not feeling physically relaxed, warm, etc.",
                    "vi": "không cảm thấy cơ thể thoải mái, ấm áp, v.v."
                },
                "examples": [
                    {
                        "en": "I was sitting in an extremely uncomfortable position.",
                        "vi": "Tôi đang ngồi ở một vị trí vô cùng khó chịu."
                    },
                    {
                        "en": "it is uncomfortable to do something It was uncomfortable to walk for long periods of time.",
                        "vi": "cảm thấy không thoải mái khi làm việc gì đó Thật không thoải mái khi phải đi bộ trong thời gian dài."
                    },
                    {
                        "en": "She still finds it uncomfortable to stand without support.",
                        "vi": "Cô vẫn cảm thấy khó chịu khi đứng mà không có người hỗ trợ."
                    },
                    {
                        "en": "Sharp stones on the path made walking barefoot rather uncomfortable.",
                        "vi": "Những viên đá sắc nhọn trên lối đi khiến việc đi bộ bằng chân trần khá khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "anxious, embarrassed or afraid and unable to relax; making you feel like this",
                    "vi": "lo lắng, xấu hổ hoặc sợ hãi và không thể thư giãn; làm cho bạn cảm thấy như thế này"
                },
                "examples": [
                    {
                        "en": "He looked distinctly uncomfortable when the subject was mentioned.",
                        "vi": "Anh ta trông có vẻ khó chịu rõ ràng khi chủ đề này được đề cập đến."
                    },
                    {
                        "en": "uncomfortable with something She felt uncomfortable with the way George looked at her.",
                        "vi": "không thoải mái với điều gì đó Cô cảm thấy không thoải mái với cách George nhìn cô."
                    },
                    {
                        "en": "They are uncomfortable with the idea of a military assault.",
                        "vi": "Họ không thoải mái với ý tưởng về một cuộc tấn công quân sự."
                    },
                    {
                        "en": "The thought made her even more uncomfortable.",
                        "vi": "Ý nghĩ đó khiến cô càng thêm khó chịu."
                    },
                    {
                        "en": "There was an uncomfortable silence.",
                        "vi": "Có một sự im lặng đến khó chịu."
                    },
                    {
                        "en": "uncomfortable about doing something She was always a little uncomfortable about being photographed.",
                        "vi": "không thoải mái khi làm điều gì đó Cô ấy luôn có chút khó chịu khi bị chụp ảnh."
                    },
                    {
                        "en": "uncomfortable about something They are uncomfortable about the compromises they have made.",
                        "vi": "không thoải mái về điều gì đó Họ không thoải mái về những thỏa hiệp mà họ đã thực hiện."
                    },
                    {
                        "en": "uncomfortable to do something The film is often very uncomfortable to watch.",
                        "vi": "không thoải mái khi làm điều gì đó Bộ phim thường rất khó chịu khi xem."
                    },
                    {
                        "en": "it is uncomfortable to do something It is very uncomfortable to have to admit that we might share some responsibility for the situation.",
                        "vi": "không thoải mái khi phải làm điều gì đó Thật không thoải mái khi phải thừa nhận rằng chúng ta có thể chia sẻ một số trách nhiệm về tình huống này."
                    }
                ]
            },
            {
                "define": {
                    "en": "unpleasant or difficult to deal with",
                    "vi": "khó chịu hoặc khó đối phó"
                },
                "examples": [
                    {
                        "en": "an uncomfortable fact",
                        "vi": "một sự thật khó chịu"
                    },
                    {
                        "en": "I had the uncomfortable feeling that it was my fault.",
                        "vi": "Tôi có cảm giác khó chịu rằng đó là lỗi của tôi."
                    },
                    {
                        "en": "Her letter was an uncomfortable reminder of responsibilities I preferred to forget about.",
                        "vi": "Bức thư của cô ấy là một lời nhắc nhở không thoải mái về những trách nhiệm mà tôi muốn quên đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "f7a8b700d1374df484cc74deabf59ebd",
        "word": "agitated",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈædʒɪteɪtɪd/",
            "us": "/ˈædʒɪteɪtɪd/"
        },
        "nearby": [
            {
                "word": "agism",
                "pos": "noun"
            },
            {
                "word": "agitate",
                "pos": "verb"
            },
            {
                "word": "agitated",
                "pos": "adjective"
            },
            {
                "word": "agitation",
                "pos": "noun"
            },
            {
                "word": "agitato",
                "pos": "adjective, adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing in your behaviour that you are anxious and nervous",
                    "vi": "thể hiện trong hành vi của bạn rằng bạn đang lo lắng và hồi hộp"
                },
                "examples": [
                    {
                        "en": "Calm down! Don't get so agitated.",
                        "vi": "Bình tĩnh! Đừng kích động như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "efd1b746b1d2491f8048200e795cefe1",
        "word": "dread",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dred/",
            "us": "/dred/"
        },
        "nearby": [
            {
                "word": "draw upon",
                "pos": "phrasal verb"
            },
            {
                "word": "dray",
                "pos": "noun"
            },
            {
                "word": "dread",
                "pos": "verb"
            },
            {
                "word": "dread",
                "pos": "noun"
            },
            {
                "word": "dread",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be very afraid of something; to fear that something bad is going to happen",
                    "vi": "rất sợ một cái gì đó; sợ rằng điều gì đó tồi tệ sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "dread something This was the moment he had been dreading.",
                        "vi": "sợ hãi điều gì đó Đây là khoảnh khắc anh ấy đã từng sợ hãi."
                    },
                    {
                        "en": "dread doing something I dread being sick.",
                        "vi": "sợ làm điều gì đó tôi sợ bị ốm."
                    },
                    {
                        "en": "dread somebody doing something She dreads her husband finding out.",
                        "vi": "sợ ai đó làm điều gì đó Cô ấy sợ chồng mình phát hiện ra."
                    },
                    {
                        "en": "dread to do something I dread to think what would happen if there really was a fire here.",
                        "vi": "sợ làm điều gì đó mà tôi sợ khi nghĩ điều gì sẽ xảy ra nếu thực sự có hỏa hoạn ở đây."
                    },
                    {
                        "en": "dread that… I both hoped and dreaded that he would come.",
                        "vi": "sợ rằng… tôi vừa hy vọng vừa sợ rằng anh ấy sẽ đến."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e6a168867cc40d4b6dfa793d1c770ef",
        "word": "dread",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dred/",
            "us": "/dred/"
        },
        "nearby": [
            {
                "word": "dray",
                "pos": "noun"
            },
            {
                "word": "dread",
                "pos": "verb"
            },
            {
                "word": "dread",
                "pos": "noun"
            },
            {
                "word": "dread",
                "pos": "adjective"
            },
            {
                "word": "dreaded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great fear about something that might or will happen in the future; a thing that causes this feeling",
                    "vi": "cảm giác vô cùng sợ hãi về một điều gì đó có thể hoặc sẽ xảy ra trong tương lai; một thứ gây ra cảm giác này"
                },
                "examples": [
                    {
                        "en": "The prospect of growing old fills me with dread.",
                        "vi": "Viễn cảnh già đi khiến tôi lo sợ."
                    },
                    {
                        "en": "She has an irrational dread of hospitals.",
                        "vi": "Cô ấy có một nỗi sợ hãi vô lý của các bệnh viện."
                    },
                    {
                        "en": "The committee members live in dread of (= are always worried about) anything that may cause a scandal.",
                        "vi": "Các thành viên của ủy ban sống trong nỗi sợ hãi (= luôn lo lắng về) bất cứ điều gì có thể gây ra một vụ bê bối."
                    },
                    {
                        "en": "My greatest dread is that my parents will find out.",
                        "vi": "Nỗi sợ hãi lớn nhất của tôi là cha mẹ tôi sẽ phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "dreadlocks (= hair that is twisted into long thick pieces that hang down from the head, worn especially by Rastafarians)",
                    "vi": "dreadlocks (= tóc xoắn thành những sợi dài dày rủ xuống khỏi đầu, đặc biệt là của người Rastafarians)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6bef99d9c3d8460a9dcaddd5f1bd664c",
        "word": "insecure",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnsɪˈkjʊə(r)/",
            "us": "/ˌɪnsɪˈkjʊr/"
        },
        "nearby": [
            {
                "word": "insectivore",
                "pos": "noun"
            },
            {
                "word": "insectivorous",
                "pos": "adjective"
            },
            {
                "word": "insecure",
                "pos": "adjective"
            },
            {
                "word": "insecurely",
                "pos": "adverb"
            },
            {
                "word": "insecurity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not confident about yourself or your relationships with other people",
                    "vi": "không tự tin về bản thân hoặc các mối quan hệ của bạn với người khác"
                },
                "examples": [
                    {
                        "en": "He's very insecure about his appearance.",
                        "vi": "Anh ấy rất tự ti về ngoại hình của mình."
                    },
                    {
                        "en": "She felt nervous and insecure.",
                        "vi": "Cô cảm thấy lo lắng và bất an."
                    }
                ]
            },
            {
                "define": {
                    "en": "not safe or protected",
                    "vi": "không an toàn hoặc được bảo vệ"
                },
                "examples": [
                    {
                        "en": "Jobs nowadays are much more insecure than they were ten years ago.",
                        "vi": "Việc làm ngày nay không an toàn hơn nhiều so với mười năm trước."
                    },
                    {
                        "en": "As an artist he was always financially insecure.",
                        "vi": "Là một nghệ sĩ, anh luôn không đảm bảo về tài chính."
                    },
                    {
                        "en": "Many people use insecure passwords or they use the same password for everything.",
                        "vi": "Nhiều người sử dụng mật khẩu không an toàn hoặc họ sử dụng cùng một mật khẩu cho mọi thứ."
                    },
                    {
                        "en": "Insecure doors and windows (= for example, without good locks) make life easy for burglars.",
                        "vi": "Cửa ra vào và cửa sổ không an toàn (= ví dụ: không có khóa tốt) dễ khiến kẻ trộm sống sót."
                    },
                    {
                        "en": "men who are worried about losing their jobs and becoming financially insecure",
                        "vi": "những người đàn ông lo lắng về việc mất việc làm và trở nên không an toàn về tài chính"
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to move, fall down, etc.",
                    "vi": "có khả năng di chuyển, rơi xuống, v.v."
                },
                "examples": [
                    {
                        "en": "an insecure ladder/footbridge",
                        "vi": "thang / cầu đi bộ không an toàn"
                    }
                ]
            }
        ]
    },
    {
        "id": "1e775e725989467d8aab79f8c9995941",
        "word": "insecurity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnsɪˈkjʊərəti/",
            "us": "/ˌɪnsɪˈkjʊrəti/"
        },
        "nearby": [
            {
                "word": "insecure",
                "pos": "adjective"
            },
            {
                "word": "insecurely",
                "pos": "adverb"
            },
            {
                "word": "insecurity",
                "pos": "noun"
            },
            {
                "word": "inseminate",
                "pos": "verb"
            },
            {
                "word": "insemination",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lack of confidence about yourself or your relationships with other people; something that makes you feel like this",
                    "vi": "thiếu tự tin về bản thân hoặc các mối quan hệ của bạn với người khác; điều gì đó khiến bạn cảm thấy như thế này"
                },
                "examples": [
                    {
                        "en": "feelings of insecurity",
                        "vi": "cảm giác bất an"
                    },
                    {
                        "en": "We all have our fears and insecurities.",
                        "vi": "Tất cả chúng ta đều có những nỗi sợ hãi và bất an của mình."
                    },
                    {
                        "en": "The incident brought back childhood insecurities.",
                        "vi": "Vụ việc kéo theo những bất an của tuổi thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not being safe or protected",
                    "vi": "tình trạng không được an toàn hoặc không được bảo vệ"
                },
                "examples": [
                    {
                        "en": "job insecurity",
                        "vi": "công việc không an toàn"
                    },
                    {
                        "en": "the insecurity of wireless networks",
                        "vi": "sự mất an toàn của mạng không dây"
                    },
                    {
                        "en": "There are two ways you can suffer from online insecurity that are easy to address:…",
                        "vi": "Có hai cách bạn có thể gặp phải tình trạng mất an toàn trực tuyến mà bạn có thể dễ dàng giải quyết:…"
                    }
                ]
            }
        ]
    },
    {
        "id": "e742ccc229e842039346f6984c3579de",
        "word": "self-conscious",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌself ˈkɒnʃəs/",
            "us": "/ˌself ˈkɑːnʃəs/"
        },
        "nearby": [
            {
                "word": "self-congratulation",
                "pos": "noun"
            },
            {
                "word": "self-congratulatory",
                "pos": "adjective"
            },
            {
                "word": "self-conscious",
                "pos": "adjective"
            },
            {
                "word": "self-consciously",
                "pos": "adverb"
            },
            {
                "word": "self-consciousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous or embarrassed about your appearance or what other people think of you",
                    "vi": "lo lắng hoặc xấu hổ về ngoại hình của bạn hoặc những gì người khác nghĩ về bạn"
                },
                "examples": [
                    {
                        "en": "He's always been self-conscious about being so short.",
                        "vi": "Anh ấy luôn tự ý thức về việc mình quá lùn."
                    },
                    {
                        "en": "She was a shy, self-conscious girl.",
                        "vi": "Cô là một cô gái nhút nhát, thiếu tự chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "done in a way that shows you are aware of the effect that is being produced",
                    "vi": "được thực hiện theo cách cho thấy bạn nhận thức được hiệu ứng đang được tạo ra"
                },
                "examples": [
                    {
                        "en": "The humour of the play is self-conscious and contrived.",
                        "vi": "Sự hài hước của vở kịch là tự ý thức và được tạo ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f1bcb527d964fb29861fe464f05cdd1",
        "word": "tense",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/tens/",
            "us": "/tens/"
        },
        "nearby": [
            {
                "word": "tenpin",
                "pos": "noun"
            },
            {
                "word": "tenpin bowling",
                "pos": "noun"
            },
            {
                "word": "tense",
                "pos": "adjective"
            },
            {
                "word": "tense",
                "pos": "noun"
            },
            {
                "word": "tense",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous or worried, and unable to relax",
                    "vi": "hồi hộp hoặc lo lắng và không thể thư giãn"
                },
                "examples": [
                    {
                        "en": "He's a very tense person.",
                        "vi": "Anh ấy là một người rất căng thẳng."
                    },
                    {
                        "en": "She sounded tense and angry.",
                        "vi": "Cô ấy có vẻ căng thẳng và tức giận."
                    }
                ]
            },
            {
                "define": {
                    "en": "in which people have strong feelings such as worry, anger, etc. that often cannot be expressed openly",
                    "vi": "trong đó mọi người có những cảm xúc mạnh mẽ như lo lắng, tức giận, v.v. mà thường không thể bộc lộ một cách công khai"
                },
                "examples": [
                    {
                        "en": "I spent a tense few weeks waiting for the results of the tests.",
                        "vi": "Tôi đã mất một vài tuần căng thẳng để chờ đợi kết quả của các bài kiểm tra."
                    },
                    {
                        "en": "The atmosphere in the meeting was getting more and more tense.",
                        "vi": "Không khí trong cuộc họp ngày càng căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "tight rather than relaxed",
                    "vi": "chặt chẽ hơn là thoải mái"
                },
                "examples": [
                    {
                        "en": "A massage will relax those tense muscles.",
                        "vi": "Mát-xa sẽ giúp thư giãn các cơ đang căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "stretched tightly",
                    "vi": "kéo căng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "produced with the muscles of the speech organs stretched tight",
                    "vi": "được tạo ra với các cơ của các cơ quan ngôn ngữ được kéo căng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a326aca11664562b715d0343c0604b9",
        "word": "tremble",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtrembl/",
            "us": "/ˈtrembl/"
        },
        "nearby": [
            {
                "word": "Trekkie",
                "pos": "noun"
            },
            {
                "word": "trellis",
                "pos": "noun"
            },
            {
                "word": "tremble",
                "pos": "verb"
            },
            {
                "word": "tremble",
                "pos": "noun"
            },
            {
                "word": "trembly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to shake in a way that you cannot control, especially because you are very nervous, excited, frightened, etc.",
                    "vi": "lắc theo cách mà bạn không thể kiểm soát, đặc biệt là vì bạn đang rất lo lắng, phấn khích, sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "My legs were trembling with fear.",
                        "vi": "Chân tôi run lên vì sợ hãi."
                    },
                    {
                        "en": "Her voice trembled with excitement.",
                        "vi": "Giọng cô ấy run lên vì phấn khích."
                    },
                    {
                        "en": "He opened the letter with trembling hands.",
                        "vi": "Anh mở lá thư với đôi tay run rẩy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shake slightly",
                    "vi": "lắc nhẹ"
                },
                "examples": [
                    {
                        "en": "leaves trembling in the breeze",
                        "vi": "lá rung rinh trong gió"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very worried or frightened",
                    "vi": "rất lo lắng hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "I trembled at the thought of having to make a speech.",
                        "vi": "Tôi run lên khi nghĩ đến việc phải phát biểu."
                    },
                    {
                        "en": "The thought made him tremble inside.",
                        "vi": "Ý nghĩ đó khiến anh run lên trong lòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "10b0c515c2f94eecb59698fa87d5d053",
        "word": "agitation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌædʒɪˈteɪʃn/",
            "us": "/ˌædʒɪˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "agitate",
                "pos": "verb"
            },
            {
                "word": "agitated",
                "pos": "adjective"
            },
            {
                "word": "agitation",
                "pos": "noun"
            },
            {
                "word": "agitato",
                "pos": "adjective, adverb"
            },
            {
                "word": "agitator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "worry that you show by behaving in a nervous way",
                    "vi": "lo lắng rằng bạn thể hiện bằng cách cư xử một cách lo lắng"
                },
                "examples": [
                    {
                        "en": "Dot arrived in a state of great agitation.",
                        "vi": "Dot đến trong trạng thái vô cùng kích động."
                    }
                ]
            },
            {
                "define": {
                    "en": "public protest in order to achieve political change",
                    "vi": "phản đối công khai để đạt được thay đổi chính trị"
                },
                "examples": [
                    {
                        "en": "widespread agitation for social reform",
                        "vi": "kích động rộng rãi để cải cách xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "a public meeting or a march (= an organized walk by many people) at which people show that they are protesting against or supporting something",
                    "vi": "một cuộc họp công khai hoặc một cuộc tuần hành (= một cuộc đi bộ có tổ chức của nhiều người) mà tại đó mọi người cho thấy rằng họ đang phản đối hoặc ủng hộ điều gì đó"
                },
                "examples": [
                    {
                        "en": "The situation has provoked agitations all over the region.",
                        "vi": "Tình hình đã gây ra sự kích động khắp khu vực."
                    },
                    {
                        "en": "Protesters are expected to launch an agitation over the issue.",
                        "vi": "Những người biểu tình dự kiến sẽ kích động về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of mixing or shaking a liquid",
                    "vi": "hành động trộn hoặc lắc chất lỏng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d1a00676f6c470f9860fc803d4f0fd3",
        "word": "be a bag/bundle of nerves",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/nɜːv/",
            "us": "/nɜːrv/"
        },
        "nearby": [
            {
                "word": "nerd",
                "pos": "noun"
            },
            {
                "word": "nerdy",
                "pos": "adjective"
            },
            {
                "word": "nerve",
                "pos": "noun"
            },
            {
                "word": "nerve",
                "pos": "verb"
            },
            {
                "word": "nerve agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the long fibres that carry messages between the brain and parts of the body, enabling you to move, feel pain, etc.",
                    "vi": "bất kỳ sợi dài nào mang thông điệp giữa não và các bộ phận của cơ thể, cho phép bạn cử động, cảm thấy đau, v.v."
                },
                "examples": [
                    {
                        "en": "the optic nerve",
                        "vi": "dây thần kinh thị giác"
                    },
                    {
                        "en": "He's off work with a trapped nerve in his neck.",
                        "vi": "Anh ấy đang nghỉ việc với một dây thần kinh bị kẹt ở cổ."
                    },
                    {
                        "en": "Every nerve in her body was tense.",
                        "vi": "Mọi dây thần kinh trong cơ thể cô đều căng thẳng."
                    },
                    {
                        "en": "The illness kills nerve cells and causes chronic fatigue.",
                        "vi": "Căn bệnh này giết chết các tế bào thần kinh và gây ra tình trạng mệt mỏi mãn tính."
                    },
                    {
                        "en": "Pain occurs when the nerve fibres are damaged.",
                        "vi": "Đau xảy ra khi các sợi thần kinh bị tổn thương."
                    },
                    {
                        "en": "Signals are transmitted from the nerve endings to the brain.",
                        "vi": "Tín hiệu được truyền từ đầu dây thần kinh đến não."
                    },
                    {
                        "en": "The disease can also cause nerve damage.",
                        "vi": "Bệnh cũng có thể gây tổn thương dây thần kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of worry or stress",
                    "vi": "cảm giác lo lắng hoặc căng thẳng"
                },
                "examples": [
                    {
                        "en": "Even after years as a singer, he still suffers from nerves before a performance.",
                        "vi": "Ngay cả sau nhiều năm làm ca sĩ, anh ấy vẫn bị căng thẳng trước một buổi biểu diễn."
                    },
                    {
                        "en": "I need something to calm my nerves.",
                        "vi": "Tôi cần thứ gì đó để xoa dịu thần kinh của mình."
                    },
                    {
                        "en": "to settle/soothe/steady your nerves",
                        "vi": "để giải quyết / làm dịu / ổn định thần kinh của bạn"
                    },
                    {
                        "en": "Everyone's nerves were on edge (= everyone felt tense).",
                        "vi": "Mọi người đều căng thẳng (= mọi người đều cảm thấy căng thẳng)."
                    },
                    {
                        "en": "He lives on his nerves (= is always worried).",
                        "vi": "Anh ấy sống dựa vào thần kinh của mình (= luôn lo lắng)."
                    },
                    {
                        "en": "By the end of the meal her nerves were completely frayed.",
                        "vi": "Đến cuối bữa ăn, thần kinh của cô hoàn toàn không còn sức lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage to do something difficult or dangerous",
                    "vi": "can đảm để làm điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It took a lot of nerve to take the company to court.",
                        "vi": "Phải rất căng thẳng để đưa công ty ra tòa."
                    },
                    {
                        "en": "I was going to have a go at parachuting but lost my nerve at the last minute.",
                        "vi": "Tôi đã định nhảy dù nhưng bị mất thần kinh vào phút cuối."
                    },
                    {
                        "en": "He held his nerve to win the final set 6–4.",
                        "vi": "Anh ấy đã cố gắng để giành chiến thắng trong set 6–4 cuối cùng."
                    },
                    {
                        "en": "Investors largely kept their nerve and stayed with the company.",
                        "vi": "Các nhà đầu tư chủ yếu giữ vững tâm lý và ở lại với công ty."
                    },
                    {
                        "en": "It was an amazing journey which tested her nerves to the full.",
                        "vi": "Đó là một cuộc hành trình tuyệt vời đã kiểm tra thần kinh của cô ấy một cách đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that other people think is rude or not appropriate",
                    "vi": "một cách cư xử mà người khác cho là thô lỗ hoặc không phù hợp"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the nerve to show your face after what you said!",
                        "vi": "Tôi không biết làm thế nào bạn có đủ can đảm để lộ ra khuôn mặt của bạn sau những gì bạn nói!"
                    },
                    {
                        "en": "He's got a nerve asking us for money!",
                        "vi": "Anh ta có gan đòi tiền chúng tôi!"
                    },
                    {
                        "en": "‘Then she demanded to see the manager!’ ‘What a nerve!’",
                        "vi": "Sau đó cô ấy yêu cầu gặp người quản lý!' 'Thật là một thần kinh!'"
                    },
                    {
                        "en": "He had some nerve to insult Mina's cooking.",
                        "vi": "Anh ta có chút gan dạ để xúc phạm công việc nấu nướng của Mina."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "By the time of the interview, I was a bundle of nerves.",
                        "vi": "Vào thời điểm phỏng vấn, tôi đã bó tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "That music is starting to get on my nerves.",
                        "vi": "Âm nhạc đó đang bắt đầu làm tôi lo lắng."
                    },
                    {
                        "en": "It really gets on my nerves when people talk loudly on the phone in public.",
                        "vi": "Tôi thực sự lo lắng khi mọi người nói chuyện điện thoại ồn ào ở nơi công cộng."
                    },
                    {
                        "en": "His endless whining really gets on my nerves.",
                        "vi": "Tiếng rên rỉ bất tận của anh ấy thực sự làm tôi lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to remain calm in a difficult or dangerous situation",
                    "vi": "để có thể giữ bình tĩnh trong một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "You need nerves of steel to be a good poker player.",
                        "vi": "Bạn cần có thần kinh thép để trở thành một người chơi poker giỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention a subject that makes somebody feel angry, upset, embarrassed, etc.",
                    "vi": "đề cập đến một chủ đề khiến ai đó cảm thấy tức giận, khó chịu, xấu hổ, v.v."
                },
                "examples": [
                    {
                        "en": "You touched a raw nerve when you mentioned his first wife.",
                        "vi": "Bạn đã xúc động mạnh khi nhắc đến người vợ đầu tiên của anh ấy."
                    },
                    {
                        "en": "My remarks about divorce had unwittingly touched a raw nerve.",
                        "vi": "Những nhận xét của tôi về việc ly hôn đã vô tình chạm vào một dây thần kinh thô."
                    },
                    {
                        "en": "The article struck a raw nerve as it revived unpleasant memories.",
                        "vi": "Bài báo đánh vào một dây thần kinh thô khi nó làm sống lại những ký ức khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try as hard as you can to do something",
                    "vi": "cố gắng hết sức có thể để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He strained every nerve to snatch victory from defeat.",
                        "vi": "Anh ta căng mọi dây thần kinh để giành lấy chiến thắng từ thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a strong effect",
                    "vi": "để có một hiệu ứng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His work strikes a nerve with people who are attracted to nostalgia.",
                        "vi": "Tác phẩm của anh gây ấn tượng mạnh với những người bị thu hút bởi sự hoài cổ."
                    },
                    {
                        "en": "It seems I struck a nerve with my last post about cell phones.",
                        "vi": "Có vẻ như tôi đã giật mình với bài viết cuối cùng của tôi về điện thoại di động."
                    },
                    {
                        "en": "Nissan may well strike a popular nerve here.",
                        "vi": "Nissan cũng có thể tấn công một thần kinh phổ biến ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence",
                    "vi": "nỗ lực đánh bại đối thủ của bạn bằng cách gây áp lực lên họ để họ mất can đảm hoặc tự tin"
                },
                "examples": [
                    {
                        "en": "The union has been fighting a war of nerves with the management over pay.",
                        "vi": "Công đoàn đã phải đối mặt với một cuộc chiến căng thẳng với việc quản lý quá mức lương."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3dc4ab8ea8e410caee9740af04d3381",
        "word": "be on edge",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/edʒ/",
            "us": "/edʒ/"
        },
        "nearby": [
            {
                "word": "the Eden Project",
                "pos": ""
            },
            {
                "word": "Edgbaston",
                "pos": ""
            },
            {
                "word": "edge",
                "pos": "noun"
            },
            {
                "word": "edge",
                "pos": "verb"
            },
            {
                "word": "edge case",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outside limit of an object, a surface or an area; the part furthest from the centre",
                    "vi": "giới hạn bên ngoài của một vật thể, một bề mặt hoặc một khu vực; phần xa nhất từ trung tâm"
                },
                "examples": [
                    {
                        "en": "I gripped the edge of my desk to steady myself.",
                        "vi": "Tôi nắm chặt mép bàn của mình để ổn định bản thân."
                    },
                    {
                        "en": "the first spacecraft to travel to the edge of the solar system.",
                        "vi": "tàu vũ trụ đầu tiên du hành đến rìa của hệ mặt trời."
                    },
                    {
                        "en": "on the edge of something He stood on the edge of the cliff.",
                        "vi": "trên bờ vực của một cái gì đó Anh ấy đứng trên mép của vách đá."
                    },
                    {
                        "en": "Stand the coin on its edge.",
                        "vi": "Đặt đồng xu trên cạnh của nó."
                    },
                    {
                        "en": "at the edge of something a big house on/at the edge of town",
                        "vi": "ở rìa của một cái gì đó một ngôi nhà lớn trên / ở rìa thị trấn"
                    },
                    {
                        "en": "I sat down at the water's edge.",
                        "vi": "Tôi ngồi xuống mép nước."
                    },
                    {
                        "en": "near the edge of something Don't put that glass so near the edge of the table.",
                        "vi": "gần mép của một cái gì đó Đừng đặt cái ly đó quá gần mép bàn."
                    },
                    {
                        "en": "She tore the page out roughly, leaving a ragged edge in the book.",
                        "vi": "Cô ấy xé toạc trang sách ra, để lại một mép sách rách rưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sharp part of a knife, blade or sword that is used for cutting",
                    "vi": "phần sắc bén của dao, lưỡi hoặc kiếm được sử dụng để cắt"
                },
                "examples": [
                    {
                        "en": "Be careful—it has a sharp edge.",
                        "vi": "Hãy cẩn thận — nó có một cạnh sắc."
                    },
                    {
                        "en": "a knife with a serrated edge",
                        "vi": "một con dao có một cạnh răng cưa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the point at which something, especially something bad, may begin to happen",
                    "vi": "thời điểm mà tại đó điều gì đó, đặc biệt là điều gì đó tồi tệ, có thể bắt đầu xảy ra"
                },
                "examples": [
                    {
                        "en": "They had brought the country to the edge of disaster.",
                        "vi": "Họ đã đưa đất nước đến bờ vực của thảm họa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a slight advantage over somebody/something",
                    "vi": "một lợi thế nhỏ so với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company needs to improve its competitive edge.",
                        "vi": "Công ty cần nâng cao lợi thế cạnh tranh của mình."
                    },
                    {
                        "en": "edge on/over somebody/something They have the edge on us.",
                        "vi": "cạnh trên / hơn ai đó / cái gì đó Họ có lợi thế về chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong, often exciting, quality",
                    "vi": "một chất lượng mạnh mẽ, thường thú vị"
                },
                "examples": [
                    {
                        "en": "Her show now has a hard political edge to it.",
                        "vi": "Chương trình của cô ấy bây giờ có một khía cạnh chính trị khó khăn cho nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp tone of voice, often showing anger",
                    "vi": "một giọng nói sắc bén, thường thể hiện sự tức giận"
                },
                "examples": [
                    {
                        "en": "He did his best to remain calm, but there was a distinct edge to his voice.",
                        "vi": "Anh ấy đã cố gắng hết sức để giữ bình tĩnh, nhưng có một khía cạnh khác biệt trong giọng nói của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of edge or edges mentioned",
                    "vi": "có loại cạnh hoặc các cạnh được đề cập"
                },
                "examples": [
                    {
                        "en": "a lace-edged handkerchief",
                        "vi": "một chiếc khăn tay viền ren"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be nervous, excited or easily made angry",
                    "vi": "lo lắng, phấn khích hoặc dễ nổi giận"
                },
                "examples": [
                    {
                        "en": "He was of a nervous disposition.",
                        "vi": "Anh ấy có một tâm lý lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult situation where any mistake may be very dangerous",
                    "vi": "rơi vào một tình huống khó khăn mà bất kỳ sai lầm nào cũng có thể rất nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Social workers operate on the razor’s edge.",
                        "vi": "Nhân viên xã hội hoạt động trên lưỡi dao cạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to come apart or to fail",
                    "vi": "bắt đầu tan rã hoặc thất bại"
                },
                "examples": [
                    {
                        "en": "Support for the leader was fraying at the edges.",
                        "vi": "Sự ủng hộ dành cho các nhà lãnh đạo đã không còn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very excited and giving your full attention to something",
                    "vi": "rất hào hứng và dành toàn bộ sự chú ý của bạn cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "The game had the crowd on the edge of their seats.",
                        "vi": "Trò chơi có rất nhiều khán giả ở mép ghế của họ."
                    },
                    {
                        "en": "I was on the edge of my seat waiting to find out what happened next.",
                        "vi": "Tôi đang ngồi trên mép ghế chờ xem chuyện gì xảy ra tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to lose control of their behaviour, usually after a particular event or series of events",
                    "vi": "buộc ai đó mất kiểm soát hành vi của họ, thường là sau một sự kiện cụ thể hoặc một chuỗi sự kiện"
                },
                "examples": [
                    {
                        "en": "No one knows exactly what caused his breakdown, but losing his job may have pushed him over the edge.",
                        "vi": "Không ai biết chính xác điều gì đã gây ra sự suy sụp của anh ấy, nhưng việc mất việc có thể đã đẩy anh ấy đến bờ vực thẳm."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have some) small parts, for example in a performance or in your character, that are not yet as good as they should be",
                    "vi": "(để có một số) phần nhỏ, ví dụ như trong một buổi biểu diễn hoặc trong nhân vật của bạn, chưa được như mong muốn"
                },
                "examples": [
                    {
                        "en": "The ballet still had some rough edges.",
                        "vi": "Vở ba lê vẫn còn một số góc cạnh thô ráp."
                    },
                    {
                        "en": "He had a few rough edges knocked off at school.",
                        "vi": "Anh ấy đã có một vài cú va chạm thô bạo ở trường."
                    },
                    {
                        "en": "The films are very rough around the edges.",
                        "vi": "Các bộ phim rất thô xung quanh các cạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel physically uncomfortable",
                    "vi": "làm cho ai đó cảm thấy khó chịu về thể chất"
                },
                "examples": [
                    {
                        "en": "Just the sound of her voice sets my teeth on edge.",
                        "vi": "Chỉ cần âm thanh của giọng nói của cô ấy khiến răng tôi căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something less strong, less bad, etc.",
                    "vi": "để làm cho một cái gì đó ít mạnh hơn, ít xấu hơn, v.v."
                },
                "examples": [
                    {
                        "en": "The sandwich took the edge off my appetite.",
                        "vi": "Chiếc bánh sandwich đã làm giảm cảm giác thèm ăn của tôi."
                    },
                    {
                        "en": "I just need something to take the edge off.",
                        "vi": "Tôi chỉ cần một cái gì đó để có lợi thế."
                    },
                    {
                        "en": "I took an aspirin to take the edge off the pain.",
                        "vi": "Tôi đã uống một viên aspirin để giảm đau."
                    },
                    {
                        "en": "A squeeze of lemon takes the edge off the sweetness.",
                        "vi": "Vắt chanh giúp giảm bớt vị ngọt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very close to a very unpleasant or dangerous situation",
                    "vi": "rất gần với một tình huống rất khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The country is teetering on the edge of civil war.",
                        "vi": "Đất nước này đang đứng trên bờ vực của cuộc nội chiến."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e05a09aead24352adad23e1b6ed4ec2",
        "word": "brood",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bruːd/",
            "us": "/bruːd/"
        },
        "nearby": [
            {
                "word": "bronze medallist",
                "pos": "noun"
            },
            {
                "word": "brooch",
                "pos": "noun"
            },
            {
                "word": "brood",
                "pos": "verb"
            },
            {
                "word": "brood",
                "pos": "noun"
            },
            {
                "word": "broodiness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to think a lot about something that makes you annoyed, anxious or upset",
                    "vi": "suy nghĩ nhiều về điều gì đó khiến bạn khó chịu, lo lắng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "You're not still brooding over what he said, are you?",
                        "vi": "Bạn vẫn chưa nghiền ngẫm về những gì anh ấy nói, phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a bird broods, or broods its eggs, it sits on the eggs in order to hatch them (= make the young come out of them)",
                    "vi": "nếu một con chim ấp, hoặc ấp trứng của nó, nó sẽ ngồi trên những quả trứng để ấp (= làm cho con non ra khỏi chúng)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "558d3141299c415bb942e2c989142183",
        "word": "diffidence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɪfɪdəns/",
            "us": "/ˈdɪfɪdəns/"
        },
        "nearby": [
            {
                "word": "difficult",
                "pos": "adjective"
            },
            {
                "word": "difficulty",
                "pos": "noun"
            },
            {
                "word": "diffidence",
                "pos": "noun"
            },
            {
                "word": "diffident",
                "pos": "adjective"
            },
            {
                "word": "diffidently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lack of confidence in yourself; being unwilling to talk about yourself",
                    "vi": "thiếu tự tin vào bản thân; không muốn nói về bản thân"
                },
                "examples": [
                    {
                        "en": "She overcame her natural diffidence and spoke with great frankness.",
                        "vi": "Cô ấy đã vượt qua sự khác biệt tự nhiên của mình và nói chuyện rất thẳng thắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "a268172225864831a236480eef9c5d9d",
        "word": "diffident",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɪfɪdənt/",
            "us": "/ˈdɪfɪdənt/"
        },
        "nearby": [
            {
                "word": "difficulty",
                "pos": "noun"
            },
            {
                "word": "diffidence",
                "pos": "noun"
            },
            {
                "word": "diffident",
                "pos": "adjective"
            },
            {
                "word": "diffidently",
                "pos": "adverb"
            },
            {
                "word": "diffract",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not having much confidence in yourself; not wanting to talk about yourself",
                    "vi": "không có nhiều tự tin vào bản thân; không muốn nói về bản thân"
                },
                "examples": [
                    {
                        "en": "a diffident manner/smile",
                        "vi": "một cách tự tin / nụ cười"
                    },
                    {
                        "en": "He was modest and diffident about his own success.",
                        "vi": "Anh khiêm tốn và tự tin về thành công của chính mình."
                    },
                    {
                        "en": "She felt diffident about speaking in public.",
                        "vi": "Cô cảm thấy tự tin khi nói trước đám đông."
                    },
                    {
                        "en": "Greg was the quiet, diffident type.",
                        "vi": "Greg là kiểu người trầm lặng, khác biệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "4f4c2665b96d4cfc8f9e08541b9b0aab",
        "word": "edgy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈedʒi/",
            "us": "/ˈedʒi/"
        },
        "nearby": [
            {
                "word": "edginess",
                "pos": "noun"
            },
            {
                "word": "edging",
                "pos": "noun"
            },
            {
                "word": "edgy",
                "pos": "adjective"
            },
            {
                "word": "EDI",
                "pos": "noun"
            },
            {
                "word": "edible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous, especially about what might happen",
                    "vi": "lo lắng, đặc biệt là về những gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "She's been very edgy lately.",
                        "vi": "Cô ấy gần đây rất khó chịu."
                    },
                    {
                        "en": "After the recent unrest there is an edgy calm in the capital.",
                        "vi": "Sau những bất ổn gần đây, có một sự bình tĩnh sắc nét ở thủ đô."
                    },
                    {
                        "en": "I’m feeling a bit edgy about the exam tomorrow.",
                        "vi": "Tôi cảm thấy một chút khó khăn về kỳ thi ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a sharp exciting quality",
                    "vi": "có một chất lượng thú vị sắc nét"
                },
                "examples": [
                    {
                        "en": "a clever, edgy film",
                        "vi": "một bộ phim thông minh, sắc sảo"
                    },
                    {
                        "en": "the Ska beat, faster than reggae and a bit edgier",
                        "vi": "nhịp điệu Ska, nhanh hơn reggae và một chút sắc bén"
                    },
                    {
                        "en": "Her ideal man would be ‘edgy’.",
                        "vi": "Người đàn ông lý tưởng của cô ấy sẽ là một người 'sắc sảo'."
                    }
                ]
            }
        ]
    },
    {
        "id": "4139cbfb7aaf4d68b463aa6b2530b78b",
        "word": "fidget",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪdʒɪt/",
            "us": "/ˈfɪdʒɪt/"
        },
        "nearby": [
            {
                "word": "fiddly",
                "pos": "adjective"
            },
            {
                "word": "fidelity",
                "pos": "noun"
            },
            {
                "word": "fidget",
                "pos": "verb"
            },
            {
                "word": "fidget",
                "pos": "noun"
            },
            {
                "word": "fidget spinner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep moving your body, your hands or your feet because you are nervous, bored, excited, etc.",
                    "vi": "tiếp tục cử động cơ thể, bàn tay hoặc bàn chân của bạn vì bạn đang lo lắng, buồn chán, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "Sit still and stop fidgeting!",
                        "vi": "Ngồi yên và đừng bồn chồn nữa!"
                    }
                ]
            }
        ]
    },
    {
        "id": "e4d3deb7b14d4bd8b3195bd911cc1719",
        "word": "fidgety",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪdʒɪti/",
            "us": "/ˈfɪdʒɪti/"
        },
        "nearby": [
            {
                "word": "fidget",
                "pos": "noun"
            },
            {
                "word": "fidget spinner",
                "pos": "noun"
            },
            {
                "word": "fidgety",
                "pos": "adjective"
            },
            {
                "word": "fiduciary",
                "pos": "adjective"
            },
            {
                "word": "fiduciary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unable to remain still or quiet, usually because of being bored or nervous",
                    "vi": "không thể đứng yên hoặc im lặng, thường là vì buồn chán hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "The children get fidgety if they have nothing to do.",
                        "vi": "Những đứa trẻ trở nên bồn chồn nếu chúng không có gì để làm."
                    },
                    {
                        "en": "As the questioning continued, he became fidgety and uneasy.",
                        "vi": "Khi câu hỏi tiếp tục, anh ta trở nên bồn chồn và khó chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "58ca38e672e5454393d160496ebfe8bf",
        "word": "fluster",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflʌstə(r)/",
            "us": "/ˈflʌstər/"
        },
        "nearby": [
            {
                "word": "flushed",
                "pos": "adjective"
            },
            {
                "word": "fluster",
                "pos": "verb"
            },
            {
                "word": "fluster",
                "pos": "noun"
            },
            {
                "word": "flustered",
                "pos": "adjective"
            },
            {
                "word": "flute",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state of being nervous and confused",
                    "vi": "trạng thái lo lắng và bối rối"
                },
                "examples": [
                    {
                        "en": "in a fluster to be in a terrible fluster",
                        "vi": "trong bối rối trở nên bối rối khủng khiếp"
                    }
                ]
            }
        ]
    },
    {
        "id": "f3f094402dc0469a9e4558a1af684318",
        "word": "fret",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/fret/",
            "us": "/fret/"
        },
        "nearby": [
            {
                "word": "freshwater",
                "pos": "adjective"
            },
            {
                "word": "Fresno",
                "pos": ""
            },
            {
                "word": "fret",
                "pos": "verb"
            },
            {
                "word": "fret",
                "pos": "noun"
            },
            {
                "word": "fretful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be worried or unhappy and not able to relax",
                    "vi": "lo lắng hoặc không vui và không thể thư giãn"
                },
                "examples": [
                    {
                        "en": "Her baby starts to fret as soon as she goes out of the room.",
                        "vi": "Em bé của cô ấy bắt đầu quấy khóc ngay khi cô ấy đi ra khỏi phòng."
                    },
                    {
                        "en": "Fretting, he looked again at his watch.",
                        "vi": "Phiền muộn, anh lại nhìn đồng hồ."
                    },
                    {
                        "en": "fret about something Fretting about it won't help.",
                        "vi": "băn khoăn về điều gì đó Băn khoăn về điều đó sẽ không ích gì."
                    },
                    {
                        "en": "fret over something He was fretting over his speech.",
                        "vi": "băn khoăn về điều gì đó Anh ấy đang băn khoăn về bài phát biểu của mình."
                    },
                    {
                        "en": "fret that… She fretted that nobody would show up.",
                        "vi": "băn khoăn về điều đó… Cô ấy băn khoăn rằng sẽ không có ai xuất hiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "49df84d3e50f42979b6772182487cbb3",
        "word": "fretful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfretfl/",
            "us": "/ˈfretfl/"
        },
        "nearby": [
            {
                "word": "fret",
                "pos": "verb"
            },
            {
                "word": "fret",
                "pos": "noun"
            },
            {
                "word": "fretful",
                "pos": "adjective"
            },
            {
                "word": "fretfully",
                "pos": "adverb"
            },
            {
                "word": "fretsaw",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a way that shows you are unhappy or uncomfortable",
                    "vi": "cư xử theo cách cho thấy bạn không hài lòng hoặc không thoải mái"
                },
                "examples": [
                    {
                        "en": "Babies soon become fretful when they are tired or hungry.",
                        "vi": "Trẻ sơ sinh sớm trở nên quấy khóc khi chúng mệt hoặc đói."
                    }
                ]
            }
        ]
    },
    {
        "id": "f701faee184744a98c468139532dfe28",
        "word": "get/have cold feet",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kəʊld/",
            "us": "/kəʊld/"
        },
        "nearby": [
            {
                "word": "colcannon",
                "pos": "noun"
            },
            {
                "word": "Colchester",
                "pos": ""
            },
            {
                "word": "cold",
                "pos": "adjective"
            },
            {
                "word": "cold",
                "pos": "noun"
            },
            {
                "word": "cold",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a lower than usual temperature; having a temperature lower than the human body",
                    "vi": "có nhiệt độ thấp hơn bình thường; có nhiệt độ thấp hơn cơ thể người"
                },
                "examples": [
                    {
                        "en": "I'm cold. Turn the heating up.",
                        "vi": "Tôi lạnh. Tăng nhiệt độ lên."
                    },
                    {
                        "en": "to feel cold",
                        "vi": "cảm thấy lạnh"
                    },
                    {
                        "en": "cold weather/temperatures/air",
                        "vi": "thời tiết lạnh / nhiệt độ / không khí"
                    },
                    {
                        "en": "a cold day/night/winter/wind",
                        "vi": "một ngày / đêm lạnh / mùa đông / gió"
                    },
                    {
                        "en": "a cold room/house",
                        "vi": "một căn phòng / nhà lạnh"
                    },
                    {
                        "en": "cold hands and feet",
                        "vi": "tay chân lạnh"
                    },
                    {
                        "en": "a cold beer",
                        "vi": "một cốc bia lạnh"
                    },
                    {
                        "en": "hot and cold water in every room",
                        "vi": "nước nóng và lạnh trong mỗi phòng"
                    },
                    {
                        "en": "I was thoroughly cold and wet now.",
                        "vi": "Tôi đã hoàn toàn lạnh và ướt bây giờ."
                    },
                    {
                        "en": "It's freezing cold.",
                        "vi": "Trời lạnh cóng."
                    },
                    {
                        "en": "Hurry up—your dinner's getting cold",
                        "vi": "Nhanh lên — bữa tối của bạn sắp nguội rồi"
                    },
                    {
                        "en": "a bitterly cold morning",
                        "vi": "một buổi sáng lạnh lẽo"
                    },
                    {
                        "en": "You look cold. Do you want to go back indoors?",
                        "vi": "Bạn trông rất lạnh lùng. Bạn có muốn quay lại trong nhà không?"
                    },
                    {
                        "en": "Isn't it cold today?",
                        "vi": "Hôm nay trời không lạnh phải không?"
                    },
                    {
                        "en": "It has suddenly turned very cold.",
                        "vi": "Trời đột ngột chuyển sang rất lạnh."
                    },
                    {
                        "en": "the coldest May on record",
                        "vi": "tháng 5 lạnh nhất được ghi nhận"
                    },
                    {
                        "en": "(British English) The water has gone cold.",
                        "vi": "(Anh Anh) Nước đã lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "not heated; cooled after being cooked",
                    "vi": "không đun nóng; nguội sau khi nấu chín"
                },
                "examples": [
                    {
                        "en": "a cold drink",
                        "vi": "một thức uống lạnh"
                    },
                    {
                        "en": "Hot and cold food is available in the cafeteria.",
                        "vi": "Thức ăn nóng và lạnh có sẵn trong căng tin."
                    },
                    {
                        "en": "Bake in the oven for twenty minutes. Serve hot or cold.",
                        "vi": "Nướng trong lò trong hai mươi phút. Phục vụ nóng hoặc lạnh."
                    },
                    {
                        "en": "It's cold chicken for lunch.",
                        "vi": "Đó là gà nguội cho bữa trưa."
                    },
                    {
                        "en": "a lunch of cold meat and salad",
                        "vi": "bữa trưa gồm thịt nguội và salad"
                    }
                ]
            },
            {
                "define": {
                    "en": "without emotion; not friendly",
                    "vi": "không có cảm xúc; không thân thiện"
                },
                "examples": [
                    {
                        "en": "to give somebody a cold look/stare",
                        "vi": "để cho ai đó một cái nhìn lạnh lùng / nhìn chằm chằm"
                    },
                    {
                        "en": "Her manner was cold and distant.",
                        "vi": "Phong thái của cô ấy lạnh lùng và xa cách."
                    },
                    {
                        "en": "He was staring at her with cold eyes.",
                        "vi": "Anh ta đang nhìn cô chằm chằm với đôi mắt lạnh lùng."
                    },
                    {
                        "en": "cold towards/to somebody She was very cold towards me.",
                        "vi": "lạnh lùng với / với ai đó Cô ấy rất lạnh lùng với tôi."
                    },
                    {
                        "en": "He received a cold welcome.",
                        "vi": "Anh nhận được sự chào đón lạnh lùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming to lack any warm feeling, in an unpleasant way",
                    "vi": "dường như thiếu bất kỳ cảm giác ấm áp nào, một cách khó chịu"
                },
                "examples": [
                    {
                        "en": "clear cold light",
                        "vi": "ánh sáng lạnh rõ ràng"
                    },
                    {
                        "en": "cold grey skies",
                        "vi": "bầu trời xám lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not easy to find",
                    "vi": "không dễ tìm"
                },
                "examples": [
                    {
                        "en": "The police followed the robbers to the airport but then the trail went cold.",
                        "vi": "Cảnh sát đã theo dấu tên cướp đến sân bay nhưng sau đó dấu vết đã nguội lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in children’s games to say that the person playing is not close to finding a person or thing, or to guessing the correct answer",
                    "vi": "được sử dụng trong các trò chơi dành cho trẻ em để nói rằng người chơi không gần để tìm ra người hoặc vật, hoặc để đoán câu trả lời chính xác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "unconscious",
                    "vi": "bất tỉnh"
                },
                "examples": [
                    {
                        "en": "He was knocked out cold in the second round.",
                        "vi": "Anh ấy đã bị hạ gục lạnh lùng ở hiệp thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "facts with nothing added to make them more interesting or pleasant",
                    "vi": "sự thật không có gì thêm để làm cho chúng thú vị hơn hoặc dễ chịu hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your opinion about something often",
                    "vi": "thay đổi quan điểm của bạn về điều gì đó thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who seems unfriendly and without strong emotions",
                    "vi": "một người có vẻ không thân thiện và không có cảm xúc mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly become nervous about doing something that you had planned to do",
                    "vi": "đột nhiên trở nên lo lắng về việc làm điều gì đó mà bạn đã dự định làm"
                },
                "examples": [
                    {
                        "en": "He was going to ask her but he got cold feet and said nothing.",
                        "vi": "Anh định hỏi cô nhưng anh lạnh chân và không nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody in a way that is not friendly",
                    "vi": "đối xử với ai đó theo cách không thân thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to experience a sudden feeling of fear or worry",
                    "vi": "trải qua cảm giác sợ hãi hoặc lo lắng đột ngột"
                },
                "examples": [
                    {
                        "en": "When the phone rang I just went hot and cold.",
                        "vi": "Khi điện thoại reo, tôi vừa nóng vừa lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "when you have had time to think calmly about something; in the morning when things are clearer",
                    "vi": "khi bạn đã có thời gian để bình tĩnh suy nghĩ về điều gì đó; vào buổi sáng khi mọi thứ rõ ràng hơn"
                },
                "examples": [
                    {
                        "en": "These things always look different in the cold light of day.",
                        "vi": "Những thứ này luôn trông khác biệt trong ánh sáng lạnh giá của ban ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to affect or interest somebody",
                    "vi": "không ảnh hưởng hoặc quan tâm đến ai đó"
                },
                "examples": [
                    {
                        "en": "Most modern art leaves me cold.",
                        "vi": "Hầu hết nghệ thuật hiện đại khiến tôi lạnh lùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give reasons for not being in favour of something; to criticize something",
                    "vi": "để đưa ra lý do không ủng hộ điều gì đó; để chỉ trích một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She immediately poured cold water on his plans to expand the business.",
                        "vi": "Cô lập tức dội gáo nước lạnh vào kế hoạch mở rộng kinh doanh của anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "214f71f45b394b43bc0bfcfe3a6b782a",
        "word": "highly strung",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪli ˈstrʌŋ/",
            "us": "/ˌhaɪli ˈstrʌŋ/"
        },
        "nearby": [
            {
                "word": "highlighter",
                "pos": "noun"
            },
            {
                "word": "highly",
                "pos": "adverb"
            },
            {
                "word": "highly strung",
                "pos": "adjective"
            },
            {
                "word": "high-maintenance",
                "pos": "adjective"
            },
            {
                "word": "high-minded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous and easily upset",
                    "vi": "lo lắng và dễ buồn"
                },
                "examples": [
                    {
                        "en": "a sensitive and highly-strung child",
                        "vi": "một đứa trẻ nhạy cảm và rất cứng rắn"
                    },
                    {
                        "en": "Their new horse is very highly strung.",
                        "vi": "Con ngựa mới của họ rất bền."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed35b851d4d24f6094810b7901feb5c3",
        "word": "hyper",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaɪpə(r)/",
            "us": "/ˈhaɪpər/"
        },
        "nearby": [
            {
                "word": "hype",
                "pos": "verb"
            },
            {
                "word": "hyped up",
                "pos": "adjective"
            },
            {
                "word": "hyper",
                "pos": "adjective"
            },
            {
                "word": "hyper-",
                "pos": "prefix"
            },
            {
                "word": "hyperactive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "excited and nervous; having too much nervous energy",
                    "vi": "phấn khích và hồi hộp; có quá nhiều năng lượng lo lắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5c0a39715064af9afe8dfc0f23c95a2",
        "word": "inhibited",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈhɪbɪtɪd/",
            "us": "/ɪnˈhɪbɪtɪd/"
        },
        "nearby": [
            {
                "word": "inheritor",
                "pos": "noun"
            },
            {
                "word": "inhibit",
                "pos": "verb"
            },
            {
                "word": "inhibited",
                "pos": "adjective"
            },
            {
                "word": "inhibition",
                "pos": "noun"
            },
            {
                "word": "inhibitor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unable to relax or express your feelings in a natural way",
                    "vi": "không thể thư giãn hoặc thể hiện cảm xúc của bạn một cách tự nhiên"
                },
                "examples": [
                    {
                        "en": "She felt very inhibited by her own lack of experience.",
                        "vi": "Cô cảm thấy rất ức chế vì bản thân thiếu kinh nghiệm."
                    },
                    {
                        "en": "inhibited about (doing) something Boys are often more inhibited than girls about discussing their problems.",
                        "vi": "bị ức chế về (làm) điều gì đó Con trai thường bị ức chế hơn con gái về việc thảo luận vấn đề của họ."
                    },
                    {
                        "en": "inhibited from doing something No one should feel inhibited from taking part in the show.",
                        "vi": "bị ức chế khi làm điều gì đó Không ai nên cảm thấy ức chế khi tham gia chương trình."
                    }
                ]
            }
        ]
    },
    {
        "id": "433559dbbee84f888db9b19074c25f17",
        "word": "inhibition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnhɪˈbɪʃn/",
            "us": "/ˌɪnhɪˈbɪʃn/"
        },
        "nearby": [
            {
                "word": "inhibit",
                "pos": "verb"
            },
            {
                "word": "inhibited",
                "pos": "adjective"
            },
            {
                "word": "inhibition",
                "pos": "noun"
            },
            {
                "word": "inhibitor",
                "pos": "noun"
            },
            {
                "word": "inhospitable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shy or nervous feeling that stops you from expressing your real thoughts or feelings",
                    "vi": "cảm giác ngại ngùng hoặc lo lắng khiến bạn không thể bày tỏ suy nghĩ hoặc cảm xúc thực sự của mình"
                },
                "examples": [
                    {
                        "en": "The children were shy at first, but soon lost their inhibitions.",
                        "vi": "Bọn trẻ lúc đầu còn ngại ngùng, nhưng nhanh chóng hết ức chế."
                    },
                    {
                        "en": "She had no inhibitions about making her opinions known.",
                        "vi": "Cô ấy không hề ức chế về việc công khai ý kiến của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of limiting or preventing a process or an action",
                    "vi": "hành động hạn chế hoặc ngăn cản một quá trình hoặc một hành động"
                },
                "examples": [
                    {
                        "en": "the inhibition of growth",
                        "vi": "sự kìm hãm sự phát triển"
                    }
                ]
            }
        ]
    },
    {
        "id": "8f60f9702df84ad580836b8c1122b7b0",
        "word": "jitters",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɪtəz/",
            "us": "/ˈdʒɪtərz/"
        },
        "nearby": [
            {
                "word": "JIT",
                "pos": "abbreviation"
            },
            {
                "word": "jitterbug",
                "pos": "noun"
            },
            {
                "word": "jitters",
                "pos": "noun"
            },
            {
                "word": "jittery",
                "pos": "adjective"
            },
            {
                "word": "jiu-jitsu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feelings of being anxious and nervous, especially before an important event or before having to do something difficult",
                    "vi": "cảm giác lo lắng và hồi hộp, đặc biệt là trước một sự kiện quan trọng hoặc trước khi phải làm một điều gì đó khó khăn"
                },
                "examples": [
                    {
                        "en": "I always get the jitters before exams.",
                        "vi": "Tôi luôn có cảm giác bồn chồn trước kỳ thi."
                    },
                    {
                        "en": "Louise had pre-wedding jitters.",
                        "vi": "Louise có cảm giác bồn chồn trước đám cưới."
                    }
                ]
            }
        ]
    },
    {
        "id": "621dfa1dcd794a1bb240b280c856494d",
        "word": "jittery",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɪtəri/",
            "us": "/ˈdʒɪtəri/"
        },
        "nearby": [
            {
                "word": "jitterbug",
                "pos": "noun"
            },
            {
                "word": "jitters",
                "pos": "noun"
            },
            {
                "word": "jittery",
                "pos": "adjective"
            },
            {
                "word": "jiu-jitsu",
                "pos": "noun"
            },
            {
                "word": "jive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "anxious and nervous",
                    "vi": "lo lắng và hồi hộp"
                },
                "examples": [
                    {
                        "en": "I felt jittery before going on stage.",
                        "vi": "Tôi cảm thấy bồn chồn trước khi lên sân khấu."
                    },
                    {
                        "en": "The election campaign got off to a jittery start.",
                        "vi": "Chiến dịch bầu cử đã có một khởi đầu lộn xộn."
                    },
                    {
                        "en": "Just talking about it made her jittery.",
                        "vi": "Chỉ nói về nó thôi cũng khiến cô ấy bồn chồn."
                    },
                    {
                        "en": "All this talk of war was making him jittery.",
                        "vi": "Tất cả những lời bàn tán về chiến tranh này khiến anh ấy bồn chồn."
                    }
                ]
            }
        ]
    },
    {
        "id": "553d3a1fdb774c668504e795e447d1ca",
        "word": "jumpy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʌmpi/",
            "us": "/ˈdʒʌmpi/"
        },
        "nearby": [
            {
                "word": "jump-start",
                "pos": "verb"
            },
            {
                "word": "jumpsuit",
                "pos": "noun"
            },
            {
                "word": "jumpy",
                "pos": "adjective"
            },
            {
                "word": "junction",
                "pos": "noun"
            },
            {
                "word": "juncture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous and anxious, especially because you think that something bad is going to happen",
                    "vi": "hồi hộp và lo lắng, đặc biệt là vì bạn nghĩ rằng điều gì đó tồi tệ sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "What's the matter? You're so jumpy this evening.",
                        "vi": "Có chuyện gì vậy? Tối nay bạn rất nóng nảy."
                    },
                    {
                        "en": "Anna's very jumpy about something.",
                        "vi": "Anna rất nóng nảy về điều gì đó."
                    },
                    {
                        "en": "Jim seemed a bit jumpy.",
                        "vi": "Jim có vẻ hơi bối rối."
                    },
                    {
                        "en": "The business with Julian has made her rather jumpy.",
                        "vi": "Công việc kinh doanh với Julian đã khiến cô ấy khá thăng hoa."
                    },
                    {
                        "en": "The police are getting jumpy about the possibility of terrorist bombs.",
                        "vi": "Cảnh sát đang lo lắng về khả năng có bom khủng bố."
                    }
                ]
            }
        ]
    },
    {
        "id": "6a13beccfb644c7da6d388856f6762d1",
        "word": "keyed up",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkiːd ˈʌp/",
            "us": "/ˌkiːd ˈʌp/"
        },
        "nearby": [
            {
                "word": "key card",
                "pos": "noun"
            },
            {
                "word": "keychain",
                "pos": "noun"
            },
            {
                "word": "keyed up",
                "pos": "adjective"
            },
            {
                "word": "key grip",
                "pos": "noun"
            },
            {
                "word": "keyhole",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous and excited, especially before an important event",
                    "vi": "hồi hộp và phấn khích, đặc biệt là trước một sự kiện quan trọng"
                },
                "examples": [
                    {
                        "en": "We were all keyed up about the big game.",
                        "vi": "Tất cả chúng tôi đều quan tâm đến trận đấu lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "24deb02e394e404e9d62933d97c3499d",
        "word": "nervy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnɜːvi/",
            "us": "/ˈnɜːrvi/"
        },
        "nearby": [
            {
                "word": "nervousness",
                "pos": "noun"
            },
            {
                "word": "nervous system",
                "pos": "noun"
            },
            {
                "word": "nervy",
                "pos": "adjective"
            },
            {
                "word": "E Nesbit",
                "pos": ""
            },
            {
                "word": "Nescafé",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "anxious and nervous",
                    "vi": "lo lắng và hồi hộp"
                },
                "examples": [
                    {
                        "en": "You seem quite nervy this morning.",
                        "vi": "Bạn có vẻ khá lo lắng vào sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "brave and confident in a way that might offend other people, or show a lack of respect",
                    "vi": "dũng cảm và tự tin theo cách có thể xúc phạm người khác hoặc thể hiện sự thiếu tôn trọng"
                },
                "examples": [
                    {
                        "en": "It takes a pretty nervy guy to talk to me like that.",
                        "vi": "Phải có một anh chàng khá lo lắng mới có thể nói chuyện với tôi như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "aba282dc61db4d3bacf236d469082453",
        "word": "quake",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kweɪk/",
            "us": "/kweɪk/"
        },
        "nearby": [
            {
                "word": "quaintly",
                "pos": "adverb"
            },
            {
                "word": "quaintness",
                "pos": "noun"
            },
            {
                "word": "quake",
                "pos": "verb"
            },
            {
                "word": "quake",
                "pos": "noun"
            },
            {
                "word": "Quaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to shake because you are very frightened or nervous",
                    "vi": "rung chuyển vì bạn đang rất sợ hãi hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "Quaking with fear, Polly slowly opened the door.",
                        "vi": "Vừa sợ hãi, Polly vừa từ từ mở cửa."
                    },
                    {
                        "en": "They are quaking in their boots at the prospect of tomorrow’s game.",
                        "vi": "Họ đang run rẩy trước triển vọng của trận đấu ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or shake violently",
                    "vi": "di chuyển hoặc rung lắc dữ dội"
                },
                "examples": [
                    {
                        "en": "The ground quaked as the bomb exploded.",
                        "vi": "Mặt đất rung chuyển khi quả bom phát nổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "df6dfc9c97cf452cbb5be320f550762e",
        "word": "queasy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwiːzi/",
            "us": "/ˈkwiːzi/"
        },
        "nearby": [
            {
                "word": "queasily",
                "pos": "adverb"
            },
            {
                "word": "queasiness",
                "pos": "noun"
            },
            {
                "word": "queasy",
                "pos": "adjective"
            },
            {
                "word": "Quebec",
                "pos": ""
            },
            {
                "word": "Quebec City",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling sick; wanting to vomit",
                    "vi": "cảm thấy ốm; muốn nôn"
                },
                "examples": [
                    {
                        "en": "Travelling by boat makes me queasy.",
                        "vi": "Đi du lịch bằng thuyền khiến tôi buồn nôn."
                    },
                    {
                        "en": "His stomach still felt queasy and he was grateful for the fresh air.",
                        "vi": "Bụng anh vẫn còn cảm giác nôn nao và anh cảm thấy biết ơn vì không khí trong lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "slightly nervous or worried about something",
                    "vi": "hơi lo lắng hoặc lo lắng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Now she’d arrived she felt queasy inside.",
                        "vi": "Bây giờ đến nơi, cô cảm thấy buồn nôn trong người."
                    }
                ]
            }
        ]
    },
    {
        "id": "474579f0230f4c32ab8d11e7ddd93e49",
        "word": "retiring",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈtaɪərɪŋ/",
            "us": "/rɪˈtaɪərɪŋ/"
        },
        "nearby": [
            {
                "word": "retirement home",
                "pos": "noun"
            },
            {
                "word": "retirement plan",
                "pos": "noun"
            },
            {
                "word": "retiring",
                "pos": "adjective"
            },
            {
                "word": "retold",
                "pos": "verb"
            },
            {
                "word": "retool",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "preferring not to spend time with other people",
                    "vi": "không muốn dành thời gian cho người khác"
                },
                "examples": [
                    {
                        "en": "a quiet, retiring man",
                        "vi": "một người đàn ông yên tĩnh, đã nghỉ hưu"
                    },
                    {
                        "en": "Those of a shy and retiring nature are not suited to this kind of activity.",
                        "vi": "Những người có bản tính nhút nhát và thích nghỉ hưu không thích hợp với loại hoạt động này."
                    }
                ]
            }
        ]
    },
    {
        "id": "9717769927824c56b8e54dbc16aded4d",
        "word": "self-effacement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself ɪˈfeɪsmənt/",
            "us": "/ˌself ɪˈfeɪsmənt/"
        },
        "nearby": [
            {
                "word": "self-driving",
                "pos": "adjective"
            },
            {
                "word": "self-educated",
                "pos": "adjective"
            },
            {
                "word": "self-effacement",
                "pos": "noun"
            },
            {
                "word": "self-effacing",
                "pos": "adjective"
            },
            {
                "word": "self-employed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of trying not to attract attention to yourself or your abilities",
                    "vi": "thực tế là cố gắng không thu hút sự chú ý vào bản thân hoặc khả năng của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0cc47ce9d3044c50a0bf0c064bfd143f",
        "word": "self-effacing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself ɪˈfeɪsɪŋ/",
            "us": "/ˌself ɪˈfeɪsɪŋ/"
        },
        "nearby": [
            {
                "word": "self-educated",
                "pos": "adjective"
            },
            {
                "word": "self-effacement",
                "pos": "noun"
            },
            {
                "word": "self-effacing",
                "pos": "adjective"
            },
            {
                "word": "self-employed",
                "pos": "adjective"
            },
            {
                "word": "self-employment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not wanting to attract attention to yourself or your abilities",
                    "vi": "không muốn thu hút sự chú ý vào bản thân hoặc khả năng của bạn"
                },
                "examples": [
                    {
                        "en": "He was a shy, self-effacing man.",
                        "vi": "Anh ta là một người nhút nhát, tự cao tự đại."
                    }
                ]
            }
        ]
    },
    {
        "id": "1396da6cda3f430f9dd1c89688511e17",
        "word": "somebody’s heart is in their mouth",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɑːt/",
            "us": "/hɑːrt/"
        },
        "nearby": [
            {
                "word": "hearse",
                "pos": "noun"
            },
            {
                "word": "William Randolph Hearst",
                "pos": ""
            },
            {
                "word": "heart",
                "pos": "noun"
            },
            {
                "word": "heart",
                "pos": "verb"
            },
            {
                "word": "heartache",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the organ in the chest that sends blood around the body, usually on the left in humans",
                    "vi": "cơ quan trong lồng ngực đưa máu đi khắp cơ thể, thường ở bên trái ở người"
                },
                "examples": [
                    {
                        "en": "The patient's heart stopped beating for a few seconds.",
                        "vi": "Tim bệnh nhân ngừng đập trong vài giây."
                    },
                    {
                        "en": "I could feel my heart pounding in my chest (= because of excitement, etc.).",
                        "vi": "Tôi có thể cảm thấy tim mình đập thình thịch trong lồng ngực (= vì phấn khích, v.v.)."
                    },
                    {
                        "en": "to have a weak heart",
                        "vi": "có một trái tim yếu ớt"
                    },
                    {
                        "en": "heart disease/problems",
                        "vi": "bệnh tim / vấn đề"
                    },
                    {
                        "en": "to have a heart condition",
                        "vi": "để có một tình trạng tim"
                    },
                    {
                        "en": "heart patients/surgery",
                        "vi": "bệnh nhân tim / phẫu thuật"
                    },
                    {
                        "en": "a heart transplant",
                        "vi": "cấy ghép tim"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outside part of the chest where the heart is",
                    "vi": "phần bên ngoài của lồng ngực nơi có trái tim"
                },
                "examples": [
                    {
                        "en": "She clasped the photo to her heart.",
                        "vi": "Cô ôm chặt bức ảnh vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a heart in shape, often red and used as a symbol of love; a symbol like a heart used to mean the verb ‘love’",
                    "vi": "một thứ giống như hình trái tim, thường có màu đỏ và được dùng làm biểu tượng của tình yêu; một biểu tượng như trái tim được sử dụng để có nghĩa là động từ 'tình yêu'"
                },
                "examples": [
                    {
                        "en": "The words ‘I love you’ were written inside a big red heart.",
                        "vi": "Dòng chữ 'I love you' được viết bên trong một trái tim lớn màu đỏ."
                    },
                    {
                        "en": "She was drawing hearts on the cover of a loose-leaf binder.",
                        "vi": "Cô ấy đang vẽ những trái tim trên bìa một tờ bìa rời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in a person where the feelings and emotions are thought to be, especially those connected with love",
                    "vi": "nơi con người được cho là cảm xúc và tình cảm, đặc biệt là những cảm xúc được kết nối với tình yêu"
                },
                "examples": [
                    {
                        "en": "She has a kind heart.",
                        "vi": "Cô ấy có một trái tim nhân hậu."
                    },
                    {
                        "en": "Have you no heart?",
                        "vi": "Bạn không có trái tim?"
                    },
                    {
                        "en": "He returned with a heavy heart (= sad).",
                        "vi": "Anh trở về với lòng nặng trĩu (= buồn)."
                    },
                    {
                        "en": "Her novels tend to deal with affairs of the heart.",
                        "vi": "Tiểu thuyết của cô có xu hướng giải quyết các vấn đề của trái tim."
                    },
                    {
                        "en": "The story captured the hearts and minds of a generation.",
                        "vi": "Câu chuyện đã chiếm được trái tim và tâm trí của cả một thế hệ."
                    },
                    {
                        "en": "His sad story touched her heart.",
                        "vi": "Câu chuyện buồn của anh khiến trái tim cô cảm động."
                    },
                    {
                        "en": "the mysteries of the human heart",
                        "vi": "những bí ẩn của trái tim con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of character or personality mentioned",
                    "vi": "có loại nhân vật hoặc tính cách được đề cập"
                },
                "examples": [
                    {
                        "en": "simple-hearted",
                        "vi": "giản dị"
                    },
                    {
                        "en": "pure-hearted",
                        "vi": "trong sáng"
                    },
                    {
                        "en": "black-hearted",
                        "vi": "trái tim đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important part of something",
                    "vi": "phần quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something the heart of the matter/problem",
                        "vi": "trung tâm của một cái gì đó trung tâm của vấn đề / vấn đề"
                    },
                    {
                        "en": "The committee's report went to the heart of the government's dilemma.",
                        "vi": "Báo cáo của ủy ban đã đi vào trọng tâm của tình thế khó xử của chính phủ."
                    },
                    {
                        "en": "at the heart of something The distinction between right and wrong lies at the heart of all questions of morality.",
                        "vi": "ở trung tâm của điều gì đó Sự phân biệt giữa đúng và sai nằm ở trung tâm của tất cả các câu hỏi về đạo đức."
                    },
                    {
                        "en": "the issue at the heart of modern government",
                        "vi": "vấn đề trọng tâm của chính phủ hiện đại"
                    },
                    {
                        "en": "at the/its heart The story, at its heart, is a simple tale of loss and rediscovery.",
                        "vi": "tại / trái tim của nó Câu chuyện, ở trung tâm của nó, là một câu chuyện đơn giản về mất mát và khám phá lại."
                    },
                    {
                        "en": "Buddhism, at the heart, is about harmony.",
                        "vi": "Đạo Phật, ở trung tâm, là về sự hài hòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that is in the centre of something",
                    "vi": "phần nằm ở trung tâm của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something a quiet hotel in the very heart of the city",
                        "vi": "trung tâm của một cái gì đó một khách sạn yên tĩnh ở trung tâm của thành phố"
                    },
                    {
                        "en": "at the/its heart an open space with a small arena at the heart",
                        "vi": "tại / trái tim của nó một không gian rộng mở với một đấu trường nhỏ ở trung tâm"
                    },
                    {
                        "en": "Manchester contains at its heart a rather extended commercial district.",
                        "vi": "Manchester có trung tâm là một khu thương mại khá mở rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the smaller leaves in the middle of a cabbage, lettuce, etc.",
                    "vi": "những chiếc lá nhỏ hơn ở giữa bắp cải, rau diếp, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the four suits (= sets) in a pack of cards, with red heart symbols on them",
                    "vi": "một trong bốn bộ quần áo (= bộ) trong một gói thẻ, với biểu tượng trái tim màu đỏ trên chúng"
                },
                "examples": [
                    {
                        "en": "the queen of hearts",
                        "vi": "nữ hoàng của trái tim"
                    },
                    {
                        "en": "Hearts is/are trumps.",
                        "vi": "Hearts là / là át chủ bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "one card from the suit called hearts",
                    "vi": "một thẻ từ bộ đồ được gọi là trái tim"
                },
                "examples": [
                    {
                        "en": "Who played that heart?",
                        "vi": "Ai đã chơi trái tim đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say what somebody is really like even though they may seem to be something different",
                    "vi": "được sử dụng để nói ai đó thực sự như thế nào mặc dù họ có vẻ là một cái gì đó khác nhau"
                },
                "examples": [
                    {
                        "en": "He's still a socialist at heart.",
                        "vi": "Anh ấy vẫn là một nhà xã hội chủ nghĩa trong trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is etched on your heart, memory, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó đã khắc sâu vào trái tim, ký ức của bạn, v.v., bạn sẽ nhớ nó vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel very unhappy",
                    "vi": "làm cho ai đó cảm thấy rất không vui"
                },
                "examples": [
                    {
                        "en": "She broke his heart when she called off the engagement.",
                        "vi": "Cô đã làm tan nát trái tim anh khi cô hủy bỏ lời đính hôn."
                    },
                    {
                        "en": "It breaks my heart to see you like this.",
                        "vi": "Tôi tan nát trái tim khi nhìn thấy bạn như thế này."
                    }
                ]
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    },
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have a change of heart, your attitude towards something changes, usually making you feel more friendly, helpful, etc.",
                    "vi": "nếu bạn thay đổi trái tim, thái độ của bạn đối với điều gì đó thay đổi, thường khiến bạn cảm thấy thân thiện, hữu ích hơn, v.v."
                },
                "examples": [
                    {
                        "en": "Dan did not want to get married but recently he’s had a change of heart.",
                        "vi": "Dan không muốn kết hôn nhưng gần đây anh ấy đã thay đổi tình cảm."
                    },
                    {
                        "en": "He said he's not coming, but he might have a change of heart.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không đến, nhưng anh ấy có thể đã thay đổi trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of importance and interest for somebody",
                    "vi": "có rất nhiều tầm quan trọng và sự quan tâm đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize that you are telling the truth or will do what you promise",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn đang nói sự thật hoặc sẽ làm những gì bạn hứa"
                },
                "examples": [
                    {
                        "en": "I saw him do it—cross my heart.",
                        "vi": "Tôi đã thấy anh ấy làm điều đó - trái tim tôi rất vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to compare two things and say that one of them is better",
                    "vi": "được sử dụng để so sánh hai thứ và nói rằng một trong số chúng tốt hơn"
                },
                "examples": [
                    {
                        "en": "Look at him dance! Eat your heart out, Fred Astaire (= he dances even better than Fred Astaire).",
                        "vi": "Nhìn anh ấy nhảy! Hãy tận hưởng trái tim của bạn, Fred Astaire (= anh ấy còn nhảy giỏi hơn Fred Astaire)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able or willing to do something",
                    "vi": "để có thể hoặc sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Can you find it in your heart to forgive her?",
                        "vi": "Bạn có thể tìm thấy nó trong trái tim của bạn để tha thứ cho cô ấy?"
                    },
                    {
                        "en": "He couldn't find it in himself to trust anyone again.",
                        "vi": "Anh không thể tin tưởng bất cứ ai một lần nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is sincere",
                    "vi": "theo một cách chân thành"
                },
                "examples": [
                    {
                        "en": "I beg you, from the bottom of my heart, to spare his life.",
                        "vi": "Tôi cầu xin bạn, từ tận đáy lòng, hãy tha mạng cho anh ấy."
                    },
                    {
                        "en": "It was clearly an offer that came from the heart.",
                        "vi": "Đó rõ ràng là một lời đề nghị xuất phát từ trái tim."
                    },
                    {
                        "en": "I could tell he spoke from the heart.",
                        "vi": "Tôi có thể nói rằng anh ấy đã nói từ trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel positive, especially when they thought that they had no chance of achieving something",
                    "vi": "để làm cho ai đó cảm thấy tích cực, đặc biệt là khi họ nghĩ rằng họ không có cơ hội đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give your love to one person",
                    "vi": "trao tình yêu của bạn cho một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody to be kind and/or reasonable",
                    "vi": "được sử dụng để yêu cầu ai đó tử tế và / hoặc hợp lý"
                },
                "examples": [
                    {
                        "en": "Have a heart! I’ve nowhere else to stay!",
                        "vi": "Có một trái tim! Tôi không còn nơi nào khác để ở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a very kind person",
                    "vi": "trở thành một người rất tốt bụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a person who does not show other people sympathy",
                    "vi": "trở thành một người không thể hiện sự đồng cảm của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to want somebody to be happy and successful even though your actions may not show this",
                    "vi": "muốn ai đó hạnh phúc và thành công mặc dù hành động của bạn có thể không cho thấy điều này"
                },
                "examples": [
                    {
                        "en": "Although he was sometimes too strict with his children, he had their best interests at heart.",
                        "vi": "Mặc dù đôi khi ông quá nghiêm khắc với con cái, nhưng ông luôn hướng tới lợi ích tốt nhất của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very dear to somebody",
                    "vi": "rất thân thiết với ai đó"
                },
                "examples": [
                    {
                        "en": "He'll always have a place in my heart.",
                        "vi": "Anh ấy sẽ luôn có một vị trí trong trái tim tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a lot of energy and enthusiasm",
                    "vi": "với rất nhiều năng lượng và nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "They threw themselves heart and soul into the project.",
                        "vi": "Họ đã ném hết trái tim và tâm hồn vào dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not feel sympathy for somebody",
                    "vi": "từng nói rằng bạn không có thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "‘I have to go to Brazil on business.’ ‘My heart bleeds for you!’",
                        "vi": "Tôi phải đi công tác ở Brazil.' 'Trái tim tôi rỉ máu vì bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you feel a lot of sympathy for somebody",
                    "vi": "từng nói rằng bạn cảm thấy có nhiều thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "Our hearts go out to the families of the victims.",
                        "vi": "Trái tim của chúng tôi hướng về gia đình của các nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody feels nervous or frightened about something",
                    "vi": "ai đó cảm thấy lo lắng hoặc sợ hãi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart was in my mouth as I opened the envelope.",
                        "vi": "Trái tim tôi đang ở trong miệng khi tôi mở phong bì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody’s intentions are kind and sincere even though they sometimes do the wrong thing",
                    "vi": "được sử dụng để nói rằng ý định của ai đó là tử tế và chân thành mặc dù đôi khi họ làm điều sai trái"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are not very interested in or enthusiastic about something",
                    "vi": "đã từng nói rằng bạn không hứng thú hoặc không nhiệt tình với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Her heart isn't in her job.",
                        "vi": "Trái tim của cô ấy không ở trong công việc của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of happiness or excitement",
                    "vi": "thường nói rằng ai đó có cảm giác hạnh phúc hoặc phấn khích đột ngột"
                },
                "examples": [
                    {
                        "en": "My heart leapt at the news.",
                        "vi": "Trái tim tôi nhảy lên khi nghe tin này."
                    },
                    {
                        "en": "Her heart leaped with joy.",
                        "vi": "Trái tim cô nhảy lên vì sung sướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of fear, excitement, etc.",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên có cảm giác sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "My heart missed a beat when I saw who it was.",
                        "vi": "Trái tim tôi lỡ một nhịp khi tôi nhìn thấy đó là ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody suddenly feels sad or depressed about something",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên cảm thấy buồn hoặc chán nản về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart sank when I saw how much work there was left.",
                        "vi": "Trái tim tôi chùng xuống khi tôi thấy bao nhiêu công việc còn lại."
                    },
                    {
                        "en": "She watched him go with a sinking heart.",
                        "vi": "Cô nhìn anh ra đi với trái tim chìm đắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a home is where the people you love are",
                    "vi": "nhà là nơi có những người bạn yêu thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "happy and cheerful",
                    "vi": "vui vẻ và vui vẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you know something in your heart, you have a strong feeling that it is true",
                    "vi": "nếu bạn biết điều gì đó trong trái tim mình, bạn có cảm giác mạnh mẽ rằng đó là sự thật"
                },
                "examples": [
                    {
                        "en": "She knew in her heart of hearts that she was making the wrong decision.",
                        "vi": "Trong thâm tâm cô biết rằng mình đã quyết định sai lầm."
                    },
                    {
                        "en": "In my heart, I knew it wasn't true.",
                        "vi": "Trong thâm tâm, tôi biết đó không phải là sự thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "it makes somebody feel happy when they see or hear something",
                    "vi": "nó làm cho ai đó cảm thấy hạnh phúc khi họ nhìn thấy hoặc nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "It does my heart good to see the old place being taken care of so well.",
                        "vi": "Thật là chạnh lòng khi thấy nơi ở cũ được chăm sóc chu đáo như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop hoping for something or trying to do something because you no longer feel confident",
                    "vi": "ngừng hy vọng về điều gì đó hoặc cố gắng làm điều gì đó bởi vì bạn không còn cảm thấy tự tin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall in love with somebody/something",
                    "vi": "phải lòng ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man/woman who likes the same things or has the same opinions as you",
                    "vi": "một người đàn ông / phụ nữ thích những thứ giống nhau hoặc có cùng quan điểm với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to do something because you know that it will make somebody sad or upset",
                    "vi": "không thể làm điều gì đó bởi vì bạn biết rằng điều đó sẽ khiến ai đó buồn hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    },
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of kind feelings, without thinking about what advantage there will be for you",
                    "vi": "vì tình cảm tốt bụng mà không nghĩ đến việc bạn sẽ có lợi gì"
                },
                "examples": [
                    {
                        "en": "You're not telling me he offered to lend you the money out of the goodness of his heart?",
                        "vi": "Bạn không nói với tôi rằng anh ta đề nghị cho bạn vay tiền vì lòng tốt của anh ta?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody all your problems, feelings, etc.",
                    "vi": "để nói với ai đó tất cả các vấn đề, cảm xúc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Finally, he broke down in tears and poured out his heart to her.",
                        "vi": "Cuối cùng, anh đã gục ngã trong nước mắt và dốc hết trái tim mình cho cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want something very much",
                    "vi": "muốn một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "They’ve set their heart on a house in the country.",
                        "vi": "Họ đã đặt trái tim của họ vào một ngôi nhà trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unhappy or disappointed",
                    "vi": "rất không vui hoặc thất vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cry noisily for a long time because you are very sad",
                    "vi": "khóc thật lâu vì bạn rất buồn"
                },
                "examples": [
                    {
                        "en": "She flung herself at his chest and sobbed her heart out.",
                        "vi": "Cô ném mình vào ngực anh và thổn thức trái tim mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody fall in love with you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel more positive about something, especially when you thought that you had no chance of achieving something",
                    "vi": "để cảm thấy tích cực hơn về điều gì đó, đặc biệt là khi bạn nghĩ rằng bạn không có cơ hội đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The government can take heart from the latest opinion polls.",
                        "vi": "Chính phủ có thể lấy lòng từ các cuộc thăm dò dư luận mới nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very upset by something that somebody says or does",
                    "vi": "rất khó chịu bởi điều gì đó mà ai đó nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "You shouldn’t take everything he says to heart.",
                        "vi": "Bạn không nên ghi tất cả những gì anh ấy nói vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to strongly affect you in an emotional way",
                    "vi": "ảnh hưởng mạnh mẽ đến bạn theo cách cảm xúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to destroy the most important part or aspect of something",
                    "vi": "để phá hủy phần hoặc khía cạnh quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Closing the factory tore the heart out of the community.",
                        "vi": "Đóng cửa nhà máy xé nát trái tim của cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "as much as you want",
                    "vi": "Nhiều như bạn muốn"
                },
                "examples": [
                    {
                        "en": "a supervised play area where children can run around to their heart’s content",
                        "vi": "một khu vực vui chơi có giám sát, nơi trẻ em có thể chạy xung quanh để theo dõi nội dung của trái tim mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel happy or sympathetic",
                    "vi": "để làm cho ai đó cảm thấy hạnh phúc hoặc cảm thông"
                },
                "examples": [
                    {
                        "en": "Doesn’t that story just warm the cockles of your heart?",
                        "vi": "Câu chuyện đó chẳng phải chỉ làm ấm lòng bạn sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way to make somebody like or love you",
                    "vi": "cách để làm cho ai đó thích hoặc yêu bạn"
                },
                "examples": [
                    {
                        "en": "The way to a man's heart is through his stomach (= by giving him good food).",
                        "vi": "Đường đến trái tim của một người đàn ông là thông qua dạ dày của anh ta (= cho anh ta thức ăn ngon)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow your feelings to be seen by other people",
                    "vi": "để cho phép người khác nhìn thấy cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "He’s not one to wear his heart on his sleeve.",
                        "vi": "Anh ấy không phải là người để mặc trái tim mình trên tay áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person does not know about something that they would normally think was bad, then it cannot hurt them",
                    "vi": "nếu một người không biết về điều gì đó mà họ thường nghĩ là tồi tệ, thì điều đó không thể làm tổn thương họ"
                },
                "examples": [
                    {
                        "en": "What does it matter if I use his flat while he’s away? What the eye doesn’t see…!",
                        "vi": "Có vấn đề gì nếu tôi sử dụng căn hộ của anh ấy khi anh ấy đi vắng? Những gì mắt không thấy…!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "I hope with all my heart that things work out for you.",
                        "vi": "Tôi hy vọng với tất cả trái tim của tôi rằng mọi thứ sẽ thuận lợi cho bạn."
                    },
                    {
                        "en": "I wish you well with all my heart.",
                        "vi": "Tôi cầu chúc bạn khỏe mạnh với tất cả trái tim của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking and behaving like a young person even when you are old",
                    "vi": "suy nghĩ và hành xử như một người trẻ ngay cả khi bạn đã già"
                },
                "examples": [
                    {
                        "en": "My father is 76 but he’s still young at heart.",
                        "vi": "Cha tôi đã 76 nhưng trái tim ông vẫn còn trẻ."
                    },
                    {
                        "en": "He's over 70, but he's young at heart.",
                        "vi": "Ông ấy đã ngoài 70, nhưng tâm hồn còn trẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "eec95d2372e54977b0cd130916bbc167",
        "word": "tongue-tied",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʌŋ taɪd/",
            "us": "/ˈtʌŋ taɪd/"
        },
        "nearby": [
            {
                "word": "tongue-in-cheek",
                "pos": "adverb"
            },
            {
                "word": "tongue-lashing",
                "pos": "noun"
            },
            {
                "word": "tongue-tied",
                "pos": "adjective"
            },
            {
                "word": "tongue-twister",
                "pos": "noun"
            },
            {
                "word": "Toni",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not able to speak because you are shy or nervous",
                    "vi": "không thể nói vì bạn nhút nhát hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "I always get nervous and tongue-tied in interviews.",
                        "vi": "Tôi luôn cảm thấy lo lắng và lè lưỡi trong các cuộc phỏng vấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ed51a8f681449aabca964daa8099609",
        "word": "tremulous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtremjələs/",
            "us": "/ˈtremjələs/"
        },
        "nearby": [
            {
                "word": "tremolo",
                "pos": "noun"
            },
            {
                "word": "tremor",
                "pos": "noun"
            },
            {
                "word": "tremulous",
                "pos": "adjective"
            },
            {
                "word": "tremulously",
                "pos": "adverb"
            },
            {
                "word": "trench",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "shaking slightly because you are nervous; causing you to shake slightly",
                    "vi": "run nhẹ vì bạn đang lo lắng; khiến bạn hơi run"
                },
                "examples": [
                    {
                        "en": "a tremulous voice",
                        "vi": "một giọng nói run rẩy"
                    },
                    {
                        "en": "He was in a state of tremulous excitement.",
                        "vi": "Anh ta đang ở trong một trạng thái phấn khích đến run rẩy."
                    }
                ]
            }
        ]
    },
    {
        "id": "1a12230f531d40e8b7d236a236a40073",
        "word": "twitchy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtwɪtʃi/",
            "us": "/ˈtwɪtʃi/"
        },
        "nearby": [
            {
                "word": "twitch",
                "pos": "noun"
            },
            {
                "word": "twitcher",
                "pos": "noun"
            },
            {
                "word": "twitchy",
                "pos": "adjective"
            },
            {
                "word": "twitter",
                "pos": "verb"
            },
            {
                "word": "twitter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous or anxious about something",
                    "vi": "hồi hộp hoặc lo lắng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "As the time for her driving test approached, she started to get twitchy.",
                        "vi": "Khi thời gian cho bài kiểm tra lái xe của cô ấy đến gần, cô ấy bắt đầu co giật."
                    },
                    {
                        "en": "He felt twitchy about the prospect of losing his job.",
                        "vi": "Anh cảm thấy bối rối về viễn cảnh mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "making sudden, quick movements",
                    "vi": "thực hiện các chuyển động đột ngột, nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Her legs began to feel twitchy.",
                        "vi": "Chân cô bắt đầu co giật."
                    }
                ]
            }
        ]
    },
    {
        "id": "45cfd220a6464efead49f7d7e8d4fa65",
        "word": "wired",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪəd/",
            "us": "/ˈwaɪərd/"
        },
        "nearby": [
            {
                "word": "wire",
                "pos": "verb"
            },
            {
                "word": "wire cutters",
                "pos": "noun"
            },
            {
                "word": "wired",
                "pos": "adjective"
            },
            {
                "word": "Wired",
                "pos": ""
            },
            {
                "word": "wireframe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected to a device or computer network by wires",
                    "vi": "được kết nối với một thiết bị hoặc mạng máy tính bằng dây"
                },
                "examples": [
                    {
                        "en": "wired headphones/headsets",
                        "vi": "tai nghe / tai nghe có dây"
                    },
                    {
                        "en": "Wired internet connections are still useful.",
                        "vi": "Kết nối internet có dây vẫn hữu ích."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing wires that make it strong or stiff",
                    "vi": "có chứa dây làm cho nó mạnh hoặc cứng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "excited or nervous; not relaxed",
                    "vi": "phấn khích hoặc lo lắng; không thư thái"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "under the influence of alcohol or an illegal drug",
                    "vi": "dưới ảnh hưởng của rượu hoặc ma túy bất hợp pháp"
                },
                "examples": []
            }
        ]
    }
]