[
    {
        "id": "7539f3d88ea34e948361a863f735ce31",
        "word": "beach",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/biːtʃ/",
            "us": "/biːtʃ/"
        },
        "nearby": [
            {
                "word": "be-",
                "pos": "prefix"
            },
            {
                "word": "Bea",
                "pos": ""
            },
            {
                "word": "beach",
                "pos": "noun"
            },
            {
                "word": "beach",
                "pos": "verb"
            },
            {
                "word": "beach ball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of sand or small stones (called shingle), next to the sea or a lake",
                    "vi": "một khu vực cát hoặc đá nhỏ (gọi là ván lợp), bên cạnh biển hoặc hồ"
                },
                "examples": [
                    {
                        "en": "on the beach tourists sunbathing on the beach",
                        "vi": "trên bãi biển khách du lịch tắm nắng trên bãi biển"
                    },
                    {
                        "en": "to the beach He decided to go to the beach for a swim.",
                        "vi": "đến bãi biển Anh ấy quyết định đi đến bãi biển để bơi."
                    },
                    {
                        "en": "at the beach She often spent summer days at the beach.",
                        "vi": "ở bãi biển Cô ấy thường dành những ngày hè ở bãi biển."
                    },
                    {
                        "en": "a sandy beach",
                        "vi": "một bãi biển đầy cát"
                    },
                    {
                        "en": "a pebble/shingle beach",
                        "vi": "bãi biển đá cuội / shingle"
                    },
                    {
                        "en": "a beach bar",
                        "vi": "một quán bar trên bãi biển"
                    },
                    {
                        "en": "We rented an airy apartment at a beach resort.",
                        "vi": "Chúng tôi thuê một căn hộ thoáng mát tại một khu nghỉ mát ven biển."
                    }
                ]
            }
        ]
    },
    {
        "id": "a01a6adeab38460d87b3b0eafbefa5be",
        "word": "sea",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/siː/",
            "us": "/siː/"
        },
        "nearby": [
            {
                "word": "SDS",
                "pos": ""
            },
            {
                "word": "SE",
                "pos": "abbreviation"
            },
            {
                "word": "sea",
                "pos": "noun"
            },
            {
                "word": "sea air",
                "pos": "noun"
            },
            {
                "word": "sea anemone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the salt water that covers most of the earth’s surface and surrounds its continents and islands",
                    "vi": "nước mặn bao phủ hầu hết bề mặt trái đất và bao quanh các lục địa và đảo của nó"
                },
                "examples": [
                    {
                        "en": "The waste was dumped in the sea.",
                        "vi": "Chất thải được đổ ra biển."
                    },
                    {
                        "en": "The wreck is lying at the bottom of the sea.",
                        "vi": "Xác tàu nằm dưới đáy biển."
                    },
                    {
                        "en": "by sea to travel by sea",
                        "vi": "bằng đường biển để đi du lịch bằng đường biển"
                    },
                    {
                        "en": "by the sea a cottage by the sea",
                        "vi": "cạnh biển một ngôi nhà nhỏ ven biển"
                    },
                    {
                        "en": "He was shot down into the sea off (= near) Japan.",
                        "vi": "Anh ta bị bắn rơi xuống biển ngoài khơi Nhật Bản."
                    },
                    {
                        "en": "We left port and headed for the open sea (= far away from land).",
                        "vi": "Chúng tôi rời cảng và hướng ra biển khơi (= rất xa đất liền)."
                    },
                    {
                        "en": "the cold seas of the Arctic",
                        "vi": "vùng biển lạnh giá của Bắc Cực"
                    },
                    {
                        "en": "a sea voyage",
                        "vi": "một chuyến đi biển"
                    },
                    {
                        "en": "a hotel room with sea view",
                        "vi": "một phòng khách sạn nhìn ra biển"
                    },
                    {
                        "en": "The temperature of most of the deep sea is only just above freezing.",
                        "vi": "Nhiệt độ của hầu hết các vùng biển sâu chỉ trên mức đóng băng."
                    },
                    {
                        "en": "The boat, broken to bits, lay on the sea floor.",
                        "vi": "Con thuyền, vỡ tan tành, nằm dưới đáy biển."
                    },
                    {
                        "en": "The amount of Arctic sea ice in summer has shrunk 15 to 20%.",
                        "vi": "Lượng băng ở biển Bắc Cực vào mùa hè đã giảm từ 15 đến 20%."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of salt water that is part of an ocean or surrounded by land",
                    "vi": "một vùng nước mặn lớn là một phần của đại dương hoặc được bao quanh bởi đất liền"
                },
                "examples": [
                    {
                        "en": "the North Sea",
                        "vi": "Biển Bắc"
                    },
                    {
                        "en": "the Caspian Sea",
                        "vi": "biển Caspi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of the waves of the sea",
                    "vi": "sự chuyển động của sóng biển"
                },
                "examples": [
                    {
                        "en": "It was a calm sea.",
                        "vi": "Đó là một vùng biển yên tĩnh."
                    },
                    {
                        "en": "The sea was very rough.",
                        "vi": "Biển động lắm."
                    },
                    {
                        "en": "The ship sank in heavy seas.",
                        "vi": "Con tàu chìm trong biển lớn."
                    },
                    {
                        "en": "stormy/choppy seas",
                        "vi": "biển có bão / gió giật"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount of something that stretches over a wide area",
                    "vi": "một lượng lớn thứ gì đó trải dài trên một khu vực rộng lớn"
                },
                "examples": [
                    {
                        "en": "He looked down at the sea of smiling faces before him.",
                        "vi": "Anh nhìn xuống biển những khuôn mặt tươi cười trước mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "on the sea, especially in a ship, or in the sea",
                    "vi": "trên biển, đặc biệt là trên tàu, hoặc trên biển"
                },
                "examples": [
                    {
                        "en": "It happened on the second night at sea.",
                        "vi": "Nó xảy ra vào đêm thứ hai trên biển."
                    },
                    {
                        "en": "They were lost at sea.",
                        "vi": "Họ đã bị mất tích trên biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "confused and not knowing what to do",
                    "vi": "bối rối và không biết phải làm gì"
                },
                "examples": [
                    {
                        "en": "I'm all at sea with these new regulations.",
                        "vi": "Tôi đang ở trên biển với những quy định mới này."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation where there are two equally unpleasant or unacceptable choices",
                    "vi": "trong một tình huống khó khăn mà có hai sự lựa chọn khó chịu hoặc không thể chấp nhận được như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become a sailor; to leave your home and family without permission to become a sailor",
                    "vi": "để trở thành một thủy thủ; rời khỏi nhà và gia đình của bạn mà không được phép để trở thành một thủy thủ"
                },
                "examples": [
                    {
                        "en": "He ran away to sea at the age of 13.",
                        "vi": "Anh ấy đã bỏ trốn ra biển vào năm 13 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "far away from land where the sea is deepest",
                    "vi": "xa đất liền nơi biển sâu nhất"
                },
                "examples": [
                    {
                        "en": "She fell overboard and was swept out to sea.",
                        "vi": "Cô bị ngã và bị cuốn ra biển."
                    },
                    {
                        "en": "She stood on the cliff, staring out to sea.",
                        "vi": "Cô đứng trên vách đá, nhìn chằm chằm ra biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a port or harbour by ship or boat",
                    "vi": "rời cảng hoặc bến cảng bằng tàu hoặc thuyền"
                },
                "examples": [
                    {
                        "en": "The ship put to sea in deteriorating weather conditions.",
                        "vi": "Con tàu ra khơi trong điều kiện thời tiết xấu đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to comfort somebody whose romantic relationship has ended by saying that there are many other people with whom they may have a successful relationship in the future",
                    "vi": "được sử dụng để an ủi ai đó có mối quan hệ lãng mạn đã kết thúc bằng cách nói rằng có nhiều người khác mà họ có thể có một mối quan hệ thành công trong tương lai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b865b5917f3040f1b2770db29b8c4c9f",
        "word": "coast",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/kəʊst/",
            "us": "/kəʊst/"
        },
        "nearby": [
            {
                "word": "coarsen",
                "pos": "verb"
            },
            {
                "word": "coarseness",
                "pos": "noun"
            },
            {
                "word": "coast",
                "pos": "noun"
            },
            {
                "word": "coast",
                "pos": "verb"
            },
            {
                "word": "coastal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the land next to or near to the sea or ocean",
                    "vi": "vùng đất bên cạnh hoặc gần biển hoặc đại dương"
                },
                "examples": [
                    {
                        "en": "a trip to the coast",
                        "vi": "một chuyến đi đến bờ biển"
                    },
                    {
                        "en": "coast of something They plan to swim around the coast of Ireland.",
                        "vi": "bờ biển của cái gì đó Họ dự định bơi quanh bờ biển Ireland."
                    },
                    {
                        "en": "the southern/northern/eastern/western coast of Spain",
                        "vi": "bờ biển phía nam / bắc / đông / tây của Tây Ban Nha"
                    },
                    {
                        "en": "on the coast a town on the south/east coast of England",
                        "vi": "trên bờ biển một thị trấn ở bờ biển phía nam / phía đông nước Anh"
                    },
                    {
                        "en": "off the coast islands off the north/west coast of Scotland",
                        "vi": "ngoài khơi các hòn đảo ngoài khơi bờ biển phía bắc / phía tây của Scotland"
                    },
                    {
                        "en": "along the coast We walked along the coast for five miles.",
                        "vi": "dọc theo bờ biển Chúng tôi đi bộ dọc theo bờ biển trong năm dặm."
                    },
                    {
                        "en": "at the coast We spent the day at the coast.",
                        "vi": "ở bờ biển Chúng tôi đã dành cả ngày ở bờ biển."
                    },
                    {
                        "en": "by the coast a holiday by the coast",
                        "vi": "bên bờ biển một kỳ nghỉ bên bờ biển"
                    },
                    {
                        "en": "from coast to coast He cycled 2  500 miles across Australia from coast to coast.",
                        "vi": "từ bờ biển này sang bờ biển khác Anh ta đã đạp xe 2 500 dặm khắp nước Úc từ bờ biển này sang bờ biển khác."
                    },
                    {
                        "en": "the Atlantic coast",
                        "vi": "bờ biển Đại Tây Dương"
                    },
                    {
                        "en": "That's a pretty stretch of coast.",
                        "vi": "Đó là một dải bờ biển đẹp."
                    },
                    {
                        "en": "The coast road is closed due to bad weather.",
                        "vi": "Đường bờ biển bị đóng do thời tiết xấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is no danger of being seen or caught",
                    "vi": "không có nguy cơ bị nhìn thấy hoặc bị bắt"
                },
                "examples": [
                    {
                        "en": "As soon as the coast was clear, he climbed in through the window.",
                        "vi": "Ngay khi bờ biển trong xanh, anh ta trèo qua cửa sổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c28f0a0c54d4000b10a61324929d41d",
        "word": "ocean",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈəʊʃn/",
            "us": "/ˈəʊʃn/"
        },
        "nearby": [
            {
                "word": "occur to",
                "pos": "phrasal verb"
            },
            {
                "word": "OCD",
                "pos": "noun"
            },
            {
                "word": "ocean",
                "pos": "noun"
            },
            {
                "word": "oceanarium",
                "pos": "noun"
            },
            {
                "word": "oceanfront",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mass of salt water that covers most of the earth’s surface",
                    "vi": "khối lượng nước muối bao phủ hầu hết bề mặt trái đất"
                },
                "examples": [
                    {
                        "en": "The ship was dredged from the depths of the ocean.",
                        "vi": "Con tàu được nạo vét từ độ sâu của đại dương."
                    },
                    {
                        "en": "People were swimming in the ocean despite the hurricane warning.",
                        "vi": "Mọi người đang bơi trong đại dương bất chấp cảnh báo bão."
                    },
                    {
                        "en": "The plane hit the ocean several miles offshore.",
                        "vi": "Máy bay đã lao xuống biển cách xa vài dặm."
                    },
                    {
                        "en": "Our beach house is just a couple of miles from the ocean.",
                        "vi": "Ngôi nhà trên bãi biển của chúng tôi chỉ cách đại dương vài dặm."
                    },
                    {
                        "en": "ships large enough to sail the open ocean",
                        "vi": "tàu đủ lớn để đi ra biển khơi"
                    },
                    {
                        "en": "an ocean liner",
                        "vi": "một tàu biển"
                    },
                    {
                        "en": "a species of fish that lives on the ocean floor",
                        "vi": "một loài cá sống dưới đáy đại dương"
                    },
                    {
                        "en": "El Nino is a warm ocean current that appears off the coast of Peru during the winter.",
                        "vi": "El Nino là một dòng hải lưu ấm xuất hiện ngoài khơi bờ biển Peru vào mùa đông."
                    },
                    {
                        "en": "Ocean levels are rising.",
                        "vi": "Mực nước biển đang tăng lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the five large areas that the ocean is divided into",
                    "vi": "một trong năm khu vực rộng lớn mà đại dương được chia thành"
                },
                "examples": [
                    {
                        "en": "the Antarctic/Arctic/Atlantic/Indian/Pacific Ocean",
                        "vi": "Nam Cực / Bắc Cực / Đại Tây Dương / Ấn Độ Dương / Thái Bình Dương"
                    },
                    {
                        "en": "They travelled across oceans in search of a new life.",
                        "vi": "Họ đã đi khắp các đại dương để tìm kiếm một cuộc sống mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of something that is too small or unimportant to make any real difference to a situation",
                    "vi": "một số lượng quá nhỏ hoặc không quan trọng để tạo ra bất kỳ sự khác biệt thực sự nào đối với một tình huống"
                },
                "examples": [
                    {
                        "en": "The amount of money raised was a drop in the ocean compared to what we needed.",
                        "vi": "Số tiền quyên góp được là một giọt nước biển so với những gì chúng tôi cần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount of something",
                    "vi": "một lượng lớn thứ gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "803fd9df5c054fa8b21ad7c05652d4b7",
        "word": "sea level",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈsiː levl/",
            "us": "/ˈsiː levl/"
        },
        "nearby": [
            {
                "word": "sea legs",
                "pos": "noun"
            },
            {
                "word": "sealer",
                "pos": "noun"
            },
            {
                "word": "sea level",
                "pos": "noun"
            },
            {
                "word": "sealift",
                "pos": "noun"
            },
            {
                "word": "seal in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the average height of the sea, used as the basis for measuring the height of all places on land",
                    "vi": "độ cao trung bình của biển, được dùng làm cơ sở để đo độ cao của tất cả các nơi trên đất liền"
                },
                "examples": [
                    {
                        "en": "50 metres above sea level",
                        "vi": "50 mét trên mực nước biển"
                    },
                    {
                        "en": "the problem of rising sea levels",
                        "vi": "vấn đề mực nước biển dâng cao"
                    }
                ]
            }
        ]
    },
    {
        "id": "b0557a0624b04a7aaa603335db078237",
        "word": "coastline",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkəʊstlaɪn/",
            "us": "/ˈkəʊstlaɪn/"
        },
        "nearby": [
            {
                "word": "coaster",
                "pos": "noun"
            },
            {
                "word": "coastguard",
                "pos": "noun"
            },
            {
                "word": "coastline",
                "pos": "noun"
            },
            {
                "word": "coat",
                "pos": "noun"
            },
            {
                "word": "coat",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the land along a coast, especially when you are thinking of its shape or appearance",
                    "vi": "vùng đất dọc theo bờ biển, đặc biệt là khi bạn đang nghĩ về hình dạng hoặc diện mạo của nó"
                },
                "examples": [
                    {
                        "en": "a rugged/rocky/beautiful coastline",
                        "vi": "bờ biển gồ ghề / đá / đẹp"
                    },
                    {
                        "en": "Measures were taken to protect the coastline from the oil spillage.",
                        "vi": "Các biện pháp đã được thực hiện để bảo vệ bờ biển khỏi sự cố tràn dầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2866aab8cd24e4d8482eba5e3bf17d4",
        "word": "port",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pɔːt/",
            "us": "/pɔːrt/"
        },
        "nearby": [
            {
                "word": "porridge",
                "pos": "noun"
            },
            {
                "word": "Porridge",
                "pos": ""
            },
            {
                "word": "port",
                "pos": "noun"
            },
            {
                "word": "port",
                "pos": "verb"
            },
            {
                "word": "portability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a town or city with a harbour, especially one where ships load and unload goods",
                    "vi": "một thị trấn hoặc thành phố có bến cảng, đặc biệt là bến cảng nơi tàu thuyền xếp dỡ hàng hóa"
                },
                "examples": [
                    {
                        "en": "a container/fishing ports",
                        "vi": "một container / cảng cá"
                    },
                    {
                        "en": "Rotterdam is a major port.",
                        "vi": "Rotterdam là một cảng lớn."
                    },
                    {
                        "en": "the port city of Gdansk",
                        "vi": "thành phố cảng Gdansk"
                    },
                    {
                        "en": "the Black Sea ports",
                        "vi": "các cảng Biển Đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where ships load and unload goods or shelter from storms",
                    "vi": "nơi tàu thuyền bốc xếp hàng hóa, tránh trú bão."
                },
                "examples": [
                    {
                        "en": "a naval port",
                        "vi": "một cảng hải quân"
                    },
                    {
                        "en": "a container/ferry port",
                        "vi": "một cảng container / phà"
                    },
                    {
                        "en": "in/into port The ship spent four days in port.",
                        "vi": "vào / vào cảng Con tàu đã ở cảng bốn ngày."
                    },
                    {
                        "en": "They reached port at last.",
                        "vi": "Cuối cùng thì họ cũng đến được cảng."
                    },
                    {
                        "en": "port of entry (= a place where people or goods can enter a country)",
                        "vi": "cảng nhập cảnh (= nơi mà người hoặc hàng hóa có thể vào một quốc gia)"
                    },
                    {
                        "en": "the port authorities",
                        "vi": "chính quyền cảng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong sweet wine, usually dark red, that is made in Portugal. It is usually drunk at the end of a meal.",
                    "vi": "một loại rượu vang ngọt mạnh, thường có màu đỏ sẫm, được sản xuất tại Bồ Đào Nha. Nó thường được uống vào cuối bữa ăn."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a glass of port",
                    "vi": "một ly cảng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the side of a ship or aircraft that is on the left when you are facing forward",
                    "vi": "mặt của một con tàu hoặc máy bay ở bên trái khi bạn hướng về phía trước"
                },
                "examples": [
                    {
                        "en": "the port side",
                        "vi": "phía cảng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place on a computer where you can attach another piece of equipment, often using a cable",
                    "vi": "một nơi trên máy tính, nơi bạn có thể gắn một thiết bị khác, thường sử dụng cáp"
                },
                "examples": [
                    {
                        "en": "the modem port",
                        "vi": "cổng modem"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you are in great trouble, you take any help that is offered",
                    "vi": "nếu bạn đang gặp khó khăn lớn, bạn thực hiện bất kỳ sự trợ giúp nào được cung cấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "63da1c51b4d645f3ad6657c12aa6863d",
        "word": "seaside",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːsaɪd/",
            "us": "/ˈsiːsaɪd/"
        },
        "nearby": [
            {
                "word": "seasick",
                "pos": "adjective"
            },
            {
                "word": "seasickness",
                "pos": "noun"
            },
            {
                "word": "seaside",
                "pos": "noun"
            },
            {
                "word": "seaside",
                "pos": "adjective"
            },
            {
                "word": "seaside postcard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area that is by the sea, especially one where people go for a day or a holiday",
                    "vi": "một khu vực gần biển, đặc biệt là một trong những nơi mọi người đến trong một ngày hoặc một kỳ nghỉ"
                },
                "examples": [
                    {
                        "en": "a trip to the seaside",
                        "vi": "một chuyến đi đến bờ biển"
                    },
                    {
                        "en": "at the seaside Summers were spent at the seaside.",
                        "vi": "ở bên bờ biển Mùa hè đã được dành ở bên bờ biển."
                    },
                    {
                        "en": "by the seaside They have a cottage by the seaside.",
                        "vi": "bên bờ biển Họ có một ngôi nhà nhỏ bên bờ biển."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd037f649b324f2aba7353c813109a2c",
        "word": "seaside",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːsaɪd/",
            "us": "/ˈsiːsaɪd/"
        },
        "nearby": [
            {
                "word": "seasickness",
                "pos": "noun"
            },
            {
                "word": "seaside",
                "pos": "noun"
            },
            {
                "word": "seaside",
                "pos": "adjective"
            },
            {
                "word": "seaside postcard",
                "pos": "noun"
            },
            {
                "word": "season",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with an area that is by the sea, especially one where people go for a day or a holiday",
                    "vi": "được kết nối với một khu vực gần biển, đặc biệt là một trong những nơi mọi người đến trong một ngày hoặc một kỳ nghỉ"
                },
                "examples": [
                    {
                        "en": "a seaside resort",
                        "vi": "Khu nghỉ mát ven biển"
                    },
                    {
                        "en": "a seaside vacation home",
                        "vi": "một nhà nghỉ bên bờ biển"
                    }
                ]
            }
        ]
    },
    {
        "id": "d1fc9c66992446ceb39ef76b647b43f3",
        "word": "cliff",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/klɪf/",
            "us": "/klɪf/"
        },
        "nearby": [
            {
                "word": "client-server",
                "pos": "adjective"
            },
            {
                "word": "client state",
                "pos": "noun"
            },
            {
                "word": "cliff",
                "pos": "noun"
            },
            {
                "word": "Cliff",
                "pos": ""
            },
            {
                "word": "cliffhanger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a high area of rock with a very steep side, often at the edge of the sea or ocean",
                    "vi": "một khu vực đá cao với sườn rất dốc, thường ở rìa biển hoặc đại dương"
                },
                "examples": [
                    {
                        "en": "the cliff edge/top",
                        "vi": "mép / đỉnh vách đá"
                    },
                    {
                        "en": "the chalk cliffs of southern England",
                        "vi": "những vách đá phấn ở miền nam nước Anh"
                    },
                    {
                        "en": "a castle perched high on the cliffs above the river",
                        "vi": "một lâu đài sừng sững trên vách đá phía trên sông"
                    },
                    {
                        "en": "We set off along the cliff path.",
                        "vi": "Chúng tôi bắt đầu dọc theo con đường vách đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decrease quickly and suddenly in quantity or quality",
                    "vi": "giảm nhanh chóng và đột ngột về số lượng hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "Sales fell off a cliff in the first quarter of the year.",
                        "vi": "Doanh số bán hàng giảm mạnh trong quý đầu tiên của năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "59a4261539d84cffb1c1d90bf3e53315",
        "word": "dune",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/djuːn/",
            "us": "/duːn/"
        },
        "nearby": [
            {
                "word": "Dundee cake",
                "pos": "noun"
            },
            {
                "word": "dunderhead",
                "pos": "noun"
            },
            {
                "word": "dune",
                "pos": "noun"
            },
            {
                "word": "dune buggy",
                "pos": "noun"
            },
            {
                "word": "Dunedin",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small hill of sand formed by the wind, near the sea or in a desert",
                    "vi": "một ngọn đồi cát nhỏ do gió tạo thành, gần biển hoặc trong sa mạc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1c7e7ea812194671891aaff6454b5d6a",
        "word": "out to sea",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/siː/",
            "us": "/siː/"
        },
        "nearby": [
            {
                "word": "SDS",
                "pos": ""
            },
            {
                "word": "SE",
                "pos": "abbreviation"
            },
            {
                "word": "sea",
                "pos": "noun"
            },
            {
                "word": "sea air",
                "pos": "noun"
            },
            {
                "word": "sea anemone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the salt water that covers most of the earth’s surface and surrounds its continents and islands",
                    "vi": "nước mặn bao phủ hầu hết bề mặt trái đất và bao quanh các lục địa và đảo của nó"
                },
                "examples": [
                    {
                        "en": "The waste was dumped in the sea.",
                        "vi": "Chất thải được đổ ra biển."
                    },
                    {
                        "en": "The wreck is lying at the bottom of the sea.",
                        "vi": "Xác tàu nằm dưới đáy biển."
                    },
                    {
                        "en": "by sea to travel by sea",
                        "vi": "bằng đường biển để đi du lịch bằng đường biển"
                    },
                    {
                        "en": "by the sea a cottage by the sea",
                        "vi": "cạnh biển một ngôi nhà nhỏ ven biển"
                    },
                    {
                        "en": "He was shot down into the sea off (= near) Japan.",
                        "vi": "Anh ta bị bắn rơi xuống biển ngoài khơi Nhật Bản."
                    },
                    {
                        "en": "We left port and headed for the open sea (= far away from land).",
                        "vi": "Chúng tôi rời cảng và hướng ra biển khơi (= rất xa đất liền)."
                    },
                    {
                        "en": "the cold seas of the Arctic",
                        "vi": "vùng biển lạnh giá của Bắc Cực"
                    },
                    {
                        "en": "a sea voyage",
                        "vi": "một chuyến đi biển"
                    },
                    {
                        "en": "a hotel room with sea view",
                        "vi": "một phòng khách sạn nhìn ra biển"
                    },
                    {
                        "en": "The temperature of most of the deep sea is only just above freezing.",
                        "vi": "Nhiệt độ của hầu hết các vùng biển sâu chỉ trên mức đóng băng."
                    },
                    {
                        "en": "The boat, broken to bits, lay on the sea floor.",
                        "vi": "Con thuyền, vỡ tan tành, nằm dưới đáy biển."
                    },
                    {
                        "en": "The amount of Arctic sea ice in summer has shrunk 15 to 20%.",
                        "vi": "Lượng băng ở biển Bắc Cực vào mùa hè đã giảm từ 15 đến 20%."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of salt water that is part of an ocean or surrounded by land",
                    "vi": "một vùng nước mặn lớn là một phần của đại dương hoặc được bao quanh bởi đất liền"
                },
                "examples": [
                    {
                        "en": "the North Sea",
                        "vi": "Biển Bắc"
                    },
                    {
                        "en": "the Caspian Sea",
                        "vi": "biển Caspi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of the waves of the sea",
                    "vi": "sự chuyển động của sóng biển"
                },
                "examples": [
                    {
                        "en": "It was a calm sea.",
                        "vi": "Đó là một vùng biển yên tĩnh."
                    },
                    {
                        "en": "The sea was very rough.",
                        "vi": "Biển động lắm."
                    },
                    {
                        "en": "The ship sank in heavy seas.",
                        "vi": "Con tàu chìm trong biển lớn."
                    },
                    {
                        "en": "stormy/choppy seas",
                        "vi": "biển có bão / gió giật"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount of something that stretches over a wide area",
                    "vi": "một lượng lớn thứ gì đó trải dài trên một khu vực rộng lớn"
                },
                "examples": [
                    {
                        "en": "He looked down at the sea of smiling faces before him.",
                        "vi": "Anh nhìn xuống biển những khuôn mặt tươi cười trước mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "on the sea, especially in a ship, or in the sea",
                    "vi": "trên biển, đặc biệt là trên tàu, hoặc trên biển"
                },
                "examples": [
                    {
                        "en": "It happened on the second night at sea.",
                        "vi": "Nó xảy ra vào đêm thứ hai trên biển."
                    },
                    {
                        "en": "They were lost at sea.",
                        "vi": "Họ đã bị mất tích trên biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "confused and not knowing what to do",
                    "vi": "bối rối và không biết phải làm gì"
                },
                "examples": [
                    {
                        "en": "I'm all at sea with these new regulations.",
                        "vi": "Tôi đang ở trên biển với những quy định mới này."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation where there are two equally unpleasant or unacceptable choices",
                    "vi": "trong một tình huống khó khăn mà có hai sự lựa chọn khó chịu hoặc không thể chấp nhận được như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become a sailor; to leave your home and family without permission to become a sailor",
                    "vi": "để trở thành một thủy thủ; rời khỏi nhà và gia đình của bạn mà không được phép để trở thành một thủy thủ"
                },
                "examples": [
                    {
                        "en": "He ran away to sea at the age of 13.",
                        "vi": "Anh ấy đã bỏ trốn ra biển vào năm 13 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "far away from land where the sea is deepest",
                    "vi": "xa đất liền nơi biển sâu nhất"
                },
                "examples": [
                    {
                        "en": "She fell overboard and was swept out to sea.",
                        "vi": "Cô bị ngã và bị cuốn ra biển."
                    },
                    {
                        "en": "She stood on the cliff, staring out to sea.",
                        "vi": "Cô đứng trên vách đá, nhìn chằm chằm ra biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a port or harbour by ship or boat",
                    "vi": "rời cảng hoặc bến cảng bằng tàu hoặc thuyền"
                },
                "examples": [
                    {
                        "en": "The ship put to sea in deteriorating weather conditions.",
                        "vi": "Con tàu ra khơi trong điều kiện thời tiết xấu đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to comfort somebody whose romantic relationship has ended by saying that there are many other people with whom they may have a successful relationship in the future",
                    "vi": "được sử dụng để an ủi ai đó có mối quan hệ lãng mạn đã kết thúc bằng cách nói rằng có nhiều người khác mà họ có thể có một mối quan hệ thành công trong tương lai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "36a5475b92574d1d91001545a3183e3a",
        "word": "reef",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/riːf/",
            "us": "/riːf/"
        },
        "nearby": [
            {
                "word": "re-education",
                "pos": "noun"
            },
            {
                "word": "reedy",
                "pos": "adjective"
            },
            {
                "word": "reef",
                "pos": "noun"
            },
            {
                "word": "reef",
                "pos": "verb"
            },
            {
                "word": "reefer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long line of rocks or sand near the surface of the sea",
                    "vi": "một hàng dài đá hoặc cát gần mặt biển"
                },
                "examples": [
                    {
                        "en": "a coral reef",
                        "vi": "một rạn san hô"
                    },
                    {
                        "en": "the Great Barrier Reef",
                        "vi": "rạn san hô Great Barrier"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a sail that can be tied or rolled up to make the sail smaller in a strong wind",
                    "vi": "một phần của cánh buồm có thể được buộc hoặc cuộn lại để làm cho cánh buồm nhỏ hơn trong gió mạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e62f99d9c33248ffab3a9aa173558a9e",
        "word": "rock pool",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrɒk puːl/",
            "us": "/ˈrɑːk puːl/"
        },
        "nearby": [
            {
                "word": "the Rock of Gibraltar",
                "pos": "noun"
            },
            {
                "word": "rock out",
                "pos": "phrasal verb"
            },
            {
                "word": "rock pool",
                "pos": "noun"
            },
            {
                "word": "rock salt",
                "pos": "noun"
            },
            {
                "word": "rock solid",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small amount of water that collects between the rocks by the sea",
                    "vi": "một lượng nước nhỏ đọng lại giữa các tảng đá bên bờ biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4e68381838843fcace07a5ff44c5e8a",
        "word": "salt water",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɔːlt wɔːtə(r)/",
            "us": "/ˈsɔːlt wɔːtər/"
        },
        "nearby": [
            {
                "word": "salt shaker",
                "pos": "noun"
            },
            {
                "word": "salt truck",
                "pos": "noun"
            },
            {
                "word": "salt water",
                "pos": "noun"
            },
            {
                "word": "saltwater",
                "pos": "adjective"
            },
            {
                "word": "salty",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "water containing salt; seawater",
                    "vi": "nước có chứa muối; nước biển"
                },
                "examples": [
                    {
                        "en": "These fish will quickly die in salt water.",
                        "vi": "Những con cá này sẽ nhanh chóng chết trong nước mặn."
                    }
                ]
            }
        ]
    },
    {
        "id": "8b1a86b112d94640853771b9b22ecd7a",
        "word": "saltwater",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɔːltwɔːtə(r)/",
            "us": "/ˈsɔːltwɔːtər/"
        },
        "nearby": [
            {
                "word": "salt truck",
                "pos": "noun"
            },
            {
                "word": "salt water",
                "pos": "noun"
            },
            {
                "word": "saltwater",
                "pos": "adjective"
            },
            {
                "word": "salty",
                "pos": "adjective"
            },
            {
                "word": "salubrious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "found in or connected with seawater or water containing salt",
                    "vi": "được tìm thấy trong hoặc kết nối với nước biển hoặc nước có chứa muối"
                },
                "examples": [
                    {
                        "en": "saltwater fish",
                        "vi": "Cá nước mặn"
                    }
                ]
            }
        ]
    },
    {
        "id": "9791c57da9424d0db858c8a1534db1c1",
        "word": "sand dune",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsænd djuːn/",
            "us": "/ˈsænd duːn/"
        },
        "nearby": [
            {
                "word": "Carl Sandburg",
                "pos": ""
            },
            {
                "word": "sandcastle",
                "pos": "noun"
            },
            {
                "word": "sand dune",
                "pos": "noun"
            },
            {
                "word": "sander",
                "pos": "noun"
            },
            {
                "word": "Colonel Sanders",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small hill of sand formed by the wind, near the sea or in a desert",
                    "vi": "một ngọn đồi cát nhỏ do gió tạo thành, gần biển hoặc trong sa mạc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cb7ca26602164621977e1e2c5287d00f",
        "word": "the seabed",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ðə ˈsiːbed/",
            "us": "/ðə ˈsiːbed/"
        },
        "nearby": [
            {
                "word": "sea air",
                "pos": "noun"
            },
            {
                "word": "sea anemone",
                "pos": "noun"
            },
            {
                "word": "the seabed",
                "pos": "noun"
            },
            {
                "word": "seabird",
                "pos": "noun"
            },
            {
                "word": "seaboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the floor of the sea",
                    "vi": "đáy biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1d83a69e9b2d4f01ab2294c6b2725bd2",
        "word": "seashore",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsiːʃɔː(r)/",
            "us": "/ˈsiːʃɔːr/"
        },
        "nearby": [
            {
                "word": "sea shanty",
                "pos": "noun"
            },
            {
                "word": "seashell",
                "pos": "noun"
            },
            {
                "word": "seashore",
                "pos": "noun"
            },
            {
                "word": "seasick",
                "pos": "adjective"
            },
            {
                "word": "seasickness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the land along the edge of the sea or ocean, usually where there is sand and rocks",
                    "vi": "vùng đất dọc theo mép biển hoặc đại dương, thường là nơi có cát và đá"
                },
                "examples": [
                    {
                        "en": "He liked to look for shells on the seashore.",
                        "vi": "Anh thích tìm kiếm vỏ sò trên bờ biển."
                    }
                ]
            }
        ]
    },
    {
        "id": "63b06e2b1c1e4bd8b98a41e8f27863da",
        "word": "shore",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ʃɔː(r)/",
            "us": "/ʃɔːr/"
        },
        "nearby": [
            {
                "word": "shop window",
                "pos": "noun"
            },
            {
                "word": "shopworn",
                "pos": "adjective"
            },
            {
                "word": "shore",
                "pos": "noun"
            },
            {
                "word": "shore",
                "pos": "verb"
            },
            {
                "word": "shoreline",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the land along the edge of the sea, the ocean or a lake",
                    "vi": "vùng đất dọc theo mép biển, đại dương hoặc hồ"
                },
                "examples": [
                    {
                        "en": "a rocky/sandy shore",
                        "vi": "bờ đá / cát"
                    },
                    {
                        "en": "to swim from the boat to the shore",
                        "vi": "bơi từ thuyền vào bờ"
                    },
                    {
                        "en": "on the shore Rubbish of all sorts is washed up on the shore.",
                        "vi": "trên bờ Rác thải trôi dạt vào bờ."
                    },
                    {
                        "en": "on the shores of something a house on the shores of the lake",
                        "vi": "trên bờ cái gì đó của một ngôi nhà trên bờ hồ"
                    },
                    {
                        "en": "off shore The ship was anchored off shore.",
                        "vi": "ngoài khơi Con tàu đã nhổ neo ngoài khơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area that is by the sea or ocean, especially one where people go for a day or a holiday",
                    "vi": "một khu vực gần biển hoặc đại dương, đặc biệt là một khu vực mà mọi người đến trong một ngày hoặc một kỳ nghỉ"
                },
                "examples": [
                    {
                        "en": "Let's go to the shore.",
                        "vi": "Lên bờ thôi."
                    },
                    {
                        "en": "We spent our vacation at the shore.",
                        "vi": "Chúng tôi đã dành kỳ nghỉ của chúng tôi ở bờ biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a country, especially one with a coast",
                    "vi": "một quốc gia, đặc biệt là một quốc gia có bờ biển"
                },
                "examples": [
                    {
                        "en": "foreign shores",
                        "vi": "bờ biển nước ngoài"
                    },
                    {
                        "en": "What brings you to these shores?",
                        "vi": "Điều gì đưa bạn đến những bến bờ này?"
                    }
                ]
            }
        ]
    },
    {
        "id": "fa98791fc33e436991252852f8d2c674",
        "word": "bay",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/beɪ/",
            "us": "/beɪ/"
        },
        "nearby": [
            {
                "word": "bawl",
                "pos": "verb"
            },
            {
                "word": "bawl out",
                "pos": "phrasal verb"
            },
            {
                "word": "bay",
                "pos": "noun"
            },
            {
                "word": "bay",
                "pos": "verb"
            },
            {
                "word": "bay",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of the sea, or of a large lake, partly surrounded by a wide curve of the land",
                    "vi": "một phần của biển, hoặc của một hồ lớn, một phần được bao quanh bởi một đường cong rộng của đất"
                },
                "examples": [
                    {
                        "en": "the Bay of Bengal",
                        "vi": "Vịnh Bengal"
                    },
                    {
                        "en": "Hudson Bay",
                        "vi": "Vịnh Hudson"
                    },
                    {
                        "en": "a magnificent view across the bay",
                        "vi": "một khung cảnh tuyệt đẹp trên vịnh"
                    },
                    {
                        "en": "apartments overlooking the bay",
                        "vi": "căn hộ nhìn ra vịnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a marked section of ground either inside or outside a building, for example for a vehicle to park in, for storing things, etc.",
                    "vi": "một phần được đánh dấu của mặt đất bên trong hoặc bên ngoài tòa nhà, ví dụ như để xe đậu, để cất giữ đồ đạc, v.v."
                },
                "examples": [
                    {
                        "en": "a parking/loading bay",
                        "vi": "một bãi đậu xe / khoang tải"
                    },
                    {
                        "en": "Put the equipment in No 3 bay.",
                        "vi": "Đặt thiết bị ở khoang số 3."
                    }
                ]
            },
            {
                "define": {
                    "en": "a curved area of a room or building that sticks out from the rest of the building",
                    "vi": "một khu vực cong của một căn phòng hoặc tòa nhà nhô ra khỏi phần còn lại của tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a horse of a dark brown colour",
                    "vi": "một con ngựa màu nâu sẫm"
                },
                "examples": [
                    {
                        "en": "He was riding a big bay.",
                        "vi": "Anh ấy đang cưỡi trên một vịnh lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a deep noise, especially the noise made by dogs when hunting",
                    "vi": "tiếng ồn sâu, đặc biệt là tiếng ồn do chó phát ra khi đi săn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small tree with dark green leaves with a sweet smell that are used in cooking",
                    "vi": "một cây nhỏ có lá màu xanh đậm, có mùi ngọt được dùng trong nấu ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the leaves of the bay tree, used in cooking as a herb",
                    "vi": "lá của cây vịnh, được sử dụng trong nấu ăn như một loại thảo mộc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when an animal that is being hunted is at bay, it must turn and face the dogs and hunters because it is impossible to escape from them",
                    "vi": "khi một con vật đang bị săn bắt ở vịnh, nó phải quay lại và đối mặt với chó và thợ săn vì không thể thoát khỏi chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent an enemy from coming close or a problem from having a bad effect",
                    "vi": "để ngăn kẻ thù đến gần hoặc một vấn đề có ảnh hưởng xấu"
                },
                "examples": [
                    {
                        "en": "I'm trying to keep my creditors at bay.",
                        "vi": "Tôi đang cố gắng ngăn cản các chủ nợ của mình."
                    },
                    {
                        "en": "Charlotte bit her lip to hold the tears at bay.",
                        "vi": "Charlotte cắn chặt môi để cố nén nước mắt."
                    }
                ]
            }
        ]
    },
    {
        "id": "2b5944afccda4fef8a4b69ea41d5afc5",
        "word": "cove",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊv/",
            "us": "/kəʊv/"
        },
        "nearby": [
            {
                "word": "covalent",
                "pos": "adjective"
            },
            {
                "word": "covariant",
                "pos": "adjective"
            },
            {
                "word": "cove",
                "pos": "noun"
            },
            {
                "word": "coven",
                "pos": "noun"
            },
            {
                "word": "covenant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small bay (= an area of sea that is partly surrounded by land)",
                    "vi": "một vịnh nhỏ (= một vùng biển được bao quanh một phần bởi đất liền)"
                },
                "examples": [
                    {
                        "en": "a secluded cove",
                        "vi": "một vịnh nhỏ hẻo lánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a man",
                    "vi": "một người đàn ông"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "70e4108daa6241e79c9fbeedd4c83eb2",
        "word": "dock",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɒk/",
            "us": "/dɑːk/"
        },
        "nearby": [
            {
                "word": "docilely",
                "pos": "adverb"
            },
            {
                "word": "docility",
                "pos": "noun"
            },
            {
                "word": "dock",
                "pos": "noun"
            },
            {
                "word": "dock",
                "pos": "verb"
            },
            {
                "word": "docker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a port where ships are repaired, or where goods are put onto or taken off them",
                    "vi": "một phần của cảng nơi tàu được sửa chữa, hoặc nơi hàng hóa được đưa lên hoặc đưa xuống tàu"
                },
                "examples": [
                    {
                        "en": "dock workers",
                        "vi": "công nhân cảng"
                    },
                    {
                        "en": "in dock The ship was in dock.",
                        "vi": "ở bến tàu Con tàu đã vào bến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of docks in a port and the buildings around them that are used for repairing ships, storing goods, etc.",
                    "vi": "một nhóm các bến tàu trong một cảng và các tòa nhà xung quanh chúng được sử dụng để sửa chữa tàu, lưu trữ hàng hóa, v.v."
                },
                "examples": [
                    {
                        "en": "The great system of commercial docks began in the Middle Ages.",
                        "vi": "Hệ thống bến cảng thương mại vĩ đại bắt đầu từ thời Trung cổ."
                    },
                    {
                        "en": "There are plans to redevelop the old docks for new housing.",
                        "vi": "Có kế hoạch tái phát triển các bến tàu cũ để xây dựng nhà ở mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wall or platform built out into the sea, a river, etc., where boats can be tied and where people can get on and off boats",
                    "vi": "một bức tường hoặc nền được xây dựng ra biển, sông, v.v., nơi có thể buộc thuyền và nơi mọi người có thể lên và xuống thuyền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a raised platform for loading vehicles or trains",
                    "vi": "một nền tảng nâng cao để tải phương tiện hoặc tàu hỏa"
                },
                "examples": [
                    {
                        "en": "The products are then taken to the loading dock and delivered to their destination.",
                        "vi": "Sau đó, các sản phẩm được đưa đến bến xếp hàng và chuyển đến nơi tiêu thụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a court where the person who has been accused of a crime stands or sits during a trial",
                    "vi": "phần của tòa án nơi người bị buộc tội đứng hoặc ngồi trong khi xét xử"
                },
                "examples": [
                    {
                        "en": "in the dock He's been in the dock (= on trial for a crime) several times already.",
                        "vi": "trong bến tàu Anh ta đã ở trong bến tàu (= đang bị xét xử tội phạm) vài lần rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wild plant of northern Europe with large thick leaves that can be rubbed on skin that has been stung by nettles to make it less painful",
                    "vi": "Một loại cây dại ở Bắc Âu có lá to dày có thể dùng cây tầm ma xoa lên vùng da bị đốt để bớt đau"
                },
                "examples": [
                    {
                        "en": "dock leaves",
                        "vi": "bến tàu rời đi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment to which a laptop, smartphone or other mobile device can be connected, to provide access to a power supply or so that it can be used with a printer, a keyboard, speakers, etc.",
                    "vi": "một phần thiết bị có thể kết nối với máy tính xách tay, điện thoại thông minh hoặc thiết bị di động khác, để cung cấp quyền truy cập vào nguồn điện hoặc để có thể sử dụng thiết bị này với máy in, bàn phím, loa, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b8eea901f734c10be580650e3bb6924",
        "word": "flow",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fləʊ/",
            "us": "/fləʊ/"
        },
        "nearby": [
            {
                "word": "flout",
                "pos": "verb"
            },
            {
                "word": "flow-on",
                "pos": "adjective"
            },
            {
                "word": "flow",
                "pos": "noun"
            },
            {
                "word": "flow",
                "pos": "verb"
            },
            {
                "word": "flow chart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the steady and continuous movement of something/somebody in one direction",
                    "vi": "chuyển động ổn định và liên tục của một cái gì đó / ai đó theo một hướng"
                },
                "examples": [
                    {
                        "en": "the flow of an electric current",
                        "vi": "dòng điện"
                    },
                    {
                        "en": "flow (of something) (from something) She tried to stop the flow of blood from the wound.",
                        "vi": "flow (of something) (từ cái gì đó) Cô ấy cố gắng ngăn dòng máu chảy ra từ vết thương."
                    },
                    {
                        "en": "flow (of something) to something Exercise increases blood flow to the brain.",
                        "vi": "chảy (của một cái gì đó) đến một cái gì đó Tập thể dục làm tăng lưu lượng máu đến não."
                    },
                    {
                        "en": "flow (of something) into something an endless flow of refugees into the country",
                        "vi": "dòng chảy (của một cái gì đó) vào một cái gì đó một dòng người tị nạn vô tận vào đất nước"
                    },
                    {
                        "en": "flow (of something) through something a steady flow of traffic through the city",
                        "vi": "dòng chảy (của một cái gì đó) qua một cái gì đó một luồng giao thông ổn định qua thành phố"
                    },
                    {
                        "en": "to improve traffic flow (= make it move faster)",
                        "vi": "để cải thiện lưu lượng truy cập (= làm cho nó di chuyển nhanh hơn)"
                    },
                    {
                        "en": "to control the direction of flow",
                        "vi": "để kiểm soát hướng của dòng chảy"
                    },
                    {
                        "en": "Cut back surrounding vegetation to increase light and air flow.",
                        "vi": "Cắt bớt thảm thực vật xung quanh để tăng ánh sáng và luồng không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "the continuous production or supply of something",
                    "vi": "liên tục sản xuất hoặc cung cấp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to encourage the free flow of information",
                        "vi": "để khuyến khích luồng thông tin tự do"
                    },
                    {
                        "en": "efforts to stem the flow of illegal drugs",
                        "vi": "nỗ lực ngăn chặn dòng chảy ma túy bất hợp pháp"
                    },
                    {
                        "en": "We are looking to improve data flow by up to 50%.",
                        "vi": "Chúng tôi đang tìm cách cải thiện luồng dữ liệu lên đến 50%."
                    },
                    {
                        "en": "flow of something to something the flow of goods and services to remote areas",
                        "vi": "dòng chảy của thứ gì đó đến thứ gì đó như dòng chảy của hàng hóa và dịch vụ đến các vùng sâu vùng xa"
                    }
                ]
            },
            {
                "define": {
                    "en": "continuous talk by somebody",
                    "vi": "nói chuyện liên tục của ai đó"
                },
                "examples": [
                    {
                        "en": "You've interrupted my flow—I can't remember what I was saying.",
                        "vi": "Bạn đã làm gián đoạn luồng của tôi — tôi không thể nhớ mình đã nói gì."
                    },
                    {
                        "en": "He kept up a flow of chatter.",
                        "vi": "Anh ta tiếp tục nói chuyện phiếm."
                    },
                    {
                        "en": "As usual, Tom was in full flow (= talking confidently in a way that is hard to interrupt).",
                        "vi": "Như thường lệ, Tom vẫn hoàn toàn bình tĩnh (= nói chuyện một cách tự tin theo cách khó có thể ngắt lời)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that words, ideas or themes are linked together in speech, writing or music",
                    "vi": "cách mà các từ, ý tưởng hoặc chủ đề được liên kết với nhau trong lời nói, bài viết hoặc âm nhạc"
                },
                "examples": [
                    {
                        "en": "Too many examples can interrupt the smooth flow of the text.",
                        "vi": "Quá nhiều ví dụ có thể làm gián đoạn dòng chảy trôi chảy của văn bản."
                    },
                    {
                        "en": "I found it hard to follow the flow of the argument.",
                        "vi": "Tôi cảm thấy thật khó để theo dõi luồng tranh luận."
                    },
                    {
                        "en": "I liked the concerto for its natural flow.",
                        "vi": "Tôi thích bản concerto vì dòng chảy tự nhiên của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of the sea towards the land",
                    "vi": "sự chuyển động của biển đối với đất liền"
                },
                "examples": [
                    {
                        "en": "the ebb and flow of the tide",
                        "vi": "sự lên xuống của thủy triều"
                    }
                ]
            },
            {
                "define": {
                    "en": "the repeated, often regular, movement from one state to another; the repeated change in level, numbers or amount",
                    "vi": "sự chuyển động lặp đi lặp lại, thường xuyên, từ trạng thái này sang trạng thái khác; sự thay đổi lặp đi lặp lại về cấp độ, số lượng hoặc số lượng"
                },
                "examples": [
                    {
                        "en": "the ebb and flow of the seasons",
                        "vi": "sự lên xuống của các mùa"
                    },
                    {
                        "en": "She sat in silence enjoying the ebb and flow of conversation.",
                        "vi": "Cô ấy ngồi trong im lặng tận hưởng cuộc trò chuyện thăng trầm."
                    },
                    {
                        "en": "He had known her long enough to recognize the ebb and flow of her moods.",
                        "vi": "Anh đã biết cô đủ lâu để nhận ra sự lên xuống của tâm trạng cô."
                    },
                    {
                        "en": "the natural ebb and flow of water",
                        "vi": "sự lên xuống tự nhiên và dòng chảy của nước"
                    },
                    {
                        "en": "We see a constant ebb and flow of jobs.",
                        "vi": "Chúng tôi nhận thấy sự lên xuống liên tục của công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be relaxed and not worry about what you should do",
                    "vi": "được thư giãn và không phải lo lắng về những gì bạn nên làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a41325f243b4434088ff85b0f819f750",
        "word": "gulf",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡʌlf/",
            "us": "/ɡʌlf/"
        },
        "nearby": [
            {
                "word": "Gulag",
                "pos": "noun"
            },
            {
                "word": "gulch",
                "pos": "noun"
            },
            {
                "word": "gulf",
                "pos": "noun"
            },
            {
                "word": "the Gulf of Mexico",
                "pos": ""
            },
            {
                "word": "Gulf States",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large area of sea that is partly surrounded by land",
                    "vi": "một vùng biển rộng lớn được bao quanh bởi đất liền"
                },
                "examples": [
                    {
                        "en": "the Gulf of Mexico",
                        "vi": "Vịnh Mexico"
                    }
                ]
            },
            {
                "define": {
                    "en": "the Persian Gulf, the area of sea between the Arabian peninsula and Iran",
                    "vi": "Vịnh Ba Tư, vùng biển giữa bán đảo Ả Rập và Iran"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large difference between two people or groups in the way that they think, live or feel",
                    "vi": "sự khác biệt lớn giữa hai người hoặc nhóm trong cách họ nghĩ, sống hoặc cảm nhận"
                },
                "examples": [
                    {
                        "en": "The gulf between rich and poor is enormous.",
                        "vi": "Khoảng cách giữa người giàu và người nghèo là rất lớn."
                    },
                    {
                        "en": "It felt as if a gulf had opened up between his life and mine.",
                        "vi": "Cảm giác như thể có một hố sâu ngăn cách giữa cuộc đời anh và tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wide deep opening in the ground",
                    "vi": "một lỗ sâu rộng trong lòng đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reduce or get rid of the differences that exist between two things or groups of people",
                    "vi": "để giảm bớt hoặc loại bỏ những khác biệt tồn tại giữa hai sự vật hoặc nhóm người"
                },
                "examples": [
                    {
                        "en": "The new degree course aims to bridge the gulf between education and industry.",
                        "vi": "Khóa học cấp bằng mới nhằm mục đích thu hẹp khoảng cách giữa giáo dục và công nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "641b8856b03d46b9aaf480c015dddb9f",
        "word": "high tide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhaɪ ˈtaɪd/",
            "us": "/ˌhaɪ ˈtaɪd/"
        },
        "nearby": [
            {
                "word": "high technology",
                "pos": "noun"
            },
            {
                "word": "high-tension",
                "pos": "adjective"
            },
            {
                "word": "high tide",
                "pos": "noun"
            },
            {
                "word": "high-top",
                "pos": "adjective"
            },
            {
                "word": "high-tops",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the sea has risen to its highest level in a particular place; the sea at this time",
                    "vi": "thời điểm nước biển dâng cao nhất ở một nơi cụ thể; biển vào lúc này"
                },
                "examples": [
                    {
                        "en": "at high tide You can't walk along this beach at high tide.",
                        "vi": "khi thủy triều lên Bạn không thể đi bộ dọc theo bãi biển này khi thủy triều lên."
                    },
                    {
                        "en": "(figurative) the high tide of Victorian prosperity (= the time when something is most popular or successful)",
                        "vi": "(nghĩa bóng) thời kỳ thịnh vượng thời Victoria (= thời điểm mà thứ gì đó phổ biến hoặc thành công nhất)"
                    }
                ]
            }
        ]
    },
    {
        "id": "c23e646115ff4408a48f6e9bc2eb3dd8",
        "word": "iceberg",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈaɪsbɜːɡ/",
            "us": "/ˈaɪsbɜːrɡ/"
        },
        "nearby": [
            {
                "word": "ice age",
                "pos": "noun"
            },
            {
                "word": "ice axe",
                "pos": "noun"
            },
            {
                "word": "iceberg",
                "pos": "noun"
            },
            {
                "word": "iceberg lettuce",
                "pos": "noun"
            },
            {
                "word": "iceblock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extremely large mass of ice floating in the sea",
                    "vi": "một khối băng cực lớn trôi trên biển"
                },
                "examples": [
                    {
                        "en": "The ship struck a hidden iceberg.",
                        "vi": "Con tàu va phải một tảng băng ẩn."
                    }
                ]
            },
            {
                "define": {
                    "en": "only a small part of a much larger problem",
                    "vi": "chỉ là một phần nhỏ của một vấn đề lớn hơn nhiều"
                },
                "examples": [
                    {
                        "en": "This figure represents only the tip of the iceberg, since as many as 90% of cases go unreported.",
                        "vi": "Con số này chỉ đại diện cho phần nổi của tảng băng chìm, vì có tới 90% trường hợp không được báo cáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "a5d58c59ada84c77b8c0ef424da276c0",
        "word": "land bridge",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlænd brɪdʒ/",
            "us": "/ˈlænd brɪdʒ/"
        },
        "nearby": [
            {
                "word": "landau",
                "pos": "noun"
            },
            {
                "word": "land-based",
                "pos": "adjective"
            },
            {
                "word": "land bridge",
                "pos": "noun"
            },
            {
                "word": "landed",
                "pos": "adjective"
            },
            {
                "word": "landed immigrant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of land between two large land masses, especially one that existed a long time ago and that humans and animals could cross, but was later covered by the sea",
                    "vi": "một mảnh đất hẹp giữa hai khối đất rộng lớn, đặc biệt là một mảnh đất đã tồn tại từ rất lâu đời mà con người và động vật có thể băng qua, nhưng sau đó đã bị biển bao phủ."
                },
                "examples": [
                    {
                        "en": "The Bering Straits were once a land bridge between Asia and North America.",
                        "vi": "Eo biển Bering từng là cầu nối trên bộ giữa châu Á và Bắc Mỹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c5c53663aab490ba0f05246eb20660a",
        "word": "low tide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌləʊ ˈtaɪd/",
            "us": "/ˌləʊ ˈtaɪd/"
        },
        "nearby": [
            {
                "word": "low-slung",
                "pos": "adjective"
            },
            {
                "word": "low-tech",
                "pos": "adjective"
            },
            {
                "word": "low tide",
                "pos": "noun"
            },
            {
                "word": "low water",
                "pos": "noun"
            },
            {
                "word": "low-water mark",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the sea is at its lowest level in a particular place; the sea at this time",
                    "vi": "thời điểm khi biển ở mức thấp nhất ở một nơi cụ thể; biển vào lúc này"
                },
                "examples": [
                    {
                        "en": "at low tide The island can only be reached at low tide.",
                        "vi": "Khi thủy triều xuống Đảo chỉ có thể đến được khi thủy triều xuống."
                    }
                ]
            }
        ]
    },
    {
        "id": "c98521e0a7384713a67ca869775c7b7d",
        "word": "marine",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈriːn/",
            "us": "/məˈriːn/"
        },
        "nearby": [
            {
                "word": "marinara",
                "pos": "noun"
            },
            {
                "word": "marinate",
                "pos": "verb"
            },
            {
                "word": "marine",
                "pos": "adjective"
            },
            {
                "word": "marine",
                "pos": "noun"
            },
            {
                "word": "the Marine Corps",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the sea and the creatures and plants that live there",
                    "vi": "kết nối với biển và các sinh vật và thực vật sống ở đó"
                },
                "examples": [
                    {
                        "en": "marine life",
                        "vi": "cuộc sống biển"
                    },
                    {
                        "en": "a marine biologist (= a scientist who studies life in the sea)",
                        "vi": "một nhà sinh vật học biển (= một nhà khoa học nghiên cứu sự sống dưới biển)"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with ships or trade at sea",
                    "vi": "kết nối với tàu hoặc giao thương trên biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8b61bb05fea946128026791335804134",
        "word": "offshore",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɒfˈʃɔː(r)/",
            "us": "/ˌɔːfˈʃɔːr/"
        },
        "nearby": [
            {
                "word": "offset",
                "pos": "adjective"
            },
            {
                "word": "offshoot",
                "pos": "noun"
            },
            {
                "word": "offshore",
                "pos": "adjective"
            },
            {
                "word": "offshore",
                "pos": "verb"
            },
            {
                "word": "offshore",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "happening or existing in the sea, not far from the land",
                    "vi": "đang xảy ra hoặc tồn tại ở biển, không xa đất liền"
                },
                "examples": [
                    {
                        "en": "offshore drilling",
                        "vi": "khoan dầu ngoài khơi"
                    },
                    {
                        "en": "an offshore island",
                        "vi": "một hòn đảo ngoài khơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "blowing from the land towards the sea",
                    "vi": "thổi từ đất liền ra biển"
                },
                "examples": [
                    {
                        "en": "offshore breezes",
                        "vi": "gió ngoài khơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "kept or located in a foreign country that has more generous tax laws than the home country",
                    "vi": "được lưu giữ hoặc cư trú ở nước ngoài có luật thuế hào phóng hơn nước sở tại"
                },
                "examples": [
                    {
                        "en": "offshore investments",
                        "vi": "đầu tư ra nước ngoài"
                    }
                ]
            }
        ]
    },
    {
        "id": "1d362f49846c449cbb67f320f6239190",
        "word": "sandbank",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsændbæŋk/",
            "us": "/ˈsændbæŋk/"
        },
        "nearby": [
            {
                "word": "sandbag",
                "pos": "noun"
            },
            {
                "word": "sandbag",
                "pos": "verb"
            },
            {
                "word": "sandbank",
                "pos": "noun"
            },
            {
                "word": "sandbar",
                "pos": "noun"
            },
            {
                "word": "sandblast",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a raised area of sand in a river or the sea",
                    "vi": "một vùng cát nổi lên trên sông hoặc biển"
                },
                "examples": [
                    {
                        "en": "Our boat got caught on a sandbank as we returned home.",
                        "vi": "Thuyền của chúng tôi bị mắc vào một bãi cát khi chúng tôi trở về nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "60d6c2634cbc498bb7d7e810caeb0a3f",
        "word": "shoreline",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃɔːlaɪn/",
            "us": "/ˈʃɔːrlaɪn/"
        },
        "nearby": [
            {
                "word": "shore",
                "pos": "noun"
            },
            {
                "word": "shore",
                "pos": "verb"
            },
            {
                "word": "shoreline",
                "pos": "noun"
            },
            {
                "word": "shore up",
                "pos": "phrasal verb"
            },
            {
                "word": "shorn",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the edge of the sea, the ocean or a lake",
                    "vi": "mép biển, đại dương hoặc hồ"
                },
                "examples": [
                    {
                        "en": "a rocky shoreline",
                        "vi": "bờ biển đầy đá"
                    },
                    {
                        "en": "The road follows the shoreline for a few miles.",
                        "vi": "Con đường men theo bờ biển trong một vài dặm."
                    },
                    {
                        "en": "the Dublin shoreline",
                        "vi": "bờ biển Dublin"
                    }
                ]
            }
        ]
    },
    {
        "id": "8b600b48b0e14e9c925a5906d22a79db",
        "word": "surf",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/sɜːf/",
            "us": "/sɜːrf/"
        },
        "nearby": [
            {
                "word": "sureness",
                "pos": "noun"
            },
            {
                "word": "surety",
                "pos": "noun"
            },
            {
                "word": "surf",
                "pos": "noun"
            },
            {
                "word": "surf",
                "pos": "verb"
            },
            {
                "word": "surface",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "large waves in the sea or ocean, and the white foam that they produce as they fall on the beach, on rocks, etc.",
                    "vi": "sóng lớn trên biển hoặc đại dương và bọt trắng tạo ra khi chúng rơi trên bãi biển, trên đá, v.v."
                },
                "examples": [
                    {
                        "en": "the sound of surf breaking on the beach",
                        "vi": "tiếng sóng vỗ bờ biển"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of going surfing",
                    "vi": "một hành động lướt sóng"
                },
                "examples": [
                    {
                        "en": "He decided to go for a surf near Fremantle.",
                        "vi": "Anh quyết định đi lướt sóng gần Fremantle."
                    },
                    {
                        "en": "Sydney, surf capital of the world (= where the sport of surfing is very popular)",
                        "vi": "Sydney, thủ đô lướt sóng của thế giới (= nơi môn thể thao lướt sóng rất phổ biến)"
                    }
                ]
            }
        ]
    },
    {
        "id": "227bd58a1ea9421fad0097303688a68e",
        "word": "tidal",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtaɪdl/",
            "us": "/ˈtaɪdl/"
        },
        "nearby": [
            {
                "word": "tic-tac man",
                "pos": "noun"
            },
            {
                "word": "tic-tac-toe",
                "pos": "noun"
            },
            {
                "word": "tidal",
                "pos": "adjective"
            },
            {
                "word": "tidal wave",
                "pos": "noun"
            },
            {
                "word": "tidbit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with tides (= the regular rise and fall of the sea)",
                    "vi": "kết nối với thủy triều (= sự lên xuống thường xuyên của biển)"
                },
                "examples": [
                    {
                        "en": "tidal forces/energy",
                        "vi": "lực / năng lượng thủy triều"
                    },
                    {
                        "en": "a tidal river",
                        "vi": "một con sông thủy triều"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb30651442714b51ace477f7f2e66e96",
        "word": "tidal wave",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtaɪdl weɪv/",
            "us": "/ˈtaɪdl weɪv/"
        },
        "nearby": [
            {
                "word": "tic-tac-toe",
                "pos": "noun"
            },
            {
                "word": "tidal",
                "pos": "adjective"
            },
            {
                "word": "tidal wave",
                "pos": "noun"
            },
            {
                "word": "tidbit",
                "pos": "noun"
            },
            {
                "word": "tiddler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large ocean wave that is caused by a storm or an earthquake, and that destroys things when it reaches the land",
                    "vi": "một cơn sóng biển rất lớn gây ra bởi một cơn bão hoặc một trận động đất và phá hủy mọi thứ khi nó đến đất liền"
                },
                "examples": [
                    {
                        "en": "According to one account, the explosion caused a tidal wave 65 feet high.",
                        "vi": "Theo một tài khoản, vụ nổ gây ra sóng thủy triều cao 65 feet."
                    },
                    {
                        "en": "Several villages were destroyed by a huge tidal wave.",
                        "vi": "Một số ngôi làng đã bị phá hủy bởi một đợt thủy triều lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden increase in a particular feeling, activity or type of behaviour",
                    "vi": "sự gia tăng đột ngột trong một cảm giác, hoạt động hoặc loại hành vi cụ thể"
                },
                "examples": [
                    {
                        "en": "a tidal wave of crime",
                        "vi": "một làn sóng tội phạm"
                    }
                ]
            }
        ]
    },
    {
        "id": "cbd0a01f666c4791a90a3377f3c89245",
        "word": "tide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/taɪd/",
            "us": "/taɪd/"
        },
        "nearby": [
            {
                "word": "tiddly",
                "pos": "adjective"
            },
            {
                "word": "tiddlywinks",
                "pos": "noun"
            },
            {
                "word": "tide",
                "pos": "noun"
            },
            {
                "word": "tide",
                "pos": "verb"
            },
            {
                "word": "tideline",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a regular rise and fall in the level of the sea, caused by the pull of the moon and sun; the flow of water that happens as the sea rises and falls",
                    "vi": "mực nước biển dâng lên và hạ xuống đều đặn do sức kéo của mặt trăng và mặt trời; dòng nước xảy ra khi biển lên và xuống"
                },
                "examples": [
                    {
                        "en": "the ebb and flow of the tide",
                        "vi": "sự lên xuống của thủy triều"
                    },
                    {
                        "en": "The tide is in/out.",
                        "vi": "Thủy triều đang vào / ra."
                    },
                    {
                        "en": "Is the tide coming in or going out?",
                        "vi": "Thủy triều vào hay đi ra?"
                    },
                    {
                        "en": "The body was washed up on the beach by the tide.",
                        "vi": "Thi thể bị thủy triều đánh dạt vào bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "the direction in which the opinion of a large number of people seems to be moving",
                    "vi": "hướng mà ý kiến của một số lượng lớn mọi người dường như đang di chuyển"
                },
                "examples": [
                    {
                        "en": "It takes courage to speak out against the tide of opinion.",
                        "vi": "Cần có can đảm để lên tiếng chống lại làn sóng quan điểm."
                    },
                    {
                        "en": "There is a growing tide of opposition to the idea.",
                        "vi": "Ngày càng có nhiều làn sóng phản đối ý tưởng này."
                    },
                    {
                        "en": "a tide of optimism",
                        "vi": "một làn sóng lạc quan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount of something unpleasant that is increasing and is difficult to control",
                    "vi": "một lượng lớn thứ gì đó khó chịu đang gia tăng và khó kiểm soát"
                },
                "examples": [
                    {
                        "en": "There is anxiety about the rising tide of crime.",
                        "vi": "Có sự lo lắng về làn sóng tội phạm gia tăng."
                    },
                    {
                        "en": "Measures have been taken to stem the tide of pornography (= stop it from getting worse).",
                        "vi": "Các biện pháp đã được thực hiện để ngăn chặn làn sóng của nội dung khiêu dâm (= ngăn chặn nó trở nên tồi tệ hơn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling that you suddenly have that gets stronger and stronger",
                    "vi": "một cảm giác mà bạn đột nhiên có ngày càng mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "A tide of rage surged through her.",
                        "vi": "Một cơn thịnh nộ dâng trào trong cô."
                    },
                    {
                        "en": "They were carried along on a tide of euphoria.",
                        "vi": "Họ bị cuốn theo một làn sóng hưng phấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a time or season of the year",
                    "vi": "một thời điểm hoặc mùa trong năm"
                },
                "examples": [
                    {
                        "en": "Christmastide",
                        "vi": "Christmastide"
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree with/oppose the attitudes or opinions that most other people have",
                    "vi": "đồng ý / phản đối thái độ hoặc quan điểm mà hầu hết những người khác có"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that there is a change in somebody’s luck or in how successful they are being",
                    "vi": "được sử dụng để nói rằng có một sự thay đổi trong may mắn của ai đó hoặc mức độ thành công của họ"
                },
                "examples": [
                    {
                        "en": "The tide turned for the Canadian at the start of the second set.",
                        "vi": "Tình thế nghiêng về phía người Canada khi bắt đầu set thứ hai."
                    },
                    {
                        "en": "This contract is probably our last chance to turn the tide.",
                        "vi": "Hợp đồng này có lẽ là cơ hội cuối cùng để chúng tôi lật ngược tình thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "250d7ce97ff84a45abbf2e785af76a77",
        "word": "ashore",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈʃɔː(r)/",
            "us": "/əˈʃɔːr/"
        },
        "nearby": [
            {
                "word": "Ashley",
                "pos": ""
            },
            {
                "word": "the Ashmolean Museum",
                "pos": ""
            },
            {
                "word": "ashore",
                "pos": "adverb"
            },
            {
                "word": "ashram",
                "pos": "noun"
            },
            {
                "word": "Frederick Ashton",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards, onto or on land, having come from an area of water such as the sea or a river",
                    "vi": "hướng tới, lên hoặc trên đất liền, đến từ một vùng nước như biển hoặc sông"
                },
                "examples": [
                    {
                        "en": "to come/go ashore",
                        "vi": "đến / lên bờ"
                    },
                    {
                        "en": "a drowned body found washed ashore on the beach",
                        "vi": "một thi thể chết đuối được tìm thấy dạt vào bờ biển"
                    },
                    {
                        "en": "The cruise included several days ashore.",
                        "vi": "Hành trình bao gồm vài ngày trên bờ."
                    },
                    {
                        "en": "natural gas brought ashore by pipelines",
                        "vi": "khí tự nhiên được đưa vào bờ bằng đường ống"
                    }
                ]
            }
        ]
    },
    {
        "id": "b789a40439fe45d5a5fb76f224423dd1",
        "word": "breakwater",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbreɪkwɔːtə(r)/",
            "us": "/ˈbreɪkwɔːtər/"
        },
        "nearby": [
            {
                "word": "break up",
                "pos": "phrasal verb"
            },
            {
                "word": "break-up",
                "pos": "noun"
            },
            {
                "word": "breakwater",
                "pos": "noun"
            },
            {
                "word": "break with",
                "pos": "phrasal verb"
            },
            {
                "word": "bream",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall built out into the sea to protect the shore or harbour from the force of the waves",
                    "vi": "một bức tường xây ra biển để bảo vệ bờ hoặc bến cảng khỏi sức mạnh của sóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f3fcb03f08b14fdc9ad61650b3832565",
        "word": "calve",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kɑːv/",
            "us": "/kæv/"
        },
        "nearby": [
            {
                "word": "calumny",
                "pos": "noun"
            },
            {
                "word": "Calvados",
                "pos": "noun"
            },
            {
                "word": "calve",
                "pos": "verb"
            },
            {
                "word": "calves",
                "pos": "noun"
            },
            {
                "word": "Calvinism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give birth to a calf",
                    "vi": "sinh ra một con bê"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if an iceberg, a glacier, etc. calves a piece of ice, the ice breaks away from it",
                    "vi": "nếu một tảng băng trôi, sông băng, v.v. làm nổi một tảng băng, thì tảng băng đó sẽ vỡ ra khỏi nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to break away from an iceberg, a glacier, etc.",
                    "vi": "để thoát khỏi một tảng băng trôi, sông băng, v.v."
                },
                "examples": [
                    {
                        "en": "The iceberg probably calved from the ice shelf in early November.",
                        "vi": "Tảng băng trôi có lẽ đã lắng xuống từ thềm băng vào đầu tháng 11."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0bcb27cdc6047a18b030cded6c50e97",
        "word": "cape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/keɪp/",
            "us": "/keɪp/"
        },
        "nearby": [
            {
                "word": "cap and trade",
                "pos": "noun"
            },
            {
                "word": "caparisoned",
                "pos": "adjective"
            },
            {
                "word": "cape",
                "pos": "noun"
            },
            {
                "word": "Cape Canaveral",
                "pos": ""
            },
            {
                "word": "Cape Cod",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loose outer piece of clothing that has no sleeves (= parts covering the arms), fastens at the neck and hangs from the shoulders, like a cloak but shorter",
                    "vi": "một bộ quần áo rộng rãi bên ngoài không có tay áo (= phần che cánh tay), buộc ở cổ và treo từ vai, giống như một chiếc áo choàng nhưng ngắn hơn"
                },
                "examples": [
                    {
                        "en": "a bullfighter’s cape",
                        "vi": "áo choàng của một vận động viên đấu bò"
                    },
                    {
                        "en": "He strode out of the room, his black cape flowing behind him.",
                        "vi": "Anh ta sải bước ra khỏi phòng, chiếc áo choàng đen của anh ta chảy ra sau lưng."
                    },
                    {
                        "en": "Superman's cape",
                        "vi": "Áo choàng của siêu nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of high land that sticks out into the sea",
                    "vi": "một mảnh đất cao nhô ra biển"
                },
                "examples": [
                    {
                        "en": "Cape Horn",
                        "vi": "Cape Horn"
                    }
                ]
            }
        ]
    },
    {
        "id": "2917684671ac4fc489a2d42dd4fa6df1",
        "word": "creek",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kriːk/",
            "us": "/kriːk/"
        },
        "nearby": [
            {
                "word": "Cree",
                "pos": "noun"
            },
            {
                "word": "creed",
                "pos": "noun"
            },
            {
                "word": "creek",
                "pos": "noun"
            },
            {
                "word": "Creek",
                "pos": "noun"
            },
            {
                "word": "creel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow area of water where the sea flows into the land",
                    "vi": "một vùng nước hẹp nơi biển chảy vào đất liền"
                },
                "examples": [
                    {
                        "en": "They drove to the little creek where they kept their fishing boat.",
                        "vi": "Họ lái xe đến con lạch nhỏ, nơi họ giữ thuyền đánh cá của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small river or stream",
                    "vi": "một con sông hoặc dòng suối nhỏ"
                },
                "examples": [
                    {
                        "en": "Sandy Creek",
                        "vi": "Sandy Creek"
                    },
                    {
                        "en": "He stood on the steep bank above Ray’s Creek.",
                        "vi": "Anh ta đứng trên bờ dốc phía trên Ray's Creek."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult or bad situation",
                    "vi": "trong một tình huống khó khăn hoặc tồi tệ"
                },
                "examples": [
                    {
                        "en": "If they won't accept my credit card, I'll really be up the creek.",
                        "vi": "Nếu họ không chấp nhận thẻ tín dụng của tôi, tôi thực sự sẽ rất khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ed06f340a644c0ea505ad4982697d52",
        "word": "cross-current",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒs kʌrənt/",
            "us": "/ˈkrɔːs kɜːrənt/"
        },
        "nearby": [
            {
                "word": "cross-country skiing",
                "pos": "noun"
            },
            {
                "word": "cross-cultural",
                "pos": "adjective"
            },
            {
                "word": "cross-current",
                "pos": "noun"
            },
            {
                "word": "cross-curricular",
                "pos": "adjective"
            },
            {
                "word": "cross-disciplinary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a current of water in a river or in the sea that flows across the main current",
                    "vi": "dòng nước ở sông hoặc biển chảy qua dòng chính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a set of beliefs or ideas that are different from others, especially from those that most people hold",
                    "vi": "một tập hợp các niềm tin hoặc ý tưởng khác với những người khác, đặc biệt là những niềm tin hoặc ý tưởng mà hầu hết mọi người đều nắm giữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47643602ba3f484e9797d63ce9e1f307",
        "word": "dike",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/daɪk/",
            "us": "/daɪk/"
        },
        "nearby": [
            {
                "word": "dig up",
                "pos": "phrasal verb"
            },
            {
                "word": "dig yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "dike",
                "pos": "noun"
            },
            {
                "word": "diktat",
                "pos": "noun"
            },
            {
                "word": "dilapidated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thick wall that is built to stop water flooding onto a low area of land, especially from the sea",
                    "vi": "một bức tường dày dài được xây dựng để ngăn nước tràn vào một vùng đất thấp, đặc biệt là từ biển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a channel that carries water away from the land",
                    "vi": "một kênh dẫn nước từ đất liền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a word for a lesbian that is usually offensive",
                    "vi": "một từ để chỉ một người đồng tính nữ thường gây khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1d7899ae829843058687a15813cf6bb8",
        "word": "driftwood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɪftwʊd/",
            "us": "/ˈdrɪftwʊd/"
        },
        "nearby": [
            {
                "word": "drift net",
                "pos": "noun"
            },
            {
                "word": "drift off",
                "pos": "phrasal verb"
            },
            {
                "word": "driftwood",
                "pos": "noun"
            },
            {
                "word": "drill",
                "pos": "noun"
            },
            {
                "word": "drill",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wood that the sea carries up onto land, or that floats on the water",
                    "vi": "gỗ mà biển mang lên đất liền hoặc nổi trên mặt nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a6163a1913024e7f96a190cce6832db8",
        "word": "dyke",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/daɪk/",
            "us": "/daɪk/"
        },
        "nearby": [
            {
                "word": "D'ye Ken John Peel?",
                "pos": ""
            },
            {
                "word": "dying",
                "pos": "adjective"
            },
            {
                "word": "dyke",
                "pos": "noun"
            },
            {
                "word": "Dylan",
                "pos": ""
            },
            {
                "word": "dynamic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thick wall that is built to stop water flooding onto a low area of land, especially from the sea",
                    "vi": "một bức tường dày dài được xây dựng để ngăn nước tràn vào một vùng đất thấp, đặc biệt là từ biển"
                },
                "examples": [
                    {
                        "en": "During the 1997 floods the sea broke through the dyke.",
                        "vi": "Trong trận lụt năm 1997, biển đã phá vỡ đê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a channel that carries water away from the land",
                    "vi": "một kênh dẫn nước từ đất liền"
                },
                "examples": [
                    {
                        "en": "The first dykes were cut in the Middle Ages.",
                        "vi": "Những con đê đầu tiên bị cắt vào thời Trung cổ."
                    },
                    {
                        "en": "Wind pumps were built at intervals on the dykes.",
                        "vi": "Máy bơm gió được xây dựng cách nhau trên các con đê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word for a lesbian that is usually offensive",
                    "vi": "một từ để chỉ một người đồng tính nữ thường gây khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "16b9f3b1881b404a8d40b52a8ca1e15f",
        "word": "esplanade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌespləˈneɪd/",
            "us": "/ˈesplənɑːd/"
        },
        "nearby": [
            {
                "word": "Esperanto",
                "pos": "noun"
            },
            {
                "word": "espionage",
                "pos": "noun"
            },
            {
                "word": "esplanade",
                "pos": "noun"
            },
            {
                "word": "ESPN",
                "pos": ""
            },
            {
                "word": "e-sport",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a level area of open ground in a town for people to walk along, often by the sea or a river",
                    "vi": "một khu đất trống bằng phẳng trong thị trấn để mọi người có thể đi bộ dọc theo, thường là ven biển hoặc sông"
                },
                "examples": [
                    {
                        "en": "People were lying on the beach and strolling along the esplanade.",
                        "vi": "Mọi người nằm trên bãi biển và đi dạo dọc theo lối đi dạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "76686f5ba1f94e4ab26001090e7b2f19",
        "word": "fiord",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fjɔːd/",
            "us": "/fjɔːrd/"
        },
        "nearby": [
            {
                "word": "fintech",
                "pos": "noun"
            },
            {
                "word": "Fiona",
                "pos": ""
            },
            {
                "word": "fiord",
                "pos": "noun"
            },
            {
                "word": "fioritura",
                "pos": "noun"
            },
            {
                "word": "fir",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow area of sea between high cliffs, especially in Norway",
                    "vi": "một vùng biển dài hẹp giữa các vách đá cao, đặc biệt là ở Na Uy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8fd021b5e5414ca88a530b6be8c4db75",
        "word": "firth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɜːθ/",
            "us": "/fɜːrθ/"
        },
        "nearby": [
            {
                "word": "First World problem",
                "pos": "noun"
            },
            {
                "word": "the First World War",
                "pos": "noun"
            },
            {
                "word": "firth",
                "pos": "noun"
            },
            {
                "word": "fiscal",
                "pos": "adjective"
            },
            {
                "word": "fiscal cliff",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in Scottish place names) a narrow area of the sea that runs a long way into the land, or a part of a river where it flows into the sea",
                    "vi": "(đặc biệt là trong các địa danh của Scotland) một vùng biển hẹp chạy dài vào đất liền hoặc một phần của sông nơi nó đổ ra biển"
                },
                "examples": [
                    {
                        "en": "the Moray Firth",
                        "vi": "Moray Firth"
                    },
                    {
                        "en": "the Firth of Clyde",
                        "vi": "the Firth of Clyde"
                    }
                ]
            }
        ]
    },
    {
        "id": "a9451e767c7d4a24981e2bb213477b79",
        "word": "fjord",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fjɔːd/",
            "us": "/fjɔːrd/"
        },
        "nearby": [
            {
                "word": "fizzle out",
                "pos": "phrasal verb"
            },
            {
                "word": "fizzy",
                "pos": "adjective"
            },
            {
                "word": "fjord",
                "pos": "noun"
            },
            {
                "word": "FL",
                "pos": "abbreviation"
            },
            {
                "word": "flab",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow area of sea between high cliffs, especially in Norway",
                    "vi": "một vùng biển dài hẹp giữa các vách đá cao, đặc biệt là ở Na Uy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca28d697f17540bc80366753d04b7d37",
        "word": "flood tide",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflʌd taɪd/",
            "us": "/ˈflʌd taɪd/"
        },
        "nearby": [
            {
                "word": "flood out",
                "pos": "phrasal verb"
            },
            {
                "word": "floodplain",
                "pos": "noun"
            },
            {
                "word": "flood tide",
                "pos": "noun"
            },
            {
                "word": "floodwater",
                "pos": "noun"
            },
            {
                "word": "floor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very high rise in the level of the sea as it moves in towards the coast",
                    "vi": "mực nước biển dâng rất cao khi nó di chuyển về phía bờ biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "32fa1255e0104f59bd45311a645b008f",
        "word": "foreshore",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːʃɔː(r)/",
            "us": "/ˈfɔːrʃɔːr/"
        },
        "nearby": [
            {
                "word": "foreseeable",
                "pos": "adjective"
            },
            {
                "word": "foreshadow",
                "pos": "verb"
            },
            {
                "word": "foreshore",
                "pos": "noun"
            },
            {
                "word": "foreshorten",
                "pos": "verb"
            },
            {
                "word": "foresight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(on a beach or by a river) the part of the shore between the highest and lowest levels reached by the water",
                    "vi": "(trên bãi biển hoặc bên sông) phần bờ giữa mực nước cao nhất và thấp nhất mà mặt nước đạt được"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of the shore between the highest level reached by the water and the area of land that has buildings, plants, etc. on it",
                    "vi": "phần bờ giữa mực nước dâng cao nhất và phần đất có các tòa nhà, cây cối, v.v. trên đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b190c0c1ef845f1881af217a64c8916",
        "word": "groyne",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrɔɪn/",
            "us": "/ɡrɔɪn/"
        },
        "nearby": [
            {
                "word": "growth ring",
                "pos": "noun"
            },
            {
                "word": "grow up",
                "pos": "phrasal verb"
            },
            {
                "word": "groyne",
                "pos": "noun"
            },
            {
                "word": "grrr",
                "pos": "exclamation"
            },
            {
                "word": "grub",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a low wall built out into the sea to prevent it from washing away sand and stones from the beach",
                    "vi": "một bức tường thấp xây ra biển để ngăn nó cuốn trôi cát và đá khỏi bãi biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "85b70d16a80c4359985a5fc6331dc25c",
        "word": "headland",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhedlənd/",
            "us": "/ˈhedlənd/"
        },
        "nearby": [
            {
                "word": "Headingley",
                "pos": ""
            },
            {
                "word": "headlamp",
                "pos": "noun"
            },
            {
                "word": "headland",
                "pos": "noun"
            },
            {
                "word": "headless",
                "pos": "adjective"
            },
            {
                "word": "headlight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of high land that sticks out from the coast into the sea",
                    "vi": "một mảnh đất cao hẹp nhô ra biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "486279f3897344898659be8323aa8b97",
        "word": "the high seas",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌhaɪ ˈsiːz/",
            "us": "/ðə ˌhaɪ ˈsiːz/"
        },
        "nearby": [
            {
                "word": "high roller",
                "pos": "noun"
            },
            {
                "word": "high school",
                "pos": "noun"
            },
            {
                "word": "the high seas",
                "pos": "noun"
            },
            {
                "word": "high season",
                "pos": "noun"
            },
            {
                "word": "high-security",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the open ocean, especially areas that are not under the legal control of any one country",
                    "vi": "đại dương rộng mở, đặc biệt là các khu vực không nằm dưới sự kiểm soát hợp pháp của bất kỳ quốc gia nào"
                },
                "examples": [
                    {
                        "en": "international laws to regulate fishing on the high seas",
                        "vi": "luật pháp quốc tế để điều chỉnh việc đánh bắt cá trên biển cả"
                    },
                    {
                        "en": "a film about pirates seeking adventure on the high seas",
                        "vi": "một bộ phim về những tên cướp biển tìm kiếm cuộc phiêu lưu trên biển cả"
                    }
                ]
            }
        ]
    },
    {
        "id": "cb4073f72bdf4c84a46a32e6e11b618c",
        "word": "high water",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪ ˈwɔːtə(r)/",
            "us": "/ˌhaɪ ˈwɔːtər/"
        },
        "nearby": [
            {
                "word": "high-up",
                "pos": "noun"
            },
            {
                "word": "high-visibility",
                "pos": "adjective"
            },
            {
                "word": "high water",
                "pos": "noun"
            },
            {
                "word": "high-water mark",
                "pos": "noun"
            },
            {
                "word": "highway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the sea has risen to its highest level in a particular place",
                    "vi": "thời điểm khi nước biển dâng lên mức cao nhất ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "at high water Fishing is good at high water.",
                        "vi": "ở vùng nước cao Câu cá giỏi ở vùng nước cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "despite any difficulties",
                    "vi": "bất chấp khó khăn"
                },
                "examples": [
                    {
                        "en": "I was determined to go, come hell or high water.",
                        "vi": "Tôi đã quyết tâm đi, đến địa ngục hoặc nước cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb1917839fa34257b9dbe2c485e37452",
        "word": "ice floe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaɪs fləʊ/",
            "us": "/ˈaɪs fləʊ/"
        },
        "nearby": [
            {
                "word": "iced water",
                "pos": "noun"
            },
            {
                "word": "ice field",
                "pos": "noun"
            },
            {
                "word": "ice floe",
                "pos": "noun"
            },
            {
                "word": "ice hockey",
                "pos": "noun"
            },
            {
                "word": "icehouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large area of ice, floating in the sea",
                    "vi": "một vùng băng lớn trôi trên biển"
                },
                "examples": [
                    {
                        "en": "In spring the ice floes break up.",
                        "vi": "Vào mùa xuân, các tảng băng tan vỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "dacebfae0863453f8d25558226a319ab",
        "word": "ice shelf",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaɪs ʃelf/",
            "us": "/ˈaɪs ʃelf/"
        },
        "nearby": [
            {
                "word": "ice rink",
                "pos": "noun"
            },
            {
                "word": "ice sheet",
                "pos": "noun"
            },
            {
                "word": "ice shelf",
                "pos": "noun"
            },
            {
                "word": "ice show",
                "pos": "noun"
            },
            {
                "word": "ice skate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a layer of ice that is attached to land and covers a large area of sea",
                    "vi": "một lớp băng gắn liền với đất liền và bao phủ một vùng biển rộng lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31005095dc664e7eafa68e63fe81d748",
        "word": "inlet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪnlet/",
            "us": "/ˈɪnlet/"
        },
        "nearby": [
            {
                "word": "inlay",
                "pos": "verb"
            },
            {
                "word": "inlay",
                "pos": "noun"
            },
            {
                "word": "inlet",
                "pos": "noun"
            },
            {
                "word": "in-line",
                "pos": "adjective"
            },
            {
                "word": "in-line skate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow area of water that stretches into the land from the sea or a lake, or between islands",
                    "vi": "một vùng nước hẹp kéo dài vào đất liền từ biển hoặc hồ, hoặc giữa các đảo"
                },
                "examples": [
                    {
                        "en": "a narrow/sheltered/shallow inlet",
                        "vi": "một cửa vào hẹp / có mái che / nông"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening through which liquid, air or gas can enter a machine",
                    "vi": "một lỗ thông qua đó chất lỏng, không khí hoặc khí đốt có thể đi vào máy"
                },
                "examples": [
                    {
                        "en": "a fuel inlet",
                        "vi": "một đầu vào nhiên liệu"
                    }
                ]
            }
        ]
    },
    {
        "id": "29df71c85c6f40fa9726f8a4f1e6ad91",
        "word": "inshore",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnˈʃɔː(r)/",
            "us": "/ˌɪnˈʃɔːr/"
        },
        "nearby": [
            {
                "word": "inset day",
                "pos": "noun"
            },
            {
                "word": "inshallah",
                "pos": "exclamation"
            },
            {
                "word": "inshore",
                "pos": "adverb"
            },
            {
                "word": "inshore",
                "pos": "adjective"
            },
            {
                "word": "inside",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards or close to the land",
                    "vi": "về phía hoặc gần đất"
                },
                "examples": [
                    {
                        "en": "The boat came inshore.",
                        "vi": "Con thuyền vào bờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cf33d687562b4aae8b108acbd431e00f",
        "word": "inshore",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪnʃɔː(r)/",
            "us": "/ˈɪnʃɔːr/"
        },
        "nearby": [
            {
                "word": "inshallah",
                "pos": "exclamation"
            },
            {
                "word": "inshore",
                "pos": "adverb"
            },
            {
                "word": "inshore",
                "pos": "adjective"
            },
            {
                "word": "inside",
                "pos": "preposition"
            },
            {
                "word": "inside",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in the sea but close to the shore",
                    "vi": "ở biển nhưng gần bờ"
                },
                "examples": [
                    {
                        "en": "an inshore breeze",
                        "vi": "một làn gió nhẹ"
                    },
                    {
                        "en": "an inshore lifeboat (= that stays close to the land)",
                        "vi": "một thuyền cứu sinh ven bờ (= ở gần đất liền)"
                    }
                ]
            }
        ]
    },
    {
        "id": "b184720a4d014597bd276a122b2d20dc",
        "word": "jetty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒeti/",
            "us": "/ˈdʒeti/"
        },
        "nearby": [
            {
                "word": "jet stream",
                "pos": "noun"
            },
            {
                "word": "jettison",
                "pos": "verb"
            },
            {
                "word": "jetty",
                "pos": "noun"
            },
            {
                "word": "Jetway",
                "pos": "noun"
            },
            {
                "word": "Jew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall or platform built out into the sea, a river, etc., where boats can be tied and where people can get on and off boats",
                    "vi": "một bức tường hoặc nền được xây dựng ra biển, sông, v.v., nơi có thể buộc thuyền và nơi mọi người có thể lên và xuống thuyền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dac1e19927fc4779b8f4e9da0bf6039d",
        "word": "lagoon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ləˈɡuːn/",
            "us": "/ləˈɡuːn/"
        },
        "nearby": [
            {
                "word": "laggard",
                "pos": "noun"
            },
            {
                "word": "laggy",
                "pos": "adjective"
            },
            {
                "word": "lagoon",
                "pos": "noun"
            },
            {
                "word": "Fiorello La Guardia",
                "pos": ""
            },
            {
                "word": "La Guardia Airport",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lake of salt water that is separated from the sea by a reef or an area of rock or sand",
                    "vi": "một hồ nước mặn được ngăn cách với biển bởi một rạn san hô hoặc một khu vực đá hoặc cát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small area of fresh water near a lake or river",
                    "vi": "một vùng nước ngọt nhỏ gần hồ hoặc sông"
                },
                "examples": [
                    {
                        "en": "We loved to go swimming in the lagoon.",
                        "vi": "Chúng tôi thích đi bơi trong đầm phá."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial area built to hold waste water before it is treated at a sewage works",
                    "vi": "một khu vực nhân tạo được xây dựng để chứa nước thải trước khi nó được xử lý tại một công trình nước thải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e81f097ab34428f89b7bf06c6868abe",
        "word": "low water",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌləʊ ˈwɔːtə(r)/",
            "us": "/ˌləʊ ˈwɔːtər/"
        },
        "nearby": [
            {
                "word": "low-tech",
                "pos": "adjective"
            },
            {
                "word": "low tide",
                "pos": "noun"
            },
            {
                "word": "low water",
                "pos": "noun"
            },
            {
                "word": "low-water mark",
                "pos": "noun"
            },
            {
                "word": "lox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the sea is at its lowest level in a particular place",
                    "vi": "thời điểm khi biển ở mức thấp nhất ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "At low water, you can see the remains of the shipwreck.",
                        "vi": "Khi mực nước thấp, bạn có thể nhìn thấy phần còn lại của con tàu đắm."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a6067fa95834774aa1ce5d322670322",
        "word": "marina",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈriːnə/",
            "us": "/məˈriːnə/"
        },
        "nearby": [
            {
                "word": "Marilyn",
                "pos": ""
            },
            {
                "word": "marimba",
                "pos": "noun"
            },
            {
                "word": "marina",
                "pos": "noun"
            },
            {
                "word": "marinade",
                "pos": "noun"
            },
            {
                "word": "marinade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a specially designed harbour for small boats and yachts",
                    "vi": "một bến cảng được thiết kế đặc biệt cho những chiếc thuyền nhỏ và du thuyền"
                },
                "examples": [
                    {
                        "en": "a new £250 million marina and leisure development",
                        "vi": "một bến du thuyền mới trị giá 250 triệu bảng và phát triển giải trí"
                    }
                ]
            }
        ]
    },
    {
        "id": "56ecd27d82224d59b2665ad3aa128230",
        "word": "maritime",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmærɪtaɪm/",
            "us": "/ˈmærɪtaɪm/"
        },
        "nearby": [
            {
                "word": "marital",
                "pos": "adjective"
            },
            {
                "word": "marital status",
                "pos": "noun"
            },
            {
                "word": "maritime",
                "pos": "adjective"
            },
            {
                "word": "the Maritimes",
                "pos": "noun"
            },
            {
                "word": "marjoram",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the sea or ships",
                    "vi": "kết nối với biển hoặc tàu"
                },
                "examples": [
                    {
                        "en": "a maritime museum",
                        "vi": "một bảo tàng hàng hải"
                    },
                    {
                        "en": "the country’s maritime history",
                        "vi": "lịch sử hàng hải của đất nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "near the sea",
                    "vi": "gần biển"
                },
                "examples": [
                    {
                        "en": "maritime Antarctica",
                        "vi": "hàng hải Nam Cực"
                    }
                ]
            }
        ]
    },
    {
        "id": "55c1810f24544603bbc230b7b29ec8bd",
        "word": "narrows",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnærəʊz/",
            "us": "/ˈnærəʊz/"
        },
        "nearby": [
            {
                "word": "narrow-mindedness",
                "pos": "noun"
            },
            {
                "word": "narrowness",
                "pos": "noun"
            },
            {
                "word": "narrows",
                "pos": "noun"
            },
            {
                "word": "narthex",
                "pos": "noun"
            },
            {
                "word": "narwhal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow channel that connects two larger areas of water",
                    "vi": "một kênh hẹp nối hai vùng nước lớn hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "86e3b37f12b74a70aec4f0a298cd9e93",
        "word": "promenade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprɒməˈnɑːd/",
            "us": "/ˌprɑːməˈneɪd/"
        },
        "nearby": [
            {
                "word": "prolonged",
                "pos": "adjective"
            },
            {
                "word": "prom",
                "pos": "noun"
            },
            {
                "word": "promenade",
                "pos": "noun"
            },
            {
                "word": "promenade",
                "pos": "verb"
            },
            {
                "word": "promenade concert",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public place for walking, usually a wide path next to the sea",
                    "vi": "một nơi công cộng để đi bộ, thường là một con đường rộng cạnh biển"
                },
                "examples": [
                    {
                        "en": "the promenade at Blackpool",
                        "vi": "đi dạo ở Blackpool"
                    },
                    {
                        "en": "They walked along the promenade.",
                        "vi": "Họ cùng đi dạo trên đường dạo."
                    },
                    {
                        "en": "a hotel on the promenade",
                        "vi": "một khách sạn trên đường đi dạo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a walk that you take for pleasure or exercise, especially by the sea, in a public park, etc.",
                    "vi": "một cuộc đi bộ mà bạn thực hiện để giải trí hoặc tập thể dục, đặc biệt là bên bờ biển, trong công viên công cộng, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a86d2918a4f341378ed354b123716e0e",
        "word": "promontory",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprɒməntri/",
            "us": "/ˈprɑːməntɔːri/"
        },
        "nearby": [
            {
                "word": "promo",
                "pos": "adjective"
            },
            {
                "word": "promo",
                "pos": "noun"
            },
            {
                "word": "promontory",
                "pos": "noun"
            },
            {
                "word": "promote",
                "pos": "verb"
            },
            {
                "word": "promoter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow area of high land that goes out into the sea",
                    "vi": "một vùng đất cao hẹp dài đổ ra biển"
                },
                "examples": [
                    {
                        "en": "a rocky promontory overlooking the bay",
                        "vi": "một mỏm đá nhìn ra vịnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "f8bb3dc7c26442d891988b89a754521f",
        "word": "rip tide",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrɪp taɪd/",
            "us": "/ˈrɪp taɪd/"
        },
        "nearby": [
            {
                "word": "rip-roaring",
                "pos": "adjective"
            },
            {
                "word": "rip through",
                "pos": "phrasal verb"
            },
            {
                "word": "rip tide",
                "pos": "noun"
            },
            {
                "word": "rip up",
                "pos": "phrasal verb"
            },
            {
                "word": "Rip Van Winkle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of fast rough water in the sea or a river, where two or more currents meet",
                    "vi": "một khu vực nước mạnh ở biển hoặc sông, nơi hai hoặc nhiều dòng chảy gặp nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "21c29251b1f147c8a735ee2e10fcec3b",
        "word": "riviera",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrɪviˈeərə/",
            "us": "/ˌrɪviˈerə/"
        },
        "nearby": [
            {
                "word": "rivet",
                "pos": "verb"
            },
            {
                "word": "riveting",
                "pos": "adjective"
            },
            {
                "word": "riviera",
                "pos": "noun"
            },
            {
                "word": "rivulet",
                "pos": "noun"
            },
            {
                "word": "Brian Rix",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area by the sea that is warm and popular for holidays, especially the Mediterranean coast of France",
                    "vi": "một khu vực gần biển ấm áp và phổ biến cho các kỳ nghỉ, đặc biệt là bờ biển Địa Trung Hải của Pháp"
                },
                "examples": [
                    {
                        "en": "the French Riviera",
                        "vi": "Riviera của Pháp"
                    }
                ]
            }
        ]
    },
    {
        "id": "4628cbfc119a4844b1247c6d81f8cc01",
        "word": "salt marsh",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɔːlt mɑːʃ/",
            "us": "/ˈsɔːlt mɑːrʃ/"
        },
        "nearby": [
            {
                "word": "saltire",
                "pos": "noun"
            },
            {
                "word": "Salt Lake City",
                "pos": ""
            },
            {
                "word": "salt marsh",
                "pos": "noun"
            },
            {
                "word": "salt pan",
                "pos": "noun"
            },
            {
                "word": "saltpetre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of open land near a coast that is regularly flooded with water from the sea",
                    "vi": "một khu vực đất trống gần bờ biển thường xuyên bị ngập nước từ biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c53d4080d91945f695d694adc0eddb0e",
        "word": "sandbar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsændbɑː(r)/",
            "us": "/ˈsændbɑːr/"
        },
        "nearby": [
            {
                "word": "sandbag",
                "pos": "verb"
            },
            {
                "word": "sandbank",
                "pos": "noun"
            },
            {
                "word": "sandbar",
                "pos": "noun"
            },
            {
                "word": "sandblast",
                "pos": "verb"
            },
            {
                "word": "sandbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long mass of sand at the point where a river meets the sea that is formed by the movement of the water",
                    "vi": "một khối cát dài tại điểm sông gặp biển được hình thành do chuyển động của nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0b2fb1cd73904677aad48af45ee5cc5c",
        "word": "seaward",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːwəd/",
            "us": "/ˈsiːwərd/"
        },
        "nearby": [
            {
                "word": "sea urchin",
                "pos": "noun"
            },
            {
                "word": "sea wall",
                "pos": "noun"
            },
            {
                "word": "seaward",
                "pos": "adjective"
            },
            {
                "word": "seaward",
                "pos": "adverb"
            },
            {
                "word": "seawater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards the sea; in the direction of the sea",
                    "vi": "hướng ra biển; theo hướng biển"
                },
                "examples": [
                    {
                        "en": "the seaward side of the coastal road",
                        "vi": "phía biển của con đường ven biển"
                    }
                ]
            }
        ]
    },
    {
        "id": "aedd50d23c8d49abaad7d938b3f80775",
        "word": "seaward",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːwədz/",
            "us": "/ˈsiːwərdz/"
        },
        "nearby": [
            {
                "word": "sea wall",
                "pos": "noun"
            },
            {
                "word": "seaward",
                "pos": "adjective"
            },
            {
                "word": "seaward",
                "pos": "adverb"
            },
            {
                "word": "seawater",
                "pos": "noun"
            },
            {
                "word": "seaway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards the sea; in the direction of the sea",
                    "vi": "hướng ra biển; theo hướng biển"
                },
                "examples": [
                    {
                        "en": "Her gaze was fixed seawards.",
                        "vi": "Ánh mắt cô ấy chăm chú nhìn ra biển."
                    }
                ]
            }
        ]
    },
    {
        "id": "11e10004362d4f2ea8a564a8ebe4a7df",
        "word": "the shallows",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈʃæləʊz/",
            "us": "/ðə ˈʃæləʊz/"
        },
        "nearby": [
            {
                "word": "shallowly",
                "pos": "adverb"
            },
            {
                "word": "shallowness",
                "pos": "noun"
            },
            {
                "word": "the shallows",
                "pos": "noun"
            },
            {
                "word": "shalom",
                "pos": "exclamation"
            },
            {
                "word": "shalt",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shallow place in a river or the sea",
                    "vi": "một nơi cạn ở sông hoặc biển"
                },
                "examples": [
                    {
                        "en": "Children were playing in the shallows.",
                        "vi": "Trẻ em đang chơi ở các bãi cạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b9a17dd82f04d93b4ab988bb82f5c7b",
        "word": "shingle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɪŋɡl/",
            "us": "/ˈʃɪŋɡl/"
        },
        "nearby": [
            {
                "word": "shiner",
                "pos": "noun"
            },
            {
                "word": "shine through",
                "pos": "phrasal verb"
            },
            {
                "word": "shingle",
                "pos": "noun"
            },
            {
                "word": "shingled",
                "pos": "adjective"
            },
            {
                "word": "shingles",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of small smooth stones on a beach or at the side of a river",
                    "vi": "một khối đá mịn nhỏ trên bãi biển hoặc bên sông"
                },
                "examples": [
                    {
                        "en": "a shingle beach",
                        "vi": "một bãi biển lợp ngói"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small flat piece of wood that is used to cover a wall or roof of a building",
                    "vi": "một mảnh gỗ phẳng nhỏ được sử dụng để che một bức tường hoặc mái của một tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a board with a sign on it, in front of a doctor’s or lawyer’s office",
                    "vi": "một tấm bảng có ký hiệu, ở phía trước của văn phòng bác sĩ hoặc luật sư"
                },
                "examples": [
                    {
                        "en": "He hung out his own shingle (= started a business as a doctor or lawyer).",
                        "vi": "Anh ấy đã tự bỏ tiền túi ra khỏi bệnh (= bắt đầu kinh doanh với tư cách là một bác sĩ hoặc luật sư)."
                    }
                ]
            }
        ]
    },
    {
        "id": "c4ef47f68f9b4dab83198abbf6765efd",
        "word": "strand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/strænd/",
            "us": "/strænd/"
        },
        "nearby": [
            {
                "word": "straitjacket",
                "pos": "noun"
            },
            {
                "word": "strait-laced",
                "pos": "adjective"
            },
            {
                "word": "strand",
                "pos": "noun"
            },
            {
                "word": "strand",
                "pos": "verb"
            },
            {
                "word": "the Strand",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a single thin piece of thread, wire, hair, etc.",
                    "vi": "một đoạn chỉ mỏng, dây, tóc, v.v."
                },
                "examples": [
                    {
                        "en": "He pulled at a loose strand of wool in his sweater.",
                        "vi": "Anh kéo một sợi len lỏng lẻo trong áo len của mình."
                    },
                    {
                        "en": "a few strands of dark hair",
                        "vi": "một vài sợi tóc sẫm màu"
                    },
                    {
                        "en": "She wore a single strand of pearls around her neck.",
                        "vi": "Cô đeo một sợi ngọc trai quanh cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the different parts of an idea, a plan, a story, etc.",
                    "vi": "một trong những phần khác nhau của ý tưởng, kế hoạch, câu chuyện, v.v."
                },
                "examples": [
                    {
                        "en": "We heard every strand of political opinion.",
                        "vi": "Chúng tôi đã nghe mọi luồng ý kiến chính trị."
                    },
                    {
                        "en": "The author draws the different strands of the plot together in the final chapter.",
                        "vi": "Tác giả vẽ các sợi khác nhau của cốt truyện với nhau trong chương cuối cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the land along the edge of the sea or ocean, or of a lake or river",
                    "vi": "đất dọc theo mép biển hoặc đại dương, hoặc của hồ hoặc sông"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9c1a06e62fef48f69c16d9c9bfe66831",
        "word": "swell",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/swel/",
            "us": "/swel/"
        },
        "nearby": [
            {
                "word": "sweet William",
                "pos": "noun"
            },
            {
                "word": "swell",
                "pos": "verb"
            },
            {
                "word": "swell",
                "pos": "noun"
            },
            {
                "word": "swell",
                "pos": "adjective"
            },
            {
                "word": "swelling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the movement of the sea when it rises and falls without the waves breaking",
                    "vi": "chuyển động của biển khi nó nổi lên và hạ xuống mà không có sóng vỡ"
                },
                "examples": [
                    {
                        "en": "The boat was caught in a heavy (= strong) swell.",
                        "vi": "Con thuyền bị cuốn vào một cơn gió lớn (= mạnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the curved shape of something, especially a part of the body",
                    "vi": "hình dạng cong của một cái gì đó, đặc biệt là một phần của cơ thể"
                },
                "examples": [
                    {
                        "en": "the firm swell of her breasts",
                        "vi": "bộ ngực nở nang săn chắc của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which something increases in size, number, strength, etc.",
                    "vi": "tình huống trong đó thứ gì đó tăng về kích thước, số lượng, sức mạnh, v.v."
                },
                "examples": [
                    {
                        "en": "a growing swell of support",
                        "vi": "sự hỗ trợ ngày càng tăng"
                    },
                    {
                        "en": "a swell of pride",
                        "vi": "một niềm tự hào"
                    }
                ]
            },
            {
                "define": {
                    "en": "a slow steady increase in the volume of something",
                    "vi": "sự gia tăng chậm đều đặn trong âm lượng của một thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an important or fashionable person",
                    "vi": "một người quan trọng hoặc thời trang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bbee0a128d4d4f85983fe7d38554bbfa",
        "word": "tideline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪdlaɪn/",
            "us": "/ˈtaɪdlaɪn/"
        },
        "nearby": [
            {
                "word": "tide",
                "pos": "noun"
            },
            {
                "word": "tide",
                "pos": "verb"
            },
            {
                "word": "tideline",
                "pos": "noun"
            },
            {
                "word": "tidemark",
                "pos": "noun"
            },
            {
                "word": "tide over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line left or reached by the sea when the tide is at its highest point",
                    "vi": "đường bên trái hoặc đường tới biển khi thủy triều ở điểm cao nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c38ef34ea02a46a3a3a46b77092eb750",
        "word": "tidemark",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪdmɑːk/",
            "us": "/ˈtaɪdmɑːrk/"
        },
        "nearby": [
            {
                "word": "tide",
                "pos": "verb"
            },
            {
                "word": "tideline",
                "pos": "noun"
            },
            {
                "word": "tidemark",
                "pos": "noun"
            },
            {
                "word": "tide over",
                "pos": "phrasal verb"
            },
            {
                "word": "tide pool",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line that is made by the sea on a beach at the highest point that the sea reaches",
                    "vi": "một đường được tạo ra bởi biển trên một bãi biển ở điểm cao nhất mà biển chạm tới"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a line that is left around the inside of a bath by dirty water",
                    "vi": "một dòng được để lại xung quanh bên trong bồn tắm bởi nước bẩn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "46fd0e92c2c84c2d8aaa8270becc18ef",
        "word": "wharf",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɔːf/",
            "us": "/wɔːrf/"
        },
        "nearby": [
            {
                "word": "whammy",
                "pos": "noun"
            },
            {
                "word": "whanau",
                "pos": "noun"
            },
            {
                "word": "wharf",
                "pos": "noun"
            },
            {
                "word": "Edith Wharton",
                "pos": ""
            },
            {
                "word": "whassup",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat structure built next to the sea or a river where boats can be tied up and goods unloaded",
                    "vi": "một cấu trúc bằng phẳng được xây dựng bên cạnh biển hoặc sông, nơi tàu thuyền có thể được buộc lên và hàng hóa được bốc dỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34dbdef0436a4c17b206351fed5fc22c",
        "word": "whirlpool",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɜːlpuːl/",
            "us": "/ˈwɜːrlpuːl/"
        },
        "nearby": [
            {
                "word": "whirl",
                "pos": "noun"
            },
            {
                "word": "whirligig",
                "pos": "noun"
            },
            {
                "word": "whirlpool",
                "pos": "noun"
            },
            {
                "word": "whirlwind",
                "pos": "noun"
            },
            {
                "word": "whirlwind",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place in a river or the sea where currents of water turn round and round very fast",
                    "vi": "một nơi ở sông hoặc biển, nơi dòng nước quay tròn rất nhanh"
                },
                "examples": [
                    {
                        "en": "(figurative) She felt she was being dragged into a whirlpool of emotion.",
                        "vi": "(nghĩa bóng) Cô cảm thấy mình đang bị cuốn vào vòng xoáy của cảm xúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special bath or swimming pool for relaxing in, in which the water moves in circles",
                    "vi": "một bồn tắm hoặc hồ bơi đặc biệt để thư giãn, trong đó nước chuyển động theo hình tròn"
                },
                "examples": []
            }
        ]
    }
]