[
    {
        "id": "e4d50af4d43c4b06bba8e8418e884839",
        "word": "tourist",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtʊərɪst/",
            "us": "/ˈtʊrɪst/"
        },
        "nearby": [
            {
                "word": "Tourette's syndrome",
                "pos": "noun"
            },
            {
                "word": "tourism",
                "pos": "noun"
            },
            {
                "word": "tourist",
                "pos": "noun"
            },
            {
                "word": "tourist class",
                "pos": "noun"
            },
            {
                "word": "tourist office",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is travelling or visiting a place for pleasure",
                    "vi": "một người đang đi du lịch hoặc đến thăm một nơi để giải trí"
                },
                "examples": [
                    {
                        "en": "busloads of foreign tourists",
                        "vi": "lượng khách du lịch nước ngoài"
                    },
                    {
                        "en": "a popular tourist attraction/destination/resort",
                        "vi": "một điểm du lịch / điểm đến / khu nghỉ mát nổi tiếng"
                    },
                    {
                        "en": "the tourist industry/sector",
                        "vi": "ngành / lĩnh vực du lịch"
                    },
                    {
                        "en": "The tourist season here peaks in spring.",
                        "vi": "Mùa du lịch ở đây cao điểm vào mùa xuân."
                    },
                    {
                        "en": "The island attracts tourists from all over the world.",
                        "vi": "Hòn đảo thu hút khách du lịch từ khắp nơi trên thế giới."
                    },
                    {
                        "en": "The tourist information centre is right next to the mosque.",
                        "vi": "Trung tâm thông tin du lịch nằm ngay cạnh nhà thờ Hồi giáo."
                    },
                    {
                        "en": "The changing of the guard is popular with the tourists.",
                        "vi": "Việc thay đổi bảo vệ được du khách ưa chuộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of a sports team that is playing a series of official games in a foreign country",
                    "vi": "một thành viên của một đội thể thao đang chơi một loạt các trò chơi chính thức ở nước ngoài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a18128f8a2c446e39b94de013ad69e28",
        "word": "book",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/bʊk/",
            "us": "/bʊk/"
        },
        "nearby": [
            {
                "word": "boohoo",
                "pos": "exclamation"
            },
            {
                "word": "book",
                "pos": "noun"
            },
            {
                "word": "book",
                "pos": "verb"
            },
            {
                "word": "bookable",
                "pos": "adjective"
            },
            {
                "word": "bookbinder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to arrange to have or use something on a particular date in the future; to buy a ticket in advance",
                    "vi": "sắp xếp để có hoặc sử dụng một cái gì đó vào một ngày cụ thể trong tương lai; mua vé trước"
                },
                "examples": [
                    {
                        "en": "Book early to avoid disappointment.",
                        "vi": "Đăng kí sớm để tránh sự thất vọng."
                    },
                    {
                        "en": "book something She booked a flight to Chicago.",
                        "vi": "đặt một cái gì đó Cô ấy đã đặt một chuyến bay đến Chicago."
                    },
                    {
                        "en": "He booked tickets for his trip to New York.",
                        "vi": "Anh ấy đã đặt vé cho chuyến đi của mình đến New York."
                    },
                    {
                        "en": "Most customers now book their holidays online.",
                        "vi": "Hầu hết khách hàng bây giờ đặt ngày nghỉ của họ trực tuyến."
                    },
                    {
                        "en": "The performance is booked up (= there are no more tickets available).",
                        "vi": "Buổi biểu diễn đã được đặt trước (= không còn vé nữa)."
                    },
                    {
                        "en": "I'm sorry—we're fully booked.",
                        "vi": "Tôi xin lỗi — chúng tôi đã đặt hết chỗ."
                    },
                    {
                        "en": "(British English) I'd like to book a table for two for 8 o'clock tonight.",
                        "vi": "(Anh Anh) Tôi muốn đặt bàn cho hai người lúc 8 giờ tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange for somebody to have a seat on a plane, etc.",
                    "vi": "sắp xếp cho ai đó có một chỗ ngồi trên máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "book somebody + adv./prep. I've booked you on the 10 o'clock flight.",
                        "vi": "đặt chỗ cho ai đó + adv./prep. Tôi đã đặt chỗ cho bạn trên chuyến bay 10 giờ."
                    },
                    {
                        "en": "book somebody something + adv./prep. I've booked you a room at the Park Hotel.",
                        "vi": "book somebody something + adv./prep. Tôi đã đặt cho bạn một phòng ở khách sạn Park."
                    },
                    {
                        "en": "book somebody something Have you told the office to book you a flight?",
                        "vi": "đặt cho ai đó một cái gì đó Bạn đã nói với văn phòng để đặt cho bạn một chuyến bay chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange for a singer, etc. to perform on a particular date",
                    "vi": "để sắp xếp cho một ca sĩ, v.v. biểu diễn vào một ngày cụ thể"
                },
                "examples": [
                    {
                        "en": "We've booked a band for the wedding reception.",
                        "vi": "Chúng tôi đã đặt một ban nhạc cho tiệc cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write down somebody’s name and address because they have committed a crime or an offence",
                    "vi": "viết ra tên và địa chỉ của ai đó vì họ đã phạm tội hoặc phạm tội"
                },
                "examples": [
                    {
                        "en": "He was booked for possession of cocaine.",
                        "vi": "Anh ta đã bị buộc tội tàng trữ cocaine."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write down in an official book the name of a player who has broken the rules of the game",
                    "vi": "viết ra trong một cuốn sách chính thức tên của một người chơi đã vi phạm các quy tắc của trò chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "90a373444912468c9d9b4283fdb4f200",
        "word": "guide",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɡaɪd/",
            "us": "/ɡaɪd/"
        },
        "nearby": [
            {
                "word": "guidance",
                "pos": "noun"
            },
            {
                "word": "guidance counselor",
                "pos": "noun"
            },
            {
                "word": "guide",
                "pos": "noun"
            },
            {
                "word": "guide",
                "pos": "verb"
            },
            {
                "word": "guidebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who shows other people the way to a place, especially somebody employed to show tourists around interesting places",
                    "vi": "một người chỉ cho những người khác đường đến một địa điểm, đặc biệt là một người nào đó được thuê để chỉ cho khách du lịch về những địa điểm thú vị"
                },
                "examples": [
                    {
                        "en": "Our tour guide showed us around the old town.",
                        "vi": "Hướng dẫn viên của chúng tôi đã chỉ cho chúng tôi xung quanh khu phố cổ."
                    },
                    {
                        "en": "We hired a local guide to get us across the mountains.",
                        "vi": "Chúng tôi đã thuê một hướng dẫn viên địa phương để đưa chúng tôi vượt qua những ngọn núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who advises you on how to live and behave",
                    "vi": "một người tư vấn cho bạn về cách sống và cư xử"
                },
                "examples": [
                    {
                        "en": "A guru is the spiritual guide of his students.",
                        "vi": "Một guru là người hướng dẫn tinh thần cho các học trò của mình."
                    },
                    {
                        "en": "His elder sister had been his guide, counsellor and friend.",
                        "vi": "Chị gái anh là người hướng dẫn, cố vấn và là bạn của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book, magazine, app, etc. that gives you information, help or instructions about something",
                    "vi": "sách, tạp chí, ứng dụng, v.v. cung cấp cho bạn thông tin, trợ giúp hoặc hướng dẫn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Let's have a look at the TV guide and see what's on.",
                        "vi": "Hãy xem hướng dẫn TV và xem những gì đang diễn ra."
                    },
                    {
                        "en": "guide to something a Guide to Family Health",
                        "vi": "hướng dẫn về điều gì đó Hướng dẫn về sức khỏe gia đình"
                    },
                    {
                        "en": "guide to doing something a step-by-step guide to creating your own website",
                        "vi": "hướng dẫn làm điều gì đó hướng dẫn từng bước để tạo trang web của riêng bạn"
                    },
                    {
                        "en": "guide for somebody/something study guides for mathematics and physics",
                        "vi": "hướng dẫn cho ai đó / cái gì đó hướng dẫn nghiên cứu cho toán học và vật lý"
                    },
                    {
                        "en": "an essential guide for every new parent",
                        "vi": "một hướng dẫn cần thiết cho mọi phụ huynh mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that gives information about a place for travellers or tourists",
                    "vi": "một cuốn sách cung cấp thông tin về một địa điểm cho khách du lịch hoặc khách du lịch"
                },
                "examples": [
                    {
                        "en": "He has written a number of travel guides.",
                        "vi": "Ông đã viết một số hướng dẫn du lịch."
                    },
                    {
                        "en": "I consulted my guide as I walked around the cathedral.",
                        "vi": "Tôi tham khảo ý kiến của người hướng dẫn khi đi bộ quanh nhà thờ lớn."
                    },
                    {
                        "en": "guide to something a guide to Italy",
                        "vi": "hướng dẫn một cái gì đó một hướng dẫn đến Ý"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that gives you enough information to be able to make a decision about something or form an opinion",
                    "vi": "thứ gì đó cung cấp cho bạn đủ thông tin để có thể đưa ra quyết định về điều gì đó hoặc hình thành ý kiến"
                },
                "examples": [
                    {
                        "en": "As a rough guide, allow half a cup of rice per person.",
                        "vi": "Như một hướng dẫn sơ bộ, cho phép nửa chén cơm mỗi người."
                    },
                    {
                        "en": "I let my feelings be my guide.",
                        "vi": "Tôi để cảm xúc của mình làm kim chỉ nam cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of an organization (called the Guides or the Girl Scouts) that is similar to the Scouts and that trains girls in practical skills and does a lot of activities with them, for example camping",
                    "vi": "thành viên của một tổ chức (được gọi là Hướng dẫn viên hoặc Nữ Hướng đạo) tương tự như Hướng đạo sinh và đào tạo các cô gái các kỹ năng thực tế và thực hiện nhiều hoạt động với họ, ví dụ như cắm trại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2cb60cb43b24a60a09841f3755d7dfe",
        "word": "star",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/stɑː(r)/",
            "us": "/stɑːr/"
        },
        "nearby": [
            {
                "word": "stapler",
                "pos": "noun"
            },
            {
                "word": "staple remover",
                "pos": "noun"
            },
            {
                "word": "star",
                "pos": "noun"
            },
            {
                "word": "star",
                "pos": "verb"
            },
            {
                "word": "the Star",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large ball of burning gas in space that we see as a point of light in the sky at night",
                    "vi": "một quả cầu khí đốt lớn trong không gian mà chúng ta coi như một điểm sáng trên bầu trời vào ban đêm"
                },
                "examples": [
                    {
                        "en": "There was a big moon and hundreds of stars were shining overhead.",
                        "vi": "Có một mặt trăng lớn và hàng trăm ngôi sao đang tỏa sáng trên đầu."
                    },
                    {
                        "en": "Sirius is the brightest star in the sky.",
                        "vi": "Sirius là ngôi sao sáng nhất trên bầu trời."
                    },
                    {
                        "en": "under the stars We camped out under the stars.",
                        "vi": "dưới các vì sao Chúng tôi cắm trại dưới các vì sao."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object, a decoration, a mark, etc., usually with five or six points, whose shape represents a star",
                    "vi": "một đối tượng, một trang trí, một nhãn hiệu, v.v., thường có năm hoặc sáu điểm, có hình dạng đại diện cho một ngôi sao"
                },
                "examples": [
                    {
                        "en": "a horse with a white star on its forehead",
                        "vi": "một con ngựa có ngôi sao trắng trên trán"
                    },
                    {
                        "en": "a sheriff’s star",
                        "vi": "một cảnh sát trưởng ngôi sao"
                    },
                    {
                        "en": "I've put a star by the names of the girls in the class.",
                        "vi": "Tôi đã đặt một ngôi sao cho tên của các cô gái trong lớp."
                    },
                    {
                        "en": "Liz deserves a gold star for all her hard work.",
                        "vi": "Liz xứng đáng với một ngôi sao vàng cho tất cả những gì cô ấy làm việc chăm chỉ."
                    },
                    {
                        "en": "a four-star general",
                        "vi": "một vị tướng bốn sao"
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark that represents a star and tells you how good something is, especially a hotel or restaurant",
                    "vi": "một dấu hiệu đại diện cho một ngôi sao và cho bạn biết điều gì đó tốt như thế nào, đặc biệt là khách sạn hoặc nhà hàng"
                },
                "examples": [
                    {
                        "en": "three-/four-/five-star hotels",
                        "vi": "khách sạn ba / bốn / năm sao"
                    },
                    {
                        "en": "What star rating does this restaurant have?",
                        "vi": "Nhà hàng này có xếp hạng sao nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a famous and excellent singer, performer, sports player, etc.",
                    "vi": "một ca sĩ, nghệ sĩ biểu diễn, vận động viên thể thao nổi tiếng và xuất sắc, v.v."
                },
                "examples": [
                    {
                        "en": "pop/rock/Hollywood/TV stars",
                        "vi": "ngôi sao nhạc pop / rock / Hollywood / TV"
                    },
                    {
                        "en": "a football/tennis/sports star",
                        "vi": "một ngôi sao bóng đá / quần vợt / thể thao"
                    },
                    {
                        "en": "She acts well but she hasn't got star quality.",
                        "vi": "Cô ấy diễn xuất tốt nhưng không có phẩm chất ngôi sao."
                    },
                    {
                        "en": "Get used to her face as she is a rising star.",
                        "vi": "Hãy làm quen với khuôn mặt của cô ấy vì cô ấy là một ngôi sao đang lên."
                    },
                    {
                        "en": "She's a former child star.",
                        "vi": "Cô ấy là một cựu ngôi sao nhí."
                    },
                    {
                        "en": "He's so good—I'm sure he'll be a big star.",
                        "vi": "Anh ấy rất tốt - tôi chắc chắn rằng anh ấy sẽ là một ngôi sao lớn."
                    },
                    {
                        "en": "The best models receive star treatment.",
                        "vi": "Những người mẫu tốt nhất nhận được sự đối xử của ngôi sao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the main part, or one of the main parts, in a film, play, etc.",
                    "vi": "một người có phần chính, hoặc một trong các phần chính, trong một bộ phim, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "The star of the show was a young Italian singer.",
                        "vi": "Ngôi sao của chương trình là một ca sĩ trẻ người Ý."
                    },
                    {
                        "en": "The show has plenty of guest stars appearing each week.",
                        "vi": "Chương trình có rất nhiều ngôi sao khách mời xuất hiện mỗi tuần."
                    },
                    {
                        "en": "She was the star of many popular television series.",
                        "vi": "Cô từng là ngôi sao của nhiều bộ phim truyền hình nổi tiếng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the best of a group",
                    "vi": "một người hoặc một thứ tốt nhất của một nhóm"
                },
                "examples": [
                    {
                        "en": "a star student",
                        "vi": "một học sinh ngôi sao"
                    },
                    {
                        "en": "Paula is the star of the class.",
                        "vi": "Paula là ngôi sao của lớp."
                    },
                    {
                        "en": "He was the star performer at the championships.",
                        "vi": "Anh ấy là ngôi sao trình diễn tại các giải vô địch."
                    },
                    {
                        "en": "The star prize is a weekend for two in Paris.",
                        "vi": "Giải thưởng ngôi sao là một ngày cuối tuần cho hai người ở Paris."
                    },
                    {
                        "en": "The monkey was the star attraction (= the best or most popular act) at the show.",
                        "vi": "Con khỉ là điểm thu hút ngôi sao (= tiết mục hay nhất hoặc được yêu thích nhất) tại chương trình."
                    },
                    {
                        "en": "Through high school he was a track star.",
                        "vi": "Qua thời trung học, anh ấy đã là một ngôi sao đường đua."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you feel very grateful for something that somebody has done or that you think they are wonderful",
                    "vi": "được sử dụng để thể hiện rằng bạn cảm thấy rất biết ơn vì điều gì đó mà ai đó đã làm hoặc bạn nghĩ rằng họ thật tuyệt vời"
                },
                "examples": [
                    {
                        "en": "Thanks! You're a star!",
                        "vi": "Thanks! Bạn là một ngôi sao!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a description of what somebody thinks is going to happen to somebody in the future, based on the position of the stars and planets when they were born",
                    "vi": "mô tả về những gì ai đó nghĩ sẽ xảy ra với ai đó trong tương lai, dựa trên vị trí của các ngôi sao và hành tinh khi họ được sinh ra"
                },
                "examples": [
                    {
                        "en": "Do you read your stars in the paper?",
                        "vi": "Bạn có đọc những ngôi sao của mình trên báo không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to be successful at something that is difficult",
                    "vi": "để cố gắng thành công ở một điều gì đó khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to see flashes of light in front of your eyes, usually because you have been hit on the head",
                    "vi": "nhìn thấy những tia sáng lóe lên trước mắt bạn, thường là vì bạn đã bị đập vào đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody has stars in their eyes, they have dreams of becoming famous, especially as an actor, singer, etc.",
                    "vi": "Nếu ai đó có ngôi sao trong mắt, họ có ước mơ trở nên nổi tiếng, đặc biệt là trở thành một diễn viên, ca sĩ, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel very grateful and lucky about something",
                    "vi": "cảm thấy rất biết ơn và may mắn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Just thank your lucky stars you weren’t in the house at the time.",
                        "vi": "Chỉ cần cảm ơn những ngôi sao may mắn của bạn khi bạn không ở trong nhà vào thời điểm đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b43afdba8f6458cac0b46d8fc58f654",
        "word": "tourism",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈtʊərɪzəm/",
            "us": "/ˈtʊrɪzəm/"
        },
        "nearby": [
            {
                "word": "tour de force",
                "pos": "noun"
            },
            {
                "word": "Tourette's syndrome",
                "pos": "noun"
            },
            {
                "word": "tourism",
                "pos": "noun"
            },
            {
                "word": "tourist",
                "pos": "noun"
            },
            {
                "word": "tourist class",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the business activity connected with providing accommodation, services and entertainment for people who are visiting a place for pleasure",
                    "vi": "hoạt động kinh doanh kết nối với việc cung cấp chỗ ở, dịch vụ và giải trí cho những người đến thăm một nơi để vui chơi"
                },
                "examples": [
                    {
                        "en": "The area is heavily dependent on tourism.",
                        "vi": "Khu vực này phụ thuộc nhiều vào du lịch."
                    },
                    {
                        "en": "the tourism industry",
                        "vi": "ngành du lịch"
                    },
                    {
                        "en": "The tourism sector is expected to grow by 9.7 percent per annum.",
                        "vi": "Ngành du lịch dự kiến sẽ tăng trưởng 9,7% mỗi năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "4efba28820c44e7f9462383456caf454",
        "word": "brochure",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbrəʊʃə(r)/",
            "us": "/brəʊˈʃʊr/"
        },
        "nearby": [
            {
                "word": "broccoli rabe",
                "pos": "noun"
            },
            {
                "word": "brochette",
                "pos": "noun"
            },
            {
                "word": "brochure",
                "pos": "noun"
            },
            {
                "word": "broderie anglaise",
                "pos": "noun"
            },
            {
                "word": "broer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small magazine or book containing pictures and information about something or advertising something",
                    "vi": "một cuốn sách hoặc tạp chí nhỏ có chứa hình ảnh và thông tin về một cái gì đó hoặc quảng cáo một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a travel brochure",
                        "vi": "một tập tài liệu du lịch"
                    },
                    {
                        "en": "Send for a free colour brochure today!",
                        "vi": "Gửi một tập tài liệu màu miễn phí ngay hôm nay!"
                    }
                ]
            }
        ]
    },
    {
        "id": "08ce503574114185a5b2d323e3321b56",
        "word": "booking",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbʊkɪŋ/",
            "us": "/ˈbʊkɪŋ/"
        },
        "nearby": [
            {
                "word": "bookie",
                "pos": "noun"
            },
            {
                "word": "book in",
                "pos": "phrasal verb"
            },
            {
                "word": "booking",
                "pos": "noun"
            },
            {
                "word": "booking office",
                "pos": "noun"
            },
            {
                "word": "book into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that you make in advance to buy a ticket to travel somewhere, go to the theatre, etc.",
                    "vi": "một sự sắp xếp mà bạn thực hiện trước để mua vé đi du lịch đâu đó, đi xem phim, v.v."
                },
                "examples": [
                    {
                        "en": "a booking form/hall/clerk",
                        "vi": "một biểu mẫu đặt phòng / hội trường / thư ký"
                    },
                    {
                        "en": "Can I make a booking for Friday?",
                        "vi": "Tôi có thể đặt chỗ cho thứ Sáu không?"
                    },
                    {
                        "en": "Early booking is recommended.",
                        "vi": "Nên đặt chỗ sớm."
                    },
                    {
                        "en": "No advance booking is necessary.",
                        "vi": "Không cần đặt trước."
                    },
                    {
                        "en": "We can't take any more bookings.",
                        "vi": "Chúng tôi không thể nhận thêm bất kỳ đơn đặt hàng nào nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement for somebody to perform at a theatre, in a concert, etc.",
                    "vi": "sắp xếp để ai đó biểu diễn tại nhà hát, trong một buổi hòa nhạc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of the referee writing a player’s name in a book, as a punishment because an offence has been committed",
                    "vi": "hành động của trọng tài ghi tên cầu thủ vào sách, như một hình phạt vì một hành vi phạm tội đã được thực hiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82d557ad0078429b8a2bb7d755c0eb5f",
        "word": "operator",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒpəreɪtə(r)/",
            "us": "/ˈɑːpəreɪtər/"
        },
        "nearby": [
            {
                "word": "operative",
                "pos": "noun"
            },
            {
                "word": "operative",
                "pos": "adjective"
            },
            {
                "word": "operator",
                "pos": "noun"
            },
            {
                "word": "operetta",
                "pos": "noun"
            },
            {
                "word": "ophthalmic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who operates equipment or a machine",
                    "vi": "một người vận hành thiết bị hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "a computer/machine operator",
                        "vi": "một người vận hành máy tính / máy móc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or company that runs a particular business",
                    "vi": "một người hoặc công ty điều hành một doanh nghiệp cụ thể"
                },
                "examples": [
                    {
                        "en": "a tour operator",
                        "vi": "một nhà điều hành tour du lịch"
                    },
                    {
                        "en": "a bus operator",
                        "vi": "một nhà điều hành xe buýt"
                    },
                    {
                        "en": "a train operator that runs services between London and Scotland",
                        "vi": "một nhà điều hành xe lửa chạy các dịch vụ giữa London và Scotland"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who works on the phone switchboard of a large company or organization, especially at a telephone exchange",
                    "vi": "một người làm việc trên tổng đài điện thoại của một công ty hoặc tổ chức lớn, đặc biệt là ở tổng đài điện thoại"
                },
                "examples": [
                    {
                        "en": "Dial 100 and ask for the operator.",
                        "vi": "Quay số 100 và yêu cầu nhà điều hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who shows skill at getting what they want, especially when this involves behaving in a dishonest way",
                    "vi": "một người thể hiện kỹ năng đạt được những gì họ muốn, đặc biệt khi điều này liên quan đến hành vi không trung thực"
                },
                "examples": [
                    {
                        "en": "a smooth/slick/shrewd operator",
                        "vi": "một nhà điều hành trơn tru / mượt mà / khôn ngoan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a symbol or function which represents an operation in mathematics",
                    "vi": "một biểu tượng hoặc hàm đại diện cho một phép toán trong toán học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eeff4c8aa7cc4a458b79e9b31d4f3634",
        "word": "travel agency",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrævl eɪdʒənsi/",
            "us": "/ˈtrævl eɪdʒənsi/"
        },
        "nearby": [
            {
                "word": "travel",
                "pos": "verb"
            },
            {
                "word": "travel",
                "pos": "noun"
            },
            {
                "word": "travel agency",
                "pos": "noun"
            },
            {
                "word": "travel agent",
                "pos": "noun"
            },
            {
                "word": "travelator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a company that arranges travel and/or accommodation for people going on a holiday or journey",
                    "vi": "một công ty sắp xếp việc đi lại và / hoặc chỗ ở cho những người đi nghỉ hoặc đi du lịch"
                },
                "examples": [
                    {
                        "en": "You can book at your local travel agency.",
                        "vi": "Bạn có thể đặt tại đại lý du lịch địa phương của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "ebd0b2267d5f437dbbd9fc88dd38244e",
        "word": "travel agent",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrævl eɪdʒənt/",
            "us": "/ˈtrævl eɪdʒənt/"
        },
        "nearby": [
            {
                "word": "travel",
                "pos": "noun"
            },
            {
                "word": "travel agency",
                "pos": "noun"
            },
            {
                "word": "travel agent",
                "pos": "noun"
            },
            {
                "word": "travelator",
                "pos": "noun"
            },
            {
                "word": "Travelcard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or business whose job is to make arrangements for people wanting to travel, for example buying tickets or arranging hotel rooms",
                    "vi": "một người hoặc doanh nghiệp có công việc là sắp xếp cho những người muốn đi du lịch, ví dụ như mua vé hoặc sắp xếp phòng khách sạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop where you can go to arrange a holiday, etc.",
                    "vi": "một cửa hàng nơi bạn có thể đến để sắp xếp một kỳ nghỉ, v.v."
                },
                "examples": [
                    {
                        "en": "He works in a travel agent's.",
                        "vi": "Anh ấy làm việc trong một đại lý du lịch."
                    }
                ]
            }
        ]
    },
    {
        "id": "33307b841b2c4d7eabd4b0874083b357",
        "word": "cancellation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkænsəˈleɪʃn/",
            "us": "/ˌkænsəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "cancel",
                "pos": "verb"
            },
            {
                "word": "cancel culture",
                "pos": "noun"
            },
            {
                "word": "cancellation",
                "pos": "noun"
            },
            {
                "word": "cancel out",
                "pos": "phrasal verb"
            },
            {
                "word": "cancer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a decision to stop something that has already been arranged from happening; a statement that something will not happen",
                    "vi": "một quyết định để ngăn chặn một cái gì đó đã được sắp xếp để xảy ra; một tuyên bố rằng điều gì đó sẽ không xảy ra"
                },
                "examples": [
                    {
                        "en": "We need at least 24 hours' notice of cancellation.",
                        "vi": "Chúng tôi cần thông báo hủy trước ít nhất 24 giờ."
                    },
                    {
                        "en": "a cancellation fee",
                        "vi": "phí hủy bỏ"
                    },
                    {
                        "en": "Heavy seas can cause cancellation of ferry services.",
                        "vi": "Biển động có thể khiến dịch vụ phà bị hủy bỏ."
                    },
                    {
                        "en": "Cancellations must be made in writing.",
                        "vi": "Việc hủy bỏ phải được thực hiện bằng văn bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that has been cancelled",
                    "vi": "một cái gì đó đã bị hủy bỏ"
                },
                "examples": [
                    {
                        "en": "Are there any cancellations for this evening's performance? (= tickets that have been returned)",
                        "vi": "Có bất kỳ sự hủy bỏ nào cho buổi biểu diễn tối nay không? (= vé đã được trả lại)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of ending an agreement, especially one that has been legally arranged",
                    "vi": "thực tế là chấm dứt một thỏa thuận, đặc biệt là một thỏa thuận đã được sắp xếp hợp pháp"
                },
                "examples": [
                    {
                        "en": "the cancellation of the contract",
                        "vi": "việc hủy bỏ hợp đồng"
                    }
                ]
            }
        ]
    },
    {
        "id": "242e6c3550fe4314abd52491b2f913ee",
        "word": "high season",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhaɪ ˈsiːzn/",
            "us": "/ˌhaɪ ˈsiːzn/"
        },
        "nearby": [
            {
                "word": "high school",
                "pos": "noun"
            },
            {
                "word": "the high seas",
                "pos": "noun"
            },
            {
                "word": "high season",
                "pos": "noun"
            },
            {
                "word": "high-security",
                "pos": "adjective"
            },
            {
                "word": "High Sheriff",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time of year when a hotel or tourist area receives most visitors",
                    "vi": "thời điểm trong năm khi một khách sạn hoặc khu du lịch đón nhiều du khách nhất"
                },
                "examples": [
                    {
                        "en": "Hotels usually raise their prices in (the) high season.",
                        "vi": "Các khách sạn thường tăng giá vào (mùa) cao điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "59560dd80e5741c1ab71f411f65210d9",
        "word": "low season",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈləʊ siːzn/",
            "us": "/ˈləʊ siːzn/"
        },
        "nearby": [
            {
                "word": "low-risk",
                "pos": "adjective"
            },
            {
                "word": "L S Lowry",
                "pos": ""
            },
            {
                "word": "low season",
                "pos": "noun"
            },
            {
                "word": "low-slung",
                "pos": "adjective"
            },
            {
                "word": "low-tech",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time of year when a hotel or tourist area receives fewest visitors",
                    "vi": "thời điểm trong năm khi một khách sạn hoặc khu du lịch đón ít du khách nhất"
                },
                "examples": [
                    {
                        "en": "There is nothing more depressing than a seaside town in (the) low season.",
                        "vi": "Không có gì đáng buồn hơn một thị trấn ven biển vào (mùa) thấp điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dfd06103d374eeaa4f72432821e9f9c",
        "word": "touristy",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʊərɪsti/",
            "us": "/ˈtʊrɪsti/"
        },
        "nearby": [
            {
                "word": "tourist trap",
                "pos": "noun"
            },
            {
                "word": "the Tourist Trophy",
                "pos": ""
            },
            {
                "word": "touristy",
                "pos": "adjective"
            },
            {
                "word": "tournament",
                "pos": "noun"
            },
            {
                "word": "tourney",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "attracting or designed to attract a lot of tourists",
                    "vi": "thu hút hoặc thiết kế để thu hút nhiều khách du lịch"
                },
                "examples": [
                    {
                        "en": "Jersey is the most touristy of the islands.",
                        "vi": "Jersey là nơi đông khách du lịch nhất trong số các hòn đảo."
                    },
                    {
                        "en": "a shop full of touristy souvenirs",
                        "vi": "một cửa hàng đầy đồ lưu niệm dành cho khách du lịch"
                    }
                ]
            }
        ]
    },
    {
        "id": "eead4c08829d4c0e931483f67cfa47ea",
        "word": "bucket shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌkɪt ʃɒp/",
            "us": "/ˈbʌkɪt ʃɑːp/"
        },
        "nearby": [
            {
                "word": "bucket list",
                "pos": "noun"
            },
            {
                "word": "bucket seat",
                "pos": "noun"
            },
            {
                "word": "bucket shop",
                "pos": "noun"
            },
            {
                "word": "buckeye",
                "pos": "noun"
            },
            {
                "word": "Buck House",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place or website that sells cheap plane tickets",
                    "vi": "địa điểm hoặc trang web bán vé máy bay giá rẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "03fce2a9a8f0496d84a663fc981802c0",
        "word": "bureau",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbjʊərəʊ/",
            "us": "/ˈbjʊrəʊ/"
        },
        "nearby": [
            {
                "word": "burdensome",
                "pos": "adjective"
            },
            {
                "word": "burdock",
                "pos": "noun"
            },
            {
                "word": "bureau",
                "pos": "noun"
            },
            {
                "word": "bureaucracy",
                "pos": "noun"
            },
            {
                "word": "bureaucrat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a desk with drawers and usually a top that opens down to make a table to write on",
                    "vi": "bàn có ngăn kéo và thường là phần trên mở xuống để làm bàn viết"
                },
                "examples": [
                    {
                        "en": "There was just enough space for a fold-up bed, washstand and bureau.",
                        "vi": "Chỉ có đủ không gian cho một chiếc giường gấp, bệ rửa mặt và phòng làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of furniture with drawers (= parts like boxes built into it with handles on the front for pulling them out) for keeping clothes in",
                    "vi": "một món đồ nội thất có ngăn kéo (= các bộ phận như hộp được tích hợp sẵn với tay cầm ở mặt trước để kéo chúng ra) để đựng quần áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an office or organization that provides information on a particular subject",
                    "vi": "một văn phòng hoặc tổ chức cung cấp thông tin về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "She works for an employment bureau.",
                        "vi": "Cô ấy làm việc cho một văn phòng việc làm."
                    },
                    {
                        "en": "a convention bureau (= an office that provides information and services for people organizing conferences)",
                        "vi": "một văn phòng hội nghị (= một văn phòng cung cấp thông tin và dịch vụ cho những người tổ chức hội nghị)"
                    },
                    {
                        "en": "(especially North American English) a visitor’s bureau (= an office that provides information for tourists)",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) văn phòng dành cho khách (= văn phòng cung cấp thông tin cho khách du lịch)"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a government department or part of a government department",
                    "vi": "(ở Hoa Kỳ) một cơ quan chính phủ hoặc một bộ phận của cơ quan chính phủ"
                },
                "examples": [
                    {
                        "en": "the Federal Bureau of Investigation",
                        "vi": "Cục điều tra liên bang"
                    },
                    {
                        "en": "the US Bureau of Prisons",
                        "vi": "Cục trại giam Hoa Kỳ"
                    }
                ]
            }
        ]
    },
    {
        "id": "1892d7039e44459b87329c4e12a85fda",
        "word": "courier",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʊriə(r)/",
            "us": "/ˈkʊriər/"
        },
        "nearby": [
            {
                "word": "courageously",
                "pos": "adverb"
            },
            {
                "word": "courgette",
                "pos": "noun"
            },
            {
                "word": "courier",
                "pos": "noun"
            },
            {
                "word": "courier",
                "pos": "verb"
            },
            {
                "word": "course",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or company whose job is to take packages or important papers somewhere",
                    "vi": "một người hoặc công ty có công việc là mang gói hàng hoặc giấy tờ quan trọng đi đâu đó"
                },
                "examples": [
                    {
                        "en": "We sent the documents by courier.",
                        "vi": "Chúng tôi đã gửi tài liệu bằng đường chuyển phát nhanh."
                    },
                    {
                        "en": "I’ll send a courier with the blueprints.",
                        "vi": "Tôi sẽ gửi một chuyển phát nhanh với các bản thiết kế."
                    },
                    {
                        "en": "Urgent deliveries of medicine may be sent by motorcycle courier.",
                        "vi": "Việc giao thuốc gấp có thể được gửi bằng chuyển phát nhanh xe máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is employed by a travel company to give advice and help to a group of tourists on holiday",
                    "vi": "một người được thuê bởi một công ty du lịch để đưa ra lời khuyên và giúp đỡ một nhóm khách du lịch vào kỳ nghỉ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cbd66f934ef04cb080e634e421b3f5db",
        "word": "hotspot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒtspɒt/",
            "us": "/ˈhɑːtspɑːt/"
        },
        "nearby": [
            {
                "word": "hotshot",
                "pos": "noun"
            },
            {
                "word": "hotshot",
                "pos": "adjective"
            },
            {
                "word": "hotspot",
                "pos": "noun"
            },
            {
                "word": "hot stuff",
                "pos": "noun"
            },
            {
                "word": "hot-swap",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where fighting is common, especially for political reasons",
                    "vi": "một nơi thường xảy ra đánh nhau, đặc biệt là vì lý do chính trị"
                },
                "examples": [
                    {
                        "en": "UN peacekeeping forces have helped ease tensions in world hotspots since 1948.",
                        "vi": "Lực lượng gìn giữ hòa bình của Liên hợp quốc đã giúp xoa dịu căng thẳng tại các điểm nóng trên thế giới kể từ năm 1948."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place with a particular kind of danger or problem",
                    "vi": "một nơi có một loại nguy hiểm hoặc vấn đề cụ thể"
                },
                "examples": [
                    {
                        "en": "They identified eight pollution hotspots at the mouth of the Thames.",
                        "vi": "Họ đã xác định được 8 điểm nóng về ô nhiễm ở cửa sông Thames."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where there is a lot of activity or entertainment",
                    "vi": "một nơi có rất nhiều hoạt động hoặc giải trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place that is very hot and dry, where a fire has been burning or is likely to start",
                    "vi": "một nơi rất nóng và khô, nơi ngọn lửa đã bùng cháy hoặc có khả năng bùng phát"
                },
                "examples": [
                    {
                        "en": "Fire crews worked to douse hotspots left by two fires that consumed acres of forest.",
                        "vi": "Các đội cứu hỏa đã làm việc để khắc phục các điểm nóng do hai vụ cháy đã thiêu rụi hàng mẫu rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area on a computer screen that you can click on to start an operation such as loading a file",
                    "vi": "một khu vực trên màn hình máy tính mà bạn có thể nhấp vào để bắt đầu thao tác, chẳng hạn như tải tệp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place in a hotel, restaurant, airport, etc. that is fitted with a special device that enables you to connect a computer to the internet without using wires",
                    "vi": "một địa điểm trong khách sạn, nhà hàng, sân bay, v.v. được gắn một thiết bị đặc biệt cho phép bạn kết nối máy tính với Internet mà không cần sử dụng dây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f464ef939d814eb1a95420bc2b720210",
        "word": "overbook",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvəˈbʊk/",
            "us": "/ˌəʊvərˈbʊk/"
        },
        "nearby": [
            {
                "word": "overblown",
                "pos": "adjective"
            },
            {
                "word": "overboard",
                "pos": "adverb"
            },
            {
                "word": "overbook",
                "pos": "verb"
            },
            {
                "word": "overbridge",
                "pos": "noun"
            },
            {
                "word": "overburden",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to sell more tickets on a plane or reserve more rooms in a hotel than there are places available",
                    "vi": "bán nhiều vé hơn trên máy bay hoặc đặt trước nhiều phòng trong khách sạn hơn những chỗ còn trống"
                },
                "examples": [
                    {
                        "en": "The flight was heavily overbooked.",
                        "vi": "Chuyến bay đã được đặt trước quá nhiều."
                    }
                ]
            }
        ]
    },
    {
        "id": "4a7f6ccc111c488d8ee352d39e66365c",
        "word": "tourist trap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʊərɪst træp/",
            "us": "/ˈtʊrɪst træp/"
        },
        "nearby": [
            {
                "word": "tourist class",
                "pos": "noun"
            },
            {
                "word": "tourist office",
                "pos": "noun"
            },
            {
                "word": "tourist trap",
                "pos": "noun"
            },
            {
                "word": "the Tourist Trophy",
                "pos": ""
            },
            {
                "word": "touristy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place that attracts a lot of tourists and where food, drink, entertainment, etc. is more expensive than normal",
                    "vi": "nơi thu hút đông đảo khách du lịch và nơi ăn uống, giải trí, ... đắt hơn bình thường"
                },
                "examples": []
            }
        ]
    }
]