[
    {
        "id": "f4eb10a69dee4007b067779ab996e749",
        "word": "hot under the collar",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɒt/",
            "us": "/hɑːt/"
        },
        "nearby": [
            {
                "word": "hostler",
                "pos": "noun"
            },
            {
                "word": "hot pink",
                "pos": "adjective"
            },
            {
                "word": "hot",
                "pos": "adjective"
            },
            {
                "word": "hot",
                "pos": "verb"
            },
            {
                "word": "hot air",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a high temperature; producing heat",
                    "vi": "có nhiệt độ cao; sản xuất nhiệt"
                },
                "examples": [
                    {
                        "en": "It's hot today, isn't it?",
                        "vi": "Hôm nay trời nóng quá phải không?"
                    },
                    {
                        "en": "It was hot and getting hotter.",
                        "vi": "Trời càng lúc càng nóng."
                    },
                    {
                        "en": "Do you like this hot weather?",
                        "vi": "Bạn có thích thời tiết nóng bức này không?"
                    },
                    {
                        "en": "a hot dry summer",
                        "vi": "một mùa hè khô nóng"
                    },
                    {
                        "en": "an unusually hot day",
                        "vi": "một ngày nóng bất thường"
                    },
                    {
                        "en": "It was the hottest July on record.",
                        "vi": "Đó là tháng Bảy nóng nhất được ghi nhận."
                    },
                    {
                        "en": "Be careful—the plates are hot.",
                        "vi": "Hãy cẩn thận — các đĩa còn nóng."
                    },
                    {
                        "en": "All rooms have hot and cold water.",
                        "vi": "Tất cả các phòng đều có nước nóng lạnh."
                    },
                    {
                        "en": "I'll feel better after a hot bath.",
                        "vi": "Tôi sẽ cảm thấy tốt hơn sau khi tắm nước nóng."
                    },
                    {
                        "en": "a hot meal (= one that has been cooked)",
                        "vi": "một bữa ăn nóng (= một bữa ăn đã được nấu chín)"
                    },
                    {
                        "en": "When the weather gets hot, we often head to the beach.",
                        "vi": "Khi thời tiết trở nên nóng bức, chúng ta thường đi đến bãi biển."
                    },
                    {
                        "en": "I couldn't live in a hot country (= one which has high average temperatures).",
                        "vi": "Tôi không thể sống ở một quốc gia nóng (= một quốc gia có nhiệt độ trung bình cao)."
                    },
                    {
                        "en": "Cook in a very hot oven.",
                        "vi": "Nấu trong lò rất nóng."
                    },
                    {
                        "en": "Eat it while it's hot.",
                        "vi": "Ăn khi còn nóng."
                    },
                    {
                        "en": "I touched his forehead. He felt hot and feverish.",
                        "vi": "Tôi sờ trán anh ấy. Anh cảm thấy nóng và phát sốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling heat in an unpleasant or uncomfortable way",
                    "vi": "cảm thấy nóng một cách khó chịu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Is anyone too hot?",
                        "vi": "Có ai quá nóng không?"
                    },
                    {
                        "en": "I feel hot.",
                        "vi": "Tôi thấy nóng."
                    },
                    {
                        "en": "Her cheeks were hot with embarrassment.",
                        "vi": "Hai má cô nóng bừng vì xấu hổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel hot",
                    "vi": "làm cho bạn cảm thấy nóng"
                },
                "examples": [
                    {
                        "en": "London was hot and dusty.",
                        "vi": "London nóng nực và bụi bặm."
                    },
                    {
                        "en": "It had been a long hot journey.",
                        "vi": "Đó là một cuộc hành trình dài nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing pepper and spices that can produce a burning feeling in your mouth because they have a strong taste and smell",
                    "vi": "chứa hạt tiêu và gia vị có thể tạo ra cảm giác nóng rát trong miệng vì chúng có mùi và vị nồng"
                },
                "examples": [
                    {
                        "en": "hot spicy food",
                        "vi": "đồ ăn cay nóng"
                    },
                    {
                        "en": "You can make a curry hotter simply by adding chillies.",
                        "vi": "Bạn có thể làm món cà ri nóng hơn chỉ đơn giản bằng cách thêm ớt."
                    },
                    {
                        "en": "He brought out a plate of sausages covered in hot mustard.",
                        "vi": "Anh mang ra một đĩa xúc xích phủ mù tạt nóng hổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a lot of activity, argument or strong feelings",
                    "vi": "liên quan đến nhiều hoạt động, tranh luận hoặc cảm giác mạnh"
                },
                "examples": [
                    {
                        "en": "Today we enter the hottest phase of the election campaign.",
                        "vi": "Hôm nay chúng ta bước vào giai đoạn nóng nhất của chiến dịch bầu cử."
                    },
                    {
                        "en": "The environment has become a very hot issue.",
                        "vi": "Môi trường đã trở thành một vấn đề rất nóng."
                    },
                    {
                        "en": "Competition is getting hotter day by day.",
                        "vi": "Cạnh tranh đang trở nên nóng hơn từng ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult or dangerous to deal with and making you feel worried or uncomfortable",
                    "vi": "khó khăn hoặc nguy hiểm để đối phó và khiến bạn cảm thấy lo lắng hoặc không thoải mái"
                },
                "examples": [
                    {
                        "en": "When things got too hot most journalists left the area.",
                        "vi": "Khi mọi thứ trở nên quá nóng, hầu hết các nhà báo đã rời khỏi khu vực này."
                    },
                    {
                        "en": "They're making life hot for her.",
                        "vi": "Họ đang làm cho cuộc sống của cô ấy trở nên nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "new, exciting and very popular",
                    "vi": "mới, thú vị và rất phổ biến"
                },
                "examples": [
                    {
                        "en": "This is one of the hottest clubs in town.",
                        "vi": "Đây là một trong những câu lạc bộ nóng nhất trong thị trấn."
                    },
                    {
                        "en": "They are one of this year's hot new bands.",
                        "vi": "Họ là một trong những ban nhạc mới hot của năm nay."
                    },
                    {
                        "en": "The couple are Hollywood's hottest property.",
                        "vi": "Cặp đôi là tài sản hot nhất Hollywood."
                    }
                ]
            },
            {
                "define": {
                    "en": "fresh, very recent and usually exciting",
                    "vi": "mới mẻ, rất gần đây và thường thú vị"
                },
                "examples": [
                    {
                        "en": "I've got some hot gossip for you!",
                        "vi": "Tôi có một số tin đồn nóng cho bạn!"
                    },
                    {
                        "en": "a story that is hot off the press (= has just appeared in the newspapers)",
                        "vi": "một câu chuyện đang gây sốt trên báo chí (= vừa mới xuất hiện trên báo)"
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to be successful",
                    "vi": "có khả năng thành công"
                },
                "examples": [
                    {
                        "en": "She seems to be the hot favourite for the job.",
                        "vi": "Cô ấy có vẻ là người yêu thích nhất cho công việc."
                    },
                    {
                        "en": "Do you have any hot tips for today's race?",
                        "vi": "Bạn có lời khuyên nóng nào cho cuộc đua ngày hôm nay không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "very good at doing something; knowing a lot about something",
                    "vi": "rất giỏi khi làm một việc gì đó; biết nhiều về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Don't ask me—I'm not too hot on British history.",
                        "vi": "Đừng hỏi tôi — tôi không quá nóng về lịch sử nước Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody has a hot temper they become angry very easily",
                    "vi": "nếu ai đó có tính cách nóng nảy, họ rất dễ trở nên tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "feeling or causing sexual excitement",
                    "vi": "cảm giác hoặc gây hưng phấn tình dục"
                },
                "examples": [
                    {
                        "en": "You were as hot for me as I was for you.",
                        "vi": "Bạn cũng nóng bỏng đối với tôi như tôi đã dành cho bạn."
                    },
                    {
                        "en": "I've got a hot date tonight.",
                        "vi": "Tôi có một buổi hẹn hò nóng bỏng tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing scenes, statements, etc. that are of an extreme nature and are likely to shock or anger people",
                    "vi": "có chứa các cảnh, tuyên bố, v.v. có tính chất cực đoan và có khả năng gây sốc hoặc tức giận cho mọi người"
                },
                "examples": [
                    {
                        "en": "Some of the nude scenes were regarded as too hot for Broadway.",
                        "vi": "Một số cảnh khỏa thân được coi là quá nóng bỏng đối với sân khấu Broadway."
                    },
                    {
                        "en": "The report was highly critical of senior members of the Cabinet and was considered too hot to publish.",
                        "vi": "Bản báo cáo đã bị các thành viên cấp cao của Nội các chỉ trích rất nhiều và được coi là quá nóng để công bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking that something is very important and making sure that it always happens or is done",
                    "vi": "nghĩ rằng điều gì đó rất quan trọng và đảm bảo rằng điều đó luôn xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "They're very hot on punctuality at work.",
                        "vi": "Họ rất nóng tính về vấn đề đúng giờ tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a strong and exciting rhythm",
                    "vi": "có một nhịp điệu mạnh mẽ và thú vị"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "stolen and difficult to get rid of because they can easily be recognized",
                    "vi": "bị đánh cắp và khó lấy đi vì chúng có thể dễ dàng bị nhận ra"
                },
                "examples": [
                    {
                        "en": "I'd never have touched those phones if I'd known they were hot.",
                        "vi": "Tôi sẽ không bao giờ chạm vào những chiếc điện thoại đó nếu tôi biết chúng rất nóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in children’s games to say that the person playing is very close to finding a person or thing, or to guessing the correct answer",
                    "vi": "được sử dụng trong các trò chơi dành cho trẻ em để nói rằng người chơi đang tiến rất gần đến việc tìm ra người hoặc vật hoặc đoán câu trả lời chính xác"
                },
                "examples": [
                    {
                        "en": "You're getting hot!",
                        "vi": "Bạn đang trở nên nóng bỏng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very enthusiastic about starting an activity",
                    "vi": "rất nhiệt tình trong việc bắt đầu một hoạt động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be excited in a sexual way",
                    "vi": "được kích thích theo cách tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in or get into trouble",
                    "vi": "gặp rắc rối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your opinion about something often",
                    "vi": "thay đổi quan điểm của bạn về điều gì đó thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to experience a sudden feeling of fear or worry",
                    "vi": "trải qua cảm giác sợ hãi hoặc lo lắng đột ngột"
                },
                "examples": [
                    {
                        "en": "When the phone rang I just went hot and cold.",
                        "vi": "Khi điện thoại reo, tôi vừa nóng vừa lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be bought quickly or in great numbers",
                    "vi": "để được mua nhanh chóng hoặc với số lượng lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very close behind somebody/something; very soon after something",
                    "vi": "rất gần sau ai đó / cái gì đó; rất nhanh sau một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He turned and fled with Peter hot on his heels.",
                        "vi": "Anh ta quay lại và bỏ chạy với Peter nóng bỏng trên gót chân của mình."
                    },
                    {
                        "en": "They reached the border with the police hot on their heels.",
                        "vi": "Họ đến biên giới với cảnh sát nóng bỏng gót chân của họ."
                    },
                    {
                        "en": "Further successes came hot on the heels of her first best-selling novel.",
                        "vi": "Những thành công tiếp theo đến với cuốn tiểu thuyết bán chạy nhất đầu tiên của cô."
                    },
                    {
                        "en": "News of rising unemployment followed hard on the heels of falling export figures.",
                        "vi": "Tin tức về tỷ lệ thất nghiệp gia tăng kéo theo sự sụt giảm của số liệu xuất khẩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a state of worry or stress because you are under too much pressure, have a problem, are trying to hurry, etc.",
                    "vi": "trong trạng thái lo lắng, căng thẳng vì bị áp lực quá lớn, gặp khó khăn, vội vàng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "close to catching or finding the person or thing that you have been running after or searching for",
                    "vi": "gần bắt hoặc tìm thấy người hoặc vật mà bạn đang theo đuổi hoặc tìm kiếm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "angry or embarrassed",
                    "vi": "tức giận hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "He got very hot under the collar when I asked him where he'd been all day.",
                        "vi": "Anh ấy rất nóng dưới cổ áo khi tôi hỏi anh ấy đã ở đâu cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "following somebody closely and determined to catch them",
                    "vi": "theo sát ai đó và quyết tâm bắt họ"
                },
                "examples": [
                    {
                        "en": "She sped away in her car with journalists in hot pursuit.",
                        "vi": "Cô ấy phóng nhanh trong xe của mình với các nhà báo trong sự truy đuổi nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "not very good in quality",
                    "vi": "chất lượng không tốt lắm"
                },
                "examples": [
                    {
                        "en": "Her spelling isn't too hot.",
                        "vi": "Chính tả của cô ấy không quá nóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not feeling well",
                    "vi": "cảm thấy không khỏe"
                },
                "examples": [
                    {
                        "en": "‘How are you today?’ ‘Not so hot, I'm afraid.’",
                        "vi": "Hôm nay bạn thế nào?' 'Không quá nóng, tôi sợ.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make use of an opportunity immediately",
                    "vi": "để tận dụng cơ hội ngay lập tức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ee93328f44b4b298295ce8f8c81f41d",
        "word": "huff",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/hʌf/",
            "us": "/hʌf/"
        },
        "nearby": [
            {
                "word": "Hudson's Bay Company",
                "pos": ""
            },
            {
                "word": "hue",
                "pos": "noun"
            },
            {
                "word": "huff",
                "pos": "verb"
            },
            {
                "word": "huff",
                "pos": "noun"
            },
            {
                "word": "huffily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to say something or make a noise in a way that shows you are offended or annoyed",
                    "vi": "nói điều gì đó hoặc gây ồn ào theo cách cho thấy bạn đang bị xúc phạm hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "‘Well, nobody asked you,’ she huffed irritably.",
                        "vi": "Chà, không ai hỏi anh, cô cáu kỉnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe in a noisy way because you are very tired",
                    "vi": "hít thở một cách ồn ào bởi vì bạn đang rất mệt mỏi"
                },
                "examples": [
                    {
                        "en": "Jack was huffing and puffing to keep up with her.",
                        "vi": "Jack đang hậm hực và thở dốc để theo kịp cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it obvious that you are annoyed about something without doing anything to change the situation",
                    "vi": "để làm rõ rằng bạn đang bực mình về điều gì đó mà không làm gì để thay đổi tình hình"
                },
                "examples": [
                    {
                        "en": "After much huffing and puffing, she finally agreed to help.",
                        "vi": "Sau nhiều lần giận hờn vu vơ, cuối cùng cô ấy cũng đồng ý giúp đỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e74615b7285842de912346cec7d2243f",
        "word": "huff and puff",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pʌf/",
            "us": "/pʌf/"
        },
        "nearby": [
            {
                "word": "puerile",
                "pos": "adjective"
            },
            {
                "word": "Puerto Rico",
                "pos": ""
            },
            {
                "word": "puff",
                "pos": "verb"
            },
            {
                "word": "puff",
                "pos": "noun"
            },
            {
                "word": "puff adder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be smoking a cigarette, pipe, etc.",
                    "vi": "hút thuốc lá, tẩu thuốc, v.v."
                },
                "examples": [
                    {
                        "en": "puff (at/on something) He puffed (away) on his pipe.",
                        "vi": "phồng (vào / vào một cái gì đó) Anh ta phùng (đi) vào ống của mình."
                    },
                    {
                        "en": "puff something I sat puffing my cigar.",
                        "vi": "thổi một cái gì đó tôi ngồi hút xì gà."
                    },
                    {
                        "en": "She puffed furiously at her cigarette.",
                        "vi": "Cô tức giận phì phèo điếu thuốc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make smoke or steam blow out in clouds; to blow out in clouds",
                    "vi": "để làm cho khói hoặc hơi nước thổi ra trong các đám mây; thổi bay trong mây"
                },
                "examples": [
                    {
                        "en": "puff something (out) Chimneys were puffing out clouds of smoke.",
                        "vi": "thổi một cái gì đó (ra) Ống khói đang phun ra những đám khói."
                    },
                    {
                        "en": "puff (out) Steam puffed out.",
                        "vi": "phồng (ra) Hơi phồng ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe loudly and quickly, especially after you have been running",
                    "vi": "thở to và nhanh, đặc biệt là sau khi bạn vừa chạy xong"
                },
                "examples": [
                    {
                        "en": "I was starting to puff a little from the climb.",
                        "vi": "Tôi đã bắt đầu phập phồng một chút sau chuyến leo núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move in a particular direction, sending out small clouds of smoke or steam",
                    "vi": "để di chuyển theo một hướng cụ thể, tạo ra những đám khói nhỏ hoặc hơi nước"
                },
                "examples": [
                    {
                        "en": "The train puffed into the station.",
                        "vi": "Đoàn tàu tấp vào ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be too full of pride, etc.",
                    "vi": "quá tự hào, v.v."
                },
                "examples": [
                    {
                        "en": "He felt grown-up, puffed up with self-importance.",
                        "vi": "Anh cảm thấy mình trưởng thành, tự cao tự đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe in a noisy way because you are very tired",
                    "vi": "hít thở một cách ồn ào bởi vì bạn đang rất mệt mỏi"
                },
                "examples": [
                    {
                        "en": "Jack was huffing and puffing to keep up with her.",
                        "vi": "Jack đang hậm hực và thở dốc để theo kịp cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it obvious that you are annoyed about something without doing anything to change the situation",
                    "vi": "để làm rõ rằng bạn đang bực mình về điều gì đó mà không làm gì để thay đổi tình hình"
                },
                "examples": [
                    {
                        "en": "After much huffing and puffing, she finally agreed to help.",
                        "vi": "Sau nhiều lần giận hờn vu vơ, cuối cùng cô ấy cũng đồng ý giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe quickly and loudly through your mouth after physical effort",
                    "vi": "thở nhanh và to bằng miệng sau khi gắng sức"
                },
                "examples": [
                    {
                        "en": "Eventually, puffing and panting, he arrived at the gate.",
                        "vi": "Cuối cùng, thở hổn hển, anh cũng đến cổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "632c62fd7b654f3b84663408a88d3c6a",
        "word": "ill-tempered",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪl ˈtempəd/",
            "us": "/ˌɪl ˈtempərd/"
        },
        "nearby": [
            {
                "word": "ill-starred",
                "pos": "adjective"
            },
            {
                "word": "ill-suited",
                "pos": "adjective"
            },
            {
                "word": "ill-tempered",
                "pos": "adjective"
            },
            {
                "word": "ill-timed",
                "pos": "adjective"
            },
            {
                "word": "ill-treat",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "angry and rude or annoyed, especially when this seems unreasonable",
                    "vi": "tức giận và thô lỗ hoặc khó chịu, đặc biệt là khi điều này có vẻ không hợp lý"
                },
                "examples": [
                    {
                        "en": "There were some ill-tempered exchanges during the committee meeting.",
                        "vi": "Đã có một số trao đổi thiếu nóng nảy trong cuộc họp của ủy ban."
                    }
                ]
            }
        ]
    },
    {
        "id": "ca5527fdfa434475b061e914b1f10075",
        "word": "in a huff",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hʌf/",
            "us": "/hʌf/"
        },
        "nearby": [
            {
                "word": "hue",
                "pos": "noun"
            },
            {
                "word": "huff",
                "pos": "verb"
            },
            {
                "word": "huff",
                "pos": "noun"
            },
            {
                "word": "huffily",
                "pos": "adverb"
            },
            {
                "word": "huffy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a bad mood, especially because somebody has annoyed or upset you",
                    "vi": "trong tâm trạng tồi tệ, đặc biệt là vì ai đó đã làm bạn khó chịu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "She went off in a huff.",
                        "vi": "Cô ấy giận dỗi bỏ đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c33c9d06f6d447b8e067c0e06ea4bf7",
        "word": "incense",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈsens/",
            "us": "/ɪnˈsens/"
        },
        "nearby": [
            {
                "word": "incendiary",
                "pos": "noun"
            },
            {
                "word": "incense",
                "pos": "noun"
            },
            {
                "word": "incense",
                "pos": "verb"
            },
            {
                "word": "incensed",
                "pos": "adjective"
            },
            {
                "word": "incentive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody very angry",
                    "vi": "làm cho ai đó rất tức giận"
                },
                "examples": [
                    {
                        "en": "The decision incensed the workforce.",
                        "vi": "Quyết định này đã làm nức lòng lực lượng lao động."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa6d80b2d97a431594778ddcba66076b",
        "word": "incensed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈsenst/",
            "us": "/ɪnˈsenst/"
        },
        "nearby": [
            {
                "word": "incense",
                "pos": "noun"
            },
            {
                "word": "incense",
                "pos": "verb"
            },
            {
                "word": "incensed",
                "pos": "adjective"
            },
            {
                "word": "incentive",
                "pos": "noun"
            },
            {
                "word": "incentivize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very angry",
                    "vi": "rất giận"
                },
                "examples": [
                    {
                        "en": "They were incensed at the decision.",
                        "vi": "Họ đã xúc động trước quyết định này."
                    },
                    {
                        "en": "Workers were incensed by the decision to lengthen working hours.",
                        "vi": "Công nhân vô cùng phấn khởi trước quyết định kéo dài giờ làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f7fc512ebce4be6a5c021c842ab8b37",
        "word": "indignant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈdɪɡnənt/",
            "us": "/ɪnˈdɪɡnənt/"
        },
        "nearby": [
            {
                "word": "indigestible",
                "pos": "adjective"
            },
            {
                "word": "indigestion",
                "pos": "noun"
            },
            {
                "word": "indignant",
                "pos": "adjective"
            },
            {
                "word": "indignantly",
                "pos": "adverb"
            },
            {
                "word": "indignation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing anger and surprise because you think that you have been treated unfairly",
                    "vi": "cảm thấy hoặc thể hiện sự tức giận và ngạc nhiên vì bạn nghĩ rằng bạn đã bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "an indignant letter/look",
                        "vi": "một bức thư / cái nhìn phẫn nộ"
                    },
                    {
                        "en": "indignant at/about something She was very indignant at the way she had been treated.",
                        "vi": "phẫn nộ về / về điều gì đó Cô ấy rất phẫn nộ trước cách cô ấy bị đối xử."
                    },
                    {
                        "en": "indignant that… They were indignant that they hadn't been invited.",
                        "vi": "phẫn nộ rằng… Họ phẫn nộ vì họ đã không được mời."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0b4e21663c9440a86e1357e7f749921",
        "word": "indignation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪndɪɡˈneɪʃn/",
            "us": "/ˌɪndɪɡˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "indignant",
                "pos": "adjective"
            },
            {
                "word": "indignantly",
                "pos": "adverb"
            },
            {
                "word": "indignation",
                "pos": "noun"
            },
            {
                "word": "indignity",
                "pos": "noun"
            },
            {
                "word": "indigo",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of anger and surprise caused by something that you think is unfair or unreasonable",
                    "vi": "cảm giác tức giận và ngạc nhiên do điều gì đó mà bạn cho là không công bằng hoặc vô lý gây ra"
                },
                "examples": [
                    {
                        "en": "The rise in train fares has aroused public indignation.",
                        "vi": "Việc tăng giá vé tàu đã dấy lên sự phẫn nộ của dư luận."
                    },
                    {
                        "en": "indignation at/about/over something The government expressed its indignation over the way the incident had been handled.",
                        "vi": "phẫn nộ về / về / về điều gì đó Chính phủ bày tỏ sự phẫn nộ về cách xử lý vụ việc."
                    },
                    {
                        "en": "indignation that… Joe quivered with indignation that Paul should speak to him like that.",
                        "vi": "phẫn nộ rằng… Joe run lên vì phẫn nộ rằng Paul nên nói với anh ta như vậy."
                    },
                    {
                        "en": "to the indignation of somebody Some benefits apply only to men, much to the indignation of working women.",
                        "vi": "trước sự phẫn nộ của ai đó Một số lợi ích chỉ áp dụng cho nam giới, phần lớn đối với sự phẫn nộ của phụ nữ đi làm."
                    },
                    {
                        "en": "to be full of righteous indignation (= the belief that you are right to be angry even though other people do not agree)",
                        "vi": "đầy phẫn nộ chính đáng (= niềm tin rằng bạn đúng khi tức giận mặc dù người khác không đồng ý)"
                    }
                ]
            }
        ]
    },
    {
        "id": "b8ce984f04a54650b01b06171b8a9932",
        "word": "invective",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈvektɪv/",
            "us": "/ɪnˈvektɪv/"
        },
        "nearby": [
            {
                "word": "invasion",
                "pos": "noun"
            },
            {
                "word": "invasive",
                "pos": "adjective"
            },
            {
                "word": "invective",
                "pos": "noun"
            },
            {
                "word": "inveigh",
                "pos": "verb"
            },
            {
                "word": "inveigh against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "rude language and unpleasant remarks that somebody shouts when they are very angry",
                    "vi": "ngôn ngữ thô lỗ và những nhận xét khó chịu mà ai đó hét lên khi họ đang rất tức giận"
                },
                "examples": [
                    {
                        "en": "The gesture infuriated him and he let out a stream of invective.",
                        "vi": "Động tác đó khiến anh ta tức giận và anh ta phát ra một luồng khí tức."
                    },
                    {
                        "en": "a speech full of invective against the government",
                        "vi": "một bài phát biểu đầy xúc phạm chống lại chính phủ"
                    }
                ]
            }
        ]
    },
    {
        "id": "b0cb6f605ef74dbc8654d8f475e8d698",
        "word": "irascibility",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˌræsəˈbɪləti/",
            "us": "/ɪˌræsəˈbɪləti/"
        },
        "nearby": [
            {
                "word": "Iraq",
                "pos": "noun"
            },
            {
                "word": "Iraqi",
                "pos": "noun, adjective"
            },
            {
                "word": "irascibility",
                "pos": "noun"
            },
            {
                "word": "irascible",
                "pos": "adjective"
            },
            {
                "word": "irate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of tending to become angry very easily",
                    "vi": "thực tế là có xu hướng trở nên tức giận rất dễ dàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba6583164f644acdbeec6cfdbb09410d",
        "word": "irascible",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈræsəbl/",
            "us": "/ɪˈræsəbl/"
        },
        "nearby": [
            {
                "word": "Iraqi",
                "pos": "noun, adjective"
            },
            {
                "word": "irascibility",
                "pos": "noun"
            },
            {
                "word": "irascible",
                "pos": "adjective"
            },
            {
                "word": "irate",
                "pos": "adjective"
            },
            {
                "word": "IRC",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "becoming angry very easily",
                    "vi": "rất dễ trở nên tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c9b9f450341a44448e997bcb2ee30e7b",
        "word": "irate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/aɪˈreɪt/",
            "us": "/aɪˈreɪt/"
        },
        "nearby": [
            {
                "word": "irascibility",
                "pos": "noun"
            },
            {
                "word": "irascible",
                "pos": "adjective"
            },
            {
                "word": "irate",
                "pos": "adjective"
            },
            {
                "word": "IRC",
                "pos": "abbreviation"
            },
            {
                "word": "ire",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very angry",
                    "vi": "rất giận"
                },
                "examples": [
                    {
                        "en": "irate customers",
                        "vi": "khách hàng giận dữ"
                    },
                    {
                        "en": "an irate phone call",
                        "vi": "một cuộc điện thoại giận dữ"
                    },
                    {
                        "en": "She sounded extremely irate.",
                        "vi": "Cô ấy có vẻ vô cùng phẫn nộ."
                    }
                ]
            }
        ]
    },
    {
        "id": "393e5bcd2be64ca5a64828ae454789fe",
        "word": "kick off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "kicking",
                "pos": "adjective"
            },
            {
                "word": "kicking",
                "pos": "noun"
            },
            {
                "word": "kick off",
                "pos": "phrasal verb"
            },
            {
                "word": "kick-off",
                "pos": "noun"
            },
            {
                "word": "kick out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a football (soccer) game or a team, etc. kicks off, the game starts",
                    "vi": "khi một trận bóng đá (bóng đá) hoặc một đội, v.v. bắt đầu, trò chơi bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly become angry or violent",
                    "vi": "đột nhiên trở nên tức giận hoặc bạo lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start",
                    "vi": "để bắt đầu"
                },
                "examples": [
                    {
                        "en": "What time shall we kick off?",
                        "vi": "Mấy giờ chúng ta sẽ bắt đầu?"
                    },
                    {
                        "en": "And then it all kicked off.",
                        "vi": "Và sau đó tất cả bắt đầu."
                    },
                    {
                        "en": "Tom will kick off with a few comments.",
                        "vi": "Tom sẽ bắt đầu với một vài nhận xét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something by kicking",
                    "vi": "để loại bỏ một cái gì đó bằng cách đá"
                },
                "examples": [
                    {
                        "en": "They dropped their bags in the front hall and kicked off their shoes.",
                        "vi": "Họ bỏ túi xách của họ ở sảnh trước và đá giày của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start a discussion, a meeting, an event, etc.",
                    "vi": "để bắt đầu một cuộc thảo luận, một cuộc họp, một sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "Who is going to kick off the discussion?",
                        "vi": "Ai sẽ bắt đầu cuộc thảo luận?"
                    }
                ]
            }
        ]
    },
    {
        "id": "ad9082eb13564b499a5976e76e7c7ad6",
        "word": "lash",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/læʃ/",
            "us": "/læʃ/"
        },
        "nearby": [
            {
                "word": "laser gun",
                "pos": "noun"
            },
            {
                "word": "laser printer",
                "pos": "noun"
            },
            {
                "word": "lash",
                "pos": "verb"
            },
            {
                "word": "lash",
                "pos": "noun"
            },
            {
                "word": "lashing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit somebody/something with great force",
                    "vi": "đánh ai đó / cái gì đó với một lực lớn"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. The rain lashed at the windows.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Branches lashed at my face.",
                        "vi": "Cành quất vào mặt tôi."
                    },
                    {
                        "en": "lash something Huge waves lashed the shore.",
                        "vi": "đả kích một cái gì đó Những con sóng khổng lồ quật vào bờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit a person or an animal with a whip, rope, stick, etc.",
                    "vi": "đánh người hoặc động vật bằng roi, dây, gậy, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody/something in a very angry way",
                    "vi": "chỉ trích ai đó / điều gì đó một cách rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fasten something tightly to something else with ropes",
                    "vi": "buộc chặt thứ gì đó vào thứ khác bằng dây thừng"
                },
                "examples": [
                    {
                        "en": "Several logs had been lashed together to make a raft.",
                        "vi": "Một số khúc gỗ đã được buộc lại với nhau để tạo thành một chiếc bè."
                    },
                    {
                        "en": "During the storm everything on deck had to be lashed down.",
                        "vi": "Trong cơn bão, mọi thứ trên boong đều phải bị đánh sập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or to move something quickly and violently from side to side",
                    "vi": "để di chuyển hoặc để di chuyển một cái gì đó một cách nhanh chóng và mạnh mẽ từ bên này sang bên kia"
                },
                "examples": [
                    {
                        "en": "The crocodile's tail was lashing furiously from side to side.",
                        "vi": "Đuôi của con cá sấu đang quất dữ dội từ bên này sang bên kia."
                    },
                    {
                        "en": "The cat hissed and lashed its tail wildly from side to side.",
                        "vi": "Con mèo rít lên và quẫy đuôi dữ dội từ bên này sang bên kia."
                    }
                ]
            }
        ]
    },
    {
        "id": "efe92bca18ca45958ead7abe07614b34",
        "word": "livid",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪvɪd/",
            "us": "/ˈlɪvɪd/"
        },
        "nearby": [
            {
                "word": "liveware",
                "pos": "noun"
            },
            {
                "word": "live with",
                "pos": "phrasal verb"
            },
            {
                "word": "livid",
                "pos": "adjective"
            },
            {
                "word": "living",
                "pos": "adjective"
            },
            {
                "word": "living",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely angry",
                    "vi": "cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "Dad will be livid when he finds out.",
                        "vi": "Bố sẽ tím tái khi biết chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "dark blue-grey in colour",
                    "vi": "màu xám xanh đậm"
                },
                "examples": [
                    {
                        "en": "a livid bruise",
                        "vi": "một vết bầm tím"
                    }
                ]
            }
        ]
    },
    {
        "id": "930b91e8ce2b435e9509df96bbfdc8f4",
        "word": "lose your rag",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ræɡ/",
            "us": "/ræɡ/"
        },
        "nearby": [
            {
                "word": "rafter",
                "pos": "noun"
            },
            {
                "word": "rafting",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "verb"
            },
            {
                "word": "raga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of old, often torn, cloth used especially for cleaning things",
                    "vi": "một mảnh vải cũ, thường bị rách, được sử dụng đặc biệt để lau đồ đạc"
                },
                "examples": [
                    {
                        "en": "I wiped the window with a damp rag.",
                        "vi": "Tôi lau cửa sổ bằng giẻ ẩm."
                    },
                    {
                        "en": "Use a piece of old rag.",
                        "vi": "Sử dụng một mảnh giẻ cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a newspaper that you believe to be of low quality",
                    "vi": "một tờ báo mà bạn cho là có chất lượng thấp"
                },
                "examples": [
                    {
                        "en": "the local rag",
                        "vi": "giẻ rách địa phương"
                    },
                    {
                        "en": "I don't know how you can bear to read that awful rag!",
                        "vi": "Tôi không biết làm thế nào bạn có thể chịu được khi đọc cái giẻ rách khủng khiếp đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ragtime music",
                    "vi": "một bản nhạc ragtime"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or a series of events organized by students each year to raise money for charity",
                    "vi": "một sự kiện hoặc một chuỗi các sự kiện do sinh viên tổ chức hàng năm để gây quỹ từ thiện"
                },
                "examples": [
                    {
                        "en": "rag week",
                        "vi": "tuần lễ giẻ rách"
                    }
                ]
            },
            {
                "define": {
                    "en": "wearing very old torn clothes",
                    "vi": "mặc quần áo rách rất cũ"
                },
                "examples": [
                    {
                        "en": "The children were dressed in rags.",
                        "vi": "Những đứa trẻ ăn mặc rách rưới."
                    },
                    {
                        "en": "I saw people dressed in rags begging on the street.",
                        "vi": "Tôi nhìn thấy những người ăn mặc rách rưới ăn xin trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get angry",
                    "vi": "trở nên giận dữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from being extremely poor to being very rich",
                    "vi": "từ cực nghèo trở thành rất giàu"
                },
                "examples": [
                    {
                        "en": "a rags-to-riches story",
                        "vi": "câu chuyện giầu có"
                    },
                    {
                        "en": "Hers was a classic tale of rags to riches.",
                        "vi": "Hers là một câu chuyện kinh điển về sự giầu có."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is likely to make somebody very angry",
                    "vi": "điều gì đó có thể khiến ai đó rất tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e72248b6b9b34978a6fdeceab46ee738",
        "word": "madden",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmædn/",
            "us": "/ˈmædn/"
        },
        "nearby": [
            {
                "word": "madcap",
                "pos": "adjective"
            },
            {
                "word": "mad cow disease",
                "pos": "noun"
            },
            {
                "word": "madden",
                "pos": "verb"
            },
            {
                "word": "maddening",
                "pos": "adjective"
            },
            {
                "word": "maddeningly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a person or an animal very angry or crazy",
                    "vi": "làm cho một người hoặc một con vật rất tức giận hoặc điên cuồng"
                },
                "examples": [
                    {
                        "en": "(be) maddened (by/with something) Maddened with pain, the wounded bull ran at them.",
                        "vi": "(bị) tức giận (bởi / với điều gì đó) Bị đau đớn, con bò bị thương chạy vào họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8febdd9f8a9448c2ae71c06677972a5b",
        "word": "maddening",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmædnɪŋ/",
            "us": "/ˈmædnɪŋ/"
        },
        "nearby": [
            {
                "word": "mad cow disease",
                "pos": "noun"
            },
            {
                "word": "madden",
                "pos": "verb"
            },
            {
                "word": "maddening",
                "pos": "adjective"
            },
            {
                "word": "maddeningly",
                "pos": "adverb"
            },
            {
                "word": "madding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel extremely annoyed",
                    "vi": "khiến bạn cảm thấy vô cùng khó chịu"
                },
                "examples": [
                    {
                        "en": "maddening delays",
                        "vi": "sự chậm trễ kinh khủng"
                    },
                    {
                        "en": "He found her behaviour maddening.",
                        "vi": "Anh thấy hành vi của cô ấy thật điên rồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9a97765fba14fcd91a7935d44c206c0",
        "word": "make somebody sick",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/sɪk/",
            "us": "/sɪk/"
        },
        "nearby": [
            {
                "word": "sic",
                "pos": "adverb"
            },
            {
                "word": "sic",
                "pos": "verb"
            },
            {
                "word": "sick",
                "pos": "adjective"
            },
            {
                "word": "sick",
                "pos": "noun"
            },
            {
                "word": "sick",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "physically or mentally ill",
                    "vi": "bị bệnh về thể chất hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "a sick child",
                        "vi": "một đứa trẻ ốm yếu"
                    },
                    {
                        "en": "a sick relative/patient",
                        "vi": "một người thân / bệnh nhân bị ốm"
                    },
                    {
                        "en": "Her mother's very sick.",
                        "vi": "Mẹ cô ấy rất ốm."
                    },
                    {
                        "en": "Peter has been off sick (= away from work because he is ill) for two weeks.",
                        "vi": "Peter đã nghỉ ốm (= nghỉ làm vì bị ốm) trong hai tuần."
                    },
                    {
                        "en": "Emma has just called in sick (= phoned to say she will not be coming to work because she is ill).",
                        "vi": "Emma vừa gọi điện báo ốm (= gọi điện để nói rằng cô ấy sẽ không đến làm việc vì bị ốm)."
                    },
                    {
                        "en": "(British English) Britain's workers went sick (= did not go to work because they were ill) for a record number of days last year.",
                        "vi": "(Tiếng Anh Anh) Công nhân của Anh đã bị ốm (= không đi làm vì bị ốm) trong một số ngày kỷ lục trong năm ngoái."
                    },
                    {
                        "en": "(North American English) I can't afford to get sick (= become ill).",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi không đủ khả năng để bị bệnh (= trở nên ốm yếu)."
                    },
                    {
                        "en": "They became sick after eating contaminated food.",
                        "vi": "Họ bị bệnh sau khi ăn thực phẩm bị ô nhiễm."
                    },
                    {
                        "en": "I have been sick in bed since you left.",
                        "vi": "Tôi đã bị ốm trên giường kể từ khi bạn đi."
                    },
                    {
                        "en": "She was sick with the flu.",
                        "vi": "Cô ấy bị bệnh cúm."
                    },
                    {
                        "en": "Many people were sick from diseases caused by pollution.",
                        "vi": "Nhiều người bị ốm do ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling that you want to vomit",
                    "vi": "cảm thấy rằng bạn muốn nôn"
                },
                "examples": [
                    {
                        "en": "Mum, I feel sick!",
                        "vi": "Mẹ, con cảm thấy buồn nôn!"
                    },
                    {
                        "en": "If you eat any more cake you'll make yourself sick.",
                        "vi": "Nếu bạn ăn thêm bất kỳ chiếc bánh nào nữa, bạn sẽ tự khiến mình phát ốm."
                    },
                    {
                        "en": "a sick feeling in your stomach",
                        "vi": "cảm giác buồn nôn trong bụng"
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling sick as a result of travelling on a ship, plane, etc.",
                    "vi": "cảm thấy bị ốm do đi du lịch trên tàu, máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "seasick",
                        "vi": "say sóng"
                    },
                    {
                        "en": "airsick",
                        "vi": "airsick"
                    },
                    {
                        "en": "carsick",
                        "vi": "Say xe"
                    },
                    {
                        "en": "travel-sick",
                        "vi": "ốm đi"
                    }
                ]
            },
            {
                "define": {
                    "en": "bored with or annoyed about something that has been happening for a long time, and wanting it to stop",
                    "vi": "chán nản hoặc khó chịu về điều gì đó đã xảy ra trong một thời gian dài và muốn nó dừng lại"
                },
                "examples": [
                    {
                        "en": "sick of somebody/something I'm sick of the way you've treated me.",
                        "vi": "bị ốm vì ai đó / điều gì đó Tôi phát ốm vì cách bạn đã đối xử với tôi."
                    },
                    {
                        "en": "I'm sick and tired of your moaning.",
                        "vi": "Tôi phát ốm và mệt mỏi vì tiếng rên rỉ của bạn."
                    },
                    {
                        "en": "I'm sick to death of all of you!",
                        "vi": "Tôi phát ốm chết vì tất cả các bạn!"
                    },
                    {
                        "en": "We are getting heartily sick of your attitude.",
                        "vi": "Chúng tôi đang phát ốm vì thái độ của bạn."
                    },
                    {
                        "en": "sick of doing something We're sick of waiting around like this.",
                        "vi": "chán làm gì đó Chúng ta chán ngấy việc chờ đợi xung quanh như thế này."
                    },
                    {
                        "en": "I am sick of hearing about them and their wedding.",
                        "vi": "Tôi phát ngán khi nghe về họ và đám cưới của họ."
                    },
                    {
                        "en": "sick of somebody doing something I'm so sick of him whining about how hard his job is.",
                        "vi": "chán ai đó làm gì đó. Tôi phát ngán với việc anh ấy than vãn về công việc của anh ấy khó khăn như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "dealing with physical or mental pain, disease or death in a cruel way that some people think is offensive",
                    "vi": "đối phó với nỗi đau thể xác hoặc tinh thần, bệnh tật hoặc cái chết theo cách tàn nhẫn mà một số người cho là xúc phạm"
                },
                "examples": [
                    {
                        "en": "a sick joke",
                        "vi": "một trò đùa bệnh hoạn"
                    },
                    {
                        "en": "That's really sick.",
                        "vi": "Thật là bệnh hoạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "getting pleasure from doing strange or cruel things",
                    "vi": "nhận được niềm vui từ việc làm những điều kỳ lạ hoặc độc ác"
                },
                "examples": [
                    {
                        "en": "a sick mind",
                        "vi": "một tâm trí bệnh hoạn"
                    },
                    {
                        "en": "People think I'm sick for having a rat as a pet.",
                        "vi": "Mọi người nghĩ rằng tôi phát ốm vì nuôi một con chuột làm thú cưng."
                    },
                    {
                        "en": "We live in a sick society.",
                        "vi": "Chúng ta đang sống trong một xã hội bệnh hoạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very good, a lot of fun, etc.",
                    "vi": "rất tốt, rất nhiều niềm vui, v.v."
                },
                "examples": [
                    {
                        "en": "I love that song—it’s sick!",
                        "vi": "Tôi thích bài hát đó — thật là bệnh hoạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring food from your stomach back out through your mouth",
                    "vi": "để đưa thức ăn từ dạ dày của bạn trở lại qua miệng của bạn"
                },
                "examples": [
                    {
                        "en": "I was sick three times in the night.",
                        "vi": "Tôi đã bị ốm ba lần trong đêm."
                    },
                    {
                        "en": "She had been violently sick.",
                        "vi": "Cô ấy đã bị bệnh dữ dội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely worried",
                    "vi": "cực kỳ lo lắng"
                },
                "examples": [
                    {
                        "en": "Where have you been? I've been worried sick about you.",
                        "vi": "Bạn đã ở đâu Tôi đã rất lo lắng cho bạn."
                    },
                    {
                        "en": "She was worrying herself sick about the exams.",
                        "vi": "Cô ấy đang lo lắng bản thân bị ốm vì các kỳ thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become sick",
                    "vi": "Bị bệnh"
                },
                "examples": [
                    {
                        "en": "A week later he fell sick and died.",
                        "vi": "Một tuần sau anh ta đổ bệnh và chết."
                    },
                    {
                        "en": "He fell sick with yellow fever.",
                        "vi": "Anh ta bị bệnh sốt vàng da."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody angry or full of horror",
                    "vi": "để làm cho ai đó tức giận hoặc đầy kinh hoàng"
                },
                "examples": [
                    {
                        "en": "His hypocrisy makes me sick.",
                        "vi": "Sự đạo đức giả của anh ta khiến tôi phát ốm."
                    },
                    {
                        "en": "Her attitude makes me sick.",
                        "vi": "Thái độ của cô ấy khiến tôi phát ngán."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling very sick; vomiting a lot",
                    "vi": "cảm thấy rất ốm; nôn nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very disappointed",
                    "vi": "Rất thất vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very unhappy or disappointed",
                    "vi": "rất không vui hoặc thất vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "feeling very angry or worried",
                    "vi": "cảm thấy rất tức giận hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "Nora turned sick to her stomach on hearing this news.",
                        "vi": "Nora đau đến quặn cả bụng khi nghe tin này."
                    },
                    {
                        "en": "It makes me sick to my stomach to hear such stupid attitudes.",
                        "vi": "Nghe những thái độ ngu ngốc như vậy khiến tôi đau đến phát ốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling that you want to vomit",
                    "vi": "cảm thấy rằng bạn muốn nôn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23cdf32a61d54122900f7f555319dc0b",
        "word": "make somebody’s blood boil",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/blʌd/",
            "us": "/blʌd/"
        },
        "nearby": [
            {
                "word": "blonde",
                "pos": "noun"
            },
            {
                "word": "Blondie",
                "pos": ""
            },
            {
                "word": "blood",
                "pos": "noun"
            },
            {
                "word": "blood",
                "pos": "verb"
            },
            {
                "word": "blood bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red liquid that flows through the bodies of humans and animals",
                    "vi": "chất lỏng màu đỏ chảy qua cơ thể người và động vật"
                },
                "examples": [
                    {
                        "en": "He lost a lot of blood in the accident.",
                        "vi": "Anh ấy mất rất nhiều máu trong vụ tai nạn."
                    },
                    {
                        "en": "Blood was pouring out of a cut on her head.",
                        "vi": "Máu tuôn ra từ vết cắt trên đầu cô."
                    },
                    {
                        "en": "His hands were covered in blood.",
                        "vi": "Tay anh bê bết máu."
                    },
                    {
                        "en": "to give blood (= to have blood taken from you so that it can be used in the medical treatment of other people)",
                        "vi": "cho máu (= lấy máu từ bạn để nó có thể được sử dụng trong việc điều trị y tế cho người khác)"
                    },
                    {
                        "en": "After the attacks, people donated blood in record numbers.",
                        "vi": "Sau các vụ tấn công, người dân đã hiến máu với số lượng kỷ lục."
                    },
                    {
                        "en": "He was a hot-headed warrior, always too quick to shed blood (= attack and injure or kill somebody).",
                        "vi": "Anh ta là một chiến binh nóng nảy, luôn đổ máu quá nhanh (= tấn công và làm bị thương hoặc giết ai đó)."
                    },
                    {
                        "en": "to draw blood (= to wound a person so that they lose blood)",
                        "vi": "để lấy máu (= làm vết thương một người để họ mất máu)"
                    },
                    {
                        "en": "a drop/pool of blood",
                        "vi": "một giọt / vũng máu"
                    },
                    {
                        "en": "There was dried blood on her cheek.",
                        "vi": "Có vết máu khô trên má cô."
                    },
                    {
                        "en": "a blood cell/sample",
                        "vi": "một tế bào máu / mẫu"
                    },
                    {
                        "en": "to improve blood flow to the heart",
                        "vi": "cải thiện lưu lượng máu đến tim"
                    },
                    {
                        "en": "the blood supply to the brain",
                        "vi": "cung cấp máu cho não"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of blood mentioned",
                    "vi": "có nhóm máu được đề cập"
                },
                "examples": [
                    {
                        "en": "cold-blooded reptiles",
                        "vi": "loài bò sát máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "family origins",
                    "vi": "nguồn gốc gia đình"
                },
                "examples": [
                    {
                        "en": "She is of noble blood.",
                        "vi": "Cô ấy thuộc dòng máu quý tộc."
                    },
                    {
                        "en": "There is some Polish blood on his father's side.",
                        "vi": "Có chút dòng máu Ba Lan bên cha anh."
                    },
                    {
                        "en": "I doubt if I have a single drop of aristocratic blood in my veins.",
                        "vi": "Tôi nghi ngờ liệu mình có một giọt máu quý tộc trong huyết quản hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and fashionable man",
                    "vi": "một người đàn ông giàu có và thời trang"
                },
                "examples": [
                    {
                        "en": "a young blood",
                        "vi": "một dòng máu trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of hate or strong dislike",
                    "vi": "cảm giác ghét hoặc không thích mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody and want to hurt or punish them",
                    "vi": "tức giận với ai đó và muốn làm tổn thương hoặc trừng phạt họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a natural part of your character and of the character of other members of your family",
                    "vi": "trở thành một phần tự nhiên trong tính cách của bạn và tính cách của các thành viên khác trong gia đình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "family relationships are stronger than any others",
                    "vi": "mối quan hệ gia đình bền chặt hơn bất kỳ mối quan hệ nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody is very angry and ready to argue or fight",
                    "vi": "ai đó rất tức giận và sẵn sàng tranh luận hoặc chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hard work; a lot of effort",
                    "vi": "làm việc rất chăm chỉ; nhiều sự cố gắng"
                },
                "examples": [
                    {
                        "en": "The only way to succeed is through old-fashioned blood, sweat and tears.",
                        "vi": "Cách duy nhất để thành công là thông qua máu, mồ hôi và nước mắt của người già."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "almost impossible to obtain",
                    "vi": "hầu như không thể có được"
                },
                "examples": [
                    {
                        "en": "Getting an apology from him was like getting blood from a stone.",
                        "vi": "Nhận được một lời xin lỗi từ anh ấy giống như nhận được một hòn đá hộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody extremely angry",
                    "vi": "làm cho ai đó cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "The way he treats his employees really makes my blood boil.",
                        "vi": "Cách anh ấy đối xử với nhân viên thực sự khiến tôi sôi máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "new members or employees, especially young ones, with new ideas or ways of doing things",
                    "vi": "các thành viên hoặc nhân viên mới, đặc biệt là những người trẻ tuổi, với những ý tưởng hoặc cách làm mới"
                },
                "examples": [
                    {
                        "en": "This company badly needs to bring in some new blood.",
                        "vi": "Công ty này rất cần phải mang thêm một lượng máu mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill or wound somebody",
                    "vi": "giết hoặc làm bị thương ai đó"
                },
                "examples": [
                    {
                        "en": "Nothing can justify spilling innocent blood.",
                        "vi": "Không gì có thể biện minh cho việc đổ máu vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody excited",
                    "vi": "để làm cho ai đó phấn khích"
                },
                "examples": [
                    {
                        "en": "The atmosphere in a theatre never failed to stir her blood.",
                        "vi": "Bầu không khí trong rạp chiếu phim không bao giờ không khuấy động được máu của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": [
                    {
                        "en": "I sweated blood to get everything ready in time.",
                        "vi": "Tôi đổ mồ hôi máu để chuẩn bị mọi thứ kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6d6544fab8f4fd29e5c0b5d6c25a724",
        "word": "miffed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/mɪft/",
            "us": "/mɪft/"
        },
        "nearby": [
            {
                "word": "mien",
                "pos": "noun"
            },
            {
                "word": "Ludwig Mies van der Rohe",
                "pos": ""
            },
            {
                "word": "miffed",
                "pos": "adjective"
            },
            {
                "word": "might",
                "pos": "modal verb"
            },
            {
                "word": "might",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slightly angry or upset",
                    "vi": "hơi tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "miffed about/at/by something He was understandably miffed about not getting chosen.",
                        "vi": "bị xáo trộn về / tại / bởi điều gì đó Anh ấy cảm thấy bối rối một cách dễ hiểu về việc không được chọn."
                    },
                    {
                        "en": "miffed that… She’s a bit miffed that we’re not taking her with us.",
                        "vi": "nhầm lẫn điều đó… Cô ấy hơi bối rối khi chúng tôi không đưa cô ấy đi cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f27f33507025419385a64ac12ef69007",
        "word": "nettle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnetl/",
            "us": "/ˈnetl/"
        },
        "nearby": [
            {
                "word": "netting",
                "pos": "noun"
            },
            {
                "word": "nettle",
                "pos": "noun"
            },
            {
                "word": "nettle",
                "pos": "verb"
            },
            {
                "word": "nettlerash",
                "pos": "noun"
            },
            {
                "word": "nettlesome",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody slightly angry",
                    "vi": "làm cho ai đó hơi tức giận"
                },
                "examples": [
                    {
                        "en": "My remarks clearly nettled her.",
                        "vi": "Những lời nhận xét của tôi rõ ràng đã khiến cô ấy thấm nhuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d9d0892a22a45f59ce74443beeca0e3",
        "word": "pique",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/piːk/",
            "us": "/piːk/"
        },
        "nearby": [
            {
                "word": "piquancy",
                "pos": "noun"
            },
            {
                "word": "piquant",
                "pos": "adjective"
            },
            {
                "word": "pique",
                "pos": "noun"
            },
            {
                "word": "pique",
                "pos": "verb"
            },
            {
                "word": "piqué",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "annoyed or bitter feelings that you have, usually because you believe that you have not been treated with enough respect",
                    "vi": "cảm giác khó chịu hoặc cay đắng mà bạn có, thường là vì bạn tin rằng bạn đã không được đối xử với đủ sự tôn trọng"
                },
                "examples": [
                    {
                        "en": "When he realized nobody was listening to him, he left in a fit of pique.",
                        "vi": "Khi nhận ra không có ai đang lắng nghe mình, anh ta bỏ đi trong cơn tức giận."
                    },
                    {
                        "en": "She’d lied about it out of pique.",
                        "vi": "Cô ấy đã nói dối về điều đó vì sự khó chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "02331728d8a54c34bc4f514fcc25f84b",
        "word": "provocation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprɒvəˈkeɪʃn/",
            "us": "/ˌprɑːvəˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "Provo",
                "pos": ""
            },
            {
                "word": "provocateur",
                "pos": "noun"
            },
            {
                "word": "provocation",
                "pos": "noun"
            },
            {
                "word": "provocative",
                "pos": "adjective"
            },
            {
                "word": "provocatively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of doing or saying something deliberately in order to make somebody angry or upset; something that is done or said to cause this",
                    "vi": "hành động cố ý làm hoặc nói điều gì đó để khiến ai đó tức giận hoặc khó chịu; một cái gì đó đã được thực hiện hoặc được cho là gây ra điều này"
                },
                "examples": [
                    {
                        "en": "under provocation He reacted violently only under provocation.",
                        "vi": "dưới sự khiêu khích Anh ta chỉ phản ứng dữ dội khi bị khiêu khích."
                    },
                    {
                        "en": "without provocation The terrorists can strike at any time without provocation.",
                        "vi": "Không bị khiêu khích Những kẻ khủng bố có thể tấn công bất cứ lúc nào mà không bị khiêu khích."
                    },
                    {
                        "en": "She bursts into tears at the slightest provocation.",
                        "vi": "Cô ấy bật khóc trước sự khiêu khích nhỏ nhất."
                    },
                    {
                        "en": "So far the police have refused to respond to their provocations.",
                        "vi": "Cho đến nay cảnh sát đã từ chối trả lời các hành động khiêu khích của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "96170b0cf6da4219a15b3714b23a3811",
        "word": "quarrel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɒrəl/",
            "us": "/ˈkwɑːrəl/"
        },
        "nearby": [
            {
                "word": "quarantine",
                "pos": "verb"
            },
            {
                "word": "quark",
                "pos": "noun"
            },
            {
                "word": "quarrel",
                "pos": "noun"
            },
            {
                "word": "quarrel",
                "pos": "verb"
            },
            {
                "word": "quarrelsome",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an angry argument or disagreement between people, often about a personal matter",
                    "vi": "một cuộc tranh cãi giận dữ hoặc bất đồng giữa mọi người, thường là về một vấn đề cá nhân"
                },
                "examples": [
                    {
                        "en": "a family quarrel",
                        "vi": "một cuộc cãi vã gia đình"
                    },
                    {
                        "en": "quarrel with somebody He had had a quarrel with his brother.",
                        "vi": "cãi nhau với ai đó Anh ta đã cãi nhau với anh trai mình."
                    },
                    {
                        "en": "He got involved in a quarrel with his neighbour.",
                        "vi": "Anh ta đã tham gia vào một cuộc cãi vã với người hàng xóm của mình."
                    },
                    {
                        "en": "quarrel about something They had a quarrel about money.",
                        "vi": "cãi nhau về điều gì đó Họ đã cãi nhau về tiền bạc."
                    },
                    {
                        "en": "quarrel over something a quarrel over the ownership of a piece of land",
                        "vi": "cãi nhau về điều gì đó cãi nhau về quyền sở hữu một mảnh đất"
                    },
                    {
                        "en": "quarrel between A and B Were you at any time aware of a quarrel between the two of them?",
                        "vi": "cãi nhau giữa A và B Bạn có biết về một cuộc cãi vã nào giữa hai người họ không?"
                    },
                    {
                        "en": "quarrel (with somebody/between A and B) (about/over something) Paul's incessant quarrels with his sisters over investments",
                        "vi": "cãi nhau (với ai đó / giữa A và B) (về / về điều gì đó) Paul không ngừng cãi nhau với các chị gái của mình về các khoản đầu tư"
                    }
                ]
            },
            {
                "define": {
                    "en": "a reason for complaining about somebody/something or for disagreeing with somebody/something",
                    "vi": "lý do để phàn nàn về ai đó / điều gì đó hoặc vì không đồng ý với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "We have no quarrel with his methods.",
                        "vi": "Chúng tôi không có tranh cãi với các phương pháp của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deliberately start a fight or an argument with somebody",
                    "vi": "cố tình bắt đầu một cuộc chiến hoặc một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "He had drunk too much and was ready to pick a fight with anyone who crossed his path.",
                        "vi": "Anh ta đã uống quá nhiều và sẵn sàng gây gổ với bất cứ ai băng qua đường của mình."
                    },
                    {
                        "en": "She tried to pick a quarrel with me.",
                        "vi": "Cô ấy cố cãi nhau với tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "67b53ac0a4c44c428b59ab64e6670841",
        "word": "querulous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwerələs/",
            "us": "/ˈkwerələs/"
        },
        "nearby": [
            {
                "word": "quench",
                "pos": "verb"
            },
            {
                "word": "quern",
                "pos": "noun"
            },
            {
                "word": "querulous",
                "pos": "adjective"
            },
            {
                "word": "querulously",
                "pos": "adverb"
            },
            {
                "word": "query",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "complaining; showing that you are annoyed",
                    "vi": "than phiền; cho thấy rằng bạn đang khó chịu"
                },
                "examples": [
                    {
                        "en": "He complained in a querulous voice about having been woken up.",
                        "vi": "Anh ta phàn nàn với một giọng kỳ cục về việc đã được đánh thức."
                    }
                ]
            }
        ]
    },
    {
        "id": "706db82b07ce432bb11a4e9a9133b7cd",
        "word": "quick-tempered",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkwɪk ˈtempəd/",
            "us": "/ˌkwɪk ˈtempərd/"
        },
        "nearby": [
            {
                "word": "quicksilver",
                "pos": "adjective"
            },
            {
                "word": "quickstep",
                "pos": "noun"
            },
            {
                "word": "quick-tempered",
                "pos": "adjective"
            },
            {
                "word": "quick-witted",
                "pos": "adjective"
            },
            {
                "word": "quid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tending to become angry very quickly and easily",
                    "vi": "có xu hướng trở nên tức giận rất nhanh chóng và dễ dàng"
                },
                "examples": [
                    {
                        "en": "a quick-tempered woman",
                        "vi": "một người phụ nữ nóng tính"
                    }
                ]
            }
        ]
    },
    {
        "id": "c58cd5a4c7d44c6fb933b50087508ac0",
        "word": "rage",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪdʒ/",
            "us": "/reɪdʒ/"
        },
        "nearby": [
            {
                "word": "rag doll",
                "pos": "noun"
            },
            {
                "word": "rage",
                "pos": "noun"
            },
            {
                "word": "rage",
                "pos": "verb"
            },
            {
                "word": "ragga",
                "pos": "noun"
            },
            {
                "word": "raggamuffin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show that you are very angry about something or with somebody, especially by shouting",
                    "vi": "để thể hiện rằng bạn đang rất tức giận về điều gì đó hoặc với ai đó, đặc biệt là bằng cách la hét"
                },
                "examples": [
                    {
                        "en": "rage (at/against/about somebody/something) He raged against the injustice of it all.",
                        "vi": "cơn thịnh nộ (tại / chống lại / về ai đó / cái gì đó) Anh ta nổi cơn thịnh nộ chống lại sự bất công của tất cả."
                    },
                    {
                        "en": "+ speech ‘That's unfair!’ she raged.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue in a violent way",
                    "vi": "tiếp tục một cách bạo lực"
                },
                "examples": [
                    {
                        "en": "The riots raged for three days.",
                        "vi": "Cuộc bạo động diễn ra trong ba ngày."
                    },
                    {
                        "en": "The blizzard was still raging outside.",
                        "vi": "Bên ngoài bão tuyết vẫn hoành hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spread very quickly",
                    "vi": "lan truyền rất nhanh"
                },
                "examples": [
                    {
                        "en": "Forest fires were raging out of control.",
                        "vi": "Cháy rừng hoành hành ngoài tầm kiểm soát."
                    },
                    {
                        "en": "A flu epidemic raged through Europe.",
                        "vi": "Một trận dịch cúm hoành hành khắp Châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go out and enjoy yourself",
                    "vi": "đi ra ngoài và tận hưởng bản thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "63fffeab7da24627bb6f9517e9165ea5",
        "word": "rail",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪl/",
            "us": "/reɪl/"
        },
        "nearby": [
            {
                "word": "raider",
                "pos": "noun"
            },
            {
                "word": "rail",
                "pos": "noun"
            },
            {
                "word": "rail",
                "pos": "verb"
            },
            {
                "word": "railcar",
                "pos": "noun"
            },
            {
                "word": "railcard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to complain about something/somebody in a very angry way",
                    "vi": "phàn nàn về điều gì đó / ai đó theo cách rất tức giận"
                },
                "examples": [
                    {
                        "en": "She railed against the injustice of it all.",
                        "vi": "Cô chống lại sự bất công của tất cả."
                    }
                ]
            }
        ]
    },
    {
        "id": "b7c28405e69e477e98958a336f234198",
        "word": "rankle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræŋkl/",
            "us": "/ˈræŋkl/"
        },
        "nearby": [
            {
                "word": "ranking",
                "pos": "noun"
            },
            {
                "word": "ranking",
                "pos": "adjective"
            },
            {
                "word": "rankle",
                "pos": "verb"
            },
            {
                "word": "ransack",
                "pos": "verb"
            },
            {
                "word": "ransom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something such as an event or a remark rankles, it makes you feel angry or upset for a long time",
                    "vi": "nếu một cái gì đó chẳng hạn như một sự kiện hoặc một nhận xét không ổn, nó khiến bạn cảm thấy tức giận hoặc khó chịu trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "rankle (somebody) Her comments still rankled.",
                        "vi": "rankle (ai đó) Những bình luận của cô ấy vẫn còn xếp hạng."
                    },
                    {
                        "en": "rankle with somebody His decision to sell the land still rankled with her.",
                        "vi": "thăng hạng với ai đó Quyết định bán đất của anh ấy vẫn khiến cô ấy băn khoăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d6961426b4d34b52bbaace48ddfc65f1",
        "word": "rant",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rænt/",
            "us": "/rænt/"
        },
        "nearby": [
            {
                "word": "Arthur Ransome",
                "pos": ""
            },
            {
                "word": "ransomware",
                "pos": "noun"
            },
            {
                "word": "rant",
                "pos": "verb"
            },
            {
                "word": "rant",
                "pos": "noun"
            },
            {
                "word": "rantings",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak or complain about something in a loud and/or angry way",
                    "vi": "nói hoặc phàn nàn về điều gì đó một cách ồn ào và / hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "rant (on) (about something) She was ranting on about the unfairness of it all.",
                        "vi": "rant (về) (về điều gì đó) Cô ấy đang nói về sự không công bằng của tất cả."
                    },
                    {
                        "en": "rant at somebody Stop ranting at me!",
                        "vi": "đừng chửi tôi nữa!"
                    },
                    {
                        "en": "+ speech ‘It's not fair! They never give us a chance!’ he ranted.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are angry by shouting or complaining loudly for a long time",
                    "vi": "thể hiện rằng bạn đang tức giận bằng cách la hét hoặc phàn nàn lớn tiếng trong một thời gian dài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "61efb9173c0d467b957ff2634256f6b1",
        "word": "rant and rave",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪv/",
            "us": "/reɪv/"
        },
        "nearby": [
            {
                "word": "ravage",
                "pos": "verb"
            },
            {
                "word": "ravages",
                "pos": "noun"
            },
            {
                "word": "rave",
                "pos": "verb"
            },
            {
                "word": "rave",
                "pos": "noun"
            },
            {
                "word": "ravel",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk or write about something in a very enthusiastic way",
                    "vi": "nói hoặc viết về điều gì đó một cách rất nhiệt tình"
                },
                "examples": [
                    {
                        "en": "The critics raved about his performance in ‘Hamlet’.",
                        "vi": "Các nhà phê bình khen ngợi về màn trình diễn của anh ấy trong 'Hamlet'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout in a loud and emotional way at somebody because you are angry with them; to talk or shout in a way that is not logical or sensible",
                    "vi": "hét to và xúc động vào ai đó vì bạn tức giận với họ; nói hoặc la hét theo cách không logic hoặc hợp lý"
                },
                "examples": [
                    {
                        "en": "rave at somebody She was shouting and raving at them.",
                        "vi": "thịnh nộ với ai đó Cô ấy đang la hét và thịnh nộ với họ."
                    },
                    {
                        "en": "My parents both raved at me.",
                        "vi": "Cha mẹ tôi đều giận dữ với tôi."
                    },
                    {
                        "en": "He wandered the streets raving at passers-by.",
                        "vi": "Anh lang thang trên đường phố say sưa ngắm nhìn những người qua đường."
                    },
                    {
                        "en": "rave on (at somebody) (about something) He was still raving on about irresponsible youngsters.",
                        "vi": "say sưa nói về (tại ai đó) (về điều gì đó) Anh ấy vẫn say sưa nói về những người trẻ tuổi vô trách nhiệm."
                    },
                    {
                        "en": "+ speech ‘Never mind how he feels!’ Melissa raved.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are angry by shouting or complaining loudly for a long time",
                    "vi": "thể hiện rằng bạn đang tức giận bằng cách la hét hoặc phàn nàn lớn tiếng trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "She was ranting and raving about our stupidity.",
                        "vi": "Cô ấy đang giận dữ và giận dữ về sự ngu ngốc của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "b987821bac714e699999bc568897590c",
        "word": "rantings",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræntɪŋz/",
            "us": "/ˈræntɪŋz/"
        },
        "nearby": [
            {
                "word": "rant",
                "pos": "verb"
            },
            {
                "word": "rant",
                "pos": "noun"
            },
            {
                "word": "rantings",
                "pos": "noun"
            },
            {
                "word": "rap",
                "pos": "noun"
            },
            {
                "word": "rap",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "loud or angry comments or speeches that continue for a long time",
                    "vi": "những bình luận hoặc bài phát biểu ồn ào hoặc tức giận kéo dài liên tục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "10ce41e6b02a44f7b5fc4fed198bdd35",
        "word": "ratty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræti/",
            "us": "/ˈræti/"
        },
        "nearby": [
            {
                "word": "rattlesnake",
                "pos": "noun"
            },
            {
                "word": "rattling",
                "pos": "adverb"
            },
            {
                "word": "ratty",
                "pos": "adjective"
            },
            {
                "word": "raucous",
                "pos": "adjective"
            },
            {
                "word": "raucously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "becoming angry very easily",
                    "vi": "rất dễ trở nên tức giận"
                },
                "examples": [
                    {
                        "en": "He gets ratty if he doesn't get enough sleep.",
                        "vi": "Anh ta sẽ cáu kỉnh nếu anh ta không ngủ đủ giấc."
                    }
                ]
            },
            {
                "define": {
                    "en": "in bad condition",
                    "vi": "trong điều kiện xấu"
                },
                "examples": [
                    {
                        "en": "long ratty hair",
                        "vi": "tóc dài màu lông chuột"
                    },
                    {
                        "en": "a ratty old pair of jeans",
                        "vi": "một chiếc quần jean cũ rách rưới"
                    }
                ]
            },
            {
                "define": {
                    "en": "looking like a rat",
                    "vi": "trông giống như một con chuột"
                },
                "examples": [
                    {
                        "en": "a ratty-looking man",
                        "vi": "một người đàn ông trông rất đáng yêu"
                    }
                ]
            }
        ]
    },
    {
        "id": "b7e7db9121604a549d5c6db8582ba1ab",
        "word": "rave",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪv/",
            "us": "/reɪv/"
        },
        "nearby": [
            {
                "word": "ravage",
                "pos": "verb"
            },
            {
                "word": "ravages",
                "pos": "noun"
            },
            {
                "word": "rave",
                "pos": "verb"
            },
            {
                "word": "rave",
                "pos": "noun"
            },
            {
                "word": "ravel",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk or write about something in a very enthusiastic way",
                    "vi": "nói hoặc viết về điều gì đó một cách rất nhiệt tình"
                },
                "examples": [
                    {
                        "en": "The critics raved about his performance in ‘Hamlet’.",
                        "vi": "Các nhà phê bình khen ngợi về màn trình diễn của anh ấy trong 'Hamlet'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout in a loud and emotional way at somebody because you are angry with them; to talk or shout in a way that is not logical or sensible",
                    "vi": "hét to và xúc động vào ai đó vì bạn tức giận với họ; nói hoặc la hét theo cách không logic hoặc hợp lý"
                },
                "examples": [
                    {
                        "en": "rave at somebody She was shouting and raving at them.",
                        "vi": "thịnh nộ với ai đó Cô ấy đang la hét và thịnh nộ với họ."
                    },
                    {
                        "en": "My parents both raved at me.",
                        "vi": "Cha mẹ tôi đều giận dữ với tôi."
                    },
                    {
                        "en": "He wandered the streets raving at passers-by.",
                        "vi": "Anh lang thang trên đường phố say sưa ngắm nhìn những người qua đường."
                    },
                    {
                        "en": "rave on (at somebody) (about something) He was still raving on about irresponsible youngsters.",
                        "vi": "say sưa nói về (tại ai đó) (về điều gì đó) Anh ấy vẫn say sưa nói về những người trẻ tuổi vô trách nhiệm."
                    },
                    {
                        "en": "+ speech ‘Never mind how he feels!’ Melissa raved.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are angry by shouting or complaining loudly for a long time",
                    "vi": "thể hiện rằng bạn đang tức giận bằng cách la hét hoặc phàn nàn lớn tiếng trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "She was ranting and raving about our stupidity.",
                        "vi": "Cô ấy đang giận dữ và giận dữ về sự ngu ngốc của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae6fa4a0365642c3bcf02a95de09d7eb",
        "word": "rile",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/raɪl/",
            "us": "/raɪl/"
        },
        "nearby": [
            {
                "word": "rig up",
                "pos": "phrasal verb"
            },
            {
                "word": "the Rig Veda",
                "pos": "noun"
            },
            {
                "word": "rile",
                "pos": "verb"
            },
            {
                "word": "Riley",
                "pos": "noun"
            },
            {
                "word": "rill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to annoy somebody or make them angry",
                    "vi": "làm phiền ai đó hoặc làm cho họ tức giận"
                },
                "examples": [
                    {
                        "en": "Nothing ever seemed to rile him.",
                        "vi": "Dường như không có gì có thể làm anh ấy sợ hãi."
                    },
                    {
                        "en": "She regretted at once that she had let herself become riled.",
                        "vi": "Cô hối hận ngay lập tức rằng cô đã để cho mình trở nên nổi loạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or get very annoyed",
                    "vi": "bị hoặc rất khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47d6839d1d464381a9aa353c60da0560",
        "word": "rip into",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "ripen",
                "pos": "verb"
            },
            {
                "word": "ripeness",
                "pos": "noun"
            },
            {
                "word": "rip into",
                "pos": "phrasal verb"
            },
            {
                "word": "Ripley's Believe It or Not",
                "pos": ""
            },
            {
                "word": "rip off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to criticize somebody and tell them that you are very angry with them",
                    "vi": "chỉ trích ai đó và nói với họ rằng bạn rất tức giận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go very quickly and violently into or through somebody/something",
                    "vi": "đi rất nhanh và dữ dội vào hoặc đi qua ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "A bullet ripped into his shoulder.",
                        "vi": "Một viên đạn găm vào vai anh."
                    },
                    {
                        "en": "An explosion ripped through their home.",
                        "vi": "Một vụ nổ đã xé toạc ngôi nhà của họ."
                    },
                    {
                        "en": "A huge fire ripped through the factory.",
                        "vi": "Một đám cháy lớn xé toạc nhà máy."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed561cd5589d4b5192d28229c884d648",
        "word": "roast",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rəʊst/",
            "us": "/rəʊst/"
        },
        "nearby": [
            {
                "word": "the roaring forties",
                "pos": "noun"
            },
            {
                "word": "the roaring twenties",
                "pos": "noun"
            },
            {
                "word": "roast",
                "pos": "verb"
            },
            {
                "word": "roast",
                "pos": "noun"
            },
            {
                "word": "roast",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cook food, especially meat, without liquid in an oven or over a fire; to be cooked in this way",
                    "vi": "để nấu thức ăn, đặc biệt là thịt, không có chất lỏng trong lò nướng hoặc trên lửa; được nấu theo cách này"
                },
                "examples": [
                    {
                        "en": "to roast a chicken",
                        "vi": "nướng một con gà"
                    },
                    {
                        "en": "The smell of roasting meat came from the kitchen.",
                        "vi": "Mùi thịt nướng bốc ra từ bếp."
                    },
                    {
                        "en": "You should boil the potatoes for a little before you roast them.",
                        "vi": "Bạn nên luộc khoai một chút trước khi nướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cook nuts, beans, etc. in order to dry them and turn them brown; to be cooked in this way",
                    "vi": "nấu các loại hạt, đậu, v.v. để chúng khô và chuyển sang màu nâu; được nấu theo cách này"
                },
                "examples": [
                    {
                        "en": "roasted chestnuts/coffee beans/peanuts",
                        "vi": "hạt dẻ / hạt cà phê / đậu phộng rang"
                    },
                    {
                        "en": "We spent the evening round the fire, talking and roasting chestnuts.",
                        "vi": "Chúng tôi đã dành cả buổi tối bên đống lửa, nói chuyện và rang hạt dẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very angry with somebody; to criticize somebody strongly",
                    "vi": "rất tức giận với ai đó; chỉ trích ai đó mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell unkind jokes about somebody, but in a friendly way, as a form of tribute (= praise or honour)",
                    "vi": "kể những câu chuyện cười không hay về ai đó, nhưng theo một cách thân thiện, như một hình thức tri ân (= khen ngợi hoặc tôn vinh)"
                },
                "examples": [
                    {
                        "en": "Other stars stepped forward to roast the veteran actor and comedian.",
                        "vi": "Các ngôi sao khác bước tới để vào viếng nam diễn viên, nghệ sĩ hài gạo cội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or to make something become very hot in the sun or by a fire",
                    "vi": "trở thành hoặc làm cho một cái gì đó trở nên rất nóng dưới ánh nắng mặt trời hoặc bởi một ngọn lửa"
                },
                "examples": [
                    {
                        "en": "She could feel her skin beginning to roast.",
                        "vi": "Cô có thể cảm thấy da mình bắt đầu nóng ran."
                    }
                ]
            }
        ]
    },
    {
        "id": "8171d9f8f8b543cda32d435b2057768e",
        "word": "row",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/raʊ/",
            "us": "/raʊ/"
        },
        "nearby": [
            {
                "word": "row1",
                "pos": "noun"
            },
            {
                "word": "row1",
                "pos": "verb"
            },
            {
                "word": "row2",
                "pos": "noun"
            },
            {
                "word": "row2",
                "pos": "verb"
            },
            {
                "word": "rowan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a serious argument between people, organizations, etc. about something",
                    "vi": "một cuộc tranh cãi nghiêm túc giữa mọi người, tổ chức, v.v. về điều gì đó"
                },
                "examples": [
                    {
                        "en": "A row has broken out over education.",
                        "vi": "Một hàng đã nổ ra về giáo dục."
                    }
                ]
            },
            {
                "define": {
                    "en": "a noisy argument between two or more people",
                    "vi": "một cuộc tranh cãi ồn ào giữa hai hoặc nhiều người"
                },
                "examples": [
                    {
                        "en": "She left him after a blazing row.",
                        "vi": "Cô ấy rời bỏ anh sau một cuộc đụng hàng rực lửa."
                    },
                    {
                        "en": "family rows",
                        "vi": "hàng gia đình"
                    },
                    {
                        "en": "He had a row with his son.",
                        "vi": "Anh ta đã có một cuộc cãi vã với con trai của mình."
                    },
                    {
                        "en": "Carol and I had a terrible row about how much money she spends.",
                        "vi": "Carol và tôi đã có một cuộc tranh cãi khủng khiếp về số tiền cô ấy tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a loud unpleasant noise",
                    "vi": "một tiếng ồn lớn khó chịu"
                },
                "examples": [
                    {
                        "en": "Who's making that row?",
                        "vi": "Ai là người tạo ra hàng đó?"
                    }
                ]
            }
        ]
    },
    {
        "id": "29445ddc4bb14749a2dea4f1b11edb4b",
        "word": "scene",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/siːn/",
            "us": "/siːn/"
        },
        "nearby": [
            {
                "word": "SCE",
                "pos": "abbreviation"
            },
            {
                "word": "scenario",
                "pos": "noun"
            },
            {
                "word": "scene",
                "pos": "noun"
            },
            {
                "word": "scene-of-crime",
                "pos": "adjective"
            },
            {
                "word": "scenery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where something happens, especially something unpleasant",
                    "vi": "nơi mà một cái gì đó xảy ra, đặc biệt là một cái gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "the scene of the accident/crime/crash",
                        "vi": "hiện trường của vụ tai nạn / tội phạm / vụ tai nạn"
                    },
                    {
                        "en": "The attacker fled the scene.",
                        "vi": "Kẻ tấn công đã bỏ trốn khỏi hiện trường."
                    },
                    {
                        "en": "Italy was the scene of many demonstrations at that time.",
                        "vi": "Ý là nơi diễn ra nhiều cuộc biểu tình lúc bấy giờ."
                    },
                    {
                        "en": "on the scene Firefighters arrived on the scene within minutes.",
                        "vi": "tại hiện trường Các nhân viên cứu hỏa đã đến hiện trường trong vòng vài phút."
                    },
                    {
                        "en": "at the scene Sadly the man died at the scene.",
                        "vi": "tại hiện trường Đáng buồn là người đàn ông đã chết tại hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or a situation that you see, especially one of a particular type",
                    "vi": "một sự kiện hoặc một tình huống mà bạn thấy, đặc biệt là một trong những loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The team's victory produced scenes of jubilation all over the country.",
                        "vi": "Chiến thắng của đội đã tạo ra những cảnh tượng tưng bừng trên khắp đất nước."
                    },
                    {
                        "en": "a scene of devastation/carnage",
                        "vi": "một cảnh tượng tàn phá / tàn sát"
                    },
                    {
                        "en": "She witnessed some very distressing scenes.",
                        "vi": "Cô đã chứng kiến một số cảnh rất đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a film, play or book in which the action happens in one place or is of one particular type",
                    "vi": "một phần của phim, vở kịch hoặc cuốn sách trong đó hành động xảy ra ở một nơi hoặc thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "sex/fight/action/battle scenes",
                        "vi": "cảnh quan hệ tình dục / chiến đấu / hành động / chiến đấu"
                    },
                    {
                        "en": "deleted scenes (= ones that were not included in the final version)",
                        "vi": "những cảnh đã xóa (= những cảnh không có trong phiên bản cuối cùng)"
                    },
                    {
                        "en": "to film/shoot a scene",
                        "vi": "quay phim / quay một cảnh"
                    },
                    {
                        "en": "They shot the opening scene 15 times.",
                        "vi": "Họ đã quay cảnh mở đầu 15 lần."
                    },
                    {
                        "en": "I got very nervous before my big scene (= the one where I have a very important part).",
                        "vi": "Tôi đã rất lo lắng trước cảnh quay lớn của mình (= cảnh mà tôi có một phần rất quan trọng)."
                    },
                    {
                        "en": "The scene where he arrives at the factory is the turning point in the book.",
                        "vi": "Cảnh anh đến nhà máy là bước ngoặt của cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the small sections that a play or an opera is divided into",
                    "vi": "một trong những phần nhỏ mà vở kịch hoặc một vở opera được chia thành"
                },
                "examples": [
                    {
                        "en": "Act I, Scene 2 of ‘Macbeth’",
                        "vi": "Act I, Scene 2 of 'Macbeth'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area of activity or way of life and the people who are part of it",
                    "vi": "một lĩnh vực hoạt động hoặc cách sống cụ thể và những người là một phần của nó"
                },
                "examples": [
                    {
                        "en": "the art/club/punk scene",
                        "vi": "bối cảnh nghệ thuật / câu lạc bộ / punk"
                    },
                    {
                        "en": "on the… scene a newcomer on the music scene",
                        "vi": "trên sân khấu… một người mới trên sân khấu âm nhạc"
                    },
                    {
                        "en": "British players were finding it increasingly difficult to compete on the international scene.",
                        "vi": "Các cầu thủ Anh ngày càng gặp khó khăn khi thi đấu trên đấu trường quốc tế."
                    },
                    {
                        "en": "Tarantino burst onto the cinema scene in the ’90s.",
                        "vi": "Tarantino bùng nổ trên sân khấu điện ảnh vào những năm 90."
                    },
                    {
                        "en": "After years at the top, she just vanished from the scene.",
                        "vi": "Sau nhiều năm ở đỉnh cao, cô ấy biến mất khỏi hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a view that you see",
                    "vi": "một cái nhìn mà bạn thấy"
                },
                "examples": [
                    {
                        "en": "a delightful rural scene",
                        "vi": "một cảnh nông thôn thú vị"
                    },
                    {
                        "en": "They went abroad for a change of scene (= to see and experience new surroundings).",
                        "vi": "Họ ra nước ngoài để thay đổi bối cảnh (= để xem và trải nghiệm môi trường xung quanh mới)."
                    },
                    {
                        "en": "We stood and surveyed the scene.",
                        "vi": "Chúng tôi đã đứng và khảo sát hiện trường."
                    },
                    {
                        "en": "I stared out of the window of the train on the ever-changing scene.",
                        "vi": "Tôi nhìn chằm chằm ra ngoài cửa sổ của toa tàu về khung cảnh luôn thay đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a painting, drawing, or photograph of a place and the things that are happening there",
                    "vi": "một bức tranh, bản vẽ hoặc ảnh chụp một địa điểm và những điều đang diễn ra ở đó"
                },
                "examples": [
                    {
                        "en": "an exhibition of Parisian street scenes",
                        "vi": "triển lãm cảnh đường phố Paris"
                    },
                    {
                        "en": "He painted scenes of country life.",
                        "vi": "Anh vẽ những cảnh sinh hoạt đồng quê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a loud, angry argument, especially one that happens in public and is embarrassing",
                    "vi": "một cuộc tranh cãi ồn ào và tức giận, đặc biệt là một cuộc tranh cãi xảy ra ở nơi công cộng và đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "She had made a scene in the middle of the party.",
                        "vi": "Cô ấy đã thực hiện một cảnh ở giữa bữa tiệc."
                    },
                    {
                        "en": "‘Please leave,’ he said. ‘I don't want a scene.’",
                        "vi": "“Xin hãy rời khỏi đây,” anh ta nói. 'Tôi không muốn một cảnh.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "in the part of a theatre, etc. that the public does not usually see",
                    "vi": "trong một phần của nhà hát, v.v. mà công chúng thường không nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The students were able to go behind the scenes to see how programmes are made.",
                        "vi": "Các sinh viên có thể đến hậu trường để xem các chương trình được thực hiện như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that people in general are not aware of",
                    "vi": "theo cách mà mọi người nói chung không nhận thức được"
                },
                "examples": [
                    {
                        "en": "A lot of negotiating has been going on behind the scenes.",
                        "vi": "Rất nhiều cuộc đàm phán đã được diễn ra ở hậu trường."
                    },
                    {
                        "en": "behind-the-scenes work",
                        "vi": "công việc hậu trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "not the type of thing that somebody likes or enjoys doing",
                    "vi": "không phải kiểu mà ai đó thích hoặc thích làm"
                },
                "examples": [
                    {
                        "en": "Hillwalking is not my scene, so I stayed at home.",
                        "vi": "Trượt đồi không phải là cảnh của tôi, vì vậy tôi đã ở nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a situation in which something can easily happen or develop",
                    "vi": "để tạo ra một tình huống trong đó điều gì đó có thể dễ dàng xảy ra hoặc phát triển"
                },
                "examples": [
                    {
                        "en": "His arrival set the scene for another argument.",
                        "vi": "Sự xuất hiện của anh ta đã tạo ra bối cảnh cho một cuộc tranh cãi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the information and details they need in order to understand what comes next",
                    "vi": "cung cấp cho ai đó thông tin và chi tiết họ cần để hiểu điều gì xảy ra tiếp theo"
                },
                "examples": [
                    {
                        "en": "The first part of the programme was just setting the scene.",
                        "vi": "Phần đầu tiên của chương trình chỉ là dựng cảnh."
                    },
                    {
                        "en": "The scene is set in the first paragraph with an account of Sally's childhood.",
                        "vi": "Bối cảnh được đặt ở đoạn đầu tiên kể về thời thơ ấu của Sally."
                    }
                ]
            }
        ]
    },
    {
        "id": "05f7da29dde54aea9005405ce8a260d8",
        "word": "see red",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/red/",
            "us": "/red/"
        },
        "nearby": [
            {
                "word": "recycling",
                "pos": "noun"
            },
            {
                "word": "red",
                "pos": "adjective"
            },
            {
                "word": "red",
                "pos": "noun"
            },
            {
                "word": "Red",
                "pos": ""
            },
            {
                "word": "redact",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the colour of blood or fire",
                    "vi": "màu của máu hoặc lửa"
                },
                "examples": [
                    {
                        "en": "She often wears red.",
                        "vi": "Cô ấy thường mặc đồ màu đỏ."
                    },
                    {
                        "en": "The woman blushed a deep shade of red.",
                        "vi": "Người phụ nữ ửng lên một màu đỏ đậm."
                    },
                    {
                        "en": "red of something the bright red of her blouse",
                        "vi": "màu đỏ của cái gì đó màu đỏ tươi của chiếc áo cánh của cô ấy"
                    },
                    {
                        "en": "the reds and browns of the woods in the fall (= of the leaves)",
                        "vi": "màu đỏ và nâu của rừng vào mùa thu (= của lá)"
                    },
                    {
                        "en": "I've marked the corrections in red (= in red ink).",
                        "vi": "Tôi đã đánh dấu các chỉnh sửa bằng màu đỏ (= bằng mực đỏ)."
                    },
                    {
                        "en": "The traffic lights were on red.",
                        "vi": "Đèn giao thông đã sáng đỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "red wine",
                    "vi": "rượu vang đỏ"
                },
                "examples": [
                    {
                        "en": "Would you prefer red or white?",
                        "vi": "Bạn thích màu đỏ hay màu trắng?"
                    },
                    {
                        "en": "an Italian red",
                        "vi": "một màu đỏ Ý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person with very left-wing political opinions",
                    "vi": "một người có quan điểm chính trị rất cánh tả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to owe money to your bank because you have spent more than you have in your account",
                    "vi": "nợ ngân hàng của bạn bởi vì bạn đã tiêu nhiều hơn số tiền bạn có trong tài khoản của mình"
                },
                "examples": [
                    {
                        "en": "The company has plunged $37 million into the red.",
                        "vi": "Công ty đã lao dốc 37 triệu đô la Mỹ."
                    },
                    {
                        "en": "My account is $100 in the red.",
                        "vi": "Tài khoản của tôi là 100 đô la màu đỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very angry",
                    "vi": "trở nên rất tức giận"
                },
                "examples": [
                    {
                        "en": "People who drop litter make me see red.",
                        "vi": "Những người thả rác bừa bãi khiến tôi thấy đỏ mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c2764aeb956497b856a02b3f5730d5c",
        "word": "seethe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/siːð/",
            "us": "/siːð/"
        },
        "nearby": [
            {
                "word": "seersucker",
                "pos": "noun"
            },
            {
                "word": "see-saw",
                "pos": "noun"
            },
            {
                "word": "seethe",
                "pos": "verb"
            },
            {
                "word": "see through",
                "pos": "phrasal verb"
            },
            {
                "word": "see-through",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be extremely angry about something but to try not to show other people how angry you are",
                    "vi": "cực kỳ tức giận về điều gì đó nhưng cố gắng không cho người khác thấy bạn tức giận như thế nào"
                },
                "examples": [
                    {
                        "en": "She seethed silently in the corner.",
                        "vi": "Cô lặng lẽ sôi sục trong góc."
                    },
                    {
                        "en": "seethe with something He marched off, seething with frustration.",
                        "vi": "sôi sục với một cái gì đó."
                    },
                    {
                        "en": "seethe at something Inwardly he was seething at this challenge to his authority.",
                        "vi": "sôi sục trước điều gì đó Trong nội tâm anh ta sôi sục trước thách thức này đối với quyền lực của mình."
                    },
                    {
                        "en": "She was seething at the insult.",
                        "vi": "Cô ấy đang sôi sục trước sự xúc phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be full of a lot of people or animals, especially when they are all moving around",
                    "vi": "có rất nhiều người hoặc động vật, đặc biệt là khi tất cả họ đang di chuyển xung quanh"
                },
                "examples": [
                    {
                        "en": "The resort is seething with tourists all year round.",
                        "vi": "Khu nghỉ mát này luôn sôi sục với khách du lịch quanh năm."
                    },
                    {
                        "en": "He became caught up in a seething mass of arms and legs.",
                        "vi": "Anh ta bị cuốn vào một đống tay và chân sôi sục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move around quickly and violently",
                    "vi": "di chuyển xung quanh một cách nhanh chóng và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "The grey ocean seethed beneath them.",
                        "vi": "Đại dương xám xịt sôi sục bên dưới họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f3cadde557145e186dddaa445a3458b",
        "word": "shirty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɜːti/",
            "us": "/ˈʃɜːrti/"
        },
        "nearby": [
            {
                "word": "shirtsleeve",
                "pos": "noun"
            },
            {
                "word": "shirt tail",
                "pos": "noun"
            },
            {
                "word": "shirty",
                "pos": "adjective"
            },
            {
                "word": "shisha",
                "pos": "noun"
            },
            {
                "word": "shish kebab",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "angry or annoyed with somebody about something, and acting in a rude way",
                    "vi": "tức giận hoặc khó chịu với ai đó về điều gì đó và hành động một cách thô lỗ"
                },
                "examples": [
                    {
                        "en": "Don’t get shirty with me—I was only trying to help!",
                        "vi": "Đừng có lố với tôi — tôi chỉ đang cố gắng giúp đỡ!"
                    }
                ]
            }
        ]
    },
    {
        "id": "9e3c36bf51f04358b3f7c8a281922eaf",
        "word": "short-fused",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃɔːt ˈfjuːzd/",
            "us": "/ˌʃɔːrt ˈfjuːzd/"
        },
        "nearby": [
            {
                "word": "shortening",
                "pos": "noun"
            },
            {
                "word": "shortfall",
                "pos": "noun"
            },
            {
                "word": "short-fused",
                "pos": "adjective"
            },
            {
                "word": "shorthair",
                "pos": "noun"
            },
            {
                "word": "shorthand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "likely to become angry very easily",
                    "vi": "có khả năng trở nên tức giận rất dễ dàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "879777deaf814f01a07785504f3a39ef",
        "word": "short-tempered",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃɔːt ˈtempəd/",
            "us": "/ˌʃɔːrt ˈtempərd/"
        },
        "nearby": [
            {
                "word": "shortstop",
                "pos": "noun"
            },
            {
                "word": "short story",
                "pos": "noun"
            },
            {
                "word": "short-tempered",
                "pos": "adjective"
            },
            {
                "word": "short-term",
                "pos": "adjective"
            },
            {
                "word": "short-termism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tending to become angry very quickly and easily",
                    "vi": "có xu hướng trở nên tức giận rất nhanh chóng và dễ dàng"
                },
                "examples": [
                    {
                        "en": "Being tired makes me very short-tempered.",
                        "vi": "Mệt mỏi khiến tôi rất nóng tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c929adc33d740b48096cbc200921e0a",
        "word": "snap",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/snæp/",
            "us": "/snæp/"
        },
        "nearby": [
            {
                "word": "snakeskin",
                "pos": "noun"
            },
            {
                "word": "snaky",
                "pos": "adjective"
            },
            {
                "word": "snap",
                "pos": "verb"
            },
            {
                "word": "snap",
                "pos": "noun"
            },
            {
                "word": "snap",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to break something suddenly with a sharp noise; to be broken in this way",
                    "vi": "để phá vỡ một cái gì đó đột ngột với một tiếng động mạnh; bị phá vỡ theo cách này"
                },
                "examples": [
                    {
                        "en": "snap something The wind had snapped the tree in two.",
                        "vi": "búng cái gì đó Gió đã bẻ đôi cái cây."
                    },
                    {
                        "en": "snap something off (something) He snapped a twig off a bush.",
                        "vi": "búng một cái gì đó ra (cái gì đó) Anh ta búng một cành cây khỏi một bụi cây."
                    },
                    {
                        "en": "snap (off) Suddenly, the rope snapped.",
                        "vi": "snap (tắt) Đột nhiên, sợi dây bị đứt."
                    },
                    {
                        "en": "The branch she was standing on must have snapped off.",
                        "vi": "Cành cây cô ấy đang đứng chắc đã bị gãy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a photograph",
                    "vi": "để chụp ảnh"
                },
                "examples": [
                    {
                        "en": "snap something A passing tourist snapped the incident.",
                        "vi": "snap cái gì đó Một du khách đi ngang qua đã chụp được sự cố."
                    },
                    {
                        "en": "snap (away) She seemed oblivious to the crowds of photographers snapping away.",
                        "vi": "snap (đi) Cô ấy dường như không để ý đến đám đông các nhiếp ảnh gia đang chụp lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, or to move something, into a particular position quickly, especially with a sudden sharp noise",
                    "vi": "để di chuyển hoặc để di chuyển một cái gì đó, vào một vị trí cụ thể một cách nhanh chóng, đặc biệt là khi có tiếng ồn đột ngột"
                },
                "examples": [
                    {
                        "en": "+ adj. The lid snapped shut.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "His eyes snapped open.",
                        "vi": "Mắt anh mở trừng trừng."
                    },
                    {
                        "en": "+ adv./prep. He snapped to attention and saluted.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The plastic pieces snap together to make a replica of a dinosaur.",
                        "vi": "Các mảnh nhựa ghép lại với nhau để tạo thành bản sao của một con khủng long."
                    },
                    {
                        "en": "snap something + adj. She snapped the bag shut.",
                        "vi": "chụp cái gì đó + adj. Cô ấy đóng chặt chiếc túi lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak or say something in an impatient, usually angry, voice",
                    "vi": "nói hoặc nói điều gì đó với giọng thiếu kiên nhẫn, thường là tức giận"
                },
                "examples": [
                    {
                        "en": "+ speech ‘Don't just stand there,’ she snapped.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "snap (at somebody) I was tempted to snap back angrily at him.",
                        "vi": "búng tay (vào ai đó) Tôi đã muốn chụp lại anh ta một cách giận dữ."
                    },
                    {
                        "en": "snap something He snapped a reply.",
                        "vi": "snap cái gì đó Anh ấy snap một câu trả lời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to bite somebody/something",
                    "vi": "cố gắng cắn ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The dogs snarled and snapped at our heels.",
                        "vi": "Những con chó gầm gừ và ngoạm gót chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly be unable to control your feelings any longer because the situation has become too difficult",
                    "vi": "đột nhiên không thể kiểm soát cảm xúc của mình nữa vì tình hình đã trở nên quá khó khăn"
                },
                "examples": [
                    {
                        "en": "My patience finally snapped.",
                        "vi": "Sự kiên nhẫn của tôi cuối cùng đã thành công."
                    },
                    {
                        "en": "When he said that, something snapped inside her.",
                        "vi": "Khi anh nói điều đó, một cái gì đó chộp vào trong cô."
                    },
                    {
                        "en": "And that did it. I snapped.",
                        "vi": "Và điều đó đã làm được. Tôi cáu kỉnh."
                    },
                    {
                        "en": "I guess he just snapped.",
                        "vi": "Tôi đoán anh ta chỉ bị bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fasten a piece of clothing with a snap",
                    "vi": "buộc chặt một mảnh quần áo chỉ trong tích tắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start play by passing the ball back between your legs",
                    "vi": "bắt đầu chơi bằng cách chuyền bóng trở lại giữa hai chân của bạn"
                },
                "examples": [
                    {
                        "en": "Time will not be resumed until the ball is snapped on the next play.",
                        "vi": "Thời gian sẽ không được tiếp tục cho đến khi bóng được bắt ở lượt chơi tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout at somebody in an angry way, especially without reason",
                    "vi": "hét vào mặt ai đó một cách tức giận, đặc biệt là không có lý do"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a sharp noise by moving your second or third finger quickly against your thumb, to attract somebody’s attention, or to mark the beat of music, for example",
                    "vi": "để tạo ra âm thanh rõ ràng bằng cách di chuyển nhanh ngón tay thứ hai hoặc thứ ba so với ngón tay cái của bạn, để thu hút sự chú ý của ai đó hoặc để đánh dấu nhịp điệu của âm nhạc, chẳng hạn như"
                },
                "examples": [
                    {
                        "en": "He snapped his fingers for the waiter to bring more wine.",
                        "vi": "Anh búng tay để người phục vụ mang thêm rượu."
                    },
                    {
                        "en": "He snapped his fingers and the waiter came running.",
                        "vi": "Anh ta búng tay và người phục vụ chạy đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an effort to stop feeling unhappy or depressed; to help somebody to stop feeling unhappy",
                    "vi": "nỗ lực để ngừng cảm thấy không vui hoặc chán nản; để giúp ai đó ngừng cảm thấy không vui"
                },
                "examples": [
                    {
                        "en": "You've been depressed for weeks. It's time you snapped out of it.",
                        "vi": "Bạn đã bị trầm cảm trong nhiều tuần. Đã đến lúc bạn thoát khỏi nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used, especially in orders, to tell somebody to start working harder or more quickly",
                    "vi": "được sử dụng, đặc biệt là trong các đơn đặt hàng, để nói với ai đó bắt đầu làm việc chăm chỉ hơn hoặc nhanh hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c9f62a5ea60a40aeb521df69e1d12b96",
        "word": "snarl",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/snɑːl/",
            "us": "/snɑːrl/"
        },
        "nearby": [
            {
                "word": "snark",
                "pos": "noun"
            },
            {
                "word": "snarky",
                "pos": "adjective"
            },
            {
                "word": "snarl",
                "pos": "verb"
            },
            {
                "word": "snarl",
                "pos": "noun"
            },
            {
                "word": "snarl up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show the teeth and make a deep angry noise in the throat",
                    "vi": "nhe răng và tạo ra một tiếng động tức giận sâu trong cổ họng"
                },
                "examples": [
                    {
                        "en": "The dog snarled at us.",
                        "vi": "Con chó gầm gừ với chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak in a rough, low, angry voice",
                    "vi": "nói bằng một giọng thô bạo, trầm và tức giận"
                },
                "examples": [
                    {
                        "en": "+ speech (at somebody) ‘Get out of here!’ he snarled.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "snarl something (at somebody) She snarled abuse at anyone who happened to walk past.",
                        "vi": "Cô ấy gầm gừ điều gì đó (với ai đó) Cô ấy gầm gừ lạm dụng với bất kỳ ai tình cờ đi ngang qua."
                    },
                    {
                        "en": "snarl (at somebody) He snarled savagely at her.",
                        "vi": "gầm gừ (với ai đó) Anh ta gầm gừ dã man với cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "3074435f78504b279ea2b7e36f49eb21",
        "word": "somebody’s blood is up",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/blʌd/",
            "us": "/blʌd/"
        },
        "nearby": [
            {
                "word": "blonde",
                "pos": "noun"
            },
            {
                "word": "Blondie",
                "pos": ""
            },
            {
                "word": "blood",
                "pos": "noun"
            },
            {
                "word": "blood",
                "pos": "verb"
            },
            {
                "word": "blood bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red liquid that flows through the bodies of humans and animals",
                    "vi": "chất lỏng màu đỏ chảy qua cơ thể người và động vật"
                },
                "examples": [
                    {
                        "en": "He lost a lot of blood in the accident.",
                        "vi": "Anh ấy mất rất nhiều máu trong vụ tai nạn."
                    },
                    {
                        "en": "Blood was pouring out of a cut on her head.",
                        "vi": "Máu tuôn ra từ vết cắt trên đầu cô."
                    },
                    {
                        "en": "His hands were covered in blood.",
                        "vi": "Tay anh bê bết máu."
                    },
                    {
                        "en": "to give blood (= to have blood taken from you so that it can be used in the medical treatment of other people)",
                        "vi": "cho máu (= lấy máu từ bạn để nó có thể được sử dụng trong việc điều trị y tế cho người khác)"
                    },
                    {
                        "en": "After the attacks, people donated blood in record numbers.",
                        "vi": "Sau các vụ tấn công, người dân đã hiến máu với số lượng kỷ lục."
                    },
                    {
                        "en": "He was a hot-headed warrior, always too quick to shed blood (= attack and injure or kill somebody).",
                        "vi": "Anh ta là một chiến binh nóng nảy, luôn đổ máu quá nhanh (= tấn công và làm bị thương hoặc giết ai đó)."
                    },
                    {
                        "en": "to draw blood (= to wound a person so that they lose blood)",
                        "vi": "để lấy máu (= làm vết thương một người để họ mất máu)"
                    },
                    {
                        "en": "a drop/pool of blood",
                        "vi": "một giọt / vũng máu"
                    },
                    {
                        "en": "There was dried blood on her cheek.",
                        "vi": "Có vết máu khô trên má cô."
                    },
                    {
                        "en": "a blood cell/sample",
                        "vi": "một tế bào máu / mẫu"
                    },
                    {
                        "en": "to improve blood flow to the heart",
                        "vi": "cải thiện lưu lượng máu đến tim"
                    },
                    {
                        "en": "the blood supply to the brain",
                        "vi": "cung cấp máu cho não"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of blood mentioned",
                    "vi": "có nhóm máu được đề cập"
                },
                "examples": [
                    {
                        "en": "cold-blooded reptiles",
                        "vi": "loài bò sát máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "family origins",
                    "vi": "nguồn gốc gia đình"
                },
                "examples": [
                    {
                        "en": "She is of noble blood.",
                        "vi": "Cô ấy thuộc dòng máu quý tộc."
                    },
                    {
                        "en": "There is some Polish blood on his father's side.",
                        "vi": "Có chút dòng máu Ba Lan bên cha anh."
                    },
                    {
                        "en": "I doubt if I have a single drop of aristocratic blood in my veins.",
                        "vi": "Tôi nghi ngờ liệu mình có một giọt máu quý tộc trong huyết quản hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and fashionable man",
                    "vi": "một người đàn ông giàu có và thời trang"
                },
                "examples": [
                    {
                        "en": "a young blood",
                        "vi": "một dòng máu trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of hate or strong dislike",
                    "vi": "cảm giác ghét hoặc không thích mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody and want to hurt or punish them",
                    "vi": "tức giận với ai đó và muốn làm tổn thương hoặc trừng phạt họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a natural part of your character and of the character of other members of your family",
                    "vi": "trở thành một phần tự nhiên trong tính cách của bạn và tính cách của các thành viên khác trong gia đình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "family relationships are stronger than any others",
                    "vi": "mối quan hệ gia đình bền chặt hơn bất kỳ mối quan hệ nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody is very angry and ready to argue or fight",
                    "vi": "ai đó rất tức giận và sẵn sàng tranh luận hoặc chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hard work; a lot of effort",
                    "vi": "làm việc rất chăm chỉ; nhiều sự cố gắng"
                },
                "examples": [
                    {
                        "en": "The only way to succeed is through old-fashioned blood, sweat and tears.",
                        "vi": "Cách duy nhất để thành công là thông qua máu, mồ hôi và nước mắt của người già."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "almost impossible to obtain",
                    "vi": "hầu như không thể có được"
                },
                "examples": [
                    {
                        "en": "Getting an apology from him was like getting blood from a stone.",
                        "vi": "Nhận được một lời xin lỗi từ anh ấy giống như nhận được một hòn đá hộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody extremely angry",
                    "vi": "làm cho ai đó cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "The way he treats his employees really makes my blood boil.",
                        "vi": "Cách anh ấy đối xử với nhân viên thực sự khiến tôi sôi máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "new members or employees, especially young ones, with new ideas or ways of doing things",
                    "vi": "các thành viên hoặc nhân viên mới, đặc biệt là những người trẻ tuổi, với những ý tưởng hoặc cách làm mới"
                },
                "examples": [
                    {
                        "en": "This company badly needs to bring in some new blood.",
                        "vi": "Công ty này rất cần phải mang thêm một lượng máu mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill or wound somebody",
                    "vi": "giết hoặc làm bị thương ai đó"
                },
                "examples": [
                    {
                        "en": "Nothing can justify spilling innocent blood.",
                        "vi": "Không gì có thể biện minh cho việc đổ máu vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody excited",
                    "vi": "để làm cho ai đó phấn khích"
                },
                "examples": [
                    {
                        "en": "The atmosphere in a theatre never failed to stir her blood.",
                        "vi": "Bầu không khí trong rạp chiếu phim không bao giờ không khuấy động được máu của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": [
                    {
                        "en": "I sweated blood to get everything ready in time.",
                        "vi": "Tôi đổ mồ hôi máu để chuẩn bị mọi thứ kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "fbfa68cc23ee4fb7a7ef7d453ebc43f2",
        "word": "somebody’s face is like thunder",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/feɪs/",
            "us": "/feɪs/"
        },
        "nearby": [
            {
                "word": "fabulously",
                "pos": "adverb"
            },
            {
                "word": "facade",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            },
            {
                "word": "Facebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of the head, where the eyes, nose and mouth are",
                    "vi": "phần trước của đầu, nơi có mắt, mũi và miệng"
                },
                "examples": [
                    {
                        "en": "a pretty/pale/round face",
                        "vi": "một khuôn mặt xinh xắn / nhợt nhạt / tròn trịa"
                    },
                    {
                        "en": "He buried his face in his hands.",
                        "vi": "Anh vùi mặt vào tay mình."
                    },
                    {
                        "en": "to hide/cover your face",
                        "vi": "để ẩn / che khuôn mặt của bạn"
                    },
                    {
                        "en": "on somebody's face You should have seen the look on her face when I told her!",
                        "vi": "trên khuôn mặt của ai đó Bạn nên nhìn thấy vẻ mặt của cô ấy khi tôi nói với cô ấy!"
                    },
                    {
                        "en": "The expression on his face never changed.",
                        "vi": "Biểu cảm trên mặt anh ta không hề thay đổi."
                    },
                    {
                        "en": "in the face She was red in the face with embarrassment.",
                        "vi": "vào mặt Cô ấy đỏ mặt vì xấu hổ."
                    },
                    {
                        "en": "At that time, her face was on the covers of all the magazines.",
                        "vi": "Vào thời điểm đó, gương mặt của cô ấy đã xuất hiện trên trang bìa của tất cả các tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "an expression that is shown on somebody’s face",
                    "vi": "một biểu cảm được thể hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "a smiling/happy/sad face",
                        "vi": "một khuôn mặt tươi cười / hạnh phúc / buồn bã"
                    },
                    {
                        "en": "Her face lit up (= showed happiness) when she spoke of the past.",
                        "vi": "Mặt cô ấy sáng lên (= thể hiện sự hạnh phúc) khi cô ấy nói về quá khứ."
                    },
                    {
                        "en": "His face fell (= showed disappointment, sadness, etc.) when he read the headlines.",
                        "vi": "Mặt anh ấy xịu xuống (= thể hiện sự thất vọng, buồn bã, v.v.) khi đọc các tiêu đề."
                    },
                    {
                        "en": "I could tell by his face it hadn't gone well.",
                        "vi": "Tôi có thể nhận ra bằng khuôn mặt của anh ấy rằng mọi chuyện đã không diễn ra tốt đẹp."
                    },
                    {
                        "en": "Sue's face was a picture (= she looked very surprised, angry, etc.) as she listened to her husband's speech.",
                        "vi": "Khuôn mặt của Sue như một bức tranh (= cô ấy trông rất ngạc nhiên, tức giận, v.v.) khi cô ấy lắng nghe bài phát biểu của chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person of the type mentioned",
                    "vi": "được sử dụng để chỉ một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She looked around for a familiar face.",
                        "vi": "Cô nhìn xung quanh để tìm một khuôn mặt quen thuộc."
                    },
                    {
                        "en": "He's a fresh face (= somebody new) at the company.",
                        "vi": "Anh ấy là một gương mặt tươi tắn (= ai đó mới) ở công ty."
                    },
                    {
                        "en": "It's nice to see some new faces here this evening.",
                        "vi": "Thật vui khi thấy một số gương mặt mới ở đây vào tối nay."
                    },
                    {
                        "en": "The movie is full of famous faces.",
                        "vi": "Phim quy tụ đầy đủ các gương mặt nổi tiếng."
                    },
                    {
                        "en": "a well-known face on our television screens",
                        "vi": "một gương mặt nổi tiếng trên màn hình tivi của chúng ta"
                    },
                    {
                        "en": "I'm tired of seeing the same old faces every time we go out!",
                        "vi": "Tôi mệt mỏi khi nhìn thấy những khuôn mặt cũ giống nhau mỗi khi chúng tôi đi chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of face or expression mentioned",
                    "vi": "có kiểu khuôn mặt hoặc biểu cảm được đề cập"
                },
                "examples": [
                    {
                        "en": "pale-faced",
                        "vi": "mặt tái mét"
                    },
                    {
                        "en": "a freckle-faced boy",
                        "vi": "một cậu bé mặt tàn nhang"
                    },
                    {
                        "en": "grim-faced",
                        "vi": "mặt dữ tợn"
                    },
                    {
                        "en": "a sad-faced woman",
                        "vi": "một người phụ nữ có khuôn mặt buồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a side or surface of something",
                    "vi": "một mặt hoặc bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the north face of the mountain",
                        "vi": "mặt phía bắc của ngọn núi"
                    },
                    {
                        "en": "the dark face of the moon",
                        "vi": "mặt trăng bóng tối"
                    },
                    {
                        "en": "A steep path zigzags down the cliff face.",
                        "vi": "Một con đường dốc ngoằn ngoèo xuống mặt vách đá."
                    },
                    {
                        "en": "We could see tiny figures climbing the rock face.",
                        "vi": "Chúng tôi có thể nhìn thấy những hình người nhỏ bé đang leo lên mặt đá."
                    },
                    {
                        "en": "Ivy covered the front face of the house.",
                        "vi": "Cây thường xuân che mặt trước của ngôi nhà."
                    },
                    {
                        "en": "A banner hung across the face of the building.",
                        "vi": "Một biểu ngữ được treo trên mặt của tòa nhà."
                    },
                    {
                        "en": "How many faces does a cube have?",
                        "vi": "Hình lập phương có bao nhiêu mặt?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a clock or watch",
                    "vi": "phần trước của đồng hồ hoặc đồng hồ đeo tay"
                },
                "examples": [
                    {
                        "en": "a dial like the face of a clock",
                        "vi": "một mặt số giống như mặt đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular character of something",
                    "vi": "nhân vật cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "face of something the changing face of Britain",
                        "vi": "đối mặt với một cái gì đó thay đổi bộ mặt của nước Anh"
                    },
                    {
                        "en": "This discovery changed the whole face of science.",
                        "vi": "Khám phá này đã thay đổi toàn bộ bộ mặt của khoa học."
                    },
                    {
                        "en": "with a… face bureaucracy with a human face",
                        "vi": "với một… bộ mặt quan liêu với một khuôn mặt của con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular aspect of something",
                    "vi": "một khía cạnh cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social deprivation is the unacceptable face of capitalism.",
                        "vi": "Sự thiếu thốn về mặt xã hội là bộ mặt không thể chấp nhận được của chủ nghĩa tư bản."
                    },
                    {
                        "en": "He has become the public face of the company.",
                        "vi": "Anh ấy đã trở thành gương mặt đại diện cho công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that you have failed to see, even though it was obvious and should have been easy to see",
                    "vi": "được sử dụng để mô tả một cái gì đó mà bạn không thể nhìn thấy, mặc dù nó rõ ràng và đáng lẽ phải dễ dàng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The answer was staring us in the face but we never saw it until it was too late.",
                        "vi": "Câu trả lời đang nhìn chằm chằm vào mặt chúng tôi nhưng chúng tôi không bao giờ nhìn thấy nó cho đến khi quá muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be certain to happen",
                    "vi": "chắc chắn sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Defeat was staring them in the face.",
                        "vi": "Thất bại đang nhìn chằm chằm vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to avoid something",
                    "vi": "không thể tránh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They were staring defeat in the face.",
                        "vi": "Họ đang nhìn chằm chằm vào thất bại khi đối mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious to other people from the expression on somebody’s face",
                    "vi": "rất rõ ràng đối với người khác từ biểu hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "Guilt was written all over his face.",
                        "vi": "Cảm giác tội lỗi hiện rõ trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a plan, etc. blows up in your face, it goes badly wrong in a way that causes you damage or makes you feel embarrassed",
                    "vi": "nếu một kế hoạch, v.v. thổi vào mặt bạn, nó sẽ trở nên sai lầm nghiêm trọng theo hướng khiến bạn thiệt hại hoặc khiến bạn cảm thấy xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something when you are angry that is meant to harm somebody else but that also harms you",
                    "vi": "làm điều gì đó khi bạn tức giận có nghĩa là để làm hại người khác nhưng điều đó cũng gây hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear completely",
                    "vi": "biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Keep looking—they can't just have vanished off the face of the earth.",
                        "vi": "Hãy tiếp tục tìm kiếm — chúng không thể biến mất khỏi mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something as hard and as long as you possibly can but without success",
                    "vi": "cố gắng làm điều gì đó khó và miễn là bạn có thể nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "You can argue till you're blue in the face, but you won't change my mind.",
                        "vi": "Bạn có thể tranh luận cho đến khi bạn xanh mặt, nhưng bạn sẽ không thay đổi ý kiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will/will not get a particular job or position because they have/do not have the appearance, personality, etc. that the employer wants, even when this should not be important",
                    "vi": "được sử dụng để nói rằng ai đó sẽ / sẽ không nhận được một công việc hoặc vị trí cụ thể bởi vì họ có / không có ngoại hình, tính cách, v.v. mà nhà tuyển dụng mong muốn, ngay cả khi điều này không quan trọng"
                },
                "examples": [
                    {
                        "en": "If your face fits, you'll get the job.",
                        "vi": "Nếu khuôn mặt của bạn phù hợp, bạn sẽ nhận được công việc."
                    },
                    {
                        "en": "It doesn't matter how well qualified you are; if your face doesn't fit, you don't stand a chance.",
                        "vi": "Không quan trọng là bạn có đủ điều kiện như thế nào; nếu khuôn mặt của bạn không phù hợp, bạn không có cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody looks very angry",
                    "vi": "ai đó trông rất tức giận"
                },
                "examples": [
                    {
                        "en": "Mr Hibbs came in with a face like thunder.",
                        "vi": "Ông Hibbs bước vào với khuôn mặt như sấm sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to and looking at somebody",
                    "vi": "gần và nhìn ai đó"
                },
                "examples": [
                    {
                        "en": "The two have never met face to face before.",
                        "vi": "Cả hai chưa bao giờ gặp mặt trực tiếp trước đây."
                    },
                    {
                        "en": "The room fell silent as she came face to face with the man who had tried to kill her.",
                        "vi": "Căn phòng im lặng khi cô đối mặt với kẻ đã cố giết cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to accept that something is true and deal with it",
                    "vi": "trong một tình huống mà bạn phải chấp nhận rằng điều gì đó là đúng và đối phó với nó"
                },
                "examples": [
                    {
                        "en": "She was at an early age brought face to face with the horrors of war.",
                        "vi": "Khi còn nhỏ, cô đã phải đối mặt với sự khủng khiếp của chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "with your face and stomach facing upwards/downwards",
                    "vi": "với mặt và bụng của bạn hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "She lay face down on the bed.",
                        "vi": "Cô nằm úp mặt xuống giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the front part or surface facing upwards/downwards",
                    "vi": "với phần trước hoặc bề mặt hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "Place the card face up on the pile.",
                        "vi": "Đặt thẻ úp trên cọc."
                    },
                    {
                        "en": "She placed the cards face down on the table.",
                        "vi": "Cô đặt những tấm thẻ úp xuống bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall so that you are lying on your front",
                    "vi": "rơi xuống để bạn đang nằm trên mặt trước của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail completely, usually in an embarrassing way",
                    "vi": "thất bại hoàn toàn, thường là một cách đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "His next television venture fell flat on its face.",
                        "vi": "Dự án truyền hình tiếp theo của anh ấy đã thất bại trên khuôn mặt của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to oppose or be the opposite of something that is usual or expected",
                    "vi": "phản đối hoặc đối lập với điều gì đó bình thường hoặc được mong đợi"
                },
                "examples": [
                    {
                        "en": "Such a proposal is flying in the face of common sense.",
                        "vi": "Một đề xuất như vậy đang bay theo lẽ thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that other people think is rude or shows a lack of respect, without feeling embarrassed or ashamed",
                    "vi": "làm điều gì đó mà người khác cho là thô lỗ hoặc thể hiện sự thiếu tôn trọng mà không cảm thấy xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the face to complain after everything they've done for you!",
                        "vi": "Tôi không biết bạn có khuôn mặt để phàn nàn như thế nào sau tất cả những gì họ đã làm cho bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "annoying somebody by criticizing them or telling them what to do all the time",
                    "vi": "làm phiền ai đó bằng cách chỉ trích họ hoặc bảo họ phải làm gì mọi lúc"
                },
                "examples": [
                    {
                        "en": "Why are you always in my face?",
                        "vi": "Tại sao bạn luôn luôn đối mặt với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "despite problems, difficulties, etc.",
                    "vi": "bất chấp những vướng mắc, khó khăn, v.v."
                },
                "examples": [
                    {
                        "en": "She showed great courage in the face of danger.",
                        "vi": "Cô đã thể hiện sự dũng cảm khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "The campaign continued in the face of great opposition.",
                        "vi": "Chiến dịch tiếp tục vấp phải sự phản đối lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of something",
                    "vi": "kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was unable to deny the charges in the face of new evidence.",
                        "vi": "Anh không thể phủ nhận cáo buộc khi đối mặt với những bằng chứng mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show in a very obvious way that you have no respect for somebody",
                    "vi": "thể hiện một cách rất rõ ràng rằng bạn không tôn trọng ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to change from feeling pleased or satisfied to feeling disappointed or annoyed",
                    "vi": "buộc phải thay đổi từ cảm thấy hài lòng hoặc hài lòng sang cảm thấy thất vọng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He’ll be laughing on the other side of his face when he reads my letter.",
                        "vi": "Anh ấy sẽ cười trên khuôn mặt khác khi đọc bức thư của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have) an unhappy or disappointed expression",
                    "vi": "(có) một biểu hiện không vui hoặc thất vọng"
                },
                "examples": [
                    {
                        "en": "He took one look at her long face and said ‘What’s wrong?’",
                        "vi": "Anh nhìn vào khuôn mặt dài của cô và nói 'Có chuyện gì vậy?'"
                    },
                    {
                        "en": "The news for the company isn't good, judging from the long faces in the boardroom.",
                        "vi": "Tin tức cho công ty không tốt, xét từ những gương mặt dài trong phòng họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look straight at somebody without feeling embarrassed or ashamed",
                    "vi": "nhìn thẳng vào ai đó mà không cảm thấy xấu hổ hay xấu hổ"
                },
                "examples": [
                    {
                        "en": "Can you look me in the eye and tell me you're not lying?",
                        "vi": "Bạn có thể nhìn vào mắt tôi và nói với tôi rằng bạn không nói dối?"
                    },
                    {
                        "en": "She looked her father straight in the eye and answered his question truthfully.",
                        "vi": "Cô nhìn thẳng vào mắt cha mình và trả lời thành thật câu hỏi của ông."
                    },
                    {
                        "en": "I'll never be able to look her in the face again!",
                        "vi": "Tôi sẽ không bao giờ có thể nhìn mặt cô ấy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be less respected or look stupid because of something you have done",
                    "vi": "ít được tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Many leaders don't want to lose face by admitting failures.",
                        "vi": "Nhiều nhà lãnh đạo không muốn bị mất mặt khi thừa nhận thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you have particular skills or qualities",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn có các kỹ năng hoặc phẩm chất cụ thể"
                },
                "examples": [
                    {
                        "en": "‘I didn't know you could play the piano.’ ‘I'm not just a pretty face, you know!’",
                        "vi": "Tôi không biết bạn có thể chơi piano.' 'Tôi không chỉ là một khuôn mặt xinh đẹp, bạn biết đấy!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something seems to be good, true, etc. but that this opinion may need to be changed when you know more about it",
                    "vi": "được sử dụng để nói rằng điều gì đó có vẻ là tốt, đúng, v.v. nhưng ý kiến này có thể cần được thay đổi khi bạn biết thêm về nó"
                },
                "examples": [
                    {
                        "en": "On the face of it, it seems like a great deal.",
                        "vi": "Về mặt nó, nó có vẻ như là một việc lớn."
                    },
                    {
                        "en": "What may, on the face of it, seem obvious often turns out to be far more complicated.",
                        "vi": "Những gì có thể, trên mặt của nó, có vẻ rõ ràng thường trở nên phức tạp hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce an expression on your face to show that you do not like somebody/something or in order to make somebody laugh",
                    "vi": "biểu hiện trên khuôn mặt của bạn để thể hiện rằng bạn không thích ai đó / điều gì đó hoặc để làm cho ai đó cười"
                },
                "examples": [
                    {
                        "en": "What are you pulling a face at now?",
                        "vi": "Bạn đang kéo một khuôn mặt vào lúc này?"
                    },
                    {
                        "en": "Do you think it’s funny to make faces behind my back?",
                        "vi": "Bạn có nghĩ thật buồn cười khi làm mặt sau lưng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on make-up",
                    "vi": "để trang điểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend that you feel confident and happy when you do not",
                    "vi": "giả vờ rằng bạn cảm thấy tự tin và hạnh phúc khi bạn không"
                },
                "examples": [
                    {
                        "en": "I had to put on a brave face and try to show him that I wasn’t worried.",
                        "vi": "Tôi phải tỏ ra dũng cảm và cố gắng cho anh ấy thấy rằng tôi không lo lắng."
                    },
                    {
                        "en": "She put a brave face on her illness.",
                        "vi": "Cô ấy dũng cảm đối mặt với bệnh tật của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid or help somebody avoid being embarrassed",
                    "vi": "để tránh hoặc giúp ai đó khỏi xấu hổ"
                },
                "examples": [
                    {
                        "en": "She was fired, but she saved face by telling everyone she'd resigned.",
                        "vi": "Cô ấy đã bị sa thải, nhưng cô ấy đã cứu vãn thể diện bằng cách nói với mọi người rằng cô ấy sẽ từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined to oppose somebody/something",
                    "vi": "quyết tâm chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her father had set his face against the marriage.",
                        "vi": "Cha cô đã ra mặt phản đối cuộc hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear among your friends or in public",
                    "vi": "xuất hiện giữa bạn bè của bạn hoặc ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "She stayed at home, afraid to show her face.",
                        "vi": "Cô ở nhà sợ lộ mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut a door hard when somebody is trying to come in",
                    "vi": "đóng chặt cửa khi ai đó đang cố gắng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to talk to somebody or meet them, in a rude way",
                    "vi": "từ chối nói chuyện với ai đó hoặc gặp họ, một cách thô lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to be quiet or stop talking",
                    "vi": "một cách thô lỗ để bảo ai đó im lặng hoặc ngừng nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an action that seems to be intended as a deliberate way of offending and showing lack of respect for somebody",
                    "vi": "một hành động dường như là một cách cố ý xúc phạm và thể hiện sự thiếu tôn trọng đối với ai đó"
                },
                "examples": [
                    {
                        "en": "The closure of the school is a slap in the face to the local community.",
                        "vi": "Việc đóng cửa trường học là một cái tát vào mặt cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something to somebody’s face, you say it to them directly rather than to other people",
                    "vi": "nếu bạn nói điều gì đó vào mặt ai đó, bạn nói điều đó trực tiếp với họ thay vì nói với người khác"
                },
                "examples": [
                    {
                        "en": "He’s a liar, and I’ve told him so to his face many times.",
                        "vi": "Anh ta là một kẻ nói dối, và tôi đã nói với anh ta như vậy trước mặt anh ta nhiều lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person whose name you cannot remember",
                    "vi": "được sử dụng để chỉ một người mà bạn không thể nhớ tên"
                },
                "examples": [
                    {
                        "en": "Are you still working for what's her face?",
                        "vi": "Bạn vẫn đang làm việc cho khuôn mặt của cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy or remove somebody/something completely",
                    "vi": "để tiêu diệt hoặc loại bỏ ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "49d4ab9dcdb547a8b4ffef2074c42d6c",
        "word": "sore",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/sɔː(r)/",
            "us": "/sɔːr/"
        },
        "nearby": [
            {
                "word": "sorcery",
                "pos": "noun"
            },
            {
                "word": "sordid",
                "pos": "adjective"
            },
            {
                "word": "sore",
                "pos": "adjective"
            },
            {
                "word": "sore",
                "pos": "noun"
            },
            {
                "word": "sorely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a part of your body is sore, it is painful, and often red, especially because of infection or because a muscle has been used too much",
                    "vi": "nếu một bộ phận của cơ thể bạn bị đau, đau và thường đỏ, đặc biệt là do nhiễm trùng hoặc do cơ bị sử dụng quá nhiều"
                },
                "examples": [
                    {
                        "en": "to have a sore throat",
                        "vi": "để có một đau họng"
                    },
                    {
                        "en": "His feet were sore after the walk.",
                        "vi": "Chân anh bị đau sau khi đi bộ."
                    },
                    {
                        "en": "My stomach is still sore (= painful) after the operation.",
                        "vi": "Bụng tôi vẫn còn đau (= đau) sau khi phẫu thuật."
                    },
                    {
                        "en": "When I woke up my head was sore and throbbing.",
                        "vi": "Khi tôi tỉnh dậy, đầu của tôi rất đau và đau nhói."
                    }
                ]
            },
            {
                "define": {
                    "en": "upset and angry, especially because you have been treated unfairly",
                    "vi": "khó chịu và tức giận, đặc biệt là vì bạn đã bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He was still sore at me for telling him he couldn't sing.",
                        "vi": "Anh ấy vẫn còn đau khổ với tôi vì đã nói với anh ấy rằng anh ấy không thể hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a bad mood; in an angry way",
                    "vi": "trong một tâm trạng tồi tệ; một cách tức giận"
                },
                "examples": [
                    {
                        "en": "I should keep out of his way. He’s like a bear with a sore head this morning.",
                        "vi": "Tôi nên tránh xa anh ta. Sáng nay anh ấy giống như một con gấu bị đau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you are pleased to see; something that is very pleasant to look at",
                    "vi": "một người hoặc một điều mà bạn hài lòng khi nhìn thấy; một cái gì đó rất dễ chịu khi nhìn vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a subject that makes you feel angry or upset when it is mentioned",
                    "vi": "một chủ đề khiến bạn cảm thấy tức giận hoặc khó chịu khi nó được đề cập đến"
                },
                "examples": [
                    {
                        "en": "It's a sore point with Sue's parents that the children have not been baptized yet.",
                        "vi": "Điều nhức nhối với cha mẹ của Sue là bọn trẻ vẫn chưa được rửa tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very easy to notice in an unpleasant way",
                    "vi": "rất dễ nhận thấy một cách khó chịu"
                },
                "examples": [
                    {
                        "en": "The blue building stood out like a sore thumb among the whitewashed villas.",
                        "vi": "Tòa nhà màu xanh lam nổi bật như ngón tay cái đau giữa những biệt thự quét vôi trắng."
                    },
                    {
                        "en": "If you wear a suit to the party, you’ll stand out like a sore thumb.",
                        "vi": "Nếu bạn mặc một bộ vest đến bữa tiệc, bạn sẽ nổi bật như ngón tay cái bị đau."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9bfd0f051884f2fb97489ba3ef44024",
        "word": "spiky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspaɪki/",
            "us": "/ˈspaɪki/"
        },
        "nearby": [
            {
                "word": "spike heel",
                "pos": "noun"
            },
            {
                "word": "spikiness",
                "pos": "noun"
            },
            {
                "word": "spiky",
                "pos": "adjective"
            },
            {
                "word": "spill",
                "pos": "verb"
            },
            {
                "word": "spill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having sharp points",
                    "vi": "có đầu nhọn"
                },
                "examples": [
                    {
                        "en": "spiky plants, such as cacti",
                        "vi": "cây có gai nhọn, chẳng hạn như xương rồng"
                    },
                    {
                        "en": "It has spiky leaves, tinged with a delicate pink around the edges.",
                        "vi": "Nó có những chiếc lá nhọn hoắt, nhuốm một màu hồng mỏng manh xung quanh các mép."
                    }
                ]
            },
            {
                "define": {
                    "en": "sticking straight up from the head",
                    "vi": "nhô thẳng lên khỏi đầu"
                },
                "examples": [
                    {
                        "en": "He had spiky hair, strong opinions and a wacky sense of humour.",
                        "vi": "Anh ta có mái tóc xù, chính kiến mạnh mẽ và khiếu hài hước kỳ lạ."
                    }
                ]
            },
            {
                "define": {
                    "en": "easily annoyed or offended",
                    "vi": "dễ bị khó chịu hoặc bị xúc phạm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e99ee216029450f96fa6ca98b042530",
        "word": "spit",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/spɪt/",
            "us": "/spɪt/"
        },
        "nearby": [
            {
                "word": "spiritualized",
                "pos": "adjective"
            },
            {
                "word": "spiritually",
                "pos": "adverb"
            },
            {
                "word": "spit",
                "pos": "verb"
            },
            {
                "word": "spit",
                "pos": "noun"
            },
            {
                "word": "Spitalfields",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to force liquid, food, etc. out of your mouth",
                    "vi": "để đẩy chất lỏng, thức ăn, v.v. ra khỏi miệng của bạn"
                },
                "examples": [
                    {
                        "en": "spit something (out) She took a mouthful of food and then suddenly spat it out.",
                        "vi": "nhổ một cái gì đó (ra) Cô ấy nuốt một ngụm thức ăn và sau đó đột nhiên phun ra."
                    },
                    {
                        "en": "spit something (from something) He was spitting blood from a badly cut lip.",
                        "vi": "nhổ cái gì đó (từ cái gì đó) Anh ấy đang khạc ra máu từ một vết cắt nặng trên môi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force saliva (= the liquid that is produced in the mouth) out of your mouth, often as a sign of anger or lack of respect",
                    "vi": "đẩy nước bọt (= chất lỏng tạo ra trong miệng) ra khỏi miệng, thường là dấu hiệu của sự tức giận hoặc thiếu tôn trọng"
                },
                "examples": [
                    {
                        "en": "He coughed and spat.",
                        "vi": "Anh ta ho và khạc nhổ."
                    },
                    {
                        "en": "spit at/on/in somebody/something The prisoners were spat on by their guards.",
                        "vi": "nhổ vào / vào / vào ai đó / cái gì đó Các tù nhân đã bị lính canh của họ nhổ vào."
                    },
                    {
                        "en": "She spat in his face and went out.",
                        "vi": "Cô nhổ nước bọt vào mặt anh và đi ra ngoài."
                    },
                    {
                        "en": "A gang of youths swore and spat at officials outside the stadium.",
                        "vi": "Một nhóm thanh niên chửi thề và phỉ báng các quan chức bên ngoài sân vận động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something in an angry or aggressive way",
                    "vi": "nói điều gì đó một cách tức giận hoặc hung hăng"
                },
                "examples": [
                    {
                        "en": "+ speech ‘You liar!’ she spat.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "spit something (at somebody) He was dragged out of the court, spitting abuse at the judge and jury.",
                        "vi": "khạc nhổ cái gì đó (vào ai đó) Anh ta bị lôi ra khỏi tòa án, nhổ vào mặt thẩm phán và bồi thẩm đoàn sự ngược đãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a short angry sound",
                    "vi": "để tạo ra một âm thanh tức giận ngắn"
                },
                "examples": [
                    {
                        "en": "Snakes spit and hiss when they are cornered.",
                        "vi": "Rắn khạc nhổ và rít lên khi chúng bị dồn vào đường cùng."
                    },
                    {
                        "en": "The cat arched its back and spat at the dog.",
                        "vi": "Con mèo cong lưng và nhổ nước bọt vào con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a noise and throw out fat, sparks, etc.",
                    "vi": "để tạo ra tiếng ồn và phát ra chất béo, tia lửa, v.v."
                },
                "examples": [
                    {
                        "en": "sausages spitting in the frying pan",
                        "vi": "xúc xích phun trong chảo"
                    },
                    {
                        "en": "The logs on the fire crackled and spat.",
                        "vi": "Các khúc gỗ trên ngọn lửa kêu răng rắc và bắn tung tóe."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it is spitting, it is raining lightly",
                    "vi": "đang nhổ thì trời mưa nhẹ."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "usually used in orders to tell somebody to say something when they seem frightened or unwilling to speak",
                    "vi": "thường được sử dụng để bảo ai đó nói điều gì đó khi họ có vẻ sợ hãi hoặc không muốn nói"
                },
                "examples": [
                    {
                        "en": "If you've got something to say, spit it out!",
                        "vi": "Nếu bạn có điều gì đó để nói, hãy nhổ nó ra!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "very close",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "We live within spitting distance of the bus station.",
                        "vi": "Chúng tôi sống trong khoảng cách xa bến xe buýt."
                    },
                    {
                        "en": "We came within touching distance of winning the cup.",
                        "vi": "Chúng tôi đã đến trong khoảng cách chạm nhau để giành cúp."
                    }
                ]
            }
        ]
    },
    {
        "id": "f7fd6883e22e42718900942bdf7b38d6",
        "word": "splenetic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/spləˈnetɪk/",
            "us": "/spləˈnetɪk/"
        },
        "nearby": [
            {
                "word": "splendiferous",
                "pos": "adjective"
            },
            {
                "word": "splendour",
                "pos": "noun"
            },
            {
                "word": "splenetic",
                "pos": "adjective"
            },
            {
                "word": "splice",
                "pos": "verb"
            },
            {
                "word": "splice",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "often annoyed and angry",
                    "vi": "thường xuyên khó chịu và tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "868f59d9424646559bc4f9ea7beb1069",
        "word": "static",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætɪk/",
            "us": "/ˈstætɪk/"
        },
        "nearby": [
            {
                "word": "statewide",
                "pos": "adjective, adverb"
            },
            {
                "word": "static",
                "pos": "adjective"
            },
            {
                "word": "static",
                "pos": "noun"
            },
            {
                "word": "static electricity",
                "pos": "noun"
            },
            {
                "word": "statin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "noise or other effects that interrupt radio or television signals and are caused by particular conditions in the atmosphere",
                    "vi": "tiếng ồn hoặc các hiệu ứng khác làm gián đoạn tín hiệu vô tuyến hoặc truyền hình và do các điều kiện cụ thể trong khí quyển gây ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "electricity that gathers on or in an object that is not a conductor of electricity",
                    "vi": "điện tụ trên hoặc trong một vật không phải là vật dẫn điện"
                },
                "examples": [
                    {
                        "en": "My hair gets full of static when I brush it.",
                        "vi": "Tóc của tôi trở nên tĩnh điện khi tôi chải nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the science that deals with the forces that balance each other to keep objects in a state of rest",
                    "vi": "khoa học xử lý các lực cân bằng lẫn nhau để giữ cho các vật thể ở trạng thái nghỉ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "angry or critical comments or behaviour",
                    "vi": "nhận xét hoặc hành vi tức giận hoặc chỉ trích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "835e10794d734d88bbefb289942e5283",
        "word": "steaming",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstiːmɪŋ/",
            "us": "/ˈstiːmɪŋ/"
        },
        "nearby": [
            {
                "word": "steamboat",
                "pos": "noun"
            },
            {
                "word": "steamer",
                "pos": "noun"
            },
            {
                "word": "steaming",
                "pos": "adjective"
            },
            {
                "word": "steaming",
                "pos": "noun"
            },
            {
                "word": "steam off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very angry",
                    "vi": "rất giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hot",
                    "vi": "rất nóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9bec624660404605b565681fc9972205",
        "word": "sting",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/stɪŋ/",
            "us": "/stɪŋ/"
        },
        "nearby": [
            {
                "word": "stimulation",
                "pos": "noun"
            },
            {
                "word": "stimulus",
                "pos": "noun"
            },
            {
                "word": "sting",
                "pos": "verb"
            },
            {
                "word": "sting",
                "pos": "noun"
            },
            {
                "word": "stinginess",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to touch your skin or make a very small hole in it so that you feel a sharp pain",
                    "vi": "chạm vào da của bạn hoặc tạo một lỗ rất nhỏ trên đó để bạn cảm thấy đau nhói"
                },
                "examples": [
                    {
                        "en": "I was stung on the arm by a wasp.",
                        "vi": "Tôi bị ong vò vẽ đốt vào cánh tay."
                    },
                    {
                        "en": "Be careful of the nettles—they sting!",
                        "vi": "Hãy cẩn thận với cây tầm ma — chúng chích!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel, or to make somebody feel, a sharp pain in a part of their body",
                    "vi": "để cảm thấy, hoặc làm cho ai đó cảm thấy, một cơn đau nhói ở một phần cơ thể của họ"
                },
                "examples": [
                    {
                        "en": "I put some antiseptic on the cut and it stung for a moment.",
                        "vi": "Tôi bôi một ít thuốc sát trùng vào vết cắt và nó ngứa ngáy trong giây lát."
                    },
                    {
                        "en": "My eyes were stinging from the smoke.",
                        "vi": "Mắt tôi cay xè vì khói."
                    },
                    {
                        "en": "sting something Tears stung her eyes.",
                        "vi": "châm chích gì đó Nước mắt cay cay khóe mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel angry or upset",
                    "vi": "làm cho ai đó cảm thấy tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "sting somebody He was stung by their criticism.",
                        "vi": "châm chích ai đó Anh ta bị châm chích bởi những lời chỉ trích của họ."
                    },
                    {
                        "en": "They launched a stinging attack on the government.",
                        "vi": "Họ đã phát động một cuộc tấn công nhức nhối vào chính phủ."
                    },
                    {
                        "en": "sting somebody to/into something Their cruel remarks stung her into action.",
                        "vi": "châm chích ai đó vào / vào một cái gì đó Những lời nhận xét tàn nhẫn của họ khiến cô ấy bắt đầu hành động."
                    },
                    {
                        "en": "sting somebody into doing something He was stung into answering in his defence.",
                        "vi": "châm ngòi cho ai đó làm điều gì đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to charge somebody more money than they expected; to charge somebody who did not expect to pay",
                    "vi": "tính phí ai đó nhiều tiền hơn họ mong đợi; tính phí ai đó không mong đợi trả tiền"
                },
                "examples": [
                    {
                        "en": "I got stung for a £100 meal.",
                        "vi": "Tôi đã bị chích cho một bữa ăn 100 bảng."
                    },
                    {
                        "en": "How much did they sting you for?",
                        "vi": "Họ đã đốt bạn bao nhiêu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to borrow money from somebody",
                    "vi": "vay tiền từ ai đó"
                },
                "examples": [
                    {
                        "en": "Can I sting you for a couple of pounds?",
                        "vi": "Tôi có thể chích cho bạn một vài pound?"
                    }
                ]
            }
        ]
    },
    {
        "id": "6fe387c586ec40e8bb46a9c1e206eca5",
        "word": "storm",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/stɔːm/",
            "us": "/stɔːrm/"
        },
        "nearby": [
            {
                "word": "Stork",
                "pos": "noun"
            },
            {
                "word": "storm",
                "pos": "noun"
            },
            {
                "word": "storm",
                "pos": "verb"
            },
            {
                "word": "storm cloud",
                "pos": "noun"
            },
            {
                "word": "storm door",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to suddenly attack a place",
                    "vi": "đột ngột tấn công một nơi"
                },
                "examples": [
                    {
                        "en": "storm something Police stormed the building and captured the gunman.",
                        "vi": "bão cái gì đó Cảnh sát xông vào tòa nhà và bắt được tay súng."
                    },
                    {
                        "en": "The embassy was stormed by demonstrators.",
                        "vi": "Đại sứ quán đã bị tấn công bởi những người biểu tình."
                    },
                    {
                        "en": "storm into something Soldiers stormed into the city at dawn.",
                        "vi": "bão thành cái gì đó Những người lính xông vào thành phố lúc bình minh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go somewhere quickly and in an angry, noisy way",
                    "vi": "đi đâu đó một cách nhanh chóng và giận dữ, ồn ào"
                },
                "examples": [
                    {
                        "en": "She stormed into my office waving a newspaper.",
                        "vi": "Cô ấy xông vào phòng làm việc của tôi và vẫy một tờ báo."
                    },
                    {
                        "en": "He burst into tears and stormed off.",
                        "vi": "Anh bật khóc và lao đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something in a loud angry way",
                    "vi": "nói điều gì đó một cách giận dữ lớn tiếng"
                },
                "examples": [
                    {
                        "en": "‘Don't you know who I am?’ she stormed.",
                        "vi": "Bạn không biết tôi là ai?' cô ấy xông vào."
                    }
                ]
            }
        ]
    },
    {
        "id": "f60704dffbc94db9b8f8365e3cb74752",
        "word": "stormy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɔːmi/",
            "us": "/ˈstɔːrmi/"
        },
        "nearby": [
            {
                "word": "storm water",
                "pos": "noun"
            },
            {
                "word": "storm window",
                "pos": "noun"
            },
            {
                "word": "stormy",
                "pos": "adjective"
            },
            {
                "word": "Stornoway",
                "pos": ""
            },
            {
                "word": "story",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with strong winds and heavy rain or snow",
                    "vi": "có gió mạnh và mưa lớn hoặc tuyết"
                },
                "examples": [
                    {
                        "en": "a dark and stormy night",
                        "vi": "một đêm tối và giông bão"
                    },
                    {
                        "en": "stormy weather",
                        "vi": "trời giông bão"
                    },
                    {
                        "en": "stormy seas (= with big waves)",
                        "vi": "biển bão (= có sóng lớn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of strong feelings and angry arguments",
                    "vi": "đầy những cảm xúc mạnh mẽ và những tranh luận giận dữ"
                },
                "examples": [
                    {
                        "en": "a stormy debate",
                        "vi": "một cuộc tranh luận sôi nổi"
                    },
                    {
                        "en": "a stormy relationship",
                        "vi": "một mối quan hệ đầy sóng gió"
                    }
                ]
            }
        ]
    },
    {
        "id": "d11db48eb83a4ca1bf783c8e56259257",
        "word": "strife",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/straɪf/",
            "us": "/straɪf/"
        },
        "nearby": [
            {
                "word": "strident",
                "pos": "adjective"
            },
            {
                "word": "stridently",
                "pos": "adverb"
            },
            {
                "word": "strife",
                "pos": "noun"
            },
            {
                "word": "strike",
                "pos": "verb"
            },
            {
                "word": "strike",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "anger or violence between two people or groups of people who disagree",
                    "vi": "giận dữ hoặc bạo lực giữa hai người hoặc nhóm người không đồng ý với nhau"
                },
                "examples": [
                    {
                        "en": "civil strife",
                        "vi": "xung đột dân sự"
                    },
                    {
                        "en": "The country was torn apart by strife.",
                        "vi": "Đất nước bị chia cắt bởi xung đột."
                    },
                    {
                        "en": "internecine strife among the nationalities of the empire",
                        "vi": "xung đột giữa các quốc gia của đế chế"
                    }
                ]
            },
            {
                "define": {
                    "en": "trouble or difficulty of any kind",
                    "vi": "rắc rối hoặc khó khăn của bất kỳ loại nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "19d8768d99b14056a9e6c52034d5a2f1",
        "word": "sulk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/sʌlk/",
            "us": "/sʌlk/"
        },
        "nearby": [
            {
                "word": "sulfur",
                "pos": "noun"
            },
            {
                "word": "sulfuric acid",
                "pos": "noun"
            },
            {
                "word": "sulk",
                "pos": "verb"
            },
            {
                "word": "sulk",
                "pos": "noun"
            },
            {
                "word": "sulkily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look angry and refuse to speak or smile because you want people to know that you are upset about something",
                    "vi": "tỏ vẻ tức giận và từ chối nói hoặc mỉm cười vì bạn muốn mọi người biết rằng bạn đang buồn vì điều gì đó"
                },
                "examples": [
                    {
                        "en": "He went off to sulk in his room.",
                        "vi": "Anh ấy bỏ đi để hờn dỗi trong phòng của mình."
                    },
                    {
                        "en": "He was still sulking about the break-up of his band.",
                        "vi": "Anh ấy vẫn còn hờn dỗi về sự tan rã của ban nhạc."
                    },
                    {
                        "en": "She sulked all the way to the theatre.",
                        "vi": "Cô hờn dỗi suốt quãng đường đến rạp."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac245a3af8514061a60a05a6aa9a204c",
        "word": "sulk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sʌlk/",
            "us": "/sʌlk/"
        },
        "nearby": [
            {
                "word": "sulfuric acid",
                "pos": "noun"
            },
            {
                "word": "sulk",
                "pos": "verb"
            },
            {
                "word": "sulk",
                "pos": "noun"
            },
            {
                "word": "sulkily",
                "pos": "adverb"
            },
            {
                "word": "sulkiness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of not speaking and being unpleasant because you are angry about something",
                    "vi": "một khoảng thời gian không nói và khó chịu vì bạn đang tức giận về điều gì đó"
                },
                "examples": [
                    {
                        "en": "in a sulk Jo was in a sulk upstairs.",
                        "vi": "Jo đang hờn dỗi ở trên lầu."
                    },
                    {
                        "en": "to have the sulks",
                        "vi": "để có những hờn dỗi"
                    },
                    {
                        "en": "Ed’s got the sulks again.",
                        "vi": "Ed lại gặp phải sự hờn dỗi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c12570469f9949f59b06fd6c29360f77",
        "word": "sulky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌlki/",
            "us": "/ˈsʌlki/"
        },
        "nearby": [
            {
                "word": "sulkily",
                "pos": "adverb"
            },
            {
                "word": "sulkiness",
                "pos": "noun"
            },
            {
                "word": "sulky",
                "pos": "adjective"
            },
            {
                "word": "sullen",
                "pos": "adjective"
            },
            {
                "word": "sullenly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a bad mood or not speaking because you are angry about something",
                    "vi": "có tâm trạng xấu hoặc không nói vì bạn đang tức giận về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Sarah had looked sulky all morning.",
                        "vi": "Sarah đã trông hờn dỗi cả buổi sáng."
                    },
                    {
                        "en": "a sulky child",
                        "vi": "một đứa trẻ hờn dỗi"
                    },
                    {
                        "en": "He lapsed into a sulky silence.",
                        "vi": "Anh chìm vào im lặng hờn dỗi."
                    }
                ]
            }
        ]
    },
    {
        "id": "af4c4a7c5b7c4b7a8c9cb14843a336a0",
        "word": "tantrum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtæntrəm/",
            "us": "/ˈtæntrəm/"
        },
        "nearby": [
            {
                "word": "tantra",
                "pos": "noun"
            },
            {
                "word": "tantric",
                "pos": "adjective"
            },
            {
                "word": "tantrum",
                "pos": "noun"
            },
            {
                "word": "Tanzania",
                "pos": ""
            },
            {
                "word": "Tanzanian",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden short period of angry, unreasonable behaviour, especially in a child",
                    "vi": "một thời gian ngắn đột ngột nổi giận, hành vi vô lý, đặc biệt là ở trẻ em"
                },
                "examples": [
                    {
                        "en": "to have/throw a tantrum",
                        "vi": "có / nổi cơn thịnh nộ"
                    },
                    {
                        "en": "Children often have temper tantrums at the age of two or thereabouts.",
                        "vi": "Trẻ em thường nổi cơn thịnh nộ khi được hai tuổi trở lên."
                    },
                    {
                        "en": "They claimed she threw tantrums and was difficult to work with.",
                        "vi": "Họ cho rằng cô ấy nổi cơn tam bành và rất khó làm việc cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a30dd522eb2d466c951973563fbaf328",
        "word": "teed off",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtiːd ˈɒf/",
            "us": "/ˌtiːd ˈɔːf/"
        },
        "nearby": [
            {
                "word": "tee",
                "pos": "verb"
            },
            {
                "word": "Tee Ball",
                "pos": "noun"
            },
            {
                "word": "teed off",
                "pos": "adjective"
            },
            {
                "word": "tee-hee",
                "pos": "exclamation"
            },
            {
                "word": "teem",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "annoyed or angry",
                    "vi": "khó chịu hoặc tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9d71866d4aee42cc9bf28629c5eccdc0",
        "word": "tee off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "teeny",
                "pos": "adjective"
            },
            {
                "word": "teenybopper",
                "pos": "noun"
            },
            {
                "word": "tee off",
                "pos": "phrasal verb"
            },
            {
                "word": "teepee",
                "pos": "noun"
            },
            {
                "word": "the Tees",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit a golf ball from a tee, especially at the start of a match",
                    "vi": "đánh bóng gôn từ điểm phát bóng, đặc biệt là khi bắt đầu trận đấu"
                },
                "examples": [
                    {
                        "en": "The first pair are due to tee off at 10 o’clock.",
                        "vi": "Cặp đầu tiên sẽ bắt đầu vào lúc 10 giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody angry or annoyed",
                    "vi": "làm cho ai đó tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "It really teed me off when she was late again.",
                        "vi": "Nó thực sự làm tôi kinh ngạc khi cô ấy lại đến muộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d533bf84f61f4f18b7d73df435e39f4b",
        "word": "temperamental",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtemprəˈmentl/",
            "us": "/ˌtemprəˈmentl/"
        },
        "nearby": [
            {
                "word": "tempera",
                "pos": "noun"
            },
            {
                "word": "temperament",
                "pos": "noun"
            },
            {
                "word": "temperamental",
                "pos": "adjective"
            },
            {
                "word": "temperamentally",
                "pos": "adverb"
            },
            {
                "word": "temperance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tending to become angry, excited or upset easily, and to behave in an unreasonable way",
                    "vi": "có xu hướng dễ dàng trở nên tức giận, phấn khích hoặc khó chịu và cư xử theo cách không hợp lý"
                },
                "examples": [
                    {
                        "en": "You never know what to expect with her. She's so temperamental.",
                        "vi": "Bạn không bao giờ biết những gì mong đợi với cô ấy. Cô ấy rất thất thường."
                    },
                    {
                        "en": "(figurative) The printer's being temperamental this morning.",
                        "vi": "(nghĩa bóng) Máy in sáng nay không ổn định."
                    },
                    {
                        "en": "He’s a temperamental player (= he plays well or badly according to his mood).",
                        "vi": "Anh ấy là một cầu thủ thất thường (= anh ấy chơi tốt hay xấu tùy theo tâm trạng của anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with somebody’s nature and personality",
                    "vi": "kết nối với bản chất và tính cách của ai đó"
                },
                "examples": [
                    {
                        "en": "They are firm friends in spite of temperamental differences.",
                        "vi": "Họ là những người bạn thân thiết bất chấp những khác biệt về tính khí."
                    }
                ]
            }
        ]
    },
    {
        "id": "00ae64759780459bbe49d25371d4eed2",
        "word": "tetchy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtetʃi/",
            "us": "/ˈtetʃi/"
        },
        "nearby": [
            {
                "word": "tetanus",
                "pos": "noun"
            },
            {
                "word": "tetchily",
                "pos": "adverb"
            },
            {
                "word": "tetchy",
                "pos": "adjective"
            },
            {
                "word": "tête-à-tête",
                "pos": "noun"
            },
            {
                "word": "tether",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "easily annoyed",
                    "vi": "dễ bực mình"
                },
                "examples": [
                    {
                        "en": "He sounded tetchy when I asked him where he’d been.",
                        "vi": "Anh ấy có vẻ khó chịu khi tôi hỏi anh ấy đã ở đâu."
                    }
                ]
            }
        ]
    },
    {
        "id": "4fdac3e97f0941aab3c986ecf369d413",
        "word": "thunderous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθʌndərəs/",
            "us": "/ˈθʌndərəs/"
        },
        "nearby": [
            {
                "word": "thunderclap",
                "pos": "noun"
            },
            {
                "word": "thundercloud",
                "pos": "noun"
            },
            {
                "word": "thunderous",
                "pos": "adjective"
            },
            {
                "word": "thunderously",
                "pos": "adverb"
            },
            {
                "word": "thunderstorm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very loud",
                    "vi": "rất to"
                },
                "examples": [
                    {
                        "en": "thunderous applause",
                        "vi": "tiếng vỗ tay như sấm"
                    },
                    {
                        "en": "The performance won thunderous applause from the audience.",
                        "vi": "Màn biểu diễn đã giành được những tràng pháo tay như sấm của khán giả."
                    },
                    {
                        "en": "There was a thunderous crash as the door was smashed in.",
                        "vi": "Có một tiếng va chạm mạnh khi cánh cửa bị đập vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking very angry",
                    "vi": "trông rất tức giận"
                },
                "examples": [
                    {
                        "en": "his thunderous expression",
                        "vi": "biểu hiện sấm sét của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "563288d5a0b94383a2cf2f2edb45d8a2",
        "word": "tight",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪt/",
            "us": "/taɪt/"
        },
        "nearby": [
            {
                "word": "tigerish",
                "pos": "adjective"
            },
            {
                "word": "tiger mother",
                "pos": "noun"
            },
            {
                "word": "tight",
                "pos": "adjective"
            },
            {
                "word": "tight",
                "pos": "adverb"
            },
            {
                "word": "tight-arse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "held or fixed in position securely; difficult to move, open or separate",
                    "vi": "được giữ hoặc cố định ở vị trí an toàn; khó di chuyển, mở hoặc tách rời"
                },
                "examples": [
                    {
                        "en": "He kept a tight grip on her arm.",
                        "vi": "Anh giữ chặt cánh tay cô."
                    },
                    {
                        "en": "She twisted her hair into a tight knot.",
                        "vi": "Cô ấy xoắn tóc thành một nút chặt."
                    },
                    {
                        "en": "The screw was so tight that it wouldn't move.",
                        "vi": "Vít chặt đến mức nó sẽ không di chuyển."
                    },
                    {
                        "en": "Dave's arms were tight around her waist.",
                        "vi": "Dave vòng tay ôm chặt eo cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "fitting closely to your body and sometimes uncomfortable",
                    "vi": "vừa khít với cơ thể của bạn và đôi khi không thoải mái"
                },
                "examples": [
                    {
                        "en": "She was wearing a tight pair of jeans.",
                        "vi": "Cô ấy đang mặc một chiếc quần jean bó."
                    },
                    {
                        "en": "These shoes are much too tight.",
                        "vi": "Đôi giày này quá chật."
                    },
                    {
                        "en": "The new sweater was a tight fit.",
                        "vi": "Chiếc áo len mới vừa vặn."
                    },
                    {
                        "en": "The dress is a little tight across the chest.",
                        "vi": "Chiếc váy hơi ôm sát ngực."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult to manage with because there is not enough",
                    "vi": "khó quản lý vì không có đủ"
                },
                "examples": [
                    {
                        "en": "We have a very tight budget.",
                        "vi": "Chúng tôi có một ngân sách rất eo hẹp."
                    },
                    {
                        "en": "The president has a tight schedule today.",
                        "vi": "Tổng thống có một lịch trình dày đặc hôm nay."
                    },
                    {
                        "en": "The deadline for finishing the project is too tight (= too soon).",
                        "vi": "Thời hạn hoàn thành dự án quá chặt chẽ (= quá sớm)."
                    },
                    {
                        "en": "I think we'd better leave—time's getting very tight.",
                        "vi": "Tôi nghĩ tốt hơn là chúng ta nên rời đi — thời gian đang rất eo hẹp."
                    },
                    {
                        "en": "As always, money is tight.",
                        "vi": "Như mọi khi, tiền bạc eo hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "very strict and hard to resist, avoid, etc.",
                    "vi": "rất nghiêm ngặt và khó cưỡng lại, né tránh, v.v."
                },
                "examples": [
                    {
                        "en": "to keep tight control over something",
                        "vi": "để kiểm soát chặt chẽ một cái gì đó"
                    },
                    {
                        "en": "Dozens of streets are being closed and security is tight.",
                        "vi": "Hàng chục con phố đang bị đóng cửa và an ninh được thắt chặt."
                    },
                    {
                        "en": "We need tighter security at the airport.",
                        "vi": "Chúng tôi cần an ninh chặt chẽ hơn ở sân bay."
                    },
                    {
                        "en": "Are the controls tight enough?",
                        "vi": "Các biện pháp kiểm soát đã đủ chặt chẽ chưa?"
                    },
                    {
                        "en": "tight restrictions/regulations",
                        "vi": "hạn chế / quy định chặt chẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "stretched or pulled so that it cannot stretch much further",
                    "vi": "kéo căng hoặc kéo để nó không thể kéo dài thêm nữa"
                },
                "examples": [
                    {
                        "en": "The rope was stretched tight.",
                        "vi": "Sợi dây bị kéo căng."
                    },
                    {
                        "en": "The constant pull of the river will keep your line tight.",
                        "vi": "Lực kéo liên tục của sông sẽ giữ cho đường dây của bạn chặt chẽ."
                    },
                    {
                        "en": "He drew the cord tighter with a jerk.",
                        "vi": "Anh giật sợi dây chặt hơn."
                    },
                    {
                        "en": "Pull in your navel and keep your abs tight.",
                        "vi": "Hóp rốn vào và giữ cho cơ bụng căng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with things or people packed closely together, leaving little space between them",
                    "vi": "với những thứ hoặc con người được đóng gói chặt chẽ với nhau, để lại ít khoảng cách giữa chúng"
                },
                "examples": [
                    {
                        "en": "There was a tight group of people around the speaker.",
                        "vi": "Có một nhóm người vây quanh diễn giả."
                    },
                    {
                        "en": "With six of us in the car it was a tight squeeze.",
                        "vi": "Với sáu người chúng tôi trong xe, đó là một sự siết chặt."
                    },
                    {
                        "en": "She managed to reverse into a tight parking space.",
                        "vi": "Cô xoay sở để lùi vào một chỗ đậu xe chật hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking or sounding anxious, upset or angry",
                    "vi": "nhìn hoặc có vẻ lo lắng, buồn bã hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "‘I'm sorry,’ she said, with a tight smile.",
                        "vi": "Tôi xin lỗi, cô ấy nói, với một nụ cười ngặt nghẽo."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling painful or uncomfortable because of illness or emotion",
                    "vi": "cảm thấy đau đớn hoặc khó chịu vì bệnh tật hoặc cảm xúc"
                },
                "examples": [
                    {
                        "en": "He complained of having a tight chest.",
                        "vi": "Anh ấy phàn nàn về việc có một bộ ngực căng."
                    },
                    {
                        "en": "Her throat felt tight, just looking at her baby.",
                        "vi": "Cổ họng cô như thắt lại, chỉ biết nhìn con mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a close relationship with somebody else or with other people",
                    "vi": "có mối quan hệ thân thiết với người khác hoặc với những người khác"
                },
                "examples": [
                    {
                        "en": "It was a tight community and newcomers were not welcome.",
                        "vi": "Đó là một cộng đồng chặt chẽ và những người mới đến không được chào đón."
                    }
                ]
            },
            {
                "define": {
                    "en": "curving suddenly rather than gradually",
                    "vi": "cong đột ngột thay vì dần dần"
                },
                "examples": [
                    {
                        "en": "The driver slowed down at a tight bend in the road.",
                        "vi": "Người lái xe giảm tốc độ ở một khúc cua hẹp trên đường."
                    },
                    {
                        "en": "The plane flew around in a tight circle.",
                        "vi": "Máy bay bay xung quanh trong một vòng tròn chặt chẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "with runners, teams, etc. that seem to be equally good",
                    "vi": "với người chạy, đội, v.v. có vẻ tốt như nhau"
                },
                "examples": [
                    {
                        "en": "a tight race",
                        "vi": "một cuộc đua chặt chẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "not wanting to spend much money; not generous",
                    "vi": "không muốn tiêu nhiều tiền; không hào phóng"
                },
                "examples": [
                    {
                        "en": "He's very tight with his money.",
                        "vi": "Anh ấy rất chặt chẽ với tiền của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "drunk",
                    "vi": "say"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not allowing the substance mentioned to enter",
                    "vi": "không cho phép chất được đề cập đi vào"
                },
                "examples": [
                    {
                        "en": "measures to make your home weathertight",
                        "vi": "các biện pháp để làm cho ngôi nhà của bạn kín gió"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    },
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to control somebody/something carefully or strictly",
                    "vi": "để kiểm soát ai đó / cái gì đó một cách cẩn thận hoặc nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "It’s essential to keep a tight rein on public spending.",
                        "vi": "Điều cần thiết là phải kiểm soát chặt chẽ chi tiêu công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize something in a very efficient way, controlling other people very closely",
                    "vi": "tổ chức một cái gì đó một cách rất hiệu quả, kiểm soát những người khác rất chặt chẽ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47a2d2dd7fc44b6db324f44ac6da91da",
        "word": "tight-lipped",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtaɪt ˈlɪpt/",
            "us": "/ˌtaɪt ˈlɪpt/"
        },
        "nearby": [
            {
                "word": "tight head",
                "pos": "noun"
            },
            {
                "word": "tight-knit",
                "pos": "adjective"
            },
            {
                "word": "tight-lipped",
                "pos": "adjective"
            },
            {
                "word": "tightly",
                "pos": "adverb"
            },
            {
                "word": "tightness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not willing to talk about something",
                    "vi": "không sẵn sàng nói về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Despite the rumours, government officials remained tight-lipped today.",
                        "vi": "Bất chấp những tin đồn, các quan chức chính phủ vẫn giữ kín cho đến ngày nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "keeping your lips pressed together, especially because you are angry about something",
                    "vi": "giữ môi của bạn áp vào nhau, đặc biệt là vì bạn đang tức giận về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He marched out of the room tight-lipped and white-faced.",
                        "vi": "Anh ta bước ra khỏi phòng với khuôn mặt kín tiếng và trắng bệch."
                    },
                    {
                        "en": "a tight-lipped reply",
                        "vi": "một câu trả lời kín tiếng"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f2e12fb0412475e96c75ca858aa8418",
        "word": "tirade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪˈreɪd/",
            "us": "/ˈtaɪreɪd/"
        },
        "nearby": [
            {
                "word": "tip up",
                "pos": "phrasal verb"
            },
            {
                "word": "tip-up",
                "pos": "adjective"
            },
            {
                "word": "tirade",
                "pos": "noun"
            },
            {
                "word": "tiramisu",
                "pos": "noun"
            },
            {
                "word": "tire",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long angry speech criticizing somebody/something or accusing somebody of something",
                    "vi": "một bài phát biểu dài đầy giận dữ chỉ trích ai đó / điều gì đó hoặc buộc tội ai đó về điều gì đó"
                },
                "examples": [
                    {
                        "en": "She launched into a tirade of abuse against politicians.",
                        "vi": "Cô ấy đã đưa ra một loạt lạm dụng chống lại các chính trị gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "4c6441dc231348319a25a0b7c087f1ce",
        "word": "truculence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrʌkjələns/",
            "us": "/ˈtrʌkjələns/"
        },
        "nearby": [
            {
                "word": "truckload",
                "pos": "noun"
            },
            {
                "word": "truck stop",
                "pos": "noun"
            },
            {
                "word": "truculence",
                "pos": "noun"
            },
            {
                "word": "truculent",
                "pos": "adjective"
            },
            {
                "word": "truculently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "angry or slightly aggressive behaviour that may cause an argument",
                    "vi": "hành vi tức giận hoặc hơi hung hăng có thể gây ra tranh cãi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0745e8c57c44485d8cec5dd098cde2bd",
        "word": "truculent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrʌkjələnt/",
            "us": "/ˈtrʌkjələnt/"
        },
        "nearby": [
            {
                "word": "truck stop",
                "pos": "noun"
            },
            {
                "word": "truculence",
                "pos": "noun"
            },
            {
                "word": "truculent",
                "pos": "adjective"
            },
            {
                "word": "truculently",
                "pos": "adverb"
            },
            {
                "word": "trudge",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tending to argue or become angry; slightly aggressive",
                    "vi": "có xu hướng tranh luận hoặc trở nên tức giận; hơi hung dữ"
                },
                "examples": [
                    {
                        "en": "‘What do you want?’ he asked, sounding slightly truculent.",
                        "vi": "Bạn muốn gì?' anh hỏi, có vẻ hơi đắc ý."
                    }
                ]
            }
        ]
    },
    {
        "id": "97de6f1c941a47489a93ac2aeb75e39f",
        "word": "vexed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/vekst/",
            "us": "/vekst/"
        },
        "nearby": [
            {
                "word": "vexation",
                "pos": "noun"
            },
            {
                "word": "vexatious",
                "pos": "adjective"
            },
            {
                "word": "vexed",
                "pos": "adjective"
            },
            {
                "word": "vexing",
                "pos": "adjective"
            },
            {
                "word": "VFW",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem that is difficult to deal with",
                    "vi": "một vấn đề khó giải quyết"
                },
                "examples": [
                    {
                        "en": "The conference spent days discussing the vexed question of border controls.",
                        "vi": "Hội nghị đã dành nhiều ngày để thảo luận về câu hỏi gây khó chịu về việc kiểm soát biên giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "upset or annoyed",
                    "vi": "khó chịu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Are you vexed with me?",
                        "vi": "Bạn có phật ý với tôi không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "c6faae251e1c46e0a8d81c18e5c4010e",
        "word": "work off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "workmate",
                "pos": "noun"
            },
            {
                "word": "work of art",
                "pos": "noun"
            },
            {
                "word": "work off",
                "pos": "phrasal verb"
            },
            {
                "word": "work on",
                "pos": "phrasal verb"
            },
            {
                "word": "work out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get rid of something, especially a strong feeling, by using physical effort",
                    "vi": "để thoát khỏi điều gì đó, đặc biệt là cảm giác mạnh, bằng cách sử dụng nỗ lực thể chất"
                },
                "examples": [
                    {
                        "en": "She worked off her anger by going for a walk.",
                        "vi": "Cô ấy đã giải tỏa cơn tức giận của mình bằng cách đi dạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to earn money in order to be able to pay a debt",
                    "vi": "kiếm tiền để có thể trả nợ"
                },
                "examples": [
                    {
                        "en": "They had a large bank loan to work off.",
                        "vi": "Họ đã có một khoản vay ngân hàng lớn để giải quyết."
                    }
                ]
            }
        ]
    }
]