[
    {
        "id": "e309b7c49ccb4b95a2b3e031ce673b46",
        "word": "rugby",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈrʌɡbi/",
            "us": "/ˈrʌɡbi/"
        },
        "nearby": [
            {
                "word": "ruffled",
                "pos": "adjective"
            },
            {
                "word": "rug",
                "pos": "noun"
            },
            {
                "word": "rugby",
                "pos": "noun"
            },
            {
                "word": "Rugby League",
                "pos": "noun"
            },
            {
                "word": "Rugby School",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game played by two teams of 13 or 15 players, using an oval ball which may be kicked or carried. Teams try to put the ball over the other team’s line.",
                    "vi": "một trò chơi được chơi bởi hai đội gồm 13 hoặc 15 người chơi, sử dụng một quả bóng hình bầu dục có thể được đá hoặc mang. Các đội cố gắng đưa bóng qua vạch vôi của đội kia."
                },
                "examples": [
                    {
                        "en": "to play a game of rugby",
                        "vi": "chơi một trò chơi bóng bầu dục"
                    },
                    {
                        "en": "Kids from six years old play mini rugby at the club.",
                        "vi": "Trẻ em từ sáu tuổi chơi bóng bầu dục mini tại câu lạc bộ."
                    },
                    {
                        "en": "a rugby club/match/player/team",
                        "vi": "một câu lạc bộ / trận đấu / cầu thủ / đội bóng bầu dục"
                    },
                    {
                        "en": "the Ireland rugby captain",
                        "vi": "đội trưởng bóng bầu dục Ireland"
                    }
                ]
            }
        ]
    },
    {
        "id": "b21c0bdd2c6d4f5f96b50c224cd20710",
        "word": "free kick",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌfriː ˈkɪk/",
            "us": "/ˌfriː ˈkɪk/"
        },
        "nearby": [
            {
                "word": "freeholder",
                "pos": "noun"
            },
            {
                "word": "free house",
                "pos": "noun"
            },
            {
                "word": "free kick",
                "pos": "noun"
            },
            {
                "word": "freelance",
                "pos": "adjective"
            },
            {
                "word": "freelance",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opportunity to kick the ball without any opposition, that is given to one team when the other team does something wrong",
                    "vi": "cơ hội để đá bóng mà không có bất kỳ sự chống đối nào, được trao cho một đội khi đội kia làm sai điều gì đó"
                },
                "examples": [
                    {
                        "en": "to take a free kick",
                        "vi": "sút phạt"
                    }
                ]
            }
        ]
    },
    {
        "id": "1ca8966273e3459c9a1b66f410a7ce18",
        "word": "throw-in",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈθrəʊ ɪn/",
            "us": "/ˈθrəʊ ɪn/"
        },
        "nearby": [
            {
                "word": "thrower",
                "pos": "noun"
            },
            {
                "word": "throw in",
                "pos": "phrasal verb"
            },
            {
                "word": "throw-in",
                "pos": "noun"
            },
            {
                "word": "throw into",
                "pos": "phrasal verb"
            },
            {
                "word": "thrown",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of throwing the ball back onto the playing field after it has gone outside the area",
                    "vi": "hành động ném bóng trở lại sân chơi sau khi bóng đã ra ngoài khu vực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "718d3fe294f64d4caab152c85830aa37",
        "word": "backline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæklaɪn/",
            "us": "/ˈbæklaɪn/"
        },
        "nearby": [
            {
                "word": "backlight",
                "pos": "noun"
            },
            {
                "word": "backlight",
                "pos": "verb"
            },
            {
                "word": "backline",
                "pos": "noun"
            },
            {
                "word": "backlink",
                "pos": "noun"
            },
            {
                "word": "backlink",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line marking the back of an area of play in a game",
                    "vi": "một dòng đánh dấu phía sau của một khu vực chơi trong một trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the players who form a line across the field behind the scrum or line-out",
                    "vi": "những người chơi xếp thành một hàng ngang trên sân sau màn đánh trống hoặc dàn hàng ngang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b498ee4420d4c3d9439ca2b87fb0b3d",
        "word": "conversion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈvɜːʃn/",
            "us": "/kənˈvɜːrʒn/"
        },
        "nearby": [
            {
                "word": "converse2",
                "pos": "noun"
            },
            {
                "word": "conversely",
                "pos": "adverb"
            },
            {
                "word": "conversion",
                "pos": "noun"
            },
            {
                "word": "conversion van",
                "pos": "noun"
            },
            {
                "word": "convert",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of changing something from one form, use or system to another",
                    "vi": "hành động hoặc quá trình thay đổi thứ gì đó từ một dạng, cách sử dụng hoặc hệ thống sang dạng khác"
                },
                "examples": [
                    {
                        "en": "Their main business is the conversion of farm buildings into family homes.",
                        "vi": "Hoạt động kinh doanh chính của họ là chuyển đổi các tòa nhà nông trại thành nhà ở gia đình."
                    },
                    {
                        "en": "Conversion to gas central heating will save you a lot of money.",
                        "vi": "Việc chuyển đổi sang hệ thống sưởi trung tâm bằng gas sẽ giúp bạn tiết kiệm rất nhiều tiền."
                    },
                    {
                        "en": "No conversion from analogue to digital data is needed.",
                        "vi": "Không cần chuyển đổi từ dữ liệu tương tự sang dữ liệu kỹ thuật số."
                    },
                    {
                        "en": "a metric conversion table (= showing how to change metric amounts into or out of another system)",
                        "vi": "bảng chuyển đổi số liệu (= hiển thị cách thay đổi số lượng chỉ số vào hoặc ra khỏi hệ thống khác)"
                    },
                    {
                        "en": "a firm which specializes in house conversions (= turning large houses into several smaller flats)",
                        "vi": "một công ty chuyên về chuyển đổi nhà (= chuyển những ngôi nhà lớn thành một số căn hộ nhỏ hơn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process or experience of changing somebody's or your own religion or beliefs",
                    "vi": "quá trình hoặc kinh nghiệm thay đổi tôn giáo hoặc tín ngưỡng của ai đó hoặc của riêng bạn"
                },
                "examples": [
                    {
                        "en": "the conversion of the Anglo-Saxons by Christian missionaries",
                        "vi": "sự cải đạo của người Anglo-Saxon bởi các nhà truyền giáo Cơ đốc"
                    },
                    {
                        "en": "his conversion from Judaism to Christianity",
                        "vi": "sự chuyển đổi của anh ấy từ Do Thái giáo sang Cơ đốc giáo"
                    },
                    {
                        "en": "Late in life she experienced a religious conversion.",
                        "vi": "Cuối đời, cô đã trải qua một cuộc cải đạo."
                    },
                    {
                        "en": "She began by supporting monetarist economics, but later underwent quite a conversion when she saw how it increased unemployment.",
                        "vi": "Cô ấy bắt đầu bằng việc ủng hộ kinh tế học tiền tệ, nhưng sau đó đã trải qua một cuộc chuyển đổi khá lớn khi cô ấy chứng kiến tỷ lệ thất nghiệp gia tăng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of scoring extra points after scoring a try or a touchdown",
                    "vi": "một cách ghi thêm điểm sau khi ghi một lần thử hoặc một lần chạm"
                },
                "examples": [
                    {
                        "en": "The try came in the third minute and Jon Bland added the conversion.",
                        "vi": "Lần thử đến ở phút thứ ba và Jon Bland đã thêm chuyển đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building or room that has been changed so that it can be used for a different purpose, especially for living in",
                    "vi": "một tòa nhà hoặc căn phòng đã được thay đổi để có thể được sử dụng cho một mục đích khác, đặc biệt là để ở"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e7732ff732d3452c9234a8b5985eb505",
        "word": "convert",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈvɜːt/",
            "us": "/kənˈvɜːrt/"
        },
        "nearby": [
            {
                "word": "conversion",
                "pos": "noun"
            },
            {
                "word": "conversion van",
                "pos": "noun"
            },
            {
                "word": "convert",
                "pos": "verb"
            },
            {
                "word": "convert",
                "pos": "noun"
            },
            {
                "word": "converter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change or make something change from one form, purpose, system, etc. to another",
                    "vi": "để thay đổi hoặc thực hiện một cái gì đó thay đổi từ một hình thức, mục đích, hệ thống, v.v. sang hình thức khác"
                },
                "examples": [
                    {
                        "en": "convert something They took just nine months to convert the building.",
                        "vi": "chuyển đổi thứ gì đó Họ chỉ mất chín tháng để chuyển đổi tòa nhà."
                    },
                    {
                        "en": "You need to ensure that you've converted the data properly.",
                        "vi": "Bạn cần đảm bảo rằng bạn đã chuyển đổi dữ liệu đúng cách."
                    },
                    {
                        "en": "The pub is a converted warehouse.",
                        "vi": "Quán rượu là một nhà kho đã được chuyển đổi."
                    },
                    {
                        "en": "convert something into something The hotel is going to be converted into a nursing home.",
                        "vi": "chuyển đổi một cái gì đó thành một cái gì đó Khách sạn sẽ được chuyển đổi thành một viện dưỡng lão."
                    },
                    {
                        "en": "What rate will I get if I convert my dollars into euros?",
                        "vi": "Tôi sẽ nhận được tỷ giá bao nhiêu nếu chuyển đô la của mình sang euro?"
                    },
                    {
                        "en": "convert something to something The system is eco-friendly because the waste heat is converted to electricity.",
                        "vi": "chuyển đổi thứ gì đó thành thứ gì đó Hệ thống thân thiện với môi trường vì nhiệt thải được chuyển hóa thành điện năng."
                    },
                    {
                        "en": "convert from something Japan was at the time still converting from an agricultural economy.",
                        "vi": "chuyển đổi từ một thứ mà Nhật Bản lúc đó vẫn đang chuyển đổi từ nền kinh tế nông nghiệp."
                    },
                    {
                        "en": "convert into/to something A lot of conventional farmers have converted to organic production.",
                        "vi": "Chuyển đổi thành / sang thứ gì đó Rất nhiều nông dân thông thường đã chuyển đổi sang sản xuất hữu cơ."
                    },
                    {
                        "en": "convert from something to something We've converted from oil to gas central heating.",
                        "vi": "chuyển đổi từ một cái gì đó thành một cái gì đó Chúng tôi đã chuyển đổi từ dầu sang khí đốt sưởi ấm trung tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be changed from one form, purpose, or system to another",
                    "vi": "để có thể được thay đổi từ hình thức, mục đích hoặc hệ thống này sang hình thức, mục đích hoặc hệ thống khác"
                },
                "examples": [
                    {
                        "en": "a sofa that converts into a bed",
                        "vi": "ghế sofa có thể chuyển đổi thành giường ngủ"
                    },
                    {
                        "en": "In fruits, starch converts into sugar.",
                        "vi": "Trong trái cây, tinh bột chuyển hóa thành đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change your religion or beliefs; to make somebody change their religion or beliefs",
                    "vi": "để thay đổi tôn giáo hoặc tín ngưỡng của bạn; để khiến ai đó thay đổi tôn giáo hoặc tín ngưỡng của họ"
                },
                "examples": [
                    {
                        "en": "convert from something He converted from Catholicism 20 years ago.",
                        "vi": "chuyển đổi từ một cái gì đó Ông đã cải đạo từ Công giáo 20 năm trước."
                    },
                    {
                        "en": "convert to something She converted to Judaism to marry him.",
                        "vi": "Cô cải sang đạo Do Thái để cưới anh."
                    },
                    {
                        "en": "convert from something to something He converted from Christianity to Islam.",
                        "vi": "chuyển đổi từ một cái gì đó sang một cái gì đó Ông đã chuyển đổi từ Cơ đốc giáo sang Hồi giáo."
                    },
                    {
                        "en": "convert somebody from something Evangelical Christian groups tried to convert local people from their indigenous religions.",
                        "vi": "chuyển đổi ai đó từ một cái gì đó Các nhóm Cơ đốc giáo Tin lành đã cố gắng chuyển đổi người dân địa phương khỏi các tôn giáo bản địa của họ."
                    },
                    {
                        "en": "convert somebody to something She was soon converted to the socialist cause.",
                        "vi": "chuyển đổi ai đó thành một cái gì đó Cô ấy đã sớm được chuyển đổi sang sự nghiệp xã hội chủ nghĩa."
                    },
                    {
                        "en": "convert somebody from something to something Mongolia was converted from shamanism to Buddhism in the late 16th century.",
                        "vi": "Chuyển đổi ai đó từ một cái gì đó sang một cái gì đó Mông Cổ đã được chuyển đổi từ Shaman giáo sang Phật giáo vào cuối thế kỷ 16."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change an opinion, a habit, etc.",
                    "vi": "để thay đổi một quan điểm, một thói quen, v.v."
                },
                "examples": [
                    {
                        "en": "convert (from something) to something I've converted to organic food.",
                        "vi": "chuyển đổi (từ một cái gì đó) sang một cái gì đó mà tôi đã chuyển đổi thành thực phẩm hữu cơ."
                    },
                    {
                        "en": "convert somebody (from something) (to something) I didn't use to like opera but my husband has converted me.",
                        "vi": "chuyển đổi ai đó (từ cái gì đó) (thành cái gì đó) Tôi không thích opera nhưng chồng tôi đã chuyển đổi tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to score extra points after a try or a touchdown",
                    "vi": "để ghi thêm điểm sau một lần thử hoặc một lần chạm xuống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to speak to people in support of views that they already hold",
                    "vi": "nói chuyện với những người ủng hộ các quan điểm mà họ đã có"
                },
                "examples": [
                    {
                        "en": "I realize I may be preaching to the converted, but I think he's gorgeous.",
                        "vi": "Tôi nhận ra rằng tôi có thể đang giảng cho những người đã cải đạo, nhưng tôi nghĩ anh ấy thật tuyệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "edec01c4f7d64d29ae054896dfd0f8be",
        "word": "drop goal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɒp ɡəʊl/",
            "us": "/ˈdrɑːp ɡəʊl/"
        },
        "nearby": [
            {
                "word": "drop-dead",
                "pos": "adverb"
            },
            {
                "word": "drop-down menu",
                "pos": "noun"
            },
            {
                "word": "drop goal",
                "pos": "noun"
            },
            {
                "word": "drop handlebars",
                "pos": "noun"
            },
            {
                "word": "drop in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a goal scored by dropping the ball onto the ground and kicking it over the crossbar as it bounces",
                    "vi": "một bàn thắng được ghi bằng cách thả bóng xuống đất và sút nó qua xà ngang khi nó nảy lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be76210ba7c34703870d3a9d49290754",
        "word": "drop kick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɒp kɪk/",
            "us": "/ˈdrɑːp kɪk/"
        },
        "nearby": [
            {
                "word": "drop in on",
                "pos": "phrasal verb"
            },
            {
                "word": "drop into",
                "pos": "phrasal verb"
            },
            {
                "word": "drop kick",
                "pos": "noun"
            },
            {
                "word": "drop-kick",
                "pos": "verb"
            },
            {
                "word": "droplet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kick made by dropping the ball onto the ground and kicking it as it bounces",
                    "vi": "một cú đá được thực hiện bằng cách thả quả bóng xuống đất và đá nó khi nó nảy lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aaa84f985d3646faa03e69289a519aae",
        "word": "drop-kick",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɒp kɪk/",
            "us": "/ˈdrɑːp kɪk/"
        },
        "nearby": [
            {
                "word": "drop into",
                "pos": "phrasal verb"
            },
            {
                "word": "drop kick",
                "pos": "noun"
            },
            {
                "word": "drop-kick",
                "pos": "verb"
            },
            {
                "word": "droplet",
                "pos": "noun"
            },
            {
                "word": "drop off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to drop the ball onto the ground and kick it as it bounces",
                    "vi": "thả quả bóng xuống đất và đá nó khi nó nảy lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "800ce95462de41eea7cdd26796db22e0",
        "word": "field goal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfiːld ɡəʊl/",
            "us": "/ˈfiːld ɡəʊl/"
        },
        "nearby": [
            {
                "word": "field event",
                "pos": "noun"
            },
            {
                "word": "field glasses",
                "pos": "noun"
            },
            {
                "word": "field goal",
                "pos": "noun"
            },
            {
                "word": "field hand",
                "pos": "noun"
            },
            {
                "word": "field hockey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a goal scored by kicking the ball over the bar of the goal",
                    "vi": "một bàn thắng được ghi bằng cách sút bóng đi vọt xà ngang khung thành"
                },
                "examples": [
                    {
                        "en": "Two field goals gave the Tigers an early lead.",
                        "vi": "Hai bàn thắng đã giúp những chú hổ sớm dẫn trước."
                    },
                    {
                        "en": "Bahr made his fifth field goal of the day.",
                        "vi": "Bahr có bàn thắng thứ 5 trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a goal scored by throwing the ball through the net during normal play",
                    "vi": "một bàn thắng được ghi bằng cách ném bóng qua lưới trong khi chơi bình thường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e356274f4335494d993efbed28524528",
        "word": "flanker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæŋkə(r)/",
            "us": "/ˈflæŋkər/"
        },
        "nearby": [
            {
                "word": "flank",
                "pos": "noun"
            },
            {
                "word": "flank",
                "pos": "verb"
            },
            {
                "word": "flanker",
                "pos": "noun"
            },
            {
                "word": "flannel",
                "pos": "noun"
            },
            {
                "word": "flannelette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attacking player in rugby or American football",
                    "vi": "một cầu thủ tấn công trong bóng bầu dục hoặc bóng bầu dục Mỹ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3a5d0545a8264266b87b2d534202e70d",
        "word": "fly half",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌflaɪ ˈhɑːf/",
            "us": "/ˌflaɪ ˈhæf/"
        },
        "nearby": [
            {
                "word": "flyer",
                "pos": "noun"
            },
            {
                "word": "fly fishing",
                "pos": "noun"
            },
            {
                "word": "fly half",
                "pos": "noun"
            },
            {
                "word": "flying",
                "pos": "adjective"
            },
            {
                "word": "flying",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player who plays behind the scrum half",
                    "vi": "một cầu thủ chơi phía sau hiệp đấu scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3bcb32cf70bc4dfba4fede3fcb16d405",
        "word": "full back",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊl bæk/",
            "us": "/ˈfʊl bæk/"
        },
        "nearby": [
            {
                "word": "full",
                "pos": "adjective"
            },
            {
                "word": "full",
                "pos": "adverb"
            },
            {
                "word": "full back",
                "pos": "noun"
            },
            {
                "word": "full beam",
                "pos": "noun"
            },
            {
                "word": "full-blooded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the defending players in football (soccer), hockey or rugby whose position is near the goal they are defending. In soccer, they play on the left and right sides of the field.",
                    "vi": "một trong những cầu thủ phòng ngự trong bóng đá (bóng đá), khúc côn cầu hoặc bóng bầu dục có vị trí gần khung thành mà họ đang bảo vệ. Trong bóng đá, họ chơi ở hai bên trái và phải của sân."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the attacking player in American football whose position is behind the quarterback and next to the half backs",
                    "vi": "cầu thủ tấn công trong bóng đá Mỹ có vị trí phía sau tiền vệ và bên cạnh hậu vệ cánh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the position a full back plays at",
                    "vi": "vị trí hậu vệ cánh chơi ở"
                },
                "examples": [
                    {
                        "en": "Hunter is at full back.",
                        "vi": "Hunter đã trở lại đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "5092cc95edcc4ed0aed02a39aec7179c",
        "word": "half back",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːf bæk/",
            "us": "/ˈhæf bæk/"
        },
        "nearby": [
            {
                "word": "half-and-half",
                "pos": "adjective"
            },
            {
                "word": "half-arsed",
                "pos": "adjective"
            },
            {
                "word": "half back",
                "pos": "noun"
            },
            {
                "word": "half-baked",
                "pos": "adjective"
            },
            {
                "word": "half bath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the defending players in hockey or rugby whose position is between those who play at the front of a team and those who play at the back",
                    "vi": "một trong những cầu thủ phòng thủ trong môn khúc côn cầu hoặc bóng bầu dục có vị trí giữa những người chơi ở phía trước của một đội và những người chơi ở phía sau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the two attacking players in American football whose position is behind the quarterback and next to the full backs",
                    "vi": "một trong hai cầu thủ tấn công của bóng đá Mỹ có vị trí phía sau hậu vệ cánh và bên cạnh hậu vệ cánh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the position a half back plays at (also called a tailback in American football)",
                    "vi": "vị trí một nửa hậu vệ chơi ở (còn được gọi là hậu vệ trong môn bóng bầu dục Mỹ)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7163d5be19654dda919b8e267d18ff06",
        "word": "handoff",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhændɒf/",
            "us": "/ˈhændɔːf/"
        },
        "nearby": [
            {
                "word": "hand-me-up",
                "pos": "noun"
            },
            {
                "word": "hand off",
                "pos": "phrasal verb"
            },
            {
                "word": "handoff",
                "pos": "noun"
            },
            {
                "word": "hand on",
                "pos": "phrasal verb"
            },
            {
                "word": "hand out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of preventing an opponent from tackling you by blocking them with your hand while keeping your arm straight",
                    "vi": "một hành động ngăn cản đối thủ xử lý bạn bằng cách dùng tay chặn họ trong khi vẫn giữ thẳng cánh tay của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of giving the ball to another player on your team",
                    "vi": "một hành động đưa bóng cho một cầu thủ khác trong đội của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0a38897d7b0541b68b5a438d6d532d0a",
        "word": "hooker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʊkə(r)/",
            "us": "/ˈhʊkər/"
        },
        "nearby": [
            {
                "word": "hook and eye",
                "pos": "noun"
            },
            {
                "word": "hooked",
                "pos": "adjective"
            },
            {
                "word": "hooker",
                "pos": "noun"
            },
            {
                "word": "hookey",
                "pos": ""
            },
            {
                "word": "hook shot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the player in a rugby team, whose job is to pull the ball out of the scrum with his foot",
                    "vi": "cầu thủ trong đội bóng bầu dục, người có công việc là dùng chân kéo quả bóng ra khỏi trận đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who works as a prostitute",
                    "vi": "một người hành nghề mại dâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31f7a85821cf4c0498a942ce2ab29929",
        "word": "in-goal area",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪn ɡəʊl eəriə/",
            "us": "/ˈɪn ɡəʊl eriə/"
        },
        "nearby": [
            {
                "word": "inglorious",
                "pos": "adjective"
            },
            {
                "word": "ingloriously",
                "pos": "adverb"
            },
            {
                "word": "in-goal area",
                "pos": "noun"
            },
            {
                "word": "ingot",
                "pos": "noun"
            },
            {
                "word": "ingrained",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area between the goal line and the line at the end of the field, inside which a player must put the ball in order to score a try",
                    "vi": "khu vực giữa đường cầu môn và đường cuối sân, bên trong đó một cầu thủ phải đặt bóng để ghi bàn."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "097801879c314bc2a4cb7bbb23accea4",
        "word": "kicker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɪkə(r)/",
            "us": "/ˈkɪkər/"
        },
        "nearby": [
            {
                "word": "kick-boxing",
                "pos": "noun"
            },
            {
                "word": "kick drum",
                "pos": "noun"
            },
            {
                "word": "kicker",
                "pos": "noun"
            },
            {
                "word": "kick in",
                "pos": "phrasal verb"
            },
            {
                "word": "kicking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who kicks, especially the player in a sports team who kicks the ball to try to score points, for example in rugby",
                    "vi": "một người đá bóng, đặc biệt là cầu thủ trong đội thể thao đá bóng để cố gắng ghi điểm, ví dụ như trong môn bóng bầu dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a surprising end to a series of events",
                    "vi": "một kết thúc đáng ngạc nhiên cho một loạt các sự kiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0654b07864ac4159af55fbcc60bd5c58",
        "word": "line-out",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪn aʊt/",
            "us": "/ˈlaɪn aʊt/"
        },
        "nearby": [
            {
                "word": "line of scrimmage",
                "pos": "noun"
            },
            {
                "word": "line of sight",
                "pos": "noun"
            },
            {
                "word": "line-out",
                "pos": "noun"
            },
            {
                "word": "line printer",
                "pos": "noun"
            },
            {
                "word": "liner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation that happens when the ball goes out of play, when players from each team stand in opposite lines and jump to try to catch the ball when it is thrown back in",
                    "vi": "một tình huống xảy ra khi bóng bay ra ngoài cuộc chơi, khi các cầu thủ của mỗi đội đứng ở hai hàng đối diện và nhảy lên để cố gắng đỡ bóng khi bóng được ném trở lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0fce9165b114287b8854153f7e6b8c5",
        "word": "lock",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lɒk/",
            "us": "/lɑːk/"
        },
        "nearby": [
            {
                "word": "loci",
                "pos": "noun"
            },
            {
                "word": "lock",
                "pos": "verb"
            },
            {
                "word": "lock",
                "pos": "noun"
            },
            {
                "word": "lockable",
                "pos": "adjective"
            },
            {
                "word": "lock away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that keeps a door, window, box, etc. shut, usually needing a key to open it",
                    "vi": "một thiết bị đóng cửa, cửa sổ, hộp, v.v., thường cần chìa khóa để mở"
                },
                "examples": [
                    {
                        "en": "She turned the key in the lock.",
                        "vi": "Cô vặn chìa khóa vào ổ khóa."
                    },
                    {
                        "en": "It's a good idea to have locks fitted on all your windows.",
                        "vi": "Bạn nên lắp ổ khóa trên tất cả các cửa sổ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that prevents a vehicle, machine or piece of equipment from being used",
                    "vi": "thiết bị ngăn phương tiện, máy móc hoặc thiết bị được sử dụng"
                },
                "examples": [
                    {
                        "en": "a bicycle lock",
                        "vi": "khóa xe đạp"
                    },
                    {
                        "en": "a steering lock",
                        "vi": "một khóa lái"
                    },
                    {
                        "en": "safety locks for handguns",
                        "vi": "khóa an toàn cho súng ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a feature on a computer or mobile phone that prevents somebody from accessing it without a code",
                    "vi": "một tính năng trên máy tính hoặc điện thoại di động ngăn ai đó truy cập vào nó mà không có mã"
                },
                "examples": [
                    {
                        "en": "There's a security lock on the phone.",
                        "vi": "Có một khóa bảo mật trên điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state in which the parts of a machine, etc. do not move",
                    "vi": "trạng thái mà các bộ phận của máy, v.v. không chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the amount that the front wheels can be turned in one direction or the other in order to turn the vehicle",
                    "vi": "số lượng bánh trước có thể quay theo hướng này hay hướng khác để quay đầu xe"
                },
                "examples": [
                    {
                        "en": "I had the steering wheel on full lock (= I had turned it as far as it would turn).",
                        "vi": "Tôi đã khóa tay lái hoàn toàn (= Tôi đã bẻ lái hết cỡ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of canal or river with a gate at either end, in which the water level can be changed so that boats can move from one level of the canal or river to another",
                    "vi": "một đoạn kênh hoặc sông có cửa ở hai đầu, mực nước có thể thay đổi để tàu thuyền có thể di chuyển từ kênh, sông này sang mực nước khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a few hairs that hang or lie together on your head",
                    "vi": "một vài sợi tóc buông thõng hoặc nằm lại với nhau trên đầu của bạn"
                },
                "examples": [
                    {
                        "en": "John brushed a lock of hair from his eyes.",
                        "vi": "John vuốt một lọn tóc trên mắt."
                    },
                    {
                        "en": "She kept a lock of her mother’s hair.",
                        "vi": "Cô ấy giữ một lọn tóc của mẹ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s hair",
                    "vi": "tóc của một người"
                },
                "examples": [
                    {
                        "en": "She shook her long, flowing locks.",
                        "vi": "Cô lắc những lọn tóc dài đang chảy của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a player in the second row of the scrum",
                    "vi": "một người chơi ở hàng thứ hai của trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "total control of something",
                    "vi": "kiểm soát hoàn toàn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "One company had a virtual lock on all orange juice sales in the state.",
                        "vi": "Một công ty đã khóa ảo tất cả doanh số bán nước cam trong tiểu bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "including everything",
                    "vi": "bao gồm tất cả mọi thứ"
                },
                "examples": [
                    {
                        "en": "He sold the business lock, stock and barrel.",
                        "vi": "Anh ta đã bán khóa kinh doanh, cổ phiếu và thùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "locked up safely somewhere; in prison",
                    "vi": "bị nhốt an toàn ở một nơi nào đó; trong nhà tù"
                },
                "examples": [
                    {
                        "en": "We keep our valuables under lock and key.",
                        "vi": "Chúng tôi giữ các vật có giá trị của chúng tôi trong khóa và chìa khóa."
                    },
                    {
                        "en": "I will not rest until the murderer is under lock and key.",
                        "vi": "Tôi sẽ không nghỉ ngơi cho đến khi kẻ sát nhân bị khóa và chìa khóa."
                    },
                    {
                        "en": "Prisoners are kept under lock and key 24 hours a day.",
                        "vi": "Các tù nhân được giữ trong khóa và chìa khóa 24 giờ một ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f82ca63d9174d0a83c3acdeb496416c",
        "word": "loose forward",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌluːs ˈfɔːwəd/",
            "us": "/ˌluːs ˈfɔːrwərd/"
        },
        "nearby": [
            {
                "word": "loose end",
                "pos": "noun"
            },
            {
                "word": "loose-fitting",
                "pos": "adjective"
            },
            {
                "word": "loose forward",
                "pos": "noun"
            },
            {
                "word": "loose head",
                "pos": "noun"
            },
            {
                "word": "loose-leaf",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player who plays at the back of the scrum",
                    "vi": "một người chơi ở phía sau của scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fc175b7a37db4475840dfdb18ff12b76",
        "word": "loose head",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌluːs ˈhed/",
            "us": "/ˌluːs ˈhed/"
        },
        "nearby": [
            {
                "word": "loose-fitting",
                "pos": "adjective"
            },
            {
                "word": "loose forward",
                "pos": "noun"
            },
            {
                "word": "loose head",
                "pos": "noun"
            },
            {
                "word": "loose-leaf",
                "pos": "adjective"
            },
            {
                "word": "loose-limbed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the player in the front row of a team in the scrum who is nearest to where the ball is put in",
                    "vi": "người chơi ở hàng trước của một đội trong trò chơi xếp hạng người gần nơi đặt bóng nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "132405b804424389b5715841829b34d5",
        "word": "no side",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnəʊ ˈsaɪd/",
            "us": "/ˌnəʊ ˈsaɪd/"
        },
        "nearby": [
            {
                "word": "no-show",
                "pos": "noun"
            },
            {
                "word": "nosh-up",
                "pos": "noun"
            },
            {
                "word": "no side",
                "pos": "noun"
            },
            {
                "word": "nosily",
                "pos": "adverb"
            },
            {
                "word": "nosiness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the end of the game",
                    "vi": "kết thúc trò chơi"
                },
                "examples": [
                    {
                        "en": "The whistle went for no side.",
                        "vi": "Tiếng còi không đi về phía nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "1586d02686b347b483f4d3ac620411b8",
        "word": "place kick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpleɪs kɪk/",
            "us": "/ˈpleɪs kɪk/"
        },
        "nearby": [
            {
                "word": "placed",
                "pos": "adjective"
            },
            {
                "word": "placeholder",
                "pos": "noun"
            },
            {
                "word": "place kick",
                "pos": "noun"
            },
            {
                "word": "placeman",
                "pos": "noun"
            },
            {
                "word": "place mat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a kick made by putting the ball on the ground first",
                    "vi": "một cú đá được thực hiện bằng cách đặt quả bóng xuống đất trước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c40ce8da32b74a5ab589d9585b45aba3",
        "word": "prop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɒp/",
            "us": "/prɑːp/"
        },
        "nearby": [
            {
                "word": "proofread",
                "pos": "verb"
            },
            {
                "word": "proofreader",
                "pos": "noun"
            },
            {
                "word": "prop",
                "pos": "noun"
            },
            {
                "word": "prop",
                "pos": "verb"
            },
            {
                "word": "propaganda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of wood, metal, etc. used to support something or keep it in position",
                    "vi": "một miếng gỗ, kim loại, v.v. được sử dụng để hỗ trợ một cái gì đó hoặc giữ cho nó ở vị trí"
                },
                "examples": [
                    {
                        "en": "Rescuers used props to stop the roof of the tunnel collapsing.",
                        "vi": "Lực lượng cứu hộ dùng đạo cụ để ngăn mái hầm sập."
                    },
                    {
                        "en": "a pit prop (= one used in a coal mine)",
                        "vi": "một giá đỡ hầm lò (= một cái được sử dụng trong một mỏ than)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that gives help or support to somebody/something that is weak",
                    "vi": "một người hoặc vật giúp đỡ hoặc hỗ trợ ai đó / thứ gì đó yếu đuối"
                },
                "examples": [
                    {
                        "en": "After being the emotional prop he needed for so long, she dared not leave him.",
                        "vi": "Sau khi là chỗ dựa tình cảm mà anh cần bao lâu nay, cô không dám rời xa anh."
                    },
                    {
                        "en": "Many people use alcohol as a social prop.",
                        "vi": "Nhiều người sử dụng rượu như một phương tiện xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small object used by actors during the performance of a play or in a film",
                    "vi": "một đồ vật nhỏ được các diễn viên sử dụng khi trình diễn vở kịch hoặc trong một bộ phim"
                },
                "examples": [
                    {
                        "en": "He is responsible for all the stage props and lighting.",
                        "vi": "Anh ấy chịu trách nhiệm về tất cả các đạo cụ sân khấu và ánh sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a player on either side of the front row of a scrum",
                    "vi": "một người chơi ở hai bên của hàng trước của một scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8a8c6575c381452588e985f9bc8d201f",
        "word": "punt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pʌnt/",
            "us": "/pʌnt/"
        },
        "nearby": [
            {
                "word": "punnet",
                "pos": "noun"
            },
            {
                "word": "punster",
                "pos": "noun"
            },
            {
                "word": "punt",
                "pos": "noun"
            },
            {
                "word": "punt",
                "pos": "verb"
            },
            {
                "word": "punter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long shallow boat with a flat bottom and square ends which is moved by pushing the end of a long pole against the bottom of a river",
                    "vi": "một chiếc thuyền cạn dài có đáy bằng và hai đầu hình vuông được chuyển động bằng cách đẩy đầu của một chiếc cọc dài xuống đáy sông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a bet",
                    "vi": "một cuộc cá cược"
                },
                "examples": [
                    {
                        "en": "The investment is little more than a punt.",
                        "vi": "Khoản đầu tư ít hơn một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long kick made after dropping the ball from your hands",
                    "vi": "một cú đá dài được thực hiện sau khi đánh rơi bóng khỏi tay bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the former unit of money in the Republic of Ireland (replaced in 2002 by the euro)",
                    "vi": "đơn vị tiền cũ của Cộng hòa Ireland (được thay thế bằng đồng euro vào năm 2002)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose something that involves some risk",
                    "vi": "để chọn một cái gì đó có một số rủi ro"
                },
                "examples": [
                    {
                        "en": "Our first impressions aren't great, but I'm willing to take a punt on it.",
                        "vi": "Ấn tượng đầu tiên của chúng tôi không tuyệt vời, nhưng tôi sẵn sàng tham gia vào điều đó."
                    },
                    {
                        "en": "Adventurous new investors might want to have a punt.",
                        "vi": "Các nhà đầu tư mới mạo hiểm có thể muốn tham gia một khoản tiền nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something",
                    "vi": "cố gắng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He took a punt at explaining why he'd done it.",
                        "vi": "Anh ấy đã cố gắng giải thích lý do tại sao anh ấy đã làm điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab754c83697a41f6834115e032499011",
        "word": "put-in",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊt ɪn/",
            "us": "/ˈpʊt ɪn/"
        },
        "nearby": [
            {
                "word": "put forward",
                "pos": "phrasal verb"
            },
            {
                "word": "put in",
                "pos": "phrasal verb"
            },
            {
                "word": "put-in",
                "pos": "noun"
            },
            {
                "word": "put in for",
                "pos": "phrasal verb"
            },
            {
                "word": "put into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of putting the ball into scrum",
                    "vi": "hành động đưa quả bóng vào scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41178321279f443a8bb86da83c87d97f",
        "word": "ruck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌk/",
            "us": "/rʌk/"
        },
        "nearby": [
            {
                "word": "ruche",
                "pos": "noun"
            },
            {
                "word": "ruched",
                "pos": "adjective"
            },
            {
                "word": "ruck",
                "pos": "noun"
            },
            {
                "word": "ruck",
                "pos": "verb"
            },
            {
                "word": "rucksack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of players who gather round the ball when it is lying on the ground and push each other in order to get the ball",
                    "vi": "một nhóm người chơi tụ tập quanh quả bóng khi nó đang nằm trên mặt đất và xô đẩy nhau để lấy quả bóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of people standing closely together or fighting",
                    "vi": "một nhóm người đứng gần nhau hoặc chiến đấu"
                },
                "examples": [
                    {
                        "en": "He pushed his way through the ruck of drinkers to get to the bar.",
                        "vi": "Anh ta lách mình qua làn đường ồn ào của những người uống rượu để đến quán bar."
                    },
                    {
                        "en": "When the police arrived, it soon turned into an ugly ruck.",
                        "vi": "Khi cảnh sát đến, nó nhanh chóng biến thành một vụ ồn ào xấu xí."
                    }
                ]
            },
            {
                "define": {
                    "en": "ordinary people or events",
                    "vi": "người bình thường hoặc sự kiện"
                },
                "examples": [
                    {
                        "en": "She saw marriage to him as a way out of the ruck.",
                        "vi": "Cô xem cuộc hôn nhân với anh ta như một cách thoát khỏi những rắc rối."
                    }
                ]
            }
        ]
    },
    {
        "id": "bf0cc58097fa47c79f1119561f056911",
        "word": "Rugby League",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrʌɡbi ˈliːɡ/",
            "us": "/ˌrʌɡbi ˈliːɡ/"
        },
        "nearby": [
            {
                "word": "rug",
                "pos": "noun"
            },
            {
                "word": "rugby",
                "pos": "noun"
            },
            {
                "word": "Rugby League",
                "pos": "noun"
            },
            {
                "word": "Rugby School",
                "pos": ""
            },
            {
                "word": "Rugby Union",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a form of rugby, with 13 players in a team",
                    "vi": "một hình thức bóng bầu dục, với 13 người chơi trong một đội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7d0580e12a37451ab5973059be6cdf38",
        "word": "Rugby Union",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrʌɡbi ˈjuːniən/",
            "us": "/ˌrʌɡbi ˈjuːniən/"
        },
        "nearby": [
            {
                "word": "Rugby League",
                "pos": "noun"
            },
            {
                "word": "Rugby School",
                "pos": ""
            },
            {
                "word": "Rugby Union",
                "pos": "noun"
            },
            {
                "word": "rugged",
                "pos": "adjective"
            },
            {
                "word": "ruggedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a form of rugby, with 15 players in a team",
                    "vi": "một hình thức bóng bầu dục, với 15 người chơi trong một đội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1c1f542ec670465893210b469f1e857f",
        "word": "rugger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌɡə(r)/",
            "us": "/ˈrʌɡər/"
        },
        "nearby": [
            {
                "word": "ruggedly",
                "pos": "adverb"
            },
            {
                "word": "ruggedness",
                "pos": "noun"
            },
            {
                "word": "rugger",
                "pos": "noun"
            },
            {
                "word": "rugger-bugger",
                "pos": "noun"
            },
            {
                "word": "rug rat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "Rugby Union (= a form of rugby, with 15 players in a team)",
                    "vi": "Rugby Union (= một hình thức bóng bầu dục, với 15 người chơi trong một đội)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "05943dded4c94c9ba3b9c8e642053a74",
        "word": "scrum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skrʌm/",
            "us": "/skrʌm/"
        },
        "nearby": [
            {
                "word": "scruffiness",
                "pos": "noun"
            },
            {
                "word": "scruffy",
                "pos": "adjective"
            },
            {
                "word": "scrum",
                "pos": "noun"
            },
            {
                "word": "scrum half",
                "pos": "noun"
            },
            {
                "word": "scrummage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a rugby game when players from both sides link themselves together in a group, with their heads down, and push against the other side. The ball is then thrown between them and each side tries to get it.",
                    "vi": "một phần của trò chơi bóng bầu dục khi người chơi của cả hai bên liên kết với nhau thành một nhóm, cúi đầu xuống và chống lại bên kia. Sau đó, quả bóng được ném vào giữa họ và mỗi bên cố gắng lấy nó."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the group of players who link themselves together in a scrum",
                    "vi": "nhóm người chơi tự liên kết với nhau trong một trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a crowd of people who are pushing each other",
                    "vi": "một đám đông đang xô đẩy nhau"
                },
                "examples": [
                    {
                        "en": "There was a real scrum when the bus arrived.",
                        "vi": "Đã có một tiếng ẩu đả thực sự khi xe buýt đến."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ccdfa6b5e194d66af01716bd3b03e8b",
        "word": "scrum half",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌskrʌm ˈhɑːf/",
            "us": "/ˌskrʌm ˈhæf/"
        },
        "nearby": [
            {
                "word": "scruffy",
                "pos": "adjective"
            },
            {
                "word": "scrum",
                "pos": "noun"
            },
            {
                "word": "scrum half",
                "pos": "noun"
            },
            {
                "word": "scrummage",
                "pos": "noun"
            },
            {
                "word": "scrummage",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player who puts the ball into the scrum",
                    "vi": "một người chơi đưa bóng vào trò chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d100571ceaca415c915dd6a254df54d8",
        "word": "stand-off half",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌstænd ɒf ˈhɑːf/",
            "us": "/ˌstænd ɔːf ˈhæf/"
        },
        "nearby": [
            {
                "word": "standing water",
                "pos": "noun"
            },
            {
                "word": "stand-off",
                "pos": "noun"
            },
            {
                "word": "stand-off half",
                "pos": "noun"
            },
            {
                "word": "stand-offish",
                "pos": "adjective"
            },
            {
                "word": "stand out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a player who plays behind the scrum half",
                    "vi": "một cầu thủ chơi phía sau hiệp đấu scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7cc355c1d35242ae92f65f2f4816317d",
        "word": "tap penalty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtæp ˈpenəlti/",
            "us": "/ˌtæp ˈpenəlti/"
        },
        "nearby": [
            {
                "word": "tap out",
                "pos": "phrasal verb"
            },
            {
                "word": "tappa",
                "pos": "noun"
            },
            {
                "word": "tap penalty",
                "pos": "noun"
            },
            {
                "word": "taproom",
                "pos": "noun"
            },
            {
                "word": "taproot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation where a player is allowed a free kick of the ball because the other team has broken a rule, and chooses to touch it lightly with the foot then immediately pick it up",
                    "vi": "tình huống một cầu thủ được phép đá phạt do đội kia phạm luật, dùng chân chạm nhẹ vào bóng thì ngay lập tức nhặt bóng lên."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "288a7d48c1cb403cbacb6d48019cbc55",
        "word": "tight head",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪt hed/",
            "us": "/ˈtaɪt hed/"
        },
        "nearby": [
            {
                "word": "tight-fisted",
                "pos": "adjective"
            },
            {
                "word": "tight-fitting",
                "pos": "adjective"
            },
            {
                "word": "tight head",
                "pos": "noun"
            },
            {
                "word": "tight-knit",
                "pos": "adjective"
            },
            {
                "word": "tight-lipped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the player in the front row of a team in the scrum who is furthest from where the ball is put in",
                    "vi": "cầu thủ ở hàng đầu của một đội trong trò chơi xếp hạng xa nhất so với nơi đặt bóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "250bea9523d9424d82d92138393954ff",
        "word": "touch down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "touch",
                "pos": "noun"
            },
            {
                "word": "touch-and-go",
                "pos": "adjective"
            },
            {
                "word": "touch down",
                "pos": "phrasal verb"
            },
            {
                "word": "touchdown",
                "pos": "noun"
            },
            {
                "word": "touché",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make contact with the ground as it lands",
                    "vi": "tiếp xúc với mặt đất khi nó tiếp đất"
                },
                "examples": [
                    {
                        "en": "The helicopter touched down on the helipad.",
                        "vi": "Máy bay trực thăng chạm bãi đáp trực thăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make contact with the ground",
                    "vi": "tiếp xúc với mặt đất"
                },
                "examples": [
                    {
                        "en": "Tornadoes touched down in Alabama and Louisiana.",
                        "vi": "Lốc xoáy đã xảy ra ở Alabama và Louisiana."
                    }
                ]
            },
            {
                "define": {
                    "en": "to score a try by putting the ball on the ground behind the other team’s goal line",
                    "vi": "thử ghi bàn bằng cách đặt bóng xuống đất phía sau vạch vôi của đội kia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cd655d57014d46acbdd0f6508fb62e40",
        "word": "touch judge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʌtʃ dʒʌdʒ/",
            "us": "/ˈtʌtʃ dʒʌdʒ/"
        },
        "nearby": [
            {
                "word": "touching",
                "pos": "adjective"
            },
            {
                "word": "touchingly",
                "pos": "adverb"
            },
            {
                "word": "touch judge",
                "pos": "noun"
            },
            {
                "word": "touchless",
                "pos": "adjective"
            },
            {
                "word": "touchline",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a linesman",
                    "vi": "một người lót đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73884cccdd184420b2b34fa17cb5b1f4",
        "word": "touchline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʌtʃlaɪn/",
            "us": "/ˈtʌtʃlaɪn/"
        },
        "nearby": [
            {
                "word": "touch judge",
                "pos": "noun"
            },
            {
                "word": "touchless",
                "pos": "adjective"
            },
            {
                "word": "touchline",
                "pos": "noun"
            },
            {
                "word": "touch off",
                "pos": "phrasal verb"
            },
            {
                "word": "touch on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line that marks the side of the playing field in football (soccer), rugby, etc.",
                    "vi": "một đường đánh dấu một bên của sân chơi trong bóng đá (bóng đá), bóng bầu dục, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "11bc8ccdac93463d9b894c416a89edb7",
        "word": "try",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪ/",
            "us": "/traɪ/"
        },
        "nearby": [
            {
                "word": "truthfulness",
                "pos": "noun"
            },
            {
                "word": "try",
                "pos": "verb"
            },
            {
                "word": "try",
                "pos": "noun"
            },
            {
                "word": "try-and-buy",
                "pos": "adjective"
            },
            {
                "word": "try for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of trying to do something",
                    "vi": "một hành động cố gắng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I doubt they'll be able to help but it's worth a try (= worth asking them).",
                        "vi": "Tôi nghi ngờ họ sẽ có thể giúp nhưng điều đó đáng để thử (= đáng để hỏi họ)."
                    },
                    {
                        "en": "try at doing something Why don't you have a try at convincing him?",
                        "vi": "thử làm điều gì đó Tại sao bạn không thử thuyết phục anh ấy?"
                    },
                    {
                        "en": "(North American English) The US negotiators decided to make another try at reaching a settlement.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Các nhà đàm phán Hoa Kỳ quyết định thử một lần nữa để đạt được một thỏa thuận."
                    },
                    {
                        "en": "try at something This is my first try at fiction.",
                        "vi": "thử một cái gì đó Đây là lần đầu tiên tôi thử với tiểu thuyết."
                    },
                    {
                        "en": "(informal) ‘What's that behind you?’ ‘Nice try (= at making me turn round), but you'll have to do better than that!’",
                        "vi": "(thân mật) 'Cái gì đằng sau bạn?' 'Rất cố gắng (= làm cho tôi quay lại), nhưng bạn sẽ phải làm tốt hơn thế!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of trying something new or different to see if it is good, suitable, etc.",
                    "vi": "một hành động thử một cái gì đó mới hoặc khác để xem nó có tốt, phù hợp không, v.v."
                },
                "examples": [
                    {
                        "en": "I don't think I'll be any good at tennis, but I'll give it a try.",
                        "vi": "Tôi không nghĩ mình sẽ giỏi quần vợt, nhưng tôi sẽ thử."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of scoring points by touching the ground behind your opponents’ goal line with the ball",
                    "vi": "hành động ghi điểm bằng cách chạm đất phía sau đường ghi bàn của đối thủ với quả bóng"
                },
                "examples": [
                    {
                        "en": "to score a try",
                        "vi": "để ghi một thử"
                    },
                    {
                        "en": "an excellent try by winger Neil Lang",
                        "vi": "một sự cố gắng xuất sắc của cầu thủ chạy cánh Neil Lang"
                    }
                ]
            }
        ]
    },
    {
        "id": "ce36425702874ebe8de4ba93f1a4fb3b",
        "word": "up-and-under",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌp ən ˈʌndə(r)/",
            "us": "/ˌʌp ən ˈʌndər/"
        },
        "nearby": [
            {
                "word": "up-anchor",
                "pos": "verb"
            },
            {
                "word": "up-and-coming",
                "pos": "adjective"
            },
            {
                "word": "up-and-under",
                "pos": "noun"
            },
            {
                "word": "upazila",
                "pos": "noun"
            },
            {
                "word": "upbeat",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a high kick that allows time for team members to reach the place where the ball will come down",
                    "vi": "một cú đá cao để các thành viên trong đội có thời gian tiếp cận nơi bóng sẽ rơi xuống"
                },
                "examples": []
            }
        ]
    }
]