[
    {
        "id": "c0080ed62d0b451eabad079e1918a9de",
        "word": "cheat",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃiːt/",
            "us": "/tʃiːt/"
        },
        "nearby": [
            {
                "word": "cheapo",
                "pos": "adjective"
            },
            {
                "word": "cheapskate",
                "pos": "noun"
            },
            {
                "word": "cheat",
                "pos": "verb"
            },
            {
                "word": "cheat",
                "pos": "noun"
            },
            {
                "word": "cheater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to trick somebody or make them believe something that is not true",
                    "vi": "lừa ai đó hoặc khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "cheat somebody/something She is accused of attempting to cheat the taxman.",
                        "vi": "lừa ai đó / cái gì đó Cô ấy bị buộc tội cố gắng lừa người đánh thuế."
                    },
                    {
                        "en": "We will crack down on people who try to cheat the system.",
                        "vi": "Chúng tôi sẽ truy quét những người cố gắng gian lận hệ thống."
                    },
                    {
                        "en": "Many people feel cheated by the election process.",
                        "vi": "Nhiều người cảm thấy bị lừa bởi quá trình bầu cử."
                    },
                    {
                        "en": "cheat somebody out of something He cheated investors out of billions of dollars.",
                        "vi": "lừa ai đó ra khỏi cái gì đó Anh ta đã lừa các nhà đầu tư hàng tỷ đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in a dishonest way in order to gain an advantage, especially in a game, a competition, an exam, etc.",
                    "vi": "hành động không trung thực để đạt được lợi thế, đặc biệt là trong một trò chơi, một cuộc thi, một kỳ thi, v.v."
                },
                "examples": [
                    {
                        "en": "He cheats at cards.",
                        "vi": "Anh ta gian lận trong bài."
                    },
                    {
                        "en": "(British English) Have you ever cheated in an exam?",
                        "vi": "(Anh Anh) Bạn đã bao giờ gian lận trong kỳ thi chưa?"
                    },
                    {
                        "en": "(North American English) Have you ever cheated on an exam?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn đã bao giờ gian lận trong kỳ thi chưa?"
                    },
                    {
                        "en": "You're not allowed to look at the answers—that's cheating.",
                        "vi": "Bạn không được phép xem các câu trả lời — đó là gian lận."
                    },
                    {
                        "en": "Anyone caught cheating will be automatically disqualified from the examination.",
                        "vi": "Bất kỳ ai bị phát hiện gian lận sẽ tự động bị loại khỏi cuộc kiểm tra."
                    },
                    {
                        "en": "Why would anyone want to lie or cheat?",
                        "vi": "Tại sao mọi người lại muốn nói dối hoặc lừa dối?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a secret sexual relationship with somebody else",
                    "vi": "có một mối quan hệ tình dục bí mật với người khác"
                },
                "examples": [
                    {
                        "en": "He’s cheating on his wife.",
                        "vi": "Anh ta đang lừa dối vợ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to survive in a situation where you could have died",
                    "vi": "để tồn tại trong một tình huống mà bạn có thể đã chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "33a8d0d5ffd2467dbeca0389aeb69289",
        "word": "fake",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/feɪk/",
            "us": "/feɪk/"
        },
        "nearby": [
            {
                "word": "fajitas",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "adjective"
            },
            {
                "word": "fake",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "verb"
            },
            {
                "word": "fake news",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object such as a work of art, a coin or a piece of jewellery that is not what somebody claims it is but has been made to look as if it is",
                    "vi": "một vật thể chẳng hạn như một tác phẩm nghệ thuật, một đồng xu hoặc một món đồ trang sức không phải như những gì ai đó tuyên bố về nó nhưng đã được tạo ra để trông như thể nó là"
                },
                "examples": [
                    {
                        "en": "All the paintings proved to be fakes.",
                        "vi": "Tất cả các bức tranh được chứng minh là hàng giả."
                    },
                    {
                        "en": "She had long ago sold the diamonds and replaced them with fakes.",
                        "vi": "Cô đã bán kim cương từ lâu và thay thế bằng hàng giả."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who pretends to be what they are not in order to cheat people",
                    "vi": "một người giả vờ như những gì họ không phải là để lừa dối mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b49b7d71312c45dc8fca5460c80633a7",
        "word": "fool",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/fuːl/",
            "us": "/fuːl/"
        },
        "nearby": [
            {
                "word": "foo-foo",
                "pos": "noun"
            },
            {
                "word": "fool",
                "pos": "noun"
            },
            {
                "word": "fool",
                "pos": "verb"
            },
            {
                "word": "fool",
                "pos": "adjective"
            },
            {
                "word": "fool around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to trick somebody into believing something that is not true",
                    "vi": "lừa ai đó tin vào điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "fool somebody You don't fool me!",
                        "vi": "lừa ai đó Bạn không lừa tôi!"
                    },
                    {
                        "en": "She certainly had me fooled—I really believed her!",
                        "vi": "Cô ấy chắc chắn đã lừa tôi — tôi thực sự tin cô ấy!"
                    },
                    {
                        "en": "fool yourself You're fooling yourself if you think none of this will affect you.",
                        "vi": "đánh lừa bản thân Bạn đang tự đánh lừa bản thân nếu bạn nghĩ rằng không điều gì trong số này sẽ ảnh hưởng đến bạn."
                    },
                    {
                        "en": "fool somebody into doing something Don't be fooled into thinking they're going to change anything.",
                        "vi": "đánh lừa ai đó làm điều gì đó Đừng để bị lừa khi nghĩ rằng họ sẽ thay đổi bất cứ điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do stupid or silly things, often in order to make people laugh",
                    "vi": "nói hoặc làm những điều ngu ngốc hoặc ngớ ngẩn, thường để chọc cười mọi người"
                },
                "examples": [
                    {
                        "en": "fool (about/around) Stop fooling around and sit down!",
                        "vi": "đánh lừa (về / xung quanh) Đừng lừa xung quanh và ngồi xuống!"
                    },
                    {
                        "en": "fool about/around with something If you fool about with matches, you'll end up getting burned.",
                        "vi": "đánh lừa về / xung quanh với một cái gì đó Nếu bạn đánh lừa với những que diêm, bạn sẽ kết thúc cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not believe something that somebody has just told you",
                    "vi": "từng nói rằng bạn không tin điều gì đó mà ai đó vừa nói với bạn"
                },
                "examples": [
                    {
                        "en": "‘I'm trying as hard as I can!’ ‘You could have fooled me!’",
                        "vi": "Tôi đang cố gắng hết sức có thể!' 'Bạn có thể đã lừa tôi!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "30666339c8d0463d83c159934bacb6ef",
        "word": "invent",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪnˈvent/",
            "us": "/ɪnˈvent/"
        },
        "nearby": [
            {
                "word": "inveigh against",
                "pos": "phrasal verb"
            },
            {
                "word": "inveigle",
                "pos": "verb"
            },
            {
                "word": "invent",
                "pos": "verb"
            },
            {
                "word": "invention",
                "pos": "noun"
            },
            {
                "word": "inventive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce or design something that has not existed before",
                    "vi": "để sản xuất hoặc thiết kế thứ gì đó chưa có trước đây"
                },
                "examples": [
                    {
                        "en": "Who invented the steam engine?",
                        "vi": "Ai là người phát minh ra máy hơi nước?"
                    },
                    {
                        "en": "I wish mobile phones had never been invented!",
                        "vi": "Tôi ước gì điện thoại di động chưa bao giờ được phát minh!"
                    },
                    {
                        "en": "The term ‘sociology’ was invented by Auguste Comte.",
                        "vi": "Thuật ngữ 'xã hội học' được phát minh bởi Auguste Comte."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or describe something that is not true, especially in order to trick people",
                    "vi": "nói hoặc mô tả điều gì đó không đúng sự thật, đặc biệt là để lừa mọi người"
                },
                "examples": [
                    {
                        "en": "What excuse did he invent this time?",
                        "vi": "Lần này anh ta bịa ra cớ gì?"
                    },
                    {
                        "en": "Many children invent an imaginary friend.",
                        "vi": "Nhiều đứa trẻ phát minh ra một người bạn tưởng tượng."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc727d1542d04e3083840b015d3b1f5a",
        "word": "lie",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/laɪ/",
            "us": "/laɪ/"
        },
        "nearby": [
            {
                "word": "lie1",
                "pos": "verb"
            },
            {
                "word": "lie1",
                "pos": "noun"
            },
            {
                "word": "lie2",
                "pos": "verb"
            },
            {
                "word": "lie2",
                "pos": "noun"
            },
            {
                "word": "lie around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to say or write something that you know is not true",
                    "vi": "nói hoặc viết điều gì đó mà bạn biết là không đúng"
                },
                "examples": [
                    {
                        "en": "You could see from his face that he was lying.",
                        "vi": "Bạn có thể nhìn thấy từ khuôn mặt anh ta rằng anh ta đang nói dối."
                    },
                    {
                        "en": "lie to somebody Don't lie to me!",
                        "vi": "nói dối ai đó Đừng nói dối tôi!"
                    },
                    {
                        "en": "lie about something She lies about her age.",
                        "vi": "nói dối về điều gì đó Cô ấy nói dối về tuổi của mình."
                    },
                    {
                        "en": "lie about doing something He lied about having a university degree.",
                        "vi": "nói dối về việc làm gì đó Anh ấy nói dối về việc có bằng đại học."
                    },
                    {
                        "en": "The camera cannot lie (= give a false impression).",
                        "vi": "Máy ảnh không thể nói dối (= tạo ấn tượng sai)."
                    },
                    {
                        "en": "He was unable to lie convincingly.",
                        "vi": "Anh ta không thể nói dối một cách thuyết phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something that is not true at all",
                    "vi": "nói điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "The witness was clearly lying through his teeth.",
                        "vi": "Nhân chứng rõ ràng đang nói dối qua kẽ răng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get yourself into or out of a situation by lying",
                    "vi": "để đưa mình vào hoặc thoát khỏi tình huống bằng cách nói dối"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7932538ff9d44165b79fa6a49bcb04c6",
        "word": "pretend",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/prɪˈtend/",
            "us": "/prɪˈtend/"
        },
        "nearby": [
            {
                "word": "pre-teen",
                "pos": "noun"
            },
            {
                "word": "pretence",
                "pos": "noun"
            },
            {
                "word": "pretend",
                "pos": "verb"
            },
            {
                "word": "pretend",
                "pos": "adjective"
            },
            {
                "word": "pretender",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to behave in a particular way, in order to make other people believe something that is not true",
                    "vi": "hành xử theo một cách cụ thể, để khiến người khác tin vào điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "I'm tired of having to pretend all the time.",
                        "vi": "Tôi mệt mỏi khi phải giả vờ mọi lúc."
                    },
                    {
                        "en": "Of course I was wrong; it would be hypocritical to pretend otherwise.",
                        "vi": "Tất nhiên là tôi đã sai; sẽ là đạo đức giả nếu giả vờ khác."
                    },
                    {
                        "en": "pretend to somebody that… He pretended to his family that everything was fine.",
                        "vi": "giả vờ với ai đó rằng… Anh ấy giả vờ với gia đình rằng mọi thứ đều ổn."
                    },
                    {
                        "en": "pretend (that)… We pretended (that) nothing had happened.",
                        "vi": "giả vờ (điều đó)… Chúng tôi giả vờ (điều đó) không có gì xảy ra."
                    },
                    {
                        "en": "She pretended (that) she was his niece.",
                        "vi": "Cô ấy giả vờ (rằng) cô ấy là cháu gái của anh ấy."
                    },
                    {
                        "en": "pretend to do something I pretended to be asleep.",
                        "vi": "giả vờ làm điều gì đó Tôi giả vờ như đang ngủ."
                    },
                    {
                        "en": "He pretended not to notice.",
                        "vi": "Anh giả vờ như không để ý."
                    },
                    {
                        "en": "She didn't love him, though she pretended to.",
                        "vi": "Cô ấy không yêu anh ta, mặc dù cô ấy đã giả vờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to imagine that something is true as part of a game",
                    "vi": "để tưởng tượng rằng một cái gì đó là sự thật như một phần của trò chơi"
                },
                "examples": [
                    {
                        "en": "They didn't have any real money so they had to pretend.",
                        "vi": "Họ không có tiền thật nên phải giả vờ."
                    },
                    {
                        "en": "pretend (that)… Let’s pretend (that) we’re astronauts.",
                        "vi": "giả vờ (điều đó)… Hãy giả vờ (điều đó) chúng ta là phi hành gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "to claim to be, do or have something, especially when this is not true",
                    "vi": "để tuyên bố là, làm hoặc có một cái gì đó, đặc biệt là khi điều này không đúng"
                },
                "examples": [
                    {
                        "en": "pretend to something I can't pretend to any great musical talent.",
                        "vi": "giả vờ điều gì đó mà tôi không thể giả vờ với bất kỳ tài năng âm nhạc tuyệt vời nào."
                    },
                    {
                        "en": "pretend (that)… I don’t pretend (that) I know much about the subject, but…",
                        "vi": "giả vờ (điều đó)… Tôi không giả vờ (điều đó) Tôi biết nhiều về chủ đề này, nhưng…"
                    },
                    {
                        "en": "pretend to be/do/have something The book doesn't pretend to be a great work of literature.",
                        "vi": "giả vờ là / làm / có một cái gì đó Cuốn sách không giả vờ là một tác phẩm văn học tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "2135aec4aea9454b9af83deeeb2f0076",
        "word": "trick",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/trɪk/",
            "us": "/trɪk/"
        },
        "nearby": [
            {
                "word": "trichology",
                "pos": "noun"
            },
            {
                "word": "trick",
                "pos": "noun"
            },
            {
                "word": "trick",
                "pos": "verb"
            },
            {
                "word": "trick",
                "pos": "adjective"
            },
            {
                "word": "trickery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody believe something which is not true, especially in order to cheat them",
                    "vi": "để khiến ai đó tin điều gì đó không đúng sự thật, đặc biệt là để lừa họ"
                },
                "examples": [
                    {
                        "en": "trick somebody I'd been tricked and I felt stupid.",
                        "vi": "lừa ai đó Tôi đã bị lừa và tôi cảm thấy mình thật ngu ngốc."
                    },
                    {
                        "en": "trick your way + adv./prep. He managed to trick his way past the security guards.",
                        "vi": "lừa theo cách của bạn + adv./prep. Anh ta đã lừa được đường của mình để vượt qua các nhân viên bảo vệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "bbab95bf6945444d8af0dd7f21844c16",
        "word": "deceive",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈsiːv/",
            "us": "/dɪˈsiːv/"
        },
        "nearby": [
            {
                "word": "deceitfully",
                "pos": "adverb"
            },
            {
                "word": "deceitfulness",
                "pos": "noun"
            },
            {
                "word": "deceive",
                "pos": "verb"
            },
            {
                "word": "deceiver",
                "pos": "noun"
            },
            {
                "word": "decelerate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody believe something that is not true",
                    "vi": "để khiến ai đó tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "deceive somebody Her husband had been deceiving her for years.",
                        "vi": "lừa dối ai đó Chồng cô đã lừa dối cô trong nhiều năm."
                    },
                    {
                        "en": "deceive somebody into doing something She deceived him into handing over all his savings.",
                        "vi": "lừa ai đó làm điều gì đó Cô ấy đã lừa anh ta giao tất cả tiền tiết kiệm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to admit to yourself that something unpleasant is true",
                    "vi": "từ chối thừa nhận với bản thân rằng điều gì đó khó chịu là đúng"
                },
                "examples": [
                    {
                        "en": "You're deceiving yourself if you think he'll change his mind.",
                        "vi": "Bạn đang tự lừa dối mình nếu bạn nghĩ rằng anh ấy sẽ thay đổi quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody have a wrong idea about somebody/something",
                    "vi": "làm cho ai đó có một ý tưởng sai lầm về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Unless my eyes deceive me, that's his wife.",
                        "vi": "Trừ khi ánh mắt lừa dối tôi, đó mới là vợ của anh ấy."
                    },
                    {
                        "en": "the hallmarks of a detective mystery where appearances deceive",
                        "vi": "dấu hiệu của một bí ẩn trinh thám nơi mà vẻ ngoài lừa dối"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something flatters to deceive, it appears to be better, more successful, etc. than it really is",
                    "vi": "nếu một cái gì đó tâng bốc để lừa dối, nó có vẻ tốt hơn, thành công hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "As with many new bands, their early success flattered to deceive.",
                        "vi": "Cũng như nhiều ban nhạc mới, thành công ban đầu của họ rất dễ bị đánh lừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "efc7e58902d14a4bb506201cf240ffc4",
        "word": "dishonest",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪsˈɒnɪst/",
            "us": "/dɪsˈɑːnɪst/"
        },
        "nearby": [
            {
                "word": "disheartening",
                "pos": "adjective"
            },
            {
                "word": "dishevelled",
                "pos": "adjective"
            },
            {
                "word": "dishonest",
                "pos": "adjective"
            },
            {
                "word": "dishonestly",
                "pos": "adverb"
            },
            {
                "word": "dishonesty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not honest; intending to trick people",
                    "vi": "không trung thực; định lừa mọi người"
                },
                "examples": [
                    {
                        "en": "Beware of dishonest traders in the tourist areas.",
                        "vi": "Cảnh giác với những người buôn bán không trung thực trong các khu du lịch."
                    },
                    {
                        "en": "dishonest with somebody She has been dishonest with voters.",
                        "vi": "không trung thực với ai đó Cô ấy đã không trung thực với cử tri."
                    },
                    {
                        "en": "dishonest about something He has been dishonest about his age and academic qualifications.",
                        "vi": "không trung thực về điều gì đó Anh ta đã không trung thực về tuổi tác và trình độ học vấn của mình."
                    },
                    {
                        "en": "it is dishonest (of somebody) (to do something) I don't like him, and it would be dishonest of me to pretend otherwise.",
                        "vi": "đó là không trung thực (của ai đó) (làm điều gì đó) Tôi không thích anh ta, và tôi sẽ không trung thực nếu giả vờ khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f619a69bac64e3f8498a0f639d59996",
        "word": "dishonesty",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪsˈɒnɪsti/",
            "us": "/dɪsˈɑːnɪsti/"
        },
        "nearby": [
            {
                "word": "dishonest",
                "pos": "adjective"
            },
            {
                "word": "dishonestly",
                "pos": "adverb"
            },
            {
                "word": "dishonesty",
                "pos": "noun"
            },
            {
                "word": "dishonour",
                "pos": "noun"
            },
            {
                "word": "dishonour",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being dishonest",
                    "vi": "thực tế là không trung thực"
                },
                "examples": [
                    {
                        "en": "Five civil servants were dismissed for dishonesty and misconduct.",
                        "vi": "Năm công chức đã bị cách chức vì không trung thực và có hành vi sai trái."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ac79eb01eda4b33868f05661a008e69",
        "word": "fake",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/feɪk/",
            "us": "/feɪk/"
        },
        "nearby": [
            {
                "word": "faith school",
                "pos": "noun"
            },
            {
                "word": "fajitas",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "adjective"
            },
            {
                "word": "fake",
                "pos": "noun"
            },
            {
                "word": "fake",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not what somebody claims it is; appearing to be something it is not",
                    "vi": "không phải những gì ai đó tuyên bố nó là; dường như là một cái gì đó nó không phải là"
                },
                "examples": [
                    {
                        "en": "There were a few stalls selling fake designer clothing.",
                        "vi": "Có một vài gian hàng bán quần áo hàng hiệu giả."
                    },
                    {
                        "en": "The caller appeared to have a fake American accent.",
                        "vi": "Người gọi có vẻ giả giọng Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "made to look like something else",
                    "vi": "được tạo ra để trông giống như một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "a fake fur jacket",
                        "vi": "một chiếc áo khoác giả lông thú"
                    },
                    {
                        "en": "Don't go out in the sun—get a fake tan from a bottle.",
                        "vi": "Đừng đi ra nắng — hãy lấy một cái rám nắng giả từ một cái chai."
                    },
                    {
                        "en": "We sprayed fake snow over the trees to make it look like winter.",
                        "vi": "Chúng tôi rải tuyết giả lên cây để trông giống như mùa đông."
                    }
                ]
            }
        ]
    },
    {
        "id": "735e6393f09845bcbf65636d2e328c01",
        "word": "false",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/fɔːls/",
            "us": "/fɔːls/"
        },
        "nearby": [
            {
                "word": "fall to",
                "pos": "phrasal verb"
            },
            {
                "word": "fall upon",
                "pos": "phrasal verb"
            },
            {
                "word": "false",
                "pos": "adjective"
            },
            {
                "word": "false alarm",
                "pos": "noun"
            },
            {
                "word": "false beginner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wrong; not correct or true",
                    "vi": "Sai lầm; không đúng hay đúng"
                },
                "examples": [
                    {
                        "en": "A whale is a fish. True or false?",
                        "vi": "Một con cá voi là một con cá. Đúng hay sai?"
                    },
                    {
                        "en": "Predictions of an early improvement in the housing market proved false.",
                        "vi": "Những dự đoán về sự cải thiện sớm của thị trường nhà ở đã được chứng minh là sai."
                    },
                    {
                        "en": "She gave false information to the insurance company.",
                        "vi": "Cô ấy đã cung cấp thông tin sai cho công ty bảo hiểm."
                    },
                    {
                        "en": "He used a false name to get the job.",
                        "vi": "Anh ta đã sử dụng một cái tên giả để có được công việc."
                    },
                    {
                        "en": "His career was ruined by false accusations.",
                        "vi": "Sự nghiệp của anh đã bị hủy hoại bởi những lời buộc tội sai trái."
                    },
                    {
                        "en": "The allegations are completely false.",
                        "vi": "Các cáo buộc là hoàn toàn sai sự thật."
                    },
                    {
                        "en": "This claim is simply false.",
                        "vi": "Tuyên bố này chỉ đơn giản là sai."
                    },
                    {
                        "en": "The law can punish knowingly false statements.",
                        "vi": "Luật pháp có thể trừng phạt những tuyên bố cố ý sai sự thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "not natural",
                    "vi": "không thuộc về thiên nhiên"
                },
                "examples": [
                    {
                        "en": "false teeth/eyelashes",
                        "vi": "răng / lông mi giả"
                    },
                    {
                        "en": "a false beard",
                        "vi": "một bộ râu giả"
                    }
                ]
            },
            {
                "define": {
                    "en": "not real or what somebody claims it is, but made to look real to cheat people",
                    "vi": "không có thật hoặc những gì ai đó tuyên bố đó là, nhưng được tạo ra để trông giống như thật để lừa dối mọi người"
                },
                "examples": [
                    {
                        "en": "He had been travelling with a false passport.",
                        "vi": "Anh ta đã đi du lịch với một hộ chiếu giả."
                    },
                    {
                        "en": "The case had a false bottom where documents or even a small radio could be hidden.",
                        "vi": "Vỏ hộp có một đáy giả, nơi có thể giấu tài liệu hoặc thậm chí một chiếc radio nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "wrong or not accurate, because it is based on something that is not true or correct",
                    "vi": "sai hoặc không chính xác, bởi vì nó dựa trên một cái gì đó không đúng hoặc không đúng"
                },
                "examples": [
                    {
                        "en": "a false argument/assumption/belief",
                        "vi": "một lập luận sai lầm / giả định / niềm tin"
                    },
                    {
                        "en": "to give a false impression of wealth",
                        "vi": "tạo ấn tượng sai lầm về sự giàu có"
                    },
                    {
                        "en": "to lull somebody into a false sense of security (= make somebody feel safe when they are really in danger)",
                        "vi": "ru ngủ ai đó vào cảm giác an toàn giả tạo (= làm cho ai đó cảm thấy an toàn khi họ thực sự gặp nguy hiểm)"
                    },
                    {
                        "en": "They didn't want to raise any false hopes, but they believed her husband had escaped capture.",
                        "vi": "Họ không muốn nuôi hy vọng hão huyền, nhưng họ tin rằng chồng cô đã trốn thoát."
                    },
                    {
                        "en": "Buying a cheap computer is a false economy (= will not actually save you money).",
                        "vi": "Mua một máy tính giá rẻ là một nền kinh tế sai lầm (= sẽ không thực sự giúp bạn tiết kiệm tiền)."
                    },
                    {
                        "en": "If you don't do the test right, it can lead to false positives.",
                        "vi": "Nếu bạn không làm đúng xét nghiệm, nó có thể dẫn đến dương tính giả."
                    }
                ]
            },
            {
                "define": {
                    "en": "not real or sincere",
                    "vi": "không thật hay chân thành"
                },
                "examples": [
                    {
                        "en": "false modesty",
                        "vi": "khiêm tốn giả tạo"
                    },
                    {
                        "en": "She flashed him a false smile of congratulation.",
                        "vi": "Cô nở một nụ cười chúc mừng giả tạo cho anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "not faithful",
                    "vi": "không chung thủy"
                },
                "examples": [
                    {
                        "en": "a false lover",
                        "vi": "một người tình giả dối"
                    }
                ]
            },
            {
                "define": {
                    "en": "by pretending to be something that you are not, in order to gain some advantage for yourself",
                    "vi": "bằng cách giả vờ là một cái gì đó không phải là bạn, để đạt được một số lợi thế cho bản thân"
                },
                "examples": [
                    {
                        "en": "She was accused of obtaining money under false pretences.",
                        "vi": "Cô bị buộc tội lấy tiền giả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give the impression of being sincere/true or not sincere/true",
                    "vi": "để tạo ấn tượng về sự chân thành / chân thành hoặc không chân thành / chân thành"
                },
                "examples": [
                    {
                        "en": "It may seem a strange story but it rings true to me.",
                        "vi": "Nó có vẻ là một câu chuyện kỳ lạ nhưng nó lại là sự thật đối với tôi."
                    },
                    {
                        "en": "His expressions of support rang rather hollow.",
                        "vi": "Những biểu hiện ủng hộ của anh ta tỏ ra khá trống rỗng."
                    },
                    {
                        "en": "His promise rang hollow.",
                        "vi": "Lời hứa của anh ta trở nên vô nghĩa."
                    }
                ]
            }
        ]
    },
    {
        "id": "38c5fb5c9cb24793a839186a2b07714e",
        "word": "mislead",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌmɪsˈliːd/",
            "us": "/ˌmɪsˈliːd/"
        },
        "nearby": [
            {
                "word": "miskey",
                "pos": "verb"
            },
            {
                "word": "mislay",
                "pos": "verb"
            },
            {
                "word": "mislead",
                "pos": "verb"
            },
            {
                "word": "misleading",
                "pos": "adjective"
            },
            {
                "word": "misleadingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody the wrong idea or impression and make them believe something that is not true",
                    "vi": "để cung cấp cho ai đó ý tưởng hoặc ấn tượng sai và khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "mislead (somebody) (about something) He deliberately misled us about the nature of their relationship.",
                        "vi": "đánh lừa (ai đó) (về điều gì đó) Anh ta cố tình đánh lừa chúng ta về bản chất của mối quan hệ của họ."
                    },
                    {
                        "en": "Statistics taken on their own are liable to mislead.",
                        "vi": "Số liệu thống kê được thực hiện theo cách riêng của họ có thể gây hiểu lầm."
                    },
                    {
                        "en": "Misleading the court in a trial is a serious offence.",
                        "vi": "Gây hiểu lầm cho tòa án trong một phiên tòa xét xử là một hành vi phạm tội nghiêm trọng."
                    },
                    {
                        "en": "mislead somebody into doing something The company misled hundreds of people into investing their money unwisely.",
                        "vi": "đánh lừa ai đó làm điều gì đó Công ty đã đánh lừa hàng trăm người đầu tư tiền của họ một cách thiếu thận trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "19cdb0b09abe44e08f290c5f7da5bfe7",
        "word": "deception",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈsepʃn/",
            "us": "/dɪˈsepʃn/"
        },
        "nearby": [
            {
                "word": "decentralization",
                "pos": "noun"
            },
            {
                "word": "decentralize",
                "pos": "verb"
            },
            {
                "word": "deception",
                "pos": "noun"
            },
            {
                "word": "deceptive",
                "pos": "adjective"
            },
            {
                "word": "deceptively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of deliberately making somebody believe something that is not true (= of deceiving them)",
                    "vi": "hành động cố tình làm cho ai đó tin điều gì đó không có thật (= lừa dối họ)"
                },
                "examples": [
                    {
                        "en": "a drama full of lies and deception",
                        "vi": "một bộ phim đầy dối trá và lừa lọc"
                    },
                    {
                        "en": "He was accused of obtaining property by deception.",
                        "vi": "Anh ta bị buộc tội lừa đảo chiếm đoạt tài sản."
                    }
                ]
            },
            {
                "define": {
                    "en": "a trick intended to make somebody believe something that is not true",
                    "vi": "một thủ thuật nhằm làm cho ai đó tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "The whole episode had been a cruel deception.",
                        "vi": "Toàn bộ tập phim là một sự lừa dối tàn nhẫn."
                    },
                    {
                        "en": "His elaborate deception fooled everyone.",
                        "vi": "Sự lừa dối công phu của anh ta đã đánh lừa tất cả mọi người."
                    }
                ]
            }
        ]
    },
    {
        "id": "6616350825c544918d60fd1e2bb10d55",
        "word": "misleading",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmɪsˈliːdɪŋ/",
            "us": "/ˌmɪsˈliːdɪŋ/"
        },
        "nearby": [
            {
                "word": "mislay",
                "pos": "verb"
            },
            {
                "word": "mislead",
                "pos": "verb"
            },
            {
                "word": "misleading",
                "pos": "adjective"
            },
            {
                "word": "misleadingly",
                "pos": "adverb"
            },
            {
                "word": "mismanage",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "giving the wrong idea or impression and making you believe something that is not true",
                    "vi": "đưa ra ý tưởng hoặc ấn tượng sai và khiến bạn tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "misleading information/advertisements",
                        "vi": "thông tin / quảng cáo sai lệch"
                    },
                    {
                        "en": "It would be seriously misleading to suggest that television has no effect on children.",
                        "vi": "Sẽ là sai lầm nghiêm trọng nếu cho rằng truyền hình không ảnh hưởng đến trẻ em."
                    }
                ]
            }
        ]
    },
    {
        "id": "981b0e19632a44419e57d6744b6172d8",
        "word": "misrepresent",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmɪsˌreprɪˈzent/",
            "us": "/ˌmɪsˌreprɪˈzent/"
        },
        "nearby": [
            {
                "word": "misremember",
                "pos": "verb"
            },
            {
                "word": "misreport",
                "pos": "verb"
            },
            {
                "word": "misrepresent",
                "pos": "verb"
            },
            {
                "word": "misrepresentation",
                "pos": "noun"
            },
            {
                "word": "misrule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give information about somebody/something that is not true or complete so that other people have the wrong impression about them/it",
                    "vi": "cung cấp thông tin về ai đó / điều gì đó không đúng hoặc không đầy đủ để người khác có ấn tượng sai về họ / điều đó"
                },
                "examples": [
                    {
                        "en": "misrepresent somebody/something He felt that the book misrepresented his opinions.",
                        "vi": "xuyên tạc ai đó / điều gì đó Anh ấy cảm thấy rằng cuốn sách đã trình bày sai ý kiến của anh ấy."
                    },
                    {
                        "en": "Think carefully about what you say: your views could be easily misrepresented by the press.",
                        "vi": "Hãy suy nghĩ cẩn thận về những gì bạn nói: quan điểm của bạn có thể bị báo chí xuyên tạc một cách dễ dàng."
                    },
                    {
                        "en": "misrepresent somebody/something as something In the article she was misrepresented as an uncaring mother.",
                        "vi": "xuyên tạc ai đó / cái gì đó như một cái gì đó Trong bài báo, cô ấy đã bị xuyên tạc là một người mẹ không lo lắng."
                    },
                    {
                        "en": "misrepresent what, how, etc… The report misrepresented what the group believes.",
                        "vi": "xuyên tạc những gì, như thế nào, v.v.… Báo cáo đã trình bày sai những gì nhóm tin tưởng."
                    }
                ]
            }
        ]
    },
    {
        "id": "87d2b2cbbb284a24b8143fd2b3c82346",
        "word": "profess",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/prəˈfes/",
            "us": "/prəˈfes/"
        },
        "nearby": [
            {
                "word": "profane",
                "pos": "verb"
            },
            {
                "word": "profanity",
                "pos": "noun"
            },
            {
                "word": "profess",
                "pos": "verb"
            },
            {
                "word": "professed",
                "pos": "adjective"
            },
            {
                "word": "profession",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to claim that something is true or correct, especially when it is not",
                    "vi": "để khẳng định rằng điều gì đó là đúng hoặc đúng, đặc biệt là khi nó không phải"
                },
                "examples": [
                    {
                        "en": "profess something She still professes her innocence.",
                        "vi": "tuyên bố điều gì Cô ấy vẫn tuyên bố mình vô tội."
                    },
                    {
                        "en": "profess to be/have something I don't profess to be an expert in this subject.",
                        "vi": "tuyên bố là / có điều gì đó Tôi không tự nhận là một chuyên gia trong chủ đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to state openly that you have a particular belief, feeling, etc.",
                    "vi": "công khai rằng bạn có một niềm tin, cảm giác cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "profess something In this scene the couple finally profess their love for each other.",
                        "vi": "tuyên bố điều gì Trong cảnh này, cặp đôi cuối cùng cũng tuyên bố tình yêu của họ dành cho nhau."
                    },
                    {
                        "en": "He professed his admiration for their work.",
                        "vi": "Ông bày tỏ sự ngưỡng mộ của mình đối với công việc của họ."
                    },
                    {
                        "en": "profess yourself + adj. She professed herself satisfied with the progress so far.",
                        "vi": "tự xưng + adj. Cô khẳng định bản thân hài lòng với những tiến bộ cho đến nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to belong to a particular religion",
                    "vi": "thuộc về một tôn giáo cụ thể"
                },
                "examples": [
                    {
                        "en": "to profess Christianity/Islam/Judaism",
                        "vi": "tuyên bố Cơ đốc giáo / Hồi giáo / Do Thái giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "e8709d0276e64af59448d3de45eb6ed0",
        "word": "secretive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsiːkrətɪv/",
            "us": "/ˈsiːkrətɪv/"
        },
        "nearby": [
            {
                "word": "the Secret Intelligence Service",
                "pos": ""
            },
            {
                "word": "secretion",
                "pos": "noun"
            },
            {
                "word": "secretive",
                "pos": "adjective"
            },
            {
                "word": "secretively",
                "pos": "adverb"
            },
            {
                "word": "secretiveness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tending or liking to hide your thoughts, feelings, actions, etc. from other people",
                    "vi": "có xu hướng hoặc thích che giấu suy nghĩ, cảm xúc, hành động, v.v. của bạn với người khác"
                },
                "examples": [
                    {
                        "en": "He's very secretive about his work.",
                        "vi": "Anh ấy rất bí mật về công việc của mình."
                    },
                    {
                        "en": "The child became secretive and withdrawn.",
                        "vi": "Đứa trẻ trở nên bí bách và thu mình."
                    },
                    {
                        "en": "his highly secretive nature",
                        "vi": "bản chất rất bí mật của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "9b1b8982ae6f4c1b99d78ad502a25610",
        "word": "superficial",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsuːpəˈfɪʃl/",
            "us": "/ˌsuːpərˈfɪʃl/"
        },
        "nearby": [
            {
                "word": "superfan",
                "pos": "noun"
            },
            {
                "word": "superfast",
                "pos": "adjective"
            },
            {
                "word": "superficial",
                "pos": "adjective"
            },
            {
                "word": "superficiality",
                "pos": "noun"
            },
            {
                "word": "superficially",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not studying or looking at something carefully or completely; seeing only what is obvious",
                    "vi": "không nghiên cứu hoặc xem xét một cái gì đó một cách cẩn thận hoặc hoàn toàn; chỉ nhìn thấy những gì là hiển nhiên"
                },
                "examples": [
                    {
                        "en": "a superficial analysis",
                        "vi": "một phân tích hời hợt"
                    },
                    {
                        "en": "The book shows only a superficial understanding of the historical context.",
                        "vi": "Cuốn sách chỉ cho thấy sự hiểu biết hời hợt về bối cảnh lịch sử."
                    }
                ]
            },
            {
                "define": {
                    "en": "appearing to be true, real or important until you look at it more carefully",
                    "vi": "có vẻ là đúng, có thật hoặc quan trọng cho đến khi bạn xem xét kỹ hơn"
                },
                "examples": [
                    {
                        "en": "superficial differences/similarities",
                        "vi": "sự khác biệt / tương đồng bề ngoài"
                    },
                    {
                        "en": "When you first meet her, she gives a superficial impression of warmth and friendliness.",
                        "vi": "Khi bạn lần đầu tiên gặp cô ấy, cô ấy sẽ có ấn tượng bề ngoài về sự ấm áp và thân thiện."
                    },
                    {
                        "en": "The movie bears a fairly superficial resemblance to the original novel.",
                        "vi": "Bộ phim mang một vẻ bề ngoài khá giống với tiểu thuyết gốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "only affecting the surface and therefore not serious",
                    "vi": "chỉ ảnh hưởng đến bề mặt và do đó không nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "a superficial injury",
                        "vi": "một tổn thương bề ngoài"
                    },
                    {
                        "en": "superficial burns",
                        "vi": "bỏng bề mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "not serious or important and not having any depth of understanding or feeling",
                    "vi": "không nghiêm túc hoặc quan trọng và không có bất kỳ sự hiểu biết hoặc cảm nhận sâu sắc nào"
                },
                "examples": [
                    {
                        "en": "a superficial friendship",
                        "vi": "một tình bạn hời hợt"
                    },
                    {
                        "en": "The guests engaged in superficial chatter.",
                        "vi": "Khách tham gia huyên thuyên hời hợt."
                    },
                    {
                        "en": "She's so superficial!",
                        "vi": "Cô ấy thật hời hợt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "of or on the surface of something",
                    "vi": "của hoặc trên bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "superficial veins",
                        "vi": "tĩnh mạch bề ngoài"
                    },
                    {
                        "en": "a superficial deposit of acidic soils",
                        "vi": "trầm tích bề mặt của đất chua"
                    }
                ]
            }
        ]
    },
    {
        "id": "5b7ffcaaba714d549401a62173e06a18",
        "word": "suspicion",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈspɪʃn/",
            "us": "/səˈspɪʃn/"
        },
        "nearby": [
            {
                "word": "suspension",
                "pos": "noun"
            },
            {
                "word": "suspension bridge",
                "pos": "noun"
            },
            {
                "word": "suspicion",
                "pos": "noun"
            },
            {
                "word": "suspicious",
                "pos": "adjective"
            },
            {
                "word": "suspiciously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling that somebody has done something wrong, illegal or dishonest, even though you have no proof",
                    "vi": "cảm giác rằng ai đó đã làm điều gì đó sai trái, bất hợp pháp hoặc không trung thực, mặc dù bạn không có bằng chứng"
                },
                "examples": [
                    {
                        "en": "They drove away slowly to avoid arousing suspicion.",
                        "vi": "Họ lái xe đi từ từ để tránh làm dấy lên nghi ngờ."
                    },
                    {
                        "en": "on suspicion of something He was arrested on suspicion of murder.",
                        "vi": "vì nghi ngờ điều gì đó Anh ta bị bắt vì nghi ngờ giết người."
                    },
                    {
                        "en": "suspicion that… I have a sneaking suspicion that she's not telling the truth.",
                        "vi": "nghi ngờ rằng… Tôi có một nghi ngờ lén lút rằng cô ấy không nói sự thật."
                    },
                    {
                        "en": "My suspicions were confirmed when police raided the property.",
                        "vi": "Sự nghi ngờ của tôi đã được xác nhận khi cảnh sát lục soát tài sản."
                    },
                    {
                        "en": "She was reluctant to voice her suspicions.",
                        "vi": "Cô miễn cưỡng nói ra sự nghi ngờ của mình."
                    },
                    {
                        "en": "His resignation seemed only to fuel suspicions.",
                        "vi": "Việc từ chức của ông dường như chỉ làm dấy lên những nghi ngờ."
                    },
                    {
                        "en": "It’s time to confront him with our suspicions.",
                        "vi": "Đã đến lúc đối mặt với anh ta với những nghi ngờ của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling or belief that something is true, even though you have no proof",
                    "vi": "cảm giác hoặc niềm tin rằng điều gì đó là sự thật, mặc dù bạn không có bằng chứng"
                },
                "examples": [
                    {
                        "en": "I have a horrible suspicion that we've come to the wrong station.",
                        "vi": "Tôi có một nghi ngờ kinh khủng rằng chúng ta đã đến nhầm ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling that you cannot trust somebody/something",
                    "vi": "cảm giác rằng bạn không thể tin tưởng ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "Their offer was greeted with some suspicion.",
                        "vi": "Đề nghị của họ đã được chào đón với một số nghi ngờ."
                    },
                    {
                        "en": "Water from shallow wells should be regarded with suspicion, as it may be contaminated.",
                        "vi": "Nước giếng cạn nên được xem xét cẩn thận, vì nó có thể bị ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of something",
                    "vi": "một số lượng nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His mouth quivered in the suspicion of a smile.",
                        "vi": "Miệng anh run lên vì nghi ngờ một nụ cười."
                    },
                    {
                        "en": "Wasn’t there even a suspicion of truth in what he said?",
                        "vi": "Thậm chí không có sự nghi ngờ về sự thật trong những gì anh ta nói?"
                    }
                ]
            },
            {
                "define": {
                    "en": "too good, honest, etc. to have done something wrong, illegal or dishonest",
                    "vi": "quá tốt, trung thực, v.v. để làm điều gì đó sai trái, bất hợp pháp hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Nobody who was near the scene of the crime is above suspicion.",
                        "vi": "Không ai ở gần hiện trường vụ án nằm trên diện tình nghi."
                    },
                    {
                        "en": "They thought the head teacher was beyond suspicion.",
                        "vi": "Họ nghĩ rằng thầy hiệu trưởng đã nằm ngoài sự nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the finger of blame/suspicion points or is pointed at somebody, they are suspected of having committed a crime, being responsible for something, etc.",
                    "vi": "nếu ngón tay đổ lỗi / nghi ngờ trỏ hoặc chỉ vào ai đó, họ bị nghi ngờ đã phạm tội, chịu trách nhiệm về điều gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "The inquiry pointed the finger of blame at the driver of the crashed coach.",
                        "vi": "Cuộc điều tra chỉ ra ngón tay đổ lỗi cho tài xế của chiếc xe khách bị tai nạn."
                    },
                    {
                        "en": "The finger of suspicion was pointed at the chicken served for lunch.",
                        "vi": "Ngón tay nghi ngờ chỉ vào con gà được dọn cho bữa trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "suspected of doing something wrong, illegal or dishonest",
                    "vi": "bị nghi ngờ làm điều gì đó sai trái, bất hợp pháp hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "The whole family is currently under suspicion of her murder.",
                        "vi": "Cả gia đình hiện đang bị nghi ngờ cô bị sát hại."
                    },
                    {
                        "en": "A number of doctors came under suspicion of unethical behaviour.",
                        "vi": "Một số bác sĩ bị nghi ngờ có hành vi phi đạo đức."
                    },
                    {
                        "en": "He fell under suspicion of tax evasion.",
                        "vi": "Anh ta bị nghi ngờ trốn thuế."
                    }
                ]
            }
        ]
    },
    {
        "id": "15b963033cbc4281957aee9a63a27f71",
        "word": "suspicious",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈspɪʃəs/",
            "us": "/səˈspɪʃəs/"
        },
        "nearby": [
            {
                "word": "suspension bridge",
                "pos": "noun"
            },
            {
                "word": "suspicion",
                "pos": "noun"
            },
            {
                "word": "suspicious",
                "pos": "adjective"
            },
            {
                "word": "suspiciously",
                "pos": "adverb"
            },
            {
                "word": "suss",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling that somebody has done something wrong, illegal or dishonest, without having any proof",
                    "vi": "cảm thấy rằng ai đó đã làm điều gì đó sai trái, bất hợp pháp hoặc không trung thực mà không có bất kỳ bằng chứng nào"
                },
                "examples": [
                    {
                        "en": "They became suspicious of his behaviour and contacted the police.",
                        "vi": "Họ trở nên nghi ngờ về hành vi của anh ta và liên lạc với cảnh sát."
                    },
                    {
                        "en": "a suspicious look",
                        "vi": "một cái nhìn đáng ngờ"
                    },
                    {
                        "en": "You have a very suspicious mind (= you always think that people are behaving in an illegal or dishonest way).",
                        "vi": "Bạn có một tâm trí rất đa nghi (= bạn luôn nghĩ rằng mọi người đang cư xử một cách bất hợp pháp hoặc không trung thực)."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel that something is wrong, illegal or dishonest",
                    "vi": "khiến bạn cảm thấy có điều gì đó sai trái, bất hợp pháp hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Didn't you notice anything suspicious in his behaviour?",
                        "vi": "Bạn không nhận thấy điều gì đáng ngờ trong hành vi của anh ta?"
                    },
                    {
                        "en": "She died in suspicious circumstances.",
                        "vi": "Cô ấy chết trong hoàn cảnh đáng ngờ."
                    },
                    {
                        "en": "Police are not treating the fire as suspicious.",
                        "vi": "Cảnh sát không coi đám cháy là đáng ngờ."
                    },
                    {
                        "en": "It might look suspicious if we arrived together.",
                        "vi": "Nó có vẻ đáng ngờ nếu chúng tôi đến cùng nhau."
                    },
                    {
                        "en": "It was all very suspicious.",
                        "vi": "Tất cả đều rất đáng ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not willing or able to trust somebody/something",
                    "vi": "không sẵn lòng hoặc không thể tin tưởng ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was suspicious of his motives.",
                        "vi": "Tôi đã nghi ngờ về động cơ của anh ta."
                    },
                    {
                        "en": "Many were suspicious of reform.",
                        "vi": "Nhiều người nghi ngờ về cải cách."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7acd481276e4e5e9793dd9d2755a777",
        "word": "untruthful",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ʌnˈtruːθfl/",
            "us": "/ʌnˈtruːθfl/"
        },
        "nearby": [
            {
                "word": "untrustworthy",
                "pos": "adjective"
            },
            {
                "word": "untruth",
                "pos": "noun"
            },
            {
                "word": "untruthful",
                "pos": "adjective"
            },
            {
                "word": "untruthfully",
                "pos": "adverb"
            },
            {
                "word": "unturned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "saying things that you know are not true",
                    "vi": "nói những điều bạn biết là không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "The allegations make her out to be untruthful.",
                        "vi": "Các cáo buộc làm cho cô ấy là không trung thực."
                    },
                    {
                        "en": "an untruthful statement",
                        "vi": "một tuyên bố không trung thực"
                    }
                ]
            }
        ]
    },
    {
        "id": "45abd10c13de48abb2251165234d428c",
        "word": "artful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːtfl/",
            "us": "/ˈɑːrtfl/"
        },
        "nearby": [
            {
                "word": "Artex",
                "pos": "noun"
            },
            {
                "word": "art form",
                "pos": "noun"
            },
            {
                "word": "artful",
                "pos": "adjective"
            },
            {
                "word": "the Artful Dodger",
                "pos": ""
            },
            {
                "word": "artfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clever at getting what you want, sometimes by not telling the truth",
                    "vi": "thông minh trong việc đạt được những gì bạn muốn, đôi khi bằng cách không nói sự thật"
                },
                "examples": [
                    {
                        "en": "He was artful and cunning, and I didn’t really trust him.",
                        "vi": "Anh ấy là người nghệ thuật và tinh ranh, và tôi không thực sự tin tưởng anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "designed or done in a clever way",
                    "vi": "được thiết kế hoặc thực hiện một cách thông minh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "24fb1b1164d9475e8a26002fb6236415",
        "word": "bluff",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/blʌf/",
            "us": "/blʌf/"
        },
        "nearby": [
            {
                "word": "Bluetooth",
                "pos": "noun"
            },
            {
                "word": "blue whale",
                "pos": "noun"
            },
            {
                "word": "bluff",
                "pos": "verb"
            },
            {
                "word": "bluff",
                "pos": "noun"
            },
            {
                "word": "bluff",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to make somebody believe that you will do something that you do not really intend to do, or that you know something that you do not really know",
                    "vi": "để cố gắng làm cho ai đó tin rằng bạn sẽ làm điều gì đó mà bạn không thực sự định làm hoặc rằng bạn biết điều gì đó mà bạn không thực sự biết"
                },
                "examples": [
                    {
                        "en": "I don't think he'll shoot—I think he's just bluffing.",
                        "vi": "Tôi không nghĩ anh ta sẽ bắn - tôi nghĩ anh ta chỉ đang lừa dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get out of a difficult situation by continuing to tell lies, especially when people suspect you are not being honest",
                    "vi": "để thoát khỏi tình huống khó khăn bằng cách tiếp tục nói dối, đặc biệt là khi mọi người nghi ngờ bạn không trung thực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b297646207c476cb6ccf64b15da53a9",
        "word": "bogus",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbəʊɡəs/",
            "us": "/ˈbəʊɡəs/"
        },
        "nearby": [
            {
                "word": "Bogside",
                "pos": ""
            },
            {
                "word": "bog-standard",
                "pos": "adjective"
            },
            {
                "word": "bogus",
                "pos": "adjective"
            },
            {
                "word": "bogy",
                "pos": "noun"
            },
            {
                "word": "bogy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pretending to be real or true",
                    "vi": "giả vờ là thật hay sự thật"
                },
                "examples": [
                    {
                        "en": "a bogus doctor/contract",
                        "vi": "một bác sĩ không có thật / hợp đồng"
                    },
                    {
                        "en": "Bogus claims of injury by workers are costing companies thousands of pounds.",
                        "vi": "Bogus tuyên bố thương tích của các công nhân đang khiến các công ty phải trả hàng nghìn bảng Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "35a7adc877e3408c9fe6eec8c91b1a09",
        "word": "conniving",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnaɪvɪŋ/",
            "us": "/kəˈnaɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "connivance",
                "pos": "noun"
            },
            {
                "word": "connive",
                "pos": "verb"
            },
            {
                "word": "conniving",
                "pos": "adjective"
            },
            {
                "word": "connoisseur",
                "pos": "noun"
            },
            {
                "word": "Cyril Connolly",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a way that secretly hurts others or deliberately fails to prevent others from being hurt",
                    "vi": "hành xử theo cách làm tổn thương người khác một cách bí mật hoặc cố tình không ngăn cản người khác bị tổn thương"
                },
                "examples": [
                    {
                        "en": "He plays a power-hungry, conniving politician in the new Wednesday-night drama.",
                        "vi": "Anh ấy đóng vai một chính trị gia ngông cuồng, ham quyền lực trong bộ phim truyền hình tối thứ Tư mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "8995b3d70d074011b1dbf8818b22c8f7",
        "word": "crafty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɑːfti/",
            "us": "/ˈkræfti/"
        },
        "nearby": [
            {
                "word": "craftswoman",
                "pos": "noun"
            },
            {
                "word": "craftwork",
                "pos": "noun"
            },
            {
                "word": "crafty",
                "pos": "adjective"
            },
            {
                "word": "crag",
                "pos": "noun"
            },
            {
                "word": "craggy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clever at getting what you want, especially by indirect or dishonest methods",
                    "vi": "thông minh trong việc đạt được những gì bạn muốn, đặc biệt là bằng các phương pháp gián tiếp hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "He's a crafty old devil.",
                        "vi": "Hắn là một lão quỷ xảo quyệt."
                    },
                    {
                        "en": "one of the party’s craftiest political strategists",
                        "vi": "một trong những chiến lược gia chính trị xảo quyệt nhất của đảng"
                    },
                    {
                        "en": "There are times when the only way to win is by a crafty reinterpretation of the rules.",
                        "vi": "Đôi khi, cách duy nhất để giành chiến thắng là giải thích lại các quy tắc một cách xảo quyệt."
                    },
                    {
                        "en": "That was a crafty move/touch.",
                        "vi": "Đó là một động tác / chạm xảo quyệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "16855b0f21c64de8b2984a7a097d3807",
        "word": "cunning",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌnɪŋ/",
            "us": "/ˈkʌnɪŋ/"
        },
        "nearby": [
            {
                "word": "cuneiform",
                "pos": "noun"
            },
            {
                "word": "cunnilingus",
                "pos": "noun"
            },
            {
                "word": "cunning",
                "pos": "adjective"
            },
            {
                "word": "cunning",
                "pos": "noun"
            },
            {
                "word": "cunningly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to get what you want in a clever way, especially by tricking or cheating somebody",
                    "vi": "có thể đạt được những gì bạn muốn một cách thông minh, đặc biệt là bằng cách lừa hoặc lừa ai đó"
                },
                "examples": [
                    {
                        "en": "a cunning liar",
                        "vi": "một kẻ nói dối xảo quyệt"
                    },
                    {
                        "en": "He was as cunning as a fox.",
                        "vi": "Anh ta tinh ranh như một con cáo."
                    },
                    {
                        "en": "That cunning old rogue is up to something, I'm sure.",
                        "vi": "Tôi chắc chắn rằng tên lừa đảo già xảo quyệt đó đang phụ thuộc vào một thứ gì đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "clever and showing skill",
                    "vi": "khéo léo và thể hiện kỹ năng"
                },
                "examples": [
                    {
                        "en": "It was a cunning piece of detective work.",
                        "vi": "Đó là một tác phẩm trinh thám xảo quyệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "b80dea64f889424e9d74ba14c08f7e82",
        "word": "cunning",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌnɪŋ/",
            "us": "/ˈkʌnɪŋ/"
        },
        "nearby": [
            {
                "word": "cunnilingus",
                "pos": "noun"
            },
            {
                "word": "cunning",
                "pos": "adjective"
            },
            {
                "word": "cunning",
                "pos": "noun"
            },
            {
                "word": "cunningly",
                "pos": "adverb"
            },
            {
                "word": "cunt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to achieve something by tricking or cheating other people in a clever way",
                    "vi": "khả năng đạt được điều gì đó bằng cách lừa hoặc lừa người khác một cách thông minh"
                },
                "examples": [
                    {
                        "en": "It took energy and cunning just to survive.",
                        "vi": "Nó cần năng lượng và sự khôn ngoan chỉ để tồn tại."
                    },
                    {
                        "en": "She used low cunning (= dishonest behaviour) to get what she wanted.",
                        "vi": "Cô ấy đã sử dụng sự xảo quyệt thấp (= hành vi không trung thực) để đạt được những gì cô ấy muốn."
                    }
                ]
            }
        ]
    },
    {
        "id": "600a2d4a7e7849388ce42e125744662d",
        "word": "deceit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈsiːt/",
            "us": "/dɪˈsiːt/"
        },
        "nearby": [
            {
                "word": "decease",
                "pos": "noun"
            },
            {
                "word": "deceased",
                "pos": "adjective"
            },
            {
                "word": "deceit",
                "pos": "noun"
            },
            {
                "word": "deceitful",
                "pos": "adjective"
            },
            {
                "word": "deceitfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dishonest behaviour that is intended to make somebody believe something that is not true; an example of this behaviour",
                    "vi": "hành vi không trung thực nhằm làm cho ai đó tin điều gì đó không đúng sự thật; một ví dụ về hành vi này"
                },
                "examples": [
                    {
                        "en": "He was accused of lies and deceit.",
                        "vi": "Anh ta bị buộc tội dối trá và gian dối."
                    },
                    {
                        "en": "Everyone was involved in this web of deceit.",
                        "vi": "Mọi người đều tham gia vào trang web lừa dối này."
                    },
                    {
                        "en": "Their marriage was an illusion and a deceit.",
                        "vi": "Cuộc hôn nhân của họ là ảo tưởng và lừa dối."
                    },
                    {
                        "en": "She realized that their whole relationship had been based on lies and deceit.",
                        "vi": "Cô nhận ra rằng toàn bộ mối quan hệ của họ đều dựa trên sự dối trá và lừa dối."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ad121f5df5e4478b340b4eadc4c125c",
        "word": "deceitful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈsiːtfl/",
            "us": "/dɪˈsiːtfl/"
        },
        "nearby": [
            {
                "word": "deceased",
                "pos": "adjective"
            },
            {
                "word": "deceit",
                "pos": "noun"
            },
            {
                "word": "deceitful",
                "pos": "adjective"
            },
            {
                "word": "deceitfully",
                "pos": "adverb"
            },
            {
                "word": "deceitfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a dishonest way by telling lies and making people believe things that are not true",
                    "vi": "cư xử một cách không trung thực bằng cách nói dối và làm cho mọi người tin những điều không có thật"
                },
                "examples": [
                    {
                        "en": "The government were accused of being hypocritical and deceitful.",
                        "vi": "Chính phủ bị buộc tội đạo đức giả và gian dối."
                    }
                ]
            }
        ]
    },
    {
        "id": "a028e4a295544bb289a80594ec0b6af8",
        "word": "devious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdiːviəs/",
            "us": "/ˈdiːviəs/"
        },
        "nearby": [
            {
                "word": "devil's food cake",
                "pos": "noun"
            },
            {
                "word": "devils on horseback",
                "pos": "noun"
            },
            {
                "word": "devious",
                "pos": "adjective"
            },
            {
                "word": "deviously",
                "pos": "adverb"
            },
            {
                "word": "deviousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaving in a dishonest or indirect way, or tricking people, in order to get something",
                    "vi": "hành xử một cách không trung thực hoặc gián tiếp, hoặc lừa mọi người, để có được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a devious politician",
                        "vi": "một chính trị gia ranh ma"
                    },
                    {
                        "en": "He got rich by devious means.",
                        "vi": "Anh ta giàu lên bằng cách gian dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a route or path that is not straight but has many changes in direction; not direct",
                    "vi": "một tuyến đường hoặc con đường không thẳng mà có nhiều thay đổi về hướng; không trực tiếp"
                },
                "examples": [
                    {
                        "en": "a devious route from the airport",
                        "vi": "một con đường quanh co từ sân bay"
                    }
                ]
            }
        ]
    },
    {
        "id": "38eea335d0b94dc5a042345da475418b",
        "word": "dubious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdjuːbiəs/",
            "us": "/ˈduːbiəs/"
        },
        "nearby": [
            {
                "word": "dubbin",
                "pos": "noun"
            },
            {
                "word": "dubiety",
                "pos": "noun"
            },
            {
                "word": "dubious",
                "pos": "adjective"
            },
            {
                "word": "dubiously",
                "pos": "adverb"
            },
            {
                "word": "Dublin",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not certain about something and suspecting that something may be wrong; not knowing whether something is good or bad",
                    "vi": "không chắc chắn về điều gì đó và nghi ngờ rằng điều gì đó có thể sai; không biết liệu điều gì đó là tốt hay xấu"
                },
                "examples": [
                    {
                        "en": "I was rather dubious about the whole idea.",
                        "vi": "Tôi khá nghi ngờ về toàn bộ ý tưởng."
                    },
                    {
                        "en": "Kate looked dubious, but did as she was asked.",
                        "vi": "Kate trông có vẻ nghi ngờ, nhưng đã làm theo lời cô ấy được yêu cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "probably not honest",
                    "vi": "có lẽ không trung thực"
                },
                "examples": [
                    {
                        "en": "They indulged in some highly dubious business practices to obtain their current position in the market.",
                        "vi": "Họ đã tham gia vào một số hoạt động kinh doanh đáng ngờ vực để có được vị trí hiện tại trên thị trường."
                    },
                    {
                        "en": "The man who sold it to him was known to be of dubious character.",
                        "vi": "Người đàn ông đã bán nó cho anh ta được biết đến là một nhân vật đáng ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you cannot be sure about; that is probably not good",
                    "vi": "mà bạn không thể chắc chắn về; điều đó có lẽ không tốt"
                },
                "examples": [
                    {
                        "en": "They consider the plan to be of dubious benefit to most families.",
                        "vi": "Họ coi kế hoạch này mang lại lợi ích không rõ ràng cho hầu hết các gia đình."
                    },
                    {
                        "en": "(ironic) She had the dubious honour of being the last woman to be hanged in England (= it was not an honour at all).",
                        "vi": "(mỉa mai) Cô ấy có vinh dự đáng ngờ là người phụ nữ cuối cùng bị treo cổ ở Anh (= đó không phải là một vinh dự nào cả)."
                    }
                ]
            }
        ]
    },
    {
        "id": "14188dd2b0e341d798d62c06f1029e8c",
        "word": "duplicity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/djuːˈplɪsəti/",
            "us": "/duːˈplɪsəti/"
        },
        "nearby": [
            {
                "word": "duplication",
                "pos": "noun"
            },
            {
                "word": "duplicitous",
                "pos": "adjective"
            },
            {
                "word": "duplicity",
                "pos": "noun"
            },
            {
                "word": "DuPont",
                "pos": ""
            },
            {
                "word": "durability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dishonest behaviour that is intended to make somebody believe something that is not true",
                    "vi": "hành vi không trung thực nhằm mục đích khiến ai đó tin điều gì đó không đúng sự thật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bdd4a76410c34d7daf95b7f502a279a1",
        "word": "fickle",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪkl/",
            "us": "/ˈfɪkl/"
        },
        "nearby": [
            {
                "word": "fibula",
                "pos": "noun"
            },
            {
                "word": "FICA",
                "pos": ""
            },
            {
                "word": "fickle",
                "pos": "adjective"
            },
            {
                "word": "fickleness",
                "pos": "noun"
            },
            {
                "word": "fiction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "changing often and suddenly",
                    "vi": "thay đổi thường xuyên và đột ngột"
                },
                "examples": [
                    {
                        "en": "The weather here is notoriously fickle.",
                        "vi": "Thời tiết ở đây nổi tiếng là hay thay đổi."
                    },
                    {
                        "en": "Such is life in the fickle world of fashion.",
                        "vi": "Đó là cuộc sống trong thế giới thời trang hay thay đổi."
                    },
                    {
                        "en": "The latest downturn in sales shows just what a fickle business this is.",
                        "vi": "Sự suy thoái mới nhất về doanh số bán hàng cho thấy đây là một công việc kinh doanh hay thay đổi."
                    },
                    {
                        "en": "the fickle finger of fate",
                        "vi": "ngón tay hay thay đổi của số phận"
                    },
                    {
                        "en": "Always be properly dressed and prepared to cope with our fickle weather.",
                        "vi": "Luôn mặc quần áo phù hợp và chuẩn bị để đối phó với thời tiết thay đổi của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "often changing their mind in an unreasonable way so that you cannot rely on them",
                    "vi": "thường thay đổi suy nghĩ của họ một cách không hợp lý để bạn không thể dựa vào họ"
                },
                "examples": [
                    {
                        "en": "She had been a fickle friend, even at the best of times.",
                        "vi": "Cô ấy là một người bạn hay thay đổi, ngay cả vào những thời điểm tốt nhất."
                    },
                    {
                        "en": "another example of his fickle behaviour",
                        "vi": "một ví dụ khác về hành vi hay thay đổi của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "56cd8313e39448f59492dc058a9b74f2",
        "word": "forced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/fɔːst/",
            "us": "/fɔːrst/"
        },
        "nearby": [
            {
                "word": "force",
                "pos": "verb"
            },
            {
                "word": "force back",
                "pos": "phrasal verb"
            },
            {
                "word": "forced",
                "pos": "adjective"
            },
            {
                "word": "forced entry",
                "pos": "noun"
            },
            {
                "word": "forced labour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "happening or done against somebody’s will",
                    "vi": "xảy ra hoặc làm trái với ý muốn của ai đó"
                },
                "examples": [
                    {
                        "en": "victims of forced marriage",
                        "vi": "nạn nhân của hôn nhân cưỡng bức"
                    },
                    {
                        "en": "forced relocation to a job in another city",
                        "vi": "buộc phải chuyển đến một công việc ở thành phố khác"
                    },
                    {
                        "en": "I hope there will be no need for the forced sale of any property.",
                        "vi": "Tôi hy vọng sẽ không có nhu cầu buộc phải bán bất kỳ tài sản nào."
                    },
                    {
                        "en": "Many are unhappy about the forced repatriation of the refugees.",
                        "vi": "Nhiều người không hài lòng về việc buộc phải hồi hương những người tị nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not sincere; not the result of real emotions",
                    "vi": "Không thật thà; không phải là kết quả của những cảm xúc thực sự"
                },
                "examples": [
                    {
                        "en": "She said she was enjoying herself but her smile was forced.",
                        "vi": "Cô ấy nói rằng cô ấy đang tận hưởng bản thân nhưng nụ cười của cô ấy gượng gạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "adbefd1334e54dc6868861b6a50d69e8",
        "word": "front",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/frʌnt/",
            "us": "/frʌnt/"
        },
        "nearby": [
            {
                "word": "frond",
                "pos": "noun"
            },
            {
                "word": "front of house",
                "pos": "adverb"
            },
            {
                "word": "front",
                "pos": "noun"
            },
            {
                "word": "front",
                "pos": "adjective"
            },
            {
                "word": "front",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part or side of something that faces forward; the side of something that you look at first",
                    "vi": "một phần hoặc một mặt của cái gì đó hướng về phía trước; mặt của một cái gì đó mà bạn nhìn vào đầu tiên"
                },
                "examples": [
                    {
                        "en": "The front of the building was covered with ivy.",
                        "vi": "Mặt trước của tòa nhà được bao phủ bởi cây thường xuân."
                    },
                    {
                        "en": "The front of the car was badly damaged.",
                        "vi": "Phần đầu xe hư hỏng nặng."
                    },
                    {
                        "en": "on the front The book has a picture of Rome on the front.",
                        "vi": "ở mặt trước Cuốn sách có hình thành Rome ở mặt trước."
                    },
                    {
                        "en": "up the front The jacket zips up the front.",
                        "vi": "lên phía trước Áo khoác kéo khóa phía trước."
                    },
                    {
                        "en": "down the front a green sleeveless top which buttons down the front",
                        "vi": "xuống phía trước một chiếc áo không tay màu xanh lá cây có nút ở phía trước"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position that is directly ahead of somebody/something",
                    "vi": "vị trí trực tiếp phía trước ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I turned round to face the front.",
                        "vi": "Tôi quay tròn mặt trước."
                    },
                    {
                        "en": "Keep your eyes to the front and walk straight ahead.",
                        "vi": "Giữ mắt của bạn về phía trước và đi thẳng về phía trước."
                    },
                    {
                        "en": "at the front of something There's a garden at the front of the house.",
                        "vi": "ở phía trước của một cái gì đó Có một khu vườn ở phía trước của ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of something that is furthest forward",
                    "vi": "phần của cái gì đó xa nhất về phía trước"
                },
                "examples": [
                    {
                        "en": "The singer came to the front of the stage.",
                        "vi": "Nữ ca sĩ bước ra trước sân khấu."
                    },
                    {
                        "en": "The teacher made me move my seat to the front of the classroom.",
                        "vi": "Cô giáo bắt tôi chuyển chỗ ngồi ra trước lớp."
                    },
                    {
                        "en": "at the front She always sits at the front.",
                        "vi": "ở phía trước Cô ấy luôn ngồi ở phía trước."
                    },
                    {
                        "en": "at the front of something Put your fare into the box at the front of the bus.",
                        "vi": "ở phía trước của một cái gì đó Bỏ tiền vé của bạn vào hộp ở phía trước xe buýt."
                    },
                    {
                        "en": "in the front I prefer to travel in the front (= next to the driver in a car).",
                        "vi": "ở phía trước Tôi thích đi phía trước (= bên cạnh người lái xe trong ô tô)."
                    },
                    {
                        "en": "in the front of something Write your name in the front of the book (= the first few pages).",
                        "vi": "ở phía trước của một cái gì đó Viết tên của bạn ở phía trước của cuốn sách (= vài trang đầu tiên)."
                    },
                    {
                        "en": "to the front (of something) The dining room is to the front of the house.",
                        "vi": "phía trước (của cái gì đó) Phòng ăn ở phía trước của ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of somebody’s body that faces forwards",
                    "vi": "phần cơ thể của ai đó hướng về phía trước"
                },
                "examples": [
                    {
                        "en": "on your front She was lying on her front.",
                        "vi": "ở phía trước của bạn Cô ấy đã nằm trên mặt trước của cô ấy."
                    },
                    {
                        "en": "down your front I spilled coffee down my front.",
                        "vi": "xuống phía trước của bạn, tôi đã làm đổ cà phê xuống phía trước của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a large building, especially a church, that faces west, north, etc.",
                    "vi": "Mặt bên của một tòa nhà lớn, đặc biệt là nhà thờ, quay mặt về hướng Tây, Bắc, v.v."
                },
                "examples": [
                    {
                        "en": "the west front of the cathedral",
                        "vi": "mặt trước phía tây của nhà thờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the road or area of land along the edge of the sea, a lake or a river",
                    "vi": "con đường hoặc khu vực đất dọc theo mép biển, hồ hoặc sông"
                },
                "examples": [
                    {
                        "en": "Couples walked hand in hand along the front.",
                        "vi": "Cặp đôi tay trong tay đi dọc phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area where fighting takes place during a war",
                    "vi": "một khu vực xảy ra giao tranh trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "More British troops have been sent to the front.",
                        "vi": "Nhiều quân đội Anh đã được gửi đến mặt trận."
                    },
                    {
                        "en": "to serve at the front",
                        "vi": "phục vụ ở phía trước"
                    },
                    {
                        "en": "fighting a war on two fronts",
                        "vi": "chiến đấu trên hai mặt trận"
                    },
                    {
                        "en": "Reports from the battle fronts became briefer and vaguer.",
                        "vi": "Các báo cáo từ các mặt trận chiến đấu trở nên ngắn gọn và mơ hồ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area of activity",
                    "vi": "một lĩnh vực hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "on the… front Things are looking unsettled on the economic front.",
                        "vi": "trên… mặt trận Mọi thứ đang có vẻ bất ổn trên mặt trận kinh tế."
                    },
                    {
                        "en": "Things should get a little easier on the work front soon.",
                        "vi": "Mọi thứ sẽ sớm dễ dàng hơn một chút trên mặt trận công việc."
                    },
                    {
                        "en": "Progress has been made on all fronts.",
                        "vi": "Tiến bộ đã được thực hiện trên tất cả các mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaviour that is not what it appears to be, done in order to hide somebody's true feelings or opinions",
                    "vi": "hành vi không giống như nó xuất hiện, được thực hiện để che giấu cảm xúc hoặc ý kiến thực sự của ai đó"
                },
                "examples": [
                    {
                        "en": "It's not always easy to put on a brave front for the family.",
                        "vi": "Không phải lúc nào cũng dễ dàng đặt ra một mặt trận dũng cảm cho gia đình."
                    },
                    {
                        "en": "front for something Rudeness is just a front for her shyness.",
                        "vi": "bình phong cho một điều gì đó Rudeness chỉ là bình phong cho sự nhút nhát của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an organization that is used to hide an illegal or secret activity",
                    "vi": "một người hoặc một tổ chức được sử dụng để che giấu một hoạt động bất hợp pháp hoặc bí mật"
                },
                "examples": [
                    {
                        "en": "The travel company is just a front for drug trafficking.",
                        "vi": "Công ty du lịch chỉ là bình phong cho hoạt động buôn bán ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some political organizations",
                    "vi": "được sử dụng trong tên của một số tổ chức chính trị"
                },
                "examples": [
                    {
                        "en": "the Animal Liberation Front",
                        "vi": "Mặt trận giải phóng động vật"
                    }
                ]
            },
            {
                "define": {
                    "en": "the line where a mass of cold air meets a mass of warm air",
                    "vi": "dòng mà một khối không khí lạnh gặp một khối không khí ấm"
                },
                "examples": [
                    {
                        "en": "a cold/warm front",
                        "vi": "mặt trước lạnh / ấm"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you put on a piece of clothing back to front, you make a mistake and put the back where the front should be",
                    "vi": "nếu bạn mặc một bộ quần áo trở lại phía trước, bạn đã mắc lỗi và đặt mặt sau vào vị trí của mặt trước"
                },
                "examples": [
                    {
                        "en": "I think you've got that sweater on back to front.",
                        "vi": "Tôi nghĩ bạn đã có chiếc áo len đó ở mặt sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "in somebody’s presence; in front of somebody",
                    "vi": "trong sự hiện diện của ai đó; trước mặt ai đó"
                },
                "examples": [
                    {
                        "en": "He had seen his life's work destroyed before his very eyes.",
                        "vi": "Anh đã chứng kiến công việc của cuộc đời mình bị phá hủy ngay trước mắt anh."
                    },
                    {
                        "en": "Before our very eyes, the bird snatched the fish from the plate and flew off.",
                        "vi": "Trước mắt chúng tôi, con chim đã giật lấy con cá trong đĩa và bay đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with immediate payment of cash",
                    "vi": "thanh toán ngay bằng tiền mặt"
                },
                "examples": [
                    {
                        "en": "to pay for something cash up front",
                        "vi": "trả trước cho thứ gì đó bằng tiền mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show people that all members of a group have the same opinion about things",
                    "vi": "để cho mọi người thấy rằng tất cả các thành viên của một nhóm đều có cùng quan điểm về mọi thứ"
                },
                "examples": [
                    {
                        "en": "The prime minister stressed the need to present a united front.",
                        "vi": "Thủ tướng nhấn mạnh sự cần thiết phải trình bày một mặt trận thống nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "in or into the most important position",
                    "vi": "ở hoặc vào vị trí quan trọng nhất"
                },
                "examples": [
                    {
                        "en": "The issue has moved front and center in his presidential campaign.",
                        "vi": "Vấn đề này đã trở thành trung tâm trong chiến dịch tranh cử tổng thống của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that is further forward than somebody/something but not very far away",
                    "vi": "ở một vị trí xa hơn về phía trước hơn ai đó / cái gì đó nhưng không ở rất xa"
                },
                "examples": [
                    {
                        "en": "Their house is the one with the big garden in front.",
                        "vi": "Ngôi nhà của họ là ngôi nhà có khu vườn lớn phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in first place in a race or competition",
                    "vi": "ở vị trí đầu tiên trong một cuộc đua hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "The blue team is currently in front with a lead of six points.",
                        "vi": "Đội bóng áo xanh hiện đang dẫn trước với sáu điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that is further forward than somebody/something but not very far away",
                    "vi": "ở một vị trí xa hơn về phía trước hơn ai đó / cái gì đó nhưng không ở rất xa"
                },
                "examples": [
                    {
                        "en": "The car in front of me stopped suddenly and I had to brake.",
                        "vi": "Chiếc xe phía trước dừng lại đột ngột và tôi phải phanh gấp."
                    },
                    {
                        "en": "The bus stops right in front of our house.",
                        "vi": "Xe buýt dừng ngay trước cửa nhà chúng tôi."
                    },
                    {
                        "en": "He was standing in front of me in the line.",
                        "vi": "Anh ấy đang đứng trước mặt tôi trong hàng."
                    },
                    {
                        "en": "She is now entitled to put ‘Professor’ in front of her name.",
                        "vi": "Bây giờ cô ấy có quyền đặt 'Giáo sư' trước tên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position facing somebody/something",
                    "vi": "ở vị trí đối mặt với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "to perform in front of a big crowd/audience",
                        "vi": "biểu diễn trước một đám đông lớn / khán giả"
                    },
                    {
                        "en": "She spends all day sitting in front of (= working at) her computer.",
                        "vi": "Cô ấy dành cả ngày để ngồi trước (= làm việc tại) máy tính của mình."
                    },
                    {
                        "en": "She's a natural in front of the camera (= being filmed/photographed).",
                        "vi": "Cô ấy rất tự nhiên trước ống kính (= được quay phim / chụp ảnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something in front of somebody, you do it when they are there",
                    "vi": "nếu bạn làm điều gì đó trước mặt ai đó, bạn làm điều đó khi họ ở đó"
                },
                "examples": [
                    {
                        "en": "Please don't talk about it in front of the children.",
                        "vi": "Xin đừng nói về nó trước mặt bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "still to come; not yet passed",
                    "vi": "vẫn sẽ đến; chưa vượt qua"
                },
                "examples": [
                    {
                        "en": "Don't give up. You still have your whole life in front of you.",
                        "vi": "Đừng bỏ cuộc. Bạn vẫn còn cả cuộc đời trước mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take an active part in what you are telling or persuading others to do",
                    "vi": "tham gia tích cực vào những gì bạn đang nói hoặc thuyết phục người khác làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in the part of a theatre, restaurant, etc. where the public sits",
                    "vi": "trong một phần của nhà hát, nhà hàng, v.v. nơi công chúng ngồi"
                },
                "examples": [
                    {
                        "en": "There's only a small audience out front tonight.",
                        "vi": "Chỉ có một lượng nhỏ khán giả ở phía trước đêm nay."
                    },
                    {
                        "en": "He cooked while she sat out front and waited tables.",
                        "vi": "Anh nấu ăn trong khi cô ngồi ngoài bàn đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the area near to the entrance to a building",
                    "vi": "trong khu vực gần lối vào một tòa nhà"
                },
                "examples": [
                    {
                        "en": "I’ll wait for you out (the) front.",
                        "vi": "Tôi sẽ đợi bạn ở phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "as payment in advance",
                    "vi": "như thanh toán trước"
                },
                "examples": [
                    {
                        "en": "We'll pay you half up front and the other half when you've finished the job.",
                        "vi": "Chúng tôi sẽ trả trước cho bạn một nửa và nửa còn lại khi bạn hoàn thành công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a forward position",
                    "vi": "ở một vị trí phía trước"
                },
                "examples": [
                    {
                        "en": "to play up front",
                        "vi": "chơi trước"
                    }
                ]
            }
        ]
    },
    {
        "id": "eee229e970e543fcba8dddbc34682b39",
        "word": "guile",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡaɪl/",
            "us": "/ɡaɪl/"
        },
        "nearby": [
            {
                "word": "guildhall",
                "pos": "noun"
            },
            {
                "word": "the Guildhall",
                "pos": ""
            },
            {
                "word": "guile",
                "pos": "noun"
            },
            {
                "word": "guileless",
                "pos": "adjective"
            },
            {
                "word": "guilelessly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the use of clever but dishonest behaviour in order to trick people",
                    "vi": "sử dụng các hành vi khôn khéo nhưng không trung thực để lừa mọi người"
                },
                "examples": [
                    {
                        "en": "George was a man completely lacking in guile.",
                        "vi": "George là một người hoàn toàn thiếu sáng tạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "b132983b70c94418ba9d10059690bd36",
        "word": "inconstancy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈkɒnstənsi/",
            "us": "/ɪnˈkɑːnstənsi/"
        },
        "nearby": [
            {
                "word": "inconspicuous",
                "pos": "adjective"
            },
            {
                "word": "inconspicuously",
                "pos": "adverb"
            },
            {
                "word": "inconstancy",
                "pos": "noun"
            },
            {
                "word": "inconstant",
                "pos": "adjective"
            },
            {
                "word": "incontestable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact that somebody is not faithful in love or friendship",
                    "vi": "thực tế là ai đó không chung thủy trong tình yêu hoặc tình bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "060ae69a387e4418b0a50314a226385d",
        "word": "inconstant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈkɒnstənt/",
            "us": "/ɪnˈkɑːnstənt/"
        },
        "nearby": [
            {
                "word": "inconspicuously",
                "pos": "adverb"
            },
            {
                "word": "inconstancy",
                "pos": "noun"
            },
            {
                "word": "inconstant",
                "pos": "adjective"
            },
            {
                "word": "incontestable",
                "pos": "adjective"
            },
            {
                "word": "incontestably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not faithful in love or friendship",
                    "vi": "không chung thủy trong tình yêu hoặc tình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "that frequently changes",
                    "vi": "thường xuyên thay đổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c1579cd5173247fc8f6fd9bc2ace66bc",
        "word": "kid",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kɪd/",
            "us": "/kɪd/"
        },
        "nearby": [
            {
                "word": "kick up",
                "pos": "phrasal verb"
            },
            {
                "word": "kid",
                "pos": "noun"
            },
            {
                "word": "kid",
                "pos": "verb"
            },
            {
                "word": "kid",
                "pos": "adjective"
            },
            {
                "word": "kid around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell somebody something that is not true, especially as a joke",
                    "vi": "nói với ai đó điều gì đó không có thật, đặc biệt là một trò đùa"
                },
                "examples": [
                    {
                        "en": "I thought he was kidding when he said he was going out with a rock star.",
                        "vi": "Tôi đã nghĩ rằng anh ấy đang đùa khi nói rằng anh ấy đang hẹn hò với một ngôi sao nhạc rock."
                    },
                    {
                        "en": "I didn't mean it. I was only kidding.",
                        "vi": "Tôi không cố ý. Tôi chỉ đùa thôi."
                    },
                    {
                        "en": "kid somebody I'm not kidding you. It does work.",
                        "vi": "đùa ai đó Tôi không đùa bạn đâu. Nó hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody/yourself to believe something that is not true",
                    "vi": "để cho phép ai đó / chính bạn tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "kid somebody/yourself They're kidding themselves if they think it's going to be easy.",
                        "vi": "đùa ai đó / chính bạn Họ đang tự đùa mình nếu họ nghĩ rằng nó sẽ dễ dàng."
                    },
                    {
                        "en": "kid somebody/yourself (that)… I tried to kid myself (that) everything was normal.",
                        "vi": "đứa nào đó / chính bạn (điều đó)… Tôi đã cố gắng tự đùa mình (rằng) mọi thứ đều bình thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that something is true or that you agree with something that somebody has just said",
                    "vi": "được sử dụng để nhấn mạnh rằng điều gì đó là đúng hoặc bạn đồng ý với điều gì đó mà ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘It's cold!’ ‘No kidding!’",
                        "vi": "Trời lạnh!' 'Không đua đâu!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you mean what you are saying",
                    "vi": "được sử dụng để thể hiện rằng bạn có nghĩa là những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "I want the money back tomorrow. No kidding.",
                        "vi": "Tôi muốn trả lại tiền vào ngày mai. Không đua đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are very surprised at something that somebody has just said",
                    "vi": "được sử dụng để cho thấy rằng bạn rất ngạc nhiên về điều gì đó mà ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "She fired you? You're kidding! Why?",
                        "vi": "Cô ấy sa thải bạn? Bạn đang đùa! Tại sao?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3f35fbf3e04d40bda0ccf87242669068",
        "word": "lead on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "lead off",
                "pos": "phrasal verb"
            },
            {
                "word": "lead-off",
                "pos": "adjective"
            },
            {
                "word": "lead on",
                "pos": "phrasal verb"
            },
            {
                "word": "lead shot",
                "pos": "noun"
            },
            {
                "word": "lead story",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody believe something that is not true, especially that you love them or find them attractive",
                    "vi": "để khiến ai đó tin điều gì đó không đúng, đặc biệt là bạn yêu họ hoặc thấy họ hấp dẫn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b67cda955cb246fea999746fae05472a",
        "word": "phoney",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊni/",
            "us": "/ˈfəʊni/"
        },
        "nearby": [
            {
                "word": "phonetics",
                "pos": "noun"
            },
            {
                "word": "phone tree",
                "pos": "noun"
            },
            {
                "word": "phoney",
                "pos": "adjective"
            },
            {
                "word": "phoney",
                "pos": "noun"
            },
            {
                "word": "phoney war",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not real or true; false, and trying to trick people",
                    "vi": "không có thật hay sự thật; sai và cố gắng lừa mọi người"
                },
                "examples": [
                    {
                        "en": "She spoke with a phoney Russian accent.",
                        "vi": "Cô ấy nói với giọng Nga đặc sệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "dffb7ef00ff448ea98e888dfad2c4d67",
        "word": "phony",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊni/",
            "us": "/ˈfəʊni/"
        },
        "nearby": [
            {
                "word": "phonotactic",
                "pos": "adjective"
            },
            {
                "word": "phonotactics",
                "pos": "noun"
            },
            {
                "word": "phony",
                "pos": "adjective"
            },
            {
                "word": "phony",
                "pos": "noun"
            },
            {
                "word": "phooey",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not real or true; false, and trying to trick people",
                    "vi": "không có thật hay sự thật; sai và cố gắng lừa mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "81dbba0064cc4dd188cf302129475102",
        "word": "shifty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɪfti/",
            "us": "/ˈʃɪfti/"
        },
        "nearby": [
            {
                "word": "shifting cultivation",
                "pos": "noun"
            },
            {
                "word": "shiftless",
                "pos": "adjective"
            },
            {
                "word": "shifty",
                "pos": "adjective"
            },
            {
                "word": "shiitake",
                "pos": "noun"
            },
            {
                "word": "Shiite",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "seeming to be dishonest; looking guilty about something",
                    "vi": "có vẻ không trung thực; có vẻ tội lỗi về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "shifty eyes",
                        "vi": "Đôi mắt tinh nghịch"
                    },
                    {
                        "en": "to look shifty",
                        "vi": "trông gian xảo"
                    }
                ]
            }
        ]
    },
    {
        "id": "d462460c7a7e4a9ab8d4c2ed2d166dd1",
        "word": "sly",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/slaɪ/",
            "us": "/slaɪ/"
        },
        "nearby": [
            {
                "word": "slut",
                "pos": "noun"
            },
            {
                "word": "sluttish",
                "pos": "adjective"
            },
            {
                "word": "sly",
                "pos": "adjective"
            },
            {
                "word": "slyly",
                "pos": "adverb"
            },
            {
                "word": "slyness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "acting or done in a secret or dishonest way, often intending to trick people",
                    "vi": "hành động hoặc thực hiện một cách bí mật hoặc không trung thực, thường có ý định lừa mọi người"
                },
                "examples": [
                    {
                        "en": "a sly political move",
                        "vi": "một động thái chính trị ranh mãnh"
                    },
                    {
                        "en": "(humorous) You sly old devil! How long have you known?",
                        "vi": "(hài hước) Đồ quỷ già ranh mãnh! Có bao lâu mà bạn biết?"
                    },
                    {
                        "en": "She’s a sly one—never lets on what she’s thinking.",
                        "vi": "Cô ấy là một người ranh mãnh - không bao giờ để ý đến những gì cô ấy đang nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "suggesting that you know something secret that other people do not know",
                    "vi": "gợi ý rằng bạn biết điều gì đó bí mật mà người khác không biết"
                },
                "examples": [
                    {
                        "en": "a sly smile/grin",
                        "vi": "một nụ cười ranh mãnh / nụ cười toe toét"
                    }
                ]
            },
            {
                "define": {
                    "en": "secretly; not wanting other people to discover what you are doing",
                    "vi": "bí mật; không muốn người khác phát hiện ra bạn đang làm gì"
                },
                "examples": [
                    {
                        "en": "He has to visit them on the sly.",
                        "vi": "Anh ta phải đến thăm họ trên ranh giới."
                    }
                ]
            }
        ]
    },
    {
        "id": "4dd45a2030634cd1943d92a9a84a79d7",
        "word": "smear",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/smɪə(r)/",
            "us": "/smɪr/"
        },
        "nearby": [
            {
                "word": "smash-up",
                "pos": "noun"
            },
            {
                "word": "smattering",
                "pos": "noun"
            },
            {
                "word": "smear",
                "pos": "verb"
            },
            {
                "word": "smear",
                "pos": "noun"
            },
            {
                "word": "smear test",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spread an oily or soft substance over a surface in a rough or careless way",
                    "vi": "trét chất nhờn hoặc chất mềm lên bề mặt một cách thô ráp hoặc bất cẩn"
                },
                "examples": [
                    {
                        "en": "smear something on/over something The children had smeared mud on the walls.",
                        "vi": "bôi bẩn thứ gì đó lên / lên thứ gì đó Bọn trẻ đã bôi bùn lên tường."
                    },
                    {
                        "en": "smear something with something The children had smeared the walls with mud.",
                        "vi": "bôi bẩn cái gì đó bằng thứ gì đó Bọn trẻ đã bôi bùn lên tường."
                    },
                    {
                        "en": "His face was smeared with blood.",
                        "vi": "Mặt anh bê bết máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something dirty or greasy",
                    "vi": "để làm một cái gì đó bẩn hoặc nhờn"
                },
                "examples": [
                    {
                        "en": "(be) smeared His glasses were smeared.",
                        "vi": "(be) smeared Kính của anh ấy đã bị lem."
                    },
                    {
                        "en": "smeared windows",
                        "vi": "cửa sổ bị bôi bẩn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to damage somebody’s reputation by saying unpleasant things about them that are not true",
                    "vi": "làm tổn hại danh tiếng của ai đó bằng cách nói những điều khó chịu về họ không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "The story was an attempt to smear the party leader.",
                        "vi": "Câu chuyện là một nỗ lực để bôi nhọ lãnh đạo đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to rub writing, a drawing, etc. so that it is no longer clear; to become not clear in this way",
                    "vi": "để cọ xát viết, một bản vẽ, vv để nó không còn rõ ràng; trở nên không rõ ràng theo cách này"
                },
                "examples": [
                    {
                        "en": "be smeared The last few words of the letter were smeared.",
                        "vi": "bị bôi nhọ Vài chữ cuối cùng của bức thư đã bị bôi nhọ."
                    },
                    {
                        "en": "be smeared + adv./prep. Jam was smeared all over his face.",
                        "vi": "bị bôi nhọ + adv./prep. Jam bị bôi khắp mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae12844995a74c59b86efc6406c8688c",
        "word": "spin (somebody) a yarn, tale, etc.",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/spɪn/",
            "us": "/spɪn/"
        },
        "nearby": [
            {
                "word": "spillway",
                "pos": "noun"
            },
            {
                "word": "spim",
                "pos": "noun"
            },
            {
                "word": "spin",
                "pos": "verb"
            },
            {
                "word": "spin",
                "pos": "noun"
            },
            {
                "word": "spina bifida",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn round and round quickly; to make something do this",
                    "vi": "để quay tròn và quay một cách nhanh chóng; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "(+ adv./prep.) The plane was spinning out of control.",
                        "vi": "(+ adv./prep.) Máy bay quay ngoài tầm kiểm soát."
                    },
                    {
                        "en": "a spinning ice skater",
                        "vi": "một vận động viên trượt băng quay"
                    },
                    {
                        "en": "My head is spinning (= I feel as if my head is going round and I can't balance).",
                        "vi": "Đầu tôi quay cuồng (= Tôi cảm thấy như thể đầu mình quay tròn và tôi không thể giữ thăng bằng)."
                    },
                    {
                        "en": "spin round/around The dancers spun round and round.",
                        "vi": "quay tròn / xung quanh Các vũ công quay tròn và tròn."
                    },
                    {
                        "en": "spin something (round/around) to spin a ball/coin/wheel",
                        "vi": "quay một cái gì đó (vòng / xung quanh) để quay một quả bóng / đồng xu / bánh xe"
                    },
                    {
                        "en": "We placed our bets and the croupier spun the roulette wheel.",
                        "vi": "Chúng tôi đã đặt cược của mình và người đánh bạc quay bánh xe roulette."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn round quickly once; to make somebody do this",
                    "vi": "để quay một vòng nhanh chóng một lần; để khiến ai đó làm điều này"
                },
                "examples": [
                    {
                        "en": "He spun around to face her.",
                        "vi": "Anh xoay người lại để đối mặt với cô."
                    },
                    {
                        "en": "She spun on her heel and walked out.",
                        "vi": "Cô quay gót bước ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make thread from wool, cotton, silk, etc. by twisting it",
                    "vi": "để tạo chỉ từ len, bông, lụa, v.v. bằng cách xoắn nó"
                },
                "examples": [
                    {
                        "en": "She sat by the window spinning.",
                        "vi": "Cô ngồi bên cửa sổ quay cuồng."
                    },
                    {
                        "en": "spin something to spin and knit wool",
                        "vi": "quay cái gì đó để quay và đan len"
                    },
                    {
                        "en": "spin A into B spinning silk into thread",
                        "vi": "quay A thành B kéo tơ thành sợi"
                    },
                    {
                        "en": "spin B from A spinning thread from silk",
                        "vi": "quay B từ A kéo sợi từ tơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce thread from its body to make a web or cocoon",
                    "vi": "để tạo ra sợi từ cơ thể của nó để tạo thành một trang web hoặc kén"
                },
                "examples": [
                    {
                        "en": "a spider spinning a web",
                        "vi": "một con nhện quay trên mạng"
                    },
                    {
                        "en": "A silkworm spins a cocoon that can yield 800 metres of pure silk.",
                        "vi": "Một con tằm quay kén có thể thu được 800 mét tơ thuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drive or travel quickly",
                    "vi": "lái xe hoặc đi du lịch nhanh chóng"
                },
                "examples": [
                    {
                        "en": "They went spinning along the roads on their bikes.",
                        "vi": "Họ đi quay vòng trên những con đường trên những chiếc xe đạp của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove the water from clothes that have just been washed, in a spin dryer",
                    "vi": "để loại bỏ nước trên quần áo vừa giặt, trong máy sấy quay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to present information or a situation in a particular way, especially one that makes you or your ideas seem good",
                    "vi": "để trình bày thông tin hoặc một tình huống theo một cách cụ thể, đặc biệt là một cách làm cho bạn hoặc ý tưởng của bạn có vẻ tốt"
                },
                "examples": [
                    {
                        "en": "An aide was already spinning the senator's defeat as ‘almost as good as an outright win’.",
                        "vi": "Một phụ tá đã xoay cuộc thất bại của thượng nghị sĩ là 'gần như tốt như một chiến thắng hoàn toàn'."
                    }
                ]
            },
            {
                "define": {
                    "en": "your head feels as though it is going round and round and you cannot balance, especially because you are ill or confused or have had a shock; to make you feel like this",
                    "vi": "đầu của bạn cảm thấy như thể nó quay vòng vòng và bạn không thể giữ thăng bằng, đặc biệt là vì bạn bị ốm hoặc bối rối hoặc bị sốc; để làm cho bạn cảm thấy như thế này"
                },
                "examples": [
                    {
                        "en": "Her head was spinning from the pain.",
                        "vi": "Đầu cô quay cuồng vì cơn đau."
                    },
                    {
                        "en": "His theories on economics are enough to make your head spin.",
                        "vi": "Những lý thuyết của ông về kinh tế học đủ khiến bạn quay cuồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to make somebody believe a long story that is not true",
                    "vi": "để cố gắng làm cho ai đó tin một câu chuyện dài không có thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to turn around suddenly so that you are facing in the opposite direction",
                    "vi": "quay đầu đột ngột để bạn đang quay mặt về hướng ngược lại"
                },
                "examples": [
                    {
                        "en": "He turned on his heel and marched away angrily.",
                        "vi": "Anh quay gót bỏ đi một cách giận dữ."
                    }
                ]
            }
        ]
    },
    {
        "id": "c727b441cfbd423099bd0e37c4e54e56",
        "word": "suave",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/swɑːv/",
            "us": "/swɑːv/"
        },
        "nearby": [
            {
                "word": "suasion",
                "pos": "noun"
            },
            {
                "word": "suasive",
                "pos": "adjective"
            },
            {
                "word": "suave",
                "pos": "adjective"
            },
            {
                "word": "suavely",
                "pos": "adverb"
            },
            {
                "word": "sub",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "confident, attractive and polite, sometimes in a way that does not seem sincere",
                    "vi": "tự tin, hấp dẫn và lịch sự, đôi khi theo cách không chân thành"
                },
                "examples": [
                    {
                        "en": "The manager was suave and sophisticated.",
                        "vi": "Người quản lý là người khéo léo và tinh vi."
                    },
                    {
                        "en": "He gave his usual suave performance.",
                        "vi": "Anh ấy đã có màn trình diễn tuyệt vời như thường lệ của mình."
                    },
                    {
                        "en": "He plays a suave and sophisticated detective.",
                        "vi": "Anh vào vai một thám tử giỏi giang và sành sỏi."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c3eb17f43e648b79f9da5e07f13eb50",
        "word": "wily",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪli/",
            "us": "/ˈwaɪli/"
        },
        "nearby": [
            {
                "word": "Wilton",
                "pos": "noun"
            },
            {
                "word": "Wiltshire",
                "pos": ""
            },
            {
                "word": "wily",
                "pos": "adjective"
            },
            {
                "word": "Wimbledon",
                "pos": ""
            },
            {
                "word": "wimp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clever at getting what you want, and willing to trick people",
                    "vi": "thông minh trong việc đạt được những gì bạn muốn và sẵn sàng lừa mọi người"
                },
                "examples": [
                    {
                        "en": "The boss is a wily old fox.",
                        "vi": "Ông chủ là một con cáo già gian ác."
                    },
                    {
                        "en": "He was outwitted by his wily opponent.",
                        "vi": "Anh ta bị đối thủ gian manh của mình lấn lướt."
                    }
                ]
            }
        ]
    }
]