[
    {
        "id": "db46ddf85dc842e9996293f054860930",
        "word": "listen",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈlɪsn/",
            "us": "/ˈlɪsn/"
        },
        "nearby": [
            {
                "word": "list box",
                "pos": "noun"
            },
            {
                "word": "listed building",
                "pos": "noun"
            },
            {
                "word": "listen",
                "pos": "verb"
            },
            {
                "word": "listen",
                "pos": "noun"
            },
            {
                "word": "listenable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay attention to somebody/something that you can hear",
                    "vi": "chú ý đến ai đó / điều gì đó mà bạn có thể nghe thấy"
                },
                "examples": [
                    {
                        "en": "Listen! What's that noise? Can you hear it?",
                        "vi": "Nghe! Tiếng ồn đó là gì? Bạn có nghe thấy nó không?"
                    },
                    {
                        "en": "Sorry, I wasn't really listening.",
                        "vi": "Xin lỗi, tôi không thực sự lắng nghe."
                    },
                    {
                        "en": "He had been listening at the door.",
                        "vi": "Anh ta đã nghe thấy ở cửa."
                    },
                    {
                        "en": "listen to somebody/something to listen to music/the radio",
                        "vi": "nghe ai đó / cái gì đó để nghe nhạc / radio"
                    },
                    {
                        "en": "to listen to a song/an album",
                        "vi": "để nghe một bài hát / một album"
                    },
                    {
                        "en": "I listened carefully to her story.",
                        "vi": "Tôi đã lắng nghe câu chuyện của cô ấy một cách cẩn thận."
                    },
                    {
                        "en": "He was listening intently to what she was saying.",
                        "vi": "Anh đang chăm chú lắng nghe những gì cô đang nói."
                    },
                    {
                        "en": "You haven’t been listening to a word I’ve said!",
                        "vi": "Bạn đã không nghe một từ tôi đã nói!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to take notice of what you are going to say",
                    "vi": "được sử dụng để nói với ai đó để ý những gì bạn sẽ nói"
                },
                "examples": [
                    {
                        "en": "Listen, there's something I have to tell you.",
                        "vi": "Nghe này, có điều tôi phải nói với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take notice of what somebody says to you so that you follow their advice or believe them",
                    "vi": "để ý đến những gì ai đó nói với bạn để bạn làm theo lời khuyên của họ hoặc tin họ"
                },
                "examples": [
                    {
                        "en": "I tried to warn her, but she wouldn't listen.",
                        "vi": "Tôi đã cố gắng cảnh báo cô ấy, nhưng cô ấy không nghe."
                    },
                    {
                        "en": "listen to somebody/something None of this would have happened if you'd listened to me.",
                        "vi": "lắng nghe ai đó / điều gì đó Sẽ không có chuyện này xảy ra nếu bạn lắng nghe tôi."
                    },
                    {
                        "en": "The government is willing to listen to any concerns that people have.",
                        "vi": "Chính phủ sẵn sàng lắng nghe bất kỳ mối quan tâm nào của người dân."
                    },
                    {
                        "en": "Why won't you listen to reason?",
                        "vi": "Tại sao bạn không lắng nghe lý trí?"
                    }
                ]
            }
        ]
    },
    {
        "id": "34fb4b99b4904c62a9e04a943b1a53e3",
        "word": "picture",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpɪktʃə(r)/",
            "us": "/ˈpɪktʃər/"
        },
        "nearby": [
            {
                "word": "pictorial",
                "pos": "adjective"
            },
            {
                "word": "pictorially",
                "pos": "adverb"
            },
            {
                "word": "picture",
                "pos": "noun"
            },
            {
                "word": "picture",
                "pos": "verb"
            },
            {
                "word": "picture book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a painting or drawing, etc. that shows a scene, a person or thing",
                    "vi": "một bức tranh hoặc bản vẽ, v.v. thể hiện một cảnh, một người hoặc một sự vật"
                },
                "examples": [
                    {
                        "en": "He likes books with lots of pictures in them.",
                        "vi": "Anh ấy thích những cuốn sách có nhiều hình ảnh trong đó."
                    },
                    {
                        "en": "picture of somebody/something A picture of flowers hung on the wall.",
                        "vi": "bức tranh của ai đó / cái gì đó Một bức tranh hoa treo trên tường."
                    },
                    {
                        "en": "The children were drawing pictures of their pets.",
                        "vi": "Những đứa trẻ đang vẽ những bức tranh về vật nuôi của chúng."
                    },
                    {
                        "en": "She wanted a famous artist to paint her picture (= a picture of herself).",
                        "vi": "Cô ấy muốn một nghệ sĩ nổi tiếng vẽ bức tranh của mình (= một bức tranh của chính cô ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a photograph",
                    "vi": "một bức hình"
                },
                "examples": [
                    {
                        "en": "to take a picture",
                        "vi": "chụp một bức ảnh"
                    },
                    {
                        "en": "We had our picture taken in front of the hotel.",
                        "vi": "Chúng tôi đã chụp ảnh trước khách sạn."
                    },
                    {
                        "en": "The picture shows the couple together on their yacht.",
                        "vi": "Hình ảnh cho thấy cặp đôi cùng nhau trên du thuyền của họ."
                    },
                    {
                        "en": "picture of somebody/something She posted a picture of the two of them on her Facebook page.",
                        "vi": "hình ảnh của ai đó / cái gì đó Cô ấy đã đăng một bức ảnh của hai người họ trên trang Facebook của cô ấy."
                    },
                    {
                        "en": "Have you got any pictures of your trip?",
                        "vi": "Bạn đã có hình ảnh nào về chuyến đi của mình chưa?"
                    },
                    {
                        "en": "The star shared the picture on Twitter.",
                        "vi": "Ngôi sao đã chia sẻ bức ảnh trên Twitter."
                    },
                    {
                        "en": "to upload/send/tweet a picture",
                        "vi": "để tải lên / gửi / tweet một bức ảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "an image on a television screen",
                    "vi": "một hình ảnh trên màn hình tivi"
                },
                "examples": [
                    {
                        "en": "harrowing television pictures of the famine",
                        "vi": "hình ảnh truyền hình đáng tiếc về nạn đói"
                    },
                    {
                        "en": "You are looking at live pictures of midtown Manhattan.",
                        "vi": "Bạn đang xem hình ảnh trực tiếp của khu trung tâm Manhattan."
                    },
                    {
                        "en": "poor picture quality",
                        "vi": "chất lượng hình ảnh kém"
                    }
                ]
            },
            {
                "define": {
                    "en": "a description that gives you an idea in your mind of what something is like",
                    "vi": "mô tả cung cấp cho bạn ý tưởng trong tâm trí của bạn về một cái gì đó như thế nào"
                },
                "examples": [
                    {
                        "en": "We've only got scraps of information, not the full picture.",
                        "vi": "Chúng tôi chỉ có thông tin vụn vặt, không phải toàn bộ bức tranh."
                    },
                    {
                        "en": "picture of something The writer paints a gloomy picture of the economy.",
                        "vi": "bức tranh của cái gì Người viết vẽ ra một bức tranh ảm đạm của nền kinh tế."
                    },
                    {
                        "en": "a bleak/grim picture of the future",
                        "vi": "một bức tranh ảm đạm / nghiệt ngã về tương lai"
                    },
                    {
                        "en": "a clear/an accurate/a complete picture of these events",
                        "vi": "một bức tranh rõ ràng / chính xác / đầy đủ về những sự kiện này"
                    },
                    {
                        "en": "The police are trying to build up a picture of what happened.",
                        "vi": "Cảnh sát đang cố gắng dựng lên một bức tranh về những gì đã xảy ra."
                    },
                    {
                        "en": "From news reports a picture emerges of a country in crisis.",
                        "vi": "Từ các báo cáo tin tức, một bức tranh hiện ra về một đất nước đang gặp khủng hoảng."
                    },
                    {
                        "en": "The TV report painted a much rosier picture of the employment situation than research shows to be the case.",
                        "vi": "Phóng sự truyền hình đã vẽ nên một bức tranh về tình hình việc làm tươi sáng hơn nhiều so với các nghiên cứu về trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mental image or memory of something",
                    "vi": "một hình ảnh tinh thần hoặc ký ức về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I have a vivid picture of my grandfather smiling down at me when I was very small.",
                        "vi": "Tôi có một bức tranh sống động về ông của tôi đang mỉm cười với tôi khi tôi còn rất nhỏ."
                    },
                    {
                        "en": "He uses imagery to form mental pictures within the mind of the reader.",
                        "vi": "Anh ấy sử dụng hình ảnh để tạo thành những bức tranh tinh thần trong tâm trí người đọc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general situation relating to somebody/something",
                    "vi": "tình hình chung liên quan đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Just a few years ago the picture was very different.",
                        "vi": "Chỉ vài năm trước đây, bức tranh đã rất khác."
                    },
                    {
                        "en": "The overall picture for farming is encouraging.",
                        "vi": "Bức tranh tổng thể cho nông nghiệp là đáng khích lệ."
                    },
                    {
                        "en": "The documentary was interesting but it didn't give the full picture.",
                        "vi": "Bộ phim tài liệu rất thú vị nhưng nó không đưa ra bức tranh đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film",
                    "vi": "một bộ phim"
                },
                "examples": [
                    {
                        "en": "The movie won nine Academy Awards, including Best Picture.",
                        "vi": "Bộ phim đã giành được chín giải Oscar, bao gồm cả Phim hay nhất."
                    },
                    {
                        "en": "in pictures (especially North American English) I believe her husband's in pictures (= he acts in movies or works in the movie industry).",
                        "vi": "trong tranh (đặc biệt là tiếng Anh Bắc Mỹ) Tôi tin chồng cô ấy trong ảnh (= anh ấy đóng phim hoặc làm việc trong ngành điện ảnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cinema",
                    "vi": "Rạp chiếu phim"
                },
                "examples": [
                    {
                        "en": "Shall we go to the pictures tonight?",
                        "vi": "Tối nay chúng ta đi xem ảnh nhé?"
                    }
                ]
            },
            {
                "define": {
                    "en": "very pretty",
                    "vi": "rất đẹp"
                },
                "examples": [
                    {
                        "en": "She’s as pretty as a picture.",
                        "vi": "Cô ấy xinh như một bức tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very beautiful or special",
                    "vi": "trông rất đẹp hoặc đặc biệt"
                },
                "examples": [
                    {
                        "en": "The garden looks a picture in the summer.",
                        "vi": "Khu vườn trông như một bức tranh vào mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look extremely healthy, guilty, unhappy, etc.",
                    "vi": "để trông cực kỳ khỏe mạnh, mặc cảm, không hạnh phúc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the situation as a whole",
                    "vi": "tình hình nói chung"
                },
                "examples": [
                    {
                        "en": "Right now forget the details and take a look at the big picture.",
                        "vi": "Ngay bây giờ hãy quên các chi tiết và nhìn vào bức tranh lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to understand a situation, especially one that somebody is describing to you",
                    "vi": "để hiểu một tình huống, đặc biệt là một tình huống mà ai đó đang mô tả cho bạn"
                },
                "examples": [
                    {
                        "en": "‘I pretended that I hadn't heard.’ ‘I get the picture.’",
                        "vi": "Tôi giả vờ rằng tôi không nghe thấy. 'Tôi nhận được bức tranh.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "involved/not involved in a situation",
                    "vi": "tham gia / không tham gia vào một tình huống"
                },
                "examples": [
                    {
                        "en": "Morris is likely to win, with Jones out of the picture now.",
                        "vi": "Morris có khả năng giành chiến thắng, với Jones bây giờ đã ra khỏi bức tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe somebody/something in a particular way; to give a particular impression of somebody/something",
                    "vi": "để mô tả ai đó / cái gì đó theo một cách cụ thể; để tạo ấn tượng cụ thể về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The report paints a vivid picture of life in the city.",
                        "vi": "Phóng sự đã vẽ nên một bức tranh sinh động về cuộc sống ở thành phố."
                    },
                    {
                        "en": "Journalists paint a grim picture of conditions in the camps.",
                        "vi": "Các nhà báo vẽ lên một bức tranh khắc nghiệt về điều kiện sống trong các trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the information they need in order to understand a situation",
                    "vi": "cung cấp cho ai đó thông tin họ cần để hiểu một tình huống"
                },
                "examples": [
                    {
                        "en": "Just to put you in the picture—there have been a number of changes here recently.",
                        "vi": "Chỉ để bạn thấy rõ — gần đây đã có một số thay đổi ở đây."
                    }
                ]
            }
        ]
    },
    {
        "id": "567ca3a286a0456a830a40bf11c3d3fd",
        "word": "television",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈtelɪvɪʒn/",
            "us": "/ˈtelɪvɪʒn/"
        },
        "nearby": [
            {
                "word": "televangelist",
                "pos": "noun"
            },
            {
                "word": "televise",
                "pos": "verb"
            },
            {
                "word": "television",
                "pos": "noun"
            },
            {
                "word": "television licence",
                "pos": "noun"
            },
            {
                "word": "televisual",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of electrical equipment with a screen on which you can watch programmes with moving pictures and sounds",
                    "vi": "một thiết bị điện có màn hình mà bạn có thể xem các chương trình có hình ảnh và âm thanh chuyển động"
                },
                "examples": [
                    {
                        "en": "a widescreen/flat-screen/plasma television",
                        "vi": "màn hình rộng / màn hình phẳng / tivi plasma"
                    },
                    {
                        "en": "to turn the television on/off",
                        "vi": "bật / tắt tivi"
                    },
                    {
                        "en": "The series first appeared on television screens in 2017.",
                        "vi": "Bộ phim lần đầu tiên xuất hiện trên màn ảnh truyền hình vào năm 2017."
                    }
                ]
            },
            {
                "define": {
                    "en": "the programmes broadcast on television",
                    "vi": "các chương trình phát sóng trên truyền hình"
                },
                "examples": [
                    {
                        "en": "We don't do much in the evenings except watch television.",
                        "vi": "Chúng tôi không làm gì nhiều vào buổi tối ngoại trừ xem tivi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the system, process or business of broadcasting television programmes",
                    "vi": "hệ thống, quy trình hoặc kinh doanh phát sóng các chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "satellite/terrestrial/digital/network television",
                        "vi": "truyền hình vệ tinh / mặt đất / kỹ thuật số / mạng"
                    },
                    {
                        "en": "These plays were originally broadcast on live television.",
                        "vi": "Những vở kịch này ban đầu được phát sóng trên truyền hình trực tiếp."
                    },
                    {
                        "en": "in television I'd like to work in television (= for a television company).",
                        "vi": "trong truyền hình Tôi muốn làm việc trong lĩnh vực truyền hình (= cho một công ty truyền hình)."
                    },
                    {
                        "en": "a television show/series/programme/broadcast",
                        "vi": "một chương trình truyền hình / loạt phim / chương trình / chương trình phát sóng"
                    },
                    {
                        "en": "a television drama/documentary/interview/commercial",
                        "vi": "một bộ phim truyền hình / phim tài liệu / phỏng vấn / thương mại"
                    },
                    {
                        "en": "a television company/presenter/station/channel",
                        "vi": "một công ty truyền hình / người dẫn chương trình / đài / kênh"
                    },
                    {
                        "en": "a television viewer/audience",
                        "vi": "một người xem / khán giả truyền hình"
                    },
                    {
                        "en": "a television ad/commercial",
                        "vi": "một quảng cáo / quảng cáo truyền hình"
                    },
                    {
                        "en": "the television news",
                        "vi": "tin tức truyền hình"
                    }
                ]
            },
            {
                "define": {
                    "en": "being broadcast by television; appearing in a television programme",
                    "vi": "được truyền hình; xuất hiện trong một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "What's on television tonight?",
                        "vi": "Có gì trên truyền hình tối nay?"
                    },
                    {
                        "en": "Is there anything good on the telly tonight?",
                        "vi": "Có điều gì tốt trên điện thoại tối nay?"
                    },
                    {
                        "en": "It was on TV yesterday.",
                        "vi": "Đó là trên TV ngày hôm qua."
                    },
                    {
                        "en": "Millions watched the events on live television.",
                        "vi": "Hàng triệu người đã xem các sự kiện trên truyền hình trực tiếp."
                    },
                    {
                        "en": "The film has never been shown on television.",
                        "vi": "Phim chưa từng được chiếu trên truyền hình."
                    },
                    {
                        "en": "I recognize you. Aren't you on television?",
                        "vi": "Tôi nhận ra bạn. Bạn không có trên truyền hình?"
                    },
                    {
                        "en": "She's always appearing on television.",
                        "vi": "Cô ấy luôn xuất hiện trên truyền hình."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7f9465998874298a66d3c8bd73ee7d1",
        "word": "TV",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌtiː ˈviː/",
            "us": "/ˌtiː ˈviː/"
        },
        "nearby": [
            {
                "word": "tu-whit, tu-whoo",
                "pos": "noun"
            },
            {
                "word": "tuxedo",
                "pos": "noun"
            },
            {
                "word": "TV",
                "pos": "noun"
            },
            {
                "word": "TVA",
                "pos": ""
            },
            {
                "word": "TV dinner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "television",
                    "vi": "Tivi"
                },
                "examples": [
                    {
                        "en": "We spent the evening watching TV.",
                        "vi": "Chúng tôi đã dành cả buổi tối để xem TV."
                    },
                    {
                        "en": "We're buying a new TV with the money.",
                        "vi": "Chúng tôi đang mua một chiếc TV mới với số tiền bỏ ra."
                    },
                    {
                        "en": "Almost all homes have at least one TV set.",
                        "vi": "Hầu như tất cả các ngôi nhà đều có ít nhất một bộ TV."
                    },
                    {
                        "en": "What's your favourite TV show?",
                        "vi": "Chương trình truyền hình yêu thích của bạn là gì?"
                    },
                    {
                        "en": "a TV programme/series",
                        "vi": "một chương trình / sê-ri truyền hình"
                    },
                    {
                        "en": "a TV channel/station/network",
                        "vi": "một kênh truyền hình / đài / mạng"
                    },
                    {
                        "en": "cable/satellite TV",
                        "vi": "truyền hình cáp / vệ tinh"
                    },
                    {
                        "en": "She's a highly paid TV presenter.",
                        "vi": "Cô ấy là một người dẫn chương trình truyền hình được trả lương cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "being broadcast by television; appearing in a television programme",
                    "vi": "được truyền hình; xuất hiện trong một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "What's on TV tonight?",
                        "vi": "Tối nay TV chiếu gì?"
                    },
                    {
                        "en": "Is there anything good on TV tonight?",
                        "vi": "Có gì hay trên TV tối nay không?"
                    },
                    {
                        "en": "It was on TV yesterday.",
                        "vi": "Đó là trên TV ngày hôm qua."
                    },
                    {
                        "en": "Millions watched the events on live TV.",
                        "vi": "Hàng triệu người đã xem các sự kiện trên truyền hình trực tiếp."
                    },
                    {
                        "en": "I recognize you. Aren't you on TV?",
                        "vi": "Tôi nhận ra bạn. Bạn không có trên TV?"
                    }
                ]
            }
        ]
    },
    {
        "id": "f511f8b08f9e4b72a707d65e3b702ff8",
        "word": "watch",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/wɒtʃ/",
            "us": "/wɑːtʃ/"
        },
        "nearby": [
            {
                "word": "wasting",
                "pos": "adjective"
            },
            {
                "word": "wastrel",
                "pos": "noun"
            },
            {
                "word": "watch",
                "pos": "verb"
            },
            {
                "word": "watch",
                "pos": "noun"
            },
            {
                "word": "watchable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look at somebody/something for a time, paying attention to what happens",
                    "vi": "để nhìn ai đó / cái gì đó một lúc, chú ý đến những gì xảy ra"
                },
                "examples": [
                    {
                        "en": "watch somebody/something I was in the living room, watching TV.",
                        "vi": "xem ai đó / cái gì đó tôi đã ở trong phòng khách, xem TV."
                    },
                    {
                        "en": "A large crowd watched the game on Saturday.",
                        "vi": "Một đám đông lớn đã xem trận đấu vào thứ Bảy."
                    },
                    {
                        "en": "to watch a film/movie/video/show",
                        "vi": "để xem phim / phim / video / chương trình"
                    },
                    {
                        "en": "The film is well made and fun to watch—just don't expect a classic.",
                        "vi": "Bộ phim được làm rất hay và thú vị khi xem — đừng mong đợi một tác phẩm kinh điển."
                    },
                    {
                        "en": "He sat on the ground and watched me with great interest.",
                        "vi": "Anh ấy ngồi dưới đất và quan sát tôi một cách vô cùng thích thú."
                    },
                    {
                        "en": "watch something for something He watched the house for signs of activity.",
                        "vi": "xem một cái gì đó cho một cái gì đó Anh ấy đã xem ngôi nhà để biết các dấu hiệu hoạt động."
                    },
                    {
                        "en": "watch (for something) He watched for signs of activity in the house.",
                        "vi": "xem (để làm gì) Anh ấy theo dõi các dấu hiệu hoạt động trong nhà."
                    },
                    {
                        "en": "‘Would you like to play?’ ‘No thanks—I'll just watch.’",
                        "vi": "Bạn có muốn chơi không?' \"Không, cảm ơn - Tôi sẽ chỉ xem.\""
                    },
                    {
                        "en": "She stood and watched as the taxi drove off.",
                        "vi": "Cô đứng nhìn chiếc taxi phóng đi."
                    },
                    {
                        "en": "We watched to see what would happen next.",
                        "vi": "Chúng tôi đã theo dõi để xem điều gì sẽ xảy ra tiếp theo."
                    },
                    {
                        "en": "watch what, how, etc… Watch what I do, then you try.",
                        "vi": "xem cái gì, như thế nào, v.v. ... Xem những gì tôi làm, sau đó bạn thử."
                    },
                    {
                        "en": "watch somebody/something doing something She watched the kids playing in the yard.",
                        "vi": "xem ai đó / cái gì đó đang làm gì đó Cô ấy quan sát những đứa trẻ đang chơi trong sân."
                    },
                    {
                        "en": "watch somebody/something do something They watched the bus disappear into the distance.",
                        "vi": "xem ai đó / cái gì đó làm điều gì đó Họ đã nhìn chiếc xe buýt biến mất vào khoảng không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of somebody/something for a short time",
                    "vi": "chăm sóc ai đó / điều gì đó trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "watch somebody/something for somebody Could you watch my bags for me while I buy a paper?",
                        "vi": "xem ai đó / cái gì đó cho ai đó Bạn có thể xem túi của tôi cho tôi trong khi tôi mua một tờ giấy không?"
                    },
                    {
                        "en": "watch something It's OK, I can watch the baby for a while.",
                        "vi": "xem cái gì đó Không sao đâu, tôi có thể xem em bé một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful about something",
                    "vi": "cẩn thận về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "watch yourself Watch yourself! (= be careful, because you're in a dangerous situation)",
                        "vi": "tự xem Xem chính mình! (= hãy cẩn thận, bởi vì bạn đang ở trong một tình huống nguy hiểm)"
                    },
                    {
                        "en": "watch something Watch your bag—there are thieves around.",
                        "vi": "xem thứ gì đó Hãy xem túi của bạn — có những tên trộm xung quanh."
                    },
                    {
                        "en": "Watch your head on the low ceiling.",
                        "vi": "Ngó đầu của bạn trên trần nhà thấp."
                    },
                    {
                        "en": "I have to watch every penny (= be careful what I spend).",
                        "vi": "Tôi phải xem từng xu (= cẩn thận với những gì tôi tiêu)."
                    },
                    {
                        "en": "watch where, what, etc… Hey, watch where you're going!",
                        "vi": "xem ở đâu, cái gì, v.v.… Này, hãy xem bạn đang đi đâu!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay attention to a situation so that you notice any changes",
                    "vi": "chú ý đến một tình huống để bạn nhận thấy bất kỳ thay đổi nào"
                },
                "examples": [
                    {
                        "en": "watch something We're watching the situation very carefully.",
                        "vi": "xem một cái gì đó Chúng tôi đang theo dõi tình hình rất cẩn thận."
                    },
                    {
                        "en": "This election is being closely watched in the region.",
                        "vi": "Cuộc bầu cử này đang được theo dõi chặt chẽ trong khu vực."
                    },
                    {
                        "en": "The food retail sector is one to watch.",
                        "vi": "Lĩnh vực bán lẻ thực phẩm là một lĩnh vực cần theo dõi."
                    },
                    {
                        "en": "watch for something We'll watch for any developments.",
                        "vi": "theo dõi một cái gì đó Chúng tôi sẽ theo dõi bất kỳ sự phát triển nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to observe somebody's activities without their knowledge, especially over a period of time",
                    "vi": "để quan sát hoạt động của ai đó mà họ không biết, đặc biệt là trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "be (being) watched He didn't know he was being watched by the authorities.",
                        "vi": "bị (bị) theo dõi Anh ấy không biết mình đang bị chính quyền theo dõi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful about what you say in order not to upset or offend somebody",
                    "vi": "cẩn thận về những gì bạn nói để không làm ai đó khó chịu hoặc xúc phạm"
                },
                "examples": [
                    {
                        "en": "Watch your language, young man!",
                        "vi": "Hãy xem ngôn ngữ của bạn, chàng trai trẻ!"
                    },
                    {
                        "en": "The referee told the players to mind their language.",
                        "vi": "Trọng tài nói với các cầu thủ để ý đến ngôn ngữ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to walk carefully",
                    "vi": "đi bộ cẩn thận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a careful and sensible way",
                    "vi": "cư xử một cách cẩn thận và hợp lý"
                },
                "examples": [
                    {
                        "en": "You’d better watch your step with him if you don’t want trouble.",
                        "vi": "Tốt hơn hết bạn nên theo dõi bước đi của mình cùng anh ấy nếu không muốn gặp rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to protect yourself against danger",
                    "vi": "để bảo vệ bạn trước nguy hiểm"
                },
                "examples": [
                    {
                        "en": "She'd better watch her back if she wants to hold onto the top job.",
                        "vi": "Tốt hơn hết cô ấy nên theo dõi cô ấy trở lại nếu cô ấy muốn giữ vững công việc hàng đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful not to work longer than the required time; to think more about when your work will finish than about the work itself",
                    "vi": "cẩn thận không làm việc lâu hơn thời gian yêu cầu; suy nghĩ nhiều hơn về việc khi nào công việc của bạn sẽ hoàn thành hơn là về bản thân công việc"
                },
                "examples": [
                    {
                        "en": "employees who are always watching the clock",
                        "vi": "nhân viên luôn xem đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are impatient for something to happen, time seems to pass very slowly",
                    "vi": "Người ta thường nói rằng khi bạn thiếu kiên nhẫn cho một điều gì đó xảy ra, thời gian dường như trôi qua rất chậm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used as a warning to somebody to be careful",
                    "vi": "được sử dụng như một lời cảnh báo cho ai đó hãy cẩn thận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be careful what you say in order not to offend somebody or make them angry",
                    "vi": "hãy cẩn thận với những gì bạn nói để không xúc phạm ai đó hoặc khiến họ tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used in orders, to tell somebody to wait for more news about something to be announced",
                    "vi": "được sử dụng trong các đơn đặt hàng, để nói với ai đó đợi thêm tin tức về điều gì đó sẽ được công bố"
                },
                "examples": [
                    {
                        "en": "I can't tell you any more right now, but watch this space.",
                        "vi": "Tôi không thể nói với bạn bất kỳ điều gì nữa ngay bây giờ, nhưng hãy xem không gian này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be sure that you know what the time is, so that you finish something at the correct time, or are not late for something",
                    "vi": "để chắc chắn rằng bạn biết thời gian là bao nhiêu để bạn hoàn thành việc gì đó vào đúng thời điểm hoặc không bị trễ việc gì đó"
                },
                "examples": [
                    {
                        "en": "I'll have to watch the time. I need to leave early today.",
                        "vi": "Tôi sẽ phải xem thời gian. Tôi cần phải đi sớm hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to relax and watch people in a public place",
                    "vi": "thư giãn và quan sát mọi người ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "We sat outside a cafe, watching the world go by.",
                        "vi": "Chúng tôi ngồi bên ngoài một quán cà phê, nhìn thế giới trôi qua."
                    },
                    {
                        "en": "I love just watching the world go by.",
                        "vi": "Tôi thích chỉ nhìn thế giới trôi qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "ff44073e260a457191c43a6dc59cf3c5",
        "word": "advert",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈædvɜːt/",
            "us": "/ˈædvɜːrt/"
        },
        "nearby": [
            {
                "word": "adversely",
                "pos": "adverb"
            },
            {
                "word": "adversity",
                "pos": "noun"
            },
            {
                "word": "advert",
                "pos": "noun"
            },
            {
                "word": "advertise",
                "pos": "verb"
            },
            {
                "word": "advertisement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a notice, picture or film telling people about a product, job or service",
                    "vi": "một thông báo, hình ảnh hoặc phim nói với mọi người về một sản phẩm, công việc hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "the adverts on television",
                        "vi": "quảng cáo trên truyền hình"
                    },
                    {
                        "en": "I fast-forwarded through the adverts.",
                        "vi": "Tôi tua nhanh qua các quảng cáo."
                    },
                    {
                        "en": "When the adverts came on I got up to put the kettle on.",
                        "vi": "Khi quảng cáo xuất hiện, tôi đứng dậy để đặt ấm đun nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "an example of something that shows its good qualities",
                    "vi": "một ví dụ về một cái gì đó cho thấy những phẩm chất tốt của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "db73629d3e3b41c0af0059e8df24f39d",
        "word": "advertisement",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ədˈvɜːtɪsmənt/",
            "us": "/ˌædvərˈtaɪzmənt/"
        },
        "nearby": [
            {
                "word": "advert",
                "pos": "noun"
            },
            {
                "word": "advertise",
                "pos": "verb"
            },
            {
                "word": "advertisement",
                "pos": "noun"
            },
            {
                "word": "advertiser",
                "pos": "noun"
            },
            {
                "word": "advertising",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a notice, picture or film telling people about a product, job or service",
                    "vi": "một thông báo, hình ảnh hoặc phim nói với mọi người về một sản phẩm, công việc hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "a newspaper/television advertisement",
                        "vi": "một tờ báo / quảng cáo truyền hình"
                    },
                    {
                        "en": "an online advertisement",
                        "vi": "một quảng cáo trực tuyến"
                    },
                    {
                        "en": "You can place an advertisement on a classifieds website.",
                        "vi": "Bạn có thể đặt một quảng cáo trên một trang web rao vặt."
                    },
                    {
                        "en": "advertisement for something Television and radio refused to carry advertisements for the album.",
                        "vi": "quảng cáo cho một cái gì đó Truyền hình và đài phát thanh từ chối thực hiện quảng cáo cho album."
                    }
                ]
            },
            {
                "define": {
                    "en": "an example of something that shows its good qualities",
                    "vi": "một ví dụ về một cái gì đó cho thấy những phẩm chất tốt của nó"
                },
                "examples": [
                    {
                        "en": "Dirty streets and homelessness are no advertisement for a prosperous society.",
                        "vi": "Đường phố bẩn thỉu và tình trạng vô gia cư không phải là lời quảng cáo cho một xã hội thịnh vượng."
                    },
                    {
                        "en": "He's a walking advertisement for healthy living.",
                        "vi": "Anh ấy là một quảng cáo đi bộ cho cuộc sống lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of advertising something and making it public",
                    "vi": "hành động quảng cáo một cái gì đó và công khai nó"
                },
                "examples": [
                    {
                        "en": "We are employing an assistant to help with the advertisement of the group’s activities.",
                        "vi": "Chúng tôi đang thuê một trợ lý để giúp quảng cáo các hoạt động của nhóm."
                    }
                ]
            }
        ]
    },
    {
        "id": "5cd71c5b817d4b4293eb8e757cc04139",
        "word": "record",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/rɪˈkɔːd/",
            "us": "/rɪˈkɔːrd/"
        },
        "nearby": [
            {
                "word": "reconvene",
                "pos": "verb"
            },
            {
                "word": "record",
                "pos": "noun"
            },
            {
                "word": "record",
                "pos": "verb"
            },
            {
                "word": "recordable",
                "pos": "adjective"
            },
            {
                "word": "record-breaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep a permanent account of facts or events by writing them down, filming them, storing them in a computer, etc.",
                    "vi": "để lưu giữ một tài khoản vĩnh viễn về các dữ kiện hoặc sự kiện bằng cách viết chúng ra giấy, quay phim, lưu trữ chúng trong máy tính, v.v."
                },
                "examples": [
                    {
                        "en": "record something Her childhood is recorded in the diaries of those years.",
                        "vi": "ghi lại một cái gì đó Tuổi thơ của cô ấy được ghi lại trong nhật ký của những năm đó."
                    },
                    {
                        "en": "You should record all your expenses during your trip.",
                        "vi": "Bạn nên ghi lại tất cả các khoản chi tiêu trong chuyến đi của mình."
                    },
                    {
                        "en": "record how, what, etc… His job is to record how politicians vote on major issues.",
                        "vi": "ghi lại bằng cách nào, cái gì, v.v.… Công việc của anh ta là ghi lại cách các chính trị gia bỏ phiếu về các vấn đề lớn."
                    },
                    {
                        "en": "record that… She recorded in her diary that they crossed the Equator on 15 June.",
                        "vi": "ghi lại điều đó… Cô ấy đã ghi lại trong nhật ký của mình rằng họ đã vượt qua Xích đạo vào ngày 15 tháng 6."
                    },
                    {
                        "en": "it is recorded that… It is recorded that, by the year 630, four hundred monks were attached to the monastery.",
                        "vi": "nó được ghi lại rằng… Người ta ghi lại rằng, vào năm 630, bốn trăm nhà sư đã gắn bó với tu viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a copy of music, a film, etc. or to convert sound or a performance into a permanent form, so that you can listen to or watch it again",
                    "vi": "để tạo bản sao nhạc, phim, v.v. hoặc chuyển đổi âm thanh hoặc buổi biểu diễn thành dạng vĩnh viễn để bạn có thể nghe hoặc xem lại"
                },
                "examples": [
                    {
                        "en": "record (something) Did you remember to record that programme for me?",
                        "vi": "record (cái gì đó) Bạn có nhớ ghi lại chương trình đó cho tôi không?"
                    },
                    {
                        "en": "a recorded concert",
                        "vi": "một buổi hòa nhạc được ghi lại"
                    },
                    {
                        "en": "Tell me when the machine starts recording.",
                        "vi": "Cho tôi biết khi nào máy bắt đầu ghi."
                    },
                    {
                        "en": "record somebody/something doing something He recorded the class rehearsing before the performance.",
                        "vi": "ghi lại ai đó / cái gì đó đang làm gì đó Anh ấy đã ghi lại cả lớp đang tập dượt trước khi biểu diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform music so that it can be copied, stored and played back",
                    "vi": "biểu diễn âm nhạc để có thể sao chép, lưu trữ và phát lại"
                },
                "examples": [
                    {
                        "en": "The band is back in the US recording their new album.",
                        "vi": "Ban nhạc đã trở lại Mỹ để thu âm album mới của họ."
                    },
                    {
                        "en": "to record a song",
                        "vi": "để ghi âm một bài hát"
                    },
                    {
                        "en": "They spent the summer touring and recording.",
                        "vi": "Họ đã dành cả mùa hè để lưu diễn và thu âm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an official or legal statement about something",
                    "vi": "để đưa ra tuyên bố chính thức hoặc hợp pháp về điều gì đó"
                },
                "examples": [
                    {
                        "en": "The coroner recorded a verdict of accidental death.",
                        "vi": "Nhân viên điều tra đã ghi một bản án về cái chết do tai nạn."
                    },
                    {
                        "en": "It is with great regret that we record the death of one of our founder members.",
                        "vi": "Chúng tôi vô cùng tiếc nuối khi ghi lại cái chết của một trong những thành viên sáng lập của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show a particular measurement or amount",
                    "vi": "để hiển thị một phép đo hoặc số lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "The thermometer recorded a temperature of 40°C.",
                        "vi": "Nhiệt kế ghi nhiệt độ là 40 ° C."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve a particular score or result",
                    "vi": "để đạt được một điểm số hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "The team recorded their first win of the season.",
                        "vi": "Đội đã ghi chiến thắng đầu tiên trong mùa giải."
                    },
                    {
                        "en": "to record a victory/high score",
                        "vi": "để ghi một chiến thắng / điểm số cao"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e8d946de5dc4dd4a08119baeabea1ae",
        "word": "screen",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/skriːn/",
            "us": "/skriːn/"
        },
        "nearby": [
            {
                "word": "screech",
                "pos": "noun"
            },
            {
                "word": "screed",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "verb"
            },
            {
                "word": "Screen Actors Guild",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the flat surface at the front of a television, computer, or other electronic device, on which you see pictures or information",
                    "vi": "bề mặt phẳng ở phía trước của TV, máy tính hoặc thiết bị điện tử khác mà bạn nhìn thấy hình ảnh hoặc thông tin trên đó"
                },
                "examples": [
                    {
                        "en": "a computer screen",
                        "vi": "màn hình máy tính"
                    },
                    {
                        "en": "a monitor with a 21-inch screen",
                        "vi": "màn hình có màn hình 21 inch"
                    },
                    {
                        "en": "They were staring at the television screen.",
                        "vi": "Họ đang nhìn chằm chằm vào màn hình tivi."
                    },
                    {
                        "en": "Move your cursor to the top of the screen.",
                        "vi": "Di chuyển con trỏ của bạn lên đầu màn hình."
                    },
                    {
                        "en": "Tessa glanced at the phone's little screen.",
                        "vi": "Tessa liếc nhìn màn hình nhỏ của điện thoại."
                    },
                    {
                        "en": "an LCD/plasma screen",
                        "vi": "một màn hình LCD / plasma"
                    },
                    {
                        "en": "Hundreds of fans watched on giant television screens.",
                        "vi": "Hàng trăm người hâm mộ đã theo dõi trên màn hình tivi khổng lồ."
                    },
                    {
                        "en": "on the screen The image came up on the screen for a few seconds.",
                        "vi": "trên màn hình Hình ảnh hiển thị trên màn hình trong vài giây."
                    },
                    {
                        "en": "The birds appear as red dots on the radar screen.",
                        "vi": "Những con chim xuất hiện dưới dạng chấm đỏ trên màn hình radar."
                    },
                    {
                        "en": "on screen Information can be viewed on screen or printed out.",
                        "vi": "trên màn hình Thông tin có thể được xem trên màn hình hoặc in ra."
                    },
                    {
                        "en": "the screen display",
                        "vi": "màn hình hiển thị"
                    },
                    {
                        "en": "The system was designed with a menu bar at the bottom of the screen.",
                        "vi": "Hệ thống được thiết kế với một thanh menu ở cuối màn hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the large flat surface that films or pictures are shown on",
                    "vi": "bề mặt phẳng lớn mà phim hoặc hình ảnh được chiếu trên"
                },
                "examples": [
                    {
                        "en": "a cinema/movie screen",
                        "vi": "rạp chiếu phim / màn hình chiếu phim"
                    },
                    {
                        "en": "an eight-screen cinema",
                        "vi": "rạp chiếu phim tám màn hình"
                    },
                    {
                        "en": "The movie will be coming to your screens shortly.",
                        "vi": "Bộ phim sẽ sớm ra rạp."
                    },
                    {
                        "en": "This film should keep you glued to the screen (= unable to stop watching) for two hours.",
                        "vi": "Bộ phim này sẽ khiến bạn dán mắt vào màn hình (= không thể ngừng xem) trong hai giờ."
                    },
                    {
                        "en": "The film hits cinema screens in November.",
                        "vi": "Phim sẽ ra rạp vào tháng 11."
                    },
                    {
                        "en": "The film demands to be seen on a big screen.",
                        "vi": "Bộ phim yêu cầu được xem trên màn hình lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "films or television in general",
                    "vi": "phim hay truyền hình nói chung"
                },
                "examples": [
                    {
                        "en": "He has adapted the play for the screen.",
                        "vi": "Anh ấy đã chuyển thể vở kịch cho màn ảnh."
                    },
                    {
                        "en": "on screen Some actors never watch themselves on screen.",
                        "vi": "trên màn hình Một số diễn viên không bao giờ xem mình trên màn hình."
                    },
                    {
                        "en": "His face never appears on screen.",
                        "vi": "Khuôn mặt của anh ấy không bao giờ xuất hiện trên màn hình."
                    },
                    {
                        "en": "She was a star of stage and screen (= plays and films).",
                        "vi": "Cô ấy là một ngôi sao của sân khấu và màn ảnh (= vở kịch và phim)."
                    },
                    {
                        "en": "a screen actor",
                        "vi": "một diễn viên màn ảnh"
                    },
                    {
                        "en": "She has great screen presence (= she makes a good impression on screen).",
                        "vi": "Cô ấy có sự hiện diện tuyệt vời trên màn ảnh (= cô ấy tạo được ấn tượng tốt trên màn ảnh)."
                    },
                    {
                        "en": "He made his screen debut in 1954 as a stable boy.",
                        "vi": "Anh xuất hiện lần đầu trên màn ảnh vào năm 1954 với tư cách là một cậu bé ổn định."
                    },
                    {
                        "en": "the screen adaptation (= film) of John Steinbeck's novel East of Eden",
                        "vi": "chuyển thể màn ảnh (= phim) từ tiểu thuyết Phía đông vườn địa đàng của John Steinbeck"
                    }
                ]
            },
            {
                "define": {
                    "en": "the data or images shown on a computer screen",
                    "vi": "dữ liệu hoặc hình ảnh được hiển thị trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "Press the F1 key to display a help screen.",
                        "vi": "Nhấn phím F1 để hiển thị màn hình trợ giúp."
                    },
                    {
                        "en": "Can you do a printout of this screen for me?",
                        "vi": "Bạn có thể làm một bản in màn hình này cho tôi được không?"
                    },
                    {
                        "en": "I posted the screen grab on Twitter.",
                        "vi": "Tôi đã đăng bức ảnh chụp màn hình trên Twitter."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall, flat piece of furniture or equipment that is fixed to a wall, etc. or that can be moved to divide a room or to keep one area hidden or separate",
                    "vi": "một món đồ nội thất hoặc thiết bị cao, bằng phẳng được gắn cố định vào tường, v.v. hoặc có thể được di chuyển để chia phòng hoặc để ẩn hoặc tách biệt một khu vực"
                },
                "examples": [
                    {
                        "en": "The nurse put a screen around the bed.",
                        "vi": "Y tá đặt một màn hình xung quanh giường."
                    },
                    {
                        "en": "A wooden screen hid one corner of the room.",
                        "vi": "Một bức bình phong bằng gỗ che khuất một góc phòng."
                    },
                    {
                        "en": "She went behind the screen and changed into the ballet costume.",
                        "vi": "Cô ấy đi ra sau màn hình và thay trang phục múa ba lê."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that prevents somebody from seeing or being aware of something, or that protects somebody/something",
                    "vi": "thứ gì đó ngăn ai đó nhìn thấy hoặc nhận thức được điều gì đó hoặc điều đó bảo vệ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "screen (of something) We planted a screen of tall trees.",
                        "vi": "màn hình (của cái gì đó) Chúng tôi trồng một màn hình cây cao."
                    },
                    {
                        "en": "A screen of bodyguards protected the President.",
                        "vi": "Một màn vệ sĩ bảo vệ Tổng thống."
                    },
                    {
                        "en": "behind a screen of something (figurative) All the research was conducted behind a screen of secrecy.",
                        "vi": "đằng sau một tấm bình phong của một cái gì đó (nghĩa bóng) Tất cả các nghiên cứu được tiến hành đằng sau một tấm bình phong bí mật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wire or plastic net that is held in a frame and fastened on a window, or a door, to let in air but keep out insects",
                    "vi": "một dây hoặc lưới nhựa được giữ trong khung và buộc chặt trên cửa sổ hoặc cửa ra vào để không khí vào nhưng ngăn côn trùng"
                },
                "examples": [
                    {
                        "en": "Do you have screens on your windows?",
                        "vi": "Bạn có màn hình trên cửa sổ của mình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a wood or stone structure in a church, that partly separates the main area from the altar or choir",
                    "vi": "cấu trúc bằng gỗ hoặc đá trong nhà thờ, phần nào ngăn cách khu vực chính với bàn thờ hoặc dàn hợp xướng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system of checking a person or thing to find out whether or not something, typically a disease, is present",
                    "vi": "một hệ thống kiểm tra một người hoặc một vật để tìm xem có hay không một thứ gì đó, điển hình là một căn bệnh,"
                },
                "examples": [
                    {
                        "en": "You should get a health screen every couple of years.",
                        "vi": "Bạn nên kiểm tra sức khỏe vài năm một lần."
                    },
                    {
                        "en": "Candidates for this position must be able to pass a drug screen.",
                        "vi": "Các ứng cử viên cho vị trí này phải có khả năng vượt qua màn kiểm tra thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people’s attention is on or not on something",
                    "vi": "được sử dụng để nói rằng sự chú ý của mọi người đang tập trung vào hoặc không vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The issue of terrorism is back on the radar screen.",
                        "vi": "Vấn đề khủng bố đã trở lại trên màn hình radar."
                    },
                    {
                        "en": "Since the scandal broke, all other issues seem to have disappeared off the radar screen as far as the media is concerned.",
                        "vi": "Kể từ khi vụ bê bối nổ ra, tất cả các vấn đề khác dường như đã biến mất khỏi màn hình radar theo như phương tiện truyền thông quan tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "258554be363348578f2d0a6f88448ffa",
        "word": "ad",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/æd/",
            "us": "/æd/"
        },
        "nearby": [
            {
                "word": "acyclic",
                "pos": "adjective"
            },
            {
                "word": "acyclovir",
                "pos": "noun"
            },
            {
                "word": "ad",
                "pos": "noun"
            },
            {
                "word": "AD",
                "pos": "abbreviation"
            },
            {
                "word": "adage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a notice, picture or film telling people about a product, job or service",
                    "vi": "một thông báo, hình ảnh hoặc phim nói với mọi người về một sản phẩm, công việc hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "The TV ads were first run last year.",
                        "vi": "Quảng cáo truyền hình đã được chạy lần đầu tiên vào năm ngoái."
                    },
                    {
                        "en": "They've produced an ad for a new chocolate bar.",
                        "vi": "Họ đã tạo một quảng cáo cho một thanh sô cô la mới."
                    },
                    {
                        "en": "We put an ad on a classifieds website.",
                        "vi": "Chúng tôi đặt một quảng cáo trên một trang web rao vặt."
                    },
                    {
                        "en": "A $10 million TV ad campaign",
                        "vi": "Một chiến dịch quảng cáo truyền hình trị giá 10 triệu đô la"
                    },
                    {
                        "en": "an ad agency",
                        "vi": "một đại lý quảng cáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "592bcbe1b03b4266bf836fc8fd569819",
        "word": "channel",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtʃænl/",
            "us": "/ˈtʃænl/"
        },
        "nearby": [
            {
                "word": "Channel 4",
                "pos": ""
            },
            {
                "word": "Channel 5",
                "pos": ""
            },
            {
                "word": "channel",
                "pos": "noun"
            },
            {
                "word": "channel",
                "pos": "verb"
            },
            {
                "word": "channel-hop",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a television station",
                    "vi": "một đài truyền hình"
                },
                "examples": [
                    {
                        "en": "a television/TV channel",
                        "vi": "một kênh truyền hình / TV"
                    },
                    {
                        "en": "cable/digital/satellite channels",
                        "vi": "các kênh truyền hình cáp / kỹ thuật số / vệ tinh"
                    },
                    {
                        "en": "a news channel",
                        "vi": "một kênh tin tức"
                    },
                    {
                        "en": "a music/sports/movie channel",
                        "vi": "kênh âm nhạc / thể thao / phim"
                    },
                    {
                        "en": "to change/switch channels",
                        "vi": "để thay đổi / chuyển kênh"
                    },
                    {
                        "en": "on a channel What's on Channel 4 tonight?",
                        "vi": "trên kênh Có gì trên Kênh 4 tối nay?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a band of radio waves used for making television or radio broadcasts",
                    "vi": "một dải sóng vô tuyến được sử dụng để phát sóng truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "radio channels",
                        "vi": "kênh radio"
                    },
                    {
                        "en": "terrestrial/satellite channels",
                        "vi": "kênh mặt đất / vệ tinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a method or system that people use to get information, to communicate, or to send something somewhere",
                    "vi": "một phương pháp hoặc hệ thống mà mọi người sử dụng để lấy thông tin, giao tiếp hoặc gửi thứ gì đó đến một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "Complaints must be made through the proper channels.",
                        "vi": "Khiếu nại phải được thực hiện thông qua các kênh thích hợp."
                    },
                    {
                        "en": "The newsletter is a useful channel of communication between teacher and students.",
                        "vi": "Bản tin là một kênh giao tiếp hữu ích giữa giáo viên và học sinh."
                    },
                    {
                        "en": "The company has worldwide distribution channels.",
                        "vi": "Công ty có các kênh phân phối rộng khắp thế giới."
                    },
                    {
                        "en": "Steps are being taken to implement a ceasefire through diplomatic channels.",
                        "vi": "Các bước đang được thực hiện để thực hiện lệnh ngừng bắn thông qua các kênh ngoại giao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a means by which data is communicated and exchanged between elements of a computer system or other system",
                    "vi": "một phương tiện mà dữ liệu được giao tiếp và trao đổi giữa các phần tử của hệ thống máy tính hoặc hệ thống khác"
                },
                "examples": [
                    {
                        "en": "an audio channel",
                        "vi": "một kênh âm thanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of expressing ideas and feelings",
                    "vi": "một cách thể hiện ý tưởng và cảm xúc"
                },
                "examples": [
                    {
                        "en": "The campaign provided a channel for protest against the war.",
                        "vi": "Chiến dịch đã tạo ra một kênh để phản đối chiến tranh."
                    },
                    {
                        "en": "Music is a great channel for releasing your emotions.",
                        "vi": "Âm nhạc là một kênh tuyệt vời để bạn giải tỏa cảm xúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a passage that water can flow along, especially in the ground, on the bottom of a river, etc.",
                    "vi": "một lối đi mà nước có thể chảy dọc theo, đặc biệt là trong lòng đất, dưới đáy sông, v.v."
                },
                "examples": [
                    {
                        "en": "drainage channels in the rice fields",
                        "vi": "kênh thoát nước trong ruộng lúa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a deep passage of water in a river or near the coast that can be used as route for ships",
                    "vi": "một đoạn nước sâu trong sông hoặc gần bờ biển có thể được sử dụng làm tuyến đường cho tàu bè"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a passage of water that connects two areas of water, especially two seas",
                    "vi": "một dòng nước nối liền hai vùng nước, đặc biệt là hai vùng biển"
                },
                "examples": [
                    {
                        "en": "the Bristol Channel",
                        "vi": "kênh Bristol"
                    }
                ]
            },
            {
                "define": {
                    "en": "the area of sea between England and France, also known as the English Channel",
                    "vi": "khu vực biển giữa Anh và Pháp, còn được gọi là eo biển Anh"
                },
                "examples": [
                    {
                        "en": "the Channel Tunnel",
                        "vi": "đường hầm kênh"
                    },
                    {
                        "en": "cross-Channel ferries",
                        "vi": "phà xuyên kênh"
                    },
                    {
                        "en": "across the Channel news from across the Channel (= from France)",
                        "vi": "tin tức trên Kênh từ khắp Kênh (= từ Pháp)"
                    }
                ]
            }
        ]
    },
    {
        "id": "57ec95a79d0a4262a0b32a5473e7c9a5",
        "word": "commercial",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kəˈmɜːʃl/",
            "us": "/kəˈmɜːrʃl/"
        },
        "nearby": [
            {
                "word": "commerce",
                "pos": "noun"
            },
            {
                "word": "commercial",
                "pos": "adjective"
            },
            {
                "word": "commercial",
                "pos": "noun"
            },
            {
                "word": "commercial bank",
                "pos": "noun"
            },
            {
                "word": "commercial break",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an advertisement on television, on the radio or on a website",
                    "vi": "một quảng cáo trên truyền hình, trên đài phát thanh hoặc trên một trang web"
                },
                "examples": [
                    {
                        "en": "a TV/television commercial",
                        "vi": "một TV / quảng cáo truyền hình"
                    },
                    {
                        "en": "a radio commercial",
                        "vi": "một quảng cáo trên đài phát thanh"
                    },
                    {
                        "en": "a Republican campaign commercial",
                        "vi": "một chiến dịch quảng cáo của đảng Cộng hòa"
                    },
                    {
                        "en": "The marketing campaign is starting with four online commercials.",
                        "vi": "Chiến dịch tiếp thị đang bắt đầu với bốn quảng cáo trực tuyến."
                    },
                    {
                        "en": "in a commercial actors in commercials",
                        "vi": "trong một diễn viên thương mại trong quảng cáo"
                    },
                    {
                        "en": "She began her career appearing in commercials.",
                        "vi": "Cô bắt đầu sự nghiệp của mình khi xuất hiện trong các quảng cáo."
                    },
                    {
                        "en": "commercial for something He did a number of commercials for major brands.",
                        "vi": "quảng cáo cho một cái gì đó Anh ấy đã thực hiện một số quảng cáo cho các thương hiệu lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "679574cd8a02457baffb5938a3a7a0a0",
        "word": "digital television",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌdɪdʒɪtl ˈtelɪvɪʒn/",
            "us": "/ˌdɪdʒɪtl ˈtelɪvɪʒn/"
        },
        "nearby": [
            {
                "word": "digital recording",
                "pos": "noun"
            },
            {
                "word": "digital signature",
                "pos": "noun"
            },
            {
                "word": "digital television",
                "pos": "noun"
            },
            {
                "word": "digitization",
                "pos": "noun"
            },
            {
                "word": "digitize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of broadcasting television using digital signals",
                    "vi": "hệ thống phát sóng truyền hình sử dụng tín hiệu kỹ thuật số"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a television set that can receive digital signals",
                    "vi": "một máy thu hình có thể nhận tín hiệu kỹ thuật số"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ec4de04653f44a48e77687d134235ba",
        "word": "flat-screen",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈflæt skriːn/",
            "us": "/ˈflæt skriːn/"
        },
        "nearby": [
            {
                "word": "flat racing",
                "pos": "noun"
            },
            {
                "word": "flat rate",
                "pos": "noun"
            },
            {
                "word": "flat-screen",
                "pos": "adjective"
            },
            {
                "word": "flat spin",
                "pos": "noun"
            },
            {
                "word": "flatten",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of television or computer monitor that is very thin when compared with the original type",
                    "vi": "một loại tivi hoặc màn hình máy tính rất mỏng khi so sánh với loại ban đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b5faee7496c4cbbbd01672fef7a1c4d",
        "word": "home cinema",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌhəʊm ˈsɪnəmə/",
            "us": "/ˌhəʊm ˈsɪnəmə/"
        },
        "nearby": [
            {
                "word": "home brew",
                "pos": "adjective"
            },
            {
                "word": "homebuyer",
                "pos": "noun"
            },
            {
                "word": "home cinema",
                "pos": "noun"
            },
            {
                "word": "homecoming",
                "pos": "noun"
            },
            {
                "word": "home confinement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "television and video equipment designed to give a similar experience to being in a cinema, with high-quality pictures and sound and a large screen",
                    "vi": "thiết bị truyền hình và video được thiết kế để mang lại trải nghiệm tương tự như đang ở trong rạp chiếu phim, với hình ảnh và âm thanh chất lượng cao và màn hình lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "18c44b74acc34a47b88c57b4c6a11e22",
        "word": "home theater",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌhəʊm ˈθɪətə(r)/",
            "us": "/ˌhəʊm ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "the home straight",
                "pos": "noun"
            },
            {
                "word": "the home stretch",
                "pos": "noun"
            },
            {
                "word": "home theater",
                "pos": "noun"
            },
            {
                "word": "home town",
                "pos": "noun"
            },
            {
                "word": "home truth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "television and video equipment designed to give a similar experience to being in a cinema, with high-quality pictures and sound and a large screen",
                    "vi": "thiết bị truyền hình và video được thiết kế để mang lại trải nghiệm tương tự như đang ở trong rạp chiếu phim, với hình ảnh và âm thanh chất lượng cao và màn hình lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0fce73721f9431ba795b0f66aaa0403",
        "word": "listen in",
        "pos": "phrasal verb",
        "level": "b1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "listener",
                "pos": "noun"
            },
            {
                "word": "listen for",
                "pos": "phrasal verb"
            },
            {
                "word": "listen in",
                "pos": "phrasal verb"
            },
            {
                "word": "listening post",
                "pos": "noun"
            },
            {
                "word": "listen out for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to listen to a conversation that you are not supposed to hear",
                    "vi": "để nghe một cuộc trò chuyện mà bạn không được phép nghe"
                },
                "examples": [
                    {
                        "en": "You shouldn't listen in on other people's conversations.",
                        "vi": "Bạn không nên nghe cuộc trò chuyện của người khác."
                    },
                    {
                        "en": "They did not know that the police were secretly listening in.",
                        "vi": "Họ không biết rằng cảnh sát đang bí mật nghe ngóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen to a radio broadcast",
                    "vi": "nghe đài phát thanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2127975fe7da448badf8470aa4e8f33d",
        "word": "view",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/vjuː/",
            "us": "/vjuː/"
        },
        "nearby": [
            {
                "word": "the Vieux Carré",
                "pos": ""
            },
            {
                "word": "view",
                "pos": "noun"
            },
            {
                "word": "view",
                "pos": "verb"
            },
            {
                "word": "viewable",
                "pos": "adjective"
            },
            {
                "word": "viewer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to think about somebody/something in a particular way",
                    "vi": "nghĩ về ai đó / điều gì đó theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "view somebody/something + adv./prep. How do you view your position within the company?",
                        "vi": "xem ai đó / cái gì đó + adv./prep. Bạn thấy vị trí của mình trong công ty như thế nào?"
                    },
                    {
                        "en": "The plan was not viewed favourably by the public.",
                        "vi": "Kế hoạch đã không được công chúng xem một cách thuận lợi."
                    },
                    {
                        "en": "view somebody/something as something to view something as a threat/an opportunity",
                        "vi": "xem ai đó / cái gì đó như một cái gì đó để xem một cái gì đó như một mối đe dọa / một cơ hội"
                    },
                    {
                        "en": "He is widely viewed as a possible leader.",
                        "vi": "Anh ấy được nhiều người xem là một nhà lãnh đạo khả dĩ."
                    },
                    {
                        "en": "When the car was first built, the design was viewed as highly original.",
                        "vi": "Khi chiếc xe lần đầu tiên được chế tạo, thiết kế được coi là rất nguyên bản."
                    },
                    {
                        "en": "view somebody/something with something She viewed him with suspicion.",
                        "vi": "xem ai đó / cái gì đó với một cái gì đó Cô ấy nhìn anh ta với vẻ nghi ngờ."
                    },
                    {
                        "en": "You should view their offer with a great deal of caution.",
                        "vi": "Bạn nên xem lời đề nghị của họ một cách hết sức thận trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at something, especially when you look carefully",
                    "vi": "để xem xét một cái gì đó, đặc biệt là khi bạn xem xét cẩn thận"
                },
                "examples": [
                    {
                        "en": "view something People came from all over the world to view her work.",
                        "vi": "xem một cái gì đó Mọi người đến từ khắp nơi trên thế giới để xem tác phẩm của cô ấy."
                    },
                    {
                        "en": "view something through something The eclipse should only be viewed through a special lens.",
                        "vi": "xem một cái gì đó qua một cái gì đó Nhật thực chỉ nên được xem qua một ống kính đặc biệt."
                    },
                    {
                        "en": "view something from something These paintings were meant to be viewed from a distance.",
                        "vi": "xem một cái gì đó từ một cái gì đó Những bức tranh này được dùng để xem từ xa."
                    },
                    {
                        "en": "A viewing platform gave stunning views over the valley.",
                        "vi": "Một nền tảng quan sát cho tầm nhìn tuyệt đẹp ra thung lũng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to visit a house, etc. before deciding whether to buy or rent it",
                    "vi": "để thăm một ngôi nhà, v.v. trước khi quyết định mua hay thuê nó"
                },
                "examples": [
                    {
                        "en": "The property can only be viewed by appointment.",
                        "vi": "Tài sản chỉ có thể được xem theo lịch hẹn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch television, a film, etc.",
                    "vi": "để xem truyền hình, phim, v.v."
                },
                "examples": [
                    {
                        "en": "The show has a viewing audience of six million (= six million people watch it).",
                        "vi": "Chương trình có lượng khán giả xem là sáu triệu (= sáu triệu người xem)."
                    },
                    {
                        "en": "Saturday's screening will be an opportunity to view the movie before it goes on general release.",
                        "vi": "Buổi chiếu vào thứ Bảy sẽ là cơ hội để xem bộ phim trước khi nó được phát hành chung."
                    }
                ]
            }
        ]
    },
    {
        "id": "d8f22ce1665548f5b36a6bc350b88566",
        "word": "viewer",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈvjuːə(r)/",
            "us": "/ˈvjuːər/"
        },
        "nearby": [
            {
                "word": "view",
                "pos": "verb"
            },
            {
                "word": "viewable",
                "pos": "adjective"
            },
            {
                "word": "viewer",
                "pos": "noun"
            },
            {
                "word": "viewership",
                "pos": "noun"
            },
            {
                "word": "viewfinder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person watching television or a video on the internet",
                    "vi": "một người đang xem truyền hình hoặc video trên internet"
                },
                "examples": [
                    {
                        "en": "The programme attracted millions of viewers.",
                        "vi": "Chương trình đã thu hút hàng triệu lượt người xem."
                    },
                    {
                        "en": "British television viewers saw him this week in a BBC documentary.",
                        "vi": "Tuần này, khán giả truyền hình Anh đã nhìn thấy anh trong một bộ phim tài liệu của BBC."
                    },
                    {
                        "en": "The average American TV viewer spends five hours a day watching the small screen.",
                        "vi": "Người xem truyền hình Mỹ trung bình dành năm giờ mỗi ngày để xem màn hình nhỏ."
                    },
                    {
                        "en": "an attempt to attract younger viewers",
                        "vi": "nỗ lực thu hút người xem nhỏ tuổi"
                    },
                    {
                        "en": "Her performance has grabbed the attention of 100 million YouTube viewers.",
                        "vi": "Màn trình diễn của cô đã thu hút sự chú ý của 100 triệu người xem YouTube."
                    },
                    {
                        "en": "viewer of something a regular viewer of the show",
                        "vi": "người xem một cái gì đó một người xem thường xuyên của chương trình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who looks at or considers something",
                    "vi": "một người nhìn hoặc xem xét một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Some of her art is intended to shock the viewer.",
                        "vi": "Một số nghệ thuật của cô ấy nhằm gây sốc cho người xem."
                    },
                    {
                        "en": "Many informed viewers of the current political scene are becoming critical of the government.",
                        "vi": "Nhiều người xem được thông báo về bối cảnh chính trị hiện tại đang trở nên chỉ trích chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device for looking at slides (= photographs on special film), for example a small box with a light in it",
                    "vi": "một thiết bị để xem các trang trình bày (= ảnh trên phim đặc biệt), ví dụ như một hộp nhỏ có đèn chiếu sáng trong đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "80f162ad952f4b698a734b05a985ab66",
        "word": "home entertainment",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌhəʊm entəˈteɪnmənt/",
            "us": "/ˌhəʊm entərˈteɪnmənt/"
        },
        "nearby": [
            {
                "word": "Home Depot",
                "pos": ""
            },
            {
                "word": "home economics",
                "pos": "noun"
            },
            {
                "word": "home entertainment",
                "pos": "noun"
            },
            {
                "word": "home fries",
                "pos": "noun"
            },
            {
                "word": "home front",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "films, music, etc. provided in the home through specific equipment",
                    "vi": "phim, nhạc, v.v. được cung cấp trong nhà thông qua các thiết bị cụ thể"
                },
                "examples": [
                    {
                        "en": "The market for home entertainment products continues to grow.",
                        "vi": "Thị trường các sản phẩm giải trí gia đình tiếp tục phát triển."
                    }
                ]
            }
        ]
    },
    {
        "id": "95e11f74b7134b55b06296d98aad255f",
        "word": "monitor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒnɪtə(r)/",
            "us": "/ˈmɑːnɪtər/"
        },
        "nearby": [
            {
                "word": "moniker",
                "pos": "noun"
            },
            {
                "word": "monism",
                "pos": "noun"
            },
            {
                "word": "monitor",
                "pos": "noun"
            },
            {
                "word": "monitor",
                "pos": "verb"
            },
            {
                "word": "Monitor and Merrimack",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a screen that shows information from a computer; a television screen used to show particular kinds of information",
                    "vi": "màn hình hiển thị thông tin từ máy tính; một màn hình tivi được sử dụng để hiển thị các loại thông tin cụ thể"
                },
                "examples": [
                    {
                        "en": "The details of today's flights are displayed on the monitor.",
                        "vi": "Các chi tiết của các chuyến bay ngày hôm nay được hiển thị trên màn hình."
                    },
                    {
                        "en": "The pages are designed to be viewed on a computer monitor.",
                        "vi": "Các trang được thiết kế để xem trên màn hình máy tính."
                    },
                    {
                        "en": "We included the costs of monitor, keyboard, mouse and speakers.",
                        "vi": "Chúng tôi đã bao gồm chi phí của màn hình, bàn phím, chuột và loa."
                    },
                    {
                        "en": "The security staff can see all the outside of the building on their CCTV monitors.",
                        "vi": "Các nhân viên an ninh có thể nhìn thấy tất cả bên ngoài của tòa nhà trên màn hình CCTV của họ."
                    },
                    {
                        "en": "the display quality on LCD monitors has greatly improved.",
                        "vi": "chất lượng hiển thị trên màn hình LCD đã được cải thiện rất nhiều."
                    },
                    {
                        "en": "The laboratory is replete with banks of video monitors.",
                        "vi": "Phòng thí nghiệm được trang bị đầy đủ các ngân hàng màn hình video."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment used to check or record something",
                    "vi": "một phần của thiết bị được sử dụng để kiểm tra hoặc ghi lại một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was lying there hooked up to a heart monitor.",
                        "vi": "Anh ta đang nằm đó được nối với một máy đo tim."
                    },
                    {
                        "en": "Mia kept a two-way baby monitor in the living room so Harry's cries could be heard.",
                        "vi": "Mia để một màn hình hai chiều dành cho em bé trong phòng khách để có thể nghe thấy tiếng khóc của Harry."
                    },
                    {
                        "en": "A nurse checked his monitor for changes in ECG rhythms, pulse and oxygen saturation.",
                        "vi": "Một y tá đã kiểm tra màn hình của anh ta để tìm những thay đổi trong nhịp ECG, mạch và độ bão hòa oxy."
                    },
                    {
                        "en": "The heart monitor shows the strength of your pulse.",
                        "vi": "Máy theo dõi tim hiển thị cường độ nhịp đập của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to check that something is done fairly and honestly, especially in a foreign country",
                    "vi": "một người có công việc là kiểm tra xem điều gì đó được thực hiện một cách công bằng và trung thực, đặc biệt là ở nước ngoài"
                },
                "examples": [
                    {
                        "en": "UN monitors declared the referendum fair.",
                        "vi": "Các giám sát viên của LHQ tuyên bố cuộc trưng cầu dân ý là công bằng."
                    },
                    {
                        "en": "The EU has agreed to provide monitors for the crossing.",
                        "vi": "EU đã đồng ý cung cấp các giám sát cho việc vượt biển."
                    },
                    {
                        "en": "Monitors or observers help to build trust between the two sides.",
                        "vi": "Người theo dõi hoặc quan sát giúp xây dựng lòng tin giữa hai bên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a student in a school who performs special duties, such as helping the teacher",
                    "vi": "một học sinh trong trường thực hiện các nhiệm vụ đặc biệt, chẳng hạn như giúp đỡ giáo viên"
                },
                "examples": [
                    {
                        "en": "He was a star pupil and the class monitor.",
                        "vi": "Anh ấy là một học sinh ngôi sao và là người đứng đầu lớp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large tropical lizard (= a type of reptile)",
                    "vi": "thằn lằn nhiệt đới lớn (= một loại bò sát)"
                },
                "examples": [
                    {
                        "en": "A large monitor lizard, prehistoric in its beauty, stared at us.",
                        "vi": "Một con thằn lằn màn hình lớn, từ thời tiền sử với vẻ đẹp của nó, đang nhìn chằm chằm vào chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "a7dec56c1f9a4c02b8bb89da4c44ba16",
        "word": "rating",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreɪtɪŋ/",
            "us": "/ˈreɪtɪŋ/"
        },
        "nearby": [
            {
                "word": "ratification",
                "pos": "noun"
            },
            {
                "word": "ratify",
                "pos": "verb"
            },
            {
                "word": "rating",
                "pos": "noun"
            },
            {
                "word": "ratio",
                "pos": "noun"
            },
            {
                "word": "ratiocination",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a measurement of how good, popular, important, etc. somebody/something is, especially in relation to other people or things",
                    "vi": "đo lường mức độ tốt, phổ biến, quan trọng, v.v. của ai đó / điều gì đó, đặc biệt là trong mối quan hệ với những người hoặc sự vật khác"
                },
                "examples": [
                    {
                        "en": "The poll gave an approval rating of 39 per cent for the president.",
                        "vi": "Cuộc thăm dò đã đưa ra tỷ lệ chấp thuận cho tổng thống là 39%."
                    },
                    {
                        "en": "Education has been given a high-priority rating by the new administration.",
                        "vi": "Giáo dục đã được đánh giá ưu tiên cao bởi chính quyền mới."
                    },
                    {
                        "en": "‘The Big Bang Theory’ was the network show with the highest rating.",
                        "vi": "The Big Bang Theory' là chương trình mạng có xếp hạng cao nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of figures that show how many people watch or listen to a particular television or radio programme, used to show how popular a programme is",
                    "vi": "một tập hợp các số liệu cho biết số người xem hoặc nghe một chương trình truyền hình hoặc đài phát thanh cụ thể, được sử dụng để cho biết mức độ phổ biến của một chương trình"
                },
                "examples": [
                    {
                        "en": "The show has gone up in the ratings.",
                        "vi": "Chương trình đã tăng về xếp hạng."
                    },
                    {
                        "en": "The BBC is currently ahead in the ratings war.",
                        "vi": "BBC hiện đang dẫn đầu trong cuộc chiến xếp hạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number or letter that shows which groups of people a particular film is suitable for",
                    "vi": "một số hoặc chữ cái cho biết một bộ phim cụ thể phù hợp với những nhóm người nào"
                },
                "examples": [
                    {
                        "en": "The film was given a 15 rating by British censors.",
                        "vi": "Bộ phim được các nhà kiểm duyệt của Anh cho điểm 15."
                    },
                    {
                        "en": "The movie carries an R rating.",
                        "vi": "Phim có xếp hạng R."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sailor in the navy who is not an officer",
                    "vi": "một thủy thủ trong hải quân không phải là sĩ quan"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6634ceaa7482445b8173d42924506832",
        "word": "remote control",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˌməʊt kənˈtrəʊl/",
            "us": "/rɪˌməʊt kənˈtrəʊl/"
        },
        "nearby": [
            {
                "word": "remote",
                "pos": "noun"
            },
            {
                "word": "remote access",
                "pos": "noun"
            },
            {
                "word": "remote control",
                "pos": "noun"
            },
            {
                "word": "remote-controlled",
                "pos": "adjective"
            },
            {
                "word": "remote learning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to operate a machine from a distance using radio or electrical signals",
                    "vi": "khả năng vận hành máy từ xa bằng tín hiệu vô tuyến hoặc điện"
                },
                "examples": [
                    {
                        "en": "by remote control It works by remote control.",
                        "vi": "bằng điều khiển từ xa Nó hoạt động bằng điều khiển từ xa."
                    },
                    {
                        "en": "a remote-control camera",
                        "vi": "một máy ảnh điều khiển từ xa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that allows you to operate a television, etc. from a distance",
                    "vi": "một thiết bị cho phép bạn điều khiển TV, v.v. từ xa"
                },
                "examples": [
                    {
                        "en": "I can't find the remote control.",
                        "vi": "Tôi không thể tìm thấy điều khiển từ xa."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec9d3f1cd8ae4fb6b8b12fb55367264b",
        "word": "rewatch",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌriːˈwɒtʃ/",
            "us": "/ˌriːˈwɑːtʃ/"
        },
        "nearby": [
            {
                "word": "reward",
                "pos": "verb"
            },
            {
                "word": "rewarding",
                "pos": "adjective"
            },
            {
                "word": "rewatch",
                "pos": "verb"
            },
            {
                "word": "rewatch",
                "pos": "noun"
            },
            {
                "word": "rewilding",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to watch a film, television programme, etc. again",
                    "vi": "để xem lại một bộ phim, chương trình truyền hình, v.v."
                },
                "examples": [
                    {
                        "en": "Each week we rewatch an episode and talk about our favourite moments.",
                        "vi": "Mỗi tuần, chúng tôi xem lại một tập và nói về những khoảnh khắc yêu thích của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "48f3130c943041f8bf5dc702b9c7c7e3",
        "word": "rewatch",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈriːwɒtʃ/",
            "us": "/ˈriːwɑːtʃ/"
        },
        "nearby": [
            {
                "word": "rewarding",
                "pos": "adjective"
            },
            {
                "word": "rewatch",
                "pos": "verb"
            },
            {
                "word": "rewatch",
                "pos": "noun"
            },
            {
                "word": "rewilding",
                "pos": "noun"
            },
            {
                "word": "rewind",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of watching a film, television programme, etc. again",
                    "vi": "hành động xem lại một bộ phim, chương trình truyền hình, v.v."
                },
                "examples": [
                    {
                        "en": "It's a great movie — definitely worth a rewatch.",
                        "vi": "Đó là một bộ phim tuyệt vời - chắc chắn đáng để xem lại."
                    },
                    {
                        "en": "on rewatch I found the show even more rewarding on rewatch.",
                        "vi": "khi xem lại, tôi thấy chương trình thậm chí còn bổ ích hơn khi xem lại."
                    }
                ]
            }
        ]
    },
    {
        "id": "b549c8e7bf304d2cb5f03aa796035c1b",
        "word": "ring in",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "ring-fence",
                "pos": "verb"
            },
            {
                "word": "ring finger",
                "pos": "noun"
            },
            {
                "word": "ring in",
                "pos": "phrasal verb"
            },
            {
                "word": "ringing",
                "pos": "adjective"
            },
            {
                "word": "ringing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to phone a television or radio show, or the place where you work",
                    "vi": "điện thoại cho một đài truyền hình hoặc chương trình radio, hoặc nơi bạn làm việc"
                },
                "examples": [
                    {
                        "en": "People from all over the country have been ringing in to make donations.",
                        "vi": "Mọi người từ khắp nơi trên đất nước đã đổ chuông để đóng góp."
                    },
                    {
                        "en": "Sue has rung in sick.",
                        "vi": "Sue bị ốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ring bells to celebrate something, especially the new year",
                    "vi": "rung chuông để ăn mừng điều gì đó, đặc biệt là năm mới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d76913ee991f460c9b203e0237dce938",
        "word": "satellite",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsætəlaɪt/",
            "us": "/ˈsætəlaɪt/"
        },
        "nearby": [
            {
                "word": "sate",
                "pos": "verb"
            },
            {
                "word": "sated",
                "pos": "adjective"
            },
            {
                "word": "satellite",
                "pos": "noun"
            },
            {
                "word": "satellite dish",
                "pos": "noun"
            },
            {
                "word": "satellite station",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic device that is sent into space and moves around the earth or another planet. It is used for communicating by radio, television, etc. and for gathering information.",
                    "vi": "một thiết bị điện tử được gửi vào không gian và di chuyển xung quanh trái đất hoặc hành tinh khác. Nó được sử dụng để liên lạc qua đài phát thanh, truyền hình, v.v. và thu thập thông tin."
                },
                "examples": [
                    {
                        "en": "a weather/communications/spy satellite",
                        "vi": "vệ tinh thời tiết / thông tin liên lạc / do thám"
                    },
                    {
                        "en": "by/via satellite The interview came live by satellite from Hollywood.",
                        "vi": "bằng / qua vệ tinh Cuộc phỏng vấn được phát trực tiếp bằng vệ tinh từ Hollywood."
                    },
                    {
                        "en": "They could track the tagged sea turtles by satellite.",
                        "vi": "Họ có thể theo dõi những con rùa biển được gắn thẻ bằng vệ tinh."
                    },
                    {
                        "en": "The information was sent via a satellite link.",
                        "vi": "Thông tin được gửi qua một liên kết vệ tinh."
                    },
                    {
                        "en": "satellite television/TV/radio (= broadcast using a satellite)",
                        "vi": "truyền hình vệ tinh / TV / radio (= phát sóng bằng vệ tinh)"
                    },
                    {
                        "en": "a satellite broadcast/channel/picture",
                        "vi": "một chương trình truyền hình vệ tinh / kênh / hình ảnh"
                    },
                    {
                        "en": "The use of satellite phones meant that journalists could report directly from the arena of the battlefront.",
                        "vi": "Việc sử dụng điện thoại vệ tinh đồng nghĩa với việc các nhà báo có thể tường thuật trực tiếp từ thao trường của trận địa."
                    },
                    {
                        "en": "My car was fitted with a satellite navigation system.",
                        "vi": "Xe của tôi được lắp hệ thống định vị vệ tinh."
                    },
                    {
                        "en": "The software enables the user to set up a satellite communications link.",
                        "vi": "Phần mềm cho phép người dùng thiết lập một liên kết thông tin vệ tinh."
                    },
                    {
                        "en": "They have successfully launched satellites into orbit.",
                        "vi": "Họ đã phóng thành công vệ tinh lên quỹ đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a natural object that moves around a larger natural object in space",
                    "vi": "một vật thể tự nhiên chuyển động xung quanh một vật thể tự nhiên lớn hơn trong không gian"
                },
                "examples": [
                    {
                        "en": "The moon is a satellite of earth.",
                        "vi": "Mặt trăng là một vệ tinh của trái đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a town, a country or an organization that is controlled by and depends on another larger or more powerful one",
                    "vi": "một thị trấn, một quốc gia hoặc một tổ chức được kiểm soát và phụ thuộc vào một tổ chức khác lớn hơn hoặc mạnh hơn"
                },
                "examples": [
                    {
                        "en": "Following the Second World War it became a satellite state of the Soviet Union.",
                        "vi": "Sau Chiến tranh thế giới thứ hai, nó trở thành một quốc gia vệ tinh của Liên Xô."
                    }
                ]
            }
        ]
    },
    {
        "id": "f67efd31170846d6b5c8468c458e301a",
        "word": "speaker",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspiːkə(r)/",
            "us": "/ˈspiːkər/"
        },
        "nearby": [
            {
                "word": "-speak",
                "pos": "combining form"
            },
            {
                "word": "speakeasy",
                "pos": "noun"
            },
            {
                "word": "speaker",
                "pos": "noun"
            },
            {
                "word": "speakerphone",
                "pos": "noun"
            },
            {
                "word": "Speakers' Corner",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who gives a talk or makes a speech",
                    "vi": "một người nói chuyện hoặc phát biểu"
                },
                "examples": [
                    {
                        "en": "He was a guest speaker at the conference.",
                        "vi": "Ông là một diễn giả khách mời tại hội nghị."
                    },
                    {
                        "en": "a keynote speaker at the Republican convention",
                        "vi": "một diễn giả chính tại đại hội đảng Cộng hòa"
                    },
                    {
                        "en": "She was a brilliant public speaker.",
                        "vi": "Cô ấy là một diễn giả xuất sắc trước công chúng."
                    },
                    {
                        "en": "The Society has an interesting talk by a visiting speaker every month.",
                        "vi": "Hội có một buổi nói chuyện thú vị bởi một diễn giả đến thăm mỗi tháng."
                    },
                    {
                        "en": "Previous speakers include two former US Secretaries of State.",
                        "vi": "Các diễn giả trước đây bao gồm hai cựu Ngoại trưởng Hoa Kỳ."
                    },
                    {
                        "en": "He was much in demand as a visiting speaker.",
                        "vi": "Anh ấy được yêu cầu nhiều với tư cách là một diễn giả thỉnh giảng."
                    },
                    {
                        "en": "The conference featured a number of distinguished speakers from the world of business and industry.",
                        "vi": "Hội nghị có sự góp mặt của một số diễn giả nổi tiếng từ thế giới kinh doanh và công nghiệp."
                    },
                    {
                        "en": "speaker on something She is a frequent speaker on human and civil rights.",
                        "vi": "diễn giả về điều gì đó Cô ấy là một diễn giả thường xuyên về quyền con người và dân sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who speaks a particular language",
                    "vi": "một người nói một ngôn ngữ cụ thể"
                },
                "examples": [
                    {
                        "en": "English speakers",
                        "vi": "những người nói tiếng Anh"
                    },
                    {
                        "en": "Spanish/Arabic/Chinese speakers",
                        "vi": "Người nói tiếng Tây Ban Nha / Ả Rập / Trung Quốc"
                    },
                    {
                        "en": "speaker of something a fluent speaker of German",
                        "vi": "người nói về điều gì đó một người nói thông thạo tiếng Đức"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is or was speaking",
                    "vi": "một người đã hoặc đang nói"
                },
                "examples": [
                    {
                        "en": "I looked around to see who the speaker was.",
                        "vi": "Tôi nhìn xung quanh để xem người nói là ai."
                    },
                    {
                        "en": "A speaker conveys information through tone and body language.",
                        "vi": "Một người nói truyền đạt thông tin thông qua giọng điệu và ngôn ngữ cơ thể."
                    },
                    {
                        "en": "Communication is an active process that involves both the speaker and the listener.",
                        "vi": "Giao tiếp là một quá trình tích cực bao gồm cả người nói và người nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a radio, computer or piece of musical equipment that the sound comes out of",
                    "vi": "phần của đài, máy tính hoặc thiết bị âm nhạc mà âm thanh phát ra"
                },
                "examples": [
                    {
                        "en": "The car had a powerful sound system with four speakers.",
                        "vi": "Chiếc xe có một hệ thống âm thanh mạnh mẽ với bốn loa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the title of the person whose job is to control the discussions in a parliament",
                    "vi": "chức danh của người có công việc điều khiển các cuộc thảo luận trong quốc hội"
                },
                "examples": [
                    {
                        "en": "the Speaker of the House of Commons/Representatives",
                        "vi": "Chủ tịch Hạ viện / Dân biểu"
                    }
                ]
            }
        ]
    },
    {
        "id": "5bb1f528fcd045a9837efe31ba294570",
        "word": "surfing",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːfɪŋ/",
            "us": "/ˈsɜːrfɪŋ/"
        },
        "nearby": [
            {
                "word": "surfer",
                "pos": "noun"
            },
            {
                "word": "surfie",
                "pos": "noun"
            },
            {
                "word": "surfing",
                "pos": "noun"
            },
            {
                "word": "surf lifesaver",
                "pos": "noun"
            },
            {
                "word": "surf 'n' turf",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the sport of riding on waves while standing on a narrow board called a surfboard",
                    "vi": "môn thể thao vừa cưỡi trên sóng vừa đứng trên một tấm ván hẹp gọi là ván lướt sóng"
                },
                "examples": [
                    {
                        "en": "to go surfing",
                        "vi": "đi lướt sóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of looking at different things on the internet in order to find something interesting",
                    "vi": "hoạt động xem xét những thứ khác nhau trên internet để tìm một thứ gì đó thú vị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "13e740c77f124d8584c2c4feffb2e4e8",
        "word": "telly",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈteli/",
            "us": "/ˈteli/"
        },
        "nearby": [
            {
                "word": "telltale",
                "pos": "noun"
            },
            {
                "word": "tellurium",
                "pos": "noun"
            },
            {
                "word": "telly",
                "pos": "noun"
            },
            {
                "word": "telnet",
                "pos": "noun"
            },
            {
                "word": "telnet",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a television set",
                    "vi": "một bộ truyền hình"
                },
                "examples": [
                    {
                        "en": "He spends most evenings just sitting in front of the telly.",
                        "vi": "Anh ấy dành hầu hết các buổi tối chỉ để ngồi trước điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the programmes broadcast on television",
                    "vi": "các chương trình phát sóng trên truyền hình"
                },
                "examples": [
                    {
                        "en": "daytime telly",
                        "vi": "điện thoại ban ngày"
                    },
                    {
                        "en": "I don't want to watch telly.",
                        "vi": "Tôi không muốn xem truyền hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "being broadcast by television; appearing in a television programme",
                    "vi": "được truyền hình; xuất hiện trong một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "What's on the telly tonight?",
                        "vi": "Có gì trên điện thoại tối nay?"
                    },
                    {
                        "en": "Is there anything good on the telly tonight?",
                        "vi": "Có điều gì tốt trên điện thoại tối nay?"
                    },
                    {
                        "en": "It was on the telly yesterday.",
                        "vi": "Đó là trên điện thoại ngày hôm qua."
                    },
                    {
                        "en": "I recognize you. Aren't you on the telly?",
                        "vi": "Tôi nhận ra bạn. Bạn có đang nghe điện thoại không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "e11f5f7e0b254e108e3cb0b51e512f84",
        "word": "tune",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/tjuːn/",
            "us": "/tuːn/"
        },
        "nearby": [
            {
                "word": "tundra",
                "pos": "noun"
            },
            {
                "word": "tune",
                "pos": "noun"
            },
            {
                "word": "tune",
                "pos": "verb"
            },
            {
                "word": "tuned in",
                "pos": "adjective"
            },
            {
                "word": "tuneful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make changes to a musical instrument so that it plays at the correct pitch",
                    "vi": "để thực hiện các thay đổi đối với một nhạc cụ để nó phát ở cao độ chính xác"
                },
                "examples": [
                    {
                        "en": "to tune a guitar",
                        "vi": "điều chỉnh một cây đàn guitar"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make changes to an engine so that it runs smoothly and as well as possible",
                    "vi": "để thực hiện các thay đổi đối với một động cơ để nó chạy trơn tru và tốt nhất có thể"
                },
                "examples": [
                    {
                        "en": "a finely tuned engine",
                        "vi": "một động cơ được tinh chỉnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the controls on a radio or television so that you can receive a particular programme or channel",
                    "vi": "để thay đổi các điều khiển trên radio hoặc TV để bạn có thể nhận một chương trình hoặc kênh cụ thể"
                },
                "examples": [
                    {
                        "en": "be tuned (in) (to something) The radio was tuned (in) to the BBC World Service.",
                        "vi": "được điều chỉnh (trong) (đến một cái gì đó) Đài đã được điều chỉnh (trong) BBC World Service."
                    },
                    {
                        "en": "(informal) Stay tuned for the news coming up next.",
                        "vi": "(không chính thức) Hãy theo dõi những tin tức tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare or change something so that it is suitable for a particular situation",
                    "vi": "để chuẩn bị hoặc thay đổi một cái gì đó sao cho nó phù hợp với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "His speech was tuned to what the audience wanted to hear.",
                        "vi": "Bài phát biểu của ông đã được điều chỉnh để phù hợp với những gì khán giả muốn nghe."
                    }
                ]
            }
        ]
    },
    {
        "id": "3174defc9fbd4839a01a68ab88595250",
        "word": "volume",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɒljuːm/",
            "us": "/ˈvɑːljəm/"
        },
        "nearby": [
            {
                "word": "voluble",
                "pos": "adjective"
            },
            {
                "word": "volubly",
                "pos": "adverb"
            },
            {
                "word": "volume",
                "pos": "noun"
            },
            {
                "word": "voluminous",
                "pos": "adjective"
            },
            {
                "word": "voluminously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of space that an object or a substance fills; the amount of space that a container has",
                    "vi": "khoảng không gian mà một vật hoặc một chất lấp đầy; lượng không gian mà một thùng chứa có"
                },
                "examples": [
                    {
                        "en": "volume of something How do you measure the volume of a gas?",
                        "vi": "Làm thế nào để đo thể tích của một chất khí?"
                    },
                    {
                        "en": "In the experiment, lighted candles were put under jars of different volumes.",
                        "vi": "Trong thí nghiệm, những ngọn nến được thắp sáng được đặt dưới những chiếc lọ có thể tích khác nhau."
                    },
                    {
                        "en": "Patients showed an improvement in lung volume.",
                        "vi": "Bệnh nhân cho thấy sự cải thiện về thể tích phổi."
                    },
                    {
                        "en": "Wait until the dough doubles in volume before kneading it again.",
                        "vi": "Chờ cho đến khi khối lượng bột tăng gấp đôi trước khi nhào lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of something",
                    "vi": "số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "volume of something the sheer volume (= large amount) of business",
                        "vi": "khối lượng của một cái gì đó khối lượng tuyệt đối (= số lượng lớn) của doanh nghiệp"
                    },
                    {
                        "en": "New roads are being built to cope with the increased volume of traffic.",
                        "vi": "Những con đường mới đang được xây dựng để đối phó với lưu lượng giao thông ngày càng tăng."
                    },
                    {
                        "en": "Sales volumes fell 0.2% in June.",
                        "vi": "Sản lượng tiêu thụ giảm 0,2% trong tháng Sáu."
                    },
                    {
                        "en": "The total volume of exports fell by 14.5 per cent.",
                        "vi": "Tổng khối lượng xuất khẩu giảm 14,5%."
                    },
                    {
                        "en": "an attempt to increase the volume of trade",
                        "vi": "một nỗ lực để tăng khối lượng thương mại"
                    },
                    {
                        "en": "powerful computers that can handle large volumes of data",
                        "vi": "máy tính mạnh mẽ có thể xử lý khối lượng lớn dữ liệu"
                    },
                    {
                        "en": "This work has grown in volume recently.",
                        "vi": "Công việc này đã phát triển về số lượng gần đây."
                    },
                    {
                        "en": "Due to the volume of mail Mary receives, she may not be able to respond to individual inquiries.",
                        "vi": "Do khối lượng thư mà Mary nhận được, cô ấy có thể không trả lời được các câu hỏi riêng lẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of sound that is produced by a television, radio, etc.",
                    "vi": "lượng âm thanh được tạo ra bởi ti vi, đài phát thanh, v.v."
                },
                "examples": [
                    {
                        "en": "to turn the volume up/down",
                        "vi": "để tăng / giảm âm lượng"
                    },
                    {
                        "en": "at a volume This music is best played at very high volume.",
                        "vi": "ở mức âm lượng Bản nhạc này được phát tốt nhất ở mức âm lượng rất lớn."
                    },
                    {
                        "en": "The song has been recorded at a low volume.",
                        "vi": "Bài hát đã được thu âm với âm lượng nhỏ."
                    },
                    {
                        "en": "He adjusted the volume on his phone.",
                        "vi": "Anh điều chỉnh âm lượng trên điện thoại của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that is part of a series of books",
                    "vi": "một cuốn sách là một phần của loạt sách"
                },
                "examples": [
                    {
                        "en": "an encyclopedia in 20 volumes",
                        "vi": "một bách khoa toàn thư gồm 20 tập"
                    },
                    {
                        "en": "The encyclopedia is a huge work, running to 20 volumes.",
                        "vi": "Bộ bách khoa toàn thư là một tác phẩm khổng lồ, dài tới 20 tập."
                    },
                    {
                        "en": "a companion volume to the one on African wildlife",
                        "vi": "một tập đồng hành với một tập về động vật hoang dã Châu Phi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a book",
                    "vi": "một quyển sách"
                },
                "examples": [
                    {
                        "en": "a library of over 50 000 volumes",
                        "vi": "một thư viện hơn 50 000 đầu sách"
                    },
                    {
                        "en": "She published her first book, a slim volume of poetry, at the age of sixteen.",
                        "vi": "Cô xuất bản cuốn sách đầu tiên của mình, một tập thơ mỏng, ở tuổi mười sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of different issues of the same magazine, especially all the issues for one year",
                    "vi": "một loạt các số báo khác nhau của cùng một tạp chí, đặc biệt là tất cả các số báo trong một năm"
                },
                "examples": [
                    {
                        "en": "‘New Scientist’ volume 142, number 3",
                        "vi": "Nhà khoa học mới' tập 142, số 3"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell you a lot about something/somebody, without the need for words",
                    "vi": "để nói với bạn rất nhiều điều về một cái gì đó / ai đó, mà không cần lời nói"
                },
                "examples": [
                    {
                        "en": "His achievement speaks volumes for his determination.",
                        "vi": "Thành tích của anh ấy nói lên quyết tâm của anh ấy."
                    },
                    {
                        "en": "What you wear speaks volumes about you.",
                        "vi": "Những gì bạn mặc nói lên rất nhiều điều về bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "39a52318123544b1a47551d3bfb2fcb5",
        "word": "couch potato",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkaʊtʃ pəteɪtəʊ/",
            "us": "/ˈkaʊtʃ pəteɪtəʊ/"
        },
        "nearby": [
            {
                "word": "couch",
                "pos": "verb"
            },
            {
                "word": "couchette",
                "pos": "noun"
            },
            {
                "word": "couch potato",
                "pos": "noun"
            },
            {
                "word": "cougar",
                "pos": "noun"
            },
            {
                "word": "cough",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who spends a lot of time sitting and watching television",
                    "vi": "một người dành nhiều thời gian ngồi và xem tivi"
                },
                "examples": [
                    {
                        "en": "He's turned into a real couch potato since he subscribed to the sports channel.",
                        "vi": "Anh ấy đã biến thành một củ khoai tây đi văng thực sự kể từ khi đăng ký kênh thể thao."
                    }
                ]
            }
        ]
    },
    {
        "id": "ef0f6158bf4d49c98637e654342d02b9",
        "word": "HD",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌeɪtʃ ˈdiː/",
            "us": "/ˌeɪtʃ ˈdiː/"
        },
        "nearby": [
            {
                "word": "HCF",
                "pos": "abbreviation"
            },
            {
                "word": "HCFC",
                "pos": "noun"
            },
            {
                "word": "HD",
                "pos": "noun"
            },
            {
                "word": "HDI",
                "pos": "abbreviation"
            },
            {
                "word": "HDMI",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that gives television, film or video images that are extremely high quality, with very clear, sharp outlines and details (the abbreviation for ‘high-definition’)",
                    "vi": "một hệ thống cung cấp hình ảnh truyền hình, phim hoặc video có chất lượng cực cao, với các đường nét và chi tiết rất rõ ràng, sắc nét (viết tắt của 'độ nét cao')"
                },
                "examples": [
                    {
                        "en": "in HD The film was shot in HD.",
                        "vi": "ở HD Bộ phim được quay ở chất lượng HD."
                    },
                    {
                        "en": "HD-ready television sets",
                        "vi": "TV chuẩn HD"
                    }
                ]
            }
        ]
    },
    {
        "id": "1b99c138b9654e57a151d882ba7e9886",
        "word": "parental controls",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pəˌrentl kənˈtrəʊlz/",
            "us": "/pəˌrentl kənˈtrəʊlz/"
        },
        "nearby": [
            {
                "word": "parental",
                "pos": "adjective"
            },
            {
                "word": "parental control",
                "pos": "adjective"
            },
            {
                "word": "parental controls",
                "pos": "noun"
            },
            {
                "word": "parental leave",
                "pos": "noun"
            },
            {
                "word": "parenthesis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feature that is offered in some computer, mobile phone and digital television services, that enables parents or other adults to control children’s access to material that is not suitable for them",
                    "vi": "một tính năng được cung cấp trong một số dịch vụ máy tính, điện thoại di động và truyền hình kỹ thuật số, cho phép cha mẹ hoặc những người lớn khác kiểm soát quyền truy cập của trẻ em vào tài liệu không phù hợp với chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e0fe1cb17d04d2797e3d71546afd840",
        "word": "peak time",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpiːk taɪm/",
            "us": "/ˈpiːk taɪm/"
        },
        "nearby": [
            {
                "word": "peak oil",
                "pos": "noun"
            },
            {
                "word": "peak rate",
                "pos": "noun"
            },
            {
                "word": "peak time",
                "pos": "noun"
            },
            {
                "word": "peaky",
                "pos": "adjective"
            },
            {
                "word": "peal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the greatest number of people are watching television or listening to the radio",
                    "vi": "thời điểm mà số lượng người xem truyền hình hoặc nghe đài nhiều nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd4d819db6d84394a1fe5d528ec7489b",
        "word": "plasma TV",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌplæzmə tiː ˈviː/",
            "us": "/ˌplæzmə tiː ˈviː/"
        },
        "nearby": [
            {
                "word": "plasma",
                "pos": "noun"
            },
            {
                "word": "plasma screen",
                "pos": "noun"
            },
            {
                "word": "plasma TV",
                "pos": "noun"
            },
            {
                "word": "the Battle of Plassey",
                "pos": ""
            },
            {
                "word": "plaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a television set with a plasma screen",
                    "vi": "máy thu hình có màn hình plasma"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f25e954401a04e3a983a04f70a2e8663",
        "word": "prime time",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpraɪm taɪm/",
            "us": "/ˈpraɪm taɪm/"
        },
        "nearby": [
            {
                "word": "prime rib",
                "pos": "noun"
            },
            {
                "word": "Prime Suspect",
                "pos": ""
            },
            {
                "word": "prime time",
                "pos": "noun"
            },
            {
                "word": "primeval",
                "pos": "adjective"
            },
            {
                "word": "primitive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time when the greatest number of people are watching television or listening to the radio",
                    "vi": "thời điểm mà số lượng người xem truyền hình hoặc nghe đài nhiều nhất"
                },
                "examples": [
                    {
                        "en": "prime-time television",
                        "vi": "Khung giờ vàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "14471f94687b4e62b39c5433b3153150",
        "word": "reception",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈsepʃn/",
            "us": "/rɪˈsepʃn/"
        },
        "nearby": [
            {
                "word": "recently",
                "pos": "adverb"
            },
            {
                "word": "receptacle",
                "pos": "noun"
            },
            {
                "word": "reception",
                "pos": "noun"
            },
            {
                "word": "reception centre",
                "pos": "noun"
            },
            {
                "word": "reception class",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area inside the entrance of a hotel, an office building, etc. where guests or visitors go first when they arrive",
                    "vi": "khu vực bên trong lối vào của một khách sạn, một tòa nhà văn phòng, v.v. nơi khách hoặc du khách đi đầu tiên khi họ đến"
                },
                "examples": [
                    {
                        "en": "Please report to reception on arrival.",
                        "vi": "Vui lòng báo cáo với lễ tân khi đến nơi."
                    },
                    {
                        "en": "You can leave a message with reception.",
                        "vi": "Bạn có thể để lại tin nhắn với lễ tân."
                    },
                    {
                        "en": "the reception area",
                        "vi": "khu vực tiếp tân"
                    },
                    {
                        "en": "in reception We arranged to meet in reception at 6.30.",
                        "vi": "tại quầy lễ tân Chúng tôi đã sắp xếp để gặp nhau tại quầy lễ tân lúc 6.30."
                    },
                    {
                        "en": "at reception I've left the keys at reception.",
                        "vi": "tại quầy lễ tân, tôi đã để quên chìa khóa ở quầy lễ tân."
                    },
                    {
                        "en": "on reception I've been on reception (= working there) the whole morning.",
                        "vi": "trên lễ tân Tôi đã tiếp tân (= làm việc ở đó) cả buổi sáng."
                    },
                    {
                        "en": "(North American English, British English) the reception desk",
                        "vi": "(Tiếng Anh Bắc Mỹ, tiếng Anh Anh) quầy lễ tân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal social occasion to welcome somebody or celebrate something",
                    "vi": "một dịp xã hội chính thức để chào đón ai đó hoặc kỷ niệm điều gì đó"
                },
                "examples": [
                    {
                        "en": "a wedding reception",
                        "vi": "tiệc cưới"
                    },
                    {
                        "en": "reception for somebody They held a reception for the Japanese trade delegation at the White House.",
                        "vi": "chiêu đãi ai đó Họ tổ chức tiệc chiêu đãi phái đoàn thương mại Nhật Bản tại Nhà Trắng."
                    },
                    {
                        "en": "Are you having a big reception after the wedding?",
                        "vi": "Bạn đang có một bữa tiệc lớn sau đám cưới?"
                    },
                    {
                        "en": "A champagne reception was held at the Swallow Hotel.",
                        "vi": "Tiệc rượu sâm panh được tổ chức tại khách sạn Swallow."
                    },
                    {
                        "en": "They hosted a reception for 75 guests.",
                        "vi": "Họ tổ chức tiệc chiêu đãi cho 75 khách."
                    },
                    {
                        "en": "We met at a reception.",
                        "vi": "Chúng tôi gặp nhau tại một buổi tiếp tân."
                    }
                ]
            },
            {
                "define": {
                    "en": "the type of welcome that is given to somebody/something",
                    "vi": "kiểu chào mừng được trao cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "reception from somebody The reception from critics and audiences was at best lukewarm",
                        "vi": "sự đón nhận từ một người nào đó Sự đón nhận từ các nhà phê bình và khán giả ở mức ấm áp nhất"
                    },
                    {
                        "en": "The band got a rapturous reception from the crowd.",
                        "vi": "Ban nhạc đã nhận được sự đón nhận cuồng nhiệt từ đám đông."
                    },
                    {
                        "en": "Her latest album has met with a mixed reception from fans.",
                        "vi": "Album mới nhất của cô đã nhận được sự đón nhận trái chiều từ người hâm mộ."
                    },
                    {
                        "en": "reception by somebody the book's reception by reviewers",
                        "vi": "sự tiếp nhận của ai đó sự tiếp nhận của cuốn sách bởi những người đánh giá"
                    },
                    {
                        "en": "Delegates gave him a warm reception as he called for more spending on education.",
                        "vi": "Các đại biểu đã dành cho ông sự đón tiếp nồng nhiệt khi ông kêu gọi chi tiêu nhiều hơn cho giáo dục."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of radio and television signals that are broadcast",
                    "vi": "chất lượng của tín hiệu phát thanh và truyền hình được phát sóng"
                },
                "examples": [
                    {
                        "en": "good/bad reception",
                        "vi": "tiếp nhận tốt / xấu"
                    },
                    {
                        "en": "There was very poor reception on my phone.",
                        "vi": "Có tín hiệu rất kém trên điện thoại của tôi."
                    },
                    {
                        "en": "Television reception is very good in this area.",
                        "vi": "Tiếp sóng truyền hình là rất tốt trong lĩnh vực này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of receiving or welcoming somebody",
                    "vi": "hành động đón nhận hoặc chào đón ai đó"
                },
                "examples": [
                    {
                        "en": "The locals provided facilities for the reception of children from the war zone.",
                        "vi": "Các địa phương đã cung cấp các phương tiện để tiếp nhận trẻ em từ vùng chiến sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the first class at school for children aged 4 or 5",
                    "vi": "lớp học đầu tiên ở trường cho trẻ em 4 hoặc 5 tuổi"
                },
                "examples": [
                    {
                        "en": "My son is in reception.",
                        "vi": "Con trai tôi đang tiếp tân."
                    }
                ]
            }
        ]
    },
    {
        "id": "212dd5d71ed14158b88bd94fa45ab0c6",
        "word": "satellite dish",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsætəlaɪt dɪʃ/",
            "us": "/ˈsætəlaɪt dɪʃ/"
        },
        "nearby": [
            {
                "word": "sated",
                "pos": "adjective"
            },
            {
                "word": "satellite",
                "pos": "noun"
            },
            {
                "word": "satellite dish",
                "pos": "noun"
            },
            {
                "word": "satellite station",
                "pos": "noun"
            },
            {
                "word": "sati",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment that receives signals from a satellite, used to enable people to watch satellite television",
                    "vi": "một thiết bị nhận tín hiệu từ vệ tinh, được sử dụng để cho phép mọi người xem truyền hình vệ tinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c04af32f77645d7bdf95f20e5efa144",
        "word": "tune in",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "tunefully",
                "pos": "adverb"
            },
            {
                "word": "tunefulness",
                "pos": "noun"
            },
            {
                "word": "tune in",
                "pos": "phrasal verb"
            },
            {
                "word": "tune in to",
                "pos": "phrasal verb"
            },
            {
                "word": "tuneless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to listen to a radio programme or watch a television programme",
                    "vi": "để nghe một chương trình radio hoặc xem một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "Don't forget to tune in to our special election programme this evening.",
                        "vi": "Đừng quên theo dõi chương trình bầu chọn đặc biệt của chúng tôi tối nay."
                    },
                    {
                        "en": "Ten million people regularly tune in to see his show.",
                        "vi": "Mười triệu người thường xuyên theo dõi để xem chương trình của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "bd8d39b69fff469992ea9114633ad459",
        "word": "widescreen",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwaɪdskriːn/",
            "us": "/ˈwaɪdskriːn/"
        },
        "nearby": [
            {
                "word": "wide-ranging",
                "pos": "adjective"
            },
            {
                "word": "wide receiver",
                "pos": "noun"
            },
            {
                "word": "widescreen",
                "pos": "noun"
            },
            {
                "word": "widespread",
                "pos": "adjective"
            },
            {
                "word": "widgeon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of presenting a film in which the image is a lot wider than it is high",
                    "vi": "một cách trình bày phim trong đó hình ảnh rộng hơn nhiều so với hình ảnh cao"
                },
                "examples": [
                    {
                        "en": "a widescreen TV",
                        "vi": "TV màn hình rộng"
                    }
                ]
            }
        ]
    },
    {
        "id": "793473057d3743de8fb732ce2501ccae",
        "word": "action replay",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌækʃn ˈriːpleɪ/",
            "us": "/ˌækʃn ˈriːpleɪ/"
        },
        "nearby": [
            {
                "word": "action painting",
                "pos": "noun"
            },
            {
                "word": "action point",
                "pos": "noun"
            },
            {
                "word": "action replay",
                "pos": "noun"
            },
            {
                "word": "action research",
                "pos": "noun"
            },
            {
                "word": "action stations",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "part of something, for example a sports game on television, that is immediately repeated, often more slowly, so that you can see a goal or another exciting or important moment again",
                    "vi": "một phần của nội dung nào đó, chẳng hạn như một trò chơi thể thao trên truyền hình, được lặp lại ngay lập tức, thường chậm hơn, để bạn có thể xem lại một bàn thắng hoặc một khoảnh khắc thú vị hoặc quan trọng khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or a situation that repeats something that has happened before",
                    "vi": "một sự kiện hoặc một tình huống lặp lại điều gì đó đã xảy ra trước đó"
                },
                "examples": [
                    {
                        "en": "It was an action replay of the problems of his first marriage.",
                        "vi": "Đó là một hành động diễn lại những vấn đề của cuộc hôn nhân đầu tiên của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "9be4a3836fb64822ab38a692307314a2",
        "word": "box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɒks/",
            "us": "/bɑːks/"
        },
        "nearby": [
            {
                "word": "bow to",
                "pos": "phrasal verb"
            },
            {
                "word": "bow-wow",
                "pos": "noun"
            },
            {
                "word": "box",
                "pos": "noun"
            },
            {
                "word": "box",
                "pos": "verb"
            },
            {
                "word": "boxcar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container made of wood, thick card, metal, etc. with a flat stiff base and sides and often a lid (= cover), used especially for holding solid things",
                    "vi": "một hộp đựng bằng gỗ, thẻ dày, kim loại, v.v. với đế và các mặt cứng bằng phẳng và thường có nắp (= nắp), được sử dụng đặc biệt để đựng những thứ rắn"
                },
                "examples": [
                    {
                        "en": "in a box Everything we owned was neatly packed in cardboard boxes.",
                        "vi": "trong hộp Mọi thứ chúng tôi sở hữu đều được đóng gói gọn gàng trong hộp các tông."
                    },
                    {
                        "en": "She kept all the letters in a box.",
                        "vi": "Cô ấy giữ tất cả các chữ cái trong một chiếc hộp."
                    },
                    {
                        "en": "inside a box Do you know what is inside the box?",
                        "vi": "bên trong một cái hộp Bạn có biết bên trong cái hộp là gì không?"
                    },
                    {
                        "en": "She opened her money box to see if she had saved enough for a tennis racket.",
                        "vi": "Cô mở hộp đựng tiền để xem mình đã tiết kiệm đủ cho một cây vợt tennis chưa."
                    },
                    {
                        "en": "a toolbox",
                        "vi": "một hộp công cụ"
                    },
                    {
                        "en": "a matchbox",
                        "vi": "một hộp diêm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a box and its contents; the things a box contains",
                    "vi": "một cái hộp và nội dung của nó; những thứ mà một cái hộp chứa"
                },
                "examples": [
                    {
                        "en": "a box of chocolates/cereal/tissues",
                        "vi": "một hộp sôcôla / ngũ cốc / khăn giấy"
                    },
                    {
                        "en": "He produced a box of matches from his pocket.",
                        "vi": "Anh ta lấy ra một hộp diêm từ trong túi của mình."
                    },
                    {
                        "en": "People buy low-fat cookies and then eat the whole box.",
                        "vi": "Mọi người mua bánh quy ít béo và sau đó ăn cả hộp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a square or rectangle on a page or computer screen for people to put information in or containing extra or different information",
                    "vi": "hình vuông hoặc hình chữ nhật trên trang hoặc màn hình máy tính để mọi người đưa thông tin vào hoặc chứa thông tin bổ sung hoặc khác"
                },
                "examples": [
                    {
                        "en": "Put a cross in the appropriate box.",
                        "vi": "Đặt một cây thánh giá vào ô thích hợp."
                    },
                    {
                        "en": "(British English) to tick a box",
                        "vi": "(Anh Anh) để đánh dấu vào một ô"
                    },
                    {
                        "en": "(North American English) to check a box",
                        "vi": "(Tiếng Anh Bắc Mỹ) để chọn một hộp"
                    },
                    {
                        "en": "Type your query in the search box.",
                        "vi": "Nhập truy vấn của bạn vào hộp tìm kiếm."
                    },
                    {
                        "en": "There are over 300 special note boxes in the dictionary.",
                        "vi": "Có hơn 300 ô ghi chú đặc biệt trong từ điển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area in a theatre, court or sports stadium, separated off from where other people sit",
                    "vi": "một khu vực nhỏ trong nhà hát, tòa án hoặc sân vận động thể thao, tách biệt với nơi người khác ngồi"
                },
                "examples": [
                    {
                        "en": "The painting depicts two elegantly dressed women in a box at the opera.",
                        "vi": "Bức tranh vẽ hai người phụ nữ ăn mặc sang trọng trong một chiếc hộp tại nhà hát opera."
                    },
                    {
                        "en": "The judge addressed the 12 people seated in the jury box.",
                        "vi": "Thẩm phán nói chuyện với 12 người ngồi trong hộp bồi thẩm đoàn."
                    },
                    {
                        "en": "They drank champagne as they watched the game from the executive box.",
                        "vi": "Họ uống sâm panh khi xem trận đấu từ hộp điều hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small shelter used for a particular purpose",
                    "vi": "một nơi trú ẩn nhỏ được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a sentry/signal box",
                        "vi": "một hộp tín hiệu / lính gác"
                    },
                    {
                        "en": "(British English, old-fashioned) a telephone box",
                        "vi": "(Anh Anh, kiểu cũ) một hộp điện thoại"
                    },
                    {
                        "en": "I called him from the phone box on the corner.",
                        "vi": "Tôi gọi cho anh ấy từ hộp điện thoại trên góc."
                    },
                    {
                        "en": "There was a babble of languages in the commentary box when the race began.",
                        "vi": "Có tiếng bập bẹ của ngôn ngữ trong khung bình luận khi cuộc đua bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the television",
                    "vi": "truyền hình"
                },
                "examples": [
                    {
                        "en": "on the box What's on the box tonight?",
                        "vi": "trên hộp Có gì trên hộp tối nay?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two roads cross or join, marked with a pattern of yellow lines to show that vehicles must not stop in that area",
                    "vi": "nơi có hai đường giao nhau hoặc nối nhau, được đánh dấu bằng vạch kẻ màu vàng để cho biết các phương tiện không được dừng ở khu vực đó"
                },
                "examples": [
                    {
                        "en": "Only traffic turning right may enter the box.",
                        "vi": "Chỉ có giao thông rẽ phải mới có thể vào ô."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area on a sports field that is marked by lines and used for a particular purpose",
                    "vi": "một khu vực trên sân thể thao được đánh dấu bằng các đường kẻ và được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "(British English) He was fouled in the box (= the penalty box).",
                        "vi": "(Anh Anh) Anh ấy đã bị phạm lỗi trong hộp (= vòng cấm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number used as an address, especially one given in newspaper advertisements to which replies can be sent",
                    "vi": "một số được sử dụng làm địa chỉ, đặc biệt là một số được đưa ra trong các quảng cáo trên báo để trả lời có thể được gửi đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of plastic that a man wears over his sex organs to protect them while he is playing a sport, especially cricket",
                    "vi": "một miếng nhựa mà một người đàn ông đeo lên các cơ quan sinh dục của mình để bảo vệ chúng khi anh ta chơi thể thao, đặc biệt là cricket"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small evergreen tree or bush with thick dark leaves, used especially for garden hedges",
                    "vi": "một cây nhỏ thường xanh hoặc bụi rậm có lá dày sẫm màu, được sử dụng đặc biệt cho hàng rào vườn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the hard wood of the box tree",
                    "vi": "cây hộp gỗ cứng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a set of methods or equipment that somebody can use",
                    "vi": "một tập hợp các phương pháp hoặc thiết bị mà ai đó có thể sử dụng"
                },
                "examples": [
                    {
                        "en": "Hotel managers are using a whole new bag of tricks to attract their guests.",
                        "vi": "Các nhà quản lý khách sạn đang sử dụng nhiều chiêu trò hoàn toàn mới để thu hút khách của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody with your hand on the side of their head as a punishment",
                    "vi": "đánh ai đó bằng bàn tay của bạn trên đầu của họ như một hình phạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to think about something, or how to do something, in a way that is new, different or shows imagination",
                    "vi": "để nghĩ về điều gì đó hoặc cách làm điều gì đó, theo một cách mới, khác biệt hoặc thể hiện trí tưởng tượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do exactly the right things to please somebody",
                    "vi": "làm chính xác những điều đúng đắn để làm hài lòng ai đó"
                },
                "examples": [
                    {
                        "en": "This is a movie that ticks all the boxes.",
                        "vi": "Đây là một bộ phim đánh dấu tất cả các hộp."
                    },
                    {
                        "en": "The house we would like to buy ticks all our boxes.",
                        "vi": "Ngôi nhà chúng tôi muốn mua ve tất cả các hộp của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "b960186b1a3549f286c26afe290244d5",
        "word": "cathode ray tube",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkæθəʊd ˈreɪ tjuːb/",
            "us": "/ˌkæθəʊd ˈreɪ tuːb/"
        },
        "nearby": [
            {
                "word": "catheter",
                "pos": "noun"
            },
            {
                "word": "cathode",
                "pos": "noun"
            },
            {
                "word": "cathode ray tube",
                "pos": "noun"
            },
            {
                "word": "catholic",
                "pos": "adjective"
            },
            {
                "word": "Catholic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vacuum tube that was used in the past inside a television or computer screen, etc., and from which a stream of electrons produced images on the screen",
                    "vi": "một ống chân không đã được sử dụng trong quá khứ bên trong màn hình tivi hoặc máy tính, v.v., và từ đó một dòng electron tạo ra hình ảnh trên màn hình"
                },
                "examples": [
                    {
                        "en": "the invention of the cathode ray tube",
                        "vi": "sự phát minh ra ống tia âm cực"
                    }
                ]
            }
        ]
    },
    {
        "id": "f094c650b7b64dd99f70ad8d00b40855",
        "word": "channel-hop",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃænl hɒp/",
            "us": "/ˈtʃænl hɑːp/"
        },
        "nearby": [
            {
                "word": "channel",
                "pos": "noun"
            },
            {
                "word": "channel",
                "pos": "verb"
            },
            {
                "word": "channel-hop",
                "pos": "verb"
            },
            {
                "word": "the Channel Islands",
                "pos": "noun"
            },
            {
                "word": "the Channel Tunnel",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to repeatedly switch from one television channel to another",
                    "vi": "chuyển đổi liên tục từ kênh truyền hình này sang kênh truyền hình khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2efba69287c46c2b2188aad9c3b68fa",
        "word": "contrast",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒntrɑːst/",
            "us": "/ˈkɑːntræst/"
        },
        "nearby": [
            {
                "word": "contrary1",
                "pos": "noun"
            },
            {
                "word": "contrary2",
                "pos": "adjective"
            },
            {
                "word": "contrast",
                "pos": "noun"
            },
            {
                "word": "contrast",
                "pos": "verb"
            },
            {
                "word": "contrasting",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a difference between two or more people or things that you can see clearly when they are compared or put close together; the fact of comparing two or more things in order to show the differences between them",
                    "vi": "sự khác biệt giữa hai hoặc nhiều người hoặc sự vật mà bạn có thể nhìn thấy rõ ràng khi chúng được so sánh hoặc đặt gần nhau; thực tế là so sánh hai hoặc nhiều thứ để chỉ ra sự khác biệt giữa chúng"
                },
                "examples": [
                    {
                        "en": "The two cities make an interesting contrast.",
                        "vi": "Hai thành phố tạo nên một sự tương phản thú vị."
                    },
                    {
                        "en": "contrast between A and B There is an obvious contrast between the cultures of East and West.",
                        "vi": "sự tương phản giữa A và B Có một sự tương phản rõ ràng giữa hai nền văn hóa Đông và Tây."
                    },
                    {
                        "en": "in contrast In contrast, the south suffered very little hurricane damage.",
                        "vi": "ngược lại Ngược lại, miền nam chịu rất ít thiệt hại do bão."
                    },
                    {
                        "en": "in contrast to somebody/something The situation when we arrived was in marked contrast to the news reports.",
                        "vi": "ngược lại với ai đó / cái gì đó Tình hình khi chúng tôi đến hoàn toàn trái ngược với các bản tin."
                    },
                    {
                        "en": "The poverty of her childhood stands in total contrast to her life in Hollywood.",
                        "vi": "Thời thơ ấu nghèo khó của cô hoàn toàn trái ngược với cuộc sống của cô ở Hollywood."
                    },
                    {
                        "en": "The company lost $7 million this quarter in contrast to a profit of $6.2 million a year earlier.",
                        "vi": "Công ty đã lỗ 7 triệu đô la trong quý này trái ngược với lợi nhuận 6,2 triệu đô la một năm trước đó."
                    },
                    {
                        "en": "contrast with somebody/something to show a sharp/stark/striking contrast with something",
                        "vi": "tương phản với ai đó / cái gì đó để thể hiện sự tương phản rõ nét / hoàn toàn / nổi bật với một cái gì đó"
                    },
                    {
                        "en": "contrast in something A wool jacket complements the silk trousers and provides an interesting contrast in texture.",
                        "vi": "sự tương phản trong một cái gì đó Một chiếc áo khoác len bổ sung cho quần lụa và cung cấp một sự tương phản thú vị về kết cấu."
                    },
                    {
                        "en": "by contrast When you look at their new system, ours seems very old-fashioned by contrast.",
                        "vi": "ngược lại Khi bạn nhìn vào hệ thống mới của họ, ngược lại, hệ thống của chúng ta có vẻ rất lỗi thời."
                    },
                    {
                        "en": "contrast of A and B Careful contrast of the two plans shows some important differences.",
                        "vi": "sự tương phản của A và B Sự tương phản cẩn thận của hai kế hoạch cho thấy một số khác biệt quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is clearly different from somebody/something else",
                    "vi": "một người hoặc một vật rõ ràng là khác với ai đó / cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "The work you did today is quite a contrast to (= very much better/worse than) what you did last week.",
                        "vi": "Công việc bạn đã làm hôm nay hoàn toàn trái ngược với (= tốt hơn / tệ hơn rất nhiều so với) những gì bạn đã làm tuần trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "differences in colour or in light and dark, used in photographs and paintings to create a special effect",
                    "vi": "sự khác biệt về màu sắc hoặc sáng và tối, được sử dụng trong ảnh và tranh để tạo hiệu ứng đặc biệt"
                },
                "examples": [
                    {
                        "en": "The artist's use of contrast is masterly.",
                        "vi": "Nghệ sĩ sử dụng độ tương phản là một cách thành thạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of difference between light and dark in a photograph or the picture on a television screen",
                    "vi": "mức độ chênh lệch giữa sáng và tối trong một bức ảnh hoặc hình ảnh trên màn hình tivi"
                },
                "examples": [
                    {
                        "en": "Use this button to adjust the contrast.",
                        "vi": "Sử dụng nút này để điều chỉnh độ tương phản."
                    }
                ]
            }
        ]
    },
    {
        "id": "dbb72b9420c24eb6aadc615ce65b88e6",
        "word": "flat-panel",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæt pænl/",
            "us": "/ˈflæt pænl/"
        },
        "nearby": [
            {
                "word": "flat-out",
                "pos": "adjective"
            },
            {
                "word": "flat-pack",
                "pos": "noun"
            },
            {
                "word": "flat-panel",
                "pos": "adjective"
            },
            {
                "word": "flat racing",
                "pos": "noun"
            },
            {
                "word": "flat rate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of television or computer monitor that is very thin when compared with the original type",
                    "vi": "một loại tivi hoặc màn hình máy tính rất mỏng khi so sánh với loại ban đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9533a18b7004418e828719d4ddc6c0e5",
        "word": "goggle-box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒɡl bɒks/",
            "us": "/ˈɡɑːɡl bɑːks/"
        },
        "nearby": [
            {
                "word": "gogga",
                "pos": "noun"
            },
            {
                "word": "goggle",
                "pos": "verb"
            },
            {
                "word": "goggle-box",
                "pos": "noun"
            },
            {
                "word": "goggle-eyed",
                "pos": "adjective"
            },
            {
                "word": "goggles",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a television",
                    "vi": "một cái tivi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3518e5d5b4a34d16b224f4a6e0ca1743",
        "word": "HDTV",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪtʃ diː tiː ˈviː/",
            "us": "/ˌeɪtʃ diː tiː ˈviː/"
        },
        "nearby": [
            {
                "word": "HDI",
                "pos": "abbreviation"
            },
            {
                "word": "HDMI",
                "pos": "abbreviation"
            },
            {
                "word": "HDTV",
                "pos": "noun"
            },
            {
                "word": "he",
                "pos": "pronoun"
            },
            {
                "word": "he",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "technology that produces extremely clear images on a television screen (the abbreviation for ‘high definition television’)",
                    "vi": "công nghệ tạo ra hình ảnh cực kỳ rõ nét trên màn hình tivi (viết tắt của 'tivi độ nét cao')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "63c8bd13d79c4221a15365a75635d3eb",
        "word": "hi-def",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪ ˈdef/",
            "us": "/ˌhaɪ ˈdef/"
        },
        "nearby": [
            {
                "word": "hide behind",
                "pos": "phrasal verb"
            },
            {
                "word": "hidebound",
                "pos": "adjective"
            },
            {
                "word": "hi-def",
                "pos": "adjective"
            },
            {
                "word": "hideous",
                "pos": "adjective"
            },
            {
                "word": "hideously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "high-definition (= using or produced by a system that gives very clear detailed images)",
                    "vi": "độ nét cao (= sử dụng hoặc sản xuất bởi một hệ thống cung cấp hình ảnh chi tiết rất rõ ràng)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f6517851366a4535a28ada8aabdebe32",
        "word": "high-definition",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪ defɪˈnɪʃn/",
            "us": "/ˌhaɪ defɪˈnɪʃn/"
        },
        "nearby": [
            {
                "word": "the High Court of Justiciary",
                "pos": ""
            },
            {
                "word": "high day",
                "pos": "noun"
            },
            {
                "word": "high-definition",
                "pos": "adjective"
            },
            {
                "word": "high-end",
                "pos": "adjective"
            },
            {
                "word": "higher",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using or produced by a system that gives very clear detailed images",
                    "vi": "sử dụng hoặc sản xuất bởi một hệ thống cung cấp hình ảnh chi tiết rất rõ ràng"
                },
                "examples": [
                    {
                        "en": "high-definition television",
                        "vi": "Truyền hình độ nét cao"
                    },
                    {
                        "en": "high-definition displays",
                        "vi": "màn hình độ nét cao"
                    }
                ]
            }
        ]
    },
    {
        "id": "fcfb0c0a6f504069a60af233daa96519",
        "word": "instant replay",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnstənt ˈriːpleɪ/",
            "us": "/ˌɪnstənt ˈriːpleɪ/"
        },
        "nearby": [
            {
                "word": "instant messaging",
                "pos": "noun"
            },
            {
                "word": "instant messenger",
                "pos": "noun"
            },
            {
                "word": "instant replay",
                "pos": "noun"
            },
            {
                "word": "instead",
                "pos": "adverb"
            },
            {
                "word": "instead of",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "part of something, for example a sports game on television, that is immediately repeated, often more slowly, so that you can see a goal or another exciting or important moment again",
                    "vi": "một phần của nội dung nào đó, chẳng hạn như một trò chơi thể thao trên truyền hình, được lặp lại ngay lập tức, thường chậm hơn, để bạn có thể xem lại một bàn thắng hoặc một khoảnh khắc thú vị hoặc quan trọng khác"
                },
                "examples": [
                    {
                        "en": "Instant replays can occasionally prove the referee wrong.",
                        "vi": "Việc phát lại ngay lập tức đôi khi có thể chứng minh trọng tài sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e30b6cff3614504999727aeb65ae301",
        "word": "multichannel",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmʌltitʃænl/",
            "us": "/ˈmʌltitʃænl/"
        },
        "nearby": [
            {
                "word": "multicast",
                "pos": "verb"
            },
            {
                "word": "multicellular",
                "pos": "adjective"
            },
            {
                "word": "multichannel",
                "pos": "adjective"
            },
            {
                "word": "multicoloured",
                "pos": "adjective"
            },
            {
                "word": "multicultural",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or using many different television or communication channels",
                    "vi": "có hoặc sử dụng nhiều kênh truyền hình hoặc truyền thông khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b7f7c2b6ea5c4a36b16f42412a09c4e4",
        "word": "pay-per-view",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪ pə vjuː/",
            "us": "/ˈpeɪ pər vjuː/"
        },
        "nearby": [
            {
                "word": "payout",
                "pos": "noun"
            },
            {
                "word": "pay packet",
                "pos": "noun"
            },
            {
                "word": "pay-per-view",
                "pos": "noun"
            },
            {
                "word": "payphone",
                "pos": "noun"
            },
            {
                "word": "payroll",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of television broadcasting in which you pay to watch a particular programme, such as a film or a sports event",
                    "vi": "một hệ thống phát sóng truyền hình mà bạn trả tiền để xem một chương trình cụ thể, chẳng hạn như một bộ phim hoặc một sự kiện thể thao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ff3728b2f2a3479cb4654395267b1592",
        "word": "pay TV",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpeɪ tiː ˈviː/",
            "us": "/ˌpeɪ tiː ˈviː/"
        },
        "nearby": [
            {
                "word": "payslip",
                "pos": "noun"
            },
            {
                "word": "pay stub",
                "pos": "noun"
            },
            {
                "word": "pay TV",
                "pos": "noun"
            },
            {
                "word": "pay up",
                "pos": "phrasal verb"
            },
            {
                "word": "paywall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of television broadcasting in which you pay to watch particular television programmes or channels",
                    "vi": "một hệ thống phát sóng truyền hình mà bạn trả tiền để xem các chương trình hoặc kênh truyền hình cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d1d39935583a42489a47e3b3f2a34a09",
        "word": "plasma screen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplæzmə skriːn/",
            "us": "/ˈplæzmə skriːn/"
        },
        "nearby": [
            {
                "word": "plaque",
                "pos": "noun"
            },
            {
                "word": "plasma",
                "pos": "noun"
            },
            {
                "word": "plasma screen",
                "pos": "noun"
            },
            {
                "word": "plasma TV",
                "pos": "noun"
            },
            {
                "word": "the Battle of Plassey",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of television or computer screen that is larger and thinner than most screens and produces a very clear image",
                    "vi": "một loại màn hình tivi hoặc máy tính lớn hơn và mỏng hơn hầu hết các loại màn hình và tạo ra hình ảnh rất rõ nét"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a72aefcb2ca0416586145224aef8d314",
        "word": "Scart",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skɑːt/",
            "us": "/skɑːrt/"
        },
        "nearby": [
            {
                "word": "scarp",
                "pos": "noun"
            },
            {
                "word": "scarper",
                "pos": "verb"
            },
            {
                "word": "Scart",
                "pos": "noun"
            },
            {
                "word": "scarves",
                "pos": "noun"
            },
            {
                "word": "scary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device with 21 pins, used to connect video equipment to, for example, a television",
                    "vi": "một thiết bị có 21 chân, được sử dụng để kết nối thiết bị video với, chẳng hạn như TV"
                },
                "examples": [
                    {
                        "en": "a Scart socket",
                        "vi": "một ổ cắm Scart"
                    }
                ]
            }
        ]
    },
    {
        "id": "a013fcbce9384e3e9a9e99239f731cad",
        "word": "set",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            },
            {
                "word": "set about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of similar things that belong together in some way",
                    "vi": "một nhóm những thứ giống nhau thuộc về nhau theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a set of six chairs",
                        "vi": "một bộ sáu chiếc ghế"
                    },
                    {
                        "en": "a complete set of her novels",
                        "vi": "một bộ tiểu thuyết hoàn chỉnh của cô ấy"
                    },
                    {
                        "en": "a set of false teeth",
                        "vi": "một bộ răng giả"
                    },
                    {
                        "en": "These companies operate under a strict set of rules.",
                        "vi": "Các công ty này hoạt động theo một bộ quy tắc nghiêm ngặt."
                    },
                    {
                        "en": "This is an unusual set of circumstances.",
                        "vi": "Đây là một tập hợp các tình huống bất thường."
                    },
                    {
                        "en": "I have a different set of values to them.",
                        "vi": "Tôi có một bộ giá trị khác với chúng."
                    },
                    {
                        "en": "Now they faced a whole new set of problems.",
                        "vi": "Bây giờ họ phải đối mặt với một loạt vấn đề hoàn toàn mới."
                    },
                    {
                        "en": "You can borrow my keys—I have a spare set.",
                        "vi": "Bạn có thể mượn chìa khóa của tôi — tôi có một bộ dự phòng."
                    },
                    {
                        "en": "She won a silver medal in the long jump to complete her set.",
                        "vi": "Cô đã giành huy chương bạc môn nhảy xa để hoàn thành set của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects used together, for example for playing a game",
                    "vi": "một nhóm các đối tượng được sử dụng cùng nhau, chẳng hạn như để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "a chess set",
                        "vi": "một bộ cờ vua"
                    },
                    {
                        "en": "a model train set",
                        "vi": "một bộ mô hình xe lửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have similar interests and spend a lot of time together socially",
                    "vi": "một nhóm những người có cùng sở thích và dành nhiều thời gian cho nhau trên phương diện xã hội"
                },
                "examples": [
                    {
                        "en": "the smart set (= rich, fashionable people)",
                        "vi": "bộ thông minh (= những người giàu có, thời trang)"
                    },
                    {
                        "en": "Dublin’s literary set",
                        "vi": "Bộ văn học của Dublin"
                    },
                    {
                        "en": "It's known as a playground for Scotland's rich hunting and fishing set.",
                        "vi": "Nó được biết đến như một sân chơi cho bộ môn săn bắn và câu cá phong phú của Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment for receiving television or radio signals",
                    "vi": "một phần của thiết bị để nhận tín hiệu truyền hình hoặc radio"
                },
                "examples": [
                    {
                        "en": "a television/TV set",
                        "vi": "một máy thu hình / TV"
                    }
                ]
            },
            {
                "define": {
                    "en": "the scenery used for a play, film, etc.",
                    "vi": "phong cảnh được sử dụng cho một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "We need volunteers to help build and paint the set.",
                        "vi": "Chúng tôi cần các tình nguyện viên giúp xây dựng và sơn bộ này."
                    },
                    {
                        "en": "The locations and set designs were fabulous.",
                        "vi": "Các vị trí và thiết kế thiết lập là tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a play is performed or part of a film is filmed",
                    "vi": "nơi biểu diễn một vở kịch hoặc một phần của bộ phim được quay"
                },
                "examples": [
                    {
                        "en": "The cast must all be on (the) set by 7 in the morning.",
                        "vi": "Tất cả các diễn viên phải có mặt trên (bộ) trước 7 giờ sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of a match in games such as tennis or volleyball",
                    "vi": "một phần của trận đấu trong các trò chơi như quần vợt hoặc bóng chuyền"
                },
                "examples": [
                    {
                        "en": "She won in straight sets (= without losing a set).",
                        "vi": "Cô ấy thắng trong các set liên tiếp (= mà không thua set nào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of things regarded as a unit because they all have particular qualities in common",
                    "vi": "một nhóm những thứ được coi là một đơn vị vì chúng đều có những điểm chung đặc biệt"
                },
                "examples": [
                    {
                        "en": "the set of all square numbers less than 50",
                        "vi": "tập hợp tất cả các số bình phương nhỏ hơn 50"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of songs or pieces of music that a musician or group performs at a concert",
                    "vi": "một loạt các bài hát hoặc đoạn nhạc mà một nhạc sĩ hoặc nhóm biểu diễn tại một buổi hòa nhạc"
                },
                "examples": [
                    {
                        "en": "a stunning solo set of ten songs",
                        "vi": "một bộ mười bài hát solo tuyệt đẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of school students with a similar ability in a particular subject",
                    "vi": "một nhóm học sinh có khả năng tương tự trong một môn học cụ thể"
                },
                "examples": [
                    {
                        "en": "She's in the top set for French.",
                        "vi": "Cô ấy thuộc nhóm hàng đầu về tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody’s face or body is fixed in a particular expression, especially one showing a feeling of being determined",
                    "vi": "cách mà khuôn mặt hoặc cơ thể của ai đó được cố định trong một biểu hiện cụ thể, đặc biệt là một người thể hiện cảm giác được xác định"
                },
                "examples": [
                    {
                        "en": "She admired the firm set of his jaw.",
                        "vi": "Cô ngưỡng mộ bộ hàm rắn chắc của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of arranging hair in a particular style while it is wet",
                    "vi": "một hành động sắp xếp tóc theo một kiểu cụ thể khi tóc ướt"
                },
                "examples": [
                    {
                        "en": "A shampoo and set costs £15.",
                        "vi": "Một bộ dầu gội đầu có giá 15 bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of becoming solid or hard",
                    "vi": "trạng thái trở nên rắn hoặc cứng"
                },
                "examples": [
                    {
                        "en": "To be sure of a good set when making the jam, use preserving sugar with added pectin.",
                        "vi": "Để đảm bảo mứt ngon khi làm mứt, hãy sử dụng đường bảo quản có thêm pectin."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hole in the ground where a badger lives",
                    "vi": "một cái lỗ trên mặt đất nơi một con lửng sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a young plant, shoot etc. for planting",
                    "vi": "một cây non, chồi vv để trồng"
                },
                "examples": [
                    {
                        "en": "onion sets",
                        "vi": "bộ hành"
                    }
                ]
            }
        ]
    },
    {
        "id": "9fcacb3ff0e74cc5a2dee43285b338cb",
        "word": "set-top box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌset tɒp ˈbɒks/",
            "us": "/ˌset tɑːp ˈbɑːks/"
        },
        "nearby": [
            {
                "word": "set to",
                "pos": "phrasal verb"
            },
            {
                "word": "set-to",
                "pos": "noun"
            },
            {
                "word": "set-top box",
                "pos": "noun"
            },
            {
                "word": "set up",
                "pos": "phrasal verb"
            },
            {
                "word": "set-up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that allows digital television from cable, satellite, the internet, etc. to be seen on a television set that does not have this feature built in (= as part of the television)",
                    "vi": "thiết bị cho phép xem truyền hình kỹ thuật số từ cáp, vệ tinh, internet, v.v. trên TV không tích hợp tính năng này (= như một phần của TV)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf215ac38c8243be94d00099536ba556",
        "word": "slider",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslaɪdə(r)/",
            "us": "/ˈslaɪdər/"
        },
        "nearby": [
            {
                "word": "slide",
                "pos": "noun"
            },
            {
                "word": "slide projector",
                "pos": "noun"
            },
            {
                "word": "slider",
                "pos": "noun"
            },
            {
                "word": "slide rule",
                "pos": "noun"
            },
            {
                "word": "slide show",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device for controlling something such as the volume of a radio, which you slide up and down or from side to side",
                    "vi": "một thiết bị để điều khiển thứ gì đó, chẳng hạn như âm lượng của radio, bạn trượt lên và xuống hoặc từ bên này sang bên kia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an icon that you can slide up and down or from side to side with the mouse",
                    "vi": "một biểu tượng mà bạn có thể trượt lên xuống hoặc từ bên này sang bên kia bằng chuột"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a freshwater turtle from North America",
                    "vi": "một con rùa nước ngọt từ Bắc Mỹ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f01317a0495b4abd8e4f33d5441e73aa",
        "word": "square eyes",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌskweər ˈaɪz/",
            "us": "/ˌskwer ˈaɪz/"
        },
        "nearby": [
            {
                "word": "the Square Deal",
                "pos": ""
            },
            {
                "word": "square-eyed",
                "pos": "adjective"
            },
            {
                "word": "square eyes",
                "pos": "noun"
            },
            {
                "word": "squarehead",
                "pos": "noun"
            },
            {
                "word": "square knot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of describing or referring to a person watching too much TV",
                    "vi": "một cách mô tả hoặc đề cập đến một người xem quá nhiều TV"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e2c67e547d8431692de06a74a608ffd",
        "word": "terrestrial",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/təˈrestriəl/",
            "us": "/təˈrestriəl/"
        },
        "nearby": [
            {
                "word": "terrarium",
                "pos": "noun"
            },
            {
                "word": "the Terrence Higgins Trust",
                "pos": ""
            },
            {
                "word": "terrestrial",
                "pos": "adjective"
            },
            {
                "word": "terrible",
                "pos": "adjective"
            },
            {
                "word": "terribly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living on the land or on the ground, rather than in water, in trees or in the air",
                    "vi": "sống trên cạn hoặc trên mặt đất, chứ không phải dưới nước, trên cây hoặc trên không"
                },
                "examples": [
                    {
                        "en": "a terrestrial habitat",
                        "vi": "một môi trường sống trên cạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the planet Earth",
                    "vi": "kết nối với hành tinh Trái đất"
                },
                "examples": [
                    {
                        "en": "terrestrial life",
                        "vi": "cuộc sống trên cạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "operating by using equipment on the surface of the earth, rather than sending the signal via a satellite",
                    "vi": "hoạt động bằng cách sử dụng thiết bị trên bề mặt trái đất, thay vì gửi tín hiệu qua vệ tinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a76c75293be5421789e3ea1814d3871d",
        "word": "transistor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/trænˈzɪstə(r)/",
            "us": "/trænˈzɪstər/"
        },
        "nearby": [
            {
                "word": "transient",
                "pos": "adjective"
            },
            {
                "word": "transient",
                "pos": "noun"
            },
            {
                "word": "transistor",
                "pos": "noun"
            },
            {
                "word": "transit",
                "pos": "noun"
            },
            {
                "word": "transit",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small electronic device used in computers, radios, televisions, etc. for controlling an electric current as it passes along a circuit",
                    "vi": "một thiết bị điện tử nhỏ được sử dụng trong máy tính, radio, tivi, v.v. để điều khiển dòng điện khi nó đi dọc theo mạch điện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small radio with transistors",
                    "vi": "một đài phát thanh nhỏ với bóng bán dẫn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d8ea79a5de9c4d5fb37bfd912088295c",
        "word": "tube",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tjuːb/",
            "us": "/tuːb/"
        },
        "nearby": [
            {
                "word": "tubal",
                "pos": "adjective"
            },
            {
                "word": "tubby",
                "pos": "adjective"
            },
            {
                "word": "tube",
                "pos": "noun"
            },
            {
                "word": "tube light",
                "pos": "noun"
            },
            {
                "word": "tuber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, hollow pipe made of metal, plastic, rubber, etc., through which liquids or gases move from one place to another",
                    "vi": "một đường ống dài, rỗng làm bằng kim loại, nhựa, cao su, v.v., qua đó chất lỏng hoặc khí di chuyển từ nơi này sang nơi khác"
                },
                "examples": [
                    {
                        "en": "He had to be fed through a feeding tube for several months.",
                        "vi": "Anh ta đã phải được cho ăn qua một ống truyền thức ăn trong vài tháng."
                    },
                    {
                        "en": "She poured the liquid down the tube.",
                        "vi": "Cô đổ chất lỏng xuống ống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hollow object in the shape of a pipe or tube",
                    "vi": "một vật thể rỗng trong hình dạng của một cái ống hoặc một cái ống"
                },
                "examples": [
                    {
                        "en": "the cardboard tube from the centre of a toilet roll",
                        "vi": "ống các tông từ tâm của cuộn toilet"
                    },
                    {
                        "en": "I put the poster back into its tube.",
                        "vi": "Tôi đặt lại tấm áp phích vào ống của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, narrow container made of soft metal or plastic, with a lid (= cover), used for holding thick liquids that can be forced out of it by pressing",
                    "vi": "một vật chứa dài, hẹp làm bằng kim loại hoặc nhựa mềm, có nắp (= nắp), được sử dụng để đựng chất lỏng dày có thể đẩy ra khỏi nó bằng cách nhấn"
                },
                "examples": [
                    {
                        "en": "tube (of something) a tube of toothpaste",
                        "vi": "ống (của cái gì đó) một ống kem đánh răng"
                    },
                    {
                        "en": "a tube of glue",
                        "vi": "một ống keo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a can of beer",
                    "vi": "một lon bia"
                },
                "examples": [
                    {
                        "en": "a tube of lager",
                        "vi": "một ống bằng lăng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part inside the body that is like a tube in shape and through which air, liquid, etc. passes",
                    "vi": "một phần bên trong cơ thể giống như một cái ống có hình dạng và không khí, chất lỏng, v.v. đi qua"
                },
                "examples": [
                    {
                        "en": "bronchial tubes",
                        "vi": "ống phế quản"
                    },
                    {
                        "en": "The oesophagus is the tube leading from the throat to the stomach.",
                        "vi": "Thực quản là ống dẫn từ cổ họng đến dạ dày."
                    }
                ]
            },
            {
                "define": {
                    "en": "the underground railway system in London",
                    "vi": "hệ thống đường sắt ngầm ở London"
                },
                "examples": [
                    {
                        "en": "on the tube I often travel on the tube",
                        "vi": "trên ống tôi thường đi du lịch trên ống"
                    },
                    {
                        "en": "by tube We came by tube.",
                        "vi": "bằng ống Chúng tôi đến bằng ống."
                    },
                    {
                        "en": "a tube station/train",
                        "vi": "một ga tàu / xe lửa"
                    },
                    {
                        "en": "She caught the wrong tube (= tube train).",
                        "vi": "Cô ấy bắt nhầm ống (= tàu điện ống)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the television",
                    "vi": "truyền hình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small tube placed in a child’s ear in order to drain liquid from it when there is an infection",
                    "vi": "một ống nhỏ đặt trong tai của trẻ em để thoát chất lỏng ra khỏi tai khi bị nhiễm trùng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail",
                    "vi": "thất bại"
                },
                "examples": [
                    {
                        "en": "The education system is going down the tubes.",
                        "vi": "Hệ thống giáo dục đang đi xuống."
                    }
                ]
            }
        ]
    },
    {
        "id": "7fbf828212ef4aad90caa651ffc32808",
        "word": "tuner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtjuːnə(r)/",
            "us": "/ˈtuːnər/"
        },
        "nearby": [
            {
                "word": "tunelessly",
                "pos": "adverb"
            },
            {
                "word": "tune out",
                "pos": "phrasal verb"
            },
            {
                "word": "tuner",
                "pos": "noun"
            },
            {
                "word": "tunesmith",
                "pos": "noun"
            },
            {
                "word": "tune up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who tunes musical instruments, especially pianos",
                    "vi": "một người điều chỉnh nhạc cụ, đặc biệt là piano"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a radio, television, etc. that you move in order to change the signal and receive the radio or television station that you want",
                    "vi": "phần của đài phát thanh, truyền hình, v.v. mà bạn di chuyển để thay đổi tín hiệu và nhận đài phát thanh hoặc truyền hình mà bạn muốn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an electronic device that receives a radio signal and sends it to an amplifier so that it can be heard",
                    "vi": "một thiết bị điện tử nhận tín hiệu vô tuyến và gửi đến bộ khuếch đại để có thể nghe được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3fc27b6c66714ac88887e21e64db3948",
        "word": "viewership",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvjuːəʃɪp/",
            "us": "/ˈvjuːərʃɪp/"
        },
        "nearby": [
            {
                "word": "viewable",
                "pos": "adjective"
            },
            {
                "word": "viewer",
                "pos": "noun"
            },
            {
                "word": "viewership",
                "pos": "noun"
            },
            {
                "word": "viewfinder",
                "pos": "noun"
            },
            {
                "word": "viewpoint",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number or type of people who watch a particular television programme or television channel",
                    "vi": "số lượng hoặc kiểu người xem một chương trình truyền hình hoặc kênh truyền hình cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "94c8f90edac4458bb8cd36be2db39bed",
        "word": "watershed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːtəʃed/",
            "us": "/ˈwɔːtərʃed/"
        },
        "nearby": [
            {
                "word": "water-resistant",
                "pos": "adjective"
            },
            {
                "word": "'Muddy' Waters",
                "pos": ""
            },
            {
                "word": "watershed",
                "pos": "noun"
            },
            {
                "word": "Watership Down",
                "pos": ""
            },
            {
                "word": "waterside",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an event or a period of time that marks an important change",
                    "vi": "một sự kiện hoặc một khoảng thời gian đánh dấu một sự thay đổi quan trọng"
                },
                "examples": [
                    {
                        "en": "The middle decades of the 19th century marked a watershed in Russia's history.",
                        "vi": "Những thập kỷ giữa của thế kỷ 19 đánh dấu một bước ngoặt trong lịch sử nước Nga."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line of high land where streams on one side flow into one river, and streams on the other side flow into a different river",
                    "vi": "một dòng đất cao, nơi suối ở một bên đổ vào sông này, suối ở bên kia chảy thành sông khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) the time before which programmes that are not considered suitable for children may not be shown on television",
                    "vi": "(ở Anh) thời gian trước đó những chương trình không được coi là phù hợp với trẻ em có thể không được chiếu trên truyền hình"
                },
                "examples": [
                    {
                        "en": "the 9 o’clock watershed",
                        "vi": "đầu nguồn 9 giờ"
                    }
                ]
            }
        ]
    },
    {
        "id": "c4eebbc6fd7d498286478fd395e83050",
        "word": "zap",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/zæp/",
            "us": "/zæp/"
        },
        "nearby": [
            {
                "word": "Darryl F Zanuck",
                "pos": ""
            },
            {
                "word": "zany",
                "pos": "adjective"
            },
            {
                "word": "zap",
                "pos": "verb"
            },
            {
                "word": "Frank Zappa",
                "pos": ""
            },
            {
                "word": "zapper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to destroy, kill or hit somebody/something suddenly and with force",
                    "vi": "để tiêu diệt, giết hoặc đánh ai đó / cái gì đó bất ngờ và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "zap somebody/something The monster got zapped by a flying saucer (= in a computer game).",
                        "vi": "zap ai đó / cái gì đó Con quái vật bị đĩa bay hạ gục (= trong một trò chơi máy tính)."
                    },
                    {
                        "en": "It's vital to zap stress fast.",
                        "vi": "Điều quan trọng là giảm căng thẳng nhanh chóng."
                    },
                    {
                        "en": "zap somebody/something with something He jumped like a man who'd been zapped with 1 000 volts.",
                        "vi": "đánh ai đó / cái gì đó bằng thứ gì đó Anh ấy nhảy như một người đàn ông đã bị hạ gục với 1 000 vôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something very fast",
                    "vi": "làm một cái gì đó rất nhanh"
                },
                "examples": [
                    {
                        "en": "I'm zapping through (= reading very fast) some modern novels at the moment.",
                        "vi": "Tôi đang đọc lướt qua (= đọc rất nhanh) một số tiểu thuyết hiện đại vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use the remote control to change television channels quickly",
                    "vi": "sử dụng điều khiển từ xa để thay đổi các kênh truyền hình một cách nhanh chóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move, or make somebody/something move, very fast in the direction mentioned",
                    "vi": "để di chuyển, hoặc làm cho ai đó / cái gì đó di chuyển, rất nhanh theo hướng đã đề cập"
                },
                "examples": [
                    {
                        "en": "The racing cars zapped past us.",
                        "vi": "Những chiếc xe đua lao qua chúng tôi."
                    }
                ]
            }
        ]
    }
]