[
    {
        "id": "c8df272ea0674f94a7a3392366891a3d",
        "word": "afraid",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/əˈfreɪd/",
            "us": "/əˈfreɪd/"
        },
        "nearby": [
            {
                "word": "a fortiori",
                "pos": "adverb"
            },
            {
                "word": "afoul",
                "pos": "adverb"
            },
            {
                "word": "afraid",
                "pos": "adjective"
            },
            {
                "word": "A-frame",
                "pos": "noun"
            },
            {
                "word": "A-frame tent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling fear; frightened because you think that you might be hurt or suffer",
                    "vi": "cảm thấy sợ hãi; sợ hãi vì bạn nghĩ rằng bạn có thể bị tổn thương hoặc đau khổ"
                },
                "examples": [
                    {
                        "en": "Don't be afraid.",
                        "vi": "Đừng sợ."
                    },
                    {
                        "en": "afraid of somebody/something It's all over. There's nothing to be afraid of now.",
                        "vi": "sợ ai đó / cái gì đó Tất cả đã kết thúc. Không có gì phải sợ bây giờ."
                    },
                    {
                        "en": "He had always been afraid of death.",
                        "vi": "Anh luôn sợ hãi cái chết."
                    },
                    {
                        "en": "They know I'm afraid of heights.",
                        "vi": "Họ biết tôi sợ độ cao."
                    },
                    {
                        "en": "Are you afraid of spiders?",
                        "vi": "Bạn có sợ những con nhện không?"
                    },
                    {
                        "en": "afraid of doing something I started to feel afraid of going out alone at night.",
                        "vi": "sợ phải làm gì đó Tôi bắt đầu cảm thấy sợ đi ra ngoài một mình vào ban đêm."
                    },
                    {
                        "en": "afraid to do something She was afraid to open the door.",
                        "vi": "sợ làm điều gì đó Cô sợ mở cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "worried about what might happen",
                    "vi": "lo lắng về những gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "afraid of doing something She was afraid of upsetting her parents.",
                        "vi": "sợ làm điều gì đó Cô sợ làm cha mẹ buồn."
                    },
                    {
                        "en": "Tamsin was afraid of making a fool of herself.",
                        "vi": "Tamsin sợ mình tự làm một trò ngu ngốc."
                    },
                    {
                        "en": "afraid to do something Don't be afraid to ask if you don't understand.",
                        "vi": "ngại làm điều gì đó Đừng ngại hỏi nếu bạn không hiểu."
                    },
                    {
                        "en": "The boy wasn’t afraid to say what he believed.",
                        "vi": "Cậu bé không ngại nói ra những gì mình tin tưởng."
                    },
                    {
                        "en": "He certainly isn't afraid to speak his mind.",
                        "vi": "Anh ấy chắc chắn không ngại nói ra suy nghĩ của mình."
                    },
                    {
                        "en": "afraid (that…) We were afraid (that) we were going to capsize the boat.",
                        "vi": "sợ (cái đó…) Chúng tôi sợ (cái đó) chúng tôi sẽ lật thuyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "worried or frightened that something unpleasant, dangerous, etc. will happen to a particular person or thing",
                    "vi": "lo lắng hoặc sợ hãi rằng điều gì đó khó chịu, nguy hiểm, v.v. sẽ xảy ra với một người hoặc một vật cụ thể"
                },
                "examples": [
                    {
                        "en": "I'm not afraid for me, but for the baby.",
                        "vi": "Tôi không sợ cho tôi, nhưng cho đứa bé."
                    },
                    {
                        "en": "Roger was very afraid for her.",
                        "vi": "Roger đã rất lo sợ cho cô ấy."
                    },
                    {
                        "en": "They had already fired three people and he was afraid for his job.",
                        "vi": "Họ đã sa thải ba người và anh ta lo sợ cho công việc của mình."
                    },
                    {
                        "en": "to be afraid for somebody's life/safety",
                        "vi": "lo sợ cho tính mạng / sự an toàn của ai đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a polite way of telling somebody something that is unpleasant or disappointing, or that you are sorry about",
                    "vi": "được sử dụng như một cách lịch sự để nói với ai đó điều gì đó khó chịu hoặc thất vọng, hoặc rằng bạn xin lỗi về"
                },
                "examples": [
                    {
                        "en": "I can't help you, I'm afraid.",
                        "vi": "Tôi không thể giúp bạn, tôi sợ."
                    },
                    {
                        "en": "I'm afraid we can't come.",
                        "vi": "Tôi e rằng chúng tôi không thể đến."
                    },
                    {
                        "en": "I'm afraid that it's not finished yet.",
                        "vi": "Tôi e rằng nó vẫn chưa kết thúc."
                    },
                    {
                        "en": "He's no better, I'm afraid to say.",
                        "vi": "Anh ấy không khá hơn, tôi sợ phải nói."
                    },
                    {
                        "en": "‘Is there any left?’ ‘I'm afraid not.’",
                        "vi": "Còn lại không?' \"Tôi e là không.\""
                    },
                    {
                        "en": "‘Will it hurt?’ ‘I'm afraid so.’",
                        "vi": "Nó sẽ làm tổn thương?' 'E rằng như vậy.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c70f5e63f1348799e1fc50632d77fe3",
        "word": "fear",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/fɪə(r)/",
            "us": "/fɪr/"
        },
        "nearby": [
            {
                "word": "fealty",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            },
            {
                "word": "fearful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be frightened of somebody/something or frightened of doing something",
                    "vi": "sợ hãi ai đó / điều gì đó hoặc sợ hãi khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "fear somebody/something All his employees fear him.",
                        "vi": "sợ ai đó / điều gì đó Tất cả nhân viên của anh ta đều sợ anh ta."
                    },
                    {
                        "en": "They have reason to fear the police.",
                        "vi": "Họ có lý do để sợ cảnh sát."
                    },
                    {
                        "en": "to fear death/persecution/the unknown",
                        "vi": "sợ chết / bắt bớ / điều chưa biết"
                    },
                    {
                        "en": "Everyone feared the coming war.",
                        "vi": "Mọi người đều lo sợ cuộc chiến sắp tới."
                    },
                    {
                        "en": "propaganda designed to make us hate and fear the enemy",
                        "vi": "tuyên truyền được thiết kế để khiến chúng ta căm thù và sợ hãi kẻ thù"
                    },
                    {
                        "en": "Don't worry, you have nothing to fear from us.",
                        "vi": "Đừng lo lắng, bạn không có gì phải sợ chúng tôi."
                    },
                    {
                        "en": "fear to do something (formal) She feared to tell him the truth.",
                        "vi": "sợ phải làm điều gì đó (trang trọng) Cô sợ phải nói cho anh ta biết sự thật."
                    },
                    {
                        "en": "fear doing something (formal) She feared going out at night.",
                        "vi": "sợ làm điều gì đó (trang trọng) Cô ấy sợ phải ra ngoài vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel that something bad might have happened or might happen in the future",
                    "vi": "cảm thấy rằng điều gì đó tồi tệ có thể đã xảy ra hoặc có thể xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "fear something She has been missing for three days now and police are beginning to fear the worst (= think that she is dead).",
                        "vi": "sợ điều gì đó Cô ấy đã mất tích ba ngày nay và cảnh sát bắt đầu lo sợ điều tồi tệ nhất (= nghĩ rằng cô ấy đã chết)."
                    },
                    {
                        "en": "The government feared a backlash from farmers.",
                        "vi": "Chính phủ lo ngại phản ứng dữ dội từ nông dân."
                    },
                    {
                        "en": "fear (that)… Experts fear that terrorists could use the internet to launch attacks.",
                        "vi": "sợ hãi (điều đó)… Các chuyên gia lo ngại rằng những kẻ khủng bố có thể sử dụng internet để thực hiện các cuộc tấn công."
                    },
                    {
                        "en": "They rightly feared that presidents, like kings, might abuse their power.",
                        "vi": "Họ thực sự sợ rằng các tổng thống, giống như các vị vua, có thể lạm dụng quyền lực của họ."
                    },
                    {
                        "en": "He genuinely feared his life was at risk.",
                        "vi": "Anh thực sự lo sợ cuộc sống của mình gặp rủi ro."
                    },
                    {
                        "en": "fear doing something The company feared losing its tax breaks.",
                        "vi": "sợ làm điều gì đó Công ty lo sợ bị mất các khoản giảm thuế."
                    },
                    {
                        "en": "be feared to be/have something Women and children are feared to be among the victims.",
                        "vi": "sợ là / có một cái gì đó Phụ nữ và trẻ em sợ là một trong những nạn nhân."
                    },
                    {
                        "en": "The death toll is not as bad as initially feared.",
                        "vi": "Số người chết không quá tệ như lo ngại ban đầu."
                    },
                    {
                        "en": "it is feared (that)… It is feared (that) he may have been kidnapped.",
                        "vi": "nó sợ (điều đó)… Nó sợ (rằng) anh ta có thể đã bị bắt cóc."
                    },
                    {
                        "en": "It was feared that unemployment could rise.",
                        "vi": "Người ta sợ rằng tỷ lệ thất nghiệp có thể tăng lên."
                    },
                    {
                        "en": "fear somebody/something + adj. Hundreds of people are feared dead.",
                        "vi": "sợ ai đó / cái gì đó + adj. Hàng trăm người được cho là đã chết."
                    },
                    {
                        "en": "Never fear/Fear not (= Don’t worry), I shall return.",
                        "vi": "Không bao giờ sợ hãi / Đừng sợ hãi (= Đừng lo lắng), tôi sẽ trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you think that something bad has happened or is true",
                    "vi": "được sử dụng để nói với ai đó rằng bạn nghĩ rằng điều gì đó tồi tệ đã xảy ra hoặc là sự thật"
                },
                "examples": [
                    {
                        "en": "They are unlikely to get here on time, I fear.",
                        "vi": "Tôi sợ rằng họ khó có thể đến đây đúng giờ."
                    },
                    {
                        "en": "‘He must be dead then?’ ‘I fear so.’",
                        "vi": "Chắc anh ấy chết rồi?' 'Tôi sợ như vậy.'"
                    },
                    {
                        "en": "‘She's not coming back?’ ‘I fear not.’",
                        "vi": "Cô ấy không quay lại?' \"Tôi sợ là không.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "people with little experience try to do the difficult or dangerous things that more experienced people would not consider doing",
                    "vi": "những người có ít kinh nghiệm cố gắng làm những việc khó khăn hoặc nguy hiểm mà những người có kinh nghiệm hơn sẽ không cho là làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d03fe7f219f44c588f31d29f0403f3b6",
        "word": "phobia",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfəʊbiə/",
            "us": "/ˈfəʊbiə/"
        },
        "nearby": [
            {
                "word": "phlox",
                "pos": "noun"
            },
            {
                "word": "-phobe",
                "pos": "combining form"
            },
            {
                "word": "phobia",
                "pos": "noun"
            },
            {
                "word": "phobic",
                "pos": "noun"
            },
            {
                "word": "phobic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong unreasonable fear of something",
                    "vi": "một nỗi sợ hãi phi lý mạnh mẽ về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He has a phobia about flying.",
                        "vi": "Anh ấy có một nỗi ám ảnh về việc bay."
                    },
                    {
                        "en": "One of the symptoms of the disease is water phobia.",
                        "vi": "Một trong những triệu chứng của bệnh là chứng sợ nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in nouns) a strong unreasonable fear of or feeling of hate for a particular thing",
                    "vi": "(trong danh từ) nỗi sợ hãi vô lý hoặc cảm giác ghét một điều cụ thể"
                },
                "examples": [
                    {
                        "en": "claustrophobia (= fear of being in a small closed space)",
                        "vi": "clustrophobia (= sợ ở trong một không gian nhỏ đóng cửa)"
                    },
                    {
                        "en": "xenophobia (= strong dislike or fear of people from other countries)",
                        "vi": "bài ngoại (= cực kỳ không thích hoặc sợ hãi những người từ các quốc gia khác)"
                    }
                ]
            }
        ]
    },
    {
        "id": "e2872d9741b4473981adfebe274469e1",
        "word": "dreadful",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdredfl/",
            "us": "/ˈdredfl/"
        },
        "nearby": [
            {
                "word": "dread",
                "pos": "adjective"
            },
            {
                "word": "dreaded",
                "pos": "adjective"
            },
            {
                "word": "dreadful",
                "pos": "adjective"
            },
            {
                "word": "dreadfully",
                "pos": "adverb"
            },
            {
                "word": "dreadlocks",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very bad or unpleasant",
                    "vi": "rất tệ hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "What dreadful weather!",
                        "vi": "Thời tiết nào đáng sợ!"
                    },
                    {
                        "en": "What a dreadful thing to say!",
                        "vi": "Thật là một điều đáng sợ để nói!"
                    },
                    {
                        "en": "It's dreadful the way they treat their staff.",
                        "vi": "Thật kinh khủng khi họ đối xử với nhân viên của mình."
                    },
                    {
                        "en": "How dreadful!",
                        "vi": "Thật oái oăm!"
                    },
                    {
                        "en": "Jane looked dreadful (= looked ill or tired).",
                        "vi": "Jane trông thật đáng sợ (= trông ốm yếu hoặc mệt mỏi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize how bad something is",
                    "vi": "được sử dụng để nhấn mạnh điều gì đó tồi tệ như thế nào"
                },
                "examples": [
                    {
                        "en": "He’s a dreadful snob.",
                        "vi": "Anh ta là một kẻ hợm hĩnh đáng sợ."
                    },
                    {
                        "en": "She's making a dreadful mess of things.",
                        "vi": "Cô ấy đang tạo ra một mớ hỗn độn khủng khiếp."
                    },
                    {
                        "en": "I'm afraid there's been a dreadful mistake.",
                        "vi": "Tôi e rằng đã có một sai lầm khủng khiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "causing fear, pain or difficulty",
                    "vi": "gây ra sợ hãi, đau đớn hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "a dreadful accident",
                        "vi": "một tai nạn kinh hoàng"
                    },
                    {
                        "en": "They suffered dreadful injuries.",
                        "vi": "Họ đã phải chịu đựng những vết thương đáng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a2cb2c2148941a9bbfc6c8d96a09e7e",
        "word": "panic",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpænɪk/",
            "us": "/ˈpænɪk/"
        },
        "nearby": [
            {
                "word": "panhandler",
                "pos": "noun"
            },
            {
                "word": "panic",
                "pos": "noun"
            },
            {
                "word": "panic",
                "pos": "verb"
            },
            {
                "word": "panic button",
                "pos": "noun"
            },
            {
                "word": "panic buying",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to suddenly feel frightened so that you cannot think clearly and you say or do something stupid, dangerous, etc.; to make somebody do this",
                    "vi": "đột nhiên cảm thấy sợ hãi đến mức bạn không thể suy nghĩ rõ ràng và bạn nói hoặc làm điều gì đó ngu ngốc, nguy hiểm, v.v.; để khiến ai đó làm điều này"
                },
                "examples": [
                    {
                        "en": "I panicked when I saw smoke coming out of the engine.",
                        "vi": "Tôi hốt hoảng khi thấy khói bốc ra từ động cơ."
                    },
                    {
                        "en": "panic somebody/something The gunfire panicked the horses.",
                        "vi": "làm hoảng sợ ai đó / cái gì đó Tiếng súng làm lũ ngựa hoảng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ffa36c0b947456c9eda535f0863055d",
        "word": "scare",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/skeə(r)/",
            "us": "/sker/"
        },
        "nearby": [
            {
                "word": "scarcity",
                "pos": "noun"
            },
            {
                "word": "scare",
                "pos": "verb"
            },
            {
                "word": "scare",
                "pos": "noun"
            },
            {
                "word": "scare away",
                "pos": "phrasal verb"
            },
            {
                "word": "scarecrow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which a lot of people are anxious or frightened about something",
                    "vi": "một tình huống trong đó nhiều người lo lắng hoặc sợ hãi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "a health scare",
                        "vi": "một nỗi sợ hãi về sức khỏe"
                    },
                    {
                        "en": "recent scares about pesticides in food",
                        "vi": "những lo sợ gần đây về thuốc trừ sâu trong thực phẩm"
                    },
                    {
                        "en": "a scare story (= a news report that spreads more anxiety or fear about something than is necessary)",
                        "vi": "một câu chuyện sợ hãi (= một bản tin lan truyền sự lo lắng hoặc sợ hãi về điều gì đó nhiều hơn mức cần thiết)"
                    },
                    {
                        "en": "to cause a major scare",
                        "vi": "gây ra một nỗi sợ hãi lớn"
                    },
                    {
                        "en": "scare tactics (= ways of persuading people to do something by frightening them)",
                        "vi": "chiến thuật hù dọa (= cách thuyết phục mọi người làm điều gì đó bằng cách làm họ sợ hãi)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden feeling of fear",
                    "vi": "một cảm giác sợ hãi đột ngột"
                },
                "examples": [
                    {
                        "en": "You gave me a scare!",
                        "vi": "Bạn đã cho tôi một nỗi sợ hãi!"
                    },
                    {
                        "en": "We've had quite a scare.",
                        "vi": "Chúng tôi đã có khá nhiều sợ hãi."
                    }
                ]
            }
        ]
    },
    {
        "id": "a1ef018db52e49978f44f1c3f5a5a865",
        "word": "scream",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/skriːm/",
            "us": "/skriːm/"
        },
        "nearby": [
            {
                "word": "scrawl",
                "pos": "noun"
            },
            {
                "word": "scrawny",
                "pos": "adjective"
            },
            {
                "word": "scream",
                "pos": "verb"
            },
            {
                "word": "scream",
                "pos": "noun"
            },
            {
                "word": "screamingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a loud, high shout, because you are hurt, frightened, excited, etc.",
                    "vi": "hét to và cao vì bạn bị tổn thương, sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "He covered her mouth to stop her from screaming.",
                        "vi": "Anh bịt miệng cô để ngăn cô hét lên."
                    },
                    {
                        "en": "I wanted to run screaming from the room.",
                        "vi": "Tôi muốn chạy ra khỏi phòng để hét lên."
                    },
                    {
                        "en": "scream in/with something The kids were screaming with excitement.",
                        "vi": "hét vào / với một cái gì đó Những đứa trẻ đang hét lên vì phấn khích."
                    },
                    {
                        "en": "I screamed in pain.",
                        "vi": "Tôi đau đớn hét lên."
                    },
                    {
                        "en": "The man screamed in agony and collapsed.",
                        "vi": "Người đàn ông hét lên trong đau đớn và gục xuống."
                    },
                    {
                        "en": "He heard a few of the children screaming with laughter.",
                        "vi": "Anh nghe thấy một vài đứa trẻ đang hét lên vì cười."
                    },
                    {
                        "en": "scream out in/with something People ran for the exits, screaming out in terror.",
                        "vi": "hét lên trong / với một cái gì đó Mọi người chạy tìm lối ra, hét lên vì kinh hoàng."
                    },
                    {
                        "en": "scream out The boy screamed out, as he felt a man's hand grab his arm.",
                        "vi": "hét lên Cậu bé hét lên, khi cậu cảm thấy một bàn tay của một người đàn ông đang nắm lấy cánh tay cậu."
                    },
                    {
                        "en": "scream yourself + adj. The baby was screaming itself hoarse.",
                        "vi": "tự hét lên + adj. Đứa bé tự la hét đến khản cả cổ."
                    },
                    {
                        "en": "screaming fans",
                        "vi": "người hâm mộ la hét"
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout something in a loud, high voice because of fear, anger, etc.",
                    "vi": "hét lên một điều gì đó với giọng to và cao vì sợ hãi, tức giận, v.v."
                },
                "examples": [
                    {
                        "en": "+ speech ‘Help!’ she screamed.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "'Go away!' I screamed at the top of my voice (= as loudly as possible).",
                        "vi": "Biến đi!' Tôi hét lên ở đầu giọng của mình (= càng to càng tốt)."
                    },
                    {
                        "en": "scream (out) for something/somebody Someone was screaming for help.",
                        "vi": "la hét (ra) cho một cái gì đó / ai đó Ai đó đang la hét để được giúp đỡ."
                    },
                    {
                        "en": "scream at somebody to do something He screamed at me to stop.",
                        "vi": "hét lên với ai đó làm điều gì đó. Anh ấy hét lên với tôi để dừng lại."
                    },
                    {
                        "en": "scream at somebody Everyone started screaming at each other.",
                        "vi": "hét vào mặt ai đó Mọi người bắt đầu la hét với nhau."
                    },
                    {
                        "en": "She started screaming and shouting at me.",
                        "vi": "Cô ấy bắt đầu la hét và quát tháo tôi."
                    },
                    {
                        "en": "He screamed hysterically at me.",
                        "vi": "Anh ta hét lên một cách cuồng loạn với tôi."
                    },
                    {
                        "en": "scream something (out) (at somebody) She screamed abuse at him.",
                        "vi": "hét lên cái gì đó (ra ngoài) (với ai đó) Cô ấy la hét lạm dụng vào anh ta."
                    },
                    {
                        "en": "She screamed out abuse at him.",
                        "vi": "Cô hét lên sự lạm dụng vào anh ta."
                    },
                    {
                        "en": "I started pounding on the door screaming my lungs out (= as loud and long as possible).",
                        "vi": "Tôi bắt đầu đập cửa hét toáng lên (= càng to và càng lâu càng tốt)."
                    },
                    {
                        "en": "He screamed his head off (= screamed very loudly and angrily) at me.",
                        "vi": "Anh ta hét lên đầu (= hét rất to và tức giận) vào tôi."
                    },
                    {
                        "en": "scream (out) that… His sister screamed out that he was crazy.",
                        "vi": "hét (ra) rằng… Em gái anh ta hét lên rằng anh ta bị điên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a loud, high noise; to move fast, making this noise",
                    "vi": "để tạo ra một tiếng ồn lớn, cao; di chuyển nhanh, tạo ra tiếng ồn này"
                },
                "examples": [
                    {
                        "en": "Lights flashed and sirens screamed.",
                        "vi": "Đèn nhấp nháy và còi báo động gào thét."
                    },
                    {
                        "en": "+ adv./prep. The powerboat screamed out to sea.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you drag somebody kicking and screaming to do something, they only do it with great protests because they don't really want to do it at all",
                    "vi": "nếu bạn lôi ai đó đá và la hét để làm điều gì đó, họ chỉ làm điều đó với sự phản đối kịch liệt bởi vì họ không thực sự muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "The president had to be dragged kicking and screaming to the signing ceremony.",
                        "vi": "Tổng thống đã bị kéo đá và la hét đến buổi lễ ký kết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to scream loudly and for a long time, especially in order to protest about something",
                    "vi": "hét to và trong một thời gian dài, đặc biệt là để phản đối điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8255247dda294f0f8797ccb3ffebd5e7",
        "word": "terrify",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈterɪfaɪ/",
            "us": "/ˈterɪfaɪ/"
        },
        "nearby": [
            {
                "word": "terrifically",
                "pos": "adverb"
            },
            {
                "word": "terrified",
                "pos": "adjective"
            },
            {
                "word": "terrify",
                "pos": "verb"
            },
            {
                "word": "terrifying",
                "pos": "adjective"
            },
            {
                "word": "terrifyingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel extremely frightened",
                    "vi": "làm cho ai đó cảm thấy vô cùng sợ hãi"
                },
                "examples": [
                    {
                        "en": "terrify somebody Flying terrifies her.",
                        "vi": "khiến ai đó khiếp sợ Bay làm cô ấy kinh hoàng."
                    },
                    {
                        "en": "Stop it! You’re terrifying the children!",
                        "vi": "Dừng lại! Bạn đang làm cho lũ trẻ khiếp sợ!"
                    },
                    {
                        "en": "terrify somebody into (doing) something He terrified employees at the bank into handing over cash.",
                        "vi": "khiến ai đó khiếp sợ khi làm (làm) điều gì đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e0ea2af9b524a7e97166283881cd49c",
        "word": "terrifying",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈterɪfaɪɪŋ/",
            "us": "/ˈterɪfaɪɪŋ/"
        },
        "nearby": [
            {
                "word": "terrified",
                "pos": "adjective"
            },
            {
                "word": "terrify",
                "pos": "verb"
            },
            {
                "word": "terrifying",
                "pos": "adjective"
            },
            {
                "word": "terrifyingly",
                "pos": "adverb"
            },
            {
                "word": "terrine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making somebody feel extremely frightened",
                    "vi": "khiến ai đó cảm thấy vô cùng sợ hãi"
                },
                "examples": [
                    {
                        "en": "It was a terrifying experience.",
                        "vi": "Đó là một trải nghiệm đáng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2247742004e6404186e5a1468cb7186a",
        "word": "terror",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈterə(r)/",
            "us": "/ˈterər/"
        },
        "nearby": [
            {
                "word": "territorial waters",
                "pos": "noun"
            },
            {
                "word": "territory",
                "pos": "noun"
            },
            {
                "word": "terror",
                "pos": "noun"
            },
            {
                "word": "terrorism",
                "pos": "noun"
            },
            {
                "word": "the Terrorism Act",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of extreme fear",
                    "vi": "một cảm giác sợ hãi tột độ"
                },
                "examples": [
                    {
                        "en": "a feeling of sheer/pure terror",
                        "vi": "một cảm giác tuyệt đối / hoàn toàn khủng bố"
                    },
                    {
                        "en": "Her eyes were wild with terror.",
                        "vi": "Đôi mắt cô ấy hoang dại vì kinh hãi."
                    },
                    {
                        "en": "in terror People fled from the explosion in terror.",
                        "vi": "trong kinh hoàng Mọi người chạy trốn khỏi vụ nổ trong kinh hoàng."
                    },
                    {
                        "en": "He lives in terror of (= is constantly afraid of) losing his job.",
                        "vi": "Anh ta sống trong nỗi kinh hoàng (= thường xuyên sợ hãi) mất việc."
                    },
                    {
                        "en": "Some women have a terror of losing control in the birth process.",
                        "vi": "Một số phụ nữ có nỗi kinh hoàng khi mất kiểm soát trong quá trình sinh nở."
                    },
                    {
                        "en": "(literary) The very name of the enemy struck terror into their hearts.",
                        "vi": "(văn học) Chính tên của kẻ thù đã gây ra nỗi kinh hoàng cho trái tim họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, situation or thing that makes you very afraid",
                    "vi": "một người, tình huống hoặc điều khiến bạn rất sợ"
                },
                "examples": [
                    {
                        "en": "These street gangs have become the terror of the neighbourhood.",
                        "vi": "Những băng nhóm đường phố này đã trở thành nỗi kinh hoàng của khu phố."
                    },
                    {
                        "en": "The terrors of the night were past.",
                        "vi": "Sự kinh hoàng của đêm đã qua."
                    },
                    {
                        "en": "(literary) Death holds no terrors for (= does not frighten or worry) me.",
                        "vi": "(văn học) Cái chết không làm tôi sợ hãi (= không làm tôi sợ hãi hay lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "violent action or the threat of violent action that is intended to cause fear, usually for political purposes",
                    "vi": "hành động bạo lực hoặc đe dọa thực hiện hành động bạo lực nhằm gây ra nỗi sợ hãi, thường là vì mục đích chính trị"
                },
                "examples": [
                    {
                        "en": "a campaign of terror",
                        "vi": "một chiến dịch khủng bố"
                    },
                    {
                        "en": "terror tactics/groups",
                        "vi": "chiến thuật / nhóm khủng bố"
                    },
                    {
                        "en": "The president declared a war on terror (= a campaign against the use of terror).",
                        "vi": "Tổng thống đã tuyên chiến chống khủng bố (= một chiến dịch chống lại việc sử dụng khủng bố)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person (usually a child) or an animal that causes you trouble or is difficult to control",
                    "vi": "một người (thường là trẻ em) hoặc động vật khiến bạn gặp rắc rối hoặc khó kiểm soát"
                },
                "examples": [
                    {
                        "en": "Their kids are real little terrors.",
                        "vi": "Những đứa trẻ của họ là những nỗi kinh hoàng nhỏ thực sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "637fbebf876d4c0da5f9665827496146",
        "word": "fear for",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "fear",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            },
            {
                "word": "fearful",
                "pos": "adjective"
            },
            {
                "word": "fearfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be worried about somebody/something",
                    "vi": "lo lắng về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "We fear for his safety.",
                        "vi": "Chúng tôi lo sợ cho sự an toàn của anh ấy."
                    },
                    {
                        "en": "They feared for their lives.",
                        "vi": "Họ lo sợ cho mạng sống của mình."
                    },
                    {
                        "en": "He feared for his mother, left alone on the farm.",
                        "vi": "Anh lo sợ cho mẹ mình, bỏ lại một mình trong trang trại."
                    }
                ]
            }
        ]
    },
    {
        "id": "d91cabf220ae4f61bcf227a8f0fc8c4d",
        "word": "for fear of something/of doing something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/fɪə(r)/",
            "us": "/fɪr/"
        },
        "nearby": [
            {
                "word": "FE",
                "pos": "abbreviation"
            },
            {
                "word": "fealty",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the bad feeling that you have when you are in danger or when a particular thing frightens you",
                    "vi": "cảm giác tồi tệ mà bạn có khi gặp nguy hiểm hoặc khi một điều cụ thể làm bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Her eyes showed no fear.",
                        "vi": "Đôi mắt cô ấy không hề tỏ ra sợ hãi."
                    },
                    {
                        "en": "The child was shaking with fear.",
                        "vi": "Đứa trẻ run lên vì sợ hãi."
                    },
                    {
                        "en": "I suddenly felt gripped by fear.",
                        "vi": "Tôi đột nhiên cảm thấy sợ hãi bao trùm."
                    },
                    {
                        "en": "She nearly went crazy with fear and anxiety.",
                        "vi": "Cô gần như phát điên vì sợ hãi và lo lắng."
                    },
                    {
                        "en": "The attacks created a climate of fear.",
                        "vi": "Các cuộc tấn công đã tạo ra một bầu không khí sợ hãi."
                    },
                    {
                        "en": "Terror attacks are a tool to instil fear in the public.",
                        "vi": "Các cuộc tấn công khủng bố là một công cụ để gieo rắc nỗi sợ hãi trong công chúng."
                    },
                    {
                        "en": "He managed to overcome his fears.",
                        "vi": "Anh ấy đã vượt qua được nỗi sợ hãi của mình."
                    },
                    {
                        "en": "fear of somebody/something Fear of crime can affect people's lives.",
                        "vi": "sợ hãi ai đó / điều gì đó Sợ hãi tội phạm có thể ảnh hưởng đến cuộc sống của mọi người."
                    },
                    {
                        "en": "in fear of somebody/something We lived in constant fear of losing our jobs.",
                        "vi": "sợ hãi ai đó / điều gì đó Chúng tôi đã sống trong nỗi sợ hãi thường xuyên bị mất việc làm."
                    },
                    {
                        "en": "without fear of somebody/something Women should be able to work without fear of harassment.",
                        "vi": "mà không sợ ai đó / điều gì đó Phụ nữ có thể làm việc mà không sợ bị quấy rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of concern about somebody's safety or about something bad that might happen",
                    "vi": "cảm giác lo lắng về sự an toàn của ai đó hoặc về điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The doctor's report confirmed our worst fears.",
                        "vi": "Báo cáo của bác sĩ đã xác nhận nỗi sợ hãi tồi tệ nhất của chúng tôi."
                    },
                    {
                        "en": "Police tried hard to allay the fears of local residents.",
                        "vi": "Cảnh sát đã cố gắng hết sức để xoa dịu nỗi sợ hãi của cư dân địa phương."
                    },
                    {
                        "en": "fear for somebody/something her fears for her son’s safety",
                        "vi": "nỗi sợ hãi cho ai đó / điều gì đó cô ấy lo sợ cho sự an toàn của con trai mình"
                    },
                    {
                        "en": "Alan spoke of his fears for the future.",
                        "vi": "Alan nói về nỗi sợ hãi của anh ấy đối với tương lai."
                    },
                    {
                        "en": "fear that… the fear that he had cancer",
                        "vi": "sợ rằng ... sợ rằng anh ấy bị ung thư"
                    },
                    {
                        "en": "The announcement sparked fears that interest rates will rise.",
                        "vi": "Thông báo này làm dấy lên lo ngại rằng lãi suất sẽ tăng."
                    },
                    {
                        "en": "amid fears The government announced the new measures amid growing security fears.",
                        "vi": "trong bối cảnh lo ngại Chính phủ công bố các biện pháp mới trong bối cảnh lo ngại về an ninh ngày càng gia tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid the danger of something happening",
                    "vi": "để tránh nguy hiểm của một cái gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "We spoke quietly for fear of waking the guards.",
                        "vi": "Chúng tôi nói nhỏ vì sợ lính canh đánh thức."
                    },
                    {
                        "en": "I had to run away for fear (that) he might one day kill me.",
                        "vi": "Tôi đã phải bỏ chạy vì sợ (rằng) một ngày nào đó anh ta có thể giết tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling frightened that you might be killed",
                    "vi": "cảm thấy sợ hãi rằng bạn có thể bị giết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you definitely do not want to do something",
                    "vi": "từng nói rằng bạn chắc chắn không muốn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Are you coming climbing?’ ‘No fear!’",
                        "vi": "Bạn có đang leo núi không?' 'Đừng sợ!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened, especially in order to make them do something",
                    "vi": "khiến ai đó rất sợ hãi, đặc biệt là để khiến họ làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a fair way",
                    "vi": "một cách công bằng"
                },
                "examples": [
                    {
                        "en": "They undertook to make their judgement without fear or favour.",
                        "vi": "Họ tiến hành đưa ra phán quyết của họ mà không sợ hãi hoặc thuận lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "e878f9e58bc5422db422db1bafb36034",
        "word": "fright",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fraɪt/",
            "us": "/fraɪt/"
        },
        "nearby": [
            {
                "word": "frigate bird",
                "pos": "noun"
            },
            {
                "word": "frigging",
                "pos": "adverb, adjective"
            },
            {
                "word": "fright",
                "pos": "noun"
            },
            {
                "word": "frighten",
                "pos": "verb"
            },
            {
                "word": "frighten away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of fear",
                    "vi": "một cảm giác sợ hãi"
                },
                "examples": [
                    {
                        "en": "She cried out in fright.",
                        "vi": "Cô sợ hãi kêu lên."
                    },
                    {
                        "en": "He was shaking with fright.",
                        "vi": "Anh ấy run lên vì sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an experience that makes you feel fear",
                    "vi": "một trải nghiệm khiến bạn cảm thấy sợ hãi"
                },
                "examples": [
                    {
                        "en": "You gave me a fright jumping out at me like that.",
                        "vi": "Bạn đã làm cho tôi sợ hãi khi nhảy ra với tôi như vậy."
                    },
                    {
                        "en": "I got the fright of my life.",
                        "vi": "Tôi đã nhận được nỗi sợ hãi của cuộc đời mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look ugly or silly",
                    "vi": "trông xấu xí hoặc ngớ ngẩn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be frightened by something",
                    "vi": "sợ hãi bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The birds took fright and flew off.",
                        "vi": "Những con chim hoảng sợ và bay đi."
                    },
                    {
                        "en": "Investors took fright at the falling market.",
                        "vi": "Các nhà đầu tư tỏ ra lo sợ trước thị trường giảm điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbb1b4c608334fa8a63b702c4c5820d0",
        "word": "frozen",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfrəʊzn/",
            "us": "/ˈfrəʊzn/"
        },
        "nearby": [
            {
                "word": "frowsty",
                "pos": "adjective"
            },
            {
                "word": "froze",
                "pos": "verb"
            },
            {
                "word": "frozen",
                "pos": "adjective"
            },
            {
                "word": "frozen",
                "pos": "verb"
            },
            {
                "word": "FRS",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "kept at a very low temperature in order to preserve it",
                    "vi": "được giữ ở nhiệt độ rất thấp để bảo quản"
                },
                "examples": [
                    {
                        "en": "frozen peas/fish/pizza",
                        "vi": "đậu Hà Lan / cá / pizza đông lạnh"
                    },
                    {
                        "en": "frozen yogurt/desserts",
                        "vi": "sữa chua đông lạnh / món tráng miệng"
                    },
                    {
                        "en": "a major producer of canned and frozen foods",
                        "vi": "nhà sản xuất thực phẩm đóng hộp và đông lạnh lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely cold",
                    "vi": "vô cùng lạnh"
                },
                "examples": [
                    {
                        "en": "I'm absolutely frozen!",
                        "vi": "Tôi hoàn toàn bị đóng băng!"
                    },
                    {
                        "en": "My hands are frozen.",
                        "vi": "Tay tôi như bị đóng băng."
                    },
                    {
                        "en": "He fumbled in his pocket with frozen fingers.",
                        "vi": "Anh sờ soạng trong túi với những ngón tay đông cứng."
                    },
                    {
                        "en": "You look frozen stiff.",
                        "vi": "Trông bạn có vẻ cứng đơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a layer of ice on the surface",
                    "vi": "với một lớp băng trên bề mặt"
                },
                "examples": [
                    {
                        "en": "There were skaters on the frozen river.",
                        "vi": "Có những người trượt ván trên dòng sông đóng băng."
                    },
                    {
                        "en": "The surface of the lake is permanently frozen.",
                        "vi": "Mặt hồ bị đóng băng vĩnh viễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "covered with ice; so cold that it has become very hard",
                    "vi": "phủ đầy băng; lạnh đến mức nó trở nên rất cứng"
                },
                "examples": [
                    {
                        "en": "The ground was frozen solid.",
                        "vi": "Mặt đất đông cứng."
                    },
                    {
                        "en": "They adapted to the harsh conditions of the frozen north.",
                        "vi": "Chúng thích nghi với điều kiện khắc nghiệt của miền bắc băng giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to move because of a strong emotion such as fear or horror",
                    "vi": "không thể di chuyển vì một cảm xúc mạnh như sợ hãi hoặc kinh hoàng"
                },
                "examples": [
                    {
                        "en": "frozen with something She stared at him, frozen with shock.",
                        "vi": "cô ấy nhìn chằm chằm vào anh ta, đông cứng vì sốc."
                    },
                    {
                        "en": "frozen in something His white face was frozen in fear.",
                        "vi": "bị đóng băng trong một cái gì đó Khuôn mặt trắng bệch của anh ấy đã bị đóng băng vì sợ hãi."
                    },
                    {
                        "en": "I stood frozen to the spot, unable to speak.",
                        "vi": "Tôi đứng đơ ra tại chỗ, không nói được lời nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "534331738e4c42c4b4ba3fb499ad9990",
        "word": "hysteria",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/hɪˈstɪəriə/",
            "us": "/hɪˈsteriə/"
        },
        "nearby": [
            {
                "word": "hyssop",
                "pos": "noun"
            },
            {
                "word": "hysterectomy",
                "pos": "noun"
            },
            {
                "word": "hysteria",
                "pos": "noun"
            },
            {
                "word": "hysterical",
                "pos": "adjective"
            },
            {
                "word": "hysterically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state of extreme excitement, fear or anger in which a person, or a group of people, loses control of their emotions and starts to cry, laugh, etc.",
                    "vi": "trạng thái cực kỳ phấn khích, sợ hãi hoặc tức giận, trong đó một người hoặc một nhóm người mất kiểm soát cảm xúc của họ và bắt đầu khóc, cười, v.v."
                },
                "examples": [
                    {
                        "en": "There was mass hysteria when the band came on stage.",
                        "vi": "Đã có sự cuồng loạn hàng loạt khi ban nhạc bước lên sân khấu."
                    },
                    {
                        "en": "A note of hysteria crept into her voice.",
                        "vi": "Một nốt nhạc cuồng loạn len lỏi trong giọng nói của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extremely excited and exaggerated way of behaving or reacting to an event",
                    "vi": "một cách hành xử hoặc phản ứng cực kỳ phấn khích và cường điệu trước một sự kiện"
                },
                "examples": [
                    {
                        "en": "the usual media hysteria that surrounds royal visits",
                        "vi": "sự cuồng loạn của phương tiện truyền thông thường xảy ra xung quanh các chuyến thăm của hoàng gia"
                    },
                    {
                        "en": "public hysteria about AIDS",
                        "vi": "sự cuồng loạn của công chúng về bệnh AIDS"
                    }
                ]
            },
            {
                "define": {
                    "en": "a condition in which somebody experiences violent or extreme emotions that they cannot control, especially as a result of shock",
                    "vi": "một tình trạng trong đó ai đó trải qua những cảm xúc bạo lực hoặc cực đoan mà họ không thể kiểm soát, đặc biệt là do sốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ffead7835ba74b6b9fac20b5816844ad",
        "word": "shaken",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃeɪkən/",
            "us": "/ˈʃeɪkən/"
        },
        "nearby": [
            {
                "word": "shake down",
                "pos": "phrasal verb"
            },
            {
                "word": "shakedown",
                "pos": "noun"
            },
            {
                "word": "shaken",
                "pos": "adjective"
            },
            {
                "word": "shake off",
                "pos": "phrasal verb"
            },
            {
                "word": "shake out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "shocked, upset or frightened by something",
                    "vi": "bị sốc, khó chịu hoặc sợ hãi bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was visibly shaken by the incidents.",
                        "vi": "Cô ấy rõ ràng đã bị chấn động bởi những sự cố."
                    },
                    {
                        "en": "He was too shaken up to drive.",
                        "vi": "Anh ta quá run để lái xe."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6b91f4967214d0baeb833126ed62db1",
        "word": "shiver",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃɪvə(r)/",
            "us": "/ˈʃɪvər/"
        },
        "nearby": [
            {
                "word": "shitstorm",
                "pos": "noun"
            },
            {
                "word": "shitty",
                "pos": "adjective"
            },
            {
                "word": "shiver",
                "pos": "verb"
            },
            {
                "word": "shiver",
                "pos": "noun"
            },
            {
                "word": "shivery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to shake slightly because you are cold, frightened, excited, etc.",
                    "vi": "rung nhẹ bởi vì bạn đang lạnh, sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "Don't stand outside shivering—come inside and get warm!",
                        "vi": "Đừng run rẩy đứng bên ngoài — hãy vào trong và sưởi ấm!"
                    },
                    {
                        "en": "He shivered at the thought of the cold, dark sea.",
                        "vi": "Anh rùng mình khi nghĩ đến biển đen lạnh giá."
                    },
                    {
                        "en": "shiver with something to shiver with cold/fear/excitement/pleasure",
                        "vi": "rùng mình với một cái gì đó để rùng mình vì lạnh / sợ hãi / phấn khích / vui sướng"
                    }
                ]
            }
        ]
    },
    {
        "id": "7564ae4314194929a2d592208d990f3f",
        "word": "be at your wits’ end",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪt/",
            "us": "/wɪt/"
        },
        "nearby": [
            {
                "word": "wistfully",
                "pos": "adverb"
            },
            {
                "word": "wistfulness",
                "pos": "noun"
            },
            {
                "word": "wit",
                "pos": "noun"
            },
            {
                "word": "witch",
                "pos": "noun"
            },
            {
                "word": "witchcraft",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to say or write things that are both clever and humorous",
                    "vi": "khả năng nói hoặc viết những điều thông minh và hài hước"
                },
                "examples": [
                    {
                        "en": "to have a quick/sharp/dry/ready wit",
                        "vi": "để có một trí thông minh nhanh chóng / sắc bén / khô khan / sẵn sàng"
                    },
                    {
                        "en": "a woman of wit and intelligence",
                        "vi": "một người phụ nữ thông minh và hóm hỉnh"
                    },
                    {
                        "en": "a book full of the wit and wisdom of his 30 years in politics",
                        "vi": "một cuốn sách đầy sự dí dỏm và thông thái trong 30 năm làm chính trị của ông"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the ability to say or write things that are both clever and humorous",
                    "vi": "một người có khả năng nói hoặc viết những điều vừa thông minh vừa hài hước"
                },
                "examples": [
                    {
                        "en": "a well-known wit and raconteur",
                        "vi": "một sự thông minh và trí tuệ nổi tiếng"
                    }
                ]
            },
            {
                "define": {
                    "en": "your ability to think quickly and clearly and to make good decisions",
                    "vi": "khả năng của bạn để suy nghĩ nhanh chóng và rõ ràng và đưa ra quyết định tốt"
                },
                "examples": [
                    {
                        "en": "He needed all his wits to find his way out.",
                        "vi": "Anh cần tất cả sự thông minh của mình để tìm ra lối thoát cho mình."
                    },
                    {
                        "en": "The game was a long battle of wits.",
                        "vi": "Trò chơi là một trận chiến đấu trí lâu dài."
                    },
                    {
                        "en": "Kate paused and gathered her wits.",
                        "vi": "Kate dừng lại và thu thập trí thông minh của mình."
                    },
                    {
                        "en": "a chance to pit your wits against (= compete with, using your intelligence) our quiz champion",
                        "vi": "một cơ hội để đánh bại trí thông minh của bạn chống lại (= cạnh tranh, sử dụng trí thông minh của bạn) nhà vô địch câu đố của chúng tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of intelligence mentioned",
                    "vi": "có loại thông minh được đề cập"
                },
                "examples": [
                    {
                        "en": "a quick-witted group of students",
                        "vi": "một nhóm sinh viên nhanh trí"
                    }
                ]
            },
            {
                "define": {
                    "en": "the intelligence or good sense to know what is the right thing to do",
                    "vi": "trí thông minh hoặc ý thức tốt để biết điều gì là đúng đắn để làm"
                },
                "examples": [
                    {
                        "en": "At least you had the wit to ask for help.",
                        "vi": "Ít nhất bạn đã có sự thông minh để yêu cầu sự giúp đỡ."
                    },
                    {
                        "en": "It should not be beyond the wit of man to resolve this dispute.",
                        "vi": "Nó không nên vượt quá sự thông minh của con người để giải quyết tranh chấp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be so worried by a problem that you do not know what to do next",
                    "vi": "lo lắng bởi một vấn đề mà bạn không biết phải làm gì tiếp theo"
                },
                "examples": [
                    {
                        "en": "She was at her wits’ end wondering how she’d manage it all in the time.",
                        "vi": "Cô đang ở trong đầu tự hỏi làm thế nào cô sẽ xoay sở tất cả trong thời gian này."
                    },
                    {
                        "en": "I'm at my wits' end trying to cope with his moods.",
                        "vi": "Tôi đang cố gắng đối phó với tâm trạng của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very frightened; to frighten somebody very much",
                    "vi": "rất sợ hãi; làm ai đó sợ hãi rất nhiều"
                },
                "examples": [
                    {
                        "en": "I was scared out of my wits!",
                        "vi": "Tôi sợ hết hồn!"
                    },
                    {
                        "en": "The latest news has scared the wits out of investors.",
                        "vi": "Tin tức mới nhất đã khiến các nhà đầu tư sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be aware of what is happening around you and ready to think and act quickly",
                    "vi": "nhận thức được những gì đang xảy ra xung quanh bạn và sẵn sàng suy nghĩ và hành động nhanh chóng"
                },
                "examples": [
                    {
                        "en": "They do tough interviews so you'll need to have your wits about you.",
                        "vi": "Họ thực hiện các cuộc phỏng vấn khó khăn, vì vậy bạn sẽ cần phải có sự thông minh của bạn về bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to earn money by clever or sometimes dishonest means",
                    "vi": "kiếm tiền bằng những cách thông minh hoặc đôi khi không trung thực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you use to wit when you are about to be more exact about something that you have just referred to",
                    "vi": "bạn sử dụng để thông minh khi bạn muốn chính xác hơn về một cái gì đó mà bạn vừa đề cập đến"
                },
                "examples": [
                    {
                        "en": "Pilot error, to wit failure to follow procedures, was the cause of the accident.",
                        "vi": "Lỗi của phi công, do không tuân thủ các quy trình, là nguyên nhân của vụ tai nạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "56a207ee544d44088a5b7d207cbee8a8",
        "word": "be frightened/nervous/scared of your own shadow",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃædəʊ/",
            "us": "/ˈʃædəʊ/"
        },
        "nearby": [
            {
                "word": "shade tree",
                "pos": "noun"
            },
            {
                "word": "shading",
                "pos": "noun"
            },
            {
                "word": "shadow",
                "pos": "noun"
            },
            {
                "word": "shadow",
                "pos": "verb"
            },
            {
                "word": "shadow",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the dark shape that somebody/something’s form makes on a surface, for example on the ground, when they are between the light and the surface",
                    "vi": "hình dạng tối tăm mà hình dạng của ai đó / thứ gì đó tạo ra trên bề mặt, ví dụ như trên mặt đất, khi chúng ở giữa ánh sáng và bề mặt"
                },
                "examples": [
                    {
                        "en": "The children were having fun, chasing each other's shadows.",
                        "vi": "Những đứa trẻ đang vui đùa, đuổi theo bóng của nhau."
                    },
                    {
                        "en": "As the curtains moved in the breeze, the shadows on the floor seemed to dance.",
                        "vi": "Khi rèm cửa di chuyển trong gió, bóng tối trên sàn dường như đang nhảy múa."
                    },
                    {
                        "en": "The ship's sail cast a shadow on the water.",
                        "vi": "Cánh buồm con tàu in bóng xuống mặt nước."
                    },
                    {
                        "en": "The shadows lengthened as the sun went down.",
                        "vi": "Bóng tối dài ra khi mặt trời lặn."
                    },
                    {
                        "en": "The man's face is hidden in a deep shadow cast by his umbrella.",
                        "vi": "Khuôn mặt của người đàn ông ẩn trong một cái bóng sâu hun hút bởi chiếc ô của anh ta."
                    },
                    {
                        "en": "They saw the shadow of a man pass by.",
                        "vi": "Họ nhìn thấy bóng một người đàn ông lướt qua."
                    },
                    {
                        "en": "(figurative) He didn't want to cast a shadow on (= spoil) their happiness.",
                        "vi": "(nghĩa bóng) Anh ấy không muốn phủ bóng (= làm hỏng) hạnh phúc của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "darkness in a place or on something, especially so that you cannot easily see who or what is there",
                    "vi": "bóng tối ở một nơi hoặc trên một thứ gì đó, đặc biệt để bạn không thể dễ dàng nhìn thấy ai hoặc cái gì ở đó"
                },
                "examples": [
                    {
                        "en": "in the shadows I thought I saw a figure standing in the shadows.",
                        "vi": "trong bóng tối, tôi nghĩ rằng tôi nhìn thấy một bóng người đứng trong bóng tối."
                    },
                    {
                        "en": "in shadow His face was deep in shadow, turned away from her.",
                        "vi": "trong bóng tối Khuôn mặt anh chìm trong bóng tối, quay lưng lại với cô."
                    },
                    {
                        "en": "A man in black emerged from the shadows.",
                        "vi": "Một người đàn ông mặc đồ đen xuất hiện từ trong bóng tối."
                    },
                    {
                        "en": "It had grown dark, and the shadows could be hiding anything.",
                        "vi": "Trời tối dần, và những bóng đen có thể che giấu bất cứ thứ gì."
                    },
                    {
                        "en": "It's a spooky story about the monsters that lurk in the shadows.",
                        "vi": "Đó là một câu chuyện ma quái về những con quái vật ẩn nấp trong bóng tối."
                    },
                    {
                        "en": "She shrank back into the shadows as the footsteps approached.",
                        "vi": "Cô thu mình lại trong bóng tối khi bước chân đến gần."
                    },
                    {
                        "en": "‘I'm right here,’ I said, stepping out of the shadows.",
                        "vi": "“Tôi ở ngay đây,” tôi nói, bước ra khỏi bóng tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very small amount of something",
                    "vi": "một số lượng rất nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A shadow of a smile touched his mouth.",
                        "vi": "Một bóng cười chạm vào miệng anh."
                    },
                    {
                        "en": "She knew beyond a shadow of a doubt (= with no doubt at all) that he was lying.",
                        "vi": "Cô biết ngoài một bóng tối nghi ngờ (= không nghi ngờ gì cả) rằng anh ta đang nói dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "the strong (often bad) influence of somebody/something",
                    "vi": "ảnh hưởng mạnh mẽ (thường là xấu) của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The new leader wants to escape from the shadow of his predecessor.",
                        "vi": "Nhà lãnh đạo mới muốn thoát khỏi cái bóng của người tiền nhiệm."
                    },
                    {
                        "en": "Bergman casts a long shadow over world cinema.",
                        "vi": "Bergman phủ bóng dài lên nền điện ảnh thế giới."
                    },
                    {
                        "en": "under the shadow of somebody/something These people have been living for years under the shadow of fear.",
                        "vi": "dưới cái bóng của ai đó / cái gì đó Những người này đã sống trong nhiều năm dưới cái bóng của sự sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "dark areas under somebody’s eyes, because they are tired, etc.",
                    "vi": "vùng tối dưới mắt ai đó, bởi vì họ mệt mỏi, v.v."
                },
                "examples": [
                    {
                        "en": "She looked pale, with deep shadows under her eyes.",
                        "vi": "Cô ấy trông nhợt nhạt, có bóng sâu dưới mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an animal that follows somebody else all the time",
                    "vi": "một người hoặc một con vật luôn theo dõi người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing that is not real or possible to obtain",
                    "vi": "một thứ không có thật hoặc không thể có được"
                },
                "examples": [
                    {
                        "en": "You can't spend all your life chasing shadows.",
                        "vi": "Bạn không thể dành cả đời để đuổi theo những cái bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very easily frightened; to be very nervous",
                    "vi": "rất dễ sợ hãi; rất lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not have the strength, influence, etc. that you used to have",
                    "vi": "không có sức mạnh, ảnh hưởng, v.v. mà bạn từng có"
                },
                "examples": [
                    {
                        "en": "When his career ended, he became a shadow of his former self.",
                        "vi": "Khi sự nghiệp kết thúc, anh trở thành cái bóng của chính mình trước đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "very close to",
                    "vi": "rất gần với"
                },
                "examples": [
                    {
                        "en": "The new market is in the shadow of the City Hall.",
                        "vi": "Khu chợ mới in bóng Tòa thị chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is in/under the shadow of another person, you mean that they do not receive as much attention as that person",
                    "vi": "khi bạn nói rằng ai đó đang ở trong / dưới bóng của người khác, bạn có nghĩa là họ không nhận được nhiều sự quan tâm như người đó"
                },
                "examples": [
                    {
                        "en": "A younger son often lives in the shadow of his elder brother.",
                        "vi": "Một cậu con trai nhỏ thường sống trong cái bóng của anh trai mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "be48e3d7af0e48a494ba2089030a2277",
        "word": "be scared/bored witless",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪtləs/",
            "us": "/ˈwɪtləs/"
        },
        "nearby": [
            {
                "word": "with-profit",
                "pos": "adjective"
            },
            {
                "word": "withstand",
                "pos": "verb"
            },
            {
                "word": "witless",
                "pos": "adjective"
            },
            {
                "word": "witness",
                "pos": "noun"
            },
            {
                "word": "witness",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "silly or stupid; not sensible",
                    "vi": "khờ khạo hay khờ khạo; không hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be extremely frightened or bored",
                    "vi": "cực kỳ sợ hãi hoặc buồn chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "232e5994124f4760b1eab01313013c1d",
        "word": "blanch",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/blɑːntʃ/",
            "us": "/blæntʃ/"
        },
        "nearby": [
            {
                "word": "blamelessly",
                "pos": "adverb"
            },
            {
                "word": "blameworthy",
                "pos": "adjective"
            },
            {
                "word": "blanch",
                "pos": "verb"
            },
            {
                "word": "blancmange",
                "pos": "noun"
            },
            {
                "word": "bland",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become pale because you are shocked or frightened",
                    "vi": "trở nên xanh xao vì bạn bị sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "He blanched visibly when he heard the news.",
                        "vi": "Anh ta sững sờ trông thấy khi biết tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare food, especially vegetables, by putting it into boiling water for a short time",
                    "vi": "để chế biến thực phẩm, đặc biệt là rau, bằng cách cho vào nước sôi trong thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Blanch the peas quickly before you freeze them.",
                        "vi": "Chần đậu Hà Lan nhanh chóng trước khi đông lạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "34296f52df4a456eb61b377048e5452d",
        "word": "blench",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/blentʃ/",
            "us": "/blentʃ/"
        },
        "nearby": [
            {
                "word": "blemish",
                "pos": "noun"
            },
            {
                "word": "blemish",
                "pos": "verb"
            },
            {
                "word": "blench",
                "pos": "verb"
            },
            {
                "word": "blend",
                "pos": "verb"
            },
            {
                "word": "blend",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to react to something in a way that shows you are frightened",
                    "vi": "phản ứng với điều gì đó theo cách cho thấy bạn đang sợ hãi"
                },
                "examples": [
                    {
                        "en": "He blenched when he heard her name announced.",
                        "vi": "Anh sững người khi nghe tên cô được xướng lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "46b9edbad3e7400c82b682d5b16c8e45",
        "word": "chatter",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃætə(r)/",
            "us": "/ˈtʃætər/"
        },
        "nearby": [
            {
                "word": "Chattanooga",
                "pos": ""
            },
            {
                "word": "chattel",
                "pos": "noun"
            },
            {
                "word": "chatter",
                "pos": "verb"
            },
            {
                "word": "chatter",
                "pos": "noun"
            },
            {
                "word": "chatterbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk quickly and continuously, especially about things that are not important",
                    "vi": "nói nhanh và liên tục, đặc biệt là về những thứ không quan trọng"
                },
                "examples": [
                    {
                        "en": "chatter away They chattered away happily for a while.",
                        "vi": "nói chuyện phiếm Họ nói chuyện phiếm đi một cách vui vẻ trong một thời gian."
                    },
                    {
                        "en": "chatter on He chattered on happily for about half an hour.",
                        "vi": "chatter on Anh ấy huyên thuyên vui vẻ trong khoảng nửa giờ."
                    },
                    {
                        "en": "chatter to somebody He chattered excitedly to his friends.",
                        "vi": "huyên thuyên với ai đó Anh ấy huyên thuyên hào hứng với bạn bè của mình."
                    },
                    {
                        "en": "chatter about something We chattered about work.",
                        "vi": "nói chuyện phiếm về điều gì đó Chúng ta nói chuyện phiếm về công việc."
                    },
                    {
                        "en": "chatter (away/on) (to somebody) (about something) The children chattered to each other excitedly about the next day's events.",
                        "vi": "chatter (đi / về) (với ai đó) (về điều gì đó) Bọn trẻ nói chuyện với nhau một cách hào hứng về các sự kiện của ngày hôm sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to knock together continuously because you are cold or frightened",
                    "vi": "liên tục gõ vào nhau vì bạn lạnh hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "Her teeth chattered as she dressed.",
                        "vi": "Răng cô ấy kêu lên khi cô ấy mặc quần áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a series of short high sounds",
                    "vi": "để tạo ra một loạt âm thanh cao ngắn"
                },
                "examples": [
                    {
                        "en": "The only sounds we could hear were the birds chattering in the trees.",
                        "vi": "Âm thanh duy nhất mà chúng tôi có thể nghe thấy là tiếng chim hót trên cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people in society who like to give their opinions on political or social issues",
                    "vi": "những người trong xã hội thích đưa ra ý kiến của họ về các vấn đề chính trị hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "Constitutional reform is popular among the chattering classes.",
                        "vi": "Cải cách hiến pháp là phổ biến trong các tầng lớp huyên thuyên."
                    },
                    {
                        "en": "topics being discussed at the breakfast tables of the chattering classes",
                        "vi": "chủ đề đang được thảo luận trên bàn ăn sáng của các lớp học nói chuyện phiếm"
                    }
                ]
            }
        ]
    },
    {
        "id": "66ecd1ff790745eca062f7fd90da50a9",
        "word": "chill",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɪl/",
            "us": "/tʃɪl/"
        },
        "nearby": [
            {
                "word": "chili dog",
                "pos": "noun"
            },
            {
                "word": "chill-out",
                "pos": "noun"
            },
            {
                "word": "chill",
                "pos": "noun"
            },
            {
                "word": "chill",
                "pos": "verb"
            },
            {
                "word": "chill",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being cold",
                    "vi": "một cảm giác lạnh"
                },
                "examples": [
                    {
                        "en": "There's a chill in the air this morning.",
                        "vi": "Có một không khí lạnh vào sáng nay."
                    },
                    {
                        "en": "A small fire was burning to take the chill off the room.",
                        "vi": "Một ngọn lửa nhỏ được đốt lên để xua đi cái lạnh của căn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an illness caused by being cold and wet, causing a high temperature and shivering (= shaking of the body)",
                    "vi": "một bệnh do lạnh và ẩm ướt, gây ra nhiệt độ cao và rùng mình (= cơ thể run rẩy)"
                },
                "examples": [
                    {
                        "en": "I caught a nasty chill after my swim last week.",
                        "vi": "Tôi cảm thấy ớn lạnh khó chịu sau khi đi bơi vào tuần trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of fear",
                    "vi": "một cảm giác sợ hãi"
                },
                "examples": [
                    {
                        "en": "a chill of fear/apprehension",
                        "vi": "ớn lạnh của sợ hãi / e ngại"
                    },
                    {
                        "en": "His words sent a chill down her spine.",
                        "vi": "Lời nói của anh khiến cô lạnh sống lưng."
                    },
                    {
                        "en": "The news of the disaster cast a chill over the party.",
                        "vi": "Tin tức về thảm họa làm cho bữa tiệc ớn lạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "db39a207e9fa4ffd88046e8cc808a436",
        "word": "cold sweat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkəʊld ˈswet/",
            "us": "/ˌkəʊld ˈswet/"
        },
        "nearby": [
            {
                "word": "cold store",
                "pos": "noun"
            },
            {
                "word": "the Coldstream Guards",
                "pos": ""
            },
            {
                "word": "cold sweat",
                "pos": "noun"
            },
            {
                "word": "cold turkey",
                "pos": "adverb"
            },
            {
                "word": "cold turkey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state when you have sweat on your face or body but still feel cold, usually because you are very frightened or anxious",
                    "vi": "trạng thái khi bạn đổ mồ hôi trên mặt hoặc cơ thể nhưng vẫn cảm thấy lạnh, thường là do bạn đang rất sợ hãi hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "to break out into a cold sweat",
                        "vi": "đổ mồ hôi lạnh"
                    },
                    {
                        "en": "I woke up in a cold sweat about the interview.",
                        "vi": "Tôi thức dậy trong mồ hôi lạnh về cuộc phỏng vấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "976390e824034b6db68386809b872810",
        "word": "cowed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kaʊd/",
            "us": "/kaʊd/"
        },
        "nearby": [
            {
                "word": "cowcatcher",
                "pos": "noun"
            },
            {
                "word": "cow chip",
                "pos": "noun"
            },
            {
                "word": "cowed",
                "pos": "adjective"
            },
            {
                "word": "cower",
                "pos": "verb"
            },
            {
                "word": "Cowes",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "made to feel afraid and that you are not as good as somebody else",
                    "vi": "khiến bạn cảm thấy sợ hãi và bạn không giỏi bằng người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d0725333b3f4951aa7c906f2931a46c",
        "word": "cower",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊə(r)/",
            "us": "/ˈkaʊər/"
        },
        "nearby": [
            {
                "word": "cow chip",
                "pos": "noun"
            },
            {
                "word": "cowed",
                "pos": "adjective"
            },
            {
                "word": "cower",
                "pos": "verb"
            },
            {
                "word": "Cowes",
                "pos": ""
            },
            {
                "word": "cowgirl",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to bend low and/or move backwards because you are frightened",
                    "vi": "cúi xuống thấp và / hoặc lùi về phía sau vì bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "A gun went off and people cowered behind walls and under tables.",
                        "vi": "Một khẩu súng nổ và mọi người thu mình lại sau những bức tường và gầm bàn."
                    },
                    {
                        "en": "The dog whimpered and cowered at his feet.",
                        "vi": "Con chó thút thít và co rúm lại dưới chân anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "8083f72ac9be490c84bf8ad13daa0c2c",
        "word": "creepy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkriːpi/",
            "us": "/ˈkriːpi/"
        },
        "nearby": [
            {
                "word": "creep up",
                "pos": "phrasal verb"
            },
            {
                "word": "creep up on",
                "pos": "phrasal verb"
            },
            {
                "word": "creepy",
                "pos": "adjective"
            },
            {
                "word": "creepy-crawly",
                "pos": "noun"
            },
            {
                "word": "cremains",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing an unpleasant feeling of fear or slight horror",
                    "vi": "gây ra cảm giác sợ hãi khó chịu hoặc kinh dị nhẹ"
                },
                "examples": [
                    {
                        "en": "a creepy ghost story",
                        "vi": "một câu chuyện ma rùng rợn"
                    },
                    {
                        "en": "It's kind of creepy down in the cellar!",
                        "vi": "Thật là rùng rợn khi ở dưới hầm!"
                    },
                    {
                        "en": "It feels a bit creepy in here.",
                        "vi": "Ở đây có cảm giác hơi rùng rợn."
                    }
                ]
            },
            {
                "define": {
                    "en": "strange in a way that makes you feel nervous",
                    "vi": "kỳ lạ theo cách khiến bạn cảm thấy lo lắng"
                },
                "examples": [
                    {
                        "en": "What a creepy coincidence.",
                        "vi": "Thật là một sự trùng hợp đáng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce2c858a3199461baaf8fa41de996a5d",
        "word": "curdle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɜːdl/",
            "us": "/ˈkɜːrdl/"
        },
        "nearby": [
            {
                "word": "curd",
                "pos": "noun"
            },
            {
                "word": "curd cheese",
                "pos": "noun"
            },
            {
                "word": "curdle",
                "pos": "verb"
            },
            {
                "word": "cure",
                "pos": "verb"
            },
            {
                "word": "cure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a liquid, especially milk, curdles or something curdles it, it separates into solid and liquid parts",
                    "vi": "khi chất lỏng, đặc biệt là sữa, đông lại hoặc thứ gì đó làm nó đông lại, nó sẽ phân tách thành các phần rắn và lỏng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something curdles your blood or makes your blood curdle, it makes you extremely frightened or shocked",
                    "vi": "Nếu có thứ gì đó làm máu đông lại hoặc làm cho máu đông lại, điều đó sẽ khiến bạn vô cùng sợ hãi hoặc sốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c363c0d2e4de4c96a1e9ca1994b95581",
        "word": "dreaded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdredɪd/",
            "us": "/ˈdredɪd/"
        },
        "nearby": [
            {
                "word": "dread",
                "pos": "noun"
            },
            {
                "word": "dread",
                "pos": "adjective"
            },
            {
                "word": "dreaded",
                "pos": "adjective"
            },
            {
                "word": "dreadful",
                "pos": "adjective"
            },
            {
                "word": "dreadfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing fear",
                    "vi": "gây sợ hãi"
                },
                "examples": [
                    {
                        "en": "The dreaded moment had finally arrived.",
                        "vi": "Khoảnh khắc kinh hoàng cuối cùng cũng đã đến."
                    },
                    {
                        "en": "(humorous) Did I hear the dreaded word ‘homework’?",
                        "vi": "(hài hước) Tôi có nghe thấy từ 'bài tập về nhà' đáng sợ không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "ce7aeed280b64e6ba2b56182f156db71",
        "word": "fearsome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪəsəm/",
            "us": "/ˈfɪrsəm/"
        },
        "nearby": [
            {
                "word": "fearlessly",
                "pos": "adverb"
            },
            {
                "word": "fearlessness",
                "pos": "noun"
            },
            {
                "word": "fearsome",
                "pos": "adjective"
            },
            {
                "word": "feasibility",
                "pos": "noun"
            },
            {
                "word": "feasible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making people feel very frightened",
                    "vi": "khiến mọi người cảm thấy rất sợ hãi"
                },
                "examples": [
                    {
                        "en": "a fearsome dinosaur",
                        "vi": "một con khủng long đáng sợ"
                    },
                    {
                        "en": "He has a fearsome reputation as a fighter.",
                        "vi": "Anh ta có một danh tiếng đáng sợ như một chiến binh."
                    },
                    {
                        "en": "a fearsome expression/sight",
                        "vi": "một biểu hiện / cảnh tượng đáng sợ"
                    }
                ]
            }
        ]
    },
    {
        "id": "4cf40731257a4b429bde4f5e26367222",
        "word": "flinch",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/flɪntʃ/",
            "us": "/flɪntʃ/"
        },
        "nearby": [
            {
                "word": "flimsiness",
                "pos": "noun"
            },
            {
                "word": "flimsy",
                "pos": "adjective"
            },
            {
                "word": "flinch",
                "pos": "verb"
            },
            {
                "word": "flinch from",
                "pos": "phrasal verb"
            },
            {
                "word": "flinch from doing",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a sudden movement with your face or body as a result of pain, fear, surprise, etc.",
                    "vi": "để thực hiện một chuyển động đột ngột với khuôn mặt hoặc cơ thể của bạn do đau đớn, sợ hãi, ngạc nhiên, v.v."
                },
                "examples": [
                    {
                        "en": "He met my gaze without flinching.",
                        "vi": "Anh ấy bắt gặp ánh nhìn của tôi mà không hề nao núng."
                    },
                    {
                        "en": "He didn’t even flinch (= wasn’t surprised) when I told him the price.",
                        "vi": "Anh ta thậm chí còn không nao núng (= không ngạc nhiên) khi tôi nói với anh ta giá cả."
                    },
                    {
                        "en": "flinch at something He flinched at the sight of the blood.",
                        "vi": "nao núng trước điều gì đó. Anh ta nao núng khi nhìn thấy máu."
                    },
                    {
                        "en": "flinch away She flinched away from the dog.",
                        "vi": "nao núng Cô nao núng tránh xa con chó."
                    }
                ]
            }
        ]
    },
    {
        "id": "0cfa961bdf244de7b7a5275bac443800",
        "word": "flinch from",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "flimsy",
                "pos": "adjective"
            },
            {
                "word": "flinch",
                "pos": "verb"
            },
            {
                "word": "flinch from",
                "pos": "phrasal verb"
            },
            {
                "word": "flinch from doing",
                "pos": "phrasal verb"
            },
            {
                "word": "fling",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to avoid thinking about or doing something unpleasant",
                    "vi": "để tránh nghĩ về hoặc làm điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "He never flinched from facing up to trouble.",
                        "vi": "Anh ấy không bao giờ nao núng khi đối mặt với rắc rối."
                    },
                    {
                        "en": "She won't flinch from speaking her mind.",
                        "vi": "Cô ấy sẽ không nao núng khi nói ra suy nghĩ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "00d06b94bf0c4423bad40a989d1ee570",
        "word": "flinch from doing",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "flinch",
                "pos": "verb"
            },
            {
                "word": "flinch from",
                "pos": "phrasal verb"
            },
            {
                "word": "flinch from doing",
                "pos": "phrasal verb"
            },
            {
                "word": "fling",
                "pos": "verb"
            },
            {
                "word": "fling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to avoid thinking about or doing something unpleasant",
                    "vi": "để tránh nghĩ về hoặc làm điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "He never flinched from facing up to trouble.",
                        "vi": "Anh ấy không bao giờ nao núng khi đối mặt với rắc rối."
                    },
                    {
                        "en": "She won't flinch from speaking her mind.",
                        "vi": "Cô ấy sẽ không nao núng khi nói ra suy nghĩ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e2004ba8c994032976c941c8eb584d5",
        "word": "freak",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/friːk/",
            "us": "/friːk/"
        },
        "nearby": [
            {
                "word": "freak",
                "pos": "noun"
            },
            {
                "word": "freak",
                "pos": "adjective"
            },
            {
                "word": "freak",
                "pos": "verb"
            },
            {
                "word": "freaking",
                "pos": "adverb, adjective"
            },
            {
                "word": "freakish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if somebody freaks or if something freaks them, they react very strongly to something that makes them suddenly feel shocked, surprised, frightened, etc.",
                    "vi": "nếu ai đó kinh hãi hoặc nếu có điều gì đó làm họ sợ hãi, họ phản ứng rất mạnh mẽ với điều gì đó khiến họ đột nhiên cảm thấy sốc, ngạc nhiên, sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "freak (out) My parents really freaked when they saw my hair.",
                        "vi": "freak (out) Cha mẹ tôi thực sự hoảng sợ khi họ nhìn thấy mái tóc của tôi."
                    },
                    {
                        "en": "freak somebody (out) Snakes really freak me out.",
                        "vi": "làm ai đó hoảng sợ (ra ngoài) Rắn thực sự làm tôi hoảng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "a4ed949f15d04b56947139ee816f5009",
        "word": "freeze your blood",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/friːz/",
            "us": "/friːz/"
        },
        "nearby": [
            {
                "word": "freewheeling",
                "pos": "adjective"
            },
            {
                "word": "free will",
                "pos": "noun"
            },
            {
                "word": "freeze",
                "pos": "verb"
            },
            {
                "word": "freeze",
                "pos": "noun"
            },
            {
                "word": "freeze-dry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become hard, and often turn to ice, as a result of extreme cold; to make something do this",
                    "vi": "trở nên cứng và thường chuyển sang đóng băng do quá lạnh; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Water freezes at 0°C.",
                        "vi": "Nước đóng băng ở 0 ° C."
                    },
                    {
                        "en": "It's so cold that even the river has frozen.",
                        "vi": "Nó lạnh đến nỗi ngay cả dòng sông cũng đóng băng."
                    },
                    {
                        "en": "freeze something The cold weather had frozen the ground.",
                        "vi": "đóng băng cái gì đó Thời tiết lạnh giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "freeze + adj. The clothes froze solid on the washing line.",
                        "vi": "đóng băng + adj. Quần áo đông cứng trên dây giặt."
                    },
                    {
                        "en": "freeze something + adj. The frost had frozen the ground hard.",
                        "vi": "đóng băng cái gì đó + adj. Băng giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "Last year's cold spell froze the lake solid.",
                        "vi": "Đợt lạnh năm ngoái làm đông cứng mặt hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a pipe, lock or machine freezes, or something freezes it, it becomes blocked with frozen liquid and therefore cannot be used",
                    "vi": "nếu một đường ống, ổ khóa hoặc máy bị đóng băng, hoặc thứ gì đó đóng băng nó, nó sẽ bị chặn bởi chất lỏng đông lạnh và do đó không thể sử dụng được"
                },
                "examples": [
                    {
                        "en": "The pipes have frozen, so we've got no water.",
                        "vi": "Các đường ống đã đóng băng, vì vậy chúng tôi không có nước."
                    },
                    {
                        "en": "freeze up I kept the car running to stop the engine freezing up.",
                        "vi": "đóng băng Tôi tiếp tục cho xe chạy để ngăn động cơ đóng băng lên."
                    },
                    {
                        "en": "freeze something Ten degrees of frost had frozen the lock on the car.",
                        "vi": "đóng băng một thứ gì đó Băng giá mười độ đã đóng băng ổ khóa trên xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it freezes, the weather is at or below 0° Celsius",
                    "vi": "khi nó đóng băng, thời tiết bằng hoặc dưới 0 ° C"
                },
                "examples": [
                    {
                        "en": "It may freeze tonight, so bring those plants inside.",
                        "vi": "Tối nay trời có thể đóng băng, vì vậy hãy mang những cây đó vào trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very cold; to be so cold that you die",
                    "vi": "rất lạnh; lạnh đến mức bạn chết"
                },
                "examples": [
                    {
                        "en": "Every time she opens the window we all freeze.",
                        "vi": "Mỗi lần cô ấy mở cửa sổ, tất cả chúng tôi đều đông cứng."
                    },
                    {
                        "en": "Two men froze to death on the mountain.",
                        "vi": "Hai người đàn ông chết cóng trên núi."
                    },
                    {
                        "en": "freeze somebody Two men were frozen to death on the mountain.",
                        "vi": "đóng băng ai đó Hai người đàn ông bị chết cóng trên núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep something, especially food, at a very low temperature in order to preserve it",
                    "vi": "để giữ một thứ gì đó, đặc biệt là thực phẩm, ở nhiệt độ rất thấp để bảo quản"
                },
                "examples": [
                    {
                        "en": "Can you freeze this cake?",
                        "vi": "Bạn có thể đông lạnh chiếc bánh này không?"
                    },
                    {
                        "en": "The organ samples were immediately frozen in liquid nitrogen.",
                        "vi": "Các mẫu nội tạng ngay lập tức được làm đông lạnh trong nitơ lỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be kept at a very low temperature",
                    "vi": "để có thể được giữ ở nhiệt độ rất thấp"
                },
                "examples": [
                    {
                        "en": "Some fruits freeze better than others.",
                        "vi": "Một số loại trái cây đóng băng tốt hơn những loại khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop moving suddenly because of fear, etc.",
                    "vi": "ngừng di chuyển đột ngột vì sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "I froze with terror as the door slowly opened.",
                        "vi": "Tôi sững người vì sợ hãi khi cánh cửa từ từ mở ra."
                    },
                    {
                        "en": "(figurative) The smile froze on her lips.",
                        "vi": "(nghĩa bóng) Nụ cười vụt tắt trên môi."
                    },
                    {
                        "en": "The police officer shouted ‘Freeze!’ and the man dropped the gun.",
                        "vi": "Viên cảnh sát hét lên 'Đóng băng!' và người đàn ông đã đánh rơi súng."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a computer screen freezes, you cannot move any of the images, etc. on it, because there is a problem with the system",
                    "vi": "khi màn hình máy tính bị treo, bạn không thể di chuyển bất kỳ hình ảnh nào, v.v. trên đó, do có sự cố với hệ thống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop a film or video in order to look at a particular picture",
                    "vi": "dừng phim hoặc video để xem một bức tranh cụ thể"
                },
                "examples": [
                    {
                        "en": "Freeze the action there!",
                        "vi": "Đóng băng hành động ở đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold wages, prices, etc. at a fixed level for a period of time",
                    "vi": "giữ tiền lương, giá cả, v.v. ở một mức cố định trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "Salaries have been frozen for the current year.",
                        "vi": "Tiền lương đã bị đóng băng cho năm hiện tại."
                    },
                    {
                        "en": "Prices have been frozen at this level for over a year now.",
                        "vi": "Giá đã bị đóng băng ở mức này trong hơn một năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent money, a bank account, etc. from being used by getting a court order which bans it",
                    "vi": "để ngăn tiền, tài khoản ngân hàng, v.v. bị sử dụng bằng cách nhận lệnh tòa cấm tài khoản đó"
                },
                "examples": [
                    {
                        "en": "The company's assets have been frozen.",
                        "vi": "Tài sản của công ty đã bị phong toả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly stop because something has frightened or surprised you",
                    "vi": "đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Jess froze in her tracks and took a deep breath.",
                        "vi": "Jess lặng người đi và hít thở sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly make somebody stop by frightening or surprising them; to suddenly stop because something has frightened or surprised you",
                    "vi": "đột nhiên khiến ai đó dừng lại bằng cách làm họ sợ hãi hoặc ngạc nhiên; đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The question stopped Alice in her tracks.",
                        "vi": "Câu hỏi khiến Alice dừng lại."
                    },
                    {
                        "en": "Suddenly he stopped dead in his tracks: what was he doing?",
                        "vi": "Đột nhiên anh ấy chết sững lại: anh ấy đang làm gì vậy?"
                    },
                    {
                        "en": "(figurative) The disease was stopped in its tracks by immunization programmes.",
                        "vi": "(nghĩa bóng) Căn bệnh này đã được chặn đứng bởi các chương trình chủng ngừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "2756091494694dec96769f6aa9067d82",
        "word": "frisson",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfriːsɒ̃/",
            "us": "/friːˈsɔːn/"
        },
        "nearby": [
            {
                "word": "frisk",
                "pos": "verb"
            },
            {
                "word": "frisky",
                "pos": "adjective"
            },
            {
                "word": "frisson",
                "pos": "noun"
            },
            {
                "word": "fritillary",
                "pos": "noun"
            },
            {
                "word": "Frito-Lay",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden strong feeling, especially of excitement or fear",
                    "vi": "một cảm giác mạnh đột ngột, đặc biệt là phấn khích hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "A frisson of alarm ran down my spine.",
                        "vi": "Một hồi chuông báo động chạy dọc sống lưng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "7092d12835f342c79879a99ae4e1da70",
        "word": "gibber",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɪbə(r)/",
            "us": "/ˈdʒɪbər/"
        },
        "nearby": [
            {
                "word": "GiB",
                "pos": "abbreviation"
            },
            {
                "word": "Gib",
                "pos": "abbreviation"
            },
            {
                "word": "gibber",
                "pos": "verb"
            },
            {
                "word": "gibberish",
                "pos": "noun"
            },
            {
                "word": "gibbet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak quickly in a way that is difficult to understand, often because of fear",
                    "vi": "nói nhanh theo cách khó hiểu, thường là vì sợ hãi"
                },
                "examples": [
                    {
                        "en": "He cowered in the corner, gibbering with terror.",
                        "vi": "Anh thu mình trong góc, gầm gừ vì sợ hãi."
                    },
                    {
                        "en": "By this time I was a gibbering wreck.",
                        "vi": "Vào thời điểm này, tôi đã trở thành một xác tàu ngủ gật."
                    }
                ]
            }
        ]
    },
    {
        "id": "6cfbbf80d1844d6887f718ee0b5c79e0",
        "word": "give somebody the creeps",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kriːp/",
            "us": "/kriːp/"
        },
        "nearby": [
            {
                "word": "creel",
                "pos": "noun"
            },
            {
                "word": "creep",
                "pos": "verb"
            },
            {
                "word": "creep",
                "pos": "noun"
            },
            {
                "word": "creeper",
                "pos": "noun"
            },
            {
                "word": "creep in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person that you dislike very much and find very unpleasant",
                    "vi": "một người mà bạn rất không thích và cảm thấy rất khó chịu"
                },
                "examples": [
                    {
                        "en": "He's a nasty little creep!",
                        "vi": "Anh ta là một con bò nhỏ khó chịu!"
                    },
                    {
                        "en": "You little creep!",
                        "vi": "Đồ khốn kiếp!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is not sincere but tries to win your approval by being nice to you",
                    "vi": "một người không chân thành nhưng cố gắng giành được sự chấp thuận của bạn bằng cách đối xử tốt với bạn"
                },
                "examples": [
                    {
                        "en": "He’s the sort of creep who would do that kind of thing!",
                        "vi": "Anh ta là loại người sẽ làm điều đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the development of a project beyond the goal that was originally agreed",
                    "vi": "sự phát triển của một dự án ngoài mục tiêu đã được thỏa thuận ban đầu"
                },
                "examples": [
                    {
                        "en": "The World Bank has been accused of mission creep when seeking to address these concerns.",
                        "vi": "Ngân hàng Thế giới đã bị buộc tội làm sai sứ mệnh khi tìm cách giải quyết những lo ngại này."
                    },
                    {
                        "en": "The inclusion of health data on identity cards was condemned as function creep.",
                        "vi": "Việc đưa dữ liệu sức khỏe vào chứng minh nhân dân bị lên án là hành vi sai chức năng."
                    },
                    {
                        "en": "creep of something We need to prevent this slow creep of costs.",
                        "vi": "sự leo thang của điều gì đó Chúng ta cần ngăn chặn sự gia tăng chi phí chậm chạp này."
                    },
                    {
                        "en": "The creep of suburban shopping malls is shrinking the countryside.",
                        "vi": "Sự phát triển của các trung tâm mua sắm ở ngoại ô đang thu hẹp vùng nông thôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel nervous and slightly frightened, especially because somebody/something is unpleasant or strange",
                    "vi": "làm cho ai đó cảm thấy lo lắng và hơi sợ hãi, đặc biệt là vì ai đó / điều gì đó khó chịu hoặc kỳ lạ"
                },
                "examples": [
                    {
                        "en": "This old house gives me the creeps.",
                        "vi": "Ngôi nhà cũ này cho tôi những con creep."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce5228fff6344a7b874fd387d125903d",
        "word": "glued/riveted/rooted to the spot",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrɪvɪt/",
            "us": "/ˈrɪvɪt/"
        },
        "nearby": [
            {
                "word": "riverside",
                "pos": "noun"
            },
            {
                "word": "rivet",
                "pos": "noun"
            },
            {
                "word": "rivet",
                "pos": "verb"
            },
            {
                "word": "riveting",
                "pos": "adjective"
            },
            {
                "word": "riviera",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hold somebody’s interest or attention so completely that they cannot look away or think of anything else",
                    "vi": "để thu hút sự quan tâm hoặc sự chú ý của ai đó hoàn toàn đến mức họ không thể nhìn đi chỗ khác hoặc nghĩ về bất cứ điều gì khác"
                },
                "examples": [
                    {
                        "en": "be riveted (by something) I was absolutely riveted by her story.",
                        "vi": "được tán thành (bởi một cái gì đó) Tôi hoàn toàn bị tán thành bởi câu chuyện của cô ấy."
                    },
                    {
                        "en": "be riveted on somebody/something My eyes were riveted on the figure lying in the road.",
                        "vi": "được tán vào ai đó / cái gì đó Đôi mắt của tôi bị tán thành trên hình người nằm trên đường."
                    },
                    {
                        "en": "Public attention was riveted on this topic on both sides of the Atlantic.",
                        "vi": "Sự chú ý của công chúng đã đổ dồn về chủ đề này ở cả hai bờ Đại Tây Dương."
                    },
                    {
                        "en": "be riveted to something The film keeps you riveted to the screen.",
                        "vi": "được tán thành với một thứ gì đó Bộ phim khiến bạn say mê với màn hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fasten something with rivets",
                    "vi": "để buộc chặt một cái gì đó bằng đinh tán"
                },
                "examples": [
                    {
                        "en": "The steel plates were riveted together.",
                        "vi": "Các tấm thép được tán vào nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to move, for example because you are frightened or surprised",
                    "vi": "không thể di chuyển, chẳng hạn như vì bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "I stood riveted to the spot with terror.",
                        "vi": "Tôi kinh hãi đứng tại chỗ."
                    }
                ]
            }
        ]
    },
    {
        "id": "38314a9f39ec49b0bf97f7152d0171ff",
        "word": "glued/riveted/rooted to the spot",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/spɒt/",
            "us": "/spɑːt/"
        },
        "nearby": [
            {
                "word": "sport utility vehicle",
                "pos": "noun"
            },
            {
                "word": "sporty",
                "pos": "adjective"
            },
            {
                "word": "spot",
                "pos": "noun"
            },
            {
                "word": "spot",
                "pos": "verb"
            },
            {
                "word": "spot",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small round area that has a different colour or feels different from the surface it is on",
                    "vi": "một khu vực tròn nhỏ có màu khác hoặc có cảm giác khác với bề mặt của nó"
                },
                "examples": [
                    {
                        "en": "Which has spots, the leopard or the tiger?",
                        "vi": "Con nào có đốm, con báo hay con hổ?"
                    },
                    {
                        "en": "The male bird has a red spot on its beak.",
                        "vi": "Chim trống có một đốm đỏ trên mỏ."
                    },
                    {
                        "en": "(British English) She was wearing a black skirt with white spots.",
                        "vi": "(Anh Anh) Cô ấy đang mặc một chiếc váy đen với những đốm trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small mark or lump on a person’s skin, sometimes with a yellow head to it",
                    "vi": "một vết nhỏ hoặc cục u trên da của một người, đôi khi có đầu màu vàng"
                },
                "examples": [
                    {
                        "en": "The baby's whole body was covered in small red spots.",
                        "vi": "Toàn thân cháu bé nổi đầy những nốt mụn nhỏ màu đỏ."
                    },
                    {
                        "en": "He had a large spot on his nose.",
                        "vi": "Anh ta có một đốm lớn trên mũi."
                    },
                    {
                        "en": "The aim of acne treatments is to shorten the length of time someone has spots.",
                        "vi": "Mục đích của phương pháp điều trị mụn trứng cá là rút ngắn thời gian bị mụn trứng cá."
                    },
                    {
                        "en": "(British English) teenagers worried about their spots",
                        "vi": "(Tiếng Anh Anh) thanh thiếu niên lo lắng về điểm của họ"
                    },
                    {
                        "en": "The children all had measles, and had broken out in spots.",
                        "vi": "Các cháu đều mắc bệnh sởi, thành từng đám."
                    },
                    {
                        "en": "enlarged pores and spots on the skin",
                        "vi": "lỗ chân lông to và các đốm trên da"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small dirty mark on something",
                    "vi": "một vết bẩn nhỏ trên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His jacket was covered with spots of mud.",
                        "vi": "Áo khoác của anh ta dính đầy những đốm bùn."
                    },
                    {
                        "en": "rust spots",
                        "vi": "điểm rỉ sét"
                    },
                    {
                        "en": "There were grease spots all over the walls.",
                        "vi": "Có những vết dầu mỡ khắp các bức tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area or place",
                    "vi": "một khu vực hoặc địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "a quiet/secluded/lonely spot",
                        "vi": "một nơi yên tĩnh / hẻo lánh / cô đơn"
                    },
                    {
                        "en": "This is a favourite spot for walkers and climbers.",
                        "vi": "Đây là địa điểm yêu thích của những người thích đi bộ và leo núi."
                    },
                    {
                        "en": "I won't drive around for 20 minutes looking for a parking spot.",
                        "vi": "Tôi sẽ không lái xe trong 20 phút để tìm chỗ đậu xe."
                    },
                    {
                        "en": "He was exhausted and just wanted to find a spot to sleep.",
                        "vi": "Anh kiệt sức và chỉ muốn tìm một chỗ để ngủ."
                    },
                    {
                        "en": "The bay has become a popular spot for young international travellers.",
                        "vi": "Vịnh đã trở thành một điểm nổi tiếng đối với du khách quốc tế trẻ tuổi."
                    },
                    {
                        "en": "He showed me the exact spot where he had asked her to marry him.",
                        "vi": "Anh ấy chỉ cho tôi địa điểm chính xác mà anh ấy đã hỏi cưới cô ấy."
                    },
                    {
                        "en": "a tourist spot",
                        "vi": "một điểm du lịch"
                    },
                    {
                        "en": "She placed the ball on the penalty spot and waited for the whistle.",
                        "vi": "Cô đặt bóng vào chấm phạt đền và chờ tiếng còi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small feature or part of somebody/something with a particular quality",
                    "vi": "một tính năng nhỏ hoặc một phần của ai đó / cái gì đó với một chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He usually wears a hat to hide his bald spot.",
                        "vi": "Anh ấy thường đội một chiếc mũ để che đi vết hói của mình."
                    },
                    {
                        "en": "(figurative) She knew her weak spot where Steve was concerned.",
                        "vi": "(nghĩa bóng) Cô ấy biết điểm yếu của mình nơi Steve lo lắng."
                    },
                    {
                        "en": "(figurative) From her angry reply it was obvious that I had touched a sensitive spot.",
                        "vi": "(nghĩa bóng) Từ câu trả lời giận dữ của cô ấy, rõ ràng là tôi đã chạm vào chỗ nhạy cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of something",
                    "vi": "một số lượng nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's in a spot of trouble.",
                        "vi": "Anh ấy đang gặp rắc rối."
                    },
                    {
                        "en": "Would you like a spot of lunch?",
                        "vi": "Bạn có muốn ăn trưa tại chỗ không?"
                    },
                    {
                        "en": "She’s gone out to do a spot of shopping.",
                        "vi": "Cô ấy ra ngoài để mua sắm."
                    },
                    {
                        "en": "We got into a spot of bother with the police.",
                        "vi": "Chúng tôi vướng vào một chỗ làm phiền với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of a liquid",
                    "vi": "một lượng nhỏ chất lỏng"
                },
                "examples": [
                    {
                        "en": "I felt a few spots of rain.",
                        "vi": "Tôi cảm thấy một vài điểm mưa."
                    },
                    {
                        "en": "There was a spot of rain in the afternoon, but otherwise the weather has been perfect.",
                        "vi": "Có một chút mưa vào buổi chiều, nhưng nếu không thì thời tiết thật hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a television, radio, club or theatre show that is given to a particular person or type of entertainment",
                    "vi": "một phần của chương trình truyền hình, đài phát thanh, câu lạc bộ hoặc nhà hát dành cho một người hoặc loại hình giải trí cụ thể"
                },
                "examples": [
                    {
                        "en": "a guest/solo spot",
                        "vi": "một khách / điểm solo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in a competition, event or team",
                    "vi": "một vị trí trong một cuộc thi, sự kiện hoặc đội"
                },
                "examples": [
                    {
                        "en": "two teams battling for (the) top spot",
                        "vi": "hai đội chiến đấu cho (vị trí) đầu"
                    },
                    {
                        "en": "She has earned a spot on the national team.",
                        "vi": "Cô ấy đã giành được một suất trong đội tuyển quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "a spotlight (= a light with a single, very bright beam that can be directed at a particular place or person, especially a performer on the stage)",
                    "vi": "đèn sân khấu (= đèn có một chùm sáng rất sáng có thể chiếu thẳng vào một địa điểm hoặc một người cụ thể, đặc biệt là một người biểu diễn trên sân khấu)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a good or pleasant part of something that is unpleasant or bad in all other ways",
                    "vi": "một phần tốt hoặc dễ chịu của điều gì đó khó chịu hoặc xấu theo tất cả các cách khác"
                },
                "examples": [
                    {
                        "en": "The win last week was the only bright spot in their last ten games.",
                        "vi": "Chiến thắng tuần trước là điểm sáng duy nhất trong mười trận gần nhất của họ."
                    },
                    {
                        "en": "The birth of my son was the one bright spot in a terrible year.",
                        "vi": "Sự ra đời của con trai tôi là một điểm sáng trong một năm tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to move, for example because you are frightened or surprised",
                    "vi": "không thể di chuyển, chẳng hạn như vì bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "I stood rooted to the spot with terror.",
                        "vi": "Tôi sợ hãi đứng rễ tại chỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft spot for you.",
                        "vi": "Cô ấy luôn có một điểm yếu cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something hits the spot it does exactly what it should do",
                    "vi": "nếu một cái gì đó chạm đúng vị trí, nó sẽ làm chính xác những gì nó nên làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very much better than somebody/something",
                    "vi": "trở nên tốt hơn rất nhiều so với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She knocks spots off all the other candidates.",
                        "vi": "Cô ấy đánh bật tất cả các ứng cử viên khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "people cannot change their character, especially if they have a bad character",
                    "vi": "con người không thể thay đổi tính cách của họ, đặc biệt là nếu họ có một tính cách xấu"
                },
                "examples": [
                    {
                        "en": "You didn’t really expect her to be on time, did you? A leopard can’t change its spots.",
                        "vi": "Bạn không thực sự mong đợi cô ấy đến đúng giờ, phải không? Một con báo không thể thay đổi điểm của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "immediately",
                    "vi": "ngay lập tức"
                },
                "examples": [
                    {
                        "en": "He answered the question on the spot.",
                        "vi": "Anh ta trả lời câu hỏi ngay tại chỗ."
                    },
                    {
                        "en": "an on-the-spot parking fine",
                        "vi": "phạt đậu xe tại chỗ"
                    }
                ]
            },
            {
                "define": {
                    "en": "at the actual place where something is happening",
                    "vi": "tại địa điểm thực tế nơi có điều gì đó đang xảy ra"
                },
                "examples": [
                    {
                        "en": "An ambulance was on the spot within minutes.",
                        "vi": "Xe cấp cứu đã có mặt tại chỗ trong vòng vài phút."
                    },
                    {
                        "en": "an on-the-spot report",
                        "vi": "một báo cáo tại chỗ"
                    }
                ]
            },
            {
                "define": {
                    "en": "in one exact place, without moving in any direction",
                    "vi": "ở một nơi chính xác, không di chuyển theo bất kỳ hướng nào"
                },
                "examples": [
                    {
                        "en": "Running on the spot is good exercise.",
                        "vi": "Chạy tại chỗ là thể dục tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel uncomfortable or embarrassed by asking them a difficult question",
                    "vi": "làm cho ai đó cảm thấy khó chịu hoặc xấu hổ bằng cách hỏi họ một câu hỏi khó"
                },
                "examples": [
                    {
                        "en": "The interviewer's questions really put him on the spot.",
                        "vi": "Các câu hỏi của người phỏng vấn thực sự đặt anh ta vào chỗ đứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "8cefa31a357b407986653c3f063c465f",
        "word": "go hot and cold",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɒt/",
            "us": "/hɑːt/"
        },
        "nearby": [
            {
                "word": "hostler",
                "pos": "noun"
            },
            {
                "word": "hot pink",
                "pos": "adjective"
            },
            {
                "word": "hot",
                "pos": "adjective"
            },
            {
                "word": "hot",
                "pos": "verb"
            },
            {
                "word": "hot air",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a high temperature; producing heat",
                    "vi": "có nhiệt độ cao; sản xuất nhiệt"
                },
                "examples": [
                    {
                        "en": "It's hot today, isn't it?",
                        "vi": "Hôm nay trời nóng quá phải không?"
                    },
                    {
                        "en": "It was hot and getting hotter.",
                        "vi": "Trời càng lúc càng nóng."
                    },
                    {
                        "en": "Do you like this hot weather?",
                        "vi": "Bạn có thích thời tiết nóng bức này không?"
                    },
                    {
                        "en": "a hot dry summer",
                        "vi": "một mùa hè khô nóng"
                    },
                    {
                        "en": "an unusually hot day",
                        "vi": "một ngày nóng bất thường"
                    },
                    {
                        "en": "It was the hottest July on record.",
                        "vi": "Đó là tháng Bảy nóng nhất được ghi nhận."
                    },
                    {
                        "en": "Be careful—the plates are hot.",
                        "vi": "Hãy cẩn thận — các đĩa còn nóng."
                    },
                    {
                        "en": "All rooms have hot and cold water.",
                        "vi": "Tất cả các phòng đều có nước nóng lạnh."
                    },
                    {
                        "en": "I'll feel better after a hot bath.",
                        "vi": "Tôi sẽ cảm thấy tốt hơn sau khi tắm nước nóng."
                    },
                    {
                        "en": "a hot meal (= one that has been cooked)",
                        "vi": "một bữa ăn nóng (= một bữa ăn đã được nấu chín)"
                    },
                    {
                        "en": "When the weather gets hot, we often head to the beach.",
                        "vi": "Khi thời tiết trở nên nóng bức, chúng ta thường đi đến bãi biển."
                    },
                    {
                        "en": "I couldn't live in a hot country (= one which has high average temperatures).",
                        "vi": "Tôi không thể sống ở một quốc gia nóng (= một quốc gia có nhiệt độ trung bình cao)."
                    },
                    {
                        "en": "Cook in a very hot oven.",
                        "vi": "Nấu trong lò rất nóng."
                    },
                    {
                        "en": "Eat it while it's hot.",
                        "vi": "Ăn khi còn nóng."
                    },
                    {
                        "en": "I touched his forehead. He felt hot and feverish.",
                        "vi": "Tôi sờ trán anh ấy. Anh cảm thấy nóng và phát sốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling heat in an unpleasant or uncomfortable way",
                    "vi": "cảm thấy nóng một cách khó chịu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Is anyone too hot?",
                        "vi": "Có ai quá nóng không?"
                    },
                    {
                        "en": "I feel hot.",
                        "vi": "Tôi thấy nóng."
                    },
                    {
                        "en": "Her cheeks were hot with embarrassment.",
                        "vi": "Hai má cô nóng bừng vì xấu hổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel hot",
                    "vi": "làm cho bạn cảm thấy nóng"
                },
                "examples": [
                    {
                        "en": "London was hot and dusty.",
                        "vi": "London nóng nực và bụi bặm."
                    },
                    {
                        "en": "It had been a long hot journey.",
                        "vi": "Đó là một cuộc hành trình dài nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing pepper and spices that can produce a burning feeling in your mouth because they have a strong taste and smell",
                    "vi": "chứa hạt tiêu và gia vị có thể tạo ra cảm giác nóng rát trong miệng vì chúng có mùi và vị nồng"
                },
                "examples": [
                    {
                        "en": "hot spicy food",
                        "vi": "đồ ăn cay nóng"
                    },
                    {
                        "en": "You can make a curry hotter simply by adding chillies.",
                        "vi": "Bạn có thể làm món cà ri nóng hơn chỉ đơn giản bằng cách thêm ớt."
                    },
                    {
                        "en": "He brought out a plate of sausages covered in hot mustard.",
                        "vi": "Anh mang ra một đĩa xúc xích phủ mù tạt nóng hổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a lot of activity, argument or strong feelings",
                    "vi": "liên quan đến nhiều hoạt động, tranh luận hoặc cảm giác mạnh"
                },
                "examples": [
                    {
                        "en": "Today we enter the hottest phase of the election campaign.",
                        "vi": "Hôm nay chúng ta bước vào giai đoạn nóng nhất của chiến dịch bầu cử."
                    },
                    {
                        "en": "The environment has become a very hot issue.",
                        "vi": "Môi trường đã trở thành một vấn đề rất nóng."
                    },
                    {
                        "en": "Competition is getting hotter day by day.",
                        "vi": "Cạnh tranh đang trở nên nóng hơn từng ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult or dangerous to deal with and making you feel worried or uncomfortable",
                    "vi": "khó khăn hoặc nguy hiểm để đối phó và khiến bạn cảm thấy lo lắng hoặc không thoải mái"
                },
                "examples": [
                    {
                        "en": "When things got too hot most journalists left the area.",
                        "vi": "Khi mọi thứ trở nên quá nóng, hầu hết các nhà báo đã rời khỏi khu vực này."
                    },
                    {
                        "en": "They're making life hot for her.",
                        "vi": "Họ đang làm cho cuộc sống của cô ấy trở nên nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "new, exciting and very popular",
                    "vi": "mới, thú vị và rất phổ biến"
                },
                "examples": [
                    {
                        "en": "This is one of the hottest clubs in town.",
                        "vi": "Đây là một trong những câu lạc bộ nóng nhất trong thị trấn."
                    },
                    {
                        "en": "They are one of this year's hot new bands.",
                        "vi": "Họ là một trong những ban nhạc mới hot của năm nay."
                    },
                    {
                        "en": "The couple are Hollywood's hottest property.",
                        "vi": "Cặp đôi là tài sản hot nhất Hollywood."
                    }
                ]
            },
            {
                "define": {
                    "en": "fresh, very recent and usually exciting",
                    "vi": "mới mẻ, rất gần đây và thường thú vị"
                },
                "examples": [
                    {
                        "en": "I've got some hot gossip for you!",
                        "vi": "Tôi có một số tin đồn nóng cho bạn!"
                    },
                    {
                        "en": "a story that is hot off the press (= has just appeared in the newspapers)",
                        "vi": "một câu chuyện đang gây sốt trên báo chí (= vừa mới xuất hiện trên báo)"
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to be successful",
                    "vi": "có khả năng thành công"
                },
                "examples": [
                    {
                        "en": "She seems to be the hot favourite for the job.",
                        "vi": "Cô ấy có vẻ là người yêu thích nhất cho công việc."
                    },
                    {
                        "en": "Do you have any hot tips for today's race?",
                        "vi": "Bạn có lời khuyên nóng nào cho cuộc đua ngày hôm nay không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "very good at doing something; knowing a lot about something",
                    "vi": "rất giỏi khi làm một việc gì đó; biết nhiều về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Don't ask me—I'm not too hot on British history.",
                        "vi": "Đừng hỏi tôi — tôi không quá nóng về lịch sử nước Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody has a hot temper they become angry very easily",
                    "vi": "nếu ai đó có tính cách nóng nảy, họ rất dễ trở nên tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "feeling or causing sexual excitement",
                    "vi": "cảm giác hoặc gây hưng phấn tình dục"
                },
                "examples": [
                    {
                        "en": "You were as hot for me as I was for you.",
                        "vi": "Bạn cũng nóng bỏng đối với tôi như tôi đã dành cho bạn."
                    },
                    {
                        "en": "I've got a hot date tonight.",
                        "vi": "Tôi có một buổi hẹn hò nóng bỏng tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing scenes, statements, etc. that are of an extreme nature and are likely to shock or anger people",
                    "vi": "có chứa các cảnh, tuyên bố, v.v. có tính chất cực đoan và có khả năng gây sốc hoặc tức giận cho mọi người"
                },
                "examples": [
                    {
                        "en": "Some of the nude scenes were regarded as too hot for Broadway.",
                        "vi": "Một số cảnh khỏa thân được coi là quá nóng bỏng đối với sân khấu Broadway."
                    },
                    {
                        "en": "The report was highly critical of senior members of the Cabinet and was considered too hot to publish.",
                        "vi": "Bản báo cáo đã bị các thành viên cấp cao của Nội các chỉ trích rất nhiều và được coi là quá nóng để công bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking that something is very important and making sure that it always happens or is done",
                    "vi": "nghĩ rằng điều gì đó rất quan trọng và đảm bảo rằng điều đó luôn xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "They're very hot on punctuality at work.",
                        "vi": "Họ rất nóng tính về vấn đề đúng giờ tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a strong and exciting rhythm",
                    "vi": "có một nhịp điệu mạnh mẽ và thú vị"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "stolen and difficult to get rid of because they can easily be recognized",
                    "vi": "bị đánh cắp và khó lấy đi vì chúng có thể dễ dàng bị nhận ra"
                },
                "examples": [
                    {
                        "en": "I'd never have touched those phones if I'd known they were hot.",
                        "vi": "Tôi sẽ không bao giờ chạm vào những chiếc điện thoại đó nếu tôi biết chúng rất nóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in children’s games to say that the person playing is very close to finding a person or thing, or to guessing the correct answer",
                    "vi": "được sử dụng trong các trò chơi dành cho trẻ em để nói rằng người chơi đang tiến rất gần đến việc tìm ra người hoặc vật hoặc đoán câu trả lời chính xác"
                },
                "examples": [
                    {
                        "en": "You're getting hot!",
                        "vi": "Bạn đang trở nên nóng bỏng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very enthusiastic about starting an activity",
                    "vi": "rất nhiệt tình trong việc bắt đầu một hoạt động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be excited in a sexual way",
                    "vi": "được kích thích theo cách tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in or get into trouble",
                    "vi": "gặp rắc rối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your opinion about something often",
                    "vi": "thay đổi quan điểm của bạn về điều gì đó thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to experience a sudden feeling of fear or worry",
                    "vi": "trải qua cảm giác sợ hãi hoặc lo lắng đột ngột"
                },
                "examples": [
                    {
                        "en": "When the phone rang I just went hot and cold.",
                        "vi": "Khi điện thoại reo, tôi vừa nóng vừa lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be bought quickly or in great numbers",
                    "vi": "để được mua nhanh chóng hoặc với số lượng lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very close behind somebody/something; very soon after something",
                    "vi": "rất gần sau ai đó / cái gì đó; rất nhanh sau một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He turned and fled with Peter hot on his heels.",
                        "vi": "Anh ta quay lại và bỏ chạy với Peter nóng bỏng trên gót chân của mình."
                    },
                    {
                        "en": "They reached the border with the police hot on their heels.",
                        "vi": "Họ đến biên giới với cảnh sát nóng bỏng gót chân của họ."
                    },
                    {
                        "en": "Further successes came hot on the heels of her first best-selling novel.",
                        "vi": "Những thành công tiếp theo đến với cuốn tiểu thuyết bán chạy nhất đầu tiên của cô."
                    },
                    {
                        "en": "News of rising unemployment followed hard on the heels of falling export figures.",
                        "vi": "Tin tức về tỷ lệ thất nghiệp gia tăng kéo theo sự sụt giảm của số liệu xuất khẩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a state of worry or stress because you are under too much pressure, have a problem, are trying to hurry, etc.",
                    "vi": "trong trạng thái lo lắng, căng thẳng vì bị áp lực quá lớn, gặp khó khăn, vội vàng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "close to catching or finding the person or thing that you have been running after or searching for",
                    "vi": "gần bắt hoặc tìm thấy người hoặc vật mà bạn đang theo đuổi hoặc tìm kiếm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "angry or embarrassed",
                    "vi": "tức giận hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "He got very hot under the collar when I asked him where he'd been all day.",
                        "vi": "Anh ấy rất nóng dưới cổ áo khi tôi hỏi anh ấy đã ở đâu cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "following somebody closely and determined to catch them",
                    "vi": "theo sát ai đó và quyết tâm bắt họ"
                },
                "examples": [
                    {
                        "en": "She sped away in her car with journalists in hot pursuit.",
                        "vi": "Cô ấy phóng nhanh trong xe của mình với các nhà báo trong sự truy đuổi nóng bỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "not very good in quality",
                    "vi": "chất lượng không tốt lắm"
                },
                "examples": [
                    {
                        "en": "Her spelling isn't too hot.",
                        "vi": "Chính tả của cô ấy không quá nóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not feeling well",
                    "vi": "cảm thấy không khỏe"
                },
                "examples": [
                    {
                        "en": "‘How are you today?’ ‘Not so hot, I'm afraid.’",
                        "vi": "Hôm nay bạn thế nào?' 'Không quá nóng, tôi sợ.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make use of an opportunity immediately",
                    "vi": "để tận dụng cơ hội ngay lập tức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1eb8750c538f46179e1b8c3c58cd723f",
        "word": "goose pimples",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡuːs pɪmplz/",
            "us": "/ˈɡuːs pɪmplz/"
        },
        "nearby": [
            {
                "word": "gooseflesh",
                "pos": "noun"
            },
            {
                "word": "gooseneck",
                "pos": "noun"
            },
            {
                "word": "goose pimples",
                "pos": "noun"
            },
            {
                "word": "goose-step",
                "pos": "verb"
            },
            {
                "word": "goose-step",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a condition in which there are raised spots on your skin because you feel cold, frightened or excited",
                    "vi": "một tình trạng trong đó có các nốt nổi lên trên da của bạn vì bạn cảm thấy lạnh, sợ hãi hoặc phấn khích"
                },
                "examples": [
                    {
                        "en": "It gave me goose pimples just to think about it.",
                        "vi": "Chỉ cần nghĩ về nó đã khiến tôi nổi da gà."
                    }
                ]
            }
        ]
    },
    {
        "id": "54a0c20a2d8443cca20f03a33b75d19b",
        "word": "the heebie-jeebies",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌhiːbi ˈdʒiːbiz/",
            "us": "/ðə ˌhiːbi ˈdʒiːbiz/"
        },
        "nearby": [
            {
                "word": "hedonist",
                "pos": "noun"
            },
            {
                "word": "hedonistic",
                "pos": "adjective"
            },
            {
                "word": "the heebie-jeebies",
                "pos": "noun"
            },
            {
                "word": "heed",
                "pos": "verb"
            },
            {
                "word": "heed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of nervous fear or worry",
                    "vi": "cảm giác lo lắng sợ hãi hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "Being alone in the dark gives me the heebie-jeebies.",
                        "vi": "Ở một mình trong bóng tối mang lại cho tôi sự thích thú."
                    }
                ]
            }
        ]
    },
    {
        "id": "ccc4bf80fcc64ff8b19a3e7f2c5d520c",
        "word": "hunted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌntɪd/",
            "us": "/ˈhʌntɪd/"
        },
        "nearby": [
            {
                "word": "hunt-and-peck",
                "pos": "adjective"
            },
            {
                "word": "hunt down",
                "pos": "phrasal verb"
            },
            {
                "word": "hunted",
                "pos": "adjective"
            },
            {
                "word": "hunter",
                "pos": "noun"
            },
            {
                "word": "Hunter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing that somebody is very worried or frightened, as if somebody is following them and trying to catch them",
                    "vi": "cho thấy ai đó đang rất lo lắng hoặc sợ hãi, như thể ai đó đang theo dõi họ và cố gắng bắt họ"
                },
                "examples": [
                    {
                        "en": "His eyes had a hunted look.",
                        "vi": "Đôi mắt của anh ta có một cái nhìn săn lùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d9ef2a2b1914046b97b0c82ae55641a",
        "word": "hyperventilate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪpəˈventɪleɪt/",
            "us": "/ˌhaɪpərˈventɪleɪt/"
        },
        "nearby": [
            {
                "word": "hyperthyroidism",
                "pos": "noun"
            },
            {
                "word": "hypertrophy",
                "pos": "noun"
            },
            {
                "word": "hyperventilate",
                "pos": "verb"
            },
            {
                "word": "hyperventilation",
                "pos": "noun"
            },
            {
                "word": "hyphen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to breathe too quickly because you are very frightened or excited",
                    "vi": "thở quá nhanh vì bạn đang rất sợ hãi hoặc phấn khích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "91e4d4b83de94f1a933e9034921ed097",
        "word": "hysterics",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hɪˈsterɪks/",
            "us": "/hɪˈsterɪks/"
        },
        "nearby": [
            {
                "word": "hysterical",
                "pos": "adjective"
            },
            {
                "word": "hysterically",
                "pos": "adverb"
            },
            {
                "word": "hysterics",
                "pos": "noun"
            },
            {
                "word": "Hz",
                "pos": "abbreviation"
            },
            {
                "word": "I-9 form",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an expression of extreme fear, excitement or anger that makes somebody lose control of their emotions and cry, laugh, etc.",
                    "vi": "biểu hiện của sự sợ hãi, phấn khích hoặc tức giận tột độ khiến ai đó mất kiểm soát cảm xúc và khóc, cười, v.v."
                },
                "examples": [
                    {
                        "en": "He went into hysterics when he heard the news.",
                        "vi": "Anh ta phát cuồng khi biết tin."
                    },
                    {
                        "en": "The children would go into hysterics at the mere mention of her name.",
                        "vi": "Bọn trẻ sẽ phát cuồng khi chỉ nhắc đến tên cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "wild laughter",
                    "vi": "tiếng cười hoang dã"
                },
                "examples": [
                    {
                        "en": "She had the audience in hysterics.",
                        "vi": "Cô ấy đã khiến khán giả bị kích động."
                    },
                    {
                        "en": "The whole class dissolved into hysterics when they saw him.",
                        "vi": "Cả lớp tan biến thành cuồng loạn khi nhìn thấy anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely upset and angry",
                    "vi": "cực kỳ khó chịu và tức giận"
                },
                "examples": [
                    {
                        "en": "My mum'll have hysterics when she sees the colour of my hair.",
                        "vi": "Mẹ tôi sẽ phát cuồng khi nhìn thấy màu tóc của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "877ed8db22f64820bc97893525f40a45",
        "word": "in fear of your life",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/fɪə(r)/",
            "us": "/fɪr/"
        },
        "nearby": [
            {
                "word": "FE",
                "pos": "abbreviation"
            },
            {
                "word": "fealty",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "noun"
            },
            {
                "word": "fear",
                "pos": "verb"
            },
            {
                "word": "fear for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the bad feeling that you have when you are in danger or when a particular thing frightens you",
                    "vi": "cảm giác tồi tệ mà bạn có khi gặp nguy hiểm hoặc khi một điều cụ thể làm bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Her eyes showed no fear.",
                        "vi": "Đôi mắt cô ấy không hề tỏ ra sợ hãi."
                    },
                    {
                        "en": "The child was shaking with fear.",
                        "vi": "Đứa trẻ run lên vì sợ hãi."
                    },
                    {
                        "en": "I suddenly felt gripped by fear.",
                        "vi": "Tôi đột nhiên cảm thấy sợ hãi bao trùm."
                    },
                    {
                        "en": "She nearly went crazy with fear and anxiety.",
                        "vi": "Cô gần như phát điên vì sợ hãi và lo lắng."
                    },
                    {
                        "en": "The attacks created a climate of fear.",
                        "vi": "Các cuộc tấn công đã tạo ra một bầu không khí sợ hãi."
                    },
                    {
                        "en": "Terror attacks are a tool to instil fear in the public.",
                        "vi": "Các cuộc tấn công khủng bố là một công cụ để gieo rắc nỗi sợ hãi trong công chúng."
                    },
                    {
                        "en": "He managed to overcome his fears.",
                        "vi": "Anh ấy đã vượt qua được nỗi sợ hãi của mình."
                    },
                    {
                        "en": "fear of somebody/something Fear of crime can affect people's lives.",
                        "vi": "sợ hãi ai đó / điều gì đó Sợ hãi tội phạm có thể ảnh hưởng đến cuộc sống của mọi người."
                    },
                    {
                        "en": "in fear of somebody/something We lived in constant fear of losing our jobs.",
                        "vi": "sợ hãi ai đó / điều gì đó Chúng tôi đã sống trong nỗi sợ hãi thường xuyên bị mất việc làm."
                    },
                    {
                        "en": "without fear of somebody/something Women should be able to work without fear of harassment.",
                        "vi": "mà không sợ ai đó / điều gì đó Phụ nữ có thể làm việc mà không sợ bị quấy rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of concern about somebody's safety or about something bad that might happen",
                    "vi": "cảm giác lo lắng về sự an toàn của ai đó hoặc về điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The doctor's report confirmed our worst fears.",
                        "vi": "Báo cáo của bác sĩ đã xác nhận nỗi sợ hãi tồi tệ nhất của chúng tôi."
                    },
                    {
                        "en": "Police tried hard to allay the fears of local residents.",
                        "vi": "Cảnh sát đã cố gắng hết sức để xoa dịu nỗi sợ hãi của cư dân địa phương."
                    },
                    {
                        "en": "fear for somebody/something her fears for her son’s safety",
                        "vi": "nỗi sợ hãi cho ai đó / điều gì đó cô ấy lo sợ cho sự an toàn của con trai mình"
                    },
                    {
                        "en": "Alan spoke of his fears for the future.",
                        "vi": "Alan nói về nỗi sợ hãi của anh ấy đối với tương lai."
                    },
                    {
                        "en": "fear that… the fear that he had cancer",
                        "vi": "sợ rằng ... sợ rằng anh ấy bị ung thư"
                    },
                    {
                        "en": "The announcement sparked fears that interest rates will rise.",
                        "vi": "Thông báo này làm dấy lên lo ngại rằng lãi suất sẽ tăng."
                    },
                    {
                        "en": "amid fears The government announced the new measures amid growing security fears.",
                        "vi": "trong bối cảnh lo ngại Chính phủ công bố các biện pháp mới trong bối cảnh lo ngại về an ninh ngày càng gia tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid the danger of something happening",
                    "vi": "để tránh nguy hiểm của một cái gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "We spoke quietly for fear of waking the guards.",
                        "vi": "Chúng tôi nói nhỏ vì sợ lính canh đánh thức."
                    },
                    {
                        "en": "I had to run away for fear (that) he might one day kill me.",
                        "vi": "Tôi đã phải bỏ chạy vì sợ (rằng) một ngày nào đó anh ta có thể giết tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling frightened that you might be killed",
                    "vi": "cảm thấy sợ hãi rằng bạn có thể bị giết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you definitely do not want to do something",
                    "vi": "từng nói rằng bạn chắc chắn không muốn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Are you coming climbing?’ ‘No fear!’",
                        "vi": "Bạn có đang leo núi không?' 'Đừng sợ!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened, especially in order to make them do something",
                    "vi": "khiến ai đó rất sợ hãi, đặc biệt là để khiến họ làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a fair way",
                    "vi": "một cách công bằng"
                },
                "examples": [
                    {
                        "en": "They undertook to make their judgement without fear or favour.",
                        "vi": "Họ tiến hành đưa ra phán quyết của họ mà không sợ hãi hoặc thuận lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e9b7c898ecb4dfd9304fa8fc36041a2",
        "word": "intimidated",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtɪmɪdeɪtɪd/",
            "us": "/ɪnˈtɪmɪdeɪtɪd/"
        },
        "nearby": [
            {
                "word": "intimation",
                "pos": "noun"
            },
            {
                "word": "intimidate",
                "pos": "verb"
            },
            {
                "word": "intimidated",
                "pos": "adjective"
            },
            {
                "word": "intimidating",
                "pos": "adjective"
            },
            {
                "word": "intimidation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling frightened and not confident in a particular situation",
                    "vi": "cảm thấy sợ hãi và không tự tin trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "We try to make sure children don't feel intimidated on their first day at school.",
                        "vi": "Chúng tôi cố gắng đảm bảo trẻ em không cảm thấy bị đe dọa vào ngày đầu tiên đến trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9cc8a87b0cd446ab2277ad2b64ee25c",
        "word": "knock",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/nɒk/",
            "us": "/nɑːk/"
        },
        "nearby": [
            {
                "word": "knobbly",
                "pos": "adjective"
            },
            {
                "word": "knock-down",
                "pos": "noun"
            },
            {
                "word": "knock",
                "pos": "verb"
            },
            {
                "word": "knock",
                "pos": "noun"
            },
            {
                "word": "knockabout",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit a door, etc. in order to attract attention",
                    "vi": "đập cửa, v.v. để thu hút sự chú ý"
                },
                "examples": [
                    {
                        "en": "He knocked three times and waited.",
                        "vi": "Anh gõ ba lần và chờ đợi."
                    },
                    {
                        "en": "knock at/on something I knocked on the door and went straight in.",
                        "vi": "gõ vào / vào cái gì đó Tôi gõ cửa và đi thẳng vào."
                    },
                    {
                        "en": "Somebody was knocking on the window.",
                        "vi": "Có ai đó đang gõ cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit something hard, often by accident",
                    "vi": "va phải thứ gì đó khó, thường là do tình cờ"
                },
                "examples": [
                    {
                        "en": "knock something against/on something Be careful you don't knock your head on this low beam.",
                        "vi": "đập một cái gì đó vào / vào một cái gì đó Hãy cẩn thận, bạn không đập đầu vào chùm tia thấp này."
                    },
                    {
                        "en": "knock against/on something Her hand knocked against the glass.",
                        "vi": "gõ vào / vào cái gì đó Tay cô ấy gõ vào kính."
                    },
                    {
                        "en": "knock something She dropped the pile of books when he accidentally knocked her shoulder.",
                        "vi": "đập cái gì đó Cô làm rơi chồng sách khi anh vô tình làm cô đập vào vai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit something so that it moves or breaks",
                    "vi": "đánh một cái gì đó để nó di chuyển hoặc vỡ ra"
                },
                "examples": [
                    {
                        "en": "knock something + adv./prep. He'd knocked over a glass of water.",
                        "vi": "gõ cái gì đó + adv./prep. Anh ta đã làm đổ một cốc nước."
                    },
                    {
                        "en": "I knocked the nail into the wall.",
                        "vi": "Tôi đã gõ chiếc đinh vào tường."
                    },
                    {
                        "en": "They had to knock the door down to get in.",
                        "vi": "Họ phải đập cửa để vào."
                    },
                    {
                        "en": "He had knocked one of the pictures off the wall.",
                        "vi": "Anh ta đã đập một trong những bức tranh ra khỏi tường."
                    },
                    {
                        "en": "The boys were knocking (= kicking) a ball around in the back yard.",
                        "vi": "Các cậu bé đang đập (= đá) một quả bóng ở sân sau."
                    },
                    {
                        "en": "knock something (figurative) The criticism had knocked (= damaged) her self-esteem.",
                        "vi": "đập cái gì đó (nghĩa bóng) Lời chỉ trích đã đánh gục (= làm hỏng) lòng tự trọng của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody/something into a particular state by hitting them/it",
                    "vi": "đặt ai đó / cái gì đó vào một trạng thái cụ thể bằng cách đánh họ / nó"
                },
                "examples": [
                    {
                        "en": "knock somebody/something + adj. The blow knocked me flat.",
                        "vi": "gõ ai đó / cái gì đó + adj. Cú đánh khiến tôi ngã ngửa."
                    },
                    {
                        "en": "He was knocked senseless by the blow.",
                        "vi": "Anh ta bị đánh bay vô tri."
                    },
                    {
                        "en": "knock somebody/something doing something She knocked my drink flying.",
                        "vi": "knock ai đó / cái gì đó đang làm gì đó Cô ấy đánh bay đồ uống của tôi."
                    },
                    {
                        "en": "knock somebody/something + adv./prep. The two rooms had been knocked into one (= the wall between them had been knocked down).",
                        "vi": "gõ ai đó / cái gì đó + adv./prep. Hai căn phòng đã bị đập thành một (= bức tường giữa chúng đã bị phá bỏ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a hole in something by hitting it hard",
                    "vi": "để tạo một lỗ hổng trong một cái gì đó bằng cách đánh mạnh vào nó"
                },
                "examples": [
                    {
                        "en": "They managed to knock a hole in the wall.",
                        "vi": "Họ đã phá được một lỗ trên tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your heart knocks, it beats hard; if your knees knock, they shake, for example from fear",
                    "vi": "nếu tim bạn đập mạnh, nó đập mạnh; nếu đầu gối của bạn gõ, chúng rung lên, chẳng hạn như vì sợ hãi"
                },
                "examples": [
                    {
                        "en": "My heart was knocking wildly.",
                        "vi": "Tim tôi đập loạn xạ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a regular sound of metal hitting metal, especially because there is something wrong",
                    "vi": "để tạo ra âm thanh thường xuyên của kim loại va vào kim loại, đặc biệt là do có điều gì đó không ổn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody/something, especially when it happens unfairly",
                    "vi": "chỉ trích ai đó / điều gì đó, đặc biệt là khi điều đó xảy ra không công bằng"
                },
                "examples": [
                    {
                        "en": "The newspapers are always knocking the England team.",
                        "vi": "Các tờ báo luôn gõ cửa đội tuyển Anh."
                    },
                    {
                        "en": "It may sound pretty childish, but don't knock it until you've tried it.",
                        "vi": "Nghe có vẻ khá trẻ con, nhưng đừng gõ nó cho đến khi bạn đã thử nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force people to stop arguing and behave in a sensible way",
                    "vi": "buộc mọi người ngừng tranh cãi và cư xử một cách hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hit somebody very hard several times and hurt them very much",
                    "vi": "đánh ai đó rất mạnh vài lần và làm họ bị thương rất nhiều"
                },
                "examples": [
                    {
                        "en": "Get out or I’ll beat the living daylights out of you!",
                        "vi": "Ra ngoài nếu không tôi sẽ đánh bật ánh sáng ban ngày đang sống của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody/something very hard",
                    "vi": "đánh ai đó / cái gì đó rất khó"
                },
                "examples": [
                    {
                        "en": "He was a dirty player and loved to kick hell out of the opposition.",
                        "vi": "Anh ta là một cầu thủ bẩn thỉu và thích đá văng khỏi địa ngục của phe đối lập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to surprise or impress somebody very much",
                    "vi": "gây ngạc nhiên hoặc gây ấn tượng với ai đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to train somebody so that they do a particular job, task, etc. well",
                    "vi": "đào tạo ai đó để họ làm tốt một công việc, nhiệm vụ cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "It took him just two weeks to knock the new recruits into shape.",
                        "vi": "Anh ấy chỉ mất hai tuần để đánh bật các tân binh thành hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something more acceptable, organized or successful",
                    "vi": "để làm cho thứ gì đó dễ chấp nhận hơn, có tổ chức hoặc thành công hơn"
                },
                "examples": [
                    {
                        "en": "I've got all the information together but it still needs knocking into shape.",
                        "vi": "Tôi đã có tất cả thông tin cùng nhau nhưng nó vẫn cần phải thành hình."
                    },
                    {
                        "en": "It shouldn’t take long to get the company back into shape.",
                        "vi": "Sẽ không mất nhiều thời gian để đưa công ty trở lại hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect somebody very deeply",
                    "vi": "ảnh hưởng đến ai đó rất sâu sắc"
                },
                "examples": [
                    {
                        "en": "The business over the lawsuit had really knocked her for six.",
                        "vi": "Công việc kinh doanh về vụ kiện đã thực sự khiến cô ấy mất sáu tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to threaten somebody that you will hit them",
                    "vi": "từng đe dọa ai đó rằng bạn sẽ đánh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to impress somebody very much",
                    "vi": "để gây ấn tượng với ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "You look fabulous—you'll knock ’em dead tonight.",
                        "vi": "Trông bạn thật tuyệt vời - bạn sẽ đánh gục họ đêm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very much better than somebody/something",
                    "vi": "trở nên tốt hơn rất nhiều so với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She knocks the rest of the cast into a cocked hat.",
                        "vi": "Cô ấy đánh phần còn lại của dàn diễn viên vào một chiếc mũ có cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to stop making a noise, annoying you, etc.",
                    "vi": "được sử dụng để bảo ai đó đừng gây ồn ào, làm phiền bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Knock it off, kids—I’m trying to work.",
                        "vi": "Thôi đi, các con - tôi đang cố gắng làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody lose their position as somebody/something successful or admired",
                    "vi": "làm cho ai đó đánh mất vị trí của họ là ai đó / điều gì đó thành công hoặc được ngưỡng mộ"
                },
                "examples": [
                    {
                        "en": "A lot of teams are looking to knock us off our perch.",
                        "vi": "Rất nhiều đội đang tìm cách hạ gục chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop something from happening; to stop doing something",
                    "vi": "Để ngăn chặn điều gì đó xảy ra; dừng lại làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The recession knocked on the head any idea of expanding the company.",
                        "vi": "Suy thoái kinh tế đã gõ đầu bất kỳ ý tưởng mở rộng công ty nào."
                    },
                    {
                        "en": "By eleven o’clock we were all tired so we knocked it on the head.",
                        "vi": "Đến mười một giờ, tất cả chúng tôi đều mệt mỏi nên đã gõ vào đầu nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when talking about your previous good luck or your hopes for the future, to avoid bringing bad luck",
                    "vi": "được sử dụng khi nói về những điều may mắn trước đây của bạn hoặc hy vọng của bạn cho tương lai, để tránh mang lại những điều xui xẻo"
                },
                "examples": [
                    {
                        "en": "I've been driving for over 20 years and never had an accident—knock on wood!",
                        "vi": "Tôi đã lái xe hơn 20 năm và chưa bao giờ bị tai nạn — gõ vào gỗ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to surprise or shock somebody so much that they are unable to react immediately",
                    "vi": "gây bất ngờ hoặc gây sốc cho ai đó đến mức họ không thể phản ứng ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try and persuade somebody to stop behaving in a stupid way, sometimes using rough or violent methods",
                    "vi": "để cố gắng thuyết phục ai đó ngừng cư xử theo cách ngu ngốc, đôi khi sử dụng các phương pháp thô bạo hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "Try and talk some sense into her before she makes the wrong decision.",
                        "vi": "Hãy thử và nói với cô ấy một số ý nghĩa trước khi cô ấy đưa ra quyết định sai lầm."
                    },
                    {
                        "en": "Where would I be without you to knock some sense into my head?",
                        "vi": "Tôi sẽ ở đâu nếu không có bạn gõ vào đầu tôi một chút cảm giác?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very much better than somebody/something",
                    "vi": "trở nên tốt hơn rất nhiều so với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She knocks spots off all the other candidates.",
                        "vi": "Cô ấy đánh bật tất cả các ứng cử viên khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody lose their confidence and enthusiasm",
                    "vi": "làm cho ai đó mất tự tin và nhiệt tình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express surprise",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea30288ec9e347f7b3b95ea87c4ac681",
        "word": "knot",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/nɒt/",
            "us": "/nɑːt/"
        },
        "nearby": [
            {
                "word": "knoll",
                "pos": "noun"
            },
            {
                "word": "knot",
                "pos": "noun"
            },
            {
                "word": "knot",
                "pos": "verb"
            },
            {
                "word": "knotty",
                "pos": "adjective"
            },
            {
                "word": "know",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to fasten something with a knot or knots",
                    "vi": "để buộc chặt một cái gì đó bằng một nút hoặc nút thắt"
                },
                "examples": [
                    {
                        "en": "He carefully knotted his tie.",
                        "vi": "Anh cẩn thận thắt nút cà vạt."
                    },
                    {
                        "en": "She wore a scarf loosely knotted around her neck.",
                        "vi": "Cô ấy quàng một chiếc khăn quàng cổ được thắt hờ hững."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become twisted into a knot",
                    "vi": "trở nên xoắn thành một nút"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to twist hair into a particular shape",
                    "vi": "xoắn tóc thành một hình dạng cụ thể"
                },
                "examples": [
                    {
                        "en": "She wore her hair loosely knotted on top of her head.",
                        "vi": "Cô để tóc buộc lỏng trên đỉnh đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if muscles, etc. knot or something knots them, they become hard and painful because of fear, excitement, etc.",
                    "vi": "nếu cơ bắp, v.v. thắt chặt hoặc thứ gì đó thắt chặt chúng, chúng trở nên cứng và đau vì sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "She felt her stomach knot with fear.",
                        "vi": "Cô cảm thấy bụng mình thắt lại vì sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to go away or of telling them that you are annoyed with them",
                    "vi": "một cách thô lỗ để bảo ai đó biến đi hoặc nói với họ rằng bạn khó chịu với họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cce70330fd254f219ebe495aba614c28",
        "word": "lurch",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɜːtʃ/",
            "us": "/lɜːrtʃ/"
        },
        "nearby": [
            {
                "word": "lupine",
                "pos": "adjective"
            },
            {
                "word": "lupus",
                "pos": "noun"
            },
            {
                "word": "lurch",
                "pos": "verb"
            },
            {
                "word": "lurch",
                "pos": "noun"
            },
            {
                "word": "lurcher",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a sudden, unsteady movement forward or to one side",
                    "vi": "để thực hiện một chuyển động đột ngột, không ổn định về phía trước hoặc sang một bên"
                },
                "examples": [
                    {
                        "en": "Suddenly the horse lurched to one side and the child fell off.",
                        "vi": "Đột nhiên con ngựa chồm sang một bên và đứa trẻ ngã lăn ra."
                    },
                    {
                        "en": "The man lurched drunkenly out of the pub.",
                        "vi": "Người đàn ông say khướt bước ra khỏi quán rượu."
                    },
                    {
                        "en": "(figurative) Their relationship seems to lurch from one crisis to the next.",
                        "vi": "(nghĩa bóng) Mối quan hệ của họ dường như lình xình từ khủng hoảng này sang khủng hoảng khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your heart or stomach lurches, you have a sudden feeling of fear or excitement",
                    "vi": "nếu tim hoặc dạ dày của bạn rung lên, bạn có cảm giác sợ hãi hoặc phấn khích đột ngột"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "16728a8706a249428863175555e86e7d",
        "word": "make somebody’s blood run cold",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/blʌd/",
            "us": "/blʌd/"
        },
        "nearby": [
            {
                "word": "blonde",
                "pos": "noun"
            },
            {
                "word": "Blondie",
                "pos": ""
            },
            {
                "word": "blood",
                "pos": "noun"
            },
            {
                "word": "blood",
                "pos": "verb"
            },
            {
                "word": "blood bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red liquid that flows through the bodies of humans and animals",
                    "vi": "chất lỏng màu đỏ chảy qua cơ thể người và động vật"
                },
                "examples": [
                    {
                        "en": "He lost a lot of blood in the accident.",
                        "vi": "Anh ấy mất rất nhiều máu trong vụ tai nạn."
                    },
                    {
                        "en": "Blood was pouring out of a cut on her head.",
                        "vi": "Máu tuôn ra từ vết cắt trên đầu cô."
                    },
                    {
                        "en": "His hands were covered in blood.",
                        "vi": "Tay anh bê bết máu."
                    },
                    {
                        "en": "to give blood (= to have blood taken from you so that it can be used in the medical treatment of other people)",
                        "vi": "cho máu (= lấy máu từ bạn để nó có thể được sử dụng trong việc điều trị y tế cho người khác)"
                    },
                    {
                        "en": "After the attacks, people donated blood in record numbers.",
                        "vi": "Sau các vụ tấn công, người dân đã hiến máu với số lượng kỷ lục."
                    },
                    {
                        "en": "He was a hot-headed warrior, always too quick to shed blood (= attack and injure or kill somebody).",
                        "vi": "Anh ta là một chiến binh nóng nảy, luôn đổ máu quá nhanh (= tấn công và làm bị thương hoặc giết ai đó)."
                    },
                    {
                        "en": "to draw blood (= to wound a person so that they lose blood)",
                        "vi": "để lấy máu (= làm vết thương một người để họ mất máu)"
                    },
                    {
                        "en": "a drop/pool of blood",
                        "vi": "một giọt / vũng máu"
                    },
                    {
                        "en": "There was dried blood on her cheek.",
                        "vi": "Có vết máu khô trên má cô."
                    },
                    {
                        "en": "a blood cell/sample",
                        "vi": "một tế bào máu / mẫu"
                    },
                    {
                        "en": "to improve blood flow to the heart",
                        "vi": "cải thiện lưu lượng máu đến tim"
                    },
                    {
                        "en": "the blood supply to the brain",
                        "vi": "cung cấp máu cho não"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of blood mentioned",
                    "vi": "có nhóm máu được đề cập"
                },
                "examples": [
                    {
                        "en": "cold-blooded reptiles",
                        "vi": "loài bò sát máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "family origins",
                    "vi": "nguồn gốc gia đình"
                },
                "examples": [
                    {
                        "en": "She is of noble blood.",
                        "vi": "Cô ấy thuộc dòng máu quý tộc."
                    },
                    {
                        "en": "There is some Polish blood on his father's side.",
                        "vi": "Có chút dòng máu Ba Lan bên cha anh."
                    },
                    {
                        "en": "I doubt if I have a single drop of aristocratic blood in my veins.",
                        "vi": "Tôi nghi ngờ liệu mình có một giọt máu quý tộc trong huyết quản hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and fashionable man",
                    "vi": "một người đàn ông giàu có và thời trang"
                },
                "examples": [
                    {
                        "en": "a young blood",
                        "vi": "một dòng máu trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of hate or strong dislike",
                    "vi": "cảm giác ghét hoặc không thích mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody and want to hurt or punish them",
                    "vi": "tức giận với ai đó và muốn làm tổn thương hoặc trừng phạt họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a natural part of your character and of the character of other members of your family",
                    "vi": "trở thành một phần tự nhiên trong tính cách của bạn và tính cách của các thành viên khác trong gia đình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "family relationships are stronger than any others",
                    "vi": "mối quan hệ gia đình bền chặt hơn bất kỳ mối quan hệ nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody is very angry and ready to argue or fight",
                    "vi": "ai đó rất tức giận và sẵn sàng tranh luận hoặc chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hard work; a lot of effort",
                    "vi": "làm việc rất chăm chỉ; nhiều sự cố gắng"
                },
                "examples": [
                    {
                        "en": "The only way to succeed is through old-fashioned blood, sweat and tears.",
                        "vi": "Cách duy nhất để thành công là thông qua máu, mồ hôi và nước mắt của người già."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "almost impossible to obtain",
                    "vi": "hầu như không thể có được"
                },
                "examples": [
                    {
                        "en": "Getting an apology from him was like getting blood from a stone.",
                        "vi": "Nhận được một lời xin lỗi từ anh ấy giống như nhận được một hòn đá hộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody extremely angry",
                    "vi": "làm cho ai đó cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "The way he treats his employees really makes my blood boil.",
                        "vi": "Cách anh ấy đối xử với nhân viên thực sự khiến tôi sôi máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "new members or employees, especially young ones, with new ideas or ways of doing things",
                    "vi": "các thành viên hoặc nhân viên mới, đặc biệt là những người trẻ tuổi, với những ý tưởng hoặc cách làm mới"
                },
                "examples": [
                    {
                        "en": "This company badly needs to bring in some new blood.",
                        "vi": "Công ty này rất cần phải mang thêm một lượng máu mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill or wound somebody",
                    "vi": "giết hoặc làm bị thương ai đó"
                },
                "examples": [
                    {
                        "en": "Nothing can justify spilling innocent blood.",
                        "vi": "Không gì có thể biện minh cho việc đổ máu vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody excited",
                    "vi": "để làm cho ai đó phấn khích"
                },
                "examples": [
                    {
                        "en": "The atmosphere in a theatre never failed to stir her blood.",
                        "vi": "Bầu không khí trong rạp chiếu phim không bao giờ không khuấy động được máu của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": [
                    {
                        "en": "I sweated blood to get everything ready in time.",
                        "vi": "Tôi đổ mồ hôi máu để chuẩn bị mọi thứ kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d333fb0e13448a99768886a06985bec",
        "word": "menace",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmenəs/",
            "us": "/ˈmenəs/"
        },
        "nearby": [
            {
                "word": "memsahib",
                "pos": "noun"
            },
            {
                "word": "men",
                "pos": "noun"
            },
            {
                "word": "menace",
                "pos": "noun"
            },
            {
                "word": "menace",
                "pos": "verb"
            },
            {
                "word": "menacing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that causes, or may cause, serious damage, harm or danger",
                    "vi": "một người hoặc vật gây ra hoặc có thể gây ra thiệt hại nghiêm trọng, tổn hại hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "a new initiative aimed at beating the menace of illegal drugs",
                        "vi": "một sáng kiến mới nhằm đánh bại sự đe dọa của ma túy bất hợp pháp"
                    },
                    {
                        "en": "The communists remain a potential menace to the stability of the government.",
                        "vi": "Những người cộng sản vẫn là mối đe dọa tiềm tàng đối với sự ổn định của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an atmosphere that makes you feel threatened or frightened",
                    "vi": "một bầu không khí khiến bạn cảm thấy bị đe dọa hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "a sense/an air/a hint of menace in his voice",
                        "vi": "một cảm giác / một không khí / một chút đe dọa trong giọng nói của anh ta"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is annoying or causes trouble",
                    "vi": "một người hoặc vật gây phiền nhiễu hoặc gây rắc rối"
                },
                "examples": [
                    {
                        "en": "They have become a public menace.",
                        "vi": "Họ đã trở thành một mối đe dọa công khai."
                    }
                ]
            },
            {
                "define": {
                    "en": "threats that somebody will cause harm if they do not get what they are asking for",
                    "vi": "mối đe dọa mà ai đó sẽ gây ra tổn hại nếu họ không nhận được những gì họ đang yêu cầu"
                },
                "examples": [
                    {
                        "en": "with menaces to demand money with menaces",
                        "vi": "với menaces để đòi tiền với menaces"
                    }
                ]
            }
        ]
    },
    {
        "id": "3858e44d022e4aeb94de9e1dc1ddccb4",
        "word": "overawe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvərˈɔː/",
            "us": "/ˌəʊvərˈɔː/"
        },
        "nearby": [
            {
                "word": "overarm",
                "pos": "adverb"
            },
            {
                "word": "overate",
                "pos": "verb"
            },
            {
                "word": "overawe",
                "pos": "verb"
            },
            {
                "word": "overawed",
                "pos": "adjective"
            },
            {
                "word": "overbalance",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to impress somebody so much that they feel nervous or frightened",
                    "vi": "để gây ấn tượng với ai đó đến nỗi họ cảm thấy lo lắng hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "The younger players were overawed by the occasion and played badly.",
                        "vi": "Các cầu thủ trẻ đã bị quá đà và chơi tệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2c7c880fd2124c0fad30679b1c3033c8",
        "word": "palpitate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpælpɪteɪt/",
            "us": "/ˈpælpɪteɪt/"
        },
        "nearby": [
            {
                "word": "palpate",
                "pos": "verb"
            },
            {
                "word": "palpation",
                "pos": "noun"
            },
            {
                "word": "palpitate",
                "pos": "verb"
            },
            {
                "word": "palpitations",
                "pos": "noun"
            },
            {
                "word": "palsied",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to beat rapidly and/or in an irregular way especially because of fear or excitement",
                    "vi": "đập nhanh và / hoặc theo cách không đều, đặc biệt là vì sợ hãi hoặc phấn khích"
                },
                "examples": [
                    {
                        "en": "He was aware of his palpitating heart.",
                        "vi": "Anh nhận thức được trái tim đang đập loạn nhịp của mình."
                    },
                    {
                        "en": "Her heart was palpitating wildly.",
                        "vi": "Tim cô đập loạn xạ."
                    }
                ]
            }
        ]
    },
    {
        "id": "200c80181d09473c9594ac12864041ee",
        "word": "paranoia",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpærəˈnɔɪə/",
            "us": "/ˌpærəˈnɔɪə/"
        },
        "nearby": [
            {
                "word": "Paramount Pictures",
                "pos": ""
            },
            {
                "word": "paramour",
                "pos": "noun"
            },
            {
                "word": "paranoia",
                "pos": "noun"
            },
            {
                "word": "paranoid",
                "pos": "adjective"
            },
            {
                "word": "paranoid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mental illness in which a person wrongly believes that other people are trying to harm them, that they are somebody very important, etc.",
                    "vi": "một bệnh tâm thần trong đó một người tin nhầm rằng người khác đang cố gắng làm hại họ, rằng họ là ai đó rất quan trọng, v.v."
                },
                "examples": [
                    {
                        "en": "The drugs can induce paranoia.",
                        "vi": "Thuốc có thể gây ra chứng hoang tưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "fear of other people when there is no evidence or reason for this",
                    "vi": "sợ người khác khi không có bằng chứng hoặc lý do cho việc này"
                },
                "examples": [
                    {
                        "en": "External threats will just fuel paranoia among those in power.",
                        "vi": "Các mối đe dọa bên ngoài sẽ chỉ tạo ra sự hoang tưởng cho những người nắm quyền."
                    },
                    {
                        "en": "I was guilty perhaps of mild paranoia.",
                        "vi": "Có lẽ tôi đã phạm tội hoang tưởng nhẹ."
                    },
                    {
                        "en": "The paranoia is setting in.",
                        "vi": "Sự hoang tưởng đang diễn ra."
                    },
                    {
                        "en": "The regime is in the grip of severe paranoia.",
                        "vi": "Chế độ này đang bị mắc chứng hoang tưởng nghiêm trọng."
                    },
                    {
                        "en": "the anti-communist paranoia of the 1950s",
                        "vi": "sự hoang tưởng chống cộng của những năm 1950"
                    },
                    {
                        "en": "his paranoia that people might find out",
                        "vi": "sự hoang tưởng của anh ấy rằng mọi người có thể phát hiện ra"
                    }
                ]
            }
        ]
    },
    {
        "id": "e8cf11e8da074e56aceaa47f036135fc",
        "word": "petrified",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpetrɪfaɪd/",
            "us": "/ˈpetrɪfaɪd/"
        },
        "nearby": [
            {
                "word": "petrel",
                "pos": "noun"
            },
            {
                "word": "Petri dish",
                "pos": "noun"
            },
            {
                "word": "petrified",
                "pos": "adjective"
            },
            {
                "word": "the Petrified Forest",
                "pos": ""
            },
            {
                "word": "petrify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely frightened",
                    "vi": "cực kỳ sợ hãi"
                },
                "examples": [
                    {
                        "en": "a petrified expression",
                        "vi": "một biểu hiện hóa đá"
                    },
                    {
                        "en": "petrified (of something) I'm petrified of snakes.",
                        "vi": "hóa đá (về cái gì đó) Tôi hóa đá vì rắn."
                    },
                    {
                        "en": "They were petrified with fear (= so frightened that they were unable to move or think).",
                        "vi": "Họ đã bị hóa đá vì sợ hãi (= sợ hãi đến mức không thể cử động hay suy nghĩ được)."
                    },
                    {
                        "en": "petrified (that…) She was petrified that the police would burst in at any moment.",
                        "vi": "hóa đá (điều đó…) Cô ấy đã hóa đá rằng cảnh sát sẽ ập vào bất cứ lúc nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "petrified trees, insects, etc. have died and been changed into stone over a very long period of time",
                    "vi": "cây cối hóa đá, côn trùng, vv đã chết và bị thay đổi thành đá trong một thời gian rất dài"
                },
                "examples": [
                    {
                        "en": "a petrified forest",
                        "vi": "một khu rừng hóa đá"
                    }
                ]
            }
        ]
    },
    {
        "id": "b44844796da54769955cadb36d8651ba",
        "word": "petrify",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpetrɪfaɪ/",
            "us": "/ˈpetrɪfaɪ/"
        },
        "nearby": [
            {
                "word": "petrified",
                "pos": "adjective"
            },
            {
                "word": "the Petrified Forest",
                "pos": ""
            },
            {
                "word": "petrify",
                "pos": "verb"
            },
            {
                "word": "petro-",
                "pos": "combining form"
            },
            {
                "word": "petrochemical",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel extremely frightened",
                    "vi": "làm cho ai đó cảm thấy vô cùng sợ hãi"
                },
                "examples": [
                    {
                        "en": "Just the thought of making a speech petrifies me.",
                        "vi": "Chỉ nghĩ đến việc phát biểu thôi đã khiến tôi hóa đá."
                    },
                    {
                        "en": "His icy stare petrified her.",
                        "vi": "Ánh mắt băng giá của anh khiến cô như hóa đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change or to make something change into a substance like stone",
                    "vi": "để thay đổi hoặc làm cho một thứ gì đó biến đổi thành một chất như đá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bffa82fb366340e1a1eb4dc5d7c87b7e",
        "word": "prickle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprɪkl/",
            "us": "/ˈprɪkl/"
        },
        "nearby": [
            {
                "word": "prick",
                "pos": "verb"
            },
            {
                "word": "prick",
                "pos": "noun"
            },
            {
                "word": "prickle",
                "pos": "verb"
            },
            {
                "word": "prickle",
                "pos": "noun"
            },
            {
                "word": "prickly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody an unpleasant feeling on their skin, as if a lot of small sharp points are pushing into it",
                    "vi": "tạo cho ai đó cảm giác khó chịu trên da của họ, như thể có nhiều đầu nhọn nhỏ đang đâm vào"
                },
                "examples": [
                    {
                        "en": "The rough cloth prickled my skin.",
                        "vi": "Lớp vải thô ráp như châm chích trên da tôi."
                    },
                    {
                        "en": "His moustache prickled when he kissed me.",
                        "vi": "Bộ ria mép của anh ấy như kim châm khi anh ấy hôn tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel strange and unpleasant because you are frightened, angry, excited, etc.",
                    "vi": "cảm thấy kỳ lạ và khó chịu vì bạn sợ hãi, tức giận, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "Her eyes prickled with tears.",
                        "vi": "Đôi mắt cô rưng rưng."
                    },
                    {
                        "en": "The thought made her prickle with excitement.",
                        "vi": "Ý nghĩ đó khiến cô sởn gai ốc vì phấn khích."
                    },
                    {
                        "en": "The hairs on the back of my neck prickled when I heard the door open.",
                        "vi": "Tôi sởn cả tóc gáy khi nghe tiếng mở cửa."
                    },
                    {
                        "en": "(figurative) He prickled (= became angry) at the suggestion that it had been his fault.",
                        "vi": "(nghĩa bóng) Anh ấy nổi gai ốc (= trở nên tức giận) trước ý kiến cho rằng đó là lỗi của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d6baf96b5574238bc62fc3202695a38",
        "word": "quail",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kweɪl/",
            "us": "/kweɪl/"
        },
        "nearby": [
            {
                "word": "quahog",
                "pos": "noun"
            },
            {
                "word": "quail",
                "pos": "noun"
            },
            {
                "word": "quail",
                "pos": "verb"
            },
            {
                "word": "quaint",
                "pos": "adjective"
            },
            {
                "word": "quaintly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel frightened or to show that you are frightened",
                    "vi": "cảm thấy sợ hãi hoặc thể hiện rằng bạn đang sợ hãi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "277b6553bf9b47fca7067802ed6ccb93",
        "word": "rattle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrætl/",
            "us": "/ˈrætl/"
        },
        "nearby": [
            {
                "word": "rattan",
                "pos": "noun"
            },
            {
                "word": "Terence Rattigan",
                "pos": ""
            },
            {
                "word": "rattle",
                "pos": "verb"
            },
            {
                "word": "rattle",
                "pos": "noun"
            },
            {
                "word": "rattle around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a series of short loud sounds when shaking or hitting against something hard; to make something do this",
                    "vi": "tạo ra một loạt âm thanh lớn ngắn khi lắc hoặc va vào vật cứng; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Every time a bus went past, the windows rattled.",
                        "vi": "Mỗi khi có xe buýt chạy qua, cửa sổ kêu lục cục."
                    },
                    {
                        "en": "He shook me so hard that my teeth rattled.",
                        "vi": "Anh ấy lay tôi mạnh đến nỗi răng tôi kêu lục cục."
                    },
                    {
                        "en": "She stood there, rattling the collecting tin.",
                        "vi": "Cô đứng đó, khua khoắng chiếc hộp thiếc đang thu thập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a series of short loud sounds as it moves somewhere",
                    "vi": "để tạo ra một chuỗi âm thanh lớn ngắn khi nó di chuyển đến một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "A convoy of trucks rattled by.",
                        "vi": "Một đoàn xe tải chạy qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody nervous or frightened",
                    "vi": "làm cho ai đó lo lắng hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "He was clearly rattled by the question.",
                        "vi": "Anh ấy rõ ràng là bối rối trước câu hỏi."
                    },
                    {
                        "en": "Are you all right? You look a bit rattled.",
                        "vi": "Bạn ổn chứ? Bạn trông hơi bối rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "Who's rattled his cage?",
                        "vi": "Ai đang xới tung lồng của mình?"
                    }
                ]
            }
        ]
    },
    {
        "id": "40558823a86b40afa2d823aaa1220383",
        "word": "recoil",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈkɔɪl/",
            "us": "/rɪˈkɔɪl/"
        },
        "nearby": [
            {
                "word": "recognizance",
                "pos": "noun"
            },
            {
                "word": "recognize",
                "pos": "verb"
            },
            {
                "word": "recoil",
                "pos": "verb"
            },
            {
                "word": "recoil",
                "pos": "noun"
            },
            {
                "word": "recollect",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move your body quickly away from somebody/something because you find them or it frightening or unpleasant",
                    "vi": "để di chuyển cơ thể của bạn nhanh chóng khỏi ai đó / điều gì đó bởi vì bạn thấy họ hoặc điều đó khiến bạn sợ hãi hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "recoil (from somebody/something) She recoiled from his touch.",
                        "vi": "giật lại (từ ai đó / cái gì đó) Cô ấy giật mình sau cú chạm của anh ấy."
                    },
                    {
                        "en": "recoil at something He recoiled in horror at the sight of the corpse.",
                        "vi": "giật mình trước một cái gì đó Anh giật mình kinh hãi khi nhìn thấy cái xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react to an idea or a situation with strong dislike or fear",
                    "vi": "phản ứng với một ý tưởng hoặc một tình huống với sự không thích hoặc sợ hãi mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "recoil from (doing) something She recoiled from the idea of betraying her own brother.",
                        "vi": "rút lui khỏi (làm) điều gì đó Cô ấy rút lui khỏi ý tưởng phản bội chính anh trai của mình."
                    },
                    {
                        "en": "recoil at something Tell him the truth? I recoiled at the thought.",
                        "vi": "giật mình trước một cái gì đó Hãy nói cho anh ta biết sự thật? Tôi giật mình vì suy nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move suddenly backwards when it is fired",
                    "vi": "di chuyển đột ngột về phía sau khi nó được bắn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0dafcca0632f476ca3232a74a82a1420",
        "word": "shake in your boots/shoes",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃeɪk/",
            "us": "/ʃeɪk/"
        },
        "nearby": [
            {
                "word": "shahada",
                "pos": "noun"
            },
            {
                "word": "shaikh",
                "pos": "noun"
            },
            {
                "word": "shake",
                "pos": "verb"
            },
            {
                "word": "shake",
                "pos": "noun"
            },
            {
                "word": "shake down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move or make somebody/something move with short quick movements from side to side or up and down",
                    "vi": "để di chuyển hoặc làm cho ai đó / cái gì đó di chuyển bằng các chuyển động nhanh ngắn từ bên này sang bên kia hoặc lên và xuống"
                },
                "examples": [
                    {
                        "en": "The whole house shakes when a train goes past.",
                        "vi": "Cả ngôi nhà rung chuyển khi một đoàn tàu chạy qua."
                    },
                    {
                        "en": "shake somebody/something Shake the bottle well before use.",
                        "vi": "lắc ai đó / cái gì đó Lắc kỹ chai trước khi sử dụng."
                    },
                    {
                        "en": "The explosion shook windows miles from the site.",
                        "vi": "Vụ nổ làm rung chuyển các cửa sổ cách khu vực này hàng km."
                    },
                    {
                        "en": "shake somebody/something by something He shook her violently by the shoulders.",
                        "vi": "lắc ai đó / cái gì đó bởi một cái gì đó Anh ta lắc cô ấy một cách thô bạo bằng vai."
                    },
                    {
                        "en": "shake somebody/something + adj. He knelt and gently shook her awake.",
                        "vi": "lắc ai đó / cái gì đó + adj. Anh quỳ xuống và nhẹ nhàng lay cô tỉnh giấc."
                    },
                    {
                        "en": "She shook her hair loose.",
                        "vi": "Cô rũ tóc xõa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move something in a particular direction by shaking",
                    "vi": "để di chuyển một cái gì đó theo một hướng cụ thể bằng cách lắc"
                },
                "examples": [
                    {
                        "en": "She bent down to shake a pebble out of her shoe.",
                        "vi": "Cô cúi xuống để giũ một viên sỏi ra khỏi giày."
                    },
                    {
                        "en": "His father used to come home and shake the dust off his work clothes.",
                        "vi": "Cha anh thường về nhà và rũ bỏ lớp bụi trên bộ quần áo đi làm của mình."
                    },
                    {
                        "en": "He stood up, shaking sand everywhere.",
                        "vi": "Anh đứng dậy, làm rung chuyển cát khắp nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take somebody’s hand and move it up and down as a way of saying hello or to show that you agree about something",
                    "vi": "nắm lấy tay ai đó và di chuyển lên xuống như một cách chào hỏi hoặc để thể hiện rằng bạn đồng ý về điều gì đó"
                },
                "examples": [
                    {
                        "en": "shake hands Do people in Italy shake hands when they meet?",
                        "vi": "bắt tay Mọi người ở Ý có bắt tay nhau khi gặp nhau không?"
                    },
                    {
                        "en": "shake hands with somebody She refused to shake hands with him.",
                        "vi": "bắt tay với ai đó Cô từ chối bắt tay với anh ta."
                    },
                    {
                        "en": "shake somebody’s hand He stepped forward and shook my hand.",
                        "vi": "bắt tay ai đó Anh ấy bước tới và bắt tay tôi."
                    },
                    {
                        "en": "shake somebody by the hand Our host shook each of us warmly by the hand.",
                        "vi": "bắt tay ai đó Chủ nhà của chúng tôi bắt tay nồng nhiệt từng người chúng tôi."
                    },
                    {
                        "en": "shake hands on something They shook hands on the deal (= to show that they had reached an agreement).",
                        "vi": "bắt tay vào một cái gì đó Họ đã bắt tay vào thỏa thuận (= để cho thấy rằng họ đã đạt được một thỏa thuận)."
                    },
                    {
                        "en": "shake on something They shook on the deal (= shook hands to show the deal was agreed).",
                        "vi": "lắc về cái gì đó Họ đã bắt tay vào thỏa thuận (= bắt tay để thể hiện rằng thỏa thuận đã được đồng ý)."
                    },
                    {
                        "en": "Let's shake on it.",
                        "vi": "Hãy bắt tay vào nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn your head from side to side as a way of saying ‘no’ or to show that you are sad, feel doubt, etc.",
                    "vi": "quay đầu từ bên này sang bên kia như một cách để nói 'không' hoặc để thể hiện rằng bạn đang buồn, cảm thấy nghi ngờ, v.v."
                },
                "examples": [
                    {
                        "en": "‘Drink?’ he offered. She shook her head.",
                        "vi": "Uống?' anh ấy đề nghị. Cô ta lắc đầu."
                    },
                    {
                        "en": "The old man watched them walk off into the night, shaking his head sadly.",
                        "vi": "Ông lão nhìn họ đi vào bóng đêm, buồn bã lắc đầu."
                    },
                    {
                        "en": "She shook her head in disbelief.",
                        "vi": "Cô lắc đầu không tin."
                    },
                    {
                        "en": "He shook his head at the thought.",
                        "vi": "Anh lắc đầu với ý nghĩ đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are angry with somebody; to threaten somebody by shaking your fist (= closed hand)",
                    "vi": "để cho thấy rằng bạn đang tức giận với ai đó; đe dọa ai đó bằng cách lắc nắm tay của bạn (= bàn tay khép lại)"
                },
                "examples": [
                    {
                        "en": "The man shook his fist at the court after he was sentenced.",
                        "vi": "Người đàn ông bắt tay trước tòa sau khi bị tuyên án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make short quick movements that you cannot control, for example because you are cold or afraid",
                    "vi": "để thực hiện các chuyển động nhanh ngắn mà bạn không thể kiểm soát, chẳng hạn như vì bạn lạnh hoặc sợ"
                },
                "examples": [
                    {
                        "en": "Her hands had started to shake.",
                        "vi": "Tay cô bắt đầu run."
                    },
                    {
                        "en": "shake with something He was shaking with fear.",
                        "vi": "run rẩy với một cái gì đó Anh ấy đang run rẩy vì sợ hãi."
                    },
                    {
                        "en": "He saw his mother turn away, her shoulders shaking with laughter.",
                        "vi": "Anh thấy mẹ quay đi, đôi vai rung lên vì cười."
                    },
                    {
                        "en": "His whole body shook with rage.",
                        "vi": "Toàn thân anh rung lên vì thịnh nộ."
                    },
                    {
                        "en": "I was shaking like a leaf.",
                        "vi": "Tôi run như một chiếc lá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sound unsteady, usually because you are nervous, upset or angry",
                    "vi": "nghe không ổn định, thường là do bạn đang lo lắng, khó chịu hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "‘Who are you?’ he asked, his voice shaking.",
                        "vi": "Bạn là ai?' anh hỏi, giọng run run."
                    },
                    {
                        "en": "Her voice shook with emotion.",
                        "vi": "Giọng cô ấy run lên vì xúc động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shock or upset somebody very much",
                    "vi": "gây sốc hoặc làm ai đó buồn rất nhiều"
                },
                "examples": [
                    {
                        "en": "shake somebody He was badly shaken by the news of her death.",
                        "vi": "rung chuyển ai đó Anh ấy bị chấn động nặng nề trước tin cô ấy qua đời."
                    },
                    {
                        "en": "shake somebody up The accident really shook her up.",
                        "vi": "lay động ai đó Vụ tai nạn thực sự làm cô ấy rung động."
                    },
                    {
                        "en": "Shaken up by the early goal against them, the team began to fight back.",
                        "vi": "Bị chấn động bởi bàn thua sớm chống lại họ, cả đội bắt đầu chống trả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a belief or an idea less certain",
                    "vi": "để làm cho một niềm tin hoặc một ý tưởng ít chắc chắn hơn"
                },
                "examples": [
                    {
                        "en": "The incident had shaken her faith in him.",
                        "vi": "Sự việc đã làm lung lay niềm tin của cô đối với anh."
                    },
                    {
                        "en": "This announcement is bound to shake the confidence of the industry.",
                        "vi": "Thông báo này chắc chắn sẽ làm lung lay niềm tin của ngành công nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of something",
                    "vi": "bỏ một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "shake something off I can't seem to shake off this cold.",
                        "vi": "rũ bỏ thứ gì đó Tôi dường như không thể rũ bỏ được cái lạnh này."
                    },
                    {
                        "en": "She has finally managed to shake off her old wrist injury.",
                        "vi": "Cuối cùng cô ấy cũng đã thoát khỏi vết thương ở cổ tay cũ của mình."
                    },
                    {
                        "en": "shake something He couldn't shake the feeling that there was something wrong.",
                        "vi": "lắc một cái gì đó Anh không thể lay chuyển cảm giác rằng có điều gì đó không ổn."
                    },
                    {
                        "en": "She never seemed to completely shake off the dumb blonde image.",
                        "vi": "Cô dường như chưa bao giờ rũ bỏ hoàn toàn hình ảnh tóc vàng hoe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause people to question their basic beliefs about something",
                    "vi": "khiến mọi người đặt câu hỏi về niềm tin cơ bản của họ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "This issue has shaken the foundations of French politics.",
                        "vi": "Vấn đề này đã làm lung lay nền tảng của chính trị Pháp."
                    },
                    {
                        "en": "an event which rocked the foundations of British politics",
                        "vi": "một sự kiện làm rung chuyển nền chính trị của Anh"
                    },
                    {
                        "en": "The scandal rocked the legal establishment to its foundations.",
                        "vi": "Vụ bê bối đã làm rung chuyển cơ sở pháp lý về nền tảng của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very frightened or nervous",
                    "vi": "rất sợ hãi hoặc lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody to start to do something or to hurry",
                    "vi": "được sử dụng để nói với ai đó bắt đầu làm điều gì đó hoặc nhanh lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0d59816035d248a6936ac62c3d264479",
        "word": "shriek",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃriːk/",
            "us": "/ʃriːk/"
        },
        "nearby": [
            {
                "word": "Shrewsbury School",
                "pos": ""
            },
            {
                "word": "Shri",
                "pos": "noun"
            },
            {
                "word": "shriek",
                "pos": "verb"
            },
            {
                "word": "shriek",
                "pos": "noun"
            },
            {
                "word": "shrift",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a loud high shout, for example when you are excited, frightened or in pain",
                    "vi": "hét to, ví dụ như khi bạn đang phấn khích, sợ hãi hoặc đau đớn"
                },
                "examples": [
                    {
                        "en": "shriek (in something) She shrieked in fright.",
                        "vi": "cô ấy hét lên vì sợ hãi."
                    },
                    {
                        "en": "shriek with something The audience was shrieking with laughter.",
                        "vi": "thét lên với một cái gì đó. Khán giả đang hét lên vì cười."
                    },
                    {
                        "en": "He all but shrieked when he saw her.",
                        "vi": "Tất cả, anh ta đều thét lên khi nhìn thấy cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something in a loud, high voice",
                    "vi": "nói điều gì đó với giọng lớn và cao"
                },
                "examples": [
                    {
                        "en": "shriek something He shrieked her name as he fell.",
                        "vi": "hét lên cái gì đó Anh hét lên tên cô khi anh ngã xuống."
                    },
                    {
                        "en": "shriek something at somebody She was shrieking abuse at them as they carried her off.",
                        "vi": "hét lên điều gì đó với ai đó Cô ấy hét lên sự lạm dụng vào họ khi họ mang cô ấy đi."
                    },
                    {
                        "en": "shriek at somebody Stop shrieking at me!",
                        "vi": "thét lên với ai đó Đừng hét vào mặt tôi nữa!"
                    },
                    {
                        "en": "+ speech ‘Look out!’ he shrieked.",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "0efdfab4f7a348fba20712fb87741b82",
        "word": "shriek",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃriːk/",
            "us": "/ʃriːk/"
        },
        "nearby": [
            {
                "word": "Shri",
                "pos": "noun"
            },
            {
                "word": "shriek",
                "pos": "verb"
            },
            {
                "word": "shriek",
                "pos": "noun"
            },
            {
                "word": "shrift",
                "pos": "noun"
            },
            {
                "word": "shrike",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loud high shout, for example one that you make when you are excited, frightened or in pain",
                    "vi": "một tiếng hét lớn, ví dụ như một tiếng hét mà bạn tạo ra khi bạn đang phấn khích, sợ hãi hoặc đau đớn"
                },
                "examples": [
                    {
                        "en": "She let out a piercing shriek.",
                        "vi": "Cô hét lên một tiếng chói tai."
                    },
                    {
                        "en": "a shriek of delight",
                        "vi": "một tiếng thét vui sướng"
                    },
                    {
                        "en": "Shrieks of laughter came from the bedroom.",
                        "vi": "Những tràng cười ré lên từ phòng ngủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4d00cde401b4443934c2e89c631c562",
        "word": "shrink",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃrɪŋk/",
            "us": "/ʃrɪŋk/"
        },
        "nearby": [
            {
                "word": "shrimp scampi",
                "pos": "noun"
            },
            {
                "word": "shrine",
                "pos": "noun"
            },
            {
                "word": "shrink",
                "pos": "verb"
            },
            {
                "word": "shrink",
                "pos": "noun"
            },
            {
                "word": "shrinkage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become smaller, especially when washed in water that is too hot; to make clothes, cloth, etc. smaller in this way",
                    "vi": "trở nên nhỏ hơn, đặc biệt là khi rửa trong nước quá nóng; để làm cho quần áo, vải, v.v. nhỏ hơn theo cách này"
                },
                "examples": [
                    {
                        "en": "My sweater shrank in the wash.",
                        "vi": "Áo len của tôi bị co lại khi giặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or to make something smaller in size or amount",
                    "vi": "để trở thành hoặc làm cho một thứ gì đó có kích thước hoặc số lượng nhỏ hơn"
                },
                "examples": [
                    {
                        "en": "The tumour had shrunk to the size of a pea.",
                        "vi": "Khối u đã thu nhỏ lại bằng hạt đậu."
                    },
                    {
                        "en": "The market for their products is shrinking.",
                        "vi": "Thị trường tiêu thụ sản phẩm của họ đang bị thu hẹp."
                    },
                    {
                        "en": "shrink something The internet in a sense has shrunk the world.",
                        "vi": "thu nhỏ thứ gì đó Internet theo một nghĩa nào đó đã thu nhỏ thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move back or away from something because you are frightened or shocked",
                    "vi": "lùi lại hoặc tránh xa thứ gì đó vì bạn đang sợ hãi hoặc bị sốc"
                },
                "examples": [
                    {
                        "en": "He shrank back against the wall as he heard them approaching.",
                        "vi": "Anh dựa lưng vào tường khi nghe thấy tiếng họ đến gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very shy person",
                    "vi": "một người rất nhút nhát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e392322d285b48c586074804934e5295",
        "word": "shudder",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃʌdə(r)/",
            "us": "/ˈʃʌdər/"
        },
        "nearby": [
            {
                "word": "shuck",
                "pos": "verb"
            },
            {
                "word": "shucks",
                "pos": "exclamation"
            },
            {
                "word": "shudder",
                "pos": "verb"
            },
            {
                "word": "shudder",
                "pos": "noun"
            },
            {
                "word": "shuffle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to shake because you are cold or frightened, or because of a strong feeling",
                    "vi": "run vì lạnh hoặc sợ hãi, hoặc vì cảm giác mạnh"
                },
                "examples": [
                    {
                        "en": "Just thinking about the accident makes me shudder.",
                        "vi": "Chỉ nghĩ đến vụ tai nạn thôi cũng khiến tôi rùng mình."
                    },
                    {
                        "en": "shudder with something Alone in the car, she shuddered with fear.",
                        "vi": "rùng mình với điều gì đó Một mình trong xe, cô rùng mình sợ hãi."
                    },
                    {
                        "en": "shudder at something I shuddered at the thought of all the trouble I'd caused.",
                        "vi": "rùng mình vì điều gì đó Tôi rùng mình khi nghĩ đến tất cả những rắc rối mà tôi đã gây ra."
                    },
                    {
                        "en": "shudder to do something I shudder to think how much this is all going to cost (= I don't want to think about it because it is too unpleasant).",
                        "vi": "rùng mình để làm điều gì đó Tôi rùng mình khi nghĩ rằng tất cả những thứ này sẽ tốn kém bao nhiêu (= Tôi không muốn nghĩ về nó vì nó quá khó chịu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shake very hard",
                    "vi": "lắc rất mạnh"
                },
                "examples": [
                    {
                        "en": "The bus shuddered to a halt.",
                        "vi": "Chiếc xe buýt rùng mình dừng lại."
                    },
                    {
                        "en": "The floor was shuddering beneath us.",
                        "vi": "Sàn nhà rùng mình bên dưới chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "724c13fc943a4e48980390df00587f11",
        "word": "spineless",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspaɪnləs/",
            "us": "/ˈspaɪnləs/"
        },
        "nearby": [
            {
                "word": "spine-chiller",
                "pos": "noun"
            },
            {
                "word": "spine-chilling",
                "pos": "adjective"
            },
            {
                "word": "spineless",
                "pos": "adjective"
            },
            {
                "word": "spinet",
                "pos": "noun"
            },
            {
                "word": "spine-tingling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "weak and easily frightened",
                    "vi": "yếu ớt và dễ sợ hãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having no spine (= the long bone in the back)",
                    "vi": "không có xương sống (= xương dài ở lưng)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having no spines (= sharp parts like needles)",
                    "vi": "không có gai (= các bộ phận sắc nhọn như kim)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0957d43904a749608aa21ea992ea8a00",
        "word": "spook",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/spuːk/",
            "us": "/spuːk/"
        },
        "nearby": [
            {
                "word": "spoofing",
                "pos": "noun"
            },
            {
                "word": "spook",
                "pos": "noun"
            },
            {
                "word": "spook",
                "pos": "verb"
            },
            {
                "word": "spooky",
                "pos": "adjective"
            },
            {
                "word": "spool",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to frighten a person or an animal; to become frightened",
                    "vi": "làm cho một người hoặc một con vật sợ hãi; trở nên sợ hãi"
                },
                "examples": [
                    {
                        "en": "be spooked (by somebody/something) We were spooked by the strange noises and lights.",
                        "vi": "bị làm cho sợ hãi (bởi ai đó / cái gì đó) Chúng tôi đã bị hoảng sợ bởi những tiếng động và ánh sáng kỳ lạ."
                    },
                    {
                        "en": "spook at something The horse spooked at the siren.",
                        "vi": "đã nhìn vào cái gì đó Con ngựa đã nhìn vào tiếng còi."
                    }
                ]
            }
        ]
    },
    {
        "id": "37ece66630b7490d9da5a36e08518bf9",
        "word": "tremor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtremə(r)/",
            "us": "/ˈtremər/"
        },
        "nearby": [
            {
                "word": "tremendously",
                "pos": "adverb"
            },
            {
                "word": "tremolo",
                "pos": "noun"
            },
            {
                "word": "tremor",
                "pos": "noun"
            },
            {
                "word": "tremulous",
                "pos": "adjective"
            },
            {
                "word": "tremulously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small earthquake in which the ground shakes slightly",
                    "vi": "một trận động đất nhỏ trong đó mặt đất rung chuyển nhẹ"
                },
                "examples": [
                    {
                        "en": "an earth tremor",
                        "vi": "chấn động trái đất"
                    },
                    {
                        "en": "(figurative) The scandal sent tremors through the political establishment.",
                        "vi": "(nghĩa bóng) Vụ bê bối gây chấn động khắp cơ sở chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "a slight shaking movement in a part of your body caused, for example, by cold or fear",
                    "vi": "một chuyển động rung lắc nhẹ ở một phần cơ thể của bạn, chẳng hạn như do lạnh hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "There was a slight tremor in his voice.",
                        "vi": "Có một chút run rẩy trong giọng nói của anh ta."
                    },
                    {
                        "en": "She felt a tremor of fear run through her.",
                        "vi": "Cô cảm thấy sợ hãi run lên trong mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6beed14de10c41799e8f54c8aba30b6b",
        "word": "the willies",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈwɪliz/",
            "us": "/ðə ˈwɪliz/"
        },
        "nearby": [
            {
                "word": "William the Conqueror",
                "pos": ""
            },
            {
                "word": "willie",
                "pos": "noun"
            },
            {
                "word": "the willies",
                "pos": "noun"
            },
            {
                "word": "willing",
                "pos": "adjective"
            },
            {
                "word": "willingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something gives you the willies, you are frightened by it or find it unpleasant",
                    "vi": "nếu một cái gì đó mang lại cho bạn ý chí, bạn sợ hãi vì nó hoặc cảm thấy nó khó chịu"
                },
                "examples": []
            }
        ]
    }
]