[
    {
        "id": "b3fd56108d2b4078b27171fd53b45f38",
        "word": "ice",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/aɪs/",
            "us": "/aɪs/"
        },
        "nearby": [
            {
                "word": "-ical",
                "pos": "suffix"
            },
            {
                "word": "-ically",
                "pos": "suffix"
            },
            {
                "word": "ice",
                "pos": "noun"
            },
            {
                "word": "ice",
                "pos": "verb"
            },
            {
                "word": "ICE",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "water that has frozen and become solid",
                    "vi": "nước đã đóng băng và trở nên rắn"
                },
                "examples": [
                    {
                        "en": "There was ice on the windows.",
                        "vi": "Có băng trên cửa sổ."
                    },
                    {
                        "en": "The lake was covered with a sheet of ice.",
                        "vi": "Mặt hồ được bao phủ bởi một lớp băng."
                    },
                    {
                        "en": "the body of a man perfectly preserved in a block of ice",
                        "vi": "cơ thể của một người đàn ông được bảo quản hoàn hảo trong một khối băng"
                    },
                    {
                        "en": "My hands are as cold as ice.",
                        "vi": "Tay tôi lạnh như băng."
                    },
                    {
                        "en": "substantial loss of sea ice in the Arctic Ocean",
                        "vi": "mất đáng kể băng biển ở Bắc Băng Dương"
                    }
                ]
            },
            {
                "define": {
                    "en": "a frozen surface that people skate on",
                    "vi": "bề mặt đóng băng mà mọi người trượt băng"
                },
                "examples": [
                    {
                        "en": "on the ice Both teams are on the ice, waiting for the whistle.",
                        "vi": "trên băng Cả hai đội đang băng lên chờ tiếng còi."
                    },
                    {
                        "en": "The dancers came out onto the ice.",
                        "vi": "Các vũ công bước ra sân băng."
                    },
                    {
                        "en": "People were skating on the ice.",
                        "vi": "Mọi người đang trượt băng trên băng."
                    },
                    {
                        "en": "They held hands as they glided across the ice.",
                        "vi": "Họ nắm tay nhau khi lướt trên mặt băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ice used to keep food and drinks cold",
                    "vi": "một miếng đá được sử dụng để giữ lạnh thức ăn và đồ uống"
                },
                "examples": [
                    {
                        "en": "I'll have lemonade please—no ice.",
                        "vi": "Làm ơn cho tôi uống nước chanh — không đá."
                    },
                    {
                        "en": "a glass of water with ice and lemon",
                        "vi": "một ly nước đá và chanh"
                    },
                    {
                        "en": "She ordered a vodka and ice.",
                        "vi": "Cô ấy gọi một vodka và đá."
                    },
                    {
                        "en": "The glass was filled with green liquid and crushed ice.",
                        "vi": "Ly chứa đầy chất lỏng màu xanh lục và đá vụn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an ice cream",
                    "vi": "một cây kem"
                },
                "examples": [
                    {
                        "en": "Drinks, ices and popcorn are all on sale in the foyer.",
                        "vi": "Đồ uống, kem và bỏng ngô đều được bày bán trong tiền sảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of sweet food that consists of ice that has been crushed (= broken into very small pieces) and given a sweet taste",
                    "vi": "một loại thức ăn ngọt bao gồm đá được nghiền nhỏ (= vỡ thành những miếng rất nhỏ) và có vị ngọt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be taking a risk",
                    "vi": "mạo hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say or do something that makes people feel more relaxed, especially at the beginning of a meeting, party, etc.",
                    "vi": "để nói hoặc làm điều gì đó khiến mọi người cảm thấy thoải mái hơn, đặc biệt là khi bắt đầu một cuộc họp, bữa tiệc, v.v."
                },
                "examples": [
                    {
                        "en": "Jim organized a few party games to break the ice when people first arrived.",
                        "vi": "Jim đã tổ chức một vài trò chơi tiệc tùng để phá băng khi mọi người mới đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no influence or effect on somebody",
                    "vi": "không có ảnh hưởng hoặc ảnh hưởng đến ai đó"
                },
                "examples": [
                    {
                        "en": "His excuses cut no ice with me.",
                        "vi": "Những lời bào chữa của anh ấy không hề có chút băng khoăn nào với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "kept cold by being surrounded by ice",
                    "vi": "giữ lạnh do được bao quanh bởi băng"
                },
                "examples": [
                    {
                        "en": "All the food is laid out and the champagne is on ice.",
                        "vi": "Tất cả thức ăn được bày ra và rượu sâm panh ở trên đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "not being dealt with now; waiting to be dealt with at a later time",
                    "vi": "bây giờ không bị xử lý; chờ được xử lý sau"
                },
                "examples": [
                    {
                        "en": "We've had to put our plans on ice for the time being.",
                        "vi": "Chúng tôi đã phải đặt kế hoạch của mình vào thời điểm hiện tại."
                    }
                ]
            },
            {
                "define": {
                    "en": "performed by skaters on an ice rink",
                    "vi": "biểu diễn của vận động viên trượt băng trên sân băng"
                },
                "examples": [
                    {
                        "en": "Cinderella on ice",
                        "vi": "Cô bé lọ lem trên băng"
                    }
                ]
            }
        ]
    },
    {
        "id": "1b881a6c8ed44780bdf37c175f9db5f2",
        "word": "snow",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/snəʊ/",
            "us": "/snəʊ/"
        },
        "nearby": [
            {
                "word": "snotty",
                "pos": "adjective"
            },
            {
                "word": "snout",
                "pos": "noun"
            },
            {
                "word": "snow",
                "pos": "noun"
            },
            {
                "word": "C P Snow",
                "pos": ""
            },
            {
                "word": "snow",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small soft white pieces (called flakes) of frozen water that fall from the sky in cold weather; this substance when it is lying on the ground",
                    "vi": "những mảnh nhỏ màu trắng mềm (được gọi là mảnh) của nước đông lạnh rơi từ trên trời xuống trong thời tiết lạnh giá; chất này khi nó nằm trên mặt đất"
                },
                "examples": [
                    {
                        "en": "Snow was falling heavily.",
                        "vi": "Tuyết rơi dày đặc."
                    },
                    {
                        "en": "We had snow in May this year.",
                        "vi": "Chúng tôi đã có tuyết vào tháng Năm năm nay."
                    },
                    {
                        "en": "The snow was beginning to melt.",
                        "vi": "Tuyết bắt đầu tan."
                    },
                    {
                        "en": "Heavy snow is expected tomorrow.",
                        "vi": "Dự báo ngày mai sẽ có tuyết rơi dày."
                    },
                    {
                        "en": "in the snow Children were playing in the snow.",
                        "vi": "trong tuyết Trẻ em đang chơi trong tuyết."
                    },
                    {
                        "en": "through the snow She saw them trudging through the snow towards the house.",
                        "vi": "xuyên qua tuyết Cô thấy họ đang lê bước trên tuyết về phía ngôi nhà."
                    },
                    {
                        "en": "We got over 100 inches of snow last winter.",
                        "vi": "Mùa đông năm ngoái, chúng tôi đã có hơn 100 inch tuyết."
                    },
                    {
                        "en": "There was almost a foot of snow on the ground.",
                        "vi": "Gần như chỉ có một lớp tuyết trên mặt đất."
                    },
                    {
                        "en": "20 cm of snow were expected today.",
                        "vi": "Dự kiến hôm nay sẽ có 20 cm tuyết."
                    },
                    {
                        "en": "The snow didn't settle (= stay on the ground).",
                        "vi": "Tuyết không lắng xuống (= ở trên mặt đất)."
                    },
                    {
                        "en": "The snow and ice caused a number of traffic accidents.",
                        "vi": "Băng tuyết đã gây ra một số vụ tai nạn giao thông."
                    },
                    {
                        "en": "Last week's cold temperatures were accompanied by rain and snow.",
                        "vi": "Nhiệt độ lạnh giá của tuần trước kèm theo mưa và tuyết."
                    },
                    {
                        "en": "Her skin was as white as snow.",
                        "vi": "Da cô trắng như tuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of snow that falls in one particular place or at one particular time",
                    "vi": "lượng tuyết rơi ở một nơi cụ thể hoặc tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "the first snows of winter",
                        "vi": "tuyết đầu tiên của mùa đông"
                    },
                    {
                        "en": "the snows of Everest",
                        "vi": "tuyết ở Everest"
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely clean, pure, etc.",
                    "vi": "cực kỳ sạch sẽ, tinh khiết, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8eb756dae4214162bf013a17b927187e",
        "word": "snow",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/snəʊ/",
            "us": "/snəʊ/"
        },
        "nearby": [
            {
                "word": "snow",
                "pos": "noun"
            },
            {
                "word": "C P Snow",
                "pos": ""
            },
            {
                "word": "snow",
                "pos": "verb"
            },
            {
                "word": "snowball",
                "pos": "noun"
            },
            {
                "word": "snowball",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when it snows, snow falls from the sky",
                    "vi": "khi tuyết rơi, tuyết rơi từ bầu trời"
                },
                "examples": [
                    {
                        "en": "It's been snowing heavily all day.",
                        "vi": "Tuyết rơi dày cả ngày."
                    },
                    {
                        "en": "It snowed for three days without stopping.",
                        "vi": "Tuyết rơi ba ngày không ngừng."
                    },
                    {
                        "en": "It was still snowing outside.",
                        "vi": "Bên ngoài trời vẫn còn tuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to impress somebody a lot by the things you say, especially if these are not true or not sincere",
                    "vi": "để gây ấn tượng với ai đó rất nhiều bởi những điều bạn nói, đặc biệt nếu những điều này không đúng sự thật hoặc không chân thành"
                },
                "examples": [
                    {
                        "en": "He really snowed me with all his talk of buying a Porsche.",
                        "vi": "Anh ấy thực sự khiến tôi phải hứng thú với tất cả những gì anh ấy nói về việc mua một chiếc Porsche."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to leave a place because of heavy snow",
                    "vi": "không thể rời khỏi một nơi vì tuyết rơi dày"
                },
                "examples": [
                    {
                        "en": "We were snowed in for two days.",
                        "vi": "Chúng tôi đã bị tuyết rơi trong hai ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have more things, especially work, than you feel able to deal with",
                    "vi": "có nhiều thứ hơn, đặc biệt là công việc, mà bạn cảm thấy có thể giải quyết"
                },
                "examples": [
                    {
                        "en": "I'd love to come but I'm completely snowed under at the moment.",
                        "vi": "Tôi rất muốn đến nhưng tôi hoàn toàn bị tuyết rơi vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be blocked with snow",
                    "vi": "bị tuyết cản trở"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9f426fcc3ca44d25bb6f202779ba51f9",
        "word": "fall",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/fɔːl/",
            "us": "/fɔːl/"
        },
        "nearby": [
            {
                "word": "the Falklands War",
                "pos": ""
            },
            {
                "word": "fall",
                "pos": "verb"
            },
            {
                "word": "fall",
                "pos": "noun"
            },
            {
                "word": "fall about",
                "pos": "phrasal verb"
            },
            {
                "word": "fallacious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of falling",
                    "vi": "một hành động ngã"
                },
                "examples": [
                    {
                        "en": "I had a bad fall and broke my arm.",
                        "vi": "Tôi đã bị ngã và gãy tay."
                    },
                    {
                        "en": "fall from something She was killed in a fall from a horse.",
                        "vi": "rơi từ một cái gì đó Cô ấy đã bị giết trong một cú ngã từ một con ngựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of snow, rain, rocks, etc. that falls or has fallen",
                    "vi": "một lượng tuyết, mưa, đá, v.v. rơi hoặc đã rơi"
                },
                "examples": [
                    {
                        "en": "a heavy fall of snow",
                        "vi": "tuyết rơi dày đặc"
                    },
                    {
                        "en": "a rock fall",
                        "vi": "một tảng đá rơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the season of the year between summer and winter, when leaves change colour and the weather becomes colder",
                    "vi": "giao mùa trong năm giữa mùa hè và mùa đông, khi lá cây đổi màu và thời tiết trở nên lạnh hơn"
                },
                "examples": [
                    {
                        "en": "in the fall of 2019",
                        "vi": "vào mùa thu năm 2019"
                    },
                    {
                        "en": "last fall",
                        "vi": "mùa thu năm ngoái"
                    },
                    {
                        "en": "Cool, damp fall weather brings out snails.",
                        "vi": "Thời tiết mùa thu mát mẻ, ẩm ướt làm cho ốc ra mồi."
                    },
                    {
                        "en": "He returned to school a month into the fall semester.",
                        "vi": "Anh ấy trở lại trường một tháng vào học kỳ mùa thu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decrease in size, number, rate or level",
                    "vi": "giảm kích thước, số lượng, tỷ lệ hoặc mức độ"
                },
                "examples": [
                    {
                        "en": "Share prices suffered a slight fall yesterday.",
                        "vi": "Giá cổ phiếu đã giảm nhẹ vào ngày hôm qua."
                    },
                    {
                        "en": "fall in something a sharp fall in prices",
                        "vi": "rơi vào một cái gì đó giảm giá mạnh"
                    },
                    {
                        "en": "a steep/dramatic fall in profits",
                        "vi": "lợi nhuận giảm mạnh / đáng kể"
                    },
                    {
                        "en": "a 3 per cent fall in unemployment",
                        "vi": "tỷ lệ thất nghiệp giảm 3%"
                    }
                ]
            },
            {
                "define": {
                    "en": "a loss of political, economic, etc. power or success; the loss or defeat of a city, country, etc. in war",
                    "vi": "mất quyền lực hoặc thành công về chính trị, kinh tế, v.v.; sự mất mát hoặc thất bại của một thành phố, đất nước, v.v. trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "the fall of the Roman Empire",
                        "vi": "sự sụp đổ của đế chế La mã"
                    },
                    {
                        "en": "the rise and fall of British industry",
                        "vi": "sự trỗi dậy và sụp đổ của ngành công nghiệp Anh"
                    },
                    {
                        "en": "the fall of Berlin",
                        "vi": "sự sụp đổ của Berlin"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a person, an organization, etc. loses the respect of other people because they have done something wrong",
                    "vi": "tình huống trong đó một người, một tổ chức, v.v. đánh mất sự tôn trọng của người khác vì họ đã làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "the TV preacher’s spectacular fall from grace",
                        "vi": "sự sụp đổ ngoạn mục của nhà thuyết giáo truyền hình từ ân sủng"
                    },
                    {
                        "en": "His diary charts his dramatic fall from grace.",
                        "vi": "Nhật ký của anh ấy ghi lại sự sụp đổ đáng kinh ngạc của anh ấy vì ân sủng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount of water falling down from a height",
                    "vi": "một lượng lớn nước rơi xuống từ độ cao"
                },
                "examples": [
                    {
                        "en": "The falls upstream are full of salmon.",
                        "vi": "Các thác ở thượng nguồn đầy cá hồi."
                    },
                    {
                        "en": "Niagara Falls",
                        "vi": "thác Niagara"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which something falls or happens",
                    "vi": "cách mà một cái gì đó rơi xuống hoặc xảy ra"
                },
                "examples": [
                    {
                        "en": "the fall of the dice",
                        "vi": "sự rơi của xúc xắc"
                    },
                    {
                        "en": "the dark fall of her hair (= the way her hair hangs down)",
                        "vi": "sự rụng tóc sẫm màu của cô ấy (= kiểu tóc cô ấy rủ xuống)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the occasion when Adam and Eve did not obey God and had to leave the Garden of Eden",
                    "vi": "dịp A-đam và Ê-va không vâng lời Đức Chúa Trời và phải rời khỏi Vườn Địa đàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be doing something that involves risks and that may end in disaster",
                    "vi": "làm điều gì đó có rủi ro và có thể kết thúc bằng thảm họa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop somebody from falling onto something hard",
                    "vi": "để ngăn ai đó rơi vào thứ gì đó khó"
                },
                "examples": [
                    {
                        "en": "Luckily, a bush broke his fall.",
                        "vi": "May mắn thay, một bụi cây đã làm gãy chân anh ngã."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have too high an opinion of yourself or your abilities, something will happen to make you look stupid",
                    "vi": "Nếu bạn có quan điểm quá cao về bản thân hoặc khả năng của mình, điều gì đó sẽ xảy ra khiến bạn trông thật ngu ngốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to accept responsibility or punishment for something that you did not do, or did not do alone",
                    "vi": "nhận trách nhiệm hoặc hình phạt cho điều gì đó mà bạn đã không làm hoặc không làm một mình"
                },
                "examples": [
                    {
                        "en": "He took the fall for his boss and resigned.",
                        "vi": "Anh ta đã phụ lòng sếp của mình và từ chức."
                    },
                    {
                        "en": "Who will take the fall for the scandal?",
                        "vi": "Ai sẽ là người gánh chịu vụ bê bối?"
                    },
                    {
                        "en": "Someone has to take the fall.",
                        "vi": "Ai đó đã phải nhận lấy sự sụp đổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "3132318a5add448b8ec69edfb31acb2e",
        "word": "snowy",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈsnəʊi/",
            "us": "/ˈsnəʊi/"
        },
        "nearby": [
            {
                "word": "Snow White",
                "pos": ""
            },
            {
                "word": "snow-white",
                "pos": "adjective"
            },
            {
                "word": "snowy",
                "pos": "adjective"
            },
            {
                "word": "SNP",
                "pos": "abbreviation"
            },
            {
                "word": "Snr",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "covered with snow",
                    "vi": "tuyết phủ"
                },
                "examples": [
                    {
                        "en": "snowy fields",
                        "vi": "cánh đồng tuyết"
                    },
                    {
                        "en": "snowy peaks",
                        "vi": "đỉnh núi tuyết"
                    }
                ]
            },
            {
                "define": {
                    "en": "when a lot of snow falls",
                    "vi": "khi tuyết rơi nhiều"
                },
                "examples": [
                    {
                        "en": "a snowy weekend",
                        "vi": "một ngày cuối tuần đầy tuyết"
                    },
                    {
                        "en": "The weather in January is often cold and snowy.",
                        "vi": "Thời tiết vào tháng Giêng thường lạnh và có tuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "very white, like new snow",
                    "vi": "rất trắng, như tuyết mới"
                },
                "examples": [
                    {
                        "en": "snowy hair",
                        "vi": "tóc tuyết"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d3dc7e704294ca998282387b61f1648",
        "word": "freeze",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/friːz/",
            "us": "/friːz/"
        },
        "nearby": [
            {
                "word": "freewheeling",
                "pos": "adjective"
            },
            {
                "word": "free will",
                "pos": "noun"
            },
            {
                "word": "freeze",
                "pos": "verb"
            },
            {
                "word": "freeze",
                "pos": "noun"
            },
            {
                "word": "freeze-dry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become hard, and often turn to ice, as a result of extreme cold; to make something do this",
                    "vi": "trở nên cứng và thường chuyển sang đóng băng do quá lạnh; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Water freezes at 0°C.",
                        "vi": "Nước đóng băng ở 0 ° C."
                    },
                    {
                        "en": "It's so cold that even the river has frozen.",
                        "vi": "Nó lạnh đến nỗi ngay cả dòng sông cũng đóng băng."
                    },
                    {
                        "en": "freeze something The cold weather had frozen the ground.",
                        "vi": "đóng băng cái gì đó Thời tiết lạnh giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "freeze + adj. The clothes froze solid on the washing line.",
                        "vi": "đóng băng + adj. Quần áo đông cứng trên dây giặt."
                    },
                    {
                        "en": "freeze something + adj. The frost had frozen the ground hard.",
                        "vi": "đóng băng cái gì đó + adj. Băng giá đã đóng băng mặt đất."
                    },
                    {
                        "en": "Last year's cold spell froze the lake solid.",
                        "vi": "Đợt lạnh năm ngoái làm đông cứng mặt hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a pipe, lock or machine freezes, or something freezes it, it becomes blocked with frozen liquid and therefore cannot be used",
                    "vi": "nếu một đường ống, ổ khóa hoặc máy bị đóng băng, hoặc thứ gì đó đóng băng nó, nó sẽ bị chặn bởi chất lỏng đông lạnh và do đó không thể sử dụng được"
                },
                "examples": [
                    {
                        "en": "The pipes have frozen, so we've got no water.",
                        "vi": "Các đường ống đã đóng băng, vì vậy chúng tôi không có nước."
                    },
                    {
                        "en": "freeze up I kept the car running to stop the engine freezing up.",
                        "vi": "đóng băng Tôi tiếp tục cho xe chạy để ngăn động cơ đóng băng lên."
                    },
                    {
                        "en": "freeze something Ten degrees of frost had frozen the lock on the car.",
                        "vi": "đóng băng một thứ gì đó Băng giá mười độ đã đóng băng ổ khóa trên xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it freezes, the weather is at or below 0° Celsius",
                    "vi": "khi nó đóng băng, thời tiết bằng hoặc dưới 0 ° C"
                },
                "examples": [
                    {
                        "en": "It may freeze tonight, so bring those plants inside.",
                        "vi": "Tối nay trời có thể đóng băng, vì vậy hãy mang những cây đó vào trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very cold; to be so cold that you die",
                    "vi": "rất lạnh; lạnh đến mức bạn chết"
                },
                "examples": [
                    {
                        "en": "Every time she opens the window we all freeze.",
                        "vi": "Mỗi lần cô ấy mở cửa sổ, tất cả chúng tôi đều đông cứng."
                    },
                    {
                        "en": "Two men froze to death on the mountain.",
                        "vi": "Hai người đàn ông chết cóng trên núi."
                    },
                    {
                        "en": "freeze somebody Two men were frozen to death on the mountain.",
                        "vi": "đóng băng ai đó Hai người đàn ông bị chết cóng trên núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep something, especially food, at a very low temperature in order to preserve it",
                    "vi": "để giữ một thứ gì đó, đặc biệt là thực phẩm, ở nhiệt độ rất thấp để bảo quản"
                },
                "examples": [
                    {
                        "en": "Can you freeze this cake?",
                        "vi": "Bạn có thể đông lạnh chiếc bánh này không?"
                    },
                    {
                        "en": "The organ samples were immediately frozen in liquid nitrogen.",
                        "vi": "Các mẫu nội tạng ngay lập tức được làm đông lạnh trong nitơ lỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be kept at a very low temperature",
                    "vi": "để có thể được giữ ở nhiệt độ rất thấp"
                },
                "examples": [
                    {
                        "en": "Some fruits freeze better than others.",
                        "vi": "Một số loại trái cây đóng băng tốt hơn những loại khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop moving suddenly because of fear, etc.",
                    "vi": "ngừng di chuyển đột ngột vì sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "I froze with terror as the door slowly opened.",
                        "vi": "Tôi sững người vì sợ hãi khi cánh cửa từ từ mở ra."
                    },
                    {
                        "en": "(figurative) The smile froze on her lips.",
                        "vi": "(nghĩa bóng) Nụ cười vụt tắt trên môi."
                    },
                    {
                        "en": "The police officer shouted ‘Freeze!’ and the man dropped the gun.",
                        "vi": "Viên cảnh sát hét lên 'Đóng băng!' và người đàn ông đã đánh rơi súng."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a computer screen freezes, you cannot move any of the images, etc. on it, because there is a problem with the system",
                    "vi": "khi màn hình máy tính bị treo, bạn không thể di chuyển bất kỳ hình ảnh nào, v.v. trên đó, do có sự cố với hệ thống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop a film or video in order to look at a particular picture",
                    "vi": "dừng phim hoặc video để xem một bức tranh cụ thể"
                },
                "examples": [
                    {
                        "en": "Freeze the action there!",
                        "vi": "Đóng băng hành động ở đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold wages, prices, etc. at a fixed level for a period of time",
                    "vi": "giữ tiền lương, giá cả, v.v. ở một mức cố định trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "Salaries have been frozen for the current year.",
                        "vi": "Tiền lương đã bị đóng băng cho năm hiện tại."
                    },
                    {
                        "en": "Prices have been frozen at this level for over a year now.",
                        "vi": "Giá đã bị đóng băng ở mức này trong hơn một năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent money, a bank account, etc. from being used by getting a court order which bans it",
                    "vi": "để ngăn tiền, tài khoản ngân hàng, v.v. bị sử dụng bằng cách nhận lệnh tòa cấm tài khoản đó"
                },
                "examples": [
                    {
                        "en": "The company's assets have been frozen.",
                        "vi": "Tài sản của công ty đã bị phong toả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly stop because something has frightened or surprised you",
                    "vi": "đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Jess froze in her tracks and took a deep breath.",
                        "vi": "Jess lặng người đi và hít thở sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly make somebody stop by frightening or surprising them; to suddenly stop because something has frightened or surprised you",
                    "vi": "đột nhiên khiến ai đó dừng lại bằng cách làm họ sợ hãi hoặc ngạc nhiên; đột ngột dừng lại vì điều gì đó đã làm bạn sợ hãi hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The question stopped Alice in her tracks.",
                        "vi": "Câu hỏi khiến Alice dừng lại."
                    },
                    {
                        "en": "Suddenly he stopped dead in his tracks: what was he doing?",
                        "vi": "Đột nhiên anh ấy chết sững lại: anh ấy đang làm gì vậy?"
                    },
                    {
                        "en": "(figurative) The disease was stopped in its tracks by immunization programmes.",
                        "vi": "(nghĩa bóng) Căn bệnh này đã được chặn đứng bởi các chương trình chủng ngừa."
                    }
                ]
            }
        ]
    },
    {
        "id": "655f8e268cc34260adf0ef3f45c721df",
        "word": "powder",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpaʊdə(r)/",
            "us": "/ˈpaʊdər/"
        },
        "nearby": [
            {
                "word": "pow",
                "pos": "exclamation"
            },
            {
                "word": "POW",
                "pos": "noun"
            },
            {
                "word": "powder",
                "pos": "noun"
            },
            {
                "word": "powder",
                "pos": "verb"
            },
            {
                "word": "powder blue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dry mass of very small fine pieces or grains",
                    "vi": "một khối khô gồm các mảnh hoặc hạt mịn rất nhỏ"
                },
                "examples": [
                    {
                        "en": "milk/chilli/cocoa powder",
                        "vi": "sữa / ớt / bột cacao"
                    },
                    {
                        "en": "lumps of chalk crushed to a fine white powder",
                        "vi": "các cục phấn nghiền thành bột trắng mịn"
                    },
                    {
                        "en": "The snow was like powder.",
                        "vi": "Tuyết giống như bột."
                    },
                    {
                        "en": "a wide range of cleaning fluids and powders",
                        "vi": "nhiều loại chất lỏng và bột làm sạch"
                    },
                    {
                        "en": "The mustard is sold in powder form.",
                        "vi": "Mù tạt được bán ở dạng bột."
                    },
                    {
                        "en": "powder skiing (= on fine dry snow)",
                        "vi": "trượt tuyết bằng bột (= trên tuyết khô mịn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very fine, soft, dry substance that you can put on your face to make it look smooth and dry",
                    "vi": "một chất rất mịn, mềm, khô mà bạn có thể thoa lên mặt để trông mịn màng và khô thoáng"
                },
                "examples": [
                    {
                        "en": "I only use lipstick and a little powder.",
                        "vi": "Tôi chỉ sử dụng son môi và một chút phấn phủ."
                    },
                    {
                        "en": "She quickly dabbed some powder on her cheeks.",
                        "vi": "Cô nhanh chóng chấm một ít phấn rôm lên má."
                    }
                ]
            },
            {
                "define": {
                    "en": "explosive powder used especially in bombs or fireworks",
                    "vi": "bột nổ được sử dụng đặc biệt trong bom hoặc pháo hoa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remain ready for a possible emergency",
                    "vi": "luôn sẵn sàng cho trường hợp khẩn cấp có thể xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to leave suddenly; to run away",
                    "vi": "ra đi đột ngột; bỏ chạy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "44af9962314e4a269357dc4885accb50",
        "word": "snowfall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsnəʊfɔːl/",
            "us": "/ˈsnəʊfɔːl/"
        },
        "nearby": [
            {
                "word": "snowdrift",
                "pos": "noun"
            },
            {
                "word": "snowdrop",
                "pos": "noun"
            },
            {
                "word": "snowfall",
                "pos": "noun"
            },
            {
                "word": "snowfield",
                "pos": "noun"
            },
            {
                "word": "snowflake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when snow falls; the amount of snow that falls in a particular place in a period of time",
                    "vi": "một dịp khi tuyết rơi; lượng tuyết rơi ở một nơi cụ thể trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "a heavy/light snowfall",
                        "vi": "tuyết rơi dày / nhẹ"
                    },
                    {
                        "en": "an area of low snowfall",
                        "vi": "một khu vực tuyết rơi ít"
                    },
                    {
                        "en": "What is the average annual snowfall for this state?",
                        "vi": "Lượng tuyết rơi trung bình hàng năm cho tiểu bang này là bao nhiêu?"
                    }
                ]
            }
        ]
    },
    {
        "id": "679ea13cbd874bb7839ddd35c7bf5c20",
        "word": "snowstorm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsnəʊstɔːm/",
            "us": "/ˈsnəʊstɔːrm/"
        },
        "nearby": [
            {
                "word": "snowshoe",
                "pos": "noun"
            },
            {
                "word": "snowslide",
                "pos": "noun"
            },
            {
                "word": "snowstorm",
                "pos": "noun"
            },
            {
                "word": "snowsuit",
                "pos": "noun"
            },
            {
                "word": "Snow White",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very heavy fall of snow, usually with a strong wind",
                    "vi": "tuyết rơi rất dày, thường kèm theo gió mạnh"
                },
                "examples": [
                    {
                        "en": "It is accepted that exceptional snowstorms can occur without strong winds.",
                        "vi": "Người ta chấp nhận rằng các cơn bão tuyết đặc biệt có thể xảy ra mà không có gió mạnh."
                    },
                    {
                        "en": "We fought our way through a raging snowstorm.",
                        "vi": "Chúng tôi đã chiến đấu theo cách của mình qua một cơn bão tuyết hoành hành."
                    }
                ]
            }
        ]
    },
    {
        "id": "5a54b2664f1f48788db664e74e1952cd",
        "word": "avalanche",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈævəlɑːnʃ/",
            "us": "/ˈævəlæntʃ/"
        },
        "nearby": [
            {
                "word": "available",
                "pos": "adjective"
            },
            {
                "word": "avail yourself of",
                "pos": "phrasal verb"
            },
            {
                "word": "avalanche",
                "pos": "noun"
            },
            {
                "word": "Avalon",
                "pos": ""
            },
            {
                "word": "avant-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of snow, ice and rock that falls down the side of a mountain",
                    "vi": "một khối tuyết, băng và đá rơi xuống sườn núi"
                },
                "examples": [
                    {
                        "en": "alpine villages destroyed in an avalanche",
                        "vi": "những ngôi làng trên núi cao bị phá hủy trong một trận tuyết lở"
                    },
                    {
                        "en": "He was killed in an avalanche while skiing.",
                        "vi": "Anh ta đã bị giết trong một trận tuyết lở khi đang trượt tuyết."
                    },
                    {
                        "en": "(figurative) We received an avalanche of letters in reply to our advertisement.",
                        "vi": "(nghĩa bóng) Chúng tôi đã nhận được một loạt các bức thư trả lời quảng cáo của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb07137200b44b038e5e32453ad494f4",
        "word": "blizzard",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈblɪzəd/",
            "us": "/ˈblɪzərd/"
        },
        "nearby": [
            {
                "word": "blitzed",
                "pos": "adjective"
            },
            {
                "word": "blitzkrieg",
                "pos": "noun"
            },
            {
                "word": "blizzard",
                "pos": "noun"
            },
            {
                "word": "bloat",
                "pos": "verb"
            },
            {
                "word": "bloated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a snowstorm with very strong winds",
                    "vi": "bão tuyết với gió rất mạnh"
                },
                "examples": [
                    {
                        "en": "blizzard conditions",
                        "vi": "điều kiện bão tuyết"
                    },
                    {
                        "en": "The blizzard struck the north-east yesterday, causing serious damage.",
                        "vi": "Trận bão tuyết đã tấn công vào phía đông bắc ngày hôm qua, gây ra thiệt hại nghiêm trọng."
                    },
                    {
                        "en": "a raging/howling blizzard",
                        "vi": "một trận bão tuyết hoành hành / hú hét"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large quantity of things that may seem to be attacking you",
                    "vi": "một số lượng lớn những thứ dường như đang tấn công bạn"
                },
                "examples": [
                    {
                        "en": "a blizzard of documents",
                        "vi": "một trận bão tuyết"
                    }
                ]
            }
        ]
    },
    {
        "id": "6289997b589b45e8a89fa340ee510035",
        "word": "icy",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈaɪsi/",
            "us": "/ˈaɪsi/"
        },
        "nearby": [
            {
                "word": "ictus",
                "pos": "noun"
            },
            {
                "word": "ICU",
                "pos": "noun"
            },
            {
                "word": "icy",
                "pos": "adjective"
            },
            {
                "word": "ICYMI",
                "pos": "abbreviation"
            },
            {
                "word": "id",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very cold",
                    "vi": "rất lạnh"
                },
                "examples": [
                    {
                        "en": "icy winds/water",
                        "vi": "gió / nước băng giá"
                    },
                    {
                        "en": "My feet were icy cold.",
                        "vi": "Chân tôi lạnh như băng."
                    },
                    {
                        "en": "The door opened and an icy blast of wind swept through the room.",
                        "vi": "Cánh cửa mở ra và một luồng gió lạnh như băng quét qua căn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "covered with ice",
                    "vi": "phủ đầy băng"
                },
                "examples": [
                    {
                        "en": "The car skidded on the icy road.",
                        "vi": "Chiếc xe trượt trên con đường băng giá."
                    },
                    {
                        "en": "There will be overnight frost, with the risk of icy patches forming on the roads.",
                        "vi": "Sẽ có sương giá qua đêm, với nguy cơ hình thành các mảng băng giá trên đường."
                    },
                    {
                        "en": "the icy wastes of the Russian Steppes",
                        "vi": "chất thải băng giá của Steppes Nga"
                    }
                ]
            },
            {
                "define": {
                    "en": "not friendly or kind; showing feelings of dislike or anger",
                    "vi": "không thân thiện hoặc tốt bụng; thể hiện cảm xúc không thích hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "My eyes met his icy gaze.",
                        "vi": "Đôi mắt tôi bắt gặp ánh mắt băng giá của anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dd50a5564ab41d9ad811de54bfa9ae9",
        "word": "melt",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/melt/",
            "us": "/melt/"
        },
        "nearby": [
            {
                "word": "Melody Maker",
                "pos": ""
            },
            {
                "word": "melon",
                "pos": "noun"
            },
            {
                "word": "melt",
                "pos": "verb"
            },
            {
                "word": "melt away",
                "pos": "phrasal verb"
            },
            {
                "word": "melt down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become or make something become liquid as a result of heating",
                    "vi": "trở thành hoặc làm cho một thứ gì đó trở nên lỏng do quá trình đốt nóng"
                },
                "examples": [
                    {
                        "en": "The snow showed no sign of melting.",
                        "vi": "Tuyết không có dấu hiệu tan."
                    },
                    {
                        "en": "melting ice",
                        "vi": "băng tan"
                    },
                    {
                        "en": "melt something The sun had melted the snow.",
                        "vi": "tan chảy cái gì đó Mặt trời đã làm tan chảy tuyết."
                    },
                    {
                        "en": "boiled potatoes with melted butter",
                        "vi": "khoai tây luộc với bơ tan chảy"
                    },
                    {
                        "en": "melted cheese/chocolate/ice cream",
                        "vi": "pho mát tan chảy / sô cô la / kem"
                    },
                    {
                        "en": "First, melt two ounces of butter.",
                        "vi": "Đầu tiên, đun chảy hai ounce bơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or to make a feeling, an emotion, etc. become gentler and less strong",
                    "vi": "trở nên hoặc để tạo ra một cảm giác, một cảm xúc, v.v. trở nên dịu dàng hơn và ít mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "The tension in the room began to melt.",
                        "vi": "Không khí căng thẳng trong phòng bắt đầu tan biến."
                    },
                    {
                        "en": "melt something Her trusting smile melted his heart.",
                        "vi": "làm tan chảy thứ gì đó Nụ cười tin tưởng của cô đã làm tan chảy trái tim anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become extremely hot",
                    "vi": "trở nên cực kỳ nóng"
                },
                "examples": [
                    {
                        "en": "Today the temperature got up to 36 degrees and it felt like I was melting.",
                        "vi": "Hôm nay nhiệt độ lên đến 36 độ và cảm giác như mình đang tan chảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody seems to be innocent, kind, etc. when they are not really",
                    "vi": "được sử dụng để nói rằng ai đó dường như vô tội, tốt bụng, v.v. trong khi họ không thực sự"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be soft and very good to eat",
                    "vi": "mềm và ăn rất ngon"
                },
                "examples": [
                    {
                        "en": "They serve steaks that just melt in your mouth.",
                        "vi": "Họ phục vụ những miếng bít tết vừa tan trong miệng của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "240d62aee07542c791ee32ec857a3945",
        "word": "blanket",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈblæŋkɪt/",
            "us": "/ˈblæŋkɪt/"
        },
        "nearby": [
            {
                "word": "blank call",
                "pos": "noun"
            },
            {
                "word": "blank cheque",
                "pos": "noun"
            },
            {
                "word": "blanket",
                "pos": "noun"
            },
            {
                "word": "blanket",
                "pos": "adjective"
            },
            {
                "word": "blanket",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large cover, often made of wool, used especially on beds to keep people warm",
                    "vi": "Một tấm bìa lớn, thường được làm bằng len, được sử dụng đặc biệt trên giường để giữ ấm cho mọi người"
                },
                "examples": [
                    {
                        "en": "It’s cold tonight—can I have another blanket?",
                        "vi": "Tối nay trời lạnh - tôi có thể đắp thêm một chiếc chăn được không?"
                    },
                    {
                        "en": "The baby was wrapped in a blanket.",
                        "vi": "Đứa bé được quấn trong một chiếc chăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thick layer or mass of something",
                    "vi": "một lớp dày hoặc khối lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a blanket of fog/snow/cloud",
                        "vi": "một lớp sương mù / tuyết / mây"
                    },
                    {
                        "en": "(figurative) The trial was conducted under a blanket of secrecy.",
                        "vi": "(nghĩa bóng) Phiên tòa được tiến hành trong bí mật."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dc353ce15134199a26f8a3e4dc1c7ec",
        "word": "drift",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/drɪft/",
            "us": "/drɪft/"
        },
        "nearby": [
            {
                "word": "drier",
                "pos": "noun"
            },
            {
                "word": "driest",
                "pos": "adjective"
            },
            {
                "word": "drift",
                "pos": "verb"
            },
            {
                "word": "drift",
                "pos": "noun"
            },
            {
                "word": "drift apart",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move along smoothly and slowly in water or air",
                    "vi": "di chuyển nhẹ nhàng và chậm rãi trong nước hoặc không khí"
                },
                "examples": [
                    {
                        "en": "Clouds drifted across the sky.",
                        "vi": "Mây trôi ngang trời."
                    },
                    {
                        "en": "The empty boat drifted out to sea.",
                        "vi": "Con thuyền trống trôi ra khơi."
                    },
                    {
                        "en": "A cool breeze drifted through the open window.",
                        "vi": "Một làn gió mát lướt qua khung cửa sổ đang mở."
                    },
                    {
                        "en": "Smoke drifted across the room.",
                        "vi": "Khói thuốc bay khắp phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or go somewhere slowly",
                    "vi": "di chuyển hoặc đi đâu đó một cách chậm rãi"
                },
                "examples": [
                    {
                        "en": "The crowd drifted away from the scene of the accident.",
                        "vi": "Đám đông trôi khỏi hiện trường vụ tai nạn."
                    },
                    {
                        "en": "Her gaze drifted around the room.",
                        "vi": "Ánh mắt cô ấy đảo quanh căn phòng."
                    },
                    {
                        "en": "People began to drift back to their houses.",
                        "vi": "Mọi người bắt đầu đổ về nhà của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something, happen or change without a particular plan or purpose",
                    "vi": "để làm điều gì đó, xảy ra hoặc thay đổi mà không có kế hoạch hoặc mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "I didn't intend to be a teacher—I just drifted into it.",
                        "vi": "Tôi không có ý định trở thành một giáo viên - tôi chỉ bị cuốn vào nó."
                    },
                    {
                        "en": "He hasn't decided what to do yet—he's just drifting.",
                        "vi": "Anh ấy vẫn chưa quyết định phải làm gì - anh ấy chỉ đang trôi dạt."
                    },
                    {
                        "en": "The conversation drifted onto politics.",
                        "vi": "Cuộc trò chuyện chuyển sang vấn đề chính trị."
                    },
                    {
                        "en": "We seem to be drifting away from the point.",
                        "vi": "Chúng tôi dường như đang trôi đi khỏi điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go from one situation or state to another without realizing it",
                    "vi": "đi từ tình huống hoặc trạng thái này sang trạng thái khác mà không nhận ra nó"
                },
                "examples": [
                    {
                        "en": "Finally she drifted into sleep.",
                        "vi": "Cuối cùng cô cũng chìm vào giấc ngủ."
                    },
                    {
                        "en": "The injured man tried to speak but soon drifted into unconsciousness.",
                        "vi": "Người đàn ông bị thương cố gắng nói nhưng nhanh chóng chìm vào bất tỉnh."
                    },
                    {
                        "en": "He drifted in and out of consciousness.",
                        "vi": "Anh trôi đi trong và ngoài ý thức."
                    },
                    {
                        "en": "She began to drift between sleep and wakefulness.",
                        "vi": "Cô bắt đầu trôi đi giữa giấc ngủ và thức dậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be blown into large piles by the wind",
                    "vi": "bị gió thổi thành đống lớn"
                },
                "examples": [
                    {
                        "en": "drifting sand",
                        "vi": "cát trôi"
                    },
                    {
                        "en": "Some roads are closed because of drifting.",
                        "vi": "Một số con đường bị đóng cửa vì bị trôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something float somewhere",
                    "vi": "để làm cho một cái gì đó trôi nổi ở đâu đó"
                },
                "examples": [
                    {
                        "en": "The logs are drifted downstream to the mill.",
                        "vi": "Các khúc gỗ được trôi về phía hạ lưu đến nhà máy."
                    }
                ]
            }
        ]
    },
    {
        "id": "623fc8d2f2424e779edae16a4b353ad4",
        "word": "drift",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/drɪft/",
            "us": "/drɪft/"
        },
        "nearby": [
            {
                "word": "driest",
                "pos": "adjective"
            },
            {
                "word": "drift",
                "pos": "verb"
            },
            {
                "word": "drift",
                "pos": "noun"
            },
            {
                "word": "drift apart",
                "pos": "phrasal verb"
            },
            {
                "word": "drifter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a slow steady movement from one place to another; a slow change or development from one situation to another, especially to something bad",
                    "vi": "một chuyển động chậm dần đều từ nơi này đến nơi khác; một sự thay đổi hoặc phát triển chậm từ tình huống này sang tình huống khác, đặc biệt là đến một điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "the drift of people away from rural areas into urban slums",
                        "vi": "sự trôi dạt của những người rời khỏi các vùng nông thôn vào các khu ổ chuột ở thành thị"
                    },
                    {
                        "en": "attempts to halt the drift towards war",
                        "vi": "nỗ lực ngăn chặn cuộc chiến tranh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of a ship or plane away from its direction because of currents or wind",
                    "vi": "chuyển động của một con tàu hoặc máy bay ra khỏi hướng của nó vì dòng chảy hoặc gió"
                },
                "examples": [
                    {
                        "en": "Remember to allow for drift.",
                        "vi": "Nhớ để cho trôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of the sea or air",
                    "vi": "sự chuyển động của biển hoặc không khí"
                },
                "examples": [
                    {
                        "en": "the general direction of drift on the east coast",
                        "vi": "hướng chung của sự trôi dạt trên bờ biển phía đông"
                    },
                    {
                        "en": "He knew the hidden drifts in that part of the river.",
                        "vi": "Anh biết những gì đang trôi dạt ẩn trong phần đó của con sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large pile of something, especially snow, made by the wind",
                    "vi": "một đống lớn thứ gì đó, đặc biệt là tuyết, do gió tạo ra"
                },
                "examples": [
                    {
                        "en": "The road was blocked by deep drifts of snow.",
                        "vi": "Con đường đã bị chặn lại bởi những lớp tuyết dày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large mass of something, especially flowers",
                    "vi": "một khối lượng lớn thứ gì đó, đặc biệt là hoa"
                },
                "examples": [
                    {
                        "en": "Plant daffodils in informal drifts.",
                        "vi": "Trồng hoa thủy tiên vàng trong không gian trôi dạt không chính thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general meaning of what somebody says or writes",
                    "vi": "ý nghĩa chung của những gì ai đó nói hoặc viết"
                },
                "examples": [
                    {
                        "en": "Do you catch my drift?",
                        "vi": "Bạn có nắm bắt được sự trôi dạt của tôi?"
                    },
                    {
                        "en": "My German isn't very good, but I got the drift of what she said.",
                        "vi": "Tiếng Đức của tôi không tốt lắm, nhưng tôi đã hiểu được những gì cô ấy nói."
                    }
                ]
            }
        ]
    },
    {
        "id": "d65bb1f9fed64b64aad8e04f7921cbb9",
        "word": "frost",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/frɒst/",
            "us": "/frɔːst/"
        },
        "nearby": [
            {
                "word": "front-wheel drive",
                "pos": "noun"
            },
            {
                "word": "frontwoman",
                "pos": "noun"
            },
            {
                "word": "frost",
                "pos": "noun"
            },
            {
                "word": "David Frost",
                "pos": ""
            },
            {
                "word": "Robert Frost",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a weather condition in which the temperature drops below 0° Celsius (= freezing point) so that a thin white layer of ice forms on the ground and other surfaces, especially at night",
                    "vi": "điều kiện thời tiết trong đó nhiệt độ giảm xuống dưới 0 ° C (= điểm đóng băng) để một lớp băng mỏng màu trắng hình thành trên mặt đất và các bề mặt khác, đặc biệt là vào ban đêm"
                },
                "examples": [
                    {
                        "en": "It will be a clear night with some ground frost.",
                        "vi": "Đó sẽ là một đêm quang đãng, có sương giá trên mặt đất."
                    },
                    {
                        "en": "a sharp/hard/severe frost",
                        "vi": "sương giá buốt / cứng / khắc nghiệt"
                    },
                    {
                        "en": "There were ten degrees of frost (= the temperature dropped to -10° Celsius) last night.",
                        "vi": "Có băng giá 10 độ (= nhiệt độ giảm xuống -10 ° C) vào đêm qua."
                    },
                    {
                        "en": "frost damage",
                        "vi": "thiệt hại do sương giá"
                    }
                ]
            },
            {
                "define": {
                    "en": "the thin white layer of ice that forms when the temperature drops below 0° Celsius",
                    "vi": "lớp băng mỏng màu trắng hình thành khi nhiệt độ xuống dưới 0 ° C"
                },
                "examples": [
                    {
                        "en": "The car windows were covered with frost.",
                        "vi": "Các cửa sổ ô tô đã bị bao phủ bởi sương giá."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ae26077b58f4955871e7c383f924380",
        "word": "frosty",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfrɒsti/",
            "us": "/ˈfrɔːsti/"
        },
        "nearby": [
            {
                "word": "frostily",
                "pos": "adverb"
            },
            {
                "word": "frosting",
                "pos": "noun"
            },
            {
                "word": "frosty",
                "pos": "adjective"
            },
            {
                "word": "froth",
                "pos": "noun"
            },
            {
                "word": "froth",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely cold; cold with frost",
                    "vi": "vô cùng lạnh; lạnh có sương"
                },
                "examples": [
                    {
                        "en": "a frosty morning",
                        "vi": "một buổi sáng lạnh giá"
                    },
                    {
                        "en": "He breathed in the frosty air.",
                        "vi": "Anh hít thở không khí lạnh giá."
                    },
                    {
                        "en": "It’s frosty outside.",
                        "vi": "Bên ngoài trời lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "covered with frost",
                    "vi": "bao phủ bởi sương giá"
                },
                "examples": [
                    {
                        "en": "I looked out over the frosty fields.",
                        "vi": "Tôi nhìn ra cánh đồng băng giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "unfriendly, in a way that suggests that somebody does not approve of something",
                    "vi": "không thân thiện, theo cách gợi ý rằng ai đó không tán thành điều gì đó"
                },
                "examples": [
                    {
                        "en": "a frosty look/reply",
                        "vi": "một cái nhìn / trả lời băng giá"
                    },
                    {
                        "en": "My questions were met with a frosty silence.",
                        "vi": "Những câu hỏi của tôi đã được đáp lại bằng một sự im lặng băng giá."
                    },
                    {
                        "en": "The latest proposals were given a frosty reception.",
                        "vi": "Những đề xuất mới nhất đã được đón nhận một cách lạnh lùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "1036571cbfda4ef5a1b7c9765e6dfe20",
        "word": "powder snow",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpaʊdə snəʊ/",
            "us": "/ˈpaʊdər snəʊ/"
        },
        "nearby": [
            {
                "word": "powder puff",
                "pos": "noun"
            },
            {
                "word": "powder room",
                "pos": "noun"
            },
            {
                "word": "powder snow",
                "pos": "noun"
            },
            {
                "word": "powdery",
                "pos": "adjective"
            },
            {
                "word": "Anthony Powell",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "loose, dry snow which has fallen recently",
                    "vi": "gần đây tuyết khô, lỏng lẻo đã rơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0f0f85ed075c4c02b9038cff263c2009",
        "word": "snowdrift",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsnəʊdrɪft/",
            "us": "/ˈsnəʊdrɪft/"
        },
        "nearby": [
            {
                "word": "Snowdon",
                "pos": ""
            },
            {
                "word": "Snowdonia",
                "pos": ""
            },
            {
                "word": "snowdrift",
                "pos": "noun"
            },
            {
                "word": "snowdrop",
                "pos": "noun"
            },
            {
                "word": "snowfall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deep pile of snow that has been blown together by the wind",
                    "vi": "một đống tuyết sâu đã bị gió thổi cùng nhau"
                },
                "examples": [
                    {
                        "en": "The car got stuck in a snowdrift.",
                        "vi": "Chiếc xe bị kẹt trong một vết trượt tuyết."
                    }
                ]
            }
        ]
    },
    {
        "id": "46a89ea5882f4c9f9f62b6431657f5cb",
        "word": "snowflake",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsnəʊfleɪk/",
            "us": "/ˈsnəʊfleɪk/"
        },
        "nearby": [
            {
                "word": "snowfall",
                "pos": "noun"
            },
            {
                "word": "snowfield",
                "pos": "noun"
            },
            {
                "word": "snowflake",
                "pos": "noun"
            },
            {
                "word": "snow gun",
                "pos": "noun"
            },
            {
                "word": "snow job",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small soft piece of frozen water that falls from the sky as snow",
                    "vi": "một tảng nước nhỏ mềm đóng băng rơi từ trên trời xuống dưới dạng tuyết"
                },
                "examples": [
                    {
                        "en": "A single snowflake landed on her nose.",
                        "vi": "Một bông tuyết đậu trên mũi cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word for a person who you think expects special treatment or is too sensitive to criticism and easily upset",
                    "vi": "một từ xúc phạm đối với một người mà bạn nghĩ cần được đối xử đặc biệt hoặc quá nhạy cảm với những lời chỉ trích và dễ buồn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7535397a5c19441bacb6c5dcda56577a",
        "word": "snowslide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsnəʊslaɪd/",
            "us": "/ˈsnəʊslaɪd/"
        },
        "nearby": [
            {
                "word": "snowscape",
                "pos": "noun"
            },
            {
                "word": "snowshoe",
                "pos": "noun"
            },
            {
                "word": "snowslide",
                "pos": "noun"
            },
            {
                "word": "snowstorm",
                "pos": "noun"
            },
            {
                "word": "snowsuit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of snow, ice and rock that falls down the side of a mountain",
                    "vi": "một khối tuyết, băng và đá rơi xuống sườn núi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7d39a12df07c414db919e01d1dceabde",
        "word": "bank",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bæŋk/",
            "us": "/bæŋk/"
        },
        "nearby": [
            {
                "word": "banister",
                "pos": "noun"
            },
            {
                "word": "banjo",
                "pos": "noun"
            },
            {
                "word": "bank",
                "pos": "noun"
            },
            {
                "word": "bank",
                "pos": "verb"
            },
            {
                "word": "bankable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization that provides various financial services, for example keeping or lending money",
                    "vi": "một tổ chức cung cấp các dịch vụ tài chính khác nhau, ví dụ như giữ hoặc cho vay tiền"
                },
                "examples": [
                    {
                        "en": "I don't have much money in the bank at the end of the month.",
                        "vi": "Tôi không có nhiều tiền trong ngân hàng vào cuối tháng."
                    },
                    {
                        "en": "I need to go to the bank (= the local office of a bank).",
                        "vi": "Tôi cần đến ngân hàng (= văn phòng ngân hàng địa phương)."
                    },
                    {
                        "en": "We are now in competition with the big foreign banks.",
                        "vi": "Hiện chúng tôi đang phải cạnh tranh với các ngân hàng lớn của nước ngoài."
                    },
                    {
                        "en": "Major banks are increasing the amount they lend to small companies.",
                        "vi": "Các ngân hàng lớn đang tăng số tiền họ cho các công ty nhỏ vay."
                    },
                    {
                        "en": "He got a large loan from the bank.",
                        "vi": "Anh ta nhận được một khoản vay lớn từ ngân hàng."
                    },
                    {
                        "en": "She got a bank loan to finance the purchase.",
                        "vi": "Cô ấy có một khoản vay ngân hàng để tài trợ cho việc mua hàng."
                    },
                    {
                        "en": "I had a meeting with the bank manager.",
                        "vi": "Tôi đã có một cuộc họp với giám đốc ngân hàng."
                    },
                    {
                        "en": "He was shot as he tried to foil a bank robbery.",
                        "vi": "Anh ta đã bị bắn khi cố gắng thực hiện một vụ cướp ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a supply of money or things that are used as money in some games, especially those in which gambling is involved",
                    "vi": "cung cấp tiền hoặc những thứ được sử dụng làm tiền trong một số trò chơi, đặc biệt là những trò chơi có liên quan đến cờ bạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an amount of something that is collected; a place where something is stored ready for use",
                    "vi": "một số lượng của một cái gì đó được thu thập; một nơi mà một cái gì đó được lưu trữ sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "a bank of knowledge",
                        "vi": "một ngân hàng kiến thức"
                    },
                    {
                        "en": "a blood/sperm bank",
                        "vi": "ngân hàng máu / tinh trùng"
                    },
                    {
                        "en": "They intend to establish a bank of information which will be accessible to the public.",
                        "vi": "Họ có ý định thiết lập một ngân hàng thông tin mà công chúng có thể tiếp cận được."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or container where something may be placed for recycling",
                    "vi": "một địa điểm hoặc thùng chứa nơi có thể đặt thứ gì đó để tái chế"
                },
                "examples": [
                    {
                        "en": "Take old clothes and shoes to the local recycling bank.",
                        "vi": "Mang quần áo và giày cũ đến ngân hàng tái chế địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a river, canal, etc. and the land near it",
                    "vi": "cạnh sông, kênh, v.v. và vùng đất gần đó"
                },
                "examples": [
                    {
                        "en": "We strolled along the river bank.",
                        "vi": "Chúng tôi đi dạo dọc theo bờ sông."
                    },
                    {
                        "en": "He jumped in and swam to the opposite bank.",
                        "vi": "Anh ta nhảy vào và bơi sang bờ đối diện."
                    },
                    {
                        "en": "on the bank/banks of something a house on the banks of the River Severn (= on land near the river)",
                        "vi": "trên bờ / bờ của cái gì đó một ngôi nhà trên bờ sông Severn (= trên đất gần sông)"
                    },
                    {
                        "en": "It's on the north bank of the Thames.",
                        "vi": "Nó ở bờ bắc của sông Thames."
                    },
                    {
                        "en": "The river burst its banks after heavy rain.",
                        "vi": "Dòng sông vỡ bờ sau trận mưa lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a raised area of ground that slopes at the sides, often at the edge of something or dividing something",
                    "vi": "một vùng đất nổi lên dốc ở hai bên, thường là ở rìa của một cái gì đó hoặc phân chia một cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were low banks of earth between the rice fields.",
                        "vi": "Có những bờ đất thấp giữa cánh đồng lúa."
                    },
                    {
                        "en": "The girls ran down the steep grassy bank.",
                        "vi": "Các cô gái chạy xuống bờ cỏ dốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial slope built at the side of a road, so that cars can drive fast around bends",
                    "vi": "một con dốc nhân tạo được xây dựng ở bên đường để ô tô có thể lái nhanh quanh các khúc cua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a mass of cloud, snow, etc., especially one formed by the wind",
                    "vi": "một khối lượng mây, tuyết, v.v., đặc biệt là một khối do gió tạo thành"
                },
                "examples": [
                    {
                        "en": "The sun disappeared behind a bank of clouds.",
                        "vi": "Mặt trời khuất sau một bờ mây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row or series of similar objects, especially machines",
                    "vi": "một hàng hoặc một loạt các đối tượng tương tự, đặc biệt là máy móc"
                },
                "examples": [
                    {
                        "en": "a bank of lights/computers",
                        "vi": "một ngân hàng đèn / máy tính"
                    },
                    {
                        "en": "She was faced with a huge bank of switches and buttons.",
                        "vi": "Cô phải đối mặt với một đống công tắc và nút bấm."
                    },
                    {
                        "en": "She was working a phone bank for the Democrats.",
                        "vi": "Cô ấy đang làm việc tại một ngân hàng điện thoại cho đảng Dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "financial support from your parents, especially when you are an adult",
                    "vi": "hỗ trợ tài chính từ cha mẹ của bạn, đặc biệt là khi bạn đã trưởng thành"
                },
                "examples": [
                    {
                        "en": "Without support from the Bank of Mum and Dad, they could find themselves locked out of the housing market.",
                        "vi": "Nếu không có sự hỗ trợ từ Ngân hàng của Mẹ và Cha, họ có thể thấy mình bị khóa ngoài thị trường nhà ở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a lot of money easily and feel very pleased about it",
                    "vi": "để kiếm được nhiều tiền một cách dễ dàng và cảm thấy rất hài lòng về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something won’t break the bank, you mean that it won’t cost a lot of money, or more than you can afford",
                    "vi": "nếu bạn nói điều gì đó sẽ không phá vỡ ngân hàng, bạn có nghĩa là nó sẽ không tốn nhiều tiền hoặc nhiều hơn khả năng chi trả của bạn"
                },
                "examples": [
                    {
                        "en": "We can just get a sandwich if you want—that won’t break the bank.",
                        "vi": "Chúng tôi chỉ có thể lấy một chiếc bánh sandwich nếu bạn muốn — điều đó sẽ không phá vỡ ngân hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e56a1870f614cc799df9e6d479f3bed",
        "word": "flake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fleɪk/",
            "us": "/fleɪk/"
        },
        "nearby": [
            {
                "word": "flair",
                "pos": "noun"
            },
            {
                "word": "flak",
                "pos": "noun"
            },
            {
                "word": "flake",
                "pos": "noun"
            },
            {
                "word": "flake",
                "pos": "verb"
            },
            {
                "word": "flake out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, very thin layer or piece of something, especially one that has broken off from something larger",
                    "vi": "một lớp nhỏ, rất mỏng hoặc một phần của thứ gì đó, đặc biệt là lớp bị vỡ ra từ thứ lớn hơn"
                },
                "examples": [
                    {
                        "en": "flakes of snow/paint",
                        "vi": "tuyết / sơn"
                    },
                    {
                        "en": "dried onion flakes",
                        "vi": "hành khô"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is strange or unusual or who forgets things easily",
                    "vi": "một người kỳ lạ hoặc bất thường hoặc người dễ quên mọi thứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed99c0f5e3f944f5a959593bb0a20458",
        "word": "flurry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflʌri/",
            "us": "/ˈflɜːri/"
        },
        "nearby": [
            {
                "word": "fluorocarbon",
                "pos": "noun"
            },
            {
                "word": "flurried",
                "pos": "adjective"
            },
            {
                "word": "flurry",
                "pos": "noun"
            },
            {
                "word": "flush",
                "pos": "verb"
            },
            {
                "word": "flush",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when there is a lot of activity, interest, excitement, etc. within a short period of time",
                    "vi": "một dịp khi có rất nhiều hoạt động, sự quan tâm, sự phấn khích, v.v. trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "a sudden flurry of activity",
                        "vi": "một loạt hoạt động đột ngột"
                    },
                    {
                        "en": "in a flurry (of something) They arrived in a flurry of excitement.",
                        "vi": "trong một loạt (về một cái gì đó) Họ đến trong một loạt các phấn khích."
                    },
                    {
                        "en": "A flurry of shots rang out in the darkness.",
                        "vi": "Một loạt các phát súng vang lên trong bóng tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of snow, rain, etc. that falls for a short time and then stops",
                    "vi": "một lượng nhỏ tuyết, mưa, v.v. rơi trong thời gian ngắn rồi ngừng"
                },
                "examples": [
                    {
                        "en": "snow flurries",
                        "vi": "tuyết rơi"
                    },
                    {
                        "en": "flurries of snow",
                        "vi": "tuyết rơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden short movement of paper or cloth, especially clothes",
                    "vi": "một chuyển động ngắn đột ngột của giấy hoặc vải, đặc biệt là quần áo"
                },
                "examples": [
                    {
                        "en": "in a flurry (of something) The ladies departed in a flurry of silks and satins.",
                        "vi": "trong một thoáng (của một cái gì đó) Những người phụ nữ khởi hành trong một đống lụa và satins."
                    }
                ]
            }
        ]
    },
    {
        "id": "45ab110d0d4d48ada984621dad228219",
        "word": "hail",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/heɪl/",
            "us": "/heɪl/"
        },
        "nearby": [
            {
                "word": "Haight-Ashbury",
                "pos": ""
            },
            {
                "word": "haiku",
                "pos": "noun"
            },
            {
                "word": "hail",
                "pos": "verb"
            },
            {
                "word": "hail",
                "pos": "noun"
            },
            {
                "word": "hail from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to describe somebody/something as being very good or special, especially in newspapers, etc.",
                    "vi": "để mô tả ai đó / điều gì đó là rất tốt hoặc đặc biệt, đặc biệt là trên báo, v.v."
                },
                "examples": [
                    {
                        "en": "be hailed (as) something The conference was hailed as a great success.",
                        "vi": "được ca ngợi (như) điều gì đó Hội nghị được ca ngợi là thành công tốt đẹp."
                    },
                    {
                        "en": "The expedition was widely hailed as a success.",
                        "vi": "Cuộc thám hiểm đã được ca ngợi rộng rãi là một thành công."
                    },
                    {
                        "en": "Teenager Matt Brown is being hailed a hero for saving a young child from drowning.",
                        "vi": "Cậu thiếu niên Matt Brown được ca ngợi là một anh hùng vì đã cứu một đứa trẻ nhỏ khỏi chết đuối."
                    },
                    {
                        "en": "hail somebody/something as something Union leaders hailed the socialists’ victory as a huge step forward.",
                        "vi": "ca ngợi ai đó / cái gì đó như một cái gì đó Các nhà lãnh đạo Liên minh ca ngợi chiến thắng của những người theo chủ nghĩa xã hội như một bước tiến vượt bậc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to signal to a taxi or a bus, in order to get the driver to stop",
                    "vi": "ra hiệu cho taxi hoặc xe buýt để yêu cầu tài xế dừng lại"
                },
                "examples": [
                    {
                        "en": "to hail a taxi/cab",
                        "vi": "gọi taxi / taxi"
                    }
                ]
            },
            {
                "define": {
                    "en": "to call to somebody in order to say hello to them or attract their attention",
                    "vi": "gọi cho ai đó để chào họ hoặc thu hút sự chú ý của họ"
                },
                "examples": [
                    {
                        "en": "A voice hailed us from the other side of the street.",
                        "vi": "Một giọng nói chào đón chúng tôi từ phía bên kia đường."
                    },
                    {
                        "en": "We soon came within hailing distance of (= fairly close to) the others.",
                        "vi": "Chúng tôi nhanh chóng đến trong khoảng cách ca ngợi (= khá gần với) những người khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it hails, small balls of ice fall like rain from the sky",
                    "vi": "Khi nó vang lên, những quả bóng băng nhỏ rơi xuống như mưa từ trên trời"
                },
                "examples": [
                    {
                        "en": "It's hailing!",
                        "vi": "Trời đang mưa đá!"
                    }
                ]
            }
        ]
    },
    {
        "id": "46bb83e6c25e4463a9678044e0645b01",
        "word": "hail",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/heɪl/",
            "us": "/heɪl/"
        },
        "nearby": [
            {
                "word": "haiku",
                "pos": "noun"
            },
            {
                "word": "hail",
                "pos": "verb"
            },
            {
                "word": "hail",
                "pos": "noun"
            },
            {
                "word": "hail from",
                "pos": "phrasal verb"
            },
            {
                "word": "Hail Mary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small balls of ice that fall like rain",
                    "vi": "những viên băng nhỏ rơi như mưa"
                },
                "examples": [
                    {
                        "en": "We drove through hail and snow.",
                        "vi": "Chúng tôi đã lái xe qua mưa đá và tuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number or amount of something that is aimed at somebody in order to harm them",
                    "vi": "một số lượng lớn hoặc số lượng lớn thứ gì đó nhằm vào ai đó để làm hại họ"
                },
                "examples": [
                    {
                        "en": "a hail of arrows/bullets",
                        "vi": "một trận mưa tên / đạn"
                    },
                    {
                        "en": "a hail of abuse",
                        "vi": "một trận mưa đá lạm dụng"
                    }
                ]
            }
        ]
    },
    {
        "id": "85cfde90eba04fe792e1296528615f53",
        "word": "hailstone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheɪlstəʊn/",
            "us": "/ˈheɪlstəʊn/"
        },
        "nearby": [
            {
                "word": "hail from",
                "pos": "phrasal verb"
            },
            {
                "word": "Hail Mary",
                "pos": "noun"
            },
            {
                "word": "hailstone",
                "pos": "noun"
            },
            {
                "word": "hailstorm",
                "pos": "noun"
            },
            {
                "word": "Hail to the Chief",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small ball of ice that falls like rain",
                    "vi": "một quả cầu băng nhỏ rơi như mưa"
                },
                "examples": [
                    {
                        "en": "Britain’s biggest recorded hailstone weighed 5 oz.",
                        "vi": "Trận mưa đá lớn nhất được ghi nhận ở Anh nặng 5 oz."
                    },
                    {
                        "en": "We struggled up the hill in a wind full of dust and hailstones.",
                        "vi": "Chúng tôi vất vả lên đồi trong cơn gió đầy bụi và mưa đá."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac1e771d89604b37b81b179a927ae0e2",
        "word": "icicle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaɪsɪkl/",
            "us": "/ˈaɪsɪkl/"
        },
        "nearby": [
            {
                "word": "ice water",
                "pos": "noun"
            },
            {
                "word": "Ich dien",
                "pos": ""
            },
            {
                "word": "icicle",
                "pos": "noun"
            },
            {
                "word": "icily",
                "pos": "adverb"
            },
            {
                "word": "iciness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pointed piece of ice that is formed when water freezes as it falls down from something such as a roof",
                    "vi": "một tảng băng nhọn được hình thành khi nước đóng băng khi nó rơi xuống từ một thứ gì đó chẳng hạn như mái nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea3665d3616f44ed8fab2c32dcb66446",
        "word": "sleet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sliːt/",
            "us": "/sliːt/"
        },
        "nearby": [
            {
                "word": "sleepy",
                "pos": "adjective"
            },
            {
                "word": "sleepyhead",
                "pos": "noun"
            },
            {
                "word": "sleet",
                "pos": "noun"
            },
            {
                "word": "sleet",
                "pos": "verb"
            },
            {
                "word": "sleeve",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mixture of rain and snow",
                    "vi": "hỗn hợp mưa và tuyết"
                },
                "examples": [
                    {
                        "en": "The rain was turning to sleet.",
                        "vi": "Mưa đang chuyển sang mưa tuyết."
                    },
                    {
                        "en": "The wind was blowing hard and bringing with it sleet.",
                        "vi": "Gió thổi mạnh và mang theo mưa đá."
                    }
                ]
            }
        ]
    },
    {
        "id": "257f785e2bb74b5f9bdc98e3c68dd920",
        "word": "sleet",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/sliːt/",
            "us": "/sliːt/"
        },
        "nearby": [
            {
                "word": "sleepyhead",
                "pos": "noun"
            },
            {
                "word": "sleet",
                "pos": "noun"
            },
            {
                "word": "sleet",
                "pos": "verb"
            },
            {
                "word": "sleeve",
                "pos": "noun"
            },
            {
                "word": "sleeveless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when it is sleeting, a mixture of rain and snow is falling from the sky",
                    "vi": "khi trời đang có mưa tuyết, một hỗn hợp mưa và tuyết từ trên trời rơi xuống"
                },
                "examples": [
                    {
                        "en": "It’s sleeting!",
                        "vi": "Đó là thời tiết!"
                    }
                ]
            }
        ]
    },
    {
        "id": "31b47c3e3925436fba53104132adeb85",
        "word": "slush",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slʌʃ/",
            "us": "/slʌʃ/"
        },
        "nearby": [
            {
                "word": "slurp",
                "pos": "noun"
            },
            {
                "word": "slurry",
                "pos": "noun"
            },
            {
                "word": "slush",
                "pos": "noun"
            },
            {
                "word": "slush fund",
                "pos": "noun"
            },
            {
                "word": "slushy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "partly melted snow that is usually dirty",
                    "vi": "tuyết tan chảy một phần thường bẩn"
                },
                "examples": [
                    {
                        "en": "In the city the clean white snow had turned to grey slush.",
                        "vi": "Trong thành phố, tuyết trắng sạch đã chuyển sang xám xịt."
                    },
                    {
                        "en": "There was dirty brown slush all over the roads and pavements.",
                        "vi": "Có màu nâu bẩn thỉu trên khắp các con đường và vỉa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "stories, films or feelings that are considered to be silly and without value because they are too emotional and romantic",
                    "vi": "những câu chuyện, bộ phim hay tình cảm bị coi là ngớ ngẩn và không có giá trị vì quá xúc động và lãng mạn"
                },
                "examples": [
                    {
                        "en": "Her novels are full of sentimental slush.",
                        "vi": "Tiểu thuyết của cô ấy chứa đầy tình cảm ủy mị."
                    }
                ]
            }
        ]
    },
    {
        "id": "701639f438dd49a7bfc497aefea0f9a8",
        "word": "snowbound",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsnəʊbaʊnd/",
            "us": "/ˈsnəʊbaʊnd/"
        },
        "nearby": [
            {
                "word": "snowboarder",
                "pos": "noun"
            },
            {
                "word": "snowboarding",
                "pos": "noun"
            },
            {
                "word": "snowbound",
                "pos": "adjective"
            },
            {
                "word": "snow cannon",
                "pos": "noun"
            },
            {
                "word": "snow-capped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "stuck in a particular place and unable to move because a lot of snow has fallen",
                    "vi": "bị mắc kẹt ở một nơi cụ thể và không thể di chuyển vì tuyết đã rơi nhiều"
                },
                "examples": [
                    {
                        "en": "The skiers were snowbound in the resort for several days.",
                        "vi": "Những người trượt tuyết đã ở trên tuyết trong khu nghỉ mát trong vài ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you cannot use or reach because a lot of snow has fallen",
                    "vi": "mà bạn không thể sử dụng hoặc với tới được vì tuyết đã rơi nhiều"
                },
                "examples": [
                    {
                        "en": "They were stranded for hours on the snowbound motorway.",
                        "vi": "Họ bị mắc kẹt hàng giờ trên đường cao tốc đầy tuyết."
                    }
                ]
            }
        ]
    },
    {
        "id": "729880a7b5e44191823014c89659b84a",
        "word": "snowplough",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsnəʊplaʊ/",
            "us": "/ˈsnəʊplaʊ/"
        },
        "nearby": [
            {
                "word": "snowmobile",
                "pos": "noun"
            },
            {
                "word": "snow pea",
                "pos": "noun"
            },
            {
                "word": "snowplough",
                "pos": "noun"
            },
            {
                "word": "snowplough",
                "pos": "verb"
            },
            {
                "word": "snowscape",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vehicle or machine for cleaning snow from roads or railways",
                    "vi": "xe hoặc máy làm sạch tuyết trên đường bộ hoặc đường sắt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "27de03d3086448c7b6775278e691f0c6",
        "word": "thaw",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/θɔː/",
            "us": "/θɔː/"
        },
        "nearby": [
            {
                "word": "Thatcherite",
                "pos": "noun"
            },
            {
                "word": "That Was The Week That Was",
                "pos": ""
            },
            {
                "word": "thaw",
                "pos": "verb"
            },
            {
                "word": "thaw",
                "pos": "noun"
            },
            {
                "word": "the",
                "pos": "definite article"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn back into water after being frozen",
                    "vi": "biến trở lại thành nước sau khi đông lạnh"
                },
                "examples": [
                    {
                        "en": "The country was slowly thawing out after the long cold winter.",
                        "vi": "Đất nước này đang dần tan băng sau mùa đông dài lạnh giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "when it thaws or is thawing, the weather becomes warm enough to melt snow and ice",
                    "vi": "khi nó tan băng hoặc đang tan băng, thời tiết trở nên đủ ấm để làm tan băng tuyết"
                },
                "examples": [
                    {
                        "en": "It's starting to thaw.",
                        "vi": "Nó bắt đầu tan băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become, or to let frozen food become, soft or liquid ready for cooking",
                    "vi": "để trở thành, hoặc để thực phẩm đông lạnh trở thành, mềm hoặc lỏng sẵn sàng để nấu ăn"
                },
                "examples": [
                    {
                        "en": "Leave the meat to thaw completely before cooking.",
                        "vi": "Để thịt rã đông hoàn toàn trước khi nấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become, or make something become, a normal temperature after being very cold",
                    "vi": "trở thành, hoặc làm cho một cái gì đó trở thành nhiệt độ bình thường sau khi rất lạnh"
                },
                "examples": [
                    {
                        "en": "I could feel my ears and toes start to thaw out.",
                        "vi": "Tôi có thể cảm thấy tai và ngón chân của mình bắt đầu rã đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more friendly and less formal",
                    "vi": "trở nên thân thiện hơn và ít trang trọng hơn"
                },
                "examples": [
                    {
                        "en": "Relations between the two countries thawed a little after the talks.",
                        "vi": "Quan hệ giữa hai nước tan băng một chút sau cuộc hội đàm."
                    },
                    {
                        "en": "The atmosphere slowly began to thaw.",
                        "vi": "Bầu không khí từ từ bắt đầu tan băng."
                    },
                    {
                        "en": "The old nun was as imperious as ever, but visibly thawed when she saw the children.",
                        "vi": "Người nữ tu già vẫn uy nghiêm như mọi khi, nhưng trông thấy rõ ràng là tan băng khi nhìn thấy những đứa trẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cbeae8e33864d17afbf578350dfda78",
        "word": "thaw",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/θɔː/",
            "us": "/θɔː/"
        },
        "nearby": [
            {
                "word": "That Was The Week That Was",
                "pos": ""
            },
            {
                "word": "thaw",
                "pos": "verb"
            },
            {
                "word": "thaw",
                "pos": "noun"
            },
            {
                "word": "the",
                "pos": "definite article"
            },
            {
                "word": "THE",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of warmer weather following one of cold weather, causing snow and ice to melt",
                    "vi": "một khoảng thời gian thời tiết ấm hơn sau một trong những thời tiết lạnh giá, khiến băng tuyết tan chảy"
                },
                "examples": [
                    {
                        "en": "The river doubles in size during the spring thaw.",
                        "vi": "Sông tăng gấp đôi kích thước trong mùa đông tan băng."
                    },
                    {
                        "en": "The plants will be ready for use when the spring thaw arrives.",
                        "vi": "Các cây sẽ sẵn sàng để sử dụng khi mùa xuân tan băng đến."
                    },
                    {
                        "en": "The river often floods during the thaw.",
                        "vi": "Sông thường bị lũ lụt trong thời gian tan băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which the relations between two enemy countries become more friendly",
                    "vi": "một tình huống mà quan hệ giữa hai nước thù địch trở nên thân thiện hơn"
                },
                "examples": [
                    {
                        "en": "a thaw in relations with China",
                        "vi": "tan băng trong quan hệ với Trung Quốc"
                    }
                ]
            }
        ]
    },
    {
        "id": "5e4413544b114c86935f78b5fdfdf67f",
        "word": "white-out",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪt aʊt/",
            "us": "/ˈwaɪt aʊt/"
        },
        "nearby": [
            {
                "word": "whiteness",
                "pos": "noun"
            },
            {
                "word": "white noise",
                "pos": "noun"
            },
            {
                "word": "white-out",
                "pos": "noun"
            },
            {
                "word": "the white pages",
                "pos": "noun"
            },
            {
                "word": "White Paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "weather conditions in which there is so much snow or cloud that it is impossible to see anything",
                    "vi": "điều kiện thời tiết có tuyết hoặc nhiều mây đến mức không thể nhìn thấy gì"
                },
                "examples": []
            }
        ]
    }
]