[
    {
        "id": "e48507ab2fd84eab8960ed23b4696d58",
        "word": "car park",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈkɑː pɑːk/",
            "us": "/ˈkɑːr pɑːrk/"
        },
        "nearby": [
            {
                "word": "carpal",
                "pos": "noun"
            },
            {
                "word": "carpal tunnel syndrome",
                "pos": "noun"
            },
            {
                "word": "car park",
                "pos": "noun"
            },
            {
                "word": "carpe diem",
                "pos": "exclamation"
            },
            {
                "word": "carpel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area or a building where people can leave their cars",
                    "vi": "một khu vực hoặc một tòa nhà nơi mọi người có thể để lại ô tô của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5dc8010fd5b84dfc940fa2e6e33d7bb3",
        "word": "road",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/rəʊd/",
            "us": "/rəʊd/"
        },
        "nearby": [
            {
                "word": "roach",
                "pos": "noun"
            },
            {
                "word": "Hal Roach",
                "pos": ""
            },
            {
                "word": "road",
                "pos": "noun"
            },
            {
                "word": "road bike",
                "pos": "noun"
            },
            {
                "word": "roadblock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hard surface built for vehicles to travel on",
                    "vi": "một bề mặt cứng được xây dựng cho các phương tiện đi lại"
                },
                "examples": [
                    {
                        "en": "a main/major/minor road",
                        "vi": "một con đường chính / lớn / phụ"
                    },
                    {
                        "en": "a country/mountain road",
                        "vi": "một quốc gia / đường núi"
                    },
                    {
                        "en": "Take the first road on the left and then follow the signs.",
                        "vi": "Đi theo con đường đầu tiên bên trái, sau đó đi theo các biển báo."
                    },
                    {
                        "en": "The house is on a very busy road.",
                        "vi": "Nhà nằm trên con đường rất sầm uất."
                    },
                    {
                        "en": "along/up/down the road They live just down the road (= further on the same road).",
                        "vi": "dọc theo / lên / xuống đường Họ sống ngay dưới đường (= xa hơn trên cùng một con đường)."
                    },
                    {
                        "en": "He was walking along the road when he was attacked.",
                        "vi": "Anh ta đang đi trên đường thì bị tấn công."
                    },
                    {
                        "en": "by road It takes about five hours by road (= driving).",
                        "vi": "bằng đường bộ Mất khoảng năm giờ đường bộ (= lái xe)."
                    },
                    {
                        "en": "It would be better to transport the goods by rail rather than by road.",
                        "vi": "Sẽ tốt hơn nếu bạn vận chuyển hàng hóa bằng đường sắt hơn là đường bộ."
                    },
                    {
                        "en": "It's difficult to cross the road safely around here.",
                        "vi": "Rất khó để băng qua đường một cách an toàn quanh đây."
                    },
                    {
                        "en": "road accidents/safety/users",
                        "vi": "tai nạn / an toàn đường bộ / người sử dụng"
                    },
                    {
                        "en": "There have been 34 road deaths this month.",
                        "vi": "Đã có 34 trường hợp tử vong trên đường trong tháng này."
                    },
                    {
                        "en": "India has worked hard to improve its road network.",
                        "vi": "Ấn Độ đã làm việc chăm chỉ để cải thiện mạng lưới đường bộ của mình."
                    },
                    {
                        "en": "The steep and winding little road was covered in mud.",
                        "vi": "Con đường nhỏ dốc và quanh co ngập trong bùn."
                    },
                    {
                        "en": "With heavy road traffic, roads deteriorate rapidly.",
                        "vi": "Với giao thông đường bộ đông đúc, các con đường xuống cấp nhanh chóng."
                    },
                    {
                        "en": "a 10-mile road race",
                        "vi": "một cuộc đua đường dài 10 dặm"
                    },
                    {
                        "en": "a notoriously dangerous stretch of road",
                        "vi": "một đoạn đường nổi tiếng nguy hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in names of roads, especially in towns",
                    "vi": "được sử dụng trong tên của các con đường, đặc biệt là ở các thị trấn"
                },
                "examples": [
                    {
                        "en": "35 York Road",
                        "vi": "Đường 35 York"
                    },
                    {
                        "en": "We live in/on Kingston Road.",
                        "vi": "Chúng tôi sống ở / trên đường Kingston."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way to achieving something",
                    "vi": "cách để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "on the road to something to be on the road to recovery",
                        "vi": "trên con đường đến một cái gì đó trên con đường phục hồi"
                    },
                    {
                        "en": "This first exhibition has set him on the road to success.",
                        "vi": "Cuộc triển lãm đầu tiên này đã đưa anh đến với con đường thành công."
                    },
                    {
                        "en": "We have discussed privatization, but we would prefer not to go down that particular road.",
                        "vi": "Chúng tôi đã thảo luận về tư nhân hóa, nhưng chúng tôi không muốn đi theo con đường cụ thể đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "at some time in the future",
                    "vi": "vào một thời điểm nào đó trong tương lai"
                },
                "examples": [
                    {
                        "en": "There are certain to be more job losses further down the road.",
                        "vi": "Chắc chắn sẽ có nhiều mất việc hơn nữa."
                    },
                    {
                        "en": "Will this movie still be funny a few years down the road?",
                        "vi": "Liệu bộ phim này có còn hài hước trong vài năm nữa không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "anyway",
                    "vi": "dù sao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to reach) the point at which something can no longer continue in the same way",
                    "vi": "(đạt đến) điểm mà tại đó điều gì đó không còn có thể tiếp tục theo cách cũ"
                },
                "examples": [
                    {
                        "en": "A defeat in the second round marked the end of the line for last year's champion.",
                        "vi": "Một thất bại ở vòng thứ hai đánh dấu dấu chấm hết cho nhà vô địch năm ngoái."
                    },
                    {
                        "en": "The loss of this contract could signal the end of the line for the shipyard.",
                        "vi": "Việc mất hợp đồng này có thể báo hiệu sự kết thúc của dây chuyền cho nhà máy đóng tàu."
                    },
                    {
                        "en": "This latest disagreement could mean the end of the road for the band.",
                        "vi": "Sự bất đồng mới nhất này có thể có nghĩa là con đường kết thúc của ban nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start an activity or a journey",
                    "vi": "để bắt đầu một hoạt động hoặc một cuộc hành trình"
                },
                "examples": [
                    {
                        "en": "Let's get this show on the road!",
                        "vi": "Hãy bắt đầu chương trình này trên đường!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to start a journey",
                    "vi": "để bắt đầu một cuộc hành trình"
                },
                "examples": [
                    {
                        "en": "The following spring I hit the road.",
                        "vi": "Mùa xuân năm sau tôi lên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to delay dealing with a problem",
                    "vi": "trì hoãn việc giải quyết một vấn đề"
                },
                "examples": [
                    {
                        "en": "This is another attempt to kick the can down the road and leave it to the next generation.",
                        "vi": "Đây là một nỗ lực khác để đá chiếc lon xuống đường và để lại nó cho thế hệ tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "not in good enough condition to be legally driven on public roads",
                    "vi": "không đủ điều kiện tốt để được lái xe hợp pháp trên đường công cộng"
                },
                "examples": [
                    {
                        "en": "My car's off the road at the moment.",
                        "vi": "Xe của tôi đang ở ngoài đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a last alcoholic drink before you leave a party, etc.",
                    "vi": "một ly rượu cuối cùng trước khi bạn rời bữa tiệc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "travelling, especially for long distances or periods of time",
                    "vi": "đi du lịch, đặc biệt là trong khoảng cách xa hoặc trong thời gian dài"
                },
                "examples": [
                    {
                        "en": "The band has been on the road for six months.",
                        "vi": "Ban nhạc đã hoạt động được sáu tháng."
                    },
                    {
                        "en": "I’ve been on the road since six this morning.",
                        "vi": "Tôi đã lên đường từ sáu giờ sáng nay."
                    },
                    {
                        "en": "We'd been on the road since dawn and needed a rest.",
                        "vi": "Chúng tôi đã đi trên đường từ lúc bình minh và cần nghỉ ngơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in good condition so that it can be legally driven",
                    "vi": "trong tình trạng tốt để nó có thể được điều khiển hợp pháp"
                },
                "examples": [
                    {
                        "en": "It will cost about £500 to get the car back on the road.",
                        "vi": "Sẽ tốn khoảng £ 500 để đưa chiếc xe trở lại trên đường."
                    },
                    {
                        "en": "My car is back on the road.",
                        "vi": "Xe của tôi đã trở lại trên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "moving from place to place, and having no permanent home",
                    "vi": "di chuyển từ nơi này sang nơi khác và không có nhà cố định"
                },
                "examples": [
                    {
                        "en": "Life on the road can be very hard.",
                        "vi": "Cuộc sống trên đường có thể rất khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not enough to intend to do good things; you must actually do them",
                    "vi": "ý định làm điều tốt thôi là chưa đủ; bạn thực sự phải làm chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the point at which something is tested and you really find out whether it is successful or true",
                    "vi": "thời điểm mà một thứ gì đó được thử nghiệm và bạn thực sự tìm ra nó thành công hay đúng sự thật"
                },
                "examples": [
                    {
                        "en": "Here's where the rubber meets the road: will consumers actually buy the product?",
                        "vi": "Đây là nơi mà cao su gặp trên đường: liệu người tiêu dùng có thực sự mua sản phẩm không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "ae7e3e5df2f0499f8fae07e46a6d16f0",
        "word": "corner",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkɔːnə(r)/",
            "us": "/ˈkɔːrnər/"
        },
        "nearby": [
            {
                "word": "corned beef",
                "pos": "noun"
            },
            {
                "word": "cornelian",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "verb"
            },
            {
                "word": "cornerback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of something where two or more sides, lines or edges join",
                    "vi": "một phần của thứ gì đó có hai hoặc nhiều cạnh, đường hoặc cạnh nối với nhau"
                },
                "examples": [
                    {
                        "en": "the four corners of a square",
                        "vi": "bốn góc của một hình vuông"
                    },
                    {
                        "en": "I hit my knee on the corner of the table.",
                        "vi": "Tôi đập đầu gối vào góc bàn."
                    },
                    {
                        "en": "Write your address in the top right-hand corner of the letter.",
                        "vi": "Viết địa chỉ của bạn ở góc trên cùng bên phải của bức thư."
                    },
                    {
                        "en": "the left/right corner",
                        "vi": "góc trái / phải"
                    },
                    {
                        "en": "the north-west/north-east/south-east/south-west corner",
                        "vi": "góc tây bắc / đông bắc / nam đông / tây nam"
                    },
                    {
                        "en": "A smile lifted the corner of his mouth.",
                        "vi": "Một nụ cười nhếch lên khóe miệng."
                    },
                    {
                        "en": "in the corner of something a speck of dirt in the corner of her eye",
                        "vi": "trong góc của thứ gì đó có một đốm bẩn trong khóe mắt của cô ấy"
                    },
                    {
                        "en": "He scored with a shot into the bottom corner of the goal.",
                        "vi": "Anh ấy đã ghi bàn bằng một cú sút vào góc thấp khung thành."
                    },
                    {
                        "en": "She tucked the ball into the corner of the net.",
                        "vi": "Cô ấy đệm bóng vào góc lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the number of corners mentioned; involving the number of groups mentioned",
                    "vi": "với số lượng các góc đã nêu; liên quan đến số lượng các nhóm được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-cornered hat",
                        "vi": "một chiếc mũ ba góc"
                    },
                    {
                        "en": "a three-cornered fight",
                        "vi": "một cuộc chiến ba góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the place inside a room or a box where two sides join; the area around this place",
                    "vi": "nơi bên trong một căn phòng hoặc một cái hộp mà hai bên tham gia vào nhau; khu vực xung quanh nơi này"
                },
                "examples": [
                    {
                        "en": "A large desk occupies another corner of the room.",
                        "vi": "Một bàn làm việc lớn chiếm một góc khác của căn phòng."
                    },
                    {
                        "en": "He found a quiet corner and got on with his work.",
                        "vi": "Anh tìm một góc yên tĩnh và tiếp tục với công việc của mình."
                    },
                    {
                        "en": "in the corner They made straight for the table in the corner.",
                        "vi": "ở góc Họ đã làm thẳng cho cái bàn trong góc."
                    },
                    {
                        "en": "in the corner of something She spotted him sitting in the corner of the bar.",
                        "vi": "trong góc của cái gì đó Cô phát hiện ra anh ta đang ngồi trong góc của quầy bar."
                    },
                    {
                        "en": "We found an empty booth in a dark corner of the pub.",
                        "vi": "Chúng tôi tìm thấy một gian hàng trống trong một góc tối của quán rượu."
                    },
                    {
                        "en": "There was a television in the far corner of the bedroom.",
                        "vi": "Có một chiếc tivi ở góc xa của phòng ngủ."
                    },
                    {
                        "en": "a corner table/seat/cupboard",
                        "vi": "một cái bàn / chỗ ngồi / cái tủ ở góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two streets join",
                    "vi": "một nơi mà hai con phố nối với nhau"
                },
                "examples": [
                    {
                        "en": "The wind hit him as he turned the corner.",
                        "vi": "Gió ập vào anh khi anh rẽ vào góc đường."
                    },
                    {
                        "en": "corner of A and B the last house before the corner of Beach Road and Hill Avenue",
                        "vi": "căn góc A và B căn nhà cuối cùng trước góc đường Beach và đại lộ Hill"
                    },
                    {
                        "en": "on the corner There was a group of youths standing on the street corner.",
                        "vi": "ở góc phố Có một nhóm thanh niên đang đứng ở góc phố."
                    },
                    {
                        "en": "on the corner of something There’s a hotel on the corner of my street.",
                        "vi": "ở góc của cái gì đó Có một khách sạn ở góc đường của tôi."
                    },
                    {
                        "en": "at the corner (of something) Turn right at the corner of Sunset and Crescent Heights Boulevards.",
                        "vi": "ở góc (của một cái gì đó) Rẽ phải ở góc của Đại lộ Hoàng hôn và Lưỡi liềm."
                    },
                    {
                        "en": "around/round the corner The bus stop is around the corner, I think.",
                        "vi": "xung quanh / vòng quanh góc Trạm xe buýt ở quanh góc, tôi nghĩ."
                    },
                    {
                        "en": "around/round the corner from something the bookshop around the corner from our hotel",
                        "vi": "xung quanh / vòng quanh góc từ một cái gì đó hiệu sách xung quanh góc từ khách sạn của chúng tôi"
                    },
                    {
                        "en": "(at the) corner with something the big tree at the corner with Hill Street",
                        "vi": "(ở góc) với một cái gì đó cái cây lớn ở góc với Phố Hill"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road",
                    "vi": "một khúc cua gấp trên một con đường"
                },
                "examples": [
                    {
                        "en": "The car was taking the corners too fast.",
                        "vi": "Chiếc xe đã vào góc quá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a region or an area of a place (sometimes used for one that is far away or difficult to reach)",
                    "vi": "một khu vực hoặc một khu vực của một địa điểm (đôi khi được sử dụng cho một địa điểm ở xa hoặc khó tiếp cận)"
                },
                "examples": [
                    {
                        "en": "She lives in a quiet corner of rural Yorkshire.",
                        "vi": "Cô sống ở một góc yên tĩnh của vùng nông thôn Yorkshire."
                    },
                    {
                        "en": "Students come here from the four corners of the world.",
                        "vi": "Sinh viên đến đây từ bốn phương."
                    },
                    {
                        "en": "He knew every corner of the old town.",
                        "vi": "Anh biết mọi ngóc ngách của khu phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation",
                    "vi": "Một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "to back/drive/force somebody into a corner",
                        "vi": "lùi / lái xe / buộc ai đó vào một góc"
                    },
                    {
                        "en": "They had got her in a corner, and there wasn't much she could do about it.",
                        "vi": "Họ đã dồn cô ấy vào một góc, và cô ấy không thể làm được gì nhiều."
                    },
                    {
                        "en": "He was used to talking his way out of tight corners.",
                        "vi": "Anh ấy đã quen với việc nói theo cách của mình từ những góc hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a free kick or hit that you take from the corner of your opponent’s end of the field",
                    "vi": "một quả đá phạt hoặc cú đánh mà bạn thực hiện từ góc cuối sân của đối phương"
                },
                "examples": [
                    {
                        "en": "Moore took the corner.",
                        "vi": "Moore thực hiện quả phạt góc."
                    },
                    {
                        "en": "The referee awarded a corner.",
                        "vi": "Trọng tài cho hưởng quả phạt góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four corners of a ring; the supporters who help in the corner",
                    "vi": "bất kỳ trong bốn góc của một chiếc nhẫn; những người ủng hộ giúp đỡ trong góc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very near",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "Her house is just around the corner.",
                        "vi": "Nhà cô ấy ở ngay góc phố."
                    },
                    {
                        "en": "(figurative) There were good times around the corner (= they would soon come).",
                        "vi": "(nghĩa bóng) Đã có những khoảng thời gian tuyệt vời (= họ sẽ sớm đến)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support and encourage somebody; to have somebody who supports and encourages you",
                    "vi": "để hỗ trợ và khuyến khích ai đó; để có ai đó ủng hộ và khuyến khích bạn"
                },
                "examples": [
                    {
                        "en": "He's been in my corner all these years and I can never thank him enough.",
                        "vi": "Anh ấy đã ở trong góc của tôi suốt những năm qua và tôi không bao giờ có thể cảm ơn anh ấy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go across the corner of an area and not around the sides of it, because it is quicker",
                    "vi": "để đi qua góc của một khu vực chứ không phải xung quanh các cạnh của nó, bởi vì nó nhanh hơn"
                },
                "examples": [
                    {
                        "en": "There’s a worn patch on the grass because everyone cuts (off) the corner.",
                        "vi": "Có một mảng cỏ đã mòn vì mọi người cắt bỏ (cắt bỏ) góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out",
                    "vi": "để làm điều gì đó theo cách dễ nhất, rẻ nhất hoặc nhanh nhất, thường bằng cách bỏ qua các quy tắc hoặc bỏ qua điều gì đó"
                },
                "examples": [
                    {
                        "en": "To be competitive, they paid low wages and cut corners on health and safety.",
                        "vi": "Để cạnh tranh, họ trả lương thấp và cắt giảm sức khỏe và an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defend your/somebody’s position against other people",
                    "vi": "để bảo vệ lập trường của bạn / ai đó trước những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft corner for you.",
                        "vi": "Cô ấy luôn có một góc mềm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    },
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it",
                    "vi": "nhìn thấy vật gì đó một cách tình cờ hoặc không rõ ràng lắm vì bạn nhìn thấy vật đó từ phía bên mắt mình và không nhìn thẳng vào vật đó"
                },
                "examples": [
                    {
                        "en": "Out of the corner of her eye, she saw him coming closer.",
                        "vi": "Qua khóe mắt, cô thấy anh đang tiến lại gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass a very important point in an illness or a difficult situation and begin to improve",
                    "vi": "vượt qua một điểm rất quan trọng trong một căn bệnh hoặc một tình huống khó khăn và bắt đầu cải thiện"
                },
                "examples": [
                    {
                        "en": "The country's economy has finally turned the corner.",
                        "vi": "Nền kinh tế của đất nước cuối cùng cũng đã rẽ vào ngõ ngách."
                    }
                ]
            }
        ]
    },
    {
        "id": "08a334625b5e493fb837506b5761241a",
        "word": "bend",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/bend/",
            "us": "/bend/"
        },
        "nearby": [
            {
                "word": "benchwarmer",
                "pos": "noun"
            },
            {
                "word": "bend",
                "pos": "verb"
            },
            {
                "word": "bend",
                "pos": "noun"
            },
            {
                "word": "bender",
                "pos": "noun"
            },
            {
                "word": "bend to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a curve or turn, especially in a road or river",
                    "vi": "khúc cua hoặc chỗ rẽ, đặc biệt là trên đường hoặc sông"
                },
                "examples": [
                    {
                        "en": "a sharp bend in the road",
                        "vi": "một khúc cua gấp trên đường"
                    },
                    {
                        "en": "You took that bend very fast!",
                        "vi": "Bạn đã bẻ cong rất nhanh!"
                    },
                    {
                        "en": "He lost control on a bend and crashed into a tree.",
                        "vi": "Anh ta mất kiểm soát ở một khúc cua và đâm vào một cái cây."
                    },
                    {
                        "en": "As the driver came round the bend, she saw the lorry.",
                        "vi": "Khi người lái xe đến khúc cua, cô nhìn thấy chiếc xe tải."
                    }
                ]
            },
            {
                "define": {
                    "en": "severe pain and difficulty in breathing experienced by a diver who comes back to the surface of the water too quickly",
                    "vi": "đau dữ dội và khó thở do một thợ lặn trở lại mặt nước quá nhanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": [
                    {
                        "en": "She's gone completely round the bend.",
                        "vi": "Cô ấy đã hoàn toàn đi vòng quanh khúc cua."
                    },
                    {
                        "en": "The kids have been driving me round the bend today (= annoying me very much).",
                        "vi": "Hôm nay bọn trẻ đã chở tôi đi vòng quanh khúc cua (= làm tôi rất khó chịu)."
                    }
                ]
            }
        ]
    },
    {
        "id": "3332ed0ec45a4f189c99171dab97bd35",
        "word": "bike",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/baɪk/",
            "us": "/baɪk/"
        },
        "nearby": [
            {
                "word": "bijou",
                "pos": "adjective"
            },
            {
                "word": "bike",
                "pos": "noun"
            },
            {
                "word": "bike",
                "pos": "verb"
            },
            {
                "word": "bike lane",
                "pos": "noun"
            },
            {
                "word": "biker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go somewhere on a bicycle or motorcycle",
                    "vi": "đi đâu đó bằng xe đạp hoặc xe máy"
                },
                "examples": [
                    {
                        "en": "My dad bikes to work every day.",
                        "vi": "Bố tôi đạp xe đi làm hàng ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send something to somebody by motorcycle",
                    "vi": "gửi một cái gì đó cho ai đó bằng xe máy"
                },
                "examples": [
                    {
                        "en": "I'll bike the contract over to you this afternoon.",
                        "vi": "Chiều nay tôi sẽ chuyển giao hợp đồng cho bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e888be057aee4bc088b568a085e83ce0",
        "word": "block",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/blɒk/",
            "us": "/blɑːk/"
        },
        "nearby": [
            {
                "word": "blob",
                "pos": "noun"
            },
            {
                "word": "bloc",
                "pos": "noun"
            },
            {
                "word": "block",
                "pos": "noun"
            },
            {
                "word": "block",
                "pos": "verb"
            },
            {
                "word": "blockade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of a solid material that is square or rectangular in shape and usually has flat sides",
                    "vi": "một miếng vật liệu rắn lớn có hình vuông hoặc hình chữ nhật và thường có các mặt phẳng"
                },
                "examples": [
                    {
                        "en": "The houses are made of concrete blocks with tin roofs.",
                        "vi": "Những ngôi nhà được làm bằng những khối bê tông với mái lợp bằng thiếc."
                    },
                    {
                        "en": "block of something a block of ice/wood",
                        "vi": "khối của cái gì đó một khối băng / gỗ"
                    },
                    {
                        "en": "The wall was made from massive blocks of stone.",
                        "vi": "Bức tường được làm từ những khối đá khổng lồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall building that contains flats or offices; buildings that form part of a school, hospital, etc. which are used for a particular purpose",
                    "vi": "một tòa nhà cao có căn hộ hoặc văn phòng; các tòa nhà tạo thành một phần của trường học, bệnh viện, v.v. được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a block of flats",
                        "vi": "một khối căn hộ"
                    },
                    {
                        "en": "a tower block",
                        "vi": "một khối tháp"
                    },
                    {
                        "en": "an office block",
                        "vi": "một khối văn phòng"
                    },
                    {
                        "en": "She lives in a modern apartment block.",
                        "vi": "Cô ấy sống trong một khu chung cư hiện đại."
                    },
                    {
                        "en": "the university’s science block",
                        "vi": "khối khoa học của trường đại học"
                    }
                ]
            },
            {
                "define": {
                    "en": "the length of one side of a piece of land or group of buildings, from the place where one street crosses it to the next",
                    "vi": "chiều dài một mặt của mảnh đất hoặc nhóm tòa nhà, từ nơi có đường phố cắt qua đường này đến đường phố tiếp theo"
                },
                "examples": [
                    {
                        "en": "His apartment is three blocks away from the police station.",
                        "vi": "Căn hộ của anh ta cách đồn cảnh sát ba dãy nhà."
                    },
                    {
                        "en": "They walked a few blocks down the street.",
                        "vi": "Họ đi bộ vài dãy phố xuống phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of buildings with streets on all sides",
                    "vi": "một nhóm các tòa nhà với các đường phố ở tất cả các phía"
                },
                "examples": [
                    {
                        "en": "around the block She took the dog for a walk around the block.",
                        "vi": "quanh khu phố Cô dắt chó đi dạo quanh khu nhà."
                    },
                    {
                        "en": "(North American English) The downtown area covers four city blocks.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Khu vực trung tâm thành phố bao gồm bốn khối phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of land",
                    "vi": "một khu đất rộng lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an area of land for building a house on",
                    "vi": "diện tích đất để xây nhà trên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a quantity of something or an amount of time that is considered as a single unit",
                    "vi": "một lượng nào đó hoặc một lượng thời gian được coi là một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "a block of shares",
                        "vi": "một khối cổ phiếu"
                    },
                    {
                        "en": "a block of text in a document",
                        "vi": "một khối văn bản trong tài liệu"
                    },
                    {
                        "en": "(British English) The theatre gives discounts for block bookings (= a large number of tickets bought at the same time).",
                        "vi": "(Tiếng Anh Anh) Nhà hát giảm giá cho các đặt trước theo khối (= số lượng lớn vé được mua cùng một lúc)."
                    },
                    {
                        "en": "The three-hour class is divided into four blocks of 45 minutes each.",
                        "vi": "Lớp học kéo dài ba giờ được chia thành bốn khối, mỗi khối 45 phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that makes movement or progress difficult or impossible",
                    "vi": "một cái gì đó làm cho việc di chuyển hoặc tiến bộ trở nên khó khăn hoặc không thể thực hiện được"
                },
                "examples": [
                    {
                        "en": "Lack of training acts as a block to progress in a career.",
                        "vi": "Thiếu đào tạo đóng vai trò như một yếu tố cản trở sự tiến bộ trong sự nghiệp."
                    },
                    {
                        "en": "I suddenly had a mental block and couldn't remember his name.",
                        "vi": "Tôi đột nhiên bị chặn đầu óc và không thể nhớ được tên của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a movement that stops another player from going forward",
                    "vi": "một chuyển động ngăn người chơi khác tiến lên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the two blocks on the ground that runners push their feet against at the beginning of a race",
                    "vi": "hai khối trên mặt đất mà người chạy bộ đẩy chân của họ vào khi bắt đầu cuộc đua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the past) the piece of wood on which a person’s head was cut off as a punishment",
                    "vi": "(trong quá khứ) khúc gỗ bị chặt đầu người như một hình phạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is very similar to their mother or father in the way that they look or behave",
                    "vi": "một người rất giống với mẹ hoặc cha của họ trong cách họ nhìn hoặc cư xử"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be sold, especially at an auction (= a sale in which items are sold to the person who offers the most money)",
                    "vi": "được bán, đặc biệt là tại một cuộc đấu giá (= một cuộc mua bán trong đó các mặt hàng được bán cho người cung cấp nhiều tiền nhất)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a lot of experience",
                    "vi": "để có nhiều kinh nghiệm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to threaten somebody that you will hit them",
                    "vi": "từng đe dọa ai đó rằng bạn sẽ đánh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is new to a place, an organization, etc.",
                    "vi": "một người mới đến một địa điểm, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "Despite his six years in politics, he was still regarded by many as the new kid on the block.",
                        "vi": "Mặc dù đã có sáu năm làm chính trị, ông vẫn được nhiều người coi là đứa trẻ mới trong khối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to risk losing your job, damaging your reputation, etc. by doing or saying something",
                    "vi": "có nguy cơ mất việc, làm tổn hại danh tiếng của bạn, v.v. bằng cách làm hoặc nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's not a matter that I'm prepared to put my head on the block for.",
                        "vi": "Đó không phải là vấn đề mà tôi đã chuẩn bị sẵn sàng để đặt đầu của mình vào khối."
                    }
                ]
            }
        ]
    },
    {
        "id": "2893d015af4c497ca29cfb36e0cc806d",
        "word": "divide",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪˈvaɪd/",
            "us": "/dɪˈvaɪd/"
        },
        "nearby": [
            {
                "word": "divestiture",
                "pos": "noun"
            },
            {
                "word": "divestment",
                "pos": "noun"
            },
            {
                "word": "divide",
                "pos": "verb"
            },
            {
                "word": "divide",
                "pos": "noun"
            },
            {
                "word": "divided",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to separate into parts; to make something separate into parts",
                    "vi": "để tách thành các phần; để làm cho một cái gì đó tách biệt thành các phần"
                },
                "examples": [
                    {
                        "en": "The cells began to divide rapidly.",
                        "vi": "Các tế bào bắt đầu phân chia nhanh chóng."
                    },
                    {
                        "en": "divide into something The questions divide into two categories: easy and hard.",
                        "vi": "Chia thành cái gì Các câu hỏi chia thành hai loại: dễ và khó."
                    },
                    {
                        "en": "divide up After lunch we divided up for group discussions.",
                        "vi": "chia nhau Sau khi ăn trưa, chúng tôi chia nhau để thảo luận nhóm."
                    },
                    {
                        "en": "divide something (into something) I divided the class into four groups.",
                        "vi": "chia một cái gì đó (thành một cái gì đó) Tôi chia lớp thành bốn nhóm."
                    },
                    {
                        "en": "Divide the dough into four pieces.",
                        "vi": "Chia bột thành bốn phần."
                    },
                    {
                        "en": "The book is divided into 11 sections.",
                        "vi": "Cuốn sách được chia thành 11 phần."
                    },
                    {
                        "en": "divide something up (into something) A sentence can be divided up into meaningful segments.",
                        "vi": "Chia một cái gì đó lên (thành một cái gì đó) Một câu có thể được chia thành các đoạn có nghĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to separate something into parts and give a share to each of a number of different people, etc.",
                    "vi": "để tách một cái gì đó thành các phần và chia sẻ cho từng người trong số những người khác nhau, v.v."
                },
                "examples": [
                    {
                        "en": "They could not agree on how to divide the land.",
                        "vi": "Họ không thống nhất được với nhau về cách chia đất."
                    },
                    {
                        "en": "divide something up Jack divided up the rest of the cash.",
                        "vi": "chia một thứ gì đó Jack chia phần còn lại của tiền mặt."
                    },
                    {
                        "en": "divide something (up) between somebody We divided the work between us.",
                        "vi": "phân chia thứ gì đó (lên) giữa ai đó Chúng ta đã chia công việc giữa chúng ta."
                    },
                    {
                        "en": "divide something (up) among somebody Profits were divided up among the staff.",
                        "vi": "chia một cái gì đó (lên) cho ai đó Lợi nhuận được chia cho các nhân viên."
                    },
                    {
                        "en": "The money was divided equally among his sons.",
                        "vi": "Số tiền được chia đều cho các con trai của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use different parts of your time, energy, etc. for different activities, etc.",
                    "vi": "để sử dụng các phần thời gian, năng lượng khác nhau, v.v. của bạn cho các hoạt động khác nhau, v.v."
                },
                "examples": [
                    {
                        "en": "divide something As working parents we think carefully about how we divide our time.",
                        "vi": "Phân chia thứ gì đó Là những bậc cha mẹ đang đi làm, chúng ta suy nghĩ cẩn thận về cách chúng ta phân chia thời gian của mình."
                    },
                    {
                        "en": "divide something between A and B He divides his energies between politics and business.",
                        "vi": "phân chia thứ gì đó giữa A và B Anh ta phân chia sức lực của mình giữa chính trị và kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to separate into two or more parts that lead in different directions",
                    "vi": "để tách thành hai hoặc nhiều phần dẫn theo các hướng khác nhau"
                },
                "examples": [
                    {
                        "en": "Where the path divides, keep right.",
                        "vi": "Con đường phân chia ở đâu, hãy đi bên phải."
                    },
                    {
                        "en": "divide into something The river divides into several channels.",
                        "vi": "chia thành một cái gì đó Con sông chia thành nhiều kênh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to separate two people or things",
                    "vi": "để tách biệt hai người hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "Can it ever be right to divide a mother from her child?",
                        "vi": "Có khi nào đúng khi chia rẽ người mẹ với con mình không?"
                    },
                    {
                        "en": "The landowners were divided from the mass of poor peasants who lived in the surrounding area.",
                        "vi": "Các chủ đất được phân chia từ khối lượng nông dân nghèo sống ở khu vực xung quanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the real or imaginary line or barrier that separates two people or things",
                    "vi": "là ranh giới hoặc rào cản thực hoặc tưởng tượng ngăn cách hai người hoặc mọi thứ"
                },
                "examples": [
                    {
                        "en": "divide something (off) A fence divides off the western side of the grounds.",
                        "vi": "phân chia một cái gì đó (tắt) Một hàng rào ngăn cách phía tây của khu đất."
                    },
                    {
                        "en": "divide A from B The English Channel divides England from France.",
                        "vi": "chia A khỏi B Kênh tiếng Anh chia Anh với Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find out how many times one number is contained in another",
                    "vi": "để tìm ra bao nhiêu lần một số được chứa trong một số khác"
                },
                "examples": [
                    {
                        "en": "divide something by something 30 divided by 6 is 5 (= 30 ÷ 6 = 5).",
                        "vi": "chia một cái gì đó cho cái gì đó 30 chia cho 6 là 5 (= 30 ÷ 6 = 5)."
                    },
                    {
                        "en": "divide by something It's easy to divide by ten.",
                        "vi": "chia cho một cái gì đó Thật dễ dàng để chia cho mười."
                    },
                    {
                        "en": "The children are learning how to multiply and divide.",
                        "vi": "Những đứa trẻ đang học cách nhân và chia."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be multiplied to give another number",
                    "vi": "để có thể được nhân lên để đưa ra một số khác"
                },
                "examples": [
                    {
                        "en": "5 divides into 30 6 times.",
                        "vi": "5 chia thành 30 6 lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make people disagree",
                    "vi": "làm cho mọi người không đồng ý"
                },
                "examples": [
                    {
                        "en": "divide somebody/something to divide the nation/country",
                        "vi": "chia rẽ ai đó / cái gì đó để chia rẽ quốc gia / đất nước"
                    },
                    {
                        "en": "This issue has bitterly divided the community.",
                        "vi": "Vấn đề này đã gây chia rẽ cộng đồng một cách gay gắt."
                    },
                    {
                        "en": "The building divides opinion (= some people like it and some do not).",
                        "vi": "Tòa nhà chia rẽ ý kiến (= một số người thích và một số không)."
                    },
                    {
                        "en": "be divided on/over something The party is deeply divided on this question.",
                        "vi": "bị chia rẽ về / về điều gì Bên bị chia rẽ sâu sắc về câu hỏi này."
                    },
                    {
                        "en": "to be evenly/sharply divided over the issue",
                        "vi": "được chia đều / rõ ràng về vấn đề"
                    }
                ]
            },
            {
                "define": {
                    "en": "to disagree",
                    "vi": "không đồng ý"
                },
                "examples": [
                    {
                        "en": "Communities frequently divided along religious lines.",
                        "vi": "Các cộng đồng thường xuyên bị chia rẽ theo các dòng tôn giáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you",
                    "vi": "để giữ quyền kiểm soát mọi người bằng cách khiến họ không đồng ý và chống lại nhau, do đó không cho họ cơ hội tham gia cùng nhau và chống lại bạn"
                },
                "examples": [
                    {
                        "en": "a policy of divide and rule",
                        "vi": "chính sách chia để trị"
                    }
                ]
            },
            {
                "define": {
                    "en": "to divide something into two equal parts; to divide into two equal parts",
                    "vi": "để chia một cái gì đó thành hai phần bằng nhau; chia thành hai phần bằng nhau"
                },
                "examples": [
                    {
                        "en": "The country was split down the middle over the strike (= half supported it, half did not).",
                        "vi": "Đất nước bị chia cắt giữa chừng vì cuộc đình công (= một nửa ủng hộ, một nửa không)."
                    },
                    {
                        "en": "Divide the cake down the middle.",
                        "vi": "Chia nhân bánh xuống giữa."
                    },
                    {
                        "en": "It would seem the community has divided down the middle, with some favouring expansion and some dead set against it.",
                        "vi": "Có vẻ như cộng đồng đã chia rẽ giữa chừng, một số ủng hộ việc mở rộng và một số đã chết chống lại nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ab5b828be3e4ef08e08f98ac7a977ce",
        "word": "road sign",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈrəʊd saɪn/",
            "us": "/ˈrəʊd saɪn/"
        },
        "nearby": [
            {
                "word": "roadshow",
                "pos": "noun"
            },
            {
                "word": "roadside",
                "pos": "noun"
            },
            {
                "word": "road sign",
                "pos": "noun"
            },
            {
                "word": "roadster",
                "pos": "noun"
            },
            {
                "word": "road tax",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sign near a road giving information or instructions to drivers",
                    "vi": "một biển báo gần một con đường cung cấp thông tin hoặc hướng dẫn cho người lái xe"
                },
                "examples": [
                    {
                        "en": "We couldn't read the road signs.",
                        "vi": "Chúng tôi không thể đọc các bảng chỉ đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea575c5576f04b21bec82fbfb3fd71fa",
        "word": "street light",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈstriːt laɪt/",
            "us": "/ˈstriːt laɪt/"
        },
        "nearby": [
            {
                "word": "street furniture",
                "pos": "noun"
            },
            {
                "word": "street hockey",
                "pos": "noun"
            },
            {
                "word": "street light",
                "pos": "noun"
            },
            {
                "word": "street party",
                "pos": "noun"
            },
            {
                "word": "street people",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a light at the top of a tall post in the street",
                    "vi": "ở trên đỉnh của một cột cao trên đường phố"
                },
                "examples": [
                    {
                        "en": "There are no street lights in the village.",
                        "vi": "Không có đèn đường trong làng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec9d2778c7aa4b9ab34eaedc440ae6d6",
        "word": "surface",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsɜːfɪs/",
            "us": "/ˈsɜːrfɪs/"
        },
        "nearby": [
            {
                "word": "surf",
                "pos": "noun"
            },
            {
                "word": "surf",
                "pos": "verb"
            },
            {
                "word": "surface",
                "pos": "noun"
            },
            {
                "word": "surface",
                "pos": "verb"
            },
            {
                "word": "surface mail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outside or top layer of something",
                    "vi": "bên ngoài hoặc lớp trên cùng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need a flat, smooth surface to play the game on.",
                        "vi": "Chúng ta cần một bề mặt phẳng, nhẵn để chơi trò chơi."
                    },
                    {
                        "en": "an uneven road surface",
                        "vi": "mặt đường không bằng phẳng"
                    },
                    {
                        "en": "a broad leaf with a large surface area",
                        "vi": "một chiếc lá rộng với một diện tích bề mặt lớn"
                    },
                    {
                        "en": "Surface water (= rainwater that has collected on the surface of a road) made driving conditions hazardous.",
                        "vi": "Nước bề mặt (= nước mưa đọng trên bề mặt đường) làm cho điều kiện lái xe trở nên nguy hiểm."
                    },
                    {
                        "en": "Teeth have a hard surface layer called enamel.",
                        "vi": "Răng có một lớp bề mặt cứng gọi là men răng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top layer of an area of water or land",
                    "vi": "lớp trên cùng của một vùng nước hoặc đất"
                },
                "examples": [
                    {
                        "en": "the earth's surface",
                        "vi": "bề mặt của Trái Đất"
                    },
                    {
                        "en": "on the surface (of something) These plants float on the surface of the water.",
                        "vi": "trên bề mặt (của cái gì đó) Những cây này nổi trên mặt nước."
                    },
                    {
                        "en": "below/beneath/under the surface (of something) We could see fish swimming just below the surface.",
                        "vi": "bên dưới / bên dưới / bên dưới bề mặt (của cái gì đó) Chúng ta có thể thấy cá bơi ngay dưới bề mặt."
                    },
                    {
                        "en": "Alligators lurk beneath the surface of the swamp.",
                        "vi": "Cá sấu ẩn mình dưới bề mặt đầm lầy."
                    },
                    {
                        "en": "The earth’s surface temperature is rising.",
                        "vi": "Nhiệt độ bề mặt trái đất đang tăng lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the flat upper part of a piece of furniture, that is used for working on",
                    "vi": "phần trên bằng phẳng của đồ nội thất, được sử dụng để làm việc"
                },
                "examples": [
                    {
                        "en": "She's cleaned all the kitchen surfaces.",
                        "vi": "Cô ấy đã lau tất cả các bề mặt bếp."
                    },
                    {
                        "en": "You'll need a large smooth surface for rolling out the pastry.",
                        "vi": "Bạn sẽ cần một bề mặt nhẵn lớn để cán bánh ngọt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer appearance of a person, thing or situation; the qualities that you see or notice, that are not hidden",
                    "vi": "hình dáng bên ngoài của một người, một sự vật hoặc một tình huống; những phẩm chất mà bạn nhìn thấy hoặc nhận thấy, không bị che giấu"
                },
                "examples": [
                    {
                        "en": "below/beneath/under the surface (of something) Rage bubbled just below the surface of his mind.",
                        "vi": "bên dưới / bên dưới / bên dưới bề mặt (của cái gì đó) Cơn thịnh nộ bùng lên ngay dưới bề mặt tâm trí của anh ta."
                    },
                    {
                        "en": "She gives the impression of being rather conventional, but under the surface she is wildly eccentric.",
                        "vi": "Cô ấy tạo ấn tượng là người khá thông thường, nhưng bề ngoài cô ấy là một người cực kỳ lập dị."
                    }
                ]
            },
            {
                "define": {
                    "en": "when not thought about deeply or carefully and completely; when not looked at carefully",
                    "vi": "khi không được suy nghĩ về một cách sâu sắc hoặc cẩn thận và đầy đủ; khi không nhìn kỹ"
                },
                "examples": [
                    {
                        "en": "It seems like a good idea on the surface but there are sure to be problems.",
                        "vi": "Bề ngoài có vẻ là một ý kiến hay nhưng chắc chắn sẽ có vấn đề."
                    },
                    {
                        "en": "On the surface, he appeared unchanged.",
                        "vi": "Bề ngoài, anh ta tỏ ra không thay đổi."
                    },
                    {
                        "en": "On the surface his words were funny, but I detected a lot of anger behind them.",
                        "vi": "Bề ngoài những lời nói của anh ấy rất buồn cười, nhưng tôi phát hiện ra đằng sau đó là rất nhiều sự tức giận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with, understand, or find out about only a small part of a subject or problem",
                    "vi": "để giải quyết, hiểu hoặc chỉ tìm hiểu về một phần nhỏ của chủ đề hoặc vấn đề"
                },
                "examples": [
                    {
                        "en": "We left feeling that we had just scratched the surface of this fascinating country.",
                        "vi": "Chúng tôi để lại cảm giác rằng chúng tôi vừa mới chạm vào bề mặt của đất nước hấp dẫn này."
                    },
                    {
                        "en": "The investigation barely scratched the surface of the city's drug problem.",
                        "vi": "Cuộc điều tra hầu như không làm xước bề mặt của vấn đề ma túy của thành phố."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9491d27629a4e67b5a60f70485afeae",
        "word": "billboard",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɪlbɔːd/",
            "us": "/ˈbɪlbɔːrd/"
        },
        "nearby": [
            {
                "word": "billable",
                "pos": "adjective"
            },
            {
                "word": "billabong",
                "pos": "noun"
            },
            {
                "word": "billboard",
                "pos": "noun"
            },
            {
                "word": "Billboard",
                "pos": ""
            },
            {
                "word": "billet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board on the outside of a building or at the side of the road, used for putting advertisements on",
                    "vi": "một tấm bảng lớn ở bên ngoài của một tòa nhà hoặc ở bên đường, được sử dụng để dán quảng cáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f12cc764d1a24e3ab84d9d9bcb3621a3",
        "word": "crossing",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkrɒsɪŋ/",
            "us": "/ˈkrɔːsɪŋ/"
        },
        "nearby": [
            {
                "word": "cross head",
                "pos": "noun"
            },
            {
                "word": "cross-infection",
                "pos": "noun"
            },
            {
                "word": "crossing",
                "pos": "noun"
            },
            {
                "word": "cross-legged",
                "pos": "adjective"
            },
            {
                "word": "cross-legged",
                "pos": "adverb, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can safely cross a road, a river, etc., or from one country to another",
                    "vi": "một nơi mà bạn có thể băng qua một con đường, một con sông, v.v., hoặc từ quốc gia này sang quốc gia khác một cách an toàn"
                },
                "examples": [
                    {
                        "en": "The child was killed when a car failed to stop at the crossing.",
                        "vi": "Đứa trẻ đã thiệt mạng khi một chiếc ô tô không dừng lại ở nơi băng qua đường."
                    },
                    {
                        "en": "The next crossing point is a long way downstream.",
                        "vi": "Điểm vượt biển tiếp theo là một chặng đường dài về phía hạ lưu."
                    },
                    {
                        "en": "He was arrested by guards at the border crossing.",
                        "vi": "Anh ta bị lính canh bắt ở cửa khẩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a journey across a sea or a wide river",
                    "vi": "một cuộc hành trình qua biển hay sông rộng"
                },
                "examples": [
                    {
                        "en": "a three-hour ferry crossing",
                        "vi": "ba giờ qua phà"
                    },
                    {
                        "en": "a rough crossing from Dover to Calais",
                        "vi": "một giao lộ khó khăn từ Dover đến Calais"
                    },
                    {
                        "en": "the first Atlantic crossing",
                        "vi": "cuộc vượt Đại Tây Dương đầu tiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of going from one side to another",
                    "vi": "một hành động đi từ bên này sang bên khác"
                },
                "examples": [
                    {
                        "en": "attempted crossings of the border",
                        "vi": "cố gắng vượt qua biên giới"
                    }
                ]
            }
        ]
    },
    {
        "id": "fb45639fc1ac4d629e0044f6a1ccd00d",
        "word": "crossroads",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkrɒsrəʊdz/",
            "us": "/ˈkrɔːsrəʊdz/"
        },
        "nearby": [
            {
                "word": "cross reference",
                "pos": "noun"
            },
            {
                "word": "cross-reference",
                "pos": "verb"
            },
            {
                "word": "crossroads",
                "pos": "noun"
            },
            {
                "word": "cross section",
                "pos": "noun"
            },
            {
                "word": "cross-selling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where two roads meet and cross each other",
                    "vi": "nơi hai con đường gặp nhau và cắt ngang nhau"
                },
                "examples": [
                    {
                        "en": "At the next crossroads, turn right.",
                        "vi": "Tại ngã tư tiếp theo, rẽ phải."
                    },
                    {
                        "en": "Turn right at the next crossroads.",
                        "vi": "Rẽ phải tại ngã tư tiếp theo."
                    },
                    {
                        "en": "(figurative) He has reached a career crossroads (= he must decide which way to go next in his career).",
                        "vi": "(nghĩa bóng) Anh ấy đã đến ngã rẽ sự nghiệp (= anh ấy phải quyết định con đường tiếp theo trong sự nghiệp của mình)."
                    }
                ]
            },
            {
                "define": {
                    "en": "at an important point in somebody’s life or development",
                    "vi": "ở một thời điểm quan trọng trong cuộc đời hoặc sự phát triển của ai đó"
                },
                "examples": [
                    {
                        "en": "We are standing at an important crossroads in the history of Europe.",
                        "vi": "Chúng ta đang đứng ở ngã ba đường quan trọng trong lịch sử của Châu Âu."
                    },
                    {
                        "en": "I knew I was at the crossroads of my career.",
                        "vi": "Tôi biết mình đang ở ngã rẽ của sự nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d24e1e46f854db1b7958de5e83c4e0a",
        "word": "inside",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɪnˈsaɪd/",
            "us": "/ˌɪnˈsaɪd/"
        },
        "nearby": [
            {
                "word": "inside",
                "pos": "preposition"
            },
            {
                "word": "inside",
                "pos": "adverb"
            },
            {
                "word": "inside",
                "pos": "noun"
            },
            {
                "word": "inside",
                "pos": "adjective"
            },
            {
                "word": "inside joke",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the inner part, side or surface of something",
                    "vi": "phần bên trong, bên hoặc bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The inside of the box was blue.",
                        "vi": "Bên trong hộp có màu xanh lam."
                    },
                    {
                        "en": "the insides of the windows",
                        "vi": "bên trong cửa sổ"
                    },
                    {
                        "en": "The cake has a slight crust while the inside is soft and moist.",
                        "vi": "Bánh có lớp vỏ mỏng nhẹ trong khi bên trong mềm và ẩm."
                    },
                    {
                        "en": "PVC is used in dishwashers for lining the inside.",
                        "vi": "PVC được sử dụng trong máy rửa bát để lót bên trong."
                    },
                    {
                        "en": "from the inside The door was locked from the inside.",
                        "vi": "từ bên trong Cánh cửa đã bị khóa từ bên trong."
                    },
                    {
                        "en": "on the inside The shell is smooth on the inside.",
                        "vi": "ở bên trong Vỏ nhẵn ở bên trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a road nearest the edge, that is used by slower vehicles",
                    "vi": "phần của một con đường gần nhất, dành cho các phương tiện di chuyển chậm hơn"
                },
                "examples": [
                    {
                        "en": "on the inside He tried to overtake on the inside.",
                        "vi": "ở bên trong Anh ấy cố gắng vượt qua bên trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a curved road or track nearest to the middle or shortest side of the curve",
                    "vi": "phần của một con đường cong hoặc đoạn đường gần nhất với giữa hoặc bên ngắn nhất của đường cong"
                },
                "examples": [
                    {
                        "en": "on the inside The French runner is coming up fast on the inside.",
                        "vi": "ở bên trong Á hậu người Pháp đang tiến nhanh ở bên trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s stomach and bowels",
                    "vi": "dạ dày và ruột của một người"
                },
                "examples": [
                    {
                        "en": "She was so nervous, her insides were like jelly.",
                        "vi": "Cô lo lắng quá, bên trong cô như thạch."
                    },
                    {
                        "en": "He complained of a pain in his insides.",
                        "vi": "Anh ấy kêu đau bên trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the part that is usually inside facing out",
                    "vi": "với phần thường ở trong quay ra ngoài"
                },
                "examples": [
                    {
                        "en": "You've got your sweater on inside out.",
                        "vi": "Bạn đã mặc áo len từ trong ra ngoài."
                    },
                    {
                        "en": "Turn the bag inside out and let it dry.",
                        "vi": "Lật túi từ trong ra ngoài và để khô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very familiar with somebody/something",
                    "vi": "trở nên rất quen thuộc với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "This is where I grew up. I know this area like the back of my hand.",
                        "vi": "Đây là nơi tôi lớn lên. Tôi biết khu vực này như mu bàn tay của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a group or an organization and therefore able to get information that is not available to other people",
                    "vi": "thuộc về một nhóm hoặc một tổ chức và do đó có thể nhận được thông tin mà những người khác không có"
                },
                "examples": [
                    {
                        "en": "The thieves must have had someone on the inside helping them.",
                        "vi": "Bọn trộm chắc đã có người ở bên trong giúp chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a place very untidy when you are searching for something",
                    "vi": "để làm cho một nơi rất lộn xộn khi bạn đang tìm kiếm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The burglars had turned the house inside out.",
                        "vi": "Những tên trộm đã biến ngôi nhà từ trong ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause large changes",
                    "vi": "để gây ra những thay đổi lớn"
                },
                "examples": [
                    {
                        "en": "The new manager turned the old systems inside out.",
                        "vi": "Người quản lý mới đã lật tẩy các hệ thống cũ từ trong ra ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "48aebe4aeac24567a65df622a0468acc",
        "word": "parking lot",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpɑːkɪŋ lɒt/",
            "us": "/ˈpɑːrkɪŋ lɑːt/"
        },
        "nearby": [
            {
                "word": "parking brake",
                "pos": "noun"
            },
            {
                "word": "parking garage",
                "pos": "noun"
            },
            {
                "word": "parking lot",
                "pos": "noun"
            },
            {
                "word": "parking meter",
                "pos": "noun"
            },
            {
                "word": "parking ticket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area where people can leave their cars",
                    "vi": "một khu vực mà mọi người có thể để lại ô tô của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b9907b7756240cabe4c35bc9cb7244a",
        "word": "pavement",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpeɪvmənt/",
            "us": "/ˈpeɪvmənt/"
        },
        "nearby": [
            {
                "word": "pavane",
                "pos": "noun"
            },
            {
                "word": "pave",
                "pos": "verb"
            },
            {
                "word": "pavement",
                "pos": "noun"
            },
            {
                "word": "pavement artist",
                "pos": "noun"
            },
            {
                "word": "pavilion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat part at the side of a road for people to walk on",
                    "vi": "một phần bằng phẳng ở bên đường cho mọi người đi bộ"
                },
                "examples": [
                    {
                        "en": "a pavement cafe",
                        "vi": "một quán cà phê vỉa hè"
                    },
                    {
                        "en": "Don’t ride your bike on the pavement!",
                        "vi": "Đừng đạp xe trên vỉa hè!"
                    }
                ]
            },
            {
                "define": {
                    "en": "any area of flat stones on the ground",
                    "vi": "bất kỳ khu vực nào của đá phẳng trên mặt đất"
                },
                "examples": [
                    {
                        "en": "a mosaic pavement",
                        "vi": "một vỉa hè khảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the surface of a road",
                    "vi": "bề mặt của một con đường"
                },
                "examples": [
                    {
                        "en": "Two cars skidded on the icy pavement.",
                        "vi": "Hai chiếc xe trượt trên mặt đường băng giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large flat area of rock with nothing growing on it",
                    "vi": "một vùng đá bằng phẳng rộng lớn không có gì mọc trên đó"
                },
                "examples": [
                    {
                        "en": "a limestone pavement",
                        "vi": "vỉa hè lát đá vôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "c6a2092023dd402291a3d9bf3fc53242",
        "word": "rest stop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrest stɒp/",
            "us": "/ˈrest stɑːp/"
        },
        "nearby": [
            {
                "word": "restructure",
                "pos": "verb"
            },
            {
                "word": "restructuring",
                "pos": "noun"
            },
            {
                "word": "rest stop",
                "pos": "noun"
            },
            {
                "word": "rest upon",
                "pos": "phrasal verb"
            },
            {
                "word": "rest with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area next to an important road where people can stop their cars to rest, eat food, etc.",
                    "vi": "khu vực cạnh trục đường quan trọng, nơi mọi người có thể dừng xe nghỉ ngơi, ăn uống, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dacacc93373e46bb8ad616e8523c3c1b",
        "word": "sidewalk",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsaɪdwɔːk/",
            "us": "/ˈsaɪdwɔːk/"
        },
        "nearby": [
            {
                "word": "sidetrack",
                "pos": "verb"
            },
            {
                "word": "side view",
                "pos": "noun"
            },
            {
                "word": "sidewalk",
                "pos": "noun"
            },
            {
                "word": "sidewalk artist",
                "pos": "noun"
            },
            {
                "word": "sideward",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat part at the side of a road for people to walk on",
                    "vi": "một phần bằng phẳng ở bên đường cho mọi người đi bộ"
                },
                "examples": [
                    {
                        "en": "Elm trees lined the sidewalks.",
                        "vi": "Hàng cây duối lót vỉa hè."
                    }
                ]
            }
        ]
    },
    {
        "id": "60bd4945bcf6492aa7ec2ffb7d4f8519",
        "word": "truck stop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrʌk stɒp/",
            "us": "/ˈtrʌk stɑːp/"
        },
        "nearby": [
            {
                "word": "trucking",
                "pos": "noun"
            },
            {
                "word": "truckload",
                "pos": "noun"
            },
            {
                "word": "truck stop",
                "pos": "noun"
            },
            {
                "word": "truculence",
                "pos": "noun"
            },
            {
                "word": "truculent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place at the side of a main road where truck drivers can stop for a time and can rest, get something to eat, etc.",
                    "vi": "một nơi ở bên đường chính, nơi tài xế xe tải có thể dừng lại một lúc và có thể nghỉ ngơi, ăn gì đó, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b4fa7a333d2540dca3443ac1f493ffd9",
        "word": "tunnel",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtʌnl/",
            "us": "/ˈtʌnl/"
        },
        "nearby": [
            {
                "word": "Tunisia",
                "pos": "noun"
            },
            {
                "word": "Tunisian",
                "pos": "noun, adjective"
            },
            {
                "word": "tunnel",
                "pos": "noun"
            },
            {
                "word": "tunnel",
                "pos": "verb"
            },
            {
                "word": "tunnel vision",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage built underground, for example to allow a road or railway to go through a hill, under a river, etc.",
                    "vi": "một lối đi được xây dựng dưới lòng đất, ví dụ để cho phép đường bộ hoặc đường sắt đi qua đồi, dưới sông, v.v."
                },
                "examples": [
                    {
                        "en": "a railway/railroad tunnel",
                        "vi": "một đường hầm / đường sắt"
                    },
                    {
                        "en": "the Channel Tunnel",
                        "vi": "đường hầm kênh"
                    },
                    {
                        "en": "the tunnel entrance/walls/ceiling",
                        "vi": "lối vào / tường / trần đường hầm"
                    },
                    {
                        "en": "They have been digging underground tunnels in the mountains since the 1960s.",
                        "vi": "Họ đã đào các đường hầm dưới lòng đất trên núi từ những năm 1960."
                    },
                    {
                        "en": "A gust of wind passed through the tunnel.",
                        "vi": "Một cơn gió thoảng qua đường hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an underground passage made by an animal or natural processes",
                    "vi": "một lối đi ngầm do động vật hoặc các quá trình tự nhiên tạo ra"
                },
                "examples": [
                    {
                        "en": "The badger sett had twelve entrances to what must have been a labyrinth of tunnels.",
                        "vi": "Khu định cư lửng có mười hai lối vào nơi hẳn là một mê cung của các đường hầm."
                    },
                    {
                        "en": "The tunnel opened out into a large cavern.",
                        "vi": "Đường hầm mở ra một hang động lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that shows you are nearly at the end of a long and difficult time or situation",
                    "vi": "một cái gì đó cho thấy bạn gần kết thúc một thời gian hoặc tình huống dài và khó khăn"
                },
                "examples": [
                    {
                        "en": "For the first time since the start of his treatment, we can now see light at the end of the tunnel.",
                        "vi": "Lần đầu tiên kể từ khi anh ấy bắt đầu điều trị, bây giờ chúng ta có thể nhìn thấy ánh sáng ở cuối đường hầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb2236292fd541c18720eaf254e88714",
        "word": "wind",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/waɪnd/",
            "us": "/waɪnd/"
        },
        "nearby": [
            {
                "word": "wind1",
                "pos": "verb"
            },
            {
                "word": "wind2",
                "pos": "noun"
            },
            {
                "word": "wind2",
                "pos": "verb"
            },
            {
                "word": "windbag",
                "pos": "noun"
            },
            {
                "word": "wind-blown",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have many bends and twists",
                    "vi": "có nhiều khúc quanh và xoắn"
                },
                "examples": [
                    {
                        "en": "wind + adv./prep. The path wound down to the beach.",
                        "vi": "gió + adv./prep. Con đường dẫn xuống bãi biển."
                    },
                    {
                        "en": "A wooden staircase winds up to the attic.",
                        "vi": "Cầu thang gỗ uốn lượn lên gác xép."
                    },
                    {
                        "en": "The king's funeral procession wound slowly through city.",
                        "vi": "Đám tang của nhà vua bị thương chậm rãi qua thành phố."
                    },
                    {
                        "en": "wind its way + adv./prep. The river winds its way between two meadows.",
                        "vi": "gió theo cách của nó + adv./prep. Dòng sông uốn lượn giữa hai đồng cỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wrap or twist something around itself or something else",
                    "vi": "quấn hoặc vặn một cái gì đó xung quanh chính nó hoặc một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "He wound the wool into a ball.",
                        "vi": "Anh quấn sợi len thành một quả bóng."
                    },
                    {
                        "en": "Wind the bandage around your finger.",
                        "vi": "Quấn băng quanh ngón tay của bạn."
                    },
                    {
                        "en": "He wound the bandage tightly around his ankle.",
                        "vi": "Anh quấn băng thật chặt quanh mắt cá chân."
                    },
                    {
                        "en": "They wind individual strands of fibre together to make home-made rope.",
                        "vi": "Họ cuộn các sợi sợi riêng lẻ lại với nhau để làm dây thừng tự chế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate a tape, film, etc. so that it moves nearer to its ending or starting position",
                    "vi": "vận hành băng, phim, v.v. để nó di chuyển gần vị trí kết thúc hoặc bắt đầu hơn"
                },
                "examples": [
                    {
                        "en": "wind something forward/back He wound the tape back to the beginning.",
                        "vi": "gió cái gì đó về phía trước / phía sau Anh ta quấn cuộn băng lại từ đầu."
                    },
                    {
                        "en": "wind forward/back Wind forward to the bit where they discover the body.",
                        "vi": "gió tiến / lùi Gió về phía trước đến đoạn mà họ phát hiện ra cơ thể."
                    },
                    {
                        "en": "wind something (on) With these cameras, after you click the shutter, you have to wind the film on.",
                        "vi": "gió gì đó (bật) Với những máy ảnh này, sau khi bạn nhấp vào màn trập, bạn phải cuộn phim lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a clock or a machine work by turning a knob, handle, etc. several times; to be able to be made to work in this way",
                    "vi": "để làm cho một chiếc đồng hồ hoặc một cỗ máy hoạt động bằng cách xoay một núm, tay cầm, v.v. nhiều lần; để có thể làm việc theo cách này"
                },
                "examples": [
                    {
                        "en": "wind something (up) He had forgotten to wind his watch.",
                        "vi": "gió cái gì đó (up) Anh ấy đã quên lên dây cót đồng hồ của mình."
                    },
                    {
                        "en": "wind up It was one of those old-fashioned gramophones that winds up.",
                        "vi": "Nó là một trong những chiếc máy hát cổ điển có khả năng lên dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn a handle several times",
                    "vi": "xoay một tay cầm nhiều lần"
                },
                "examples": [
                    {
                        "en": "You operate the trapdoor by winding this handle.",
                        "vi": "Bạn vận hành cửa sập bằng cách quấn tay cầm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade somebody to do anything that you want",
                    "vi": "thuyết phục ai đó làm bất cứ điều gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "She has always been able to wind her parents around her little finger.",
                        "vi": "Cô ấy luôn có thể quấn quýt bố mẹ mình bằng ngón tay út của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "47147fc23c2746b6a2f2e55fe9c48534",
        "word": "bank",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bæŋk/",
            "us": "/bæŋk/"
        },
        "nearby": [
            {
                "word": "banister",
                "pos": "noun"
            },
            {
                "word": "banjo",
                "pos": "noun"
            },
            {
                "word": "bank",
                "pos": "noun"
            },
            {
                "word": "bank",
                "pos": "verb"
            },
            {
                "word": "bankable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization that provides various financial services, for example keeping or lending money",
                    "vi": "một tổ chức cung cấp các dịch vụ tài chính khác nhau, ví dụ như giữ hoặc cho vay tiền"
                },
                "examples": [
                    {
                        "en": "I don't have much money in the bank at the end of the month.",
                        "vi": "Tôi không có nhiều tiền trong ngân hàng vào cuối tháng."
                    },
                    {
                        "en": "I need to go to the bank (= the local office of a bank).",
                        "vi": "Tôi cần đến ngân hàng (= văn phòng ngân hàng địa phương)."
                    },
                    {
                        "en": "We are now in competition with the big foreign banks.",
                        "vi": "Hiện chúng tôi đang phải cạnh tranh với các ngân hàng lớn của nước ngoài."
                    },
                    {
                        "en": "Major banks are increasing the amount they lend to small companies.",
                        "vi": "Các ngân hàng lớn đang tăng số tiền họ cho các công ty nhỏ vay."
                    },
                    {
                        "en": "He got a large loan from the bank.",
                        "vi": "Anh ta nhận được một khoản vay lớn từ ngân hàng."
                    },
                    {
                        "en": "She got a bank loan to finance the purchase.",
                        "vi": "Cô ấy có một khoản vay ngân hàng để tài trợ cho việc mua hàng."
                    },
                    {
                        "en": "I had a meeting with the bank manager.",
                        "vi": "Tôi đã có một cuộc họp với giám đốc ngân hàng."
                    },
                    {
                        "en": "He was shot as he tried to foil a bank robbery.",
                        "vi": "Anh ta đã bị bắn khi cố gắng thực hiện một vụ cướp ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a supply of money or things that are used as money in some games, especially those in which gambling is involved",
                    "vi": "cung cấp tiền hoặc những thứ được sử dụng làm tiền trong một số trò chơi, đặc biệt là những trò chơi có liên quan đến cờ bạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an amount of something that is collected; a place where something is stored ready for use",
                    "vi": "một số lượng của một cái gì đó được thu thập; một nơi mà một cái gì đó được lưu trữ sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "a bank of knowledge",
                        "vi": "một ngân hàng kiến thức"
                    },
                    {
                        "en": "a blood/sperm bank",
                        "vi": "ngân hàng máu / tinh trùng"
                    },
                    {
                        "en": "They intend to establish a bank of information which will be accessible to the public.",
                        "vi": "Họ có ý định thiết lập một ngân hàng thông tin mà công chúng có thể tiếp cận được."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or container where something may be placed for recycling",
                    "vi": "một địa điểm hoặc thùng chứa nơi có thể đặt thứ gì đó để tái chế"
                },
                "examples": [
                    {
                        "en": "Take old clothes and shoes to the local recycling bank.",
                        "vi": "Mang quần áo và giày cũ đến ngân hàng tái chế địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a river, canal, etc. and the land near it",
                    "vi": "cạnh sông, kênh, v.v. và vùng đất gần đó"
                },
                "examples": [
                    {
                        "en": "We strolled along the river bank.",
                        "vi": "Chúng tôi đi dạo dọc theo bờ sông."
                    },
                    {
                        "en": "He jumped in and swam to the opposite bank.",
                        "vi": "Anh ta nhảy vào và bơi sang bờ đối diện."
                    },
                    {
                        "en": "on the bank/banks of something a house on the banks of the River Severn (= on land near the river)",
                        "vi": "trên bờ / bờ của cái gì đó một ngôi nhà trên bờ sông Severn (= trên đất gần sông)"
                    },
                    {
                        "en": "It's on the north bank of the Thames.",
                        "vi": "Nó ở bờ bắc của sông Thames."
                    },
                    {
                        "en": "The river burst its banks after heavy rain.",
                        "vi": "Dòng sông vỡ bờ sau trận mưa lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a raised area of ground that slopes at the sides, often at the edge of something or dividing something",
                    "vi": "một vùng đất nổi lên dốc ở hai bên, thường là ở rìa của một cái gì đó hoặc phân chia một cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were low banks of earth between the rice fields.",
                        "vi": "Có những bờ đất thấp giữa cánh đồng lúa."
                    },
                    {
                        "en": "The girls ran down the steep grassy bank.",
                        "vi": "Các cô gái chạy xuống bờ cỏ dốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial slope built at the side of a road, so that cars can drive fast around bends",
                    "vi": "một con dốc nhân tạo được xây dựng ở bên đường để ô tô có thể lái nhanh quanh các khúc cua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a mass of cloud, snow, etc., especially one formed by the wind",
                    "vi": "một khối lượng mây, tuyết, v.v., đặc biệt là một khối do gió tạo thành"
                },
                "examples": [
                    {
                        "en": "The sun disappeared behind a bank of clouds.",
                        "vi": "Mặt trời khuất sau một bờ mây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row or series of similar objects, especially machines",
                    "vi": "một hàng hoặc một loạt các đối tượng tương tự, đặc biệt là máy móc"
                },
                "examples": [
                    {
                        "en": "a bank of lights/computers",
                        "vi": "một ngân hàng đèn / máy tính"
                    },
                    {
                        "en": "She was faced with a huge bank of switches and buttons.",
                        "vi": "Cô phải đối mặt với một đống công tắc và nút bấm."
                    },
                    {
                        "en": "She was working a phone bank for the Democrats.",
                        "vi": "Cô ấy đang làm việc tại một ngân hàng điện thoại cho đảng Dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "financial support from your parents, especially when you are an adult",
                    "vi": "hỗ trợ tài chính từ cha mẹ của bạn, đặc biệt là khi bạn đã trưởng thành"
                },
                "examples": [
                    {
                        "en": "Without support from the Bank of Mum and Dad, they could find themselves locked out of the housing market.",
                        "vi": "Nếu không có sự hỗ trợ từ Ngân hàng của Mẹ và Cha, họ có thể thấy mình bị khóa ngoài thị trường nhà ở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a lot of money easily and feel very pleased about it",
                    "vi": "để kiếm được nhiều tiền một cách dễ dàng và cảm thấy rất hài lòng về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something won’t break the bank, you mean that it won’t cost a lot of money, or more than you can afford",
                    "vi": "nếu bạn nói điều gì đó sẽ không phá vỡ ngân hàng, bạn có nghĩa là nó sẽ không tốn nhiều tiền hoặc nhiều hơn khả năng chi trả của bạn"
                },
                "examples": [
                    {
                        "en": "We can just get a sandwich if you want—that won’t break the bank.",
                        "vi": "Chúng tôi chỉ có thể lấy một chiếc bánh sandwich nếu bạn muốn — điều đó sẽ không phá vỡ ngân hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "23e44904c33b47f7873f01703baa5cee",
        "word": "ditch",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪtʃ/",
            "us": "/dɪtʃ/"
        },
        "nearby": [
            {
                "word": "disuse",
                "pos": "noun"
            },
            {
                "word": "disused",
                "pos": "adjective"
            },
            {
                "word": "ditch",
                "pos": "noun"
            },
            {
                "word": "ditch",
                "pos": "verb"
            },
            {
                "word": "ditchwater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long channel dug at the side of a field or road, to hold or take away water",
                    "vi": "một con kênh dài được đào bên cạnh cánh đồng hoặc con đường, để giữ hoặc lấy đi nước"
                },
                "examples": [
                    {
                        "en": "The car left the road and ended up in a ditch.",
                        "vi": "Chiếc xe rời khỏi con đường và kết thúc trong một con mương."
                    }
                ]
            }
        ]
    },
    {
        "id": "a673e8fca19f47bea208093576fd6ccb",
        "word": "fork",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɔːk/",
            "us": "/fɔːrk/"
        },
        "nearby": [
            {
                "word": "forgotten",
                "pos": "verb"
            },
            {
                "word": "For He's a Jolly Good Fellow",
                "pos": ""
            },
            {
                "word": "fork",
                "pos": "noun"
            },
            {
                "word": "fork",
                "pos": "verb"
            },
            {
                "word": "forkball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool with a handle and three or four sharp points (called prongs), used for picking up and eating food",
                    "vi": "một công cụ có tay cầm và ba hoặc bốn đầu nhọn (gọi là ngạnh), dùng để gắp và ăn thức ăn"
                },
                "examples": [
                    {
                        "en": "to eat with a knife and fork",
                        "vi": "ăn bằng dao và nĩa"
                    },
                    {
                        "en": "with a fork Mash the mixture with a fork.",
                        "vi": "bằng nĩa Nghiền hỗn hợp bằng nĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a garden tool with a long or short handle and three or four sharp metal points, used for digging",
                    "vi": "một dụng cụ làm vườn có tay cầm dài hoặc ngắn và ba hoặc bốn đầu nhọn bằng kim loại, dùng để đào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place where a road, river, etc. divides into two parts; either of these two parts",
                    "vi": "một nơi mà một con đường, một con sông, vv chia thành hai phần; một trong hai phần này"
                },
                "examples": [
                    {
                        "en": "Take the right fork.",
                        "vi": "Đi đúng ngã ba."
                    },
                    {
                        "en": "Shortly before dusk they reached a fork and took the left-hand track.",
                        "vi": "Không lâu trước khi chạng vạng, họ đến một ngã ba và rẽ trái."
                    },
                    {
                        "en": "fork in something Bear left at the fork in the road.",
                        "vi": "Ngã ba cái gì Gấu bỏ lại ở ngã ba đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a fork in shape, with two or more long parts",
                    "vi": "một thứ giống như một cái nĩa, có hai hoặc nhiều phần dài"
                },
                "examples": [
                    {
                        "en": "a jagged fork of lightning",
                        "vi": "một ngã ba răng cưa của tia sét"
                    },
                    {
                        "en": "a monkey sitting in the fork of the tree",
                        "vi": "con khỉ ngồi ở ngã ba cây"
                    }
                ]
            },
            {
                "define": {
                    "en": "either of two metal supporting pieces into which a wheel on a bicycle or motorcycle is fitted",
                    "vi": "một trong hai miếng đỡ bằng kim loại để lắp bánh xe đạp hoặc xe máy vào đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "420250f8300a4d9fa9c8fbd2681ac9d9",
        "word": "fork",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/fɔːk/",
            "us": "/fɔːrk/"
        },
        "nearby": [
            {
                "word": "For He's a Jolly Good Fellow",
                "pos": ""
            },
            {
                "word": "fork",
                "pos": "noun"
            },
            {
                "word": "fork",
                "pos": "verb"
            },
            {
                "word": "forkball",
                "pos": "noun"
            },
            {
                "word": "forked",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to divide into two parts that lead in different directions",
                    "vi": "để chia thành hai phần dẫn theo các hướng khác nhau"
                },
                "examples": [
                    {
                        "en": "The path forks at the bottom of the hill.",
                        "vi": "Con đường ngã ba dưới chân đồi."
                    },
                    {
                        "en": "The road forks right after the bridge.",
                        "vi": "Con đường ngã ba ngay sau cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn left or right where a road, etc. divides into two",
                    "vi": "để rẽ trái hoặc phải nơi một con đường, v.v. chia làm hai"
                },
                "examples": [
                    {
                        "en": "Fork right after the bridge.",
                        "vi": "Ngã ba ngay sau cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, carry or dig something using a fork",
                    "vi": "để di chuyển, mang hoặc đào thứ gì đó bằng một cái nĩa"
                },
                "examples": [
                    {
                        "en": "Clear the soil of weeds and fork in plenty of compost.",
                        "vi": "Dọn sạch đất cỏ dại và đổ nhiều phân trộn vào."
                    },
                    {
                        "en": "He forked a piece of meat into his mouth.",
                        "vi": "Anh ta đưa một miếng thịt vào miệng."
                    },
                    {
                        "en": "Fork over the ground before planting.",
                        "vi": "Nắn trên mặt đất trước khi trồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f08385f9b29b43d88f42cef3216b7a47",
        "word": "gradient",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡreɪdiənt/",
            "us": "/ˈɡreɪdiənt/"
        },
        "nearby": [
            {
                "word": "grader",
                "pos": "noun"
            },
            {
                "word": "grade school",
                "pos": "noun"
            },
            {
                "word": "gradient",
                "pos": "noun"
            },
            {
                "word": "grading",
                "pos": "noun"
            },
            {
                "word": "gradiometer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a slope on a road or railway; the degree to which the ground slopes",
                    "vi": "dốc trên đường bộ hoặc đường sắt; độ dốc của mặt đất"
                },
                "examples": [
                    {
                        "en": "The route includes some steep gradients.",
                        "vi": "Tuyến đường bao gồm một số dốc."
                    },
                    {
                        "en": "a hill with a gradient of 1 in 4 (or 25 per cent)",
                        "vi": "một ngọn đồi có độ dốc 1 trong 4 (hoặc 25%)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the rate at which temperature, pressure, etc. changes, or increases and decreases, between one region and another",
                    "vi": "tốc độ thay đổi nhiệt độ, áp suất, v.v., hoặc tăng và giảm giữa vùng này với vùng khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea4ddbfceda84bd889961bc0a4876444",
        "word": "hitchhiking",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɪtʃhaɪkɪŋ/",
            "us": "/ˈhɪtʃhaɪkɪŋ/"
        },
        "nearby": [
            {
                "word": "hitchhiker",
                "pos": "noun"
            },
            {
                "word": "The Hitchhiker's Guide to the Galaxy",
                "pos": ""
            },
            {
                "word": "hitchhiking",
                "pos": "noun"
            },
            {
                "word": "hi-tech",
                "pos": "adjective"
            },
            {
                "word": "hit for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of travelling by asking for free rides in other people’s cars, by standing at the side of the road and trying to get passing cars to stop",
                    "vi": "một cách đi du lịch bằng cách yêu cầu được đi miễn phí trên xe của người khác, bằng cách đứng ở bên đường và cố gắng cho xe ô tô đi qua để dừng lại"
                },
                "examples": [
                    {
                        "en": "Hitchhiking is a cheap way of travelling, but it can be risky.",
                        "vi": "Đi nhờ xe là một cách du lịch rẻ nhưng có thể gặp nhiều rủi ro."
                    }
                ]
            }
        ]
    },
    {
        "id": "0654162ea8574408b508479fb33fd014",
        "word": "junction",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒʌŋkʃn/",
            "us": "/ˈdʒʌŋkʃn/"
        },
        "nearby": [
            {
                "word": "jumpsuit",
                "pos": "noun"
            },
            {
                "word": "jumpy",
                "pos": "adjective"
            },
            {
                "word": "junction",
                "pos": "noun"
            },
            {
                "word": "juncture",
                "pos": "noun"
            },
            {
                "word": "June",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where two or more roads or railway lines meet",
                    "vi": "nơi mà hai hoặc nhiều đường bộ hoặc đường sắt gặp nhau"
                },
                "examples": [
                    {
                        "en": "It was near the junction of City Road and Old Street.",
                        "vi": "Nó ở gần ngã ba của Đường Thành phố và Phố Cổ."
                    },
                    {
                        "en": "Come off the motorway at junction 6.",
                        "vi": "Đi ra khỏi đường cao tốc tại giao lộ 6."
                    },
                    {
                        "en": "The most complicated motorway interchange in Britain is known as Spaghetti Junction.",
                        "vi": "Nút giao thông đường cao tốc phức tạp nhất ở Anh được gọi là Spaghetti Junction."
                    },
                    {
                        "en": "In the 19th century the town became an important railway junction.",
                        "vi": "Vào thế kỷ 19, thị trấn trở thành một ngã ba đường sắt quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two or more cables, rivers or other things meet or are joined",
                    "vi": "một nơi mà hai hoặc nhiều cáp, sông hoặc những thứ khác gặp nhau hoặc được nối với nhau"
                },
                "examples": [
                    {
                        "en": "a telephone junction box",
                        "vi": "hộp nối điện thoại"
                    },
                    {
                        "en": "the junction between nerves and muscles",
                        "vi": "điểm nối giữa dây thần kinh và cơ"
                    }
                ]
            }
        ]
    },
    {
        "id": "6615575856a04e1aa17aff1a16de767a",
        "word": "lamp post",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlæmp pəʊst/",
            "us": "/ˈlæmp pəʊst/"
        },
        "nearby": [
            {
                "word": "lampoon",
                "pos": "verb"
            },
            {
                "word": "lampoon",
                "pos": "noun"
            },
            {
                "word": "lamp post",
                "pos": "noun"
            },
            {
                "word": "lamprey",
                "pos": "noun"
            },
            {
                "word": "lampshade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall post in the street with a lamp at the top",
                    "vi": "trên đường phố có một cột đèn cao"
                },
                "examples": [
                    {
                        "en": "The car skidded and hit a lamp post.",
                        "vi": "Chiếc xe trượt bánh và tông vào một trụ đèn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d57b7faf75cf40ef8bf1b8700c8d22d0",
        "word": "roadside",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrəʊdsaɪd/",
            "us": "/ˈrəʊdsaɪd/"
        },
        "nearby": [
            {
                "word": "road sense",
                "pos": "noun"
            },
            {
                "word": "roadshow",
                "pos": "noun"
            },
            {
                "word": "roadside",
                "pos": "noun"
            },
            {
                "word": "road sign",
                "pos": "noun"
            },
            {
                "word": "roadster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the edge of the road",
                    "vi": "mép đường"
                },
                "examples": [
                    {
                        "en": "a roadside cafe",
                        "vi": "một quán cà phê ven đường"
                    },
                    {
                        "en": "by the roadside She sat down by the roadside.",
                        "vi": "bên vệ đường Cô ngồi xuống bên vệ đường."
                    },
                    {
                        "en": "Children were selling cold drinks by the roadside.",
                        "vi": "Những đứa trẻ đang bán đồ uống lạnh ven đường."
                    },
                    {
                        "en": "along the roadside There were fruit stalls along the roadside.",
                        "vi": "ven đường Có những quầy bán trái cây ven đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "fc402f9f204b4e6bb1a3dcf91192ce31",
        "word": "service station",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɜːvɪs steɪʃn/",
            "us": "/ˈsɜːrvɪs steɪʃn/"
        },
        "nearby": [
            {
                "word": "service provider",
                "pos": "noun"
            },
            {
                "word": "service road",
                "pos": "noun"
            },
            {
                "word": "service station",
                "pos": "noun"
            },
            {
                "word": "servicewoman",
                "pos": "noun"
            },
            {
                "word": "servicing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place at the side of a road where you take your car to buy petrol, oil, etc.",
                    "vi": "nơi bạn dắt xe vào mua xăng, dầu, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an area and building next to a motorway where you can buy food and petrol, go to the toilet, etc.",
                    "vi": "một khu vực và tòa nhà bên cạnh đường cao tốc, nơi bạn có thể mua thức ăn và xăng, đi vệ sinh, v.v."
                },
                "examples": [
                    {
                        "en": "We stopped for a break at a motorway service station.",
                        "vi": "Chúng tôi dừng lại để nghỉ giải lao tại một trạm dịch vụ đường cao tốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "89f1fe1bf7c74be6bb4d7fd1b5c351a9",
        "word": "subway",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsʌbweɪ/",
            "us": "/ˈsʌbweɪ/"
        },
        "nearby": [
            {
                "word": "subversiveness",
                "pos": "noun"
            },
            {
                "word": "subvert",
                "pos": "verb"
            },
            {
                "word": "subway",
                "pos": "noun"
            },
            {
                "word": "subwoofer",
                "pos": "noun"
            },
            {
                "word": "sub-zero",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an underground railway system in a city",
                    "vi": "một hệ thống đường sắt ngầm trong thành phố"
                },
                "examples": [
                    {
                        "en": "the New York subway",
                        "vi": "tàu điện ngầm New York"
                    },
                    {
                        "en": "a subway station/train",
                        "vi": "ga tàu điện ngầm / xe lửa"
                    },
                    {
                        "en": "a downtown subway stop",
                        "vi": "một trạm dừng tàu điện ngầm ở trung tâm thành phố"
                    },
                    {
                        "en": "to ride/take the subway",
                        "vi": "đi xe / đi tàu điện ngầm"
                    },
                    {
                        "en": "In Boston the subway is known as the ‘T’; in Washington DC it’s the‘Metro’.",
                        "vi": "Ở Boston, tàu điện ngầm được gọi là 'T'; ở Washington DC đó là 'Metro'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a path that goes under a road, etc. which people can use to cross to the other side",
                    "vi": "một lối đi dưới một con đường, v.v. mà mọi người có thể sử dụng để băng qua phía bên kia"
                },
                "examples": [
                    {
                        "en": "He ran through the pedestrian subway.",
                        "vi": "Anh ta chạy qua tàu điện ngầm dành cho người đi bộ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cfaad3416ef147428df18a392689d546",
        "word": "turn-off",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɜːn ɒf/",
            "us": "/ˈtɜːrn ɔːf/"
        },
        "nearby": [
            {
                "word": "turnkey",
                "pos": "adjective"
            },
            {
                "word": "turn off",
                "pos": "phrasal verb"
            },
            {
                "word": "turn-off",
                "pos": "noun"
            },
            {
                "word": "turn on",
                "pos": "phrasal verb"
            },
            {
                "word": "turn-on",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where a road leads away from another larger or more important road",
                    "vi": "nơi mà một con đường dẫn đến một con đường khác lớn hơn hoặc quan trọng hơn"
                },
                "examples": [
                    {
                        "en": "We missed the turn-off for the airport.",
                        "vi": "Chúng tôi đã bỏ lỡ lượt đi đến sân bay."
                    },
                    {
                        "en": "We were chatting and overshot our turn-off.",
                        "vi": "Chúng tôi đã trò chuyện và xem xét quá trình tắt của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that people find boring or not attractive",
                    "vi": "một người hoặc một thứ mà mọi người thấy nhàm chán hoặc không hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The city's crime rate is a serious turn-off to potential investors.",
                        "vi": "Tỷ lệ tội phạm của thành phố là một yếu tố gây khó khăn cho các nhà đầu tư tiềm năng."
                    },
                    {
                        "en": "I find beards a real turn-off.",
                        "vi": "Tôi thấy râu là một điều thực sự tắt."
                    }
                ]
            }
        ]
    },
    {
        "id": "e1d60dcb47294115a4d8cb39eb216fac",
        "word": "twist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/twɪst/",
            "us": "/twɪst/"
        },
        "nearby": [
            {
                "word": "twirl",
                "pos": "noun"
            },
            {
                "word": "twist",
                "pos": "verb"
            },
            {
                "word": "twist",
                "pos": "noun"
            },
            {
                "word": "twisted",
                "pos": "adjective"
            },
            {
                "word": "twister",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of turning something with your hand, or of turning a part of your body",
                    "vi": "hành động xoay vật gì đó bằng tay hoặc xoay một phần cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "She gave the lid another twist and it came off.",
                        "vi": "Cô ấy vặn nắp một lần nữa và nó bật ra."
                    },
                    {
                        "en": "He gave a shy smile and a little twist of his head.",
                        "vi": "Anh ta nở một nụ cười bẽn lẽn và hơi quay đầu lại."
                    },
                    {
                        "en": "He finished him off with a quick twist of the knife.",
                        "vi": "Anh ta kết liễu anh ta bằng một cú xoay con dao nhanh chóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unexpected change or development in a story or situation",
                    "vi": "một sự thay đổi hoặc phát triển bất ngờ trong một câu chuyện hoặc tình huống"
                },
                "examples": [
                    {
                        "en": "the twists and turns of his political career",
                        "vi": "những khúc quanh trong sự nghiệp chính trị của anh ấy"
                    },
                    {
                        "en": "The story has taken another twist.",
                        "vi": "Câu chuyện đã có một bước ngoặt khác."
                    },
                    {
                        "en": "The disappearance of a vital witness added a new twist to the case.",
                        "vi": "Sự biến mất của một nhân chứng quan trọng đã thêm một bước ngoặt mới cho vụ án."
                    },
                    {
                        "en": "By a curious twist of fate we met again only a week or so later.",
                        "vi": "Bởi một sự xoay chuyển kỳ lạ của số phận, chúng tôi đã gặp lại nhau chỉ sau đó một tuần hoặc lâu hơn."
                    },
                    {
                        "en": "a bizarre twist to the tale",
                        "vi": "một bước ngoặt kỳ lạ đối với câu chuyện"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road or river",
                    "vi": "khúc cua gấp trên đường hoặc sông"
                },
                "examples": [
                    {
                        "en": "The car followed the twists and turns of the mountain road.",
                        "vi": "Chiếc xe chạy theo những khúc quanh ngoằn ngoèo của con đường núi."
                    },
                    {
                        "en": "They approached a twist in the path.",
                        "vi": "Họ đến gần một khúc quanh trên con đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that has been twisted into a particular shape",
                    "vi": "một thứ đã được xoắn lại thành một hình dạng cụ thể"
                },
                "examples": [
                    {
                        "en": "mineral water with a twist of lemon",
                        "vi": "nước khoáng chanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a fast dance that was popular in the 1960s, in which you twist from side to side",
                    "vi": "một điệu nhảy nhanh phổ biến vào những năm 1960, trong đó bạn xoay người từ bên này sang bên kia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become angry, confused or upset",
                    "vi": "trở nên tức giận, bối rối hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": [
                    {
                        "en": "She's gone completely round the twist.",
                        "vi": "Cô ấy đã hoàn toàn đi đúng hướng."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb6e7c31361749afa6447ea1890dec66",
        "word": "asphalt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæsfælt/",
            "us": "/ˈæsfɔːlt/"
        },
        "nearby": [
            {
                "word": "asperity",
                "pos": "noun"
            },
            {
                "word": "aspersions",
                "pos": "noun"
            },
            {
                "word": "asphalt",
                "pos": "noun"
            },
            {
                "word": "asphyxia",
                "pos": "noun"
            },
            {
                "word": "asphyxiate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick black sticky substance used especially for making the surface of roads",
                    "vi": "một chất dính đen đặc được sử dụng đặc biệt để làm bề mặt đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e12c4429ec83484681507167779e9bfb",
        "word": "blacktop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblæktɒp/",
            "us": "/ˈblæktɑːp/"
        },
        "nearby": [
            {
                "word": "black tie",
                "pos": "adjective"
            },
            {
                "word": "black tie",
                "pos": "noun"
            },
            {
                "word": "blacktop",
                "pos": "noun"
            },
            {
                "word": "Black Tuesday",
                "pos": ""
            },
            {
                "word": "black velvet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a black material used for making road surfaces, that consists of small stones mixed with tar",
                    "vi": "một vật liệu màu đen được sử dụng để làm mặt đường, bao gồm đá nhỏ trộn với nhựa đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f7d8ce7f281947c0bc614f13b425e71b",
        "word": "branch off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "branch",
                "pos": "verb"
            },
            {
                "word": "Branch Davidians",
                "pos": ""
            },
            {
                "word": "branch off",
                "pos": "phrasal verb"
            },
            {
                "word": "branch out",
                "pos": "phrasal verb"
            },
            {
                "word": "brand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be joined to another road or river but lead in a different direction",
                    "vi": "được tham gia vào một con đường hoặc con sông khác nhưng dẫn theo một hướng khác"
                },
                "examples": [
                    {
                        "en": "Just after the lake, the path branches off to the right.",
                        "vi": "Ngay sau hồ nước, con đường rẽ nhánh bên phải."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a road or path and travel in a different direction",
                    "vi": "rời khỏi một con đường hoặc lối đi và đi theo một hướng khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23b7946db1f544d1992cea2ce49c4470",
        "word": "camber",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæmbə(r)/",
            "us": "/ˈkæmbər/"
        },
        "nearby": [
            {
                "word": "CAM",
                "pos": "abbreviation"
            },
            {
                "word": "camaraderie",
                "pos": "noun"
            },
            {
                "word": "camber",
                "pos": "noun"
            },
            {
                "word": "cambium",
                "pos": "noun"
            },
            {
                "word": "Cambodia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a slight curve that goes downwards from the middle of a road to each side",
                    "vi": "một đường cong nhẹ đi xuống từ giữa đường sang mỗi bên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2db0e158f3f54400a63a43338ed10d51",
        "word": "car pool",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑː puːl/",
            "us": "/ˈkɑːr puːl/"
        },
        "nearby": [
            {
                "word": "carpet sweeper",
                "pos": "noun"
            },
            {
                "word": "car phone",
                "pos": "noun"
            },
            {
                "word": "car pool",
                "pos": "noun"
            },
            {
                "word": "carpool",
                "pos": "noun"
            },
            {
                "word": "carpool",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of cars owned by a company or an organization, that its staff can use",
                    "vi": "một nhóm ô tô thuộc sở hữu của một công ty hoặc một tổ chức mà nhân viên của họ có thể sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "766b47a14f354f158d62225df93a8f6c",
        "word": "cattle grid",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkætl ɡrɪd/",
            "us": "/ˈkætl ɡrɪd/"
        },
        "nearby": [
            {
                "word": "cattle class",
                "pos": "noun"
            },
            {
                "word": "cattle duffing",
                "pos": "noun"
            },
            {
                "word": "cattle grid",
                "pos": "noun"
            },
            {
                "word": "cattleman",
                "pos": "noun"
            },
            {
                "word": "catty",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "metal bars that are placed over a hole that has been made in the road. Cars can pass over the metal bars but animals such as sheep and cows cannot.",
                    "vi": "thanh kim loại được đặt trên một lỗ đã được tạo trên đường. Ô tô có thể vượt qua các thanh kim loại nhưng động vật như cừu và bò thì không thể."
                },
                "examples": [
                    {
                        "en": "There was a cattle grid across the road to stop the cows from escaping.",
                        "vi": "Có một tấm lưới gia súc chắn ngang đường để ngăn lũ bò trốn thoát."
                    }
                ]
            }
        ]
    },
    {
        "id": "5400843f47e84106bbcbddf60f6ff61c",
        "word": "crosswalk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒswɔːk/",
            "us": "/ˈkrɔːswɔːk/"
        },
        "nearby": [
            {
                "word": "cross trainer",
                "pos": "noun"
            },
            {
                "word": "cross-training",
                "pos": "noun"
            },
            {
                "word": "crosswalk",
                "pos": "noun"
            },
            {
                "word": "crosswind",
                "pos": "noun"
            },
            {
                "word": "crosswise",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a road where vehicles must stop to allow people to cross",
                    "vi": "phần đường xe cộ phải dừng lại để cho người qua đường."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "76498d087b704acda2ef19d5a10a5240",
        "word": "curb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɜːb/",
            "us": "/kɜːrb/"
        },
        "nearby": [
            {
                "word": "curator",
                "pos": "noun"
            },
            {
                "word": "curb",
                "pos": "verb"
            },
            {
                "word": "curb",
                "pos": "noun"
            },
            {
                "word": "curbside",
                "pos": "noun"
            },
            {
                "word": "curbstone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that controls and puts limits on something",
                    "vi": "cái gì đó kiểm soát và đặt giới hạn cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "curbs on government spending",
                        "vi": "hạn chế chi tiêu của chính phủ"
                    },
                    {
                        "en": "Many companies have imposed curbs on smoking in the workplace.",
                        "vi": "Nhiều công ty đã áp dụng các quy định hạn chế hút thuốc tại nơi làm việc."
                    },
                    {
                        "en": "We are in favour of strict curbs on government spending.",
                        "vi": "Chúng tôi ủng hộ việc hạn chế chặt chẽ chi tiêu của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the edge of the raised path at the side of a road, usually made of long pieces of stone",
                    "vi": "mép của lối đi nhô cao ở bên đường, thường được làm bằng các mảnh đá dài"
                },
                "examples": [
                    {
                        "en": "The bus mounted the curb (= went onto the sidewalk) and hit a tree.",
                        "vi": "Xe buýt lao vào lề đường (= đi lên vỉa hè) và đâm vào một cái cây."
                    }
                ]
            }
        ]
    },
    {
        "id": "e53a3a8f813345b6ab7206d82c3d1b60",
        "word": "curbside",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɜːbsaɪd/",
            "us": "/ˈkɜːrbsaɪd/"
        },
        "nearby": [
            {
                "word": "curb",
                "pos": "verb"
            },
            {
                "word": "curb",
                "pos": "noun"
            },
            {
                "word": "curbside",
                "pos": "noun"
            },
            {
                "word": "curbstone",
                "pos": "noun"
            },
            {
                "word": "curd",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the side of the street or path near the curb",
                    "vi": "bên đường hoặc lối đi gần lề đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e39d9db40f85484ea86d3c4af1693343",
        "word": "embankment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪmˈbæŋkmənt/",
            "us": "/ɪmˈbæŋkmənt/"
        },
        "nearby": [
            {
                "word": "embalm",
                "pos": "verb"
            },
            {
                "word": "embalmer",
                "pos": "noun"
            },
            {
                "word": "embankment",
                "pos": "noun"
            },
            {
                "word": "the Embankment",
                "pos": ""
            },
            {
                "word": "embargo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall or bank of stone or earth made to keep water back or to carry a road or railway over low ground",
                    "vi": "một bức tường hoặc bờ bằng đá hoặc đất được làm để giữ nước trở lại hoặc để dẫn đường bộ hoặc đường sắt trên mặt đất thấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "353da5132794491ea48a9d7d898a3f71",
        "word": "fire hydrant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfaɪə haɪdrənt/",
            "us": "/ˈfaɪər haɪdrənt/"
        },
        "nearby": [
            {
                "word": "fire hose",
                "pos": "noun"
            },
            {
                "word": "firehouse",
                "pos": "noun"
            },
            {
                "word": "fire hydrant",
                "pos": "noun"
            },
            {
                "word": "firelight",
                "pos": "noun"
            },
            {
                "word": "firelighter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe in the street through which water can be sent using a pump in order to put out fires or to clean the streets",
                    "vi": "một đường ống trên đường phố mà nước có thể được đưa qua bằng cách sử dụng máy bơm để dập lửa hoặc làm sạch đường phố"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a51af2db7c3746198f76abe5b593281e",
        "word": "gravel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrævl/",
            "us": "/ˈɡrævl/"
        },
        "nearby": [
            {
                "word": "grave2",
                "pos": "noun"
            },
            {
                "word": "gravedigger",
                "pos": "noun"
            },
            {
                "word": "gravel",
                "pos": "noun"
            },
            {
                "word": "gravelled",
                "pos": "adjective"
            },
            {
                "word": "gravelly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small stones, often used to make the surface of paths and roads",
                    "vi": "đá nhỏ, thường được sử dụng để làm bề mặt của lối đi và đường"
                },
                "examples": [
                    {
                        "en": "a gravel path",
                        "vi": "một con đường sỏi"
                    },
                    {
                        "en": "A gravel drive led up to the house.",
                        "vi": "Một ổ sỏi dẫn lên ngôi nhà."
                    },
                    {
                        "en": "a gravel pit (= a place where gravel is taken from the ground)",
                        "vi": "một hố sỏi (= nơi lấy sỏi từ mặt đất)"
                    },
                    {
                        "en": "Put a layer of fine gravel into the bottom of the plant pot for drainage.",
                        "vi": "Lót một lớp sỏi mịn vào đáy chậu cây để thoát nước."
                    },
                    {
                        "en": "We parked on the gravel at the side of the road.",
                        "vi": "Chúng tôi đỗ xe trên bãi sỏi ở bên đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "9cc172f7715549bb9ec05daa6ce54ea5",
        "word": "gravelled",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrævld/",
            "us": "/ˈɡrævld/"
        },
        "nearby": [
            {
                "word": "gravedigger",
                "pos": "noun"
            },
            {
                "word": "gravel",
                "pos": "noun"
            },
            {
                "word": "gravelled",
                "pos": "adjective"
            },
            {
                "word": "gravelly",
                "pos": "adjective"
            },
            {
                "word": "gravely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "covered with gravel",
                    "vi": "phủ đầy sỏi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "742e1c5a09c943ed8b28f5f151876f4b",
        "word": "grit",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrɪt/",
            "us": "/ɡrɪt/"
        },
        "nearby": [
            {
                "word": "gristle",
                "pos": "noun"
            },
            {
                "word": "grit",
                "pos": "noun"
            },
            {
                "word": "grit",
                "pos": "verb"
            },
            {
                "word": "grits",
                "pos": "noun"
            },
            {
                "word": "gritter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spread grit, salt or sand on a road that is covered with ice",
                    "vi": "rải đá mạt, muối hoặc cát trên con đường phủ đầy băng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to bite your teeth tightly together",
                    "vi": "cắn chặt răng vào nhau"
                },
                "examples": [
                    {
                        "en": "She gritted her teeth against the pain.",
                        "vi": "Cô nghiến răng chịu đựng cơn đau."
                    },
                    {
                        "en": "‘Stop it!’ he said through gritted teeth.",
                        "vi": "Dừng lại!' anh nghiến răng nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined to continue to do something in a difficult or unpleasant situation",
                    "vi": "quyết tâm tiếp tục làm điều gì đó trong hoàn cảnh khó khăn hoặc không vui"
                },
                "examples": [
                    {
                        "en": "It started to rain harder, but we gritted our teeth and carried on.",
                        "vi": "Trời bắt đầu mưa to hơn, nhưng chúng tôi nghiến răng và tiếp tục."
                    }
                ]
            }
        ]
    },
    {
        "id": "2eea17828c384172ad6e35056cd18037",
        "word": "gutter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌtə(r)/",
            "us": "/ˈɡʌtər/"
        },
        "nearby": [
            {
                "word": "gutta-percha",
                "pos": "noun"
            },
            {
                "word": "gutted",
                "pos": "adjective"
            },
            {
                "word": "gutter",
                "pos": "noun"
            },
            {
                "word": "gutter",
                "pos": "verb"
            },
            {
                "word": "guttering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long curved channel made of metal or plastic that is fixed under the edge of a roof to carry away the water when it rains",
                    "vi": "một kênh dài cong làm bằng kim loại hoặc nhựa được cố định dưới mép mái nhà để dẫn nước đi khi trời mưa"
                },
                "examples": [
                    {
                        "en": "a blocked/leaking gutter",
                        "vi": "máng xối bị tắc / rò rỉ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a channel at the edge of a road where water collects and is carried away to drains",
                    "vi": "một con kênh ở mép đường nơi nước đọng lại và được mang đi thoát nước"
                },
                "examples": [
                    {
                        "en": "I stepped off the pavement and walked in the gutter.",
                        "vi": "Tôi bước ra khỏi vỉa hè và đi trong rãnh nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the bad social conditions or low moral standards sometimes connected with the lowest level of society",
                    "vi": "điều kiện xã hội tồi tệ hoặc tiêu chuẩn đạo đức thấp đôi khi liên quan đến cấp thấp nhất của xã hội"
                },
                "examples": [
                    {
                        "en": "She rose from the gutter to become a great star.",
                        "vi": "Cô ấy đã vươn lên từ rãnh nước để trở thành một ngôi sao vĩ đại."
                    },
                    {
                        "en": "the language of the gutter (= using swear words)",
                        "vi": "ngôn ngữ của máng xối (= sử dụng các từ chửi thề)"
                    }
                ]
            }
        ]
    },
    {
        "id": "e5e8207647344f9fa3aab71e62717833",
        "word": "hairpin bend",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌheəpɪn ˈbend/",
            "us": "/ˌherpɪn ˈbend/"
        },
        "nearby": [
            {
                "word": "hairpiece",
                "pos": "noun"
            },
            {
                "word": "hairpin",
                "pos": "noun"
            },
            {
                "word": "hairpin bend",
                "pos": "noun"
            },
            {
                "word": "hair-raising",
                "pos": "adjective"
            },
            {
                "word": "hair's breadth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sharp U-shaped bend in a road, especially a mountain road",
                    "vi": "khúc cua gấp hình chữ U trên đường, đặc biệt là đường núi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "32a33eddc3fa46798cf97e8877430fe8",
        "word": "hoarding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːdɪŋ/",
            "us": "/ˈhɔːrdɪŋ/"
        },
        "nearby": [
            {
                "word": "hoard",
                "pos": "verb"
            },
            {
                "word": "hoarder",
                "pos": "noun"
            },
            {
                "word": "hoarding",
                "pos": "noun"
            },
            {
                "word": "hoar frost",
                "pos": "noun"
            },
            {
                "word": "hoarse",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board on the outside of a building or at the side of the road, used for displaying advertisements",
                    "vi": "một tấm bảng lớn ở bên ngoài của một tòa nhà hoặc ở bên đường, được sử dụng để hiển thị quảng cáo"
                },
                "examples": [
                    {
                        "en": "advertising hoardings",
                        "vi": "tích trữ quảng cáo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a temporary fence made of boards that is placed around an area of land until a building has been built",
                    "vi": "một hàng rào tạm thời bằng ván được đặt xung quanh một khu đất cho đến khi một tòa nhà được xây dựng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the act of collecting and keeping large amounts of food, money, etc., often secretly",
                    "vi": "hành động thu thập và giữ một lượng lớn thực phẩm, tiền bạc, v.v., thường là bí mật"
                },
                "examples": [
                    {
                        "en": "Consumer hoarding of limited goods, such as gasoline and paper, is creating shortages in stores.",
                        "vi": "Người tiêu dùng tích trữ hàng hóa hạn chế, chẳng hạn như xăng và giấy, đang tạo ra sự thiếu hụt trong các cửa hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee9b99fe12e54ca8bdf2814bce5aaf9e",
        "word": "hydrant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaɪdrənt/",
            "us": "/ˈhaɪdrənt/"
        },
        "nearby": [
            {
                "word": "hydra",
                "pos": "noun"
            },
            {
                "word": "hydrangea",
                "pos": "noun"
            },
            {
                "word": "hydrant",
                "pos": "noun"
            },
            {
                "word": "hydrate",
                "pos": "verb"
            },
            {
                "word": "hydration",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe in the street through which water can be sent using a pump in order to put out fires or to clean the streets",
                    "vi": "một đường ống trên đường phố mà nước có thể được đưa qua bằng cách sử dụng máy bơm để dập lửa hoặc làm sạch đường phố"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3e3d935f57d4483088148716f7c6c3cf",
        "word": "kerb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɜːb/",
            "us": "/kɜːrb/"
        },
        "nearby": [
            {
                "word": "kept woman",
                "pos": "noun"
            },
            {
                "word": "keratin",
                "pos": "noun"
            },
            {
                "word": "kerb",
                "pos": "noun"
            },
            {
                "word": "kerb-crawler",
                "pos": "noun"
            },
            {
                "word": "kerb-crawling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the edge of the raised path at the side of a road, usually made of long pieces of stone",
                    "vi": "mép của lối đi nhô cao ở bên đường, thường được làm bằng các mảnh đá dài"
                },
                "examples": [
                    {
                        "en": "The bus mounted the kerb (= went onto the pavement) and hit a tree.",
                        "vi": "Xe buýt lao vào lề đường (= đi lên vỉa hè) và đâm vào một cái cây."
                    }
                ]
            }
        ]
    },
    {
        "id": "61e5713e086a43bc835ff5ef3967e2a5",
        "word": "kerbside",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɜːbsaɪd/",
            "us": "/ˈkɜːrbsaɪd/"
        },
        "nearby": [
            {
                "word": "kerb-crawler",
                "pos": "noun"
            },
            {
                "word": "kerb-crawling",
                "pos": "noun"
            },
            {
                "word": "kerbside",
                "pos": "noun"
            },
            {
                "word": "kerbstone",
                "pos": "noun"
            },
            {
                "word": "kerchief",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the side of the street or path near the kerb",
                    "vi": "bên đường hoặc lối đi gần lề đường"
                },
                "examples": [
                    {
                        "en": "to stand at the kerbside",
                        "vi": "đứng ở kerbside"
                    },
                    {
                        "en": "(British English) a kerbside recycling scheme (= in which boxes of items for recycling are collected from outside people's houses)",
                        "vi": "(Tiếng Anh Anh) một chương trình tái chế kerbside (= trong đó các hộp các vật dụng để tái chế được thu gom từ nhà của những người bên ngoài)"
                    },
                    {
                        "en": "(North American English) a curbside recycling program",
                        "vi": "(Tiếng Anh Bắc Mỹ) một chương trình tái chế lề đường"
                    }
                ]
            }
        ]
    },
    {
        "id": "9da0c77d85b64f9cb7bccb622074fdda",
        "word": "macadam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈkædəm/",
            "us": "/məˈkædəm/"
        },
        "nearby": [
            {
                "word": "Mac",
                "pos": "noun"
            },
            {
                "word": "macabre",
                "pos": "adjective"
            },
            {
                "word": "macadam",
                "pos": "noun"
            },
            {
                "word": "macadamia",
                "pos": "noun"
            },
            {
                "word": "macaque",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a road surface made of layers of broken stones, mixed with tar",
                    "vi": "mặt đường làm bằng nhiều lớp đá vụn, trộn với hắc ín"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b678a3aff1844d328256aa6cdcf686e7",
        "word": "manhole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmænhəʊl/",
            "us": "/ˈmænhəʊl/"
        },
        "nearby": [
            {
                "word": "Manhattan",
                "pos": ""
            },
            {
                "word": "the Manhattan Project",
                "pos": ""
            },
            {
                "word": "manhole",
                "pos": "noun"
            },
            {
                "word": "manhood",
                "pos": "noun"
            },
            {
                "word": "man-hour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hole in the street that has a cover over it, used when somebody needs to go down to examine the pipes or sewers below the street",
                    "vi": "một cái lỗ trên đường phố có nắp đậy, được sử dụng khi ai đó cần đi xuống để kiểm tra các đường ống hoặc cống rãnh bên dưới đường phố"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c293ca85ab0643cb87e5f34124055063",
        "word": "milepost",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪlpəʊst/",
            "us": "/ˈmaɪlpəʊst/"
        },
        "nearby": [
            {
                "word": "mileage",
                "pos": "noun"
            },
            {
                "word": "mileometer",
                "pos": "noun"
            },
            {
                "word": "milepost",
                "pos": "noun"
            },
            {
                "word": "miles",
                "pos": "adverb"
            },
            {
                "word": "Miles",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a post by the side of the road that shows how far it is to the next town, and to other places",
                    "vi": "một bài đăng bên đường cho biết khoảng cách đến thị trấn tiếp theo và các địa điểm khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very important stage or event in the development of something",
                    "vi": "một giai đoạn hoặc sự kiện rất quan trọng trong sự phát triển của một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8176ff02cf47434787c75f50b0c223dc",
        "word": "nearside",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnɪəsaɪd/",
            "us": "/ˈnɪrsaɪd/"
        },
        "nearby": [
            {
                "word": "near miss",
                "pos": "noun"
            },
            {
                "word": "nearness",
                "pos": "noun"
            },
            {
                "word": "nearside",
                "pos": "adjective"
            },
            {
                "word": "the nearside",
                "pos": "noun"
            },
            {
                "word": "nearsighted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(for a driver) on the side that is nearest the edge of the road",
                    "vi": "(dành cho người lái xe) ở phía gần mép đường nhất"
                },
                "examples": [
                    {
                        "en": "the car’s nearside doors",
                        "vi": "cửa gần của chiếc xe"
                    },
                    {
                        "en": "Keep to the nearside lane.",
                        "vi": "Đi sang làn đường gần nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "ef0f3bbafe4d418d9e1deefa1c073f1c",
        "word": "offside",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒfˈsaɪd/",
            "us": "/ˌɔːfˈsaɪd/"
        },
        "nearby": [
            {
                "word": "offshore",
                "pos": "adverb"
            },
            {
                "word": "offshoring",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adjective"
            },
            {
                "word": "offside",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in some sports, for example football (soccer) and ice hockey, a player is offside if they are in a position, usually ahead of the ball, that is not allowed",
                    "vi": "trong một số môn thể thao, ví dụ như bóng đá (bóng đá) và khúc côn cầu trên băng, một cầu thủ việt vị nếu họ ở trong một vị trí, thường là trước quả bóng, điều đó không được phép"
                },
                "examples": [
                    {
                        "en": "He was offside when he scored.",
                        "vi": "Anh ấy đã việt vị khi ghi bàn."
                    },
                    {
                        "en": "the offside rule",
                        "vi": "luật việt vị"
                    }
                ]
            },
            {
                "define": {
                    "en": "on the side of a vehicle that is furthest from the edge of the road",
                    "vi": "ở bên một chiếc xe cách xa mép đường nhất"
                },
                "examples": [
                    {
                        "en": "the offside mirror",
                        "vi": "gương việt vị"
                    }
                ]
            }
        ]
    },
    {
        "id": "4386ef29fb2a4175aa866fed4dfb6477",
        "word": "offside",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒfsaɪd/",
            "us": "/ˈɔːfsaɪd/"
        },
        "nearby": [
            {
                "word": "offshoring",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adjective"
            },
            {
                "word": "offside",
                "pos": "noun"
            },
            {
                "word": "offside",
                "pos": "adverb"
            },
            {
                "word": "offsider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being offside in a game such as football (soccer) or ice hockey",
                    "vi": "thực tế là việt vị trong một trò chơi như bóng đá (bóng đá) hoặc khúc côn cầu trên băng"
                },
                "examples": [
                    {
                        "en": "The goal was disallowed for offside.",
                        "vi": "Mục tiêu không được phép vì việt vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a vehicle that is furthest from the edge of the road",
                    "vi": "mặt của một chiếc xe xa nhất từ mép đường"
                },
                "examples": [
                    {
                        "en": "The offside was damaged.",
                        "vi": "Lỗi việt vị đã bị hỏng."
                    }
                ]
            }
        ]
    },
    {
        "id": "175473f524164dfeaae6dd9cb032cbd8",
        "word": "parkade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pɑːˈkeɪd/",
            "us": "/pɑːrˈkeɪd/"
        },
        "nearby": [
            {
                "word": "park",
                "pos": "verb"
            },
            {
                "word": "parka",
                "pos": "noun"
            },
            {
                "word": "parkade",
                "pos": "noun"
            },
            {
                "word": "park and ride",
                "pos": "noun"
            },
            {
                "word": "Park Avenue",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a parking garage for many cars",
                    "vi": "một nhà để xe cho nhiều ô tô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8881d5712769474fac02cedff4e5c8ba",
        "word": "passable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːsəbl/",
            "us": "/ˈpæsəbl/"
        },
        "nearby": [
            {
                "word": "pass",
                "pos": "verb"
            },
            {
                "word": "pass",
                "pos": "noun"
            },
            {
                "word": "passable",
                "pos": "adjective"
            },
            {
                "word": "passably",
                "pos": "adverb"
            },
            {
                "word": "passage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fairly good but not excellent",
                    "vi": "khá tốt nhưng không xuất sắc"
                },
                "examples": [
                    {
                        "en": "She put on a passable imitation of a Scottish accent.",
                        "vi": "Cô ấy bắt chước giọng Scotland khá dễ hiểu."
                    },
                    {
                        "en": "He served a bottle of very passable wine with the meal.",
                        "vi": "Anh ta phục vụ một chai rượu rất ngon trong bữa ăn."
                    },
                    {
                        "en": "She did a passable job of fixing her make-up.",
                        "vi": "Cô ấy đã làm một công việc khá tốt là sửa trang điểm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a road or a river is passable, it is not blocked and you can travel along or across it",
                    "vi": "nếu một con đường hoặc một con sông có thể đi qua được, nó không bị chặn và bạn có thể đi dọc theo hoặc băng qua nó"
                },
                "examples": [
                    {
                        "en": "The mountain roads are not passable until late spring.",
                        "vi": "Những con đường núi không thể đi qua cho đến cuối mùa xuân."
                    }
                ]
            }
        ]
    },
    {
        "id": "06dd841ad27c4a10aa4699e0ced51207",
        "word": "pothole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒthəʊl/",
            "us": "/ˈpɑːthəʊl/"
        },
        "nearby": [
            {
                "word": "potheen",
                "pos": "noun"
            },
            {
                "word": "potholder",
                "pos": "noun"
            },
            {
                "word": "pothole",
                "pos": "noun"
            },
            {
                "word": "potholer",
                "pos": "noun"
            },
            {
                "word": "potholing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large rough hole in the surface of a road that is formed by traffic and bad weather",
                    "vi": "một lỗ gồ ghề lớn trên bề mặt đường do giao thông và thời tiết xấu hình thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a deep hole that is formed in rock, especially by the action of water",
                    "vi": "một lỗ sâu được hình thành trong đá, đặc biệt là do tác động của nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0cecdcd6581400cb1ed75e8f4b9f3f0",
        "word": "resurface",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈsɜːfɪs/",
            "us": "/ˌriːˈsɜːrfɪs/"
        },
        "nearby": [
            {
                "word": "resupply",
                "pos": "verb"
            },
            {
                "word": "resupply",
                "pos": "noun"
            },
            {
                "word": "resurface",
                "pos": "verb"
            },
            {
                "word": "resurgence",
                "pos": "noun"
            },
            {
                "word": "resurgent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come to the surface again after being underwater or under the ground",
                    "vi": "lên mặt nước lần nữa sau khi ở dưới nước hoặc dưới mặt đất"
                },
                "examples": [
                    {
                        "en": "The submarine resurfaced.",
                        "vi": "Chiếc tàu ngầm nổi lên."
                    },
                    {
                        "en": "(figurative) All the old hostilities resurfaced when they met again.",
                        "vi": "(nghĩa bóng) Mọi thù địch cũ lại trỗi dậy khi họ gặp lại nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a new surface on a road, path, etc.",
                    "vi": "để đặt một bề mặt mới trên một con đường, lối đi, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f2de86ae34bb4a5cb8db320ed738c90b",
        "word": "rutted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌtɪd/",
            "us": "/ˈrʌtɪd/"
        },
        "nearby": [
            {
                "word": "ruthlessness",
                "pos": "noun"
            },
            {
                "word": "Rutland",
                "pos": ""
            },
            {
                "word": "rutted",
                "pos": "adjective"
            },
            {
                "word": "rutting",
                "pos": "adjective"
            },
            {
                "word": "RV",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with deep tracks that have been made by wheels",
                    "vi": "với những vết sâu đã được tạo ra bởi bánh xe"
                },
                "examples": [
                    {
                        "en": "The track was heavily rutted from the wheels of farm tractors.",
                        "vi": "Đường ray bị hằn lún nặng nề do bánh xe của máy kéo nông nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e9636eaccde4af79ae2d0d198ad4985",
        "word": "shoulder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃəʊldə(r)/",
            "us": "/ˈʃəʊldər/"
        },
        "nearby": [
            {
                "word": "shot-put",
                "pos": "noun"
            },
            {
                "word": "should",
                "pos": "modal verb"
            },
            {
                "word": "shoulder",
                "pos": "noun"
            },
            {
                "word": "shoulder",
                "pos": "verb"
            },
            {
                "word": "shoulder bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two parts of the body between the top of each arm and the neck",
                    "vi": "một trong hai phần của cơ thể giữa đầu mỗi cánh tay và cổ"
                },
                "examples": [
                    {
                        "en": "your left/right shoulder",
                        "vi": "vai trái / phải của bạn"
                    },
                    {
                        "en": "a tall man with broad shoulders",
                        "vi": "một người đàn ông cao với đôi vai rộng"
                    },
                    {
                        "en": "over somebody's shoulder He slung the bag over his shoulder.",
                        "vi": "qua vai ai đó. Anh ấy quàng chiếc túi qua vai."
                    },
                    {
                        "en": "He looked back over his shoulder.",
                        "vi": "Anh nhìn lại qua vai mình."
                    },
                    {
                        "en": "on somebody's shoulder He carried the child on his shoulders.",
                        "vi": "trên vai ai đó Anh ta cõng đứa trẻ trên vai."
                    },
                    {
                        "en": "I put a hand on her shoulder to stop her.",
                        "vi": "Tôi đặt một tay lên vai cô ấy để ngăn cô ấy lại."
                    },
                    {
                        "en": "She tapped him on the shoulder.",
                        "vi": "Cô vỗ vào vai anh."
                    },
                    {
                        "en": "around somebody's shoulder He put an arm around her shoulders and pulled her close.",
                        "vi": "quanh vai ai đó Anh choàng tay qua vai cô và kéo cô lại gần."
                    },
                    {
                        "en": "She shrugged her shoulders (= showing that she didn't know or care).",
                        "vi": "Cô ấy nhún vai (= thể hiện rằng cô ấy không biết hoặc không quan tâm)."
                    },
                    {
                        "en": "an off-the-shoulder dress (= that does not cover the shoulders)",
                        "vi": "một chiếc váy trễ vai (= không che được vai)"
                    },
                    {
                        "en": "a shoulder injury",
                        "vi": "chấn thương vai"
                    },
                    {
                        "en": "I have to have shoulder surgery.",
                        "vi": "Tôi phải phẫu thuật vai."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of shoulders mentioned",
                    "vi": "có loại vai được đề cập"
                },
                "examples": [
                    {
                        "en": "broad-shouldered",
                        "vi": "vai rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a piece of clothing that covers the shoulder",
                    "vi": "phần của một mảnh quần áo che vai"
                },
                "examples": [
                    {
                        "en": "a jacket with padded shoulders",
                        "vi": "áo khoác có đệm vai"
                    },
                    {
                        "en": "There was snow on the shoulders of his heavy black coat.",
                        "vi": "Có tuyết trên vai áo khoác đen dày của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "meat from the top part of one of the front legs of an animal that has four legs",
                    "vi": "thịt từ phần trên cùng của một trong các chân trước của động vật có bốn chân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part of something, such as a bottle or mountain, that is like a shoulder in shape",
                    "vi": "một phần của cái gì đó, chẳng hạn như một cái chai hoặc một ngọn núi, giống như một cái vai"
                },
                "examples": [
                    {
                        "en": "The village lay just around the shoulder of the hill.",
                        "vi": "Ngôi làng nằm ngay vai đồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of ground at the side of a road where vehicles can stop in an emergency",
                    "vi": "khu vực đất ở bên đường nơi các phương tiện có thể dừng lại trong trường hợp khẩn cấp"
                },
                "examples": [
                    {
                        "en": "No shoulder for next 5 miles (= on a notice).",
                        "vi": "Không có vai trong 5 dặm tiếp theo (= trên một thông báo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be much better than other people or things",
                    "vi": "tốt hơn nhiều so với những người khác hoặc những thứ khác"
                },
                "examples": [
                    {
                        "en": "His performance stood head and shoulders above the rest.",
                        "vi": "Màn trình diễn của anh ấy đứng đầu và vai trên phần còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be anxious and have the feeling that somebody is going to do something unpleasant or harmful to you",
                    "vi": "lo lắng và có cảm giác rằng ai đó sẽ làm điều gì đó khó chịu hoặc có hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to treat somebody in a way that is not friendly",
                    "vi": "đối xử với ai đó theo cách không thân thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be sensitive about something that happened in the past and become easily offended if it is mentioned because you think that you were treated unfairly",
                    "vi": "nhạy cảm về điều gì đó đã xảy ra trong quá khứ và dễ bị xúc phạm nếu nó được đề cập vì bạn nghĩ rằng bạn đã bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He has a real chip on his shoulder about being adopted.",
                        "vi": "Anh ấy có một con chip thực sự trên vai về việc được nhận làm con nuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a sensible person",
                    "vi": "trở thành một người hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a young person who acts in a more sensible way than you would expect for a person of their age",
                    "vi": "được sử dụng để mô tả một người trẻ hành động theo cách hợp lý hơn bạn mong đợi đối với một người ở độ tuổi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if blame, guilt, etc. is on somebody’s shoulders, they must take responsibility for it",
                    "vi": "nếu trách cứ, tội lỗi, v.v. đổ lên vai ai đó, họ phải chịu trách nhiệm về điều đó"
                },
                "examples": [
                    {
                        "en": "Stop trying to put the blame on somebody else’s shoulders.",
                        "vi": "Đừng cố đổ lỗi lên vai người khác nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start working very hard at a particular task",
                    "vi": "bắt đầu làm việc rất chăm chỉ trong một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "Everyone is going to have to put their shoulder to the wheel.",
                        "vi": "Mọi người sẽ phải đặt vai của họ vào bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to meet and spend time with a famous person, socially or as part of your job",
                    "vi": "gặp gỡ và dành thời gian với một người nổi tiếng, trên phương diện xã hội hoặc trong công việc của bạn"
                },
                "examples": [
                    {
                        "en": "He’s rubbing shoulders with stars all the time.",
                        "vi": "Anh ấy luôn xoa vai với các vì sao."
                    },
                    {
                        "en": "She had been rubbing elbows with celebrities.",
                        "vi": "Cô đã từng cọ xát với những người nổi tiếng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a person who listens to your problems and gives you sympathy",
                    "vi": "được sử dụng để mô tả một người lắng nghe vấn đề của bạn và thông cảm cho bạn"
                },
                "examples": [
                    {
                        "en": "He was a fatherly shoulder to cry on when things went wrong.",
                        "vi": "Anh ấy là bờ vai của một người cha để em khóc khi mọi chuyện không như ý."
                    }
                ]
            },
            {
                "define": {
                    "en": "physically close to somebody",
                    "vi": "thân thiết với ai đó"
                },
                "examples": [
                    {
                        "en": "The large crowd stood shoulder to shoulder in the stands.",
                        "vi": "Đông đảo khán giả kề vai sát cánh trên khán đài."
                    },
                    {
                        "en": "The route of the procession was lined with police officers standing shoulder to shoulder.",
                        "vi": "Lộ trình của đoàn rước được xếp hàng ngang với các chiến sĩ cảnh sát sánh vai."
                    }
                ]
            },
            {
                "define": {
                    "en": "as one group that has the same aims, opinions, etc.",
                    "vi": "như một nhóm có cùng mục đích, quan điểm, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something straight from the shoulder, you are being very honest and direct, even if what you are saying is critical",
                    "vi": "nếu bạn nói điều gì đó thẳng thắn từ vai, bạn đang rất trung thực và trực tiếp, ngay cả khi điều bạn đang nói là chỉ trích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "698409d0cd084e97bef0bf48e213af3a",
        "word": "tar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tɑː(r)/",
            "us": "/tɑːr/"
        },
        "nearby": [
            {
                "word": "taproot",
                "pos": "noun"
            },
            {
                "word": "tap water",
                "pos": "noun"
            },
            {
                "word": "tar",
                "pos": "noun"
            },
            {
                "word": "tar",
                "pos": "verb"
            },
            {
                "word": "ta-ra",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick, sticky black liquid that becomes hard when cold. Tar is obtained from coal and is used especially in making roads.",
                    "vi": "một chất lỏng màu đen đặc, dính và trở nên cứng khi lạnh. Tar được lấy từ than đá và được sử dụng đặc biệt để làm đường."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a substance similar to tar that is formed when tobacco is burned",
                    "vi": "một chất tương tự như hắc ín được hình thành khi đốt thuốc lá"
                },
                "examples": [
                    {
                        "en": "low-tar cigarettes",
                        "vi": "thuốc lá ít hắc ín"
                    },
                    {
                        "en": "the average tar yield of British cigarettes",
                        "vi": "sản lượng hắc ín trung bình của thuốc lá Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause something good to fail because you did not spend a small but necessary amount of money or time on a small but essential part of it",
                    "vi": "khiến điều gì đó tốt đẹp không thành công bởi vì bạn đã không dành một số tiền nhỏ nhưng cần thiết hoặc thời gian cho một phần nhỏ nhưng thiết yếu của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8bb1a20765194ca08afdb41a7f822f19",
        "word": "Tarmac™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɑːmæk/",
            "us": "/ˈtɑːrmæk/"
        },
        "nearby": [
            {
                "word": "Tarka the Otter",
                "pos": ""
            },
            {
                "word": "tarmac",
                "pos": "verb"
            },
            {
                "word": "Tarmac",
                "pos": "noun"
            },
            {
                "word": "tarn",
                "pos": "noun"
            },
            {
                "word": "tarnation",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a black material used for making road surfaces, that consists of small stones mixed with tar",
                    "vi": "một vật liệu màu đen được sử dụng để làm mặt đường, bao gồm đá nhỏ trộn với nhựa đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an area with a Tarmac surface, especially at an airport",
                    "vi": "khu vực có bề mặt Tarmac, đặc biệt là ở sân bay"
                },
                "examples": [
                    {
                        "en": "Three planes were standing on the tarmac, waiting to take off.",
                        "vi": "Ba chiếc máy bay đã túc trực trên đường băng, chờ cất cánh."
                    }
                ]
            }
        ]
    },
    {
        "id": "983fc74d3488403a9ded4243008233ce",
        "word": "tollbooth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtəʊlbuːð/",
            "us": "/ˈtəʊlbuːθ/"
        },
        "nearby": [
            {
                "word": "toll",
                "pos": "noun"
            },
            {
                "word": "toll",
                "pos": "verb"
            },
            {
                "word": "tollbooth",
                "pos": "noun"
            },
            {
                "word": "toll-free",
                "pos": "adjective"
            },
            {
                "word": "toll gate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small building by the side of a road where you pay to drive on a road, go over a bridge, etc.",
                    "vi": "một tòa nhà nhỏ bên đường nơi bạn trả tiền để lái xe trên đường, đi qua cầu, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0cfc253a6d3c4442a597def18e035dcb",
        "word": "toll plaza",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtəʊl plɑːzə/",
            "us": "/ˈtəʊl plæzə/"
        },
        "nearby": [
            {
                "word": "toll gate",
                "pos": "noun"
            },
            {
                "word": "tollhouse cookie",
                "pos": "noun"
            },
            {
                "word": "toll plaza",
                "pos": "noun"
            },
            {
                "word": "toll road",
                "pos": "noun"
            },
            {
                "word": "tollway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a row of tollbooths across a road",
                    "vi": "một dãy trạm thu phí trên một con đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de32c9d94ff546ab834fd579bf70209a",
        "word": "tramlines",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtræmlaɪnz/",
            "us": "/ˈtræmlaɪnz/"
        },
        "nearby": [
            {
                "word": "trajectory",
                "pos": "noun"
            },
            {
                "word": "tram",
                "pos": "noun"
            },
            {
                "word": "tramlines",
                "pos": "noun"
            },
            {
                "word": "trammel",
                "pos": "verb"
            },
            {
                "word": "tramp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the rails in the street that trams run on",
                    "vi": "đường ray xe điện chạy trên đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the pair of straight lines on a tennis or badminton court that mark the extra area that is used when four people are playing",
                    "vi": "cặp đường thẳng trên sân tennis hoặc sân cầu lông đánh dấu phần diện tích thừa được sử dụng khi bốn người đang chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0e0e4cbd6c0b47769388e7f164a4b6f3",
        "word": "twisty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtwɪsti/",
            "us": "/ˈtwɪsti/"
        },
        "nearby": [
            {
                "word": "twist off",
                "pos": "phrasal verb"
            },
            {
                "word": "twist tie",
                "pos": "noun"
            },
            {
                "word": "twisty",
                "pos": "adjective"
            },
            {
                "word": "twit",
                "pos": "noun"
            },
            {
                "word": "twitch",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having many bends or turns",
                    "vi": "có nhiều khúc cua hoặc ngã rẽ"
                },
                "examples": [
                    {
                        "en": "a narrow twisty lane leading to the farm",
                        "vi": "một con đường hẹp ngoằn ngoèo dẫn đến trang trại"
                    }
                ]
            }
        ]
    },
    {
        "id": "76b2c63d8eb44980aa34b6c8fcda62b8",
        "word": "verge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vɜːdʒ/",
            "us": "/vɜːrdʒ/"
        },
        "nearby": [
            {
                "word": "verdigris",
                "pos": "noun"
            },
            {
                "word": "verdure",
                "pos": "noun"
            },
            {
                "word": "verge",
                "pos": "noun"
            },
            {
                "word": "verge",
                "pos": "verb"
            },
            {
                "word": "verge on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of grass at the edge of a path, road, etc.",
                    "vi": "một mảnh cỏ ở mép lối đi, con đường, v.v."
                },
                "examples": [
                    {
                        "en": "a grass verge",
                        "vi": "một bờ vực cỏ"
                    },
                    {
                        "en": "The vehicle crossed white lines and mounted a verge before being stopped by police.",
                        "vi": "Chiếc xe vượt qua vạch trắng và dựng lề trước khi bị cảnh sát chặn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "very near to the moment when somebody does something or something happens",
                    "vi": "rất gần thời điểm ai đó làm điều gì đó hoặc điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "He was on the verge of tears.",
                        "vi": "Anh sắp khóc."
                    },
                    {
                        "en": "They are on the verge of signing a new contract.",
                        "vi": "Họ đang chuẩn bị ký hợp đồng mới."
                    },
                    {
                        "en": "These measures brought the republic to the verge of economic collapse.",
                        "vi": "Những biện pháp này đã đưa nước cộng hòa đến bờ vực của sự sụp đổ kinh tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "3fab353c5792458e8cb58fe6ccfdea72",
        "word": "winding",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪndɪŋ/",
            "us": "/ˈwaɪndɪŋ/"
        },
        "nearby": [
            {
                "word": "wind gauge",
                "pos": "noun"
            },
            {
                "word": "the Windies",
                "pos": "noun"
            },
            {
                "word": "winding",
                "pos": "adjective"
            },
            {
                "word": "winding-down",
                "pos": "noun"
            },
            {
                "word": "winding sheet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a curving and twisting shape",
                    "vi": "có hình dạng uốn lượn và xoắn"
                },
                "examples": [
                    {
                        "en": "a long and winding road",
                        "vi": "một con đường dài và quanh co"
                    },
                    {
                        "en": "The walk follows a winding path through the forest.",
                        "vi": "Chuyến đi bộ theo một con đường quanh co xuyên rừng."
                    }
                ]
            }
        ]
    }
]