[
    {
        "id": "24786a050c9e4e53af097732b4ef7721",
        "word": "department",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈpɑːtmənt/",
            "us": "/dɪˈpɑːrtmənt/"
        },
        "nearby": [
            {
                "word": "departed",
                "pos": "adjective"
            },
            {
                "word": "depart from",
                "pos": "phrasal verb"
            },
            {
                "word": "department",
                "pos": "noun"
            },
            {
                "word": "departmental",
                "pos": "adjective"
            },
            {
                "word": "the Department for Business, Energy and Industrial Strategy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a section of a large organization such as a government, business, university, etc.",
                    "vi": "một bộ phận của một tổ chức lớn như chính phủ, doanh nghiệp, trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "department of something the Department of Health",
                        "vi": "bộ phận của một cái gì đó Bộ y tế"
                    },
                    {
                        "en": "He is a lecturer in the department of psychology at Trinity College, Dublin.",
                        "vi": "Ông là giảng viên khoa tâm lý học tại Trinity College, Dublin."
                    },
                    {
                        "en": "the Treasury Department",
                        "vi": "Bộ Ngân khố"
                    },
                    {
                        "en": "a government/university, etc. department",
                        "vi": "một cơ quan chính phủ / trường đại học, v.v."
                    },
                    {
                        "en": "the marketing/sales, etc. department",
                        "vi": "bộ phận tiếp thị / bán hàng, v.v."
                    },
                    {
                        "en": "The children's department (= in a large store) sells a wide range of good quality clothes.",
                        "vi": "Bộ phận dành cho trẻ em (= trong một cửa hàng lớn) bán nhiều loại quần áo chất lượng tốt."
                    },
                    {
                        "en": "the English department",
                        "vi": "khoa tiếng anh"
                    },
                    {
                        "en": "in a department She used to work in the IT department.",
                        "vi": "trong một bộ phận Cô ấy từng làm việc trong bộ phận CNTT."
                    },
                    {
                        "en": "He later served as head of the art history department.",
                        "vi": "Sau đó ông giữ chức vụ trưởng khoa lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something that somebody is responsible for or knows a lot about",
                    "vi": "trở thành một cái gì đó mà ai đó có trách nhiệm hoặc biết nhiều về"
                },
                "examples": [
                    {
                        "en": "Don't ask me about it—that's her department.",
                        "vi": "Đừng hỏi tôi về điều đó — đó là bộ phận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a particular aspect or quality",
                    "vi": "ở một khía cạnh hoặc chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He doesn't have much going for him in the brains department, to be honest.",
                        "vi": "Thành thật mà nói, anh ấy không có nhiều thứ để làm trong bộ não."
                    },
                    {
                        "en": "Movies lacking in the story department can still succeed.",
                        "vi": "Phim thiếu mạch truyện vẫn có thể thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "385b3d650c704b3082e817c8d07c2751",
        "word": "government",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɡʌvənmənt/",
            "us": "/ˈɡʌvərnmənt/"
        },
        "nearby": [
            {
                "word": "governess",
                "pos": "noun"
            },
            {
                "word": "governing",
                "pos": "adjective"
            },
            {
                "word": "government",
                "pos": "noun"
            },
            {
                "word": "governmental",
                "pos": "adjective"
            },
            {
                "word": "government and binding theory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the group of people who are responsible for controlling a country or a state",
                    "vi": "nhóm người chịu trách nhiệm kiểm soát một quốc gia hoặc một tiểu bang"
                },
                "examples": [
                    {
                        "en": "to lead/form a government",
                        "vi": "lãnh đạo / thành lập chính phủ"
                    },
                    {
                        "en": "She has resigned from the Government.",
                        "vi": "Cô ấy đã từ chức khỏi Chính phủ."
                    },
                    {
                        "en": "The Government has/have been considering further tax cuts.",
                        "vi": "Chính phủ đã / đang xem xét cắt giảm thuế hơn nữa."
                    },
                    {
                        "en": "The government announced further austerity measures.",
                        "vi": "Chính phủ công bố các biện pháp thắt lưng buộc bụng hơn nữa."
                    },
                    {
                        "en": "This legislation was passed under the last Conservative government.",
                        "vi": "Đạo luật này đã được thông qua dưới thời chính phủ Bảo thủ cuối cùng."
                    },
                    {
                        "en": "EU national governments",
                        "vi": "Chính phủ các quốc gia EU"
                    },
                    {
                        "en": "the Nebraska state government",
                        "vi": "chính quyền bang Nebraska"
                    },
                    {
                        "en": "Ontario's new provincial government",
                        "vi": "Chính quyền cấp tỉnh mới của Ontario"
                    },
                    {
                        "en": "The country still has an interim government.",
                        "vi": "Nước này vẫn có chính phủ lâm thời."
                    },
                    {
                        "en": "the governments of many European countries",
                        "vi": "chính phủ của nhiều nước châu Âu"
                    },
                    {
                        "en": "This was a decision taken by the government of the day.",
                        "vi": "Đây là một quyết định của chính phủ thời đó."
                    },
                    {
                        "en": "the three branches of the US government",
                        "vi": "ba chi nhánh của chính phủ Hoa Kỳ"
                    },
                    {
                        "en": "Foreign governments have been consulted about this decision.",
                        "vi": "Các chính phủ nước ngoài đã được hỏi ý kiến về quyết định này."
                    },
                    {
                        "en": "government officials/ministers/employees",
                        "vi": "quan chức chính phủ / bộ trưởng / nhân viên"
                    },
                    {
                        "en": "a government spokesman",
                        "vi": "một phát ngôn viên của chính phủ"
                    },
                    {
                        "en": "a government department/agency",
                        "vi": "một bộ / cơ quan chính phủ"
                    },
                    {
                        "en": "government policies/regulations",
                        "vi": "chính sách / quy định của chính phủ"
                    },
                    {
                        "en": "government spending/funding",
                        "vi": "chi tiêu / tài trợ của chính phủ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular system or method of controlling a country",
                    "vi": "một hệ thống hoặc phương pháp kiểm soát một quốc gia cụ thể"
                },
                "examples": [
                    {
                        "en": "Democratic government has now replaced military rule.",
                        "vi": "Chính phủ dân chủ hiện đã thay thế chế độ quân sự."
                    },
                    {
                        "en": "communist/totalitarian government",
                        "vi": "chính phủ cộng sản / toàn trị"
                    },
                    {
                        "en": "a federal system of government",
                        "vi": "một hệ thống chính phủ liên bang"
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity or the manner of controlling a country",
                    "vi": "hoạt động hoặc cách thức kiểm soát một quốc gia"
                },
                "examples": [
                    {
                        "en": "We need strong government to take the country through this crisis.",
                        "vi": "Chúng ta cần chính phủ mạnh mẽ để đưa đất nước vượt qua cuộc khủng hoảng này."
                    },
                    {
                        "en": "The army retained a strong role in the government of the country.",
                        "vi": "Quân đội giữ một vai trò mạnh mẽ trong chính phủ của đất nước."
                    },
                    {
                        "en": "in government At that time the Democrats were in government.",
                        "vi": "trong chính phủ Vào thời điểm đó Đảng Dân chủ đã nắm trong tay chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ba4a083e7604b9fbbc40021b994ddf1",
        "word": "law",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/lɔː/",
            "us": "/lɔː/"
        },
        "nearby": [
            {
                "word": "lavish on",
                "pos": "phrasal verb"
            },
            {
                "word": "lavish upon",
                "pos": "phrasal verb"
            },
            {
                "word": "law",
                "pos": "noun"
            },
            {
                "word": "Bonar Law",
                "pos": ""
            },
            {
                "word": "law-abiding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rule that deals with a particular crime, agreement, etc.",
                    "vi": "quy tắc xử lý một tội phạm cụ thể, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "to pass a law (= officially make it part of the system of laws)",
                        "vi": "để thông qua luật (= chính thức biến nó thành một phần của hệ thống luật)"
                    },
                    {
                        "en": "law against (doing) something Police don't have the resources to enforce the law against dumping waste.",
                        "vi": "luật chống lại (làm) điều gì đó Cảnh sát không có đủ nguồn lực để thực thi luật chống đổ chất thải."
                    },
                    {
                        "en": "(informal) There ought to be a law against it!",
                        "vi": "(không chính thức) Cần phải có luật chống lại nó!"
                    },
                    {
                        "en": "law on something The company's actions violated the law on equal employment.",
                        "vi": "luật về điều gì đó Các hành động của công ty đã vi phạm luật về việc làm bình đẳng."
                    },
                    {
                        "en": "The suspects were in clear violation of immigration laws.",
                        "vi": "Các nghi phạm rõ ràng đã vi phạm luật nhập cư."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole system of rules that everyone in a country or society must obey",
                    "vi": "toàn bộ hệ thống quy tắc mà mọi người trong một quốc gia hoặc xã hội phải tuân theo"
                },
                "examples": [
                    {
                        "en": "If they entered the building they would be breaking the law.",
                        "vi": "Nếu họ bước vào tòa nhà, họ sẽ phạm luật."
                    },
                    {
                        "en": "The reforms have recently become law.",
                        "vi": "Những cải cách gần đây đã trở thành luật."
                    },
                    {
                        "en": "The Civil Rights Act of 1964 became the law of the land on July 2, 1964.",
                        "vi": "Đạo luật Quyền Công dân năm 1964 trở thành luật đất đai vào ngày 2 tháng 7 năm 1964."
                    },
                    {
                        "en": "state/federal law",
                        "vi": "luật tiểu bang / liên bang"
                    },
                    {
                        "en": "State law prohibits gambling in public places.",
                        "vi": "Luật tiểu bang nghiêm cấm đánh bạc ở nơi công cộng."
                    },
                    {
                        "en": "against the law In Sweden it is against the law to hit a child.",
                        "vi": "chống lại luật pháp Ở Thụy Điển, việc đánh một đứa trẻ là vi phạm pháp luật."
                    },
                    {
                        "en": "within the law Defence attorneys can use any means within the law to get their client off.",
                        "vi": "trong luật Các luật sư bào chữa có thể sử dụng bất kỳ phương tiện nào trong luật để đuổi khách hàng của họ."
                    },
                    {
                        "en": "outside the law to operate outside the law",
                        "vi": "ngoài pháp luật hoạt động ngoài pháp luật"
                    },
                    {
                        "en": "by law British schools are required by law to publish their exam results.",
                        "vi": "theo luật Các trường ở Anh được yêu cầu theo luật phải công bố kết quả kỳ thi của họ."
                    },
                    {
                        "en": "under the (…) law | under… law Under existing law, journalists cannot refuse to provide information to a jury.",
                        "vi": "theo (…) luật | theo… luật Theo luật hiện hành, các nhà báo không thể từ chối cung cấp thông tin cho bồi thẩm đoàn."
                    },
                    {
                        "en": "above the law Do not think you are above the law (= that you cannot be punished by the law).",
                        "vi": "Trên cả luật pháp Đừng nghĩ rằng bạn ở trên luật pháp (= rằng bạn không thể bị trừng phạt bởi luật pháp)."
                    },
                    {
                        "en": "They acted in accordance with the law of the country.",
                        "vi": "Họ đã hành động phù hợp với luật pháp của đất nước."
                    },
                    {
                        "en": "The constitution guarantees equality before the law for all.",
                        "vi": "Hiến pháp bảo đảm sự bình đẳng trước pháp luật cho tất cả mọi người."
                    },
                    {
                        "en": "law enforcement agencies/officials",
                        "vi": "các cơ quan / quan chức thực thi pháp luật"
                    },
                    {
                        "en": "(humorous) Kate's word was law in the Brown household.",
                        "vi": "(hài hước) Lời của Kate là luật trong gia đình Brown."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular branch of the law",
                    "vi": "một nhánh luật cụ thể"
                },
                "examples": [
                    {
                        "en": "He specializes in international law.",
                        "vi": "Ông ấy chuyên về luật quốc tế."
                    },
                    {
                        "en": "tax/employment law",
                        "vi": "luật thuế / việc làm"
                    },
                    {
                        "en": "according to… law According to copyright law, the author is the owner of the material.",
                        "vi": "theo… luật Theo luật bản quyền, tác giả là chủ sở hữu của tài liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of the law as a subject at university, etc.; the profession of being a lawyer",
                    "vi": "nghiên cứu luật như một môn học ở trường đại học, v.v.; nghề luật sư"
                },
                "examples": [
                    {
                        "en": "a law student/professor",
                        "vi": "một sinh viên luật / giáo sư"
                    },
                    {
                        "en": "Jane is studying law.",
                        "vi": "Jane đang học luật."
                    },
                    {
                        "en": "(North American English) He's in law school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Anh ấy đang học trường luật."
                    },
                    {
                        "en": "(British English) He's at law school.",
                        "vi": "(Anh Anh) Anh ấy đang ở trường luật."
                    },
                    {
                        "en": "What made you go into law?",
                        "vi": "Điều gì đã khiến bạn sa vào pháp luật?"
                    },
                    {
                        "en": "a law firm",
                        "vi": "một công ty luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to the police and the legal system",
                    "vi": "dùng để chỉ cảnh sát và hệ thống pháp luật"
                },
                "examples": [
                    {
                        "en": "Jim is always getting into trouble with the law.",
                        "vi": "Jim luôn gặp rắc rối với luật pháp."
                    },
                    {
                        "en": "She was well known for her brushes with the law.",
                        "vi": "Cô ấy nổi tiếng với những bàn chải của mình với luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that something always happens in the same way in an activity or in nature",
                    "vi": "thực tế là một cái gì đó luôn xảy ra theo cùng một cách trong một hoạt động hoặc trong tự nhiên"
                },
                "examples": [
                    {
                        "en": "The usual laws of supply and demand do not seem to apply in this case.",
                        "vi": "Quy luật cung và cầu thông thường dường như không áp dụng trong trường hợp này."
                    },
                    {
                        "en": "the laws of nature/physics",
                        "vi": "quy luật tự nhiên / vật lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a scientific rule that somebody has stated to explain a natural process",
                    "vi": "một quy tắc khoa học mà ai đó đã nêu ra để giải thích một quá trình tự nhiên"
                },
                "examples": [
                    {
                        "en": "the first law of thermodynamics",
                        "vi": "định luật đầu tiên của nhiệt động lực học"
                    },
                    {
                        "en": "Do you remember anything about Ohm's Law?",
                        "vi": "Bạn có nhớ gì về Định luật Ohm không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the rules that controls an organization or activity",
                    "vi": "một trong những quy tắc kiểm soát một tổ chức hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "the laws of the Church",
                        "vi": "luật của Giáo hội"
                    },
                    {
                        "en": "The first law of kung fu is to defend yourself.",
                        "vi": "Luật đầu tiên của kung fu là tự vệ."
                    },
                    {
                        "en": "the laws of cricket",
                        "vi": "luật chơi cricket"
                    }
                ]
            },
            {
                "define": {
                    "en": "a rule for good behaviour or how you should behave in a particular place or situation",
                    "vi": "quy tắc cho hành vi tốt hoặc cách bạn nên cư xử trong một địa điểm hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "He frequently behaved as though moral laws did not exist.",
                        "vi": "Anh ta thường cư xử như thể luật đạo đức không tồn tại."
                    },
                    {
                        "en": "Their world is shaped by their parents' attitudes and the unspoken laws of the street.",
                        "vi": "Thế giới của chúng được định hình bởi thái độ của cha mẹ và những luật bất thành văn trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in an independent way and ignore rules or what other people want you to do",
                    "vi": "cư xử theo cách độc lập và phớt lờ các quy tắc hoặc những gì người khác muốn bạn làm"
                },
                "examples": [
                    {
                        "en": "Boys of that age are a law unto themselves.",
                        "vi": "Con trai ở độ tuổi đó là một quy luật đối với bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask a court to settle a problem or disagreement",
                    "vi": "yêu cầu tòa án giải quyết vấn đề hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "They went to law to get back their property.",
                        "vi": "Họ đã tìm đến pháp luật để lấy lại tài sản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people obey the law and behave in a peaceful way",
                    "vi": "một tình huống mà mọi người tuân theo luật pháp và cư xử một cách hòa bình"
                },
                "examples": [
                    {
                        "en": "The government struggled to maintain law and order.",
                        "vi": "Chính phủ đã đấu tranh để duy trì luật pháp và trật tự."
                    },
                    {
                        "en": "After the riots, the military was brought in to restore law and order.",
                        "vi": "Sau cuộc bạo loạn, quân đội đã được đưa đến để khôi phục lại luật pháp và trật tự."
                    },
                    {
                        "en": "They claim to be the party of law and order.",
                        "vi": "Họ tự xưng là đảng của luật pháp và trật tự."
                    },
                    {
                        "en": "Martial law was imposed to prevent the breakdown of law and order.",
                        "vi": "Thiết quân luật đã được áp dụng để ngăn chặn sự phá vỡ luật pháp và trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the principle that one thing will happen as often as another if you try enough times",
                    "vi": "nguyên tắc rằng một việc sẽ xảy ra thường xuyên như một điều khác nếu bạn cố gắng đủ lần"
                },
                "examples": [
                    {
                        "en": "Keep applying and by the law of averages you'll get a job sooner or later.",
                        "vi": "Hãy tiếp tục nộp đơn và theo quy luật trung bình bạn sẽ sớm có việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people are prepared to harm other people in order to succeed",
                    "vi": "một tình huống trong đó mọi người chuẩn bị để làm hại người khác để thành công"
                },
                "examples": [
                    {
                        "en": "These criminal gangs only recognize the law of the jungle.",
                        "vi": "Các băng nhóm tội phạm này chỉ thừa nhận luật rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force what they should or should not do",
                    "vi": "buộc phải nói với ai đó những gì họ nên làm hoặc không nên làm"
                },
                "examples": [
                    {
                        "en": "My dad started laying down the law about what time I should come home.",
                        "vi": "Bố tôi bắt đầu đặt ra luật về thời gian tôi nên về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the exact words of a law or rule rather than its general meaning",
                    "vi": "những từ chính xác của một luật hoặc quy tắc hơn là ý nghĩa chung của nó"
                },
                "examples": [
                    {
                        "en": "They insist on sticking to the letter of the law.",
                        "vi": "Họ nhất quyết bám sát luật lệ."
                    },
                    {
                        "en": "We might be guilty of slightly bending the letter of the law.",
                        "vi": "Chúng tôi có thể phạm tội khi hơi bẻ cong văn bản của luật pháp."
                    },
                    {
                        "en": "In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her.",
                        "vi": "Bất chấp những khó khăn mà nó sẽ gây ra cho gia đình cô, thẩm phán vẫn tuân theo luật lệ và bỏ tù cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in trouble with the police",
                    "vi": "gặp rắc rối với cảnh sát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you already have or control something, it is difficult for somebody else to take it away from you, even if they have the legal right to it",
                    "vi": "nếu bạn đã có hoặc kiểm soát một thứ gì đó, thì rất khó để người khác lấy đi nó khỏi bạn, ngay cả khi họ có quyền hợp pháp đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them",
                    "vi": "làm điều gì đó bất hợp pháp để trừng phạt ai đó đã làm điều gì đó sai trái, thay vì để cảnh sát xử lý họ"
                },
                "examples": [
                    {
                        "en": "After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.",
                        "vi": "Sau hàng loạt vụ trộm trên địa bàn, cảnh sát lo ngại cư dân có thể sa lưới pháp luật."
                    },
                    {
                        "en": "When police failed to arrest the suspect, local people took the law into their own hands and beat him up.",
                        "vi": "Khi cảnh sát không bắt được nghi phạm, người dân địa phương đã lao vào luật pháp và đánh anh ta tới tấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who is criticizing you that you are not doing anything wrong",
                    "vi": "được sử dụng để nói với ai đó đang chỉ trích bạn rằng bạn không làm gì sai"
                },
                "examples": [
                    {
                        "en": "I'll sing if I want to—there's no law against it.",
                        "vi": "Tôi sẽ hát nếu tôi muốn - không có luật nào chống lại điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b71fa09a21b46099892ac08f0645ea4",
        "word": "leader",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈliːdə(r)/",
            "us": "/ˈliːdər/"
        },
        "nearby": [
            {
                "word": "leaded light",
                "pos": "noun"
            },
            {
                "word": "leaden",
                "pos": "adjective"
            },
            {
                "word": "leader",
                "pos": "noun"
            },
            {
                "word": "leader board",
                "pos": "noun"
            },
            {
                "word": "leaderless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who leads a group of people, especially the head of a country, an organization, etc.",
                    "vi": "một người lãnh đạo một nhóm người, đặc biệt là người đứng đầu một quốc gia, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "party/world leaders",
                        "vi": "các nhà lãnh đạo đảng / thế giới"
                    },
                    {
                        "en": "a religious/political leader",
                        "vi": "một nhà lãnh đạo tôn giáo / chính trị"
                    },
                    {
                        "en": "He was elected as leader of the Democratic Party.",
                        "vi": "Ông được bầu làm lãnh đạo Đảng Dân chủ."
                    },
                    {
                        "en": "She became leader of the campaign group.",
                        "vi": "Cô trở thành lãnh đạo của nhóm vận động."
                    },
                    {
                        "en": "Union leaders agreed to begin talks with the government.",
                        "vi": "Các nhà lãnh đạo công đoàn đồng ý bắt đầu các cuộc đàm phán với chính phủ."
                    },
                    {
                        "en": "Tomorrow the President will meet with business leaders.",
                        "vi": "Ngày mai Tổng thống sẽ gặp gỡ các lãnh đạo doanh nghiệp."
                    },
                    {
                        "en": "He was not a natural leader.",
                        "vi": "Anh ấy không phải là một nhà lãnh đạo bẩm sinh."
                    },
                    {
                        "en": "She's a born leader.",
                        "vi": "Cô ấy là một nhà lãnh đạo bẩm sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the best, or in first place in a race, business, etc.",
                    "vi": "một người hoặc điều tốt nhất, hoặc ở vị trí đầu tiên trong một cuộc đua, doanh nghiệp, v.v."
                },
                "examples": [
                    {
                        "en": "She was among the leaders of the race from the start.",
                        "vi": "Cô ấy đã nằm trong số những người dẫn đầu cuộc đua ngay từ đầu."
                    },
                    {
                        "en": "The company has emerged as a world leader in the field of precision engineering.",
                        "vi": "Công ty đã nổi lên như một công ty hàng đầu thế giới trong lĩnh vực cơ khí chính xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important violin player in an orchestra",
                    "vi": "người chơi vĩ cầm quan trọng nhất trong dàn nhạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an important article in a newspaper that expresses the editor's opinion about an item of news or an issue; in the US also a comment on radio or television that expresses the opinion of the station or network",
                    "vi": "một bài báo quan trọng trên một tờ báo thể hiện ý kiến của biên tập viên về một mục của tin tức hoặc một vấn đề; ở Mỹ cũng là một bình luận trên đài phát thanh hoặc truyền hình thể hiện quan điểm của đài hoặc mạng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e8b98de83bce488f9be852d52b312002",
        "word": "office",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɒfɪs/",
            "us": "/ˈɑːfɪs/"
        },
        "nearby": [
            {
                "word": "offhand",
                "pos": "adverb"
            },
            {
                "word": "offhandedly",
                "pos": "adverb"
            },
            {
                "word": "office",
                "pos": "noun"
            },
            {
                "word": "The Office",
                "pos": ""
            },
            {
                "word": "office block",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room, set of rooms or building where people work, usually sitting at desks",
                    "vi": "một căn phòng, tập hợp các phòng hoặc tòa nhà nơi mọi người làm việc, thường ngồi ở bàn làm việc"
                },
                "examples": [
                    {
                        "en": "The company is moving to new offices on the other side of town.",
                        "vi": "Công ty đang chuyển đến văn phòng mới ở phía bên kia thị trấn."
                    },
                    {
                        "en": "Are you going to the office today?",
                        "vi": "Bạn có đi đến văn phòng ngày hôm nay?"
                    },
                    {
                        "en": "in the office I'm sorry, Mr Anders is not in the office today.",
                        "vi": "Tôi rất tiếc, ông Anders không có ở văn phòng hôm nay."
                    },
                    {
                        "en": "at the office I've had a tough day at the office.",
                        "vi": "tại văn phòng Tôi đã có một ngày khó khăn tại văn phòng."
                    },
                    {
                        "en": "a regional/branch office",
                        "vi": "một văn phòng chi nhánh / khu vực"
                    },
                    {
                        "en": "office workers",
                        "vi": "nhân viên văn phòng"
                    },
                    {
                        "en": "an office job",
                        "vi": "một công việc văn phòng"
                    },
                    {
                        "en": "an office building",
                        "vi": "Một tòa nhà văn phòng"
                    },
                    {
                        "en": "The new development will include housing and office space.",
                        "vi": "Sự phát triển mới sẽ bao gồm nhà ở và không gian văn phòng."
                    },
                    {
                        "en": "out of the office I'm going to be out of the office next week.",
                        "vi": "ra khỏi văn phòng Tôi sẽ rời văn phòng vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in which a particular person works, usually at a desk",
                    "vi": "một căn phòng trong đó một người cụ thể làm việc, thường ở bàn làm việc"
                },
                "examples": [
                    {
                        "en": "Some people have to share an office.",
                        "vi": "Một số người phải chia sẻ một văn phòng."
                    },
                    {
                        "en": "Come into my office.",
                        "vi": "Vào văn phòng của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a doctor, dentist or vet sees patients",
                    "vi": "nơi mà bác sĩ, nha sĩ hoặc bác sĩ thú y khám bệnh cho bệnh nhân"
                },
                "examples": [
                    {
                        "en": "a doctor’s/dentist’s office",
                        "vi": "văn phòng bác sĩ / nha sĩ"
                    },
                    {
                        "en": "the bill from an office visit to the doctor",
                        "vi": "hóa đơn từ một chuyến thăm văn phòng đến bác sĩ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a room or building used for a particular purpose, especially to provide information or a service",
                    "vi": "một căn phòng hoặc tòa nhà được sử dụng cho một mục đích cụ thể, đặc biệt là để cung cấp thông tin hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "a ticket office",
                        "vi": "một văn phòng vé"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some British government departments",
                    "vi": "được sử dụng trong tên của một số cơ quan chính phủ Anh"
                },
                "examples": [
                    {
                        "en": "the Home Office",
                        "vi": "Bộ Nội vụ"
                    },
                    {
                        "en": "the Foreign and Commonwealth Office",
                        "vi": "Văn phòng Đối ngoại và Khối thịnh vượng chung"
                    },
                    {
                        "en": "office of something the Office of Fair Trading",
                        "vi": "Văn phòng của một cái gì đó Văn phòng Thương mại Công bằng"
                    },
                    {
                        "en": "a research project carried out by the Welsh Office",
                        "vi": "một dự án nghiên cứu do Văn phòng xứ Wales thực hiện"
                    }
                ]
            },
            {
                "define": {
                    "en": "an important position of authority, especially in government; the work and duties connected with this",
                    "vi": "một vị trí quan trọng của quyền lực, đặc biệt là trong chính phủ; công việc và nhiệm vụ liên quan đến điều này"
                },
                "examples": [
                    {
                        "en": "She held office as a cabinet minister for ten years.",
                        "vi": "Bà đã giữ chức bộ trưởng nội các trong mười năm."
                    },
                    {
                        "en": "in office How long has he been in office?",
                        "vi": "tại văn phòng Anh ấy đã tại chức được bao lâu?"
                    },
                    {
                        "en": "Perhaps she remained in office too long.",
                        "vi": "Có lẽ cô ấy đã tại vị quá lâu."
                    },
                    {
                        "en": "The scandal cast a shadow over his time in office.",
                        "vi": "Vụ bê bối đã phủ bóng đen lên thời gian đương nhiệm của ông."
                    },
                    {
                        "en": "out of office The party has been out of office (= has not formed a government) for many years.",
                        "vi": "out of office Đảng đã mãn nhiệm (= đã không thành lập chính phủ) trong nhiều năm."
                    },
                    {
                        "en": "The present government took office in 2017.",
                        "vi": "Chính phủ hiện tại nhậm chức vào năm 2017."
                    },
                    {
                        "en": "He died three years after leaving office.",
                        "vi": "Ông mất ba năm sau khi rời nhiệm sở."
                    },
                    {
                        "en": "She has announced she will not run for office again.",
                        "vi": "Cô đã tuyên bố sẽ không tái tranh cử."
                    },
                    {
                        "en": "He has never sought public office.",
                        "vi": "Anh ta chưa bao giờ tìm kiếm chức vụ công."
                    },
                    {
                        "en": "the office of something She held the office of treasurer for five years.",
                        "vi": "the office of something Cô ấy đã giữ chức vụ thủ quỹ trong năm năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "with somebody’s help",
                    "vi": "với sự giúp đỡ của ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41e251ca06cc414b8eda7e91c8132977",
        "word": "state",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/steɪt/",
            "us": "/steɪt/"
        },
        "nearby": [
            {
                "word": "stasis",
                "pos": "noun"
            },
            {
                "word": "stat",
                "pos": "noun"
            },
            {
                "word": "state",
                "pos": "noun"
            },
            {
                "word": "state",
                "pos": "adjective"
            },
            {
                "word": "state",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a country considered as an organized political community controlled by one government",
                    "vi": "một quốc gia được coi là một cộng đồng chính trị có tổ chức do một chính phủ kiểm soát"
                },
                "examples": [
                    {
                        "en": "the Baltic States",
                        "vi": "các quốc gia vùng Baltic"
                    },
                    {
                        "en": "European Union member states",
                        "vi": "Các quốc gia thành viên của Liên minh Châu Âu"
                    }
                ]
            },
            {
                "define": {
                    "en": "an organized political community forming part of a country",
                    "vi": "một cộng đồng chính trị có tổ chức tạo thành một phần của một quốc gia"
                },
                "examples": [
                    {
                        "en": "the states of Victoria and Western Australia",
                        "vi": "các bang Victoria và Tây Úc"
                    },
                    {
                        "en": "The hurricane swept across the southern states of the US.",
                        "vi": "Bão quét qua các bang miền nam nước Mỹ."
                    },
                    {
                        "en": "Both candidates have been campaigning in key battleground states.",
                        "vi": "Cả hai ứng cử viên đều đã vận động tranh cử ở các bang chiến trường quan trọng."
                    },
                    {
                        "en": "She decided to return to her home state of Ohio.",
                        "vi": "Cô quyết định trở về bang Ohio, quê hương của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the government of a country",
                    "vi": "chính phủ của một quốc gia"
                },
                "examples": [
                    {
                        "en": "matters/affairs of state",
                        "vi": "các vấn đề / công việc của nhà nước"
                    },
                    {
                        "en": "people who are financially dependent on the state",
                        "vi": "những người phụ thuộc tài chính vào nhà nước"
                    },
                    {
                        "en": "a state-owned company",
                        "vi": "một công ty nhà nước"
                    },
                    {
                        "en": "They wish to limit the power of the State.",
                        "vi": "Họ mong muốn hạn chế quyền lực của Nhà nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mental, emotional or physical condition that a person or thing is in",
                    "vi": "tình trạng tinh thần, cảm xúc hoặc thể chất mà một người hoặc một vật đang ở"
                },
                "examples": [
                    {
                        "en": "a confused mental state",
                        "vi": "một trạng thái tinh thần bối rối"
                    },
                    {
                        "en": "state of something a confused state of mind",
                        "vi": "trạng thái của một cái gì đó một trạng thái tâm trí bối rối"
                    },
                    {
                        "en": "anxieties about the state of the country’s economy",
                        "vi": "lo lắng về tình hình kinh tế đất nước"
                    },
                    {
                        "en": "The government has declared a state of emergency in the flooded regions.",
                        "vi": "Chính phủ đã ban bố tình trạng khẩn cấp ở các vùng bị lũ lụt."
                    },
                    {
                        "en": "Given the current state of knowledge, it will take years to find a solution.",
                        "vi": "Với tình trạng kiến thức hiện tại, sẽ mất nhiều năm để tìm ra lời giải."
                    },
                    {
                        "en": "A report condemned the state of prisoners' cells.",
                        "vi": "Một báo cáo đã lên án tình trạng các phòng giam của tù nhân."
                    },
                    {
                        "en": "in a… state water in a liquid state",
                        "vi": "ở trạng thái… nước ở trạng thái lỏng"
                    },
                    {
                        "en": "He was in a terrible state by the time he got home.",
                        "vi": "Anh ấy đã ở trong tình trạng khủng khiếp vào thời điểm anh ấy về đến nhà."
                    },
                    {
                        "en": "in a… state of something She was in a state of shock.",
                        "vi": "trong một… trạng thái gì đó Cô ấy đang ở trong tình trạng bị sốc."
                    },
                    {
                        "en": "The building is in a bad state of repair (= needs to be repaired).",
                        "vi": "Tòa nhà đang trong tình trạng sửa chữa tồi tệ (= cần được sửa chữa)."
                    },
                    {
                        "en": "He was in a state of permanent depression.",
                        "vi": "Anh rơi vào trạng thái trầm cảm vĩnh viễn."
                    },
                    {
                        "en": "in a … state to do something You're not in a fit state to drive.",
                        "vi": "trong trạng thái… để làm điều gì đó Bạn không ở trong trạng thái thích hợp để lái xe."
                    },
                    {
                        "en": "(British English, informal) Look at the state of you! You can't go out looking like that.",
                        "vi": "(Anh Anh, thân mật) Hãy nhìn vào trạng thái của bạn! Bạn không thể đi ra ngoài với vẻ ngoài như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the formal ceremonies connected with high levels of government or with kings and queens",
                    "vi": "các nghi lễ trang trọng liên quan đến các cấp chính quyền cao hoặc với các vị vua và hoàng hậu"
                },
                "examples": [
                    {
                        "en": "in state The president was driven in state through the streets.",
                        "vi": "trong tiểu bang Tổng thống đã được lái xe trong tiểu bang qua các đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "the United States of America",
                    "vi": "Hợp chủng quốc Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "I've never been to the States.",
                        "vi": "Tôi chưa bao giờ đến Hoa Kỳ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become excited or anxious",
                    "vi": "trở nên phấn khích hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "She was in a real state about her exams.",
                        "vi": "Cô ấy đang ở trong một trạng thái thực sự về các kỳ thi của mình."
                    },
                    {
                        "en": "He made a mistake and got into a terrible state about it.",
                        "vi": "Anh ấy đã mắc một sai lầm và rơi vào tình trạng tồi tệ về điều đó."
                    },
                    {
                        "en": "Jane was in a terrible state after losing her job.",
                        "vi": "Jane rơi vào tình trạng khủng khiếp sau khi mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dirty or untidy",
                    "vi": "bẩn thỉu hoặc không gọn gàng"
                },
                "examples": [
                    {
                        "en": "What a state this place is in!",
                        "vi": "Nơi này đang ở trạng thái nào!"
                    },
                    {
                        "en": "How did the carpet get into that state?",
                        "vi": "Làm thế nào mà tấm thảm vào trạng thái đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the Roman Catholic Church) having been forgiven by God for the wrong or evil things you have done",
                    "vi": "(trong Giáo hội Công giáo La Mã) đã được Chúa tha thứ cho những điều sai trái hoặc xấu xa bạn đã làm"
                },
                "examples": [
                    {
                        "en": "He died in a state of grace.",
                        "vi": "Anh ta chết trong tình trạng được ân sủng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation",
                    "vi": "một tình huống"
                },
                "examples": [
                    {
                        "en": "This state of affairs can no longer be ignored.",
                        "vi": "Tình trạng này không thể bỏ qua được nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the stage that has been reached in a process, etc. which has not yet been completed",
                    "vi": "giai đoạn đã đạt được trong một quy trình, v.v. vẫn chưa được hoàn thành"
                },
                "examples": [
                    {
                        "en": "What is the current state of play in the peace talks?",
                        "vi": "Tình trạng hiện tại của cuộc đàm phán hòa bình là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the score in a sports match, especially in cricket",
                    "vi": "điểm số trong một trận đấu thể thao, đặc biệt là môn cricket"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3a3a2350f6ee45b7b6a51209e9f7eb15",
        "word": "rule",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ruːl/",
            "us": "/ruːl/"
        },
        "nearby": [
            {
                "word": "Rule, Britannia!",
                "pos": ""
            },
            {
                "word": "rule",
                "pos": "noun"
            },
            {
                "word": "rule",
                "pos": "verb"
            },
            {
                "word": "rule book",
                "pos": "noun"
            },
            {
                "word": "ruled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to control and have authority over a country, a group of people, etc.",
                    "vi": "để kiểm soát và có thẩm quyền đối với một quốc gia, một nhóm người, v.v."
                },
                "examples": [
                    {
                        "en": "rule (something) At that time, King John ruled England.",
                        "vi": "cai trị (cái gì đó) Vào thời điểm đó, vua John cai trị nước Anh."
                    },
                    {
                        "en": "The city was ruled by rich and powerful nobles.",
                        "vi": "Thành phố được cai trị bởi các quý tộc giàu có và quyền lực."
                    },
                    {
                        "en": "The film is set in an imagined future in which machines rule the world.",
                        "vi": "Phim lấy bối cảnh trong một tương lai tưởng tượng, trong đó máy móc thống trị thế giới."
                    },
                    {
                        "en": "(figurative) Eighty million years ago, dinosaurs ruled the earth.",
                        "vi": "(nghĩa bóng) Tám mươi triệu năm trước, khủng long thống trị trái đất."
                    },
                    {
                        "en": "Charles I ruled for eleven years.",
                        "vi": "Charles tôi đã cai trị trong mười một năm."
                    },
                    {
                        "en": "(figurative) After the revolution, anarchy ruled.",
                        "vi": "(nghĩa bóng) Sau cách mạng, chế độ vô chính phủ cai trị."
                    },
                    {
                        "en": "rule over somebody/something She once ruled over a vast empire.",
                        "vi": "cai trị ai đó / cái gì đó Cô ấy đã từng cai trị cả một đế chế rộng lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the main thing that influences and controls somebody/something",
                    "vi": "trở thành điều chính ảnh hưởng và kiểm soát ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The pursuit of money ruled his life.",
                        "vi": "Việc theo đuổi tiền bạc đã cai trị cuộc đời anh."
                    },
                    {
                        "en": "We live in a society where we are ruled by the clock.",
                        "vi": "Chúng ta đang sống trong một xã hội mà chúng ta bị thống trị bởi đồng hồ."
                    },
                    {
                        "en": "Her whole life seemed to be ruled by fear.",
                        "vi": "Cả cuộc đời cô dường như bị cai trị bởi nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give an official decision about something",
                    "vi": "để đưa ra quyết định chính thức về điều gì đó"
                },
                "examples": [
                    {
                        "en": "rule on something The court will rule on the legality of the action.",
                        "vi": "phán quyết về điều gì đó Tòa án sẽ phán quyết về tính hợp pháp của hành động."
                    },
                    {
                        "en": "rule against/in favour of somebody/something The judge ruled against/in favour of the plaintiff.",
                        "vi": "phán quyết chống lại / ủng hộ ai đó / cái gì đó Thẩm phán đã ra phán quyết chống lại / ủng hộ nguyên đơn."
                    },
                    {
                        "en": "rule somebody/something + adj. The deal may be ruled illegal.",
                        "vi": "cai trị ai đó / cái gì đó + adj. Thỏa thuận này có thể bị coi là bất hợp pháp."
                    },
                    {
                        "en": "rule somebody/something to be/have something The deal was ruled to be illegal.",
                        "vi": "quy tắc ai đó / cái gì đó được / có cái gì đó Thỏa thuận đã được phán quyết là bất hợp pháp."
                    },
                    {
                        "en": "rule that… The court ruled that the women were unfairly dismissed.",
                        "vi": "quy định rằng… Tòa án đã phán quyết rằng những người phụ nữ bị sa thải một cách bất công."
                    },
                    {
                        "en": "it is ruled that… It was ruled that the women had been unfairly dismissed.",
                        "vi": "người ta phán quyết rằng… Người ta phán quyết rằng những người phụ nữ đã bị sa thải một cách bất công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to draw a straight line using something that has a hard straight edge",
                    "vi": "để vẽ một đường thẳng bằng cách sử dụng một cái gì đó có một cạnh thẳng cứng"
                },
                "examples": [
                    {
                        "en": "Rule a line at the end of every piece of work.",
                        "vi": "Quy tắc một dòng ở cuối mỗi tác phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep control over people by making them disagree with and fight each other, therefore not giving them the chance to join together and oppose you",
                    "vi": "để giữ quyền kiểm soát mọi người bằng cách khiến họ không đồng ý và chống lại nhau, do đó không cho họ cơ hội tham gia cùng nhau và chống lại bạn"
                },
                "examples": [
                    {
                        "en": "a policy of divide and rule",
                        "vi": "chính sách chia để trị"
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say that something is completely wrong or not worth considering, especially in a trial",
                    "vi": "để nói rằng có điều gì đó hoàn toàn sai hoặc không đáng được xem xét, đặc biệt là trong một phiên tòa"
                },
                "examples": [
                    {
                        "en": "The charges were thrown out of court.",
                        "vi": "Các cáo buộc đã được đưa ra khỏi tòa án."
                    },
                    {
                        "en": "Well that's my theory ruled out of court.",
                        "vi": "Đó là lý thuyết của tôi bị loại khỏi tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the most powerful member of a group",
                    "vi": "trở thành thành viên mạnh mẽ nhất của một nhóm"
                },
                "examples": [
                    {
                        "en": "Liverpool ruled the roost in English football for a decade.",
                        "vi": "Liverpool đã thống trị bóng đá Anh trong một thập kỷ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to control a person or a group of people very severely",
                    "vi": "kiểm soát một người hoặc một nhóm người rất nghiêm khắc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5722e961fb624e948356486329ab8320",
        "word": "ruler",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈruːlə(r)/",
            "us": "/ˈruːlər/"
        },
        "nearby": [
            {
                "word": "rule out",
                "pos": "phrasal verb"
            },
            {
                "word": "rule out of",
                "pos": "phrasal verb"
            },
            {
                "word": "ruler",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who rules or governs",
                    "vi": "một người cai trị hoặc quản lý"
                },
                "examples": [
                    {
                        "en": "He eventually became ruler over all Egypt.",
                        "vi": "Cuối cùng, ông trở thành người cai trị toàn bộ Ai Cập."
                    },
                    {
                        "en": "At that time the East India Company was the virtual ruler of Bengal.",
                        "vi": "Vào thời điểm đó, Công ty Đông Ấn là công ty thống trị ảo của Bengal."
                    },
                    {
                        "en": "The country was finally united under one ruler.",
                        "vi": "Đất nước cuối cùng đã được thống nhất dưới một người cai trị."
                    },
                    {
                        "en": "a ruler who held power for over twenty years",
                        "vi": "một người cai trị nắm quyền hơn hai mươi năm"
                    },
                    {
                        "en": "an absolute ruler who will tolerate no opposition",
                        "vi": "một người cai trị tuyệt đối, người sẽ không khoan nhượng với sự chống đối"
                    },
                    {
                        "en": "He established himself as ruler over both tribes.",
                        "vi": "Anh ta tự lập mình là người cai trị cả hai bộ tộc."
                    },
                    {
                        "en": "There was a successful coup against the country's military rulers.",
                        "vi": "Đã có một cuộc đảo chính thành công chống lại các nhà cầm quyền quân sự của đất nước."
                    },
                    {
                        "en": "Vietnam still had strong links with France, the former colonial ruler.",
                        "vi": "Việt Nam vẫn có mối liên hệ chặt chẽ với Pháp, nước cai trị thuộc địa cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a straight narrow piece of wood, plastic or metal, marked in centimetres or inches, used for measuring or for drawing straight lines",
                    "vi": "một mảnh gỗ, nhựa hoặc kim loại hẹp, thẳng, được đánh dấu bằng cm hoặc inch, được sử dụng để đo hoặc để vẽ các đường thẳng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0ca3c2f960542bb9458d2624942186a",
        "word": "state",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/steɪt/",
            "us": "/steɪt/"
        },
        "nearby": [
            {
                "word": "stat",
                "pos": "noun"
            },
            {
                "word": "state",
                "pos": "noun"
            },
            {
                "word": "state",
                "pos": "adjective"
            },
            {
                "word": "state",
                "pos": "verb"
            },
            {
                "word": "state capture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "provided or controlled by the government of a country",
                    "vi": "được cung cấp hoặc kiểm soát bởi chính phủ của một quốc gia"
                },
                "examples": [
                    {
                        "en": "state officials/agencies",
                        "vi": "quan chức / cơ quan nhà nước"
                    },
                    {
                        "en": "state education",
                        "vi": "giáo dục nhà nước"
                    },
                    {
                        "en": "families dependent on state benefits (= in Britain, money given by the government to people who are poor)",
                        "vi": "các gia đình phụ thuộc vào trợ cấp của nhà nước (= ở Anh, tiền do chính phủ cấp cho những người nghèo)"
                    },
                    {
                        "en": "state secrets (= information that could be harmful to a country if it were discovered by an enemy)",
                        "vi": "bí mật nhà nước (= thông tin có thể gây hại cho quốc gia nếu kẻ thù phát hiện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "provided or controlled by a particular state of a country, especially in the US",
                    "vi": "được cung cấp hoặc kiểm soát bởi một bang cụ thể của một quốc gia, đặc biệt là ở Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "the state government/legislature",
                        "vi": "chính quyền tiểu bang / cơ quan lập pháp"
                    },
                    {
                        "en": "California state law",
                        "vi": "Luật tiểu bang California"
                    },
                    {
                        "en": "a state prison/hospital/university",
                        "vi": "một nhà tù tiểu bang / bệnh viện / trường đại học"
                    },
                    {
                        "en": "state police/troopers",
                        "vi": "cảnh sát tiểu bang / quân đội"
                    },
                    {
                        "en": "a state tax",
                        "vi": "thuế tiểu bang"
                    },
                    {
                        "en": "federal and state government policies",
                        "vi": "chính sách của chính phủ liên bang và tiểu bang"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the leader of a country attending an official ceremony",
                    "vi": "kết nối với nhà lãnh đạo của một quốc gia tham dự một buổi lễ chính thức"
                },
                "examples": [
                    {
                        "en": "The queen is on a state visit to Berlin.",
                        "vi": "Nữ hoàng đang có chuyến thăm cấp nhà nước tới Berlin."
                    },
                    {
                        "en": "the state opening of Parliament",
                        "vi": "quốc hội khai mạc tiểu bang"
                    },
                    {
                        "en": "the state apartments (= used for official ceremonies)",
                        "vi": "các căn hộ của nhà nước (= được sử dụng cho các nghi lễ chính thức)"
                    }
                ]
            }
        ]
    },
    {
        "id": "04101393936d477aa38e65b1f5afce1c",
        "word": "town hall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌtaʊn ˈhɔːl/",
            "us": "/ˌtaʊn ˈhɔːl/"
        },
        "nearby": [
            {
                "word": "town crier",
                "pos": "noun"
            },
            {
                "word": "townee",
                "pos": "noun"
            },
            {
                "word": "town hall",
                "pos": "noun"
            },
            {
                "word": "town house",
                "pos": "noun"
            },
            {
                "word": "townie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building containing local government offices and, in the UK, usually a hall for public meetings, concerts, etc.",
                    "vi": "một tòa nhà chứa các văn phòng chính quyền địa phương và ở Vương quốc Anh, thường là hội trường dành cho các cuộc họp công cộng, các buổi hòa nhạc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "71fc1619ecc84d40bc4a8a530d25272d",
        "word": "agency",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeɪdʒənsi/",
            "us": "/ˈeɪdʒənsi/"
        },
        "nearby": [
            {
                "word": "age-long",
                "pos": "adjective"
            },
            {
                "word": "age-mate",
                "pos": "noun"
            },
            {
                "word": "agency",
                "pos": "noun"
            },
            {
                "word": "agenda",
                "pos": "noun"
            },
            {
                "word": "agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a business or an organization that provides a particular service especially when representing other businesses or organizations",
                    "vi": "một doanh nghiệp hoặc một tổ chức cung cấp một dịch vụ cụ thể, đặc biệt khi đại diện cho các doanh nghiệp hoặc tổ chức khác"
                },
                "examples": [
                    {
                        "en": "She works for an advertising agency.",
                        "vi": "Cô ấy làm việc cho một công ty quảng cáo."
                    },
                    {
                        "en": "through an agency He managed to find a job through an agency.",
                        "vi": "thông qua một cơ quan Anh ấy đã tìm được một công việc thông qua một cơ quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "a government department that provides a particular service",
                    "vi": "một cơ quan chính phủ cung cấp một dịch vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "law enforcement agencies",
                        "vi": "cơ quan thực thi pháp luật"
                    },
                    {
                        "en": "Some laboratories are operated by government agencies.",
                        "vi": "Một số phòng thí nghiệm được vận hành bởi các cơ quan chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of the action of somebody/something",
                    "vi": "là kết quả của hành động của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He obtained his position through the agency of an old friend.",
                        "vi": "Anh ta có được vị trí của mình thông qua cơ quan của một người bạn cũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e0f726e045141518963555e29d36cc4",
        "word": "budget",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbʌdʒɪt/",
            "us": "/ˈbʌdʒɪt/"
        },
        "nearby": [
            {
                "word": "budge",
                "pos": "verb"
            },
            {
                "word": "budgerigar",
                "pos": "noun"
            },
            {
                "word": "budget",
                "pos": "noun"
            },
            {
                "word": "budget",
                "pos": "verb"
            },
            {
                "word": "budget",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the money that is available to a person or an organization and a plan of how it will be spent over a period of time",
                    "vi": "số tiền có sẵn cho một người hoặc một tổ chức và kế hoạch về cách nó sẽ được chi tiêu trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "an annual budget of £10 million",
                        "vi": "ngân sách hàng năm là 10 triệu bảng Anh"
                    },
                    {
                        "en": "a balanced budget (= one where the amount spent matches the amount available)",
                        "vi": "ngân sách cân bằng (= ngân sách trong đó số tiền chi tiêu phù hợp với số tiền có sẵn)"
                    },
                    {
                        "en": "Many families struggle to balance the household budget.",
                        "vi": "Nhiều gia đình gặp khó khăn trong việc cân đối ngân sách gia đình."
                    },
                    {
                        "en": "to cut/slash a budget",
                        "vi": "cắt / giảm ngân sách"
                    },
                    {
                        "en": "the education/defence budget (= the amount of money that can be spent on this)",
                        "vi": "ngân sách giáo dục / quốc phòng (= số tiền có thể được chi cho việc này)"
                    },
                    {
                        "en": "an advertising budget of $2 million",
                        "vi": "ngân sách quảng cáo là 2 triệu đô la"
                    },
                    {
                        "en": "It's one of those big-budget Hollywood movies.",
                        "vi": "Đó là một trong những bộ phim kinh phí lớn của Hollywood."
                    },
                    {
                        "en": "on a budget We decorated the house on a tight budget (= without much money to spend).",
                        "vi": "về ngân sách Chúng tôi trang trí ngôi nhà với ngân sách eo hẹp (= không có nhiều tiền để chi tiêu)."
                    },
                    {
                        "en": "on/within budget The work was finished on time and within budget (= did not cost more money than was planned).",
                        "vi": "trên / trong ngân sách Công việc đã được hoàn thành đúng thời hạn và trong ngân sách (= không tốn nhiều tiền hơn kế hoạch)."
                    },
                    {
                        "en": "over budget They went over budget (= spent too much money).",
                        "vi": "vượt quá ngân sách Họ đã vượt quá ngân sách (= đã chi quá nhiều tiền)."
                    },
                    {
                        "en": "under/below budget The project came in under budget.",
                        "vi": "dưới / dưới ngân sách Dự án được cấp dưới ngân sách."
                    },
                    {
                        "en": "in the budget Is there any money left in the budget?",
                        "vi": "trong ngân sách Có còn tiền trong ngân sách không?"
                    },
                    {
                        "en": "The hospital now faces severe budget cuts.",
                        "vi": "Hiện bệnh viện đang phải đối mặt với tình trạng cắt giảm ngân sách nghiêm trọng."
                    },
                    {
                        "en": "a budget surplus/shortfall (= when there is more/less money than is needed)",
                        "vi": "thặng dư / thiếu hụt ngân sách (= khi có nhiều hơn / ít hơn mức cần thiết)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an official statement by the government of a country’s income from taxes, etc. and how it will be spent",
                    "vi": "tuyên bố chính thức của chính phủ về thu nhập từ thuế của một quốc gia, v.v. và cách chi tiêu"
                },
                "examples": [
                    {
                        "en": "Tax cuts are expected to be a major part of this year's Budget.",
                        "vi": "Cắt giảm thuế dự kiến sẽ là một phần chính của Ngân sách năm nay."
                    },
                    {
                        "en": "a budget deficit (= when the government spends more money than it earns)",
                        "vi": "thâm hụt ngân sách (= khi chính phủ chi nhiều tiền hơn số tiền kiếm được)"
                    },
                    {
                        "en": "The finance ministry is trying to reduce the budget deficit.",
                        "vi": "Bộ tài chính đang cố gắng giảm thâm hụt ngân sách."
                    },
                    {
                        "en": "Military spending accounts for around 17% of the federal budget.",
                        "vi": "Chi tiêu quân sự chiếm khoảng 17% ngân sách liên bang."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9d8e9b1571544edacf6ed14cca81816",
        "word": "council",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkaʊnsl/",
            "us": "/ˈkaʊnsl/"
        },
        "nearby": [
            {
                "word": "coulis",
                "pos": "noun"
            },
            {
                "word": "coulomb",
                "pos": "noun"
            },
            {
                "word": "council",
                "pos": "noun"
            },
            {
                "word": "council area",
                "pos": "noun"
            },
            {
                "word": "council chamber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who are elected to govern an area such as a city or county",
                    "vi": "một nhóm người được bầu để quản lý một khu vực chẳng hạn như thành phố hoặc quận"
                },
                "examples": [
                    {
                        "en": "a town council",
                        "vi": "một hội đồng thị trấn"
                    },
                    {
                        "en": "The decision still has to be ratified by the full council.",
                        "vi": "Quyết định vẫn phải được phê chuẩn bởi toàn thể hội đồng."
                    },
                    {
                        "en": "on the council She's on the local council.",
                        "vi": "trên hội đồng Cô ấy ở trong hội đồng địa phương."
                    },
                    {
                        "en": "He won a seat on the council in a by-election.",
                        "vi": "Ông đã giành được một ghế trong hội đồng trong một cuộc bầu cử phụ."
                    },
                    {
                        "en": "She has served on the council for four years.",
                        "vi": "Cô ấy đã phục vụ trong hội đồng trong bốn năm."
                    },
                    {
                        "en": "a member/meeting of the council",
                        "vi": "một thành viên / cuộc họp của hội đồng"
                    },
                    {
                        "en": "the leader of the council",
                        "vi": "lãnh đạo của hội đồng"
                    },
                    {
                        "en": "a council member/leader",
                        "vi": "một thành viên hội đồng / lãnh đạo"
                    },
                    {
                        "en": "a council meeting/chamber",
                        "vi": "một cuộc họp hội đồng / phòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the organization that provides services in a city or county, for example education, houses, libraries, etc.",
                    "vi": "tổ chức cung cấp dịch vụ ở một thành phố hoặc quận, ví dụ như giáo dục, nhà ở, thư viện, v.v."
                },
                "examples": [
                    {
                        "en": "Residents have complained to the council about the noise.",
                        "vi": "Cư dân đã phàn nàn với hội đồng về tiếng ồn."
                    },
                    {
                        "en": "She has been working for the council since March.",
                        "vi": "Cô ấy đã làm việc cho hội đồng từ tháng Ba."
                    },
                    {
                        "en": "Students should apply to their local council for a grant.",
                        "vi": "Sinh viên nên nộp đơn cho hội đồng địa phương của họ để được trợ cấp."
                    },
                    {
                        "en": "council workers/staff/officials/officers",
                        "vi": "nhân viên hội đồng / nhân viên / viên chức / viên chức"
                    },
                    {
                        "en": "cuts to council services",
                        "vi": "cắt giảm các dịch vụ hội đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people chosen to give advice, make rules, do research, provide money, etc.",
                    "vi": "một nhóm người được chọn để đưa ra lời khuyên, đưa ra quy tắc, nghiên cứu, cung cấp tiền, v.v."
                },
                "examples": [
                    {
                        "en": "the Medical Research Council",
                        "vi": "Hội đồng nghiên cứu y tế"
                    },
                    {
                        "en": "In Britain, the Arts Council gives grants to theatres.",
                        "vi": "Ở Anh, Hội đồng Nghệ thuật trao tài trợ cho các nhà hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "(especially in the past) a formal meeting to discuss what action to take in a particular situation",
                    "vi": "(đặc biệt là trong quá khứ) một cuộc họp chính thức để thảo luận về hành động cần thực hiện trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "The king held a council at Nottingham from 14 to 19 October 1330.",
                        "vi": "Nhà vua tổ chức một hội đồng tại Nottingham từ ngày 14 đến ngày 19 tháng 10 năm 1330."
                    }
                ]
            }
        ]
    },
    {
        "id": "e51d97e2f2474b0f9c8d6259c70a25c5",
        "word": "domestic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dəˈmestɪk/",
            "us": "/dəˈmestɪk/"
        },
        "nearby": [
            {
                "word": "domed",
                "pos": "adjective"
            },
            {
                "word": "the Domesday Book",
                "pos": ""
            },
            {
                "word": "domestic",
                "pos": "adjective"
            },
            {
                "word": "domestic",
                "pos": "noun"
            },
            {
                "word": "domestically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or inside a particular country; not foreign or international",
                    "vi": "của hoặc bên trong một quốc gia cụ thể; không phải nước ngoài hay quốc tế"
                },
                "examples": [
                    {
                        "en": "domestic affairs/politics",
                        "vi": "đối nội / chính trị"
                    },
                    {
                        "en": "Output consists of both exports and sales on the domestic market.",
                        "vi": "Sản lượng bao gồm cả xuất khẩu và bán hàng trên thị trường nội địa."
                    },
                    {
                        "en": "The US is unable to meet its domestic demand for steel in any given year.",
                        "vi": "Mỹ không thể đáp ứng nhu cầu thép trong nước trong bất kỳ năm nào."
                    },
                    {
                        "en": "English domestic law",
                        "vi": "Luật nội địa Anh"
                    },
                    {
                        "en": "He was a chief White House adviser on domestic policy.",
                        "vi": "Ông từng là cố vấn chính của Nhà Trắng về chính sách đối nội."
                    },
                    {
                        "en": "The election campaign has been focused mainly on domestic issues.",
                        "vi": "Chiến dịch tranh cử đã được tập trung chủ yếu vào các vấn đề trong nước."
                    },
                    {
                        "en": "domestic flights (= to and from places within a country)",
                        "vi": "chuyến bay nội địa (= đến và đi từ các địa điểm trong một quốc gia)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the home; connected with the home or family",
                    "vi": "được sử dụng trong gia đình; kết nối với nhà hoặc gia đình"
                },
                "examples": [
                    {
                        "en": "domestic appliances",
                        "vi": "đồ gia dụng"
                    },
                    {
                        "en": "the growing problem of domestic violence (= violence between members of the same family)",
                        "vi": "vấn đề ngày càng gia tăng của bạo lực gia đình (= bạo lực giữa các thành viên trong cùng một gia đình)"
                    },
                    {
                        "en": "a shocking tale of domestic abuse",
                        "vi": "một câu chuyện gây sốc về lạm dụng gia đình"
                    },
                    {
                        "en": "The vast majority of paid and unpaid domestic workers are women.",
                        "vi": "Phần lớn những người giúp việc gia đình được trả lương và không được trả lương là phụ nữ."
                    },
                    {
                        "en": "domestic chores",
                        "vi": "việc vặt trong nhà"
                    },
                    {
                        "en": "domestic service (= the work of a servant in a large house)",
                        "vi": "dịch vụ gia đình (= công việc của một người hầu trong một ngôi nhà lớn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "kept on farms or as pets; not wild",
                    "vi": "được nuôi trong trang trại hoặc làm vật nuôi; không hoang dã"
                },
                "examples": [
                    {
                        "en": "horses and other domestic animals",
                        "vi": "ngựa và các vật nuôi khác"
                    },
                    {
                        "en": "Most domestic cats hate getting wet.",
                        "vi": "Hầu hết mèo nhà đều ghét bị ướt."
                    }
                ]
            },
            {
                "define": {
                    "en": "liking home life; enjoying or good at cooking, cleaning the house, etc.",
                    "vi": "thích cuộc sống gia đình; thích nấu ăn, dọn dẹp nhà cửa, v.v."
                },
                "examples": [
                    {
                        "en": "I'm not a very domestic sort of person.",
                        "vi": "Tôi không phải là người thích nội trợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2e059938b07a410ab503272acf14ed84",
        "word": "govern",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡʌvn/",
            "us": "/ˈɡʌvərn/"
        },
        "nearby": [
            {
                "word": "gourmet",
                "pos": "noun"
            },
            {
                "word": "gout",
                "pos": "noun"
            },
            {
                "word": "govern",
                "pos": "verb"
            },
            {
                "word": "governance",
                "pos": "noun"
            },
            {
                "word": "governess",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to legally control a country or its people and be responsible for introducing new laws, organizing public services, etc.",
                    "vi": "để kiểm soát hợp pháp một quốc gia hoặc người dân của quốc gia đó và chịu trách nhiệm đưa ra các luật mới, tổ chức các dịch vụ công, v.v."
                },
                "examples": [
                    {
                        "en": "The country is governed by elected representatives of the people.",
                        "vi": "Đất nước được điều hành bởi các đại diện dân cử của nhân dân."
                    },
                    {
                        "en": "He accused the opposition party of being unfit to govern.",
                        "vi": "Ông cáo buộc đảng đối lập không đủ tư cách để cầm quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to control or influence somebody/something or how something happens, functions, etc.",
                    "vi": "để kiểm soát hoặc ảnh hưởng đến ai đó / điều gì đó hoặc cách điều gì đó xảy ra, chức năng, v.v."
                },
                "examples": [
                    {
                        "en": "We need changes in the law governing school attendance.",
                        "vi": "Chúng tôi cần những thay đổi trong luật quản lý việc đi học."
                    },
                    {
                        "en": "Prices are governed by market demand.",
                        "vi": "Giá cả bị chi phối bởi nhu cầu thị trường."
                    },
                    {
                        "en": "All his decisions have been entirely governed by self-interest.",
                        "vi": "Mọi quyết định của anh ấy hoàn toàn do tư lợi chi phối."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a word governs another word or phrase, it affects how that word or phrase is formed or used",
                    "vi": "nếu một từ chi phối một từ hoặc cụm từ khác, nó sẽ ảnh hưởng đến cách từ hoặc cụm từ đó được hình thành hoặc sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9689b9891f574368accb568e426109da",
        "word": "mass",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/mæs/",
            "us": "/mæs/"
        },
        "nearby": [
            {
                "word": "masquerade",
                "pos": "noun"
            },
            {
                "word": "masquerade",
                "pos": "verb"
            },
            {
                "word": "mass",
                "pos": "noun"
            },
            {
                "word": "mass",
                "pos": "adjective"
            },
            {
                "word": "mass",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large amount of a substance that does not have a definite shape or form",
                    "vi": "một lượng lớn chất không có hình dạng hoặc hình thức xác định"
                },
                "examples": [
                    {
                        "en": "She saw a large dark mass in the water.",
                        "vi": "Cô nhìn thấy một khối lớn sẫm màu trong nước."
                    },
                    {
                        "en": "The hill appeared as a black mass in the distance.",
                        "vi": "Ngọn đồi hiện ra như một khối đen phía xa."
                    },
                    {
                        "en": "mass of something a mass of snow and rocks falling down the mountain",
                        "vi": "khối thứ gì đó một khối tuyết và đá rơi xuống núi"
                    },
                    {
                        "en": "The sky was full of dark masses of clouds.",
                        "vi": "Bầu trời đầy những đám mây đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount or quantity of something",
                    "vi": "một số lượng lớn hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a mass of blonde hair",
                        "vi": "một khối tóc vàng"
                    },
                    {
                        "en": "I began sifting through the mass of evidence.",
                        "vi": "Tôi bắt đầu sàng lọc hàng loạt bằng chứng."
                    },
                    {
                        "en": "Both titles give readers a mass of information.",
                        "vi": "Cả hai tiêu đề đều cung cấp cho người đọc một lượng thông tin lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of people or things grouped together, often in a confused way",
                    "vi": "một số lượng lớn người hoặc mọi thứ được nhóm lại với nhau, thường theo cách nhầm lẫn"
                },
                "examples": [
                    {
                        "en": "I struggled through the mass of people to the exit.",
                        "vi": "Tôi cố gắng vượt qua hàng loạt người để đến lối ra."
                    },
                    {
                        "en": "The page was covered with a mass of figures.",
                        "vi": "Trang được bao phủ bởi một khối lượng lớn các số liệu."
                    },
                    {
                        "en": "a chaotic mass of ideas",
                        "vi": "một khối lượng ý tưởng hỗn loạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number or amount of something",
                    "vi": "một số lượng lớn hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were masses of people in the shops yesterday.",
                        "vi": "Có rất nhiều người trong các cửa hàng ngày hôm qua."
                    },
                    {
                        "en": "I've got masses of work to do.",
                        "vi": "Tôi có rất nhiều việc phải làm."
                    },
                    {
                        "en": "Don't give me any more. I've eaten masses!",
                        "vi": "Đừng cho tôi nữa. Tôi đã ăn hàng loạt!"
                    },
                    {
                        "en": "There is masses of cake left over from the party.",
                        "vi": "Có rất nhiều bánh còn lại từ bữa tiệc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ordinary people in society who are not leaders or who are considered to be not very well educated",
                    "vi": "những người bình thường trong xã hội, những người không phải là lãnh đạo hoặc những người được coi là không được giáo dục tốt"
                },
                "examples": [
                    {
                        "en": "government attempts to suppress dissatisfaction among the masses",
                        "vi": "chính phủ nỗ lực để trấn áp sự bất mãn trong quần chúng"
                    },
                    {
                        "en": "a TV programme that brings science to the masses",
                        "vi": "một chương trình truyền hình đưa khoa học đến với đại chúng"
                    },
                    {
                        "en": "the image of America with arms open wide to the world's huddled masses",
                        "vi": "hình ảnh nước Mỹ dang rộng vòng tay đón nhận khối đông tụ họp của thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most; the majority",
                    "vi": "nhiều nhất; đa số"
                },
                "examples": [
                    {
                        "en": "The reforms are unpopular with the mass of teachers and parents.",
                        "vi": "Các cải cách không được lòng đông đảo giáo viên và phụ huynh."
                    },
                    {
                        "en": "Their policies appeal to the broad mass of the population.",
                        "vi": "Các chính sách của họ thu hút đông đảo dân chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quantity of material that something contains",
                    "vi": "số lượng vật chất mà một thứ gì đó chứa"
                },
                "examples": [
                    {
                        "en": "calculating the mass of a planet",
                        "vi": "tính toán khối lượng của một hành tinh"
                    },
                    {
                        "en": "a mass of 46.3 kg",
                        "vi": "khối lượng 46,3 kg"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be full of or covered with something",
                    "vi": "đầy hoặc được bao phủ bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The rose bushes are a mass of flowers in June.",
                        "vi": "Những bụi hoa hồng là một khối lượng hoa vào tháng sáu."
                    },
                    {
                        "en": "Her arm was a mass of bruises.",
                        "vi": "Cánh tay cô là một đống vết bầm tím."
                    }
                ]
            }
        ]
    },
    {
        "id": "eaabe9349e184345aa5385dc168fd07b",
        "word": "rule",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ruːl/",
            "us": "/ruːl/"
        },
        "nearby": [
            {
                "word": "ruinously",
                "pos": "adverb"
            },
            {
                "word": "Rule, Britannia!",
                "pos": ""
            },
            {
                "word": "rule",
                "pos": "noun"
            },
            {
                "word": "rule",
                "pos": "verb"
            },
            {
                "word": "rule book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a statement of what may, must or must not be done in a particular situation or when playing a game",
                    "vi": "một tuyên bố về những gì có thể, phải hoặc không được thực hiện trong một tình huống cụ thể hoặc khi chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "She laid down strict rules for her tenants, including prompt payment of rent.",
                        "vi": "Cô đặt ra các quy tắc nghiêm ngặt cho những người thuê nhà của mình, bao gồm cả việc thanh toán tiền thuê nhanh chóng."
                    },
                    {
                        "en": "the rules of golf/tennis/football",
                        "vi": "luật chơi gôn / quần vợt / bóng đá"
                    },
                    {
                        "en": "to follow/obey a rule",
                        "vi": "tuân theo / tuân theo một quy tắc"
                    },
                    {
                        "en": "to break/violate a rule",
                        "vi": "phá vỡ / vi phạm một quy tắc"
                    },
                    {
                        "en": "to enforce/apply a rule",
                        "vi": "để thực thi / áp dụng một quy tắc"
                    },
                    {
                        "en": "You can't just change the rules to suit yourself.",
                        "vi": "Bạn không thể chỉ thay đổi các quy tắc để phù hợp với bản thân."
                    },
                    {
                        "en": "against the rules It's against all the rules and regulations.",
                        "vi": "chống lại các quy tắc Nó chống lại tất cả các quy tắc và quy định."
                    },
                    {
                        "en": "under… rules These products are banned under international rules.",
                        "vi": "theo… quy tắc Các sản phẩm này bị cấm theo các quy tắc quốc tế."
                    },
                    {
                        "en": "This explains the rules under which the library operates.",
                        "vi": "Điều này giải thích các quy tắc mà thư viện hoạt động."
                    },
                    {
                        "en": "the unwritten rules of adult society (= that everyone understands)",
                        "vi": "các quy tắc bất thành văn của xã hội người lớn (= mà mọi người đều hiểu)"
                    },
                    {
                        "en": "the rules of procedure/conduct (= saying how something must be done)",
                        "vi": "các quy tắc của thủ tục / hành vi (= nói một cái gì đó phải được thực hiện như thế nào)"
                    },
                    {
                        "en": "New rules governing pensions come into effect next year.",
                        "vi": "Các quy định mới về lương hưu sẽ có hiệu lực vào năm tới."
                    },
                    {
                        "en": "Normal competition rules apply.",
                        "vi": "Các quy tắc cạnh tranh bình thường được áp dụng."
                    },
                    {
                        "en": "according to the rules (of something) According to the rules of the game, you have to miss a turn.",
                        "vi": "Theo các quy tắc (của cái gì đó) Theo các quy tắc của trò chơi, bạn phải bỏ lỡ một lượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of what is possible according to a particular system, for example the grammar of a language",
                    "vi": "một tuyên bố về những gì có thể xảy ra theo một hệ thống cụ thể, ví dụ như ngữ pháp của một ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "the basic rules of grammar",
                        "vi": "các quy tắc cơ bản của ngữ pháp"
                    },
                    {
                        "en": "rule for doing something What is the rule for forming plurals?",
                        "vi": "Quy tắc để làm một cái gì đó Quy tắc để tạo thành số nhiều là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of what you are advised to do in a particular situation",
                    "vi": "một tuyên bố về những gì bạn được khuyên nên làm trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "The first rule is to make eye contact with your interviewer.",
                        "vi": "Quy tắc đầu tiên là giao tiếp bằng mắt với người phỏng vấn của bạn."
                    },
                    {
                        "en": "Follow these few simple rules and you won't go far wrong.",
                        "vi": "Hãy làm theo một số quy tắc đơn giản sau và bạn sẽ không mắc sai lầm."
                    },
                    {
                        "en": "rule for doing something There are no hard and fast rules for planning healthy meals.",
                        "vi": "Quy tắc để làm một việc gì đó Không có quy tắc cứng và nhanh nào để lên kế hoạch cho các bữa ăn lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a habit; the normal state of things; what is true in most cases",
                    "vi": "một thói quen; trạng thái bình thường của sự vật; điều gì là đúng trong hầu hết các trường hợp"
                },
                "examples": [
                    {
                        "en": "He makes it a rule never to borrow money.",
                        "vi": "Anh ấy đưa ra quy tắc không bao giờ được vay tiền."
                    },
                    {
                        "en": "Cold winters here are the exception rather than the rule (= are rare).",
                        "vi": "Mùa đông lạnh giá ở đây là ngoại lệ chứ không phải là quy luật (= rất hiếm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the government of a country or control of a group of people by a particular person, group or system",
                    "vi": "chính phủ của một quốc gia hoặc sự kiểm soát của một nhóm người bởi một người, một nhóm hoặc một hệ thống cụ thể"
                },
                "examples": [
                    {
                        "en": "military/civilian/democratic rule",
                        "vi": "quy tắc quân sự / dân sự / dân chủ"
                    },
                    {
                        "en": "The 1972 Act imposed direct rule from Westminster.",
                        "vi": "Đạo luật năm 1972 áp đặt quyền cai trị trực tiếp từ Westminster."
                    },
                    {
                        "en": "under… rule The country was still under colonial rule.",
                        "vi": "dưới sự… cai trị Đất nước vẫn còn bị thuộc địa."
                    },
                    {
                        "en": "majority rule (= government by the political party that most people have voted for)",
                        "vi": "quy tắc đa số (= chính phủ của đảng chính trị mà hầu hết mọi người đã bỏ phiếu)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a measuring instrument with a straight edge",
                    "vi": "một dụng cụ đo có cạnh thẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "usually but not always",
                    "vi": "thường nhưng không phải luôn luôn"
                },
                "examples": [
                    {
                        "en": "I go to bed early as a rule.",
                        "vi": "Tôi đi ngủ sớm như một quy luật."
                    },
                    {
                        "en": "As a general rule, vegetable oils are better for you than animal fats.",
                        "vi": "Theo nguyên tắc chung, dầu thực vật tốt cho bạn hơn mỡ động vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the rules to suit a particular person or situation",
                    "vi": "để thay đổi các quy tắc cho phù hợp với một người hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Couldn't they just bend the rules and let us in without a ticket?",
                        "vi": "Không lẽ họ chỉ bẻ cong các quy tắc và cho chúng tôi vào mà không có vé sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general",
                    "vi": "mọi người nói rằng một cái gì đó là ngoại lệ chứng tỏ quy tắc khi họ nói một cái gì đó có vẻ khác với tình huống bình thường, nhưng chúng có nghĩa là tình huống bình thường nói chung vẫn đúng."
                },
                "examples": [
                    {
                        "en": "Most electronics companies have not done well this year, but ours is the exception that proves the rule.",
                        "vi": "Hầu hết các công ty điện tử đều không đạt kết quả tốt trong năm nay, nhưng của chúng tôi là ngoại lệ chứng minh quy luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody plays by their own rules or makes other people play by their rules, they set the conditions for doing business or having a relationship",
                    "vi": "nếu ai đó chơi theo luật của riêng họ hoặc bắt người khác chơi theo luật của họ, họ đặt ra các điều kiện để kinh doanh hoặc có mối quan hệ"
                },
                "examples": [
                    {
                        "en": "If he wanted a loan he would have to play by the bank's rules.",
                        "vi": "Nếu anh ta muốn có một khoản vay, anh ta sẽ phải chơi theo luật của ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal fairly and honestly with people",
                    "vi": "đối xử công bằng và trung thực với mọi người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a practical method of doing or measuring something, usually based on past experience rather than on exact measurement",
                    "vi": "một phương pháp thực tế để thực hiện hoặc đo lường điều gì đó, thường dựa trên kinh nghiệm trong quá khứ hơn là dựa trên phép đo chính xác"
                },
                "examples": [
                    {
                        "en": "As a rule of thumb, you should cook a chicken for 20 minutes for each pound of weight.",
                        "vi": "Theo nguyên tắc chung, bạn nên nấu một con gà trong 20 phút cho mỗi pound trọng lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the standards of behaviour that most people accept or that actually operate in a particular area of life or business",
                    "vi": "các tiêu chuẩn hành vi mà hầu hết mọi người chấp nhận hoặc thực sự hoạt động trong một lĩnh vực cụ thể của cuộc sống hoặc kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to follow the rules of your job in a very strict way in order to cause delay, as a form of protest against your employer or your working conditions",
                    "vi": "tuân theo các quy tắc công việc của bạn một cách rất nghiêm ngặt để gây ra sự chậm trễ, như một hình thức phản đối chủ lao động hoặc điều kiện làm việc của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "12145ec207fa443e9d96afe2235bffef",
        "word": "secretary",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsekrətri/",
            "us": "/ˈsekrəteri/"
        },
        "nearby": [
            {
                "word": "secretarial",
                "pos": "adjective"
            },
            {
                "word": "secretariat",
                "pos": "noun"
            },
            {
                "word": "secretary",
                "pos": "noun"
            },
            {
                "word": "secretary bird",
                "pos": "noun"
            },
            {
                "word": "secretary general",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who works in an office, working for another person, dealing with mail and phone calls, keeping records, arranging meetings with people, etc.",
                    "vi": "một người làm việc trong văn phòng, làm việc cho người khác, giải quyết thư từ và điện thoại, lưu trữ hồ sơ, sắp xếp cuộc họp với mọi người, v.v."
                },
                "examples": [
                    {
                        "en": "a legal/medical secretary",
                        "vi": "một thư ký pháp lý / y tế"
                    },
                    {
                        "en": "the mayor's press secretary",
                        "vi": "thư ký báo chí của thị trưởng"
                    },
                    {
                        "en": "Please contact my secretary to make an appointment.",
                        "vi": "Vui lòng liên hệ với thư ký của tôi để đặt lịch hẹn."
                    },
                    {
                        "en": "secretary to somebody/something He is secretary to the board of governors.",
                        "vi": "thư ký cho ai đó / cái gì đó Anh ấy là thư ký cho hội đồng thống đốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official of a club, society, etc. who deals with mail, keeping records and making business arrangements",
                    "vi": "một quan chức của một câu lạc bộ, xã hội, v.v., người xử lý thư, lưu giữ hồ sơ và sắp xếp công việc"
                },
                "examples": [
                    {
                        "en": "the membership secretary",
                        "vi": "thư ký thành viên"
                    },
                    {
                        "en": "She served as club secretary for 25 years.",
                        "vi": "Cô từng là thư ký câu lạc bộ trong 25 năm."
                    },
                    {
                        "en": "The union's branch secretary said he hoped a solution would be found.",
                        "vi": "Bí thư chi đoàn cho biết ông hy vọng sẽ tìm ra giải pháp."
                    },
                    {
                        "en": "secretary to somebody/something secretary to the Jockey Club",
                        "vi": "thư ký cho ai đó / thư ký gì đó cho câu lạc bộ Jockey"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) the head of an important government department",
                    "vi": "(ở Anh) người đứng đầu một bộ quan trọng của chính phủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the head of a government department, chosen by the president",
                    "vi": "người đứng đầu một cơ quan chính phủ, được chọn bởi tổng thống"
                },
                "examples": [
                    {
                        "en": "Secretary of the Treasury",
                        "vi": "Thư ký của kho bạc"
                    },
                    {
                        "en": "She was deputy secretary of agriculture in the first Obama administration.",
                        "vi": "Bà từng là Phó Bộ trưởng Nông nghiệp trong chính quyền Obama đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "an assistant of a government minister, an ambassador, etc.",
                    "vi": "trợ lý của một bộ trưởng chính phủ, một đại sứ, v.v."
                },
                "examples": [
                    {
                        "en": "Ms Watson is a former parliamentary secretary to the Minister of Education.",
                        "vi": "Bà Watson là cựu thư ký quốc hội cho Bộ trưởng Bộ Giáo dục."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a2070003a9a49abab487b40fb1d174b",
        "word": "bureau",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbjʊərəʊ/",
            "us": "/ˈbjʊrəʊ/"
        },
        "nearby": [
            {
                "word": "burdensome",
                "pos": "adjective"
            },
            {
                "word": "burdock",
                "pos": "noun"
            },
            {
                "word": "bureau",
                "pos": "noun"
            },
            {
                "word": "bureaucracy",
                "pos": "noun"
            },
            {
                "word": "bureaucrat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a desk with drawers and usually a top that opens down to make a table to write on",
                    "vi": "bàn có ngăn kéo và thường là phần trên mở xuống để làm bàn viết"
                },
                "examples": [
                    {
                        "en": "There was just enough space for a fold-up bed, washstand and bureau.",
                        "vi": "Chỉ có đủ không gian cho một chiếc giường gấp, bệ rửa mặt và phòng làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of furniture with drawers (= parts like boxes built into it with handles on the front for pulling them out) for keeping clothes in",
                    "vi": "một món đồ nội thất có ngăn kéo (= các bộ phận như hộp được tích hợp sẵn với tay cầm ở mặt trước để kéo chúng ra) để đựng quần áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an office or organization that provides information on a particular subject",
                    "vi": "một văn phòng hoặc tổ chức cung cấp thông tin về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "She works for an employment bureau.",
                        "vi": "Cô ấy làm việc cho một văn phòng việc làm."
                    },
                    {
                        "en": "a convention bureau (= an office that provides information and services for people organizing conferences)",
                        "vi": "một văn phòng hội nghị (= một văn phòng cung cấp thông tin và dịch vụ cho những người tổ chức hội nghị)"
                    },
                    {
                        "en": "(especially North American English) a visitor’s bureau (= an office that provides information for tourists)",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) văn phòng dành cho khách (= văn phòng cung cấp thông tin cho khách du lịch)"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a government department or part of a government department",
                    "vi": "(ở Hoa Kỳ) một cơ quan chính phủ hoặc một bộ phận của cơ quan chính phủ"
                },
                "examples": [
                    {
                        "en": "the Federal Bureau of Investigation",
                        "vi": "Cục điều tra liên bang"
                    },
                    {
                        "en": "the US Bureau of Prisons",
                        "vi": "Cục trại giam Hoa Kỳ"
                    }
                ]
            }
        ]
    },
    {
        "id": "4d5b2cd521e346f5b25885f02816e179",
        "word": "bureaucracy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bjʊəˈrɒkrəsi/",
            "us": "/bjʊˈrɑːkrəsi/"
        },
        "nearby": [
            {
                "word": "burdock",
                "pos": "noun"
            },
            {
                "word": "bureau",
                "pos": "noun"
            },
            {
                "word": "bureaucracy",
                "pos": "noun"
            },
            {
                "word": "bureaucrat",
                "pos": "noun"
            },
            {
                "word": "bureaucratic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of official rules and ways of doing things that a government or an organization has, especially when these seem to be too complicated",
                    "vi": "hệ thống các quy tắc chính thức và cách thức thực hiện những việc mà một chính phủ hoặc một tổ chức có, đặc biệt là khi những quy tắc này dường như quá phức tạp"
                },
                "examples": [
                    {
                        "en": "unnecessary/excessive bureaucracy",
                        "vi": "quan liêu không cần thiết / quá mức"
                    },
                    {
                        "en": "We need to reduce paperwork and bureaucracy in the company.",
                        "vi": "Chúng ta cần giảm bớt các thủ tục giấy tờ và sự quan liêu trong công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of government in which there are a large number of state officials who are not elected; a country with such a system",
                    "vi": "một hệ thống chính quyền trong đó có một số lượng lớn các quan chức nhà nước không được bầu cử; một đất nước với một hệ thống như vậy"
                },
                "examples": [
                    {
                        "en": "the power of the state bureaucracy",
                        "vi": "quyền lực của bộ máy hành chính nhà nước"
                    },
                    {
                        "en": "We are living in a modern bureaucracy.",
                        "vi": "Chúng ta đang sống trong một bộ máy quan liêu hiện đại."
                    }
                ]
            }
        ]
    },
    {
        "id": "0d75dc00b68943bf9367b9f5d36950fb",
        "word": "cabinet",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkæbɪnət/",
            "us": "/ˈkæbɪnət/"
        },
        "nearby": [
            {
                "word": "cabin crew",
                "pos": "noun"
            },
            {
                "word": "cabin cruiser",
                "pos": "noun"
            },
            {
                "word": "cabinet",
                "pos": "noun"
            },
            {
                "word": "cabinetmaker",
                "pos": "noun"
            },
            {
                "word": "the Cabinet Office",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of senior members of a government that is responsible for advising and deciding on government policy",
                    "vi": "một nhóm các thành viên cấp cao của chính phủ chịu trách nhiệm tư vấn và quyết định về chính sách của chính phủ"
                },
                "examples": [
                    {
                        "en": "a cabinet meeting",
                        "vi": "một cuộc họp nội các"
                    },
                    {
                        "en": "(British English) a cabinet minister",
                        "vi": "(Anh Anh) một bộ trưởng nội các"
                    },
                    {
                        "en": "(British English) the shadow Cabinet (= the most important members of the opposition party)",
                        "vi": "(Tiếng Anh Anh) Nội các bóng tối (= các thành viên quan trọng nhất của đảng đối lập)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of furniture with doors, drawers and/or shelves, that is used for storing or showing things",
                    "vi": "một món đồ nội thất có cửa, ngăn kéo và / hoặc kệ, được sử dụng để lưu trữ hoặc trưng bày mọi thứ"
                },
                "examples": [
                    {
                        "en": "kitchen cabinets",
                        "vi": "tủ bếp"
                    },
                    {
                        "en": "a medicine cabinet",
                        "vi": "tủ thuốc"
                    },
                    {
                        "en": "The china was displayed in a glass cabinet.",
                        "vi": "Đồ sành được bày trong tủ kính."
                    }
                ]
            }
        ]
    },
    {
        "id": "8a484ee7f0154dbeb3bdb48b72982447",
        "word": "civil servant",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɪvl ˈsɜːvənt/",
            "us": "/ˌsɪvl ˈsɜːrvənt/"
        },
        "nearby": [
            {
                "word": "the Civil Rights Act of 1964",
                "pos": ""
            },
            {
                "word": "the civil rights movement",
                "pos": "noun"
            },
            {
                "word": "civil servant",
                "pos": "noun"
            },
            {
                "word": "the civil service",
                "pos": "noun"
            },
            {
                "word": "civil union",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who works in the civil service",
                    "vi": "một người làm việc trong ngành công vụ"
                },
                "examples": [
                    {
                        "en": "He’s a 35-year-old civil servant with two young children.",
                        "vi": "Anh ấy là một công chức 35 tuổi có hai con nhỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e60e875f9ce54a5c8549f7b777f39484",
        "word": "coalition",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkəʊəˈlɪʃn/",
            "us": "/ˌkəʊəˈlɪʃn/"
        },
        "nearby": [
            {
                "word": "coal gas",
                "pos": "noun"
            },
            {
                "word": "coalhouse",
                "pos": "noun"
            },
            {
                "word": "coalition",
                "pos": "noun"
            },
            {
                "word": "coalman",
                "pos": "noun"
            },
            {
                "word": "coal mine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a government formed by two or more political parties working together",
                    "vi": "một chính phủ được thành lập bởi hai hoặc nhiều đảng phái chính trị cùng làm việc"
                },
                "examples": [
                    {
                        "en": "The two parties have formed a coalition.",
                        "vi": "Hai bên đã thành lập một liên minh."
                    },
                    {
                        "en": "a two-party coalition",
                        "vi": "liên minh hai bên"
                    },
                    {
                        "en": "a coalition government",
                        "vi": "một chính phủ liên minh"
                    },
                    {
                        "en": "(in) coalition (with somebody) The two parties governed in coalition for four years.",
                        "vi": "(trong) liên minh (với ai đó) Hai bên điều hành trong liên minh trong bốn năm."
                    },
                    {
                        "en": "They didn't rule out coalition with the Social Democrats.",
                        "vi": "Họ không loại trừ liên minh với Đảng Dân chủ Xã hội."
                    },
                    {
                        "en": "coalition between A and B a coalition between the Socialists and Communists",
                        "vi": "liên minh giữa A và B liên minh giữa những người xã hội chủ nghĩa và những người cộng sản"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group formed by people from several different groups, especially political ones, agreeing to work together for a particular purpose",
                    "vi": "một nhóm được thành lập bởi những người thuộc một số nhóm khác nhau, đặc biệt là các nhóm chính trị, đồng ý làm việc cùng nhau cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "The network is a global coalition of environmental and consumer groups.",
                        "vi": "Mạng lưới này là một liên minh toàn cầu của các nhóm người tiêu dùng và môi trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f5c91315b15487a98bd806b6049856d",
        "word": "constitution",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒnstɪˈtjuːʃn/",
            "us": "/ˌkɑːnstɪˈtuːʃn/"
        },
        "nearby": [
            {
                "word": "constituent assembly",
                "pos": "noun"
            },
            {
                "word": "constitute",
                "pos": "verb"
            },
            {
                "word": "constitution",
                "pos": "noun"
            },
            {
                "word": "the USS Constitution",
                "pos": ""
            },
            {
                "word": "constitutional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of laws and basic principles that a state, a country or an organization is governed by",
                    "vi": "hệ thống luật và các nguyên tắc cơ bản mà một nhà nước, một quốc gia hoặc một tổ chức chịu sự quản lý của"
                },
                "examples": [
                    {
                        "en": "your right to vote under the constitution",
                        "vi": "quyền bầu cử của bạn theo hiến pháp"
                    },
                    {
                        "en": "According to the constitution…",
                        "vi": "Theo hiến pháp…"
                    },
                    {
                        "en": "to propose a new amendment to the Constitution",
                        "vi": "đề xuất sửa đổi Hiến pháp mới"
                    },
                    {
                        "en": "the South African Constitution",
                        "vi": "Hiến pháp Nam Phi"
                    },
                    {
                        "en": "A two-thirds majority is needed to amend the club’s constitution.",
                        "vi": "Đa số 2/3 là cần thiết để sửa đổi hiến pháp của câu lạc bộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the condition of a person’s body and how healthy it is",
                    "vi": "tình trạng cơ thể của một người và sức khỏe của nó như thế nào"
                },
                "examples": [
                    {
                        "en": "to have a healthy/strong/weak constitution",
                        "vi": "để có một hiến pháp lành mạnh / mạnh mẽ / yếu kém"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way something is formed or organized",
                    "vi": "cách một cái gì đó được hình thành hoặc tổ chức"
                },
                "examples": [
                    {
                        "en": "the genetic constitution of cells",
                        "vi": "cấu tạo di truyền của tế bào"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of forming something",
                    "vi": "hành động hình thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He recommended the constitution of a review committee.",
                        "vi": "Ông đề nghị hiến pháp của một ủy ban xem xét."
                    }
                ]
            }
        ]
    },
    {
        "id": "06a81c7b9c3843699f0614d8d25bf4ff",
        "word": "constitutional",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒnstɪˈtjuːʃənl/",
            "us": "/ˌkɑːnstɪˈtuːʃənl/"
        },
        "nearby": [
            {
                "word": "constitution",
                "pos": "noun"
            },
            {
                "word": "the USS Constitution",
                "pos": ""
            },
            {
                "word": "constitutional",
                "pos": "adjective"
            },
            {
                "word": "constitutional",
                "pos": "noun"
            },
            {
                "word": "Constitutional Court",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the constitution of a country or an organization",
                    "vi": "kết nối với hiến pháp của một quốc gia hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "constitutional government/reform",
                        "vi": "chính phủ hợp hiến / cải cách"
                    },
                    {
                        "en": "a constitutional amendment",
                        "vi": "sửa đổi hiến pháp"
                    },
                    {
                        "en": "She had long advocated constitutional reform.",
                        "vi": "Bà đã ủng hộ cải cách hiến pháp từ lâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowed or limited by the constitution of a country or an organization",
                    "vi": "được phép hoặc hạn chế bởi hiến pháp của một quốc gia hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "They can't pass this law. It's not constitutional.",
                        "vi": "Họ không thể thông qua luật này. Nó không hợp hiến."
                    },
                    {
                        "en": "constitutional rights",
                        "vi": "quyền hiến định"
                    },
                    {
                        "en": "a constitutional monarchy (= a country with a king or queen whose power is controlled by a set of laws and basic principles)",
                        "vi": "chế độ quân chủ lập hiến (= một quốc gia có vua hoặc nữ hoàng có quyền lực được kiểm soát bởi một bộ luật và các nguyên tắc cơ bản)"
                    }
                ]
            },
            {
                "define": {
                    "en": "related to the body’s ability to stay healthy, be strong and fight illness",
                    "vi": "liên quan đến khả năng của cơ thể để giữ sức khỏe, mạnh mẽ và chống lại bệnh tật"
                },
                "examples": [
                    {
                        "en": "constitutional remedies",
                        "vi": "các biện pháp hiến pháp"
                    }
                ]
            }
        ]
    },
    {
        "id": "f70c5b8f81eb4208a8ebed9b780bf8e3",
        "word": "constitutionally",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒnstɪˈtjuːʃənəli/",
            "us": "/ˌkɑːnstɪˈtuːʃənəli/"
        },
        "nearby": [
            {
                "word": "constitutionalism",
                "pos": "noun"
            },
            {
                "word": "constitutionality",
                "pos": "noun"
            },
            {
                "word": "constitutionally",
                "pos": "adverb"
            },
            {
                "word": "constitutional monarchy",
                "pos": "noun"
            },
            {
                "word": "constitutive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is connected with the constitution of a country or an organization",
                    "vi": "theo cách được kết nối với hiến pháp của một quốc gia hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "constitutionally guaranteed rights",
                        "vi": "các quyền được bảo đảm theo hiến pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is allowed or limited by the constitution of a country or an organization",
                    "vi": "theo cách được cho phép hoặc hạn chế bởi hiến pháp của một quốc gia hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "The police have an obligation to act constitutionally.",
                        "vi": "Cảnh sát có nghĩa vụ hành động theo hiến pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is connected with the body's ability to stay healthy, be strong, and fight illness",
                    "vi": "theo một cách có liên quan đến khả năng của cơ thể để giữ sức khỏe, cường tráng và chống lại bệnh tật"
                },
                "examples": [
                    {
                        "en": "He was much weakened constitutionally by the disease.",
                        "vi": "Ông ấy đã bị suy yếu nhiều về mặt hiến pháp vì căn bệnh này."
                    }
                ]
            }
        ]
    },
    {
        "id": "3d5fc4c39e714b21ab6e8d3d7037f3b9",
        "word": "crown",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kraʊn/",
            "us": "/kraʊn/"
        },
        "nearby": [
            {
                "word": "crowdsource",
                "pos": "verb"
            },
            {
                "word": "crowdsourcing",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "verb"
            },
            {
                "word": "Crown Agent",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object in the shape of a circle, usually made of gold and precious stones, that a king or queen wears on his or her head on official occasions",
                    "vi": "một vật có dạng hình tròn, thường được làm bằng vàng và đá quý, mà vua hoặc hoàng hậu đội trên đầu trong những dịp chính thức"
                },
                "examples": [
                    {
                        "en": "The crown was placed upon the new monarch's head.",
                        "vi": "Vương miện được đặt trên đầu của quốc vương mới."
                    },
                    {
                        "en": "the emperor's jewel-encrusted crown",
                        "vi": "vương miện nạm ngọc của hoàng đế"
                    }
                ]
            },
            {
                "define": {
                    "en": "the government of a country, thought of as being represented by a king or queen",
                    "vi": "chính phủ của một quốc gia, được coi là được đại diện bởi vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "land owned by the Crown",
                        "vi": "đất thuộc sở hữu của Crown"
                    },
                    {
                        "en": "a Minister of the Crown",
                        "vi": "một Bộ trưởng của Vương miện"
                    },
                    {
                        "en": "Who's appearing for the Crown (= bringing a criminal charge against somebody on behalf of the state) in this case?",
                        "vi": "Ai sẽ xuất hiện vì Crown (= thay mặt tiểu bang đưa ra cáo buộc hình sự đối với ai đó) trong trường hợp này?"
                    },
                    {
                        "en": "a piece of Crown land",
                        "vi": "một mảnh đất Crown"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position or power of a king or queen",
                    "vi": "vị trí hoặc quyền lực của một vị vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "She refused the crown (= refused to become queen).",
                        "vi": "Cô ấy từ chối vương miện (= từ chối trở thành nữ hoàng)."
                    },
                    {
                        "en": "his claim to the French crown",
                        "vi": "tuyên bố của anh ấy đối với vương miện Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a circle of flowers, leaves, etc. that is worn on somebody’s head, sometimes as a sign of victory",
                    "vi": "một vòng hoa, lá, v.v. được đội trên đầu ai đó, đôi khi là dấu hiệu của chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the position of winning a sports competition",
                    "vi": "vị trí chiến thắng trong một cuộc thi thể thao"
                },
                "examples": [
                    {
                        "en": "She is determined to retain her Wimbledon crown.",
                        "vi": "Cô quyết tâm giữ lại vương miện Wimbledon của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top part of the head or a hat",
                    "vi": "phần trên của đầu hoặc một chiếc mũ"
                },
                "examples": [
                    {
                        "en": "There were raindrops on his bald crown.",
                        "vi": "Có những hạt mưa trên vương miện hói của anh ta."
                    },
                    {
                        "en": "She swept her hair into a bun at the crown of her head.",
                        "vi": "Cô búi tóc thành búi cao trên đỉnh đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest part of something",
                    "vi": "phần cao nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the crown of a hill",
                        "vi": "vương miện của một ngọn đồi"
                    },
                    {
                        "en": "from the crown of the final bend",
                        "vi": "từ đỉnh của khúc cua cuối cùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a plant just above and below the ground",
                    "vi": "phần của cây ngay trên và dưới mặt đất"
                },
                "examples": [
                    {
                        "en": "Roses bloom on shoots that sprout from the crown of the mother plant.",
                        "vi": "Hoa hồng nở trên các chồi mọc ra từ ngọn của cây mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of a tree or other plant",
                    "vi": "ngọn cây hoặc cây khác"
                },
                "examples": [
                    {
                        "en": "Nests were built high in the crowns of trees.",
                        "vi": "Tổ được xây cao trên những tán cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial cover for a damaged tooth",
                    "vi": "một vỏ bọc nhân tạo cho một chiếc răng bị hư hỏng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of the tooth that is above the gum",
                    "vi": "phần răng ở trên nướu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "anything in the shape of a crown, especially as a decoration or a badge",
                    "vi": "bất cứ thứ gì có hình vương miện, đặc biệt là đồ trang trí hoặc huy hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit of money in several European countries",
                    "vi": "một đơn vị tiền ở một số nước Châu Âu"
                },
                "examples": [
                    {
                        "en": "Czech crowns",
                        "vi": "Mão Czech"
                    }
                ]
            },
            {
                "define": {
                    "en": "an old British coin worth five shillings (= now 25p)",
                    "vi": "một đồng xu cũ của Anh trị giá năm shilling (= bây giờ là 25p)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most attractive or valuable part of something",
                    "vi": "phần hấp dẫn hoặc giá trị nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The Knightsbridge branch is the jewel in the crown of a 500-strong chain of stores.",
                        "vi": "Chi nhánh Knightsbridge là viên ngọc quý trên vương miện của chuỗi 500 cửa hàng lớn mạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f455bf5dca44fbb8a86b70f79c30804",
        "word": "ministry",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɪnɪstri/",
            "us": "/ˈmɪnɪstri/"
        },
        "nearby": [
            {
                "word": "minister to",
                "pos": "phrasal verb"
            },
            {
                "word": "ministrations",
                "pos": "noun"
            },
            {
                "word": "ministry",
                "pos": "noun"
            },
            {
                "word": "the Ministry of Defence",
                "pos": ""
            },
            {
                "word": "the Ministry of Housing, Communities and Local Government",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a government department that has a particular area of responsibility",
                    "vi": "một cơ quan chính phủ có một lĩnh vực phụ trách cụ thể"
                },
                "examples": [
                    {
                        "en": "The Ministry of Defence has issued the following statement.",
                        "vi": "Bộ Quốc phòng đã đưa ra tuyên bố sau đây."
                    },
                    {
                        "en": "A ministry spokesperson defended the measures.",
                        "vi": "Một phát ngôn viên của Bộ đã bảo vệ các biện pháp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "ministers of religion, especially Protestant ministers, when they are mentioned as a group",
                    "vi": "các bộ trưởng tôn giáo, đặc biệt là các bộ trưởng Tin lành, khi họ được đề cập đến như một nhóm"
                },
                "examples": [
                    {
                        "en": "He was an excellent candidate for the Baptist ministry.",
                        "vi": "Ông là một ứng cử viên xuất sắc cho chức vụ Baptist."
                    }
                ]
            },
            {
                "define": {
                    "en": "the spiritual work or service of a Christian or group of Christians; the period of time spent serving the Church",
                    "vi": "công việc hoặc sự phục vụ thuộc linh của một Cơ đốc nhân hoặc một nhóm Cơ đốc nhân; khoảng thời gian phục vụ Giáo hội"
                },
                "examples": [
                    {
                        "en": "The church provides a valuable ministry to a growing population.",
                        "vi": "Hội thánh cung cấp một chức vụ có giá trị cho dân số ngày càng tăng."
                    }
                ]
            }
        ]
    },
    {
        "id": "90f806658961487e8047adad7ee2ec27",
        "word": "policymaker",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpɒləsimeɪkə(r)/",
            "us": "/ˈpɑːləsimeɪkər/"
        },
        "nearby": [
            {
                "word": "policy",
                "pos": "noun"
            },
            {
                "word": "policyholder",
                "pos": "noun"
            },
            {
                "word": "policymaker",
                "pos": "noun"
            },
            {
                "word": "policymaking",
                "pos": "noun"
            },
            {
                "word": "polio",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is responsible for or involved in developing plans of action for a political party, business, etc.",
                    "vi": "một người chịu trách nhiệm hoặc tham gia vào việc phát triển các kế hoạch hành động cho một đảng chính trị, doanh nghiệp, v.v."
                },
                "examples": [
                    {
                        "en": "Policymakers should consider the evidence on the law's potential economic impact.",
                        "vi": "Các nhà hoạch định chính sách nên xem xét các bằng chứng về tác động kinh tế tiềm tàng của luật."
                    }
                ]
            }
        ]
    },
    {
        "id": "18f9de2bad5d449dbd891be1e5cbd729",
        "word": "policymaking",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpɒləsimeɪkɪŋ/",
            "us": "/ˈpɑːləsimeɪkɪŋ/"
        },
        "nearby": [
            {
                "word": "policyholder",
                "pos": "noun"
            },
            {
                "word": "policymaker",
                "pos": "noun"
            },
            {
                "word": "policymaking",
                "pos": "noun"
            },
            {
                "word": "polio",
                "pos": "noun"
            },
            {
                "word": "polish",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of developing plans of action for a political party, business, etc.",
                    "vi": "quá trình phát triển các kế hoạch hành động của một đảng chính trị, doanh nghiệp, v.v."
                },
                "examples": [
                    {
                        "en": "Reducing government debt has been the dominant trend in economic policymaking for the last 30 years.",
                        "vi": "Giảm nợ chính phủ là xu hướng chủ đạo trong hoạch định chính sách kinh tế trong 30 năm qua."
                    },
                    {
                        "en": "Research on social and economic trends contributes to evidence-based policymaking.",
                        "vi": "Nghiên cứu về các xu hướng xã hội và kinh tế góp phần vào việc hoạch định chính sách dựa trên bằng chứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "d16794ee683743998b189d8350350473",
        "word": "regime change",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/reɪˈʒiːm tʃeɪndʒ/",
            "us": "/reɪˈʒiːm tʃeɪndʒ/"
        },
        "nearby": [
            {
                "word": "regicide",
                "pos": "noun"
            },
            {
                "word": "regime",
                "pos": "noun"
            },
            {
                "word": "regime change",
                "pos": "noun"
            },
            {
                "word": "regimen",
                "pos": "noun"
            },
            {
                "word": "regiment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the situation when one government is replaced by another, especially using military force",
                    "vi": "tình huống khi một chính phủ bị thay thế bởi một chính phủ khác, đặc biệt là sử dụng lực lượng quân sự"
                },
                "examples": [
                    {
                        "en": "The invasion was part of an attempt to bring about regime change in the country.",
                        "vi": "Cuộc xâm lược là một phần của nỗ lực nhằm thay đổi chế độ trong nước."
                    },
                    {
                        "en": "Thousands of people went out onto the streets, demanding a regime change.",
                        "vi": "Hàng ngàn người đã xuống đường, đòi thay đổi chế độ."
                    }
                ]
            }
        ]
    },
    {
        "id": "af7b776747c941fc959b5ecb6f4630fe",
        "word": "ruling",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈruːlɪŋ/",
            "us": "/ˈruːlɪŋ/"
        },
        "nearby": [
            {
                "word": "rule out of",
                "pos": "phrasal verb"
            },
            {
                "word": "ruler",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "adjective"
            },
            {
                "word": "rum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official decision made by somebody in a position of authority, especially a judge",
                    "vi": "một quyết định chính thức được đưa ra bởi một người nào đó ở vị trí có thẩm quyền, đặc biệt là một thẩm phán"
                },
                "examples": [
                    {
                        "en": "The court will make its ruling on the case next week.",
                        "vi": "Tòa án sẽ đưa ra phán quyết về vụ việc vào tuần tới."
                    },
                    {
                        "en": "The company intends to appeal against the ruling that it was negligent.",
                        "vi": "Công ty dự định sẽ kháng cáo lại phán quyết cho rằng họ đã cẩu thả."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e8a1a2b676442eb9ba311d03a7cb714",
        "word": "autonomous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːˈtɒnəməs/",
            "us": "/ɔːˈtɑːnəməs/"
        },
        "nearby": [
            {
                "word": "automotive",
                "pos": "adjective"
            },
            {
                "word": "autonomic nervous system",
                "pos": "noun"
            },
            {
                "word": "autonomous",
                "pos": "adjective"
            },
            {
                "word": "autonomously",
                "pos": "adverb"
            },
            {
                "word": "autonomy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to govern itself or control its own affairs",
                    "vi": "có khả năng tự quản lý hoặc kiểm soát công việc của chính mình"
                },
                "examples": [
                    {
                        "en": "an autonomous republic/state/province",
                        "vi": "một nước cộng hòa tự trị / tiểu bang / tỉnh"
                    },
                    {
                        "en": "a federation of autonomous groups",
                        "vi": "một liên đoàn của các nhóm tự trị"
                    },
                    {
                        "en": "Higher education is relatively autonomous from the government.",
                        "vi": "Giáo dục đại học tương đối tự chủ từ chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to do things and make decisions without help from anyone else",
                    "vi": "có thể làm mọi việc và đưa ra quyết định mà không cần bất kỳ ai khác giúp đỡ"
                },
                "examples": [
                    {
                        "en": "Teachers aim to help children become autonomous learners.",
                        "vi": "Giáo viên hướng tới việc giúp trẻ trở thành người học tự chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "that has the technology to drive itself without a person in control",
                    "vi": "có công nghệ tự lái xe mà không cần người kiểm soát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a925a07767b14a7ea00125de30c958cd",
        "word": "bureaucrat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbjʊərəkræt/",
            "us": "/ˈbjʊrəkræt/"
        },
        "nearby": [
            {
                "word": "bureau",
                "pos": "noun"
            },
            {
                "word": "bureaucracy",
                "pos": "noun"
            },
            {
                "word": "bureaucrat",
                "pos": "noun"
            },
            {
                "word": "bureaucratic",
                "pos": "adjective"
            },
            {
                "word": "bureaucratically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official working in an organization or a government department, especially one who follows the rules of the department too strictly",
                    "vi": "một quan chức làm việc trong một tổ chức hoặc một bộ của chính phủ, đặc biệt là một người tuân thủ các quy tắc của bộ quá nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "He was just another faceless bureaucrat.",
                        "vi": "Anh ta chỉ là một quan chức vô danh khác."
                    },
                    {
                        "en": "battles between political appointees and career bureaucrats",
                        "vi": "trận chiến giữa những người được bổ nhiệm chính trị và những quan chức sự nghiệp"
                    },
                    {
                        "en": "We got caught up in the endless red tape of local bureaucrats.",
                        "vi": "Chúng tôi bị cuốn vào băng đỏ bất tận của các quan chức địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "99707333d0384b5191fbbf3bc6fc3ca4",
        "word": "the civil service",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌsɪvl ˈsɜːvɪs/",
            "us": "/ðə ˌsɪvl ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "the civil rights movement",
                "pos": "noun"
            },
            {
                "word": "civil servant",
                "pos": "noun"
            },
            {
                "word": "the civil service",
                "pos": "noun"
            },
            {
                "word": "civil union",
                "pos": "noun"
            },
            {
                "word": "civil war",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the government departments in a country and the people who work for them, except the armed forces, judges and elected politicians",
                    "vi": "các cơ quan chính phủ ở một quốc gia và những người làm việc cho họ, ngoại trừ lực lượng vũ trang, thẩm phán và các chính trị gia được bầu chọn"
                },
                "examples": [
                    {
                        "en": "He had a long career in the civil service.",
                        "vi": "Ông đã có một thời gian dài trong sự nghiệp dân sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ac813cb068a4250924c7ba05770ca63",
        "word": "commissioner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈmɪʃənə(r)/",
            "us": "/kəˈmɪʃənər/"
        },
        "nearby": [
            {
                "word": "commissionaire",
                "pos": "noun"
            },
            {
                "word": "commissioned officer",
                "pos": "noun"
            },
            {
                "word": "commissioner",
                "pos": "noun"
            },
            {
                "word": "commissioner for oaths",
                "pos": "noun"
            },
            {
                "word": "the Commission for Racial Equality",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of a commission (= an official group of people who are responsible for controlling something or finding out about something)",
                    "vi": "thành viên của một ủy ban (= một nhóm chính thức gồm những người chịu trách nhiệm kiểm soát điều gì đó hoặc tìm hiểu về điều gì đó)"
                },
                "examples": [
                    {
                        "en": "the Church Commissioners (= the group of people responsible for controlling the financial affairs of the Church of England)",
                        "vi": "các Ủy viên của Giáo hội (= nhóm người chịu trách nhiệm kiểm soát các vấn đề tài chính của Giáo hội Anh)"
                    },
                    {
                        "en": "European Commissioners",
                        "vi": "Ủy viên Châu Âu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the head of a particular police force in some countries",
                    "vi": "người đứng đầu một lực lượng cảnh sát cụ thể ở một số quốc gia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the head of a government department in some countries",
                    "vi": "người đứng đầu cơ quan chính phủ ở một số quốc gia"
                },
                "examples": [
                    {
                        "en": "the agriculture/health, etc. commissioner",
                        "vi": "ủy viên nông nghiệp / y tế, v.v."
                    },
                    {
                        "en": "Commissioner Rhodes was unavailable for comment.",
                        "vi": "Ủy viên Rhodes không có bình luận."
                    },
                    {
                        "en": "The Economic Affairs Commissioner, Albert Johnson, resigned over the issue.",
                        "vi": "Ủy viên các vấn đề kinh tế, Albert Johnson, đã từ chức về vấn đề này."
                    },
                    {
                        "en": "The merger has been referred to the European Competition Commissioner.",
                        "vi": "Việc sáp nhập đã được chuyển đến Ủy viên Cạnh tranh Châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) an official chosen by a sports association to control it",
                    "vi": "(ở Mỹ) một quan chức được hiệp hội thể thao chọn để kiểm soát nó"
                },
                "examples": [
                    {
                        "en": "the baseball commissioner",
                        "vi": "ủy viên bóng chày"
                    },
                    {
                        "en": "a commissioner for the Central Collegiate Hockey Association",
                        "vi": "một ủy viên của Hiệp hội Khúc côn cầu Đại học Trung ương"
                    }
                ]
            }
        ]
    },
    {
        "id": "aa0978438eeb4e34b1e9c29f725216aa",
        "word": "communiqué",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈmjuːnɪkeɪ/",
            "us": "/kəˌmjuːnəˈkeɪ/"
        },
        "nearby": [
            {
                "word": "communicator",
                "pos": "noun"
            },
            {
                "word": "communion",
                "pos": "noun"
            },
            {
                "word": "communiqué",
                "pos": "noun"
            },
            {
                "word": "communism",
                "pos": "noun"
            },
            {
                "word": "communist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official statement or report, especially to newspapers",
                    "vi": "một tuyên bố hoặc báo cáo chính thức, đặc biệt là báo chí"
                },
                "examples": [
                    {
                        "en": "The leaders attending the conference have issued a joint communiqué.",
                        "vi": "Các nhà lãnh đạo tham dự hội nghị đã ra thông cáo chung."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba7e30b6651d48609b5c4e650d697440",
        "word": "corporation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɔːpəˈreɪʃn/",
            "us": "/ˌkɔːrpəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "corporate responsibility",
                "pos": "noun"
            },
            {
                "word": "corporate welfare",
                "pos": "noun"
            },
            {
                "word": "corporation",
                "pos": "noun"
            },
            {
                "word": "corporation tax",
                "pos": "noun"
            },
            {
                "word": "corporatism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large business company",
                    "vi": "một công ty kinh doanh lớn"
                },
                "examples": [
                    {
                        "en": "multinational corporations",
                        "vi": "tập đoàn đa quốc gia"
                    },
                    {
                        "en": "the Chrysler corporation",
                        "vi": "tập đoàn Chrysler"
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a group of organizations that is recognized by law as a single unit",
                    "vi": "một tổ chức hoặc một nhóm các tổ chức được pháp luật công nhận là một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "urban development corporations",
                        "vi": "tập đoàn phát triển đô thị"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people elected to govern a large town or city and provide public services",
                    "vi": "một nhóm người được bầu để quản lý một thị trấn hoặc thành phố lớn và cung cấp các dịch vụ công cộng"
                },
                "examples": [
                    {
                        "en": "the Lord Mayor and Corporation of the City of London",
                        "vi": "Thị trưởng và Tổng công ty của Thành phố Luân Đôn"
                    }
                ]
            }
        ]
    },
    {
        "id": "07759414098a4408a48c3b2d1bbbc454",
        "word": "destabilize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiːˈsteɪbəlaɪz/",
            "us": "/ˌdiːˈsteɪbəlaɪz/"
        },
        "nearby": [
            {
                "word": "dessert wine",
                "pos": "noun"
            },
            {
                "word": "destabilization",
                "pos": "noun"
            },
            {
                "word": "destabilize",
                "pos": "verb"
            },
            {
                "word": "destination",
                "pos": "noun"
            },
            {
                "word": "destination",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a system, country, government, etc. become less well established or successful",
                    "vi": "để làm cho một hệ thống, quốc gia, chính phủ, v.v. trở nên ít được thiết lập hoặc thành công hơn"
                },
                "examples": [
                    {
                        "en": "Terrorist attacks were threatening to destabilize the government.",
                        "vi": "Các cuộc tấn công khủng bố đe dọa làm mất ổn định chính phủ."
                    },
                    {
                        "en": "The news had a destabilizing effect on the stock market.",
                        "vi": "Tin tức này đã gây bất ổn cho thị trường chứng khoán."
                    }
                ]
            }
        ]
    },
    {
        "id": "19299679544e44d688e3bbcc6a2ed8b0",
        "word": "the executive branch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ði ɪɡˈzekjətɪv brɑːntʃ/",
            "us": "/ði ɪɡˈzekjətɪv bræntʃ/"
        },
        "nearby": [
            {
                "word": "executive",
                "pos": "noun"
            },
            {
                "word": "executive",
                "pos": "adjective"
            },
            {
                "word": "the executive branch",
                "pos": "noun"
            },
            {
                "word": "executive director",
                "pos": "noun"
            },
            {
                "word": "executive order",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the part of the government that is controlled by the president",
                    "vi": "(ở Mỹ) bộ phận của chính phủ do tổng thống kiểm soát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5ace7e1e563240238c57c1cd1f93b394",
        "word": "executive order",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪɡˌzekjətɪv ˈɔːdə(r)/",
            "us": "/ɪɡˌzekjətɪv ˈɔːrdər/"
        },
        "nearby": [
            {
                "word": "the executive branch",
                "pos": "noun"
            },
            {
                "word": "executive director",
                "pos": "noun"
            },
            {
                "word": "executive order",
                "pos": "noun"
            },
            {
                "word": "executive privilege",
                "pos": "noun"
            },
            {
                "word": "executive secretary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official order from the president that becomes the law",
                    "vi": "lệnh chính thức từ tổng thống trở thành luật"
                },
                "examples": [
                    {
                        "en": "Yesterday the president issued an executive order to change the nation’s immigration laws.",
                        "vi": "Hôm qua, tổng thống đã ban hành một lệnh hành pháp để thay đổi luật nhập cư của quốc gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "b59573195be3402ca8add6aa0b68618c",
        "word": "executive privilege",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪɡˌzekjətɪv ˈprɪvəlɪdʒ/",
            "us": "/ɪɡˌzekjətɪv ˈprɪvəlɪdʒ/"
        },
        "nearby": [
            {
                "word": "executive director",
                "pos": "noun"
            },
            {
                "word": "executive order",
                "pos": "noun"
            },
            {
                "word": "executive privilege",
                "pos": "noun"
            },
            {
                "word": "executive secretary",
                "pos": "noun"
            },
            {
                "word": "executive summary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the right of the president and the executive part of the government to keep official documents secret",
                    "vi": "(ở Mỹ) quyền của tổng thống và bộ phận hành pháp của chính phủ giữ bí mật các tài liệu chính thức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f0ba59b92114604934b17a69d04cbb3",
        "word": "the Home Office",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈhəʊm ɒfɪs/",
            "us": "/ðə ˈhəʊm ɑːfɪs/"
        },
        "nearby": [
            {
                "word": "homemaking",
                "pos": "noun"
            },
            {
                "word": "home office",
                "pos": "noun"
            },
            {
                "word": "the Home Office",
                "pos": "noun"
            },
            {
                "word": "Home on the Range",
                "pos": ""
            },
            {
                "word": "homeopath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the British government department that deals with the law, the police and prisons in England and Wales, and with decisions about who can enter the country",
                    "vi": "Bộ chính phủ Anh giải quyết luật pháp, cảnh sát và nhà tù ở Anh và xứ Wales, và với các quyết định về những người có thể nhập cảnh vào đất nước này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "642965b8d05a4d239c96c1b66d7a99bf",
        "word": "the judicial branch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə dʒuˈdɪʃl brɑːntʃ/",
            "us": "/ðə dʒuˈdɪʃl bræntʃ/"
        },
        "nearby": [
            {
                "word": "judicial",
                "pos": "adjective"
            },
            {
                "word": "judicial activism",
                "pos": "noun"
            },
            {
                "word": "the judicial branch",
                "pos": "noun"
            },
            {
                "word": "the Judicial Committee",
                "pos": ""
            },
            {
                "word": "judicially",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the government consisting of judges and courts that interpret the laws",
                    "vi": "phần của chính phủ bao gồm các thẩm phán và tòa án giải thích luật"
                },
                "examples": [
                    {
                        "en": "The judicial branch is comprised of a supreme court and lower, local courts.",
                        "vi": "Nhánh tư pháp bao gồm tòa án tối cao và các tòa án địa phương cấp thấp hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "aa35d0e43db24096aa3057a2576f2d70",
        "word": "kleptocracy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/klepˈtɒkrəsi/",
            "us": "/klepˈtɑːkrəsi/"
        },
        "nearby": [
            {
                "word": "Klaxon",
                "pos": "noun"
            },
            {
                "word": "Kleenex",
                "pos": "noun"
            },
            {
                "word": "kleptocracy",
                "pos": "noun"
            },
            {
                "word": "kleptocratic",
                "pos": "adjective"
            },
            {
                "word": "kleptomania",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a form of government in which the leaders use their power to steal money and resources from the country that they rule",
                    "vi": "một hình thức chính phủ trong đó các nhà lãnh đạo sử dụng quyền lực của họ để ăn cắp tiền và tài nguyên từ đất nước mà họ cai trị"
                },
                "examples": [
                    {
                        "en": "The state apparatus has become a kleptocracy, with leaders using power for personal enrichment.",
                        "vi": "Bộ máy nhà nước đã trở thành một chế độ dân quyền, với những người lãnh đạo sử dụng quyền lực để làm giàu cho cá nhân."
                    },
                    {
                        "en": "The president faces allegations of corruption and kleptocracy.",
                        "vi": "Tổng thống phải đối mặt với các cáo buộc tham nhũng và chế độ dân quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a society that is ruled by a kleptocracy",
                    "vi": "một xã hội được cai trị bởi chế độ kleptocracy"
                },
                "examples": [
                    {
                        "en": "The country has become a kleptocracy led by a thief who prefers stealing from his own people rather than his neighbours.",
                        "vi": "Đất nước đã trở thành một chế độ ăn cắp vặt do một tên trộm dẫn đầu, kẻ thích ăn cắp của chính người dân của mình hơn là hàng xóm của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "9b9fef9332a24df2bb3289dafb2b89b4",
        "word": "kleptocratic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkleptəˈkrætɪk/",
            "us": "/ˌkleptəˈkrætɪk/"
        },
        "nearby": [
            {
                "word": "Kleenex",
                "pos": "noun"
            },
            {
                "word": "kleptocracy",
                "pos": "noun"
            },
            {
                "word": "kleptocratic",
                "pos": "adjective"
            },
            {
                "word": "kleptomania",
                "pos": "noun"
            },
            {
                "word": "kleptomaniac",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to a form of government in which the leaders use their power to steal money and resources from the country that they rule",
                    "vi": "liên quan đến một hình thức chính phủ trong đó các nhà lãnh đạo sử dụng quyền lực của họ để ăn cắp tiền và tài nguyên từ đất nước mà họ cai trị"
                },
                "examples": [
                    {
                        "en": "The country has been turned into a kleptocratic regime that loots its natural resources.",
                        "vi": "Đất nước đã bị biến thành một chế độ độc tài cướp bóc tài nguyên thiên nhiên."
                    }
                ]
            }
        ]
    },
    {
        "id": "681082686e384fa6834f3424c2c44a14",
        "word": "lawful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɔːfl/",
            "us": "/ˈlɔːfl/"
        },
        "nearby": [
            {
                "word": "law court",
                "pos": "noun"
            },
            {
                "word": "the Law Courts",
                "pos": ""
            },
            {
                "word": "lawful",
                "pos": "adjective"
            },
            {
                "word": "lawfully",
                "pos": "adverb"
            },
            {
                "word": "lawfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "allowed or recognized by law; legal",
                    "vi": "được pháp luật cho phép hoặc thừa nhận; hợp pháp"
                },
                "examples": [
                    {
                        "en": "his lawful heir",
                        "vi": "người thừa kế hợp pháp của anh ấy"
                    },
                    {
                        "en": "Can an act that causes death ever be lawful?",
                        "vi": "Một hành vi gây ra cái chết có bao giờ là hợp pháp không?"
                    },
                    {
                        "en": "She is his lawful wife, and so is entitled to inherit the money.",
                        "vi": "Cô ấy là vợ hợp pháp của anh ấy, và do đó, được quyền thừa kế số tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "da997327f9084669851bd2142ffdf6df",
        "word": "the legislative branch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈledʒɪslətɪv brɑːntʃ/",
            "us": "/ðə ˈledʒɪsleɪtɪv bræntʃ/"
        },
        "nearby": [
            {
                "word": "legislation",
                "pos": "noun"
            },
            {
                "word": "legislative",
                "pos": "adjective"
            },
            {
                "word": "the legislative branch",
                "pos": "noun"
            },
            {
                "word": "legislator",
                "pos": "noun"
            },
            {
                "word": "legislature",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the government, consisting of the House of Representatives and the Senate, that has the power to make laws",
                    "vi": "phần của chính phủ, bao gồm Hạ viện và Thượng viện, có quyền đưa ra luật"
                },
                "examples": [
                    {
                        "en": "Budget policy lies with the legislative branch of government.",
                        "vi": "Chính sách ngân sách nằm trong nhánh lập pháp của chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "50fa4939520c4160a9c9c24b54b5bd17",
        "word": "line-item veto",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlaɪn aɪtəm ˈviːtəʊ/",
            "us": "/ˌlaɪn aɪtəm ˈviːtəʊ/"
        },
        "nearby": [
            {
                "word": "line graph",
                "pos": "noun"
            },
            {
                "word": "line item",
                "pos": "noun"
            },
            {
                "word": "line-item veto",
                "pos": "noun"
            },
            {
                "word": "lineman",
                "pos": "noun"
            },
            {
                "word": "line management",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the power of a president or governor to reject one or more parts of a bill that has been approved by a legislature without rejecting the whole bill",
                    "vi": "quyền của tổng thống hoặc thống đốc để bác bỏ một hoặc nhiều phần của dự luật đã được cơ quan lập pháp thông qua mà không bác bỏ toàn bộ dự luật"
                },
                "examples": [
                    {
                        "en": "He used a line-item veto to eliminate a $1 million increase to the California Arts Council.",
                        "vi": "Anh ta đã sử dụng quyền phủ quyết chi tiết đơn hàng để loại bỏ khoản tăng 1 triệu đô la cho Hội đồng Nghệ thuật California."
                    }
                ]
            }
        ]
    },
    {
        "id": "9f013b85162a4cbf86092115dc7ff483",
        "word": "ministerial",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪnɪˈstɪəriəl/",
            "us": "/ˌmɪnɪˈstɪriəl/"
        },
        "nearby": [
            {
                "word": "minister",
                "pos": "noun"
            },
            {
                "word": "minister",
                "pos": "verb"
            },
            {
                "word": "ministerial",
                "pos": "adjective"
            },
            {
                "word": "ministering",
                "pos": "adjective"
            },
            {
                "word": "Minister of State",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a government minister or ministers",
                    "vi": "kết nối với một bộ trưởng chính phủ hoặc các bộ trưởng"
                },
                "examples": [
                    {
                        "en": "decisions taken at ministerial level",
                        "vi": "các quyết định đưa ra ở cấp bộ"
                    },
                    {
                        "en": "a ministerial meeting/statement",
                        "vi": "một cuộc họp bộ trưởng / tuyên bố"
                    },
                    {
                        "en": "to hold ministerial office (= to have the job of a government minister)",
                        "vi": "giữ chức vụ bộ trưởng (= có công việc của một bộ trưởng chính phủ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "45510d23fcc14c4b96433e658cbdb545",
        "word": "municipality",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mjuːˌnɪsɪˈpæləti/",
            "us": "/mjuːˌnɪsɪˈpæləti/"
        },
        "nearby": [
            {
                "word": "the Munich Agreement",
                "pos": ""
            },
            {
                "word": "municipal",
                "pos": "adjective"
            },
            {
                "word": "municipality",
                "pos": "noun"
            },
            {
                "word": "munificence",
                "pos": "noun"
            },
            {
                "word": "munificent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a town, city or district with its own local government; the group of officials who govern it",
                    "vi": "một thị trấn, thành phố hoặc huyện có chính quyền địa phương riêng; nhóm các quan chức quản lý nó"
                },
                "examples": [
                    {
                        "en": "The municipality provides services such as electricity, water and rubbish collection.",
                        "vi": "Đô thị này cung cấp các dịch vụ như điện, nước và thu gom rác."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd946abc344b4214a0e2be2e0106f26c",
        "word": "power grab",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpaʊə ɡræb/",
            "us": "/ˈpaʊər ɡræb/"
        },
        "nearby": [
            {
                "word": "powerful",
                "pos": "adjective"
            },
            {
                "word": "powerfully",
                "pos": "adverb"
            },
            {
                "word": "power grab",
                "pos": "noun"
            },
            {
                "word": "powerhouse",
                "pos": "noun"
            },
            {
                "word": "powerless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attempt by a person or group to take more authority for themselves, usually by taking it from another person or group",
                    "vi": "nỗ lực của một người hoặc một nhóm để có thêm quyền hạn cho mình, thường là bằng cách lấy quyền đó từ một người hoặc một nhóm khác"
                },
                "examples": [
                    {
                        "en": "He was criticized for making what many saw as an undemocratic power grab.",
                        "vi": "Ông đã bị chỉ trích vì đã đưa ra những gì mà nhiều người coi là một sự vơ vét quyền lực phi dân chủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6b856e189c14a3ca75047de80833ede",
        "word": "rainbow coalition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌreɪnbəʊ ˌkəʊəˈlɪʃn/",
            "us": "/ˌreɪnbəʊ ˌkəʊəˈlɪʃn/"
        },
        "nearby": [
            {
                "word": "rainbow",
                "pos": "noun"
            },
            {
                "word": "Rainbow Bridge",
                "pos": ""
            },
            {
                "word": "rainbow coalition",
                "pos": "noun"
            },
            {
                "word": "rainbow nation",
                "pos": "noun"
            },
            {
                "word": "rainbow trout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a political group formed by different parties who agree to work together, especially one that includes one or more very small parties",
                    "vi": "một nhóm chính trị được thành lập bởi các đảng phái khác nhau, những người đồng ý làm việc cùng nhau, đặc biệt là một nhóm bao gồm một hoặc nhiều đảng rất nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4980c85feaa4af7b13c74b55030968c",
        "word": "red tape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌred ˈteɪp/",
            "us": "/ˌred ˈteɪp/"
        },
        "nearby": [
            {
                "word": "the Red Sox",
                "pos": ""
            },
            {
                "word": "red-tailed hawk",
                "pos": "noun"
            },
            {
                "word": "red tape",
                "pos": "noun"
            },
            {
                "word": "red-top",
                "pos": "noun"
            },
            {
                "word": "reduce",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "official rules that seem more complicated than necessary and prevent things from being done quickly",
                    "vi": "các quy tắc chính thức có vẻ phức tạp hơn mức cần thiết và ngăn mọi thứ được thực hiện nhanh chóng"
                },
                "examples": [
                    {
                        "en": "All ministers are agreed on the need to cut bureaucratic red tape.",
                        "vi": "Tất cả các bộ trưởng đều nhất trí về sự cần thiết phải cắt bỏ băng đỏ quan liêu."
                    },
                    {
                        "en": "You have to go through endless red tape to get a residence permit.",
                        "vi": "Bạn phải đi qua băng đỏ vô tận để có được giấy phép cư trú."
                    }
                ]
            }
        ]
    },
    {
        "id": "cc43bbac78ee45ccb864df0661a9307f",
        "word": "the State of the Union Address",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌsteɪt əv ðə ˈjuːniən ədres/",
            "us": "/ðə ˌsteɪt əv ðə ˈjuːniən ədres/"
        },
        "nearby": [
            {
                "word": "state of siege",
                "pos": "noun"
            },
            {
                "word": "state of the art",
                "pos": "adjective"
            },
            {
                "word": "the State of the Union Address",
                "pos": "noun"
            },
            {
                "word": "the State Opening of Parliament",
                "pos": ""
            },
            {
                "word": "stateroom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) a speech about the achievements and plans of the government that the President gives to Congress once a year",
                    "vi": "(ở Mỹ) một bài phát biểu về những thành tựu và kế hoạch của chính phủ mà Tổng thống đưa ra trước Quốc hội mỗi năm một lần"
                },
                "examples": []
            }
        ]
    }
]