[
    {
        "id": "77fc047005ee4e7f9385102ca3608629",
        "word": "book",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/bʊk/",
            "us": "/bʊk/"
        },
        "nearby": [
            {
                "word": "boogie board",
                "pos": "noun"
            },
            {
                "word": "boohoo",
                "pos": "exclamation"
            },
            {
                "word": "book",
                "pos": "noun"
            },
            {
                "word": "book",
                "pos": "verb"
            },
            {
                "word": "bookable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of printed pages that are fastened inside a cover so that you can turn them and read them",
                    "vi": "một tập hợp các trang in được gắn chặt bên trong bìa để bạn có thể lật chúng ra và đọc"
                },
                "examples": [
                    {
                        "en": "His desk was covered with piles of books.",
                        "vi": "Bàn làm việc của anh ta chất đầy sách."
                    },
                    {
                        "en": "hardback/paperback books",
                        "vi": "sách bìa cứng / bìa mềm"
                    },
                    {
                        "en": "a book of short stories",
                        "vi": "một cuốn sách truyện ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written work published in printed or electronic form",
                    "vi": "một tác phẩm viết được xuất bản dưới dạng in hoặc điện tử"
                },
                "examples": [
                    {
                        "en": "to read/write/publish a book",
                        "vi": "để đọc / viết / xuất bản một cuốn sách"
                    },
                    {
                        "en": "reference/children's/library books",
                        "vi": "sách tham khảo / dành cho trẻ em / thư viện"
                    },
                    {
                        "en": "book by somebody a new book by J. K. Rowling",
                        "vi": "sách của ai đó một cuốn sách mới của JK Rowling"
                    },
                    {
                        "en": "book about something a book about wildlife",
                        "vi": "sách về điều gì đó sách về động vật hoang dã"
                    },
                    {
                        "en": "book on something He has written a book on local architecture.",
                        "vi": "cuốn sách về điều gì đó Anh ấy đã viết một cuốn sách về kiến trúc địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of sheets of paper that are fastened together inside a cover and used for writing in",
                    "vi": "một tập hợp các tờ giấy được gắn chặt với nhau bên trong bìa và dùng để viết"
                },
                "examples": [
                    {
                        "en": "an exercise book",
                        "vi": "một cuốn sách bài tập"
                    },
                    {
                        "en": "a notebook",
                        "vi": "quyển sổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of things that are fastened together like a book",
                    "vi": "một tập hợp những thứ được gắn chặt với nhau như một cuốn sách"
                },
                "examples": [
                    {
                        "en": "a book of stamps/tickets/matches",
                        "vi": "một cuốn tem / vé / trận đấu"
                    },
                    {
                        "en": "a chequebook",
                        "vi": "Sổ kiểm tra"
                    }
                ]
            },
            {
                "define": {
                    "en": "the written records of the financial affairs of a business",
                    "vi": "hồ sơ bằng văn bản về các vấn đề tài chính của một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "to do the books (= to check the accounts)",
                        "vi": "để làm sổ sách (= để kiểm tra tài khoản)"
                    },
                    {
                        "en": "You need to go over the books again; there’s a mistake somewhere.",
                        "vi": "Bạn cần phải xem lại các cuốn sách; có sự nhầm lẫn ở đâu đó."
                    },
                    {
                        "en": "She does the books for us.",
                        "vi": "Cô ấy làm những cuốn sách cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of a large written work",
                    "vi": "một phần của một tác phẩm lớn bằng văn bản"
                },
                "examples": [
                    {
                        "en": "the books of the Bible",
                        "vi": "sách kinh thánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of bets made on whether something will happen, somebody will win a race, etc.",
                    "vi": "kỷ lục đặt cược về việc liệu điều gì đó sẽ xảy ra, ai đó sẽ thắng trong cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "They’ve opened a book on who’ll win the Championship.",
                        "vi": "Họ đã mở một cuốn sách về ai sẽ giành chức vô địch."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is pleased/annoyed with you",
                    "vi": "từng nói rằng ai đó hài lòng / khó chịu với bạn"
                },
                "examples": [
                    {
                        "en": "I'm in her good books at the moment because I cleared up the kitchen.",
                        "vi": "Tôi đang ở trong những cuốn sách hay của cô ấy vào lúc này vì tôi đã dọn dẹp nhà bếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to punish somebody for doing something wrong and make them explain their behaviour",
                    "vi": "trừng phạt ai đó vì đã làm điều gì đó sai và bắt họ giải thích hành vi của mình"
                },
                "examples": [
                    {
                        "en": "We will ensure that people who commit fraud are brought to book through the courts.",
                        "vi": "Chúng tôi sẽ đảm bảo rằng những người có hành vi gian lận sẽ bị đưa ra tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "following rules and instructions in a very strict way",
                    "vi": "tuân theo các quy tắc và hướng dẫn một cách rất nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "She always does everything by the book.",
                        "vi": "Cô ấy luôn làm mọi thứ theo cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something because you no longer believe you will be successful or will find a solution",
                    "vi": "ngừng làm điều gì đó bởi vì bạn không còn tin rằng mình sẽ thành công hoặc sẽ tìm ra giải pháp"
                },
                "examples": [
                    {
                        "en": "The police have closed the book on the case (= they have stopped trying to solve it).",
                        "vi": "Cảnh sát đã đóng sổ về vụ án (= họ đã ngừng cố gắng giải quyết nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject or person that you know nothing about",
                    "vi": "một chủ đề hoặc một người mà bạn không biết gì về nó"
                },
                "examples": [
                    {
                        "en": "Nuclear physics is a closed book to most of us.",
                        "vi": "Vật lý hạt nhân là một cuốn sách gần gũi với hầu hết chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change facts or figures dishonestly or illegally",
                    "vi": "thay đổi sự kiện hoặc số liệu một cách không trung thực hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "His accountant had been cooking the books for years.",
                        "vi": "Kế toán của ông đã nấu những cuốn sách trong nhiều năm."
                    },
                    {
                        "en": "Someone was cooking the books.",
                        "vi": "Ai đó đang nấu những cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not form an opinion about somebody/something from their appearance only",
                    "vi": "được sử dụng để nói rằng bạn không nên hình thành ý kiến về ai đó / điều gì đó chỉ từ vẻ ngoài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "every available method, whether it is honest or not",
                    "vi": "mọi phương pháp có sẵn, cho dù nó có trung thực hay không"
                },
                "examples": [
                    {
                        "en": "He'll try every trick in the book to stop you from winning.",
                        "vi": "Anh ấy sẽ thử mọi thủ thuật trong sách để ngăn bạn chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are giving your opinion",
                    "vi": "được sử dụng khi bạn đưa ra ý kiến của mình"
                },
                "examples": [
                    {
                        "en": "That's cheating in my book.",
                        "vi": "Đó là gian lận trong cuốn sách của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to be) on an organization’s list, for example of people who are available for a particular type of work",
                    "vi": "(được) trong danh sách của một tổ chức, ví dụ như những người sẵn sàng cho một loại công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "We have very few nurses on our books at the moment.",
                        "vi": "Chúng tôi có rất ít y tá trên sổ sách của chúng tôi vào lúc này."
                    },
                    {
                        "en": "Most of the houses on our books are in the north of the city.",
                        "vi": "Hầu hết các ngôi nhà trên sách của chúng tôi đều ở phía bắc thành phố."
                    },
                    {
                        "en": "We have fifty people on the books.",
                        "vi": "Chúng tôi có năm mươi người trên các cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you describe somebody or their life as an open book, you mean that you can easily understand them and know everything about them",
                    "vi": "nếu bạn mô tả ai đó hoặc cuộc sống của họ như một cuốn sách mở, bạn có nghĩa là bạn có thể dễ dàng hiểu họ và biết mọi thứ về họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand easily what somebody is thinking or feeling",
                    "vi": "để hiểu một cách dễ dàng những gì ai đó đang nghĩ hoặc cảm thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be convenient or useful for you/somebody",
                    "vi": "để thuận tiện hoặc hữu ích cho bạn / ai đó"
                },
                "examples": [
                    {
                        "en": "Well, if you’re honest and hard-working, that suits our book.",
                        "vi": "Chà, nếu bạn trung thực và chăm chỉ, điều đó phù hợp với cuốn sách của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy somebody’s behaviour and do things in the same way that they do, because they are successful",
                    "vi": "sao chép hành vi của ai đó và làm mọi việc theo cách giống như cách họ làm, bởi vì họ đã thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to punish somebody who has committed an offence as severely as possible",
                    "vi": "trừng phạt ai đó đã phạm tội càng nghiêm khắc càng tốt"
                },
                "examples": [
                    {
                        "en": "‘Get this man down to the station and throw the book at him!’ yelled Curtis.",
                        "vi": "Đưa người đàn ông này xuống ga và ném cuốn sách vào anh ta!' Curtis hét lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "bdca43d7796942bda74d4e5f1ba2eeff",
        "word": "game",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡeɪm/",
            "us": "/ɡeɪm/"
        },
        "nearby": [
            {
                "word": "the Gambling Commission",
                "pos": ""
            },
            {
                "word": "gambol",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "noun"
            },
            {
                "word": "game",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity that you do to have fun, often one that has rules and that you can win or lose; the equipment for a game",
                    "vi": "một hoạt động mà bạn làm để giải trí, thường là một hoạt động có quy tắc và bạn có thể thắng hoặc thua; thiết bị cho một trò chơi"
                },
                "examples": [
                    {
                        "en": "The kids were playing a game with their balloons.",
                        "vi": "Những đứa trẻ đang chơi một trò chơi với những quả bóng bay của chúng."
                    },
                    {
                        "en": "The children invented a new game.",
                        "vi": "Những đứa trẻ đã phát minh ra một trò chơi mới."
                    },
                    {
                        "en": "a video/computer game",
                        "vi": "một trò chơi điện tử / máy tính"
                    },
                    {
                        "en": "I play online games with my friends.",
                        "vi": "Tôi chơi trò chơi trực tuyến với bạn bè của tôi."
                    },
                    {
                        "en": "a game of chance/skill",
                        "vi": "một trò chơi may rủi / kỹ năng"
                    },
                    {
                        "en": "Buy your games and software from us.",
                        "vi": "Mua trò chơi và phần mềm của bạn từ chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sport with rules in which people or teams compete against each other",
                    "vi": "một môn thể thao với các quy tắc trong đó mọi người hoặc các đội thi đấu với nhau"
                },
                "examples": [
                    {
                        "en": "ball games, such as football or tennis",
                        "vi": "trò chơi bóng, chẳng hạn như bóng đá hoặc quần vợt"
                    },
                    {
                        "en": "How I hated team games at school!",
                        "vi": "Tôi ghét các trò chơi đồng đội ở trường như thế nào!"
                    },
                    {
                        "en": "the game of something the game of golf/cricket/basketball",
                        "vi": "trò chơi của một cái gì đó trò chơi gôn / cricket / bóng rổ"
                    },
                    {
                        "en": "Broadcasters have injected vast amounts of money into the game of football.",
                        "vi": "Các đài truyền hình đã bơm một lượng lớn tiền vào trò chơi bóng đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion of playing a game",
                    "vi": "một dịp để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "to win/lose a game",
                        "vi": "thắng / thua một trò chơi"
                    },
                    {
                        "en": "They lost their first home game of the season.",
                        "vi": "Họ đã thua trận sân nhà đầu tiên trong mùa giải."
                    },
                    {
                        "en": "a baseball/basketball game",
                        "vi": "một trận bóng chày / bóng rổ"
                    },
                    {
                        "en": "(especially North American English) a football game",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) một trò chơi bóng đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody plays a game",
                    "vi": "cách mà ai đó chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "Maguire raised his game to collect the £40 000 first prize.",
                        "vi": "Maguire đã gây quỹ cho trò chơi của mình để thu về giải nhất trị giá £ 40 000."
                    },
                    {
                        "en": "Stretching exercises can help you avoid injury and improve your game.",
                        "vi": "Các bài tập kéo căng có thể giúp bạn tránh chấn thương và cải thiện trò chơi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large organized sports event",
                    "vi": "một sự kiện thể thao được tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "She's hoping to participate in the next Olympic Games.",
                        "vi": "Cô ấy hy vọng sẽ tham gia Thế vận hội Olympic tiếp theo."
                    },
                    {
                        "en": "To stage the Games (= the Olympic Games or a similar event) is an honour.",
                        "vi": "Được tổ chức Thế vận hội (= Thế vận hội Olympic hoặc một sự kiện tương tự) là một vinh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "sport as a lesson or an activity at school",
                    "vi": "thể thao như một bài học hoặc một hoạt động ở trường"
                },
                "examples": [
                    {
                        "en": "I always hated games at school.",
                        "vi": "Tôi luôn ghét những trò chơi ở trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of some games, such as tennis, which forms a unit in scoring",
                    "vi": "một phần của một số trò chơi, chẳng hạn như quần vợt, tạo thành một đơn vị tính điểm"
                },
                "examples": [
                    {
                        "en": "two games all (= both players have won two games)",
                        "vi": "tất cả hai trò chơi (= cả hai người chơi đã thắng hai trò chơi)"
                    },
                    {
                        "en": "Zverev won the opening game of the third set.",
                        "vi": "Zverev đã giành chiến thắng trong game mở màn của set thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of activity or business",
                    "vi": "một loại hoạt động hoặc kinh doanh"
                },
                "examples": [
                    {
                        "en": "How long have you been in this game?",
                        "vi": "Bạn đã chơi trò chơi này bao lâu rồi?"
                    },
                    {
                        "en": "the game of politics",
                        "vi": "trò chơi của chính trị"
                    },
                    {
                        "en": "I'm new to this game myself.",
                        "vi": "Bản thân tôi là người mới tham gia trò chơi này."
                    },
                    {
                        "en": "Getting dirty was all part of the game to the kids.",
                        "vi": "Làm bẩn là một phần của trò chơi đối với bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret and clever plan; a trick",
                    "vi": "một kế hoạch bí mật và thông minh; một thủ thuật"
                },
                "examples": [
                    {
                        "en": "So that's his game (= now I know what he has been planning).",
                        "vi": "Vì vậy, đó là trò chơi của anh ấy (= bây giờ tôi biết anh ấy đã lên kế hoạch gì)."
                    }
                ]
            },
            {
                "define": {
                    "en": "wild animals or birds that people hunt for sport or food",
                    "vi": "động vật hoang dã hoặc các loài chim mà mọi người săn lùng để thể thao hoặc làm thực phẩm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at an advantage/disadvantage because you have done more/less preparation or know more/less than other people, especially those you are competing against",
                    "vi": "có lợi / bất lợi vì bạn đã chuẩn bị nhiều hơn / ít hơn hoặc biết nhiều hơn / ít hơn những người khác, đặc biệt là những người bạn đang cạnh tranh"
                },
                "examples": [
                    {
                        "en": "We'll be able to extract insights out of the data that will enable us to stay ahead of the game.",
                        "vi": "Chúng tôi sẽ có thể trích xuất thông tin chi tiết từ dữ liệu giúp chúng tôi dẫn đầu trò chơi."
                    },
                    {
                        "en": "Politicians are behind the game in understanding how fast the world is changing.",
                        "vi": "Các chính trị gia đứng sau trò chơi trong việc hiểu thế giới đang thay đổi nhanh như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat or do better than somebody in an activity which they have chosen or in which they think they are strong",
                    "vi": "để đánh bại hoặc làm tốt hơn ai đó trong một hoạt động mà họ đã chọn hoặc trong đó họ nghĩ rằng họ mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not be considered to be serious",
                    "vi": "không được coi là nghiêm túc"
                },
                "examples": [
                    {
                        "en": "For her the whole project was just a game.",
                        "vi": "Đối với cô ấy, toàn bộ dự án chỉ là một trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be working as a prostitute",
                    "vi": "làm gái mại dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to no longer have a chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "không còn cơ hội thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to still/once again have a good chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "vẫn / một lần nữa có cơ hội tốt để thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": [
                    {
                        "en": "The team was still in the game, just one goal down.",
                        "vi": "Đội vẫn đang thi đấu, chỉ ghi được một bàn thua."
                    },
                    {
                        "en": "(figurative) He’s been fighting to get the struggling company back in the game.",
                        "vi": "(nghĩa bóng) Anh ấy đang chiến đấu để đưa công ty đang gặp khó khăn trở lại trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "activities that are not serious and that other people may think are bad",
                    "vi": "các hoạt động không nghiêm túc và người khác có thể nghĩ là xấu"
                },
                "examples": [
                    {
                        "en": "Teaching isn't all fun and games, you know.",
                        "vi": "Bạn biết đấy, dạy học không phải là trò vui và trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "said to somebody who has done something wrong, when they are caught and the crime or trick has been discovered",
                    "vi": "nói với ai đó đã làm điều gì đó sai trái, khi họ bị bắt và tội ác hoặc thủ đoạn đã bị phát hiện"
                },
                "examples": [
                    {
                        "en": "Maggie knew that he had recognized her and the game was up.",
                        "vi": "Maggie biết rằng anh đã nhận ra cô và trò chơi đã kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after something has happened that makes it clear that a contest is not yet decided and anyone could still win",
                    "vi": "được sử dụng sau khi một điều gì đó đã xảy ra để làm rõ rằng một cuộc thi vẫn chưa được quyết định và bất kỳ ai vẫn có thể giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "We were losing 2–0 with ten minutes to go, and then we scored. It was game on!",
                        "vi": "Chúng tôi đã để thua 2–0 khi còn mười phút nữa, và sau đó chúng tôi ghi bàn. Đó là trò chơi trên!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is no longer possible for somebody/something to succeed, survive or continue",
                    "vi": "được sử dụng để nói rằng không còn có thể cho ai đó / cái gì đó thành công, tồn tại hoặc tiếp tục"
                },
                "examples": [
                    {
                        "en": "Given her recent slump in form, it might be game over already this season.",
                        "vi": "Với phong độ sa sút gần đây của cô ấy, có thể trận đấu đã kết thúc trong mùa giải này."
                    },
                    {
                        "en": "This technology could mean game over for gasoline-powered vehicles.",
                        "vi": "Công nghệ này có nghĩa là trò chơi kết thúc đối với các loại xe chạy bằng xăng."
                    },
                    {
                        "en": "The slightest mistake and it's game over for him.",
                        "vi": "Sai lầm nhỏ nhất và trò chơi đã kết thúc đối với anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a secret, especially by accident; to show something that should be kept hidden",
                    "vi": "để kể một bí mật, đặc biệt là tình cờ; để hiển thị một cái gì đó nên được giấu kín"
                },
                "examples": [
                    {
                        "en": "Don't let him talk to anybody or he'll give the game away.",
                        "vi": "Đừng để anh ta nói chuyện với bất kỳ ai, nếu không anh ta sẽ bỏ cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity that is unlikely to be successful or make a profit",
                    "vi": "một hoạt động không chắc sẽ thành công hoặc tạo ra lợi nhuận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most important aspect of an activity; the most important quality needed for an activity",
                    "vi": "khía cạnh quan trọng nhất của một hoạt động; chất lượng quan trọng nhất cần thiết cho một hoạt động"
                },
                "examples": [
                    {
                        "en": "Hard work is the name of the game if you want to succeed in business.",
                        "vi": "Làm việc chăm chỉ là tên của trò chơi nếu bạn muốn thành công trong kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the advantages to be gained from doing something are not great enough, considering the effort or cost involved",
                    "vi": "lợi thế đạt được từ việc làm gì đó là không đủ lớn, nếu xét đến nỗ lực hoặc chi phí liên quan"
                },
                "examples": [
                    {
                        "en": "If the price goes up again, he may decide that the game’s not worth the candle.",
                        "vi": "Nếu giá tăng trở lại, anh ta có thể quyết định rằng trò chơi không có giá trị như ngọn nến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of considering an activity, etc. that considers only the number of people doing something, things achieved, etc., not with who or what they are",
                    "vi": "một cách xem xét một hoạt động, v.v. chỉ xem xét số lượng người đang làm điều gì đó, những thứ đã đạt được, v.v., chứ không xem xét họ là ai hoặc cái gì"
                },
                "examples": [
                    {
                        "en": "MPs were playing the numbers game as the crucial vote drew closer.",
                        "vi": "Các nghị sĩ đã chơi trò chơi số khi cuộc bỏ phiếu quan trọng đến gần hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "performing badly/well, especially when compared with how well you usually perform",
                    "vi": "hoạt động kém / tốt, đặc biệt là khi so sánh với mức độ bạn thường thực hiện"
                },
                "examples": [
                    {
                        "en": "He was off his game and missed two early penalties.",
                        "vi": "Anh ấy đã nghỉ thi đấu và bỏ lỡ hai quả phạt đền sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important thing of a particular type, or the only thing that is available",
                    "vi": "điều quan trọng nhất của một loại cụ thể hoặc thứ duy nhất có sẵn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a cruel game with somebody in your power by changing your behaviour very often, so that they become nervous and do not know what to expect",
                    "vi": "chơi một trò chơi tàn ác với ai đó trong quyền lực của bạn bằng cách thay đổi hành vi của bạn rất thường xuyên, để họ trở nên lo lắng và không biết điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "He thought the police were playing some elaborate game of cat and mouse and waiting to trap him.",
                        "vi": "Anh ta nghĩ rằng cảnh sát đang chơi trò mèo vờn chuột phức tạp nào đó và chờ đợi để bẫy anh ta."
                    },
                    {
                        "en": "Young car thieves enjoy playing cat and mouse with the police.",
                        "vi": "Những tên trộm xe hơi thích thú chơi trò mèo vờn chuột với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that helps somebody else’s plans, especially by accident, when you did not intend to help them",
                    "vi": "để làm điều gì đó giúp ích cho kế hoạch của người khác, đặc biệt là do tình cờ, khi bạn không có ý định giúp họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a fair and honest way",
                    "vi": "cư xử một cách công bằng và trung thực"
                },
                "examples": [
                    {
                        "en": "You can’t do that—it’s not playing the game!",
                        "vi": "Bạn không thể làm điều đó — đó không phải là chơi trò chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "not to treat a situation seriously, especially in order to cheat somebody",
                    "vi": "không đối xử nghiêm túc với một tình huống, đặc biệt là để lừa dối ai đó"
                },
                "examples": [
                    {
                        "en": "Don't play silly games with me; I know you did it.",
                        "vi": "Đừng chơi những trò chơi ngớ ngẩn với tôi; Tôi biết bạn đã làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the standards of behaviour that most people accept or that actually operate in a particular area of life or business",
                    "vi": "các tiêu chuẩn hành vi mà hầu hết mọi người chấp nhận hoặc thực sự hoạt động trong một lĩnh vực cụ thể của cuộc sống hoặc kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk in a way that sounds convincing, but may not be sincere",
                    "vi": "nói theo cách nghe có vẻ thuyết phục, nhưng có thể không chân thành"
                },
                "examples": [
                    {
                        "en": "The senior managers talk a good game about customer relations, but really they don't care about the customer.",
                        "vi": "Các nhà quản lý cấp cao nói một trò chơi hay về quan hệ khách hàng, nhưng thực sự họ không quan tâm đến khách hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who has played a trick on you that you can do the same thing to them",
                    "vi": "từng nói với ai đó đã chơi lừa bạn rằng bạn có thể làm điều tương tự với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to improve the level at which you can compete, especially in a sport",
                    "vi": "để nâng cao trình độ mà bạn có thể thi đấu, đặc biệt là trong một môn thể thao"
                },
                "examples": [
                    {
                        "en": "She's really upped her game since she joined the tennis club.",
                        "vi": "Cô ấy đã thực sự nâng cao trò chơi của mình kể từ khi cô ấy tham gia câu lạc bộ quần vợt."
                    },
                    {
                        "en": "With these two snazzy new restaurants opening up, the other eating places in the area are going to have to up their game.",
                        "vi": "Với việc hai nhà hàng mới kinh doanh sôi động này mở cửa, các địa điểm ăn uống khác trong khu vực sẽ phải bắt đầu cuộc chơi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why somebody is behaving as they are",
                    "vi": "được sử dụng để hỏi tại sao ai đó lại cư xử như họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6c995f29360459c904f8d72e21f8d9c",
        "word": "music",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmjuːzɪk/",
            "us": "/ˈmjuːzɪk/"
        },
        "nearby": [
            {
                "word": "mushy",
                "pos": "adjective"
            },
            {
                "word": "mushy peas",
                "pos": "noun"
            },
            {
                "word": "music",
                "pos": "noun"
            },
            {
                "word": "musical",
                "pos": "adjective"
            },
            {
                "word": "musical",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sounds that are arranged in a way that is pleasant or exciting to listen to. People sing music or play it on instruments.",
                    "vi": "âm thanh được sắp xếp theo cách dễ chịu hoặc thú vị để nghe. Mọi người hát nhạc hoặc chơi nó trên các nhạc cụ."
                },
                "examples": [
                    {
                        "en": "I like any kind of pop or dance music.",
                        "vi": "Tôi thích bất kỳ loại nhạc pop hoặc dance nào."
                    },
                    {
                        "en": "He plays traditional Korean music.",
                        "vi": "Anh ấy chơi nhạc truyền thống của Hàn Quốc."
                    },
                    {
                        "en": "People often choose to listen to music that suits their moods and activities.",
                        "vi": "Mọi người thường chọn nghe nhạc phù hợp với tâm trạng và hoạt động của họ."
                    },
                    {
                        "en": "She could hear music playing somewhere.",
                        "vi": "Cô có thể nghe thấy tiếng nhạc đang phát ở đâu đó."
                    },
                    {
                        "en": "to stream/share/download music",
                        "vi": "phát / chia sẻ / tải nhạc xuống"
                    },
                    {
                        "en": "to write/compose music",
                        "vi": "viết / soạn nhạc"
                    },
                    {
                        "en": "to perform/record music",
                        "vi": "để biểu diễn / ghi âm nhạc"
                    },
                    {
                        "en": "Every week they get together to make music (= to play music or sing).",
                        "vi": "Hàng tuần, họ cùng nhau sáng tác âm nhạc (= chơi nhạc hoặc hát)."
                    },
                    {
                        "en": "the popularity of Mozart’s music",
                        "vi": "sự phổ biến của âm nhạc của Mozart"
                    },
                    {
                        "en": "It was a charming piece of music.",
                        "vi": "Đó là một bản nhạc quyến rũ."
                    },
                    {
                        "en": "The poem has been set to music (= music has been written for it)",
                        "vi": "Bài thơ đã được đặt thành nhạc (= nhạc đã được viết cho nó)"
                    },
                    {
                        "en": "Birmingham's live music scene",
                        "vi": "Sân khấu nhạc sống của Birmingham"
                    },
                    {
                        "en": "music lovers/fans",
                        "vi": "những người yêu thích / người hâm mộ âm nhạc"
                    },
                    {
                        "en": "Every summer he runs a three-day music festival.",
                        "vi": "Mỗi mùa hè, anh ấy tổ chức một lễ hội âm nhạc kéo dài ba ngày."
                    },
                    {
                        "en": "The band released a music video on YouTube today.",
                        "vi": "Ban nhạc đã phát hành một video âm nhạc trên YouTube vào ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the art of writing or playing music",
                    "vi": "nghệ thuật viết hoặc chơi nhạc"
                },
                "examples": [
                    {
                        "en": "He studied music in Moscow.",
                        "vi": "Anh ấy học nhạc ở Matxcova."
                    },
                    {
                        "en": "a career in music",
                        "vi": "sự nghiệp trong âm nhạc"
                    },
                    {
                        "en": "a music teacher",
                        "vi": "một giáo viên dạy nhạc"
                    },
                    {
                        "en": "music lessons",
                        "vi": "bài học âm nhạc"
                    },
                    {
                        "en": "the music business/industry",
                        "vi": "ngành công nghiệp / kinh doanh âm nhạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the written or printed signs that represent the sounds to be played or sung in a piece of music",
                    "vi": "các dấu hiệu viết hoặc in đại diện cho âm thanh được chơi hoặc hát trong một bản nhạc"
                },
                "examples": [
                    {
                        "en": "Can you read music (= understand the signs in order to play or sing a piece of music)?",
                        "vi": "Bạn có thể đọc nhạc (= hiểu các dấu hiệu để chơi hoặc hát một bản nhạc) không?"
                    },
                    {
                        "en": "I had to play it without the music.",
                        "vi": "Tôi đã phải chơi nó mà không có nhạc."
                    },
                    {
                        "en": "The music (= the paper or book with the musical notes on it) was still open on the piano.",
                        "vi": "Nhạc (= tờ giấy hoặc cuốn sách có ghi các nốt nhạc trên đó) vẫn mở trên piano."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept and deal with criticism or punishment for something you have done",
                    "vi": "chấp nhận và đối phó với những lời chỉ trích hoặc trừng phạt cho điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "The others all ran off, leaving me to face the music.",
                        "vi": "Những người khác đều chạy đi, để lại tôi đối mặt với âm nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "news or information that you are very pleased to hear",
                    "vi": "tin tức hoặc thông tin mà bạn rất vui khi biết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0b7e76644ef24f36922d238c3b14d118",
        "word": "shoe",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ʃuː/",
            "us": "/ʃuː/"
        },
        "nearby": [
            {
                "word": "shoddiness",
                "pos": "noun"
            },
            {
                "word": "shoddy",
                "pos": "adjective"
            },
            {
                "word": "shoe",
                "pos": "noun"
            },
            {
                "word": "shoe",
                "pos": "verb"
            },
            {
                "word": "shoebox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a pair of objects usually made of leather or plastic that you wear on your feet",
                    "vi": "một trong những đồ vật thường làm bằng da hoặc nhựa mà bạn mang trên chân"
                },
                "examples": [
                    {
                        "en": "a pair of shoes",
                        "vi": "một đôi giày"
                    },
                    {
                        "en": "patent leather/suede shoes",
                        "vi": "giày da bằng sáng chế / da lộn"
                    },
                    {
                        "en": "comfortable/sensible shoes",
                        "vi": "giày thoải mái / hợp lý"
                    },
                    {
                        "en": "high-heeled shoes",
                        "vi": "giày cao gót"
                    },
                    {
                        "en": "running shoes",
                        "vi": "giày chạy bộ"
                    },
                    {
                        "en": "She soon regretted wearing her new shoes.",
                        "vi": "Cô ấy nhanh chóng hối hận khi đi đôi giày mới của mình."
                    },
                    {
                        "en": "He ran out into the street despite having no shoes on.",
                        "vi": "Anh ta chạy ra đường dù không mang giày."
                    },
                    {
                        "en": "I was putting my shoes on when the phone rang.",
                        "vi": "Tôi đang xỏ giày vào thì điện thoại reo."
                    },
                    {
                        "en": "He took his shoes and socks off.",
                        "vi": "Anh ta cởi giày và tất."
                    },
                    {
                        "en": "What's your shoe size?",
                        "vi": "Cỡ giày của bạn là bao nhiêu?"
                    },
                    {
                        "en": "a shoe brush",
                        "vi": "bàn chải đánh giày"
                    },
                    {
                        "en": "shoe polish",
                        "vi": "xi đánh giày"
                    },
                    {
                        "en": "Florence has some fantastic shoe shops.",
                        "vi": "Florence có một số cửa hàng giày tuyệt vời."
                    },
                    {
                        "en": "The sole of the shoe is made of hard leather.",
                        "vi": "Đế giày được làm bằng da cứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of curved iron that is attached with nails to the bottom of a horse’s foot. A horseshoe is often used as a symbol of good luck.",
                    "vi": "một miếng sắt cong được đóng bằng đinh dưới chân ngựa. Một chiếc móng ngựa thường được sử dụng như một biểu tượng của sự may mắn."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in, or imagine that you are in, another person’s situation, especially when it is an unpleasant or difficult one",
                    "vi": "ở trong, hoặc tưởng tượng rằng bạn đang ở trong hoàn cảnh của người khác, đặc biệt khi đó là một hoàn cảnh khó chịu hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "I wouldn't like to be in your shoes when they find out about it.",
                        "vi": "Tôi không muốn ở trong vị trí của bạn khi họ phát hiện ra điều đó."
                    },
                    {
                        "en": "Well what would you do? Just put yourself in my shoes.",
                        "vi": "Vậy bạn sẽ làm gì? Chỉ cần đặt bạn vào vị trí của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do somebody’s job in an acceptable way when they are not there",
                    "vi": "làm công việc của ai đó theo cách có thể chấp nhận được khi họ không có ở đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to introduce a piece of advice you are giving to somebody",
                    "vi": "được sử dụng để giới thiệu một lời khuyên bạn đang đưa ra cho ai đó"
                },
                "examples": [
                    {
                        "en": "If I were in your shoes, I'd resign immediately.",
                        "vi": "Nếu tôi ở trong vị trí của bạn, tôi sẽ từ chức ngay lập tức."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you feel that a remark applies to you, you should accept it and take it as a warning or criticism",
                    "vi": "nếu bạn cảm thấy rằng một nhận xét áp dụng cho bạn, bạn nên chấp nhận nó và coi nó như một lời cảnh báo hoặc chỉ trích"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very frightened or nervous",
                    "vi": "rất sợ hãi hoặc lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that a situation has changed so that somebody now has power or authority over the person who used to have power or authority over them",
                    "vi": "được sử dụng để nói rằng một tình huống đã thay đổi để ai đó bây giờ có quyền lực hoặc quyền hạn đối với người đã từng có quyền lực hoặc quyền hạn đối với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue a job or the work that somebody else has started",
                    "vi": "để tiếp tục một công việc hoặc công việc mà người khác đã bắt đầu"
                },
                "examples": [
                    {
                        "en": "She stepped into her father’s shoes when he retired.",
                        "vi": "Cô bước vào đôi giày của cha mình khi ông nghỉ hưu."
                    }
                ]
            }
        ]
    },
    {
        "id": "254172e1eb724baa9fe2212a57bbed6c",
        "word": "clothing",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkləʊðɪŋ/",
            "us": "/ˈkləʊðɪŋ/"
        },
        "nearby": [
            {
                "word": "clothes tree",
                "pos": "noun"
            },
            {
                "word": "clothier",
                "pos": "noun"
            },
            {
                "word": "clothing",
                "pos": "noun"
            },
            {
                "word": "clotted cream",
                "pos": "noun"
            },
            {
                "word": "clotting factor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes, especially a particular type of clothes",
                    "vi": "quần áo, đặc biệt là một loại quần áo cụ thể"
                },
                "examples": [
                    {
                        "en": "Workers at the factory wear protective clothing.",
                        "vi": "Công nhân làm việc tại nhà máy mặc quần áo bảo hộ lao động."
                    },
                    {
                        "en": "a man wearing dark clothing",
                        "vi": "một người đàn ông mặc quần áo tối màu"
                    },
                    {
                        "en": "an item of clothing",
                        "vi": "một mặt hàng quần áo"
                    },
                    {
                        "en": "warm clothing",
                        "vi": "quần áo ấm"
                    },
                    {
                        "en": "the high cost of food and clothing",
                        "vi": "chi phí thực phẩm và quần áo cao"
                    },
                    {
                        "en": "a piece/an article of clothing",
                        "vi": "một mảnh / một mặt hàng quần áo"
                    },
                    {
                        "en": "Did you bring a change of clothing?",
                        "vi": "Bạn có mang theo quần áo để thay không?"
                    },
                    {
                        "en": "stalls selling clothing for men and women",
                        "vi": "quầy hàng bán quần áo nam và nữ"
                    },
                    {
                        "en": "The charity helped her out with clothing for work.",
                        "vi": "Tổ chức từ thiện đã giúp cô có quần áo đi làm."
                    },
                    {
                        "en": "on clothing They found blood on his clothing.",
                        "vi": "trên quần áo Họ tìm thấy máu trên quần áo của anh ta."
                    },
                    {
                        "en": "a clothing store",
                        "vi": "một cửa hàng quần áo"
                    },
                    {
                        "en": "a clothing manufacturer",
                        "vi": "một nhà sản xuất quần áo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who seems to be friendly or not likely to cause any harm but is really an enemy",
                    "vi": "một người có vẻ thân thiện hoặc không có khả năng gây ra bất kỳ tổn hại nào nhưng thực sự là kẻ thù"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56fd08e0f3db45e2a23f02ca8aea5ccb",
        "word": "department",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈpɑːtmənt/",
            "us": "/dɪˈpɑːrtmənt/"
        },
        "nearby": [
            {
                "word": "departed",
                "pos": "adjective"
            },
            {
                "word": "depart from",
                "pos": "phrasal verb"
            },
            {
                "word": "department",
                "pos": "noun"
            },
            {
                "word": "departmental",
                "pos": "adjective"
            },
            {
                "word": "the Department for Business, Energy and Industrial Strategy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a section of a large organization such as a government, business, university, etc.",
                    "vi": "một bộ phận của một tổ chức lớn như chính phủ, doanh nghiệp, trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "department of something the Department of Health",
                        "vi": "bộ phận của một cái gì đó Bộ y tế"
                    },
                    {
                        "en": "He is a lecturer in the department of psychology at Trinity College, Dublin.",
                        "vi": "Ông là giảng viên khoa tâm lý học tại Trinity College, Dublin."
                    },
                    {
                        "en": "the Treasury Department",
                        "vi": "Bộ Ngân khố"
                    },
                    {
                        "en": "a government/university, etc. department",
                        "vi": "một cơ quan chính phủ / trường đại học, v.v."
                    },
                    {
                        "en": "the marketing/sales, etc. department",
                        "vi": "bộ phận tiếp thị / bán hàng, v.v."
                    },
                    {
                        "en": "The children's department (= in a large store) sells a wide range of good quality clothes.",
                        "vi": "Bộ phận dành cho trẻ em (= trong một cửa hàng lớn) bán nhiều loại quần áo chất lượng tốt."
                    },
                    {
                        "en": "the English department",
                        "vi": "khoa tiếng anh"
                    },
                    {
                        "en": "in a department She used to work in the IT department.",
                        "vi": "trong một bộ phận Cô ấy từng làm việc trong bộ phận CNTT."
                    },
                    {
                        "en": "He later served as head of the art history department.",
                        "vi": "Sau đó ông giữ chức vụ trưởng khoa lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something that somebody is responsible for or knows a lot about",
                    "vi": "trở thành một cái gì đó mà ai đó có trách nhiệm hoặc biết nhiều về"
                },
                "examples": [
                    {
                        "en": "Don't ask me about it—that's her department.",
                        "vi": "Đừng hỏi tôi về điều đó — đó là bộ phận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a particular aspect or quality",
                    "vi": "ở một khía cạnh hoặc chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He doesn't have much going for him in the brains department, to be honest.",
                        "vi": "Thành thật mà nói, anh ấy không có nhiều thứ để làm trong bộ não."
                    },
                    {
                        "en": "Movies lacking in the story department can still succeed.",
                        "vi": "Phim thiếu mạch truyện vẫn có thể thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7a69fcf45904ca5a9e117f00567c4ca",
        "word": "electrical",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪˈlektrɪkl/",
            "us": "/ɪˈlektrɪkl/"
        },
        "nearby": [
            {
                "word": "electric",
                "pos": "adjective"
            },
            {
                "word": "electric",
                "pos": "noun"
            },
            {
                "word": "electrical",
                "pos": "adjective"
            },
            {
                "word": "electrical engineer",
                "pos": "noun"
            },
            {
                "word": "electrical engineering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with electricity; using or producing electricity",
                    "vi": "kết nối với điện; sử dụng hoặc sản xuất điện"
                },
                "examples": [
                    {
                        "en": "an electrical fault in the engine",
                        "vi": "một lỗi điện trong động cơ"
                    },
                    {
                        "en": "electrical equipment/appliances",
                        "vi": "thiết bị / đồ dùng điện"
                    },
                    {
                        "en": "electrical power/energy",
                        "vi": "năng lượng điện / năng lượng"
                    }
                ]
            }
        ]
    },
    {
        "id": "b3b9f2defd2b4b27a3354889705d59b8",
        "word": "furniture",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfɜːnɪtʃə(r)/",
            "us": "/ˈfɜːrnɪtʃər/"
        },
        "nearby": [
            {
                "word": "furnished",
                "pos": "adjective"
            },
            {
                "word": "furnishings",
                "pos": "noun"
            },
            {
                "word": "furniture",
                "pos": "noun"
            },
            {
                "word": "furniture beetle",
                "pos": "noun"
            },
            {
                "word": "furniture van",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "objects that can be moved, such as tables, chairs and beds, that are put into a house or an office to make it suitable for living or working in",
                    "vi": "Các đồ vật có thể di chuyển được như bàn ghế, giường tủ được đưa vào nhà ở, văn phòng để phù hợp cho việc ở hoặc làm việc."
                },
                "examples": [
                    {
                        "en": "garden/office furniture",
                        "vi": "nội thất sân vườn / văn phòng"
                    },
                    {
                        "en": "a dealer in antique furniture",
                        "vi": "một đại lý đồ nội thất cổ"
                    },
                    {
                        "en": "a piece of furniture",
                        "vi": "một món đồ nội thất"
                    },
                    {
                        "en": "We need to buy some new furniture.",
                        "vi": "Chúng tôi cần mua một số đồ nội thất mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you are so used to seeing that you no longer notice them",
                    "vi": "một người hoặc một vật mà bạn đã quá quen với việc nhìn thấy rằng bạn không còn để ý đến họ nữa"
                },
                "examples": [
                    {
                        "en": "I worked there so long that I became part of the furniture.",
                        "vi": "Tôi đã làm việc ở đó lâu đến nỗi tôi trở thành một phần của đồ nội thất."
                    }
                ]
            }
        ]
    },
    {
        "id": "818878dfc58044fdb6fe054f2a3b17b0",
        "word": "gift",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɡɪft/",
            "us": "/ɡɪft/"
        },
        "nearby": [
            {
                "word": "John Gielgud",
                "pos": ""
            },
            {
                "word": "GIF",
                "pos": "noun"
            },
            {
                "word": "gift",
                "pos": "noun"
            },
            {
                "word": "gift",
                "pos": "verb"
            },
            {
                "word": "gift card",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that you give to somebody, especially on a special occasion or to say thank you",
                    "vi": "một thứ mà bạn tặng cho ai đó, đặc biệt là vào một dịp đặc biệt hoặc để nói lời cảm ơn"
                },
                "examples": [
                    {
                        "en": "to give/receive a gift",
                        "vi": "tặng / nhận một món quà"
                    },
                    {
                        "en": "a Christmas/birthday/wedding gift",
                        "vi": "một món quà giáng sinh / sinh nhật / đám cưới"
                    },
                    {
                        "en": "Thank you for your generous gift.",
                        "vi": "Cảm ơn bạn vì món quà hào phóng của bạn."
                    },
                    {
                        "en": "gift from somebody The watch was a gift from my mother.",
                        "vi": "món quà từ ai đó Chiếc đồng hồ là một món quà từ mẹ tôi."
                    },
                    {
                        "en": "gift for somebody a free gift for every reader",
                        "vi": "quà tặng cho ai đó một món quà miễn phí cho mọi độc giả"
                    },
                    {
                        "en": "gift to somebody This dinner is my gift to you.",
                        "vi": "món quà cho ai đó Bữa tối này là món quà của tôi cho bạn."
                    },
                    {
                        "en": "gift of something gifts of toys for the children",
                        "vi": "quà tặng món quà đồ chơi cho trẻ em"
                    },
                    {
                        "en": "By becoming a blood donor you will be making a vital gift of life to someone else.",
                        "vi": "Bằng cách trở thành một người hiến máu, bạn sẽ tạo ra một món quà quan trọng của cuộc sống cho người khác."
                    },
                    {
                        "en": "(formal) The family made a gift of his paintings to the gallery.",
                        "vi": "(trang trọng) Gia đình đã tặng các bức tranh của anh ấy cho phòng trưng bày."
                    },
                    {
                        "en": "as a gift She gave me the book as a gift.",
                        "vi": "như một món quà Cô ấy đã tặng tôi cuốn sách như một món quà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a natural ability",
                    "vi": "một khả năng tự nhiên"
                },
                "examples": [
                    {
                        "en": "She can pick up a tune instantly on the piano. It's a gift.",
                        "vi": "Cô ấy có thể chọn một giai điệu ngay lập tức trên piano. Đó là một món quà."
                    },
                    {
                        "en": "He knew from an early age he had a special gift.",
                        "vi": "Ngay từ nhỏ anh đã biết mình có năng khiếu đặc biệt."
                    },
                    {
                        "en": "gift for something She showed a natural gift for comedy.",
                        "vi": "món quà cho một cái gì đó Cô ấy cho thấy một năng khiếu bẩm sinh về hài kịch."
                    },
                    {
                        "en": "gift for doing something He has a gift for making friends easily.",
                        "vi": "món quà để làm điều gì đó Anh ấy có một món quà để kết bạn dễ dàng."
                    },
                    {
                        "en": "gift as somebody his great gifts as a teacher",
                        "vi": "món quà như một ai đó những món quà tuyệt vời của anh ấy với tư cách là một giáo viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is very easy to do or cheap to buy",
                    "vi": "một thứ rất dễ làm hoặc mua rẻ"
                },
                "examples": [
                    {
                        "en": "Their second goal was an absolute gift.",
                        "vi": "Bàn thắng thứ hai của họ là một món quà tuyệt đối."
                    },
                    {
                        "en": "At £500 it's a gift.",
                        "vi": "Với giá £ 500, đó là một món quà."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something such as an important job or a special right or advantage is in somebody’s gift, that person can decide who to give it to",
                    "vi": "nếu một thứ gì đó chẳng hạn như một công việc quan trọng hoặc một quyền hoặc lợi thế đặc biệt nằm trong món quà của ai đó, người đó có thể quyết định tặng nó cho ai"
                },
                "examples": [
                    {
                        "en": "All such posts are in the gift of the managing director (= only given by the managing director).",
                        "vi": "Tất cả các bài viết như vậy là quà tặng của giám đốc quản lý (= chỉ do giám đốc quản lý tặng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to speak easily and to persuade other people with your words",
                    "vi": "khả năng nói chuyện dễ dàng và thuyết phục người khác bằng lời nói của bạn"
                },
                "examples": [
                    {
                        "en": "Joe’s got the gift of the gab—he can sell anything.",
                        "vi": "Joe có món quà là cái gab — anh ấy có thể bán bất cứ thứ gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who thinks that they are particularly good at something or who thinks that somebody will find them particularly attractive",
                    "vi": "một người nghĩ rằng họ đặc biệt giỏi một cái gì đó hoặc người nghĩ rằng ai đó sẽ thấy họ đặc biệt hấp dẫn"
                },
                "examples": [
                    {
                        "en": "He seems to think he's God's gift to women.",
                        "vi": "Anh ấy dường như nghĩ rằng mình là món quà của Chúa dành cho phụ nữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse or criticize something that is given to you for nothing",
                    "vi": "từ chối hoặc chỉ trích một thứ gì đó được trao cho bạn mà chẳng có gì"
                },
                "examples": [
                    {
                        "en": "I’m never one to look a gift horse in the mouth.",
                        "vi": "Tôi không bao giờ là người nhìn vào miệng một con ngựa quà tặng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a8def751d13b478bb94a56da49e16d07",
        "word": "jewellery",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈdʒuːəlri/",
            "us": "/ˈdʒuːəlri/"
        },
        "nearby": [
            {
                "word": "jewelled",
                "pos": "adjective"
            },
            {
                "word": "jeweller",
                "pos": "noun"
            },
            {
                "word": "jewellery",
                "pos": "noun"
            },
            {
                "word": "Jewess",
                "pos": "noun"
            },
            {
                "word": "Jewish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "objects such as rings and necklaces that people wear as decoration",
                    "vi": "các đồ vật như nhẫn và vòng cổ mà mọi người đeo để trang trí"
                },
                "examples": [
                    {
                        "en": "silver/gold jewellery",
                        "vi": "đồ trang sức bạc / vàng"
                    },
                    {
                        "en": "She has some lovely pieces of jewellery.",
                        "vi": "Cô ấy có một số đồ trang sức đáng yêu."
                    },
                    {
                        "en": "I don't wear jewellery of any kind.",
                        "vi": "Tôi không đeo bất kỳ loại trang sức nào."
                    },
                    {
                        "en": "She inherited the family jewellery.",
                        "vi": "Cô được thừa kế đồ trang sức của gia đình."
                    },
                    {
                        "en": "The nurse asked her to remove all her jewellery.",
                        "vi": "Y tá yêu cầu cô ấy bỏ tất cả đồ trang sức của mình."
                    },
                    {
                        "en": "(British English) a jewellery shop",
                        "vi": "(Tiếng Anh Anh) một cửa hàng trang sức"
                    },
                    {
                        "en": "(US English) a jewelry store",
                        "vi": "(Tiếng Anh Mỹ) một cửa hàng trang sức"
                    }
                ]
            }
        ]
    },
    {
        "id": "2194995d7fa94736806818546ffbfb2b",
        "word": "luggage",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlʌɡɪdʒ/",
            "us": "/ˈlʌɡɪdʒ/"
        },
        "nearby": [
            {
                "word": "luge",
                "pos": "noun"
            },
            {
                "word": "Luger",
                "pos": "noun"
            },
            {
                "word": "luggage",
                "pos": "noun"
            },
            {
                "word": "luggage rack",
                "pos": "noun"
            },
            {
                "word": "luggage van",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "bags, cases, etc. that contain somebody's clothes and things when they are travelling",
                    "vi": "túi, hộp, v.v. chứa quần áo và đồ đạc của ai đó khi họ đi du lịch"
                },
                "examples": [
                    {
                        "en": "There's room for one more piece of luggage.",
                        "vi": "Còn chỗ cho một kiện hành lý nữa."
                    },
                    {
                        "en": "You stay there with the luggage while I find a cab.",
                        "vi": "Bạn ở đó với hành lý trong khi tôi tìm một chiếc taxi."
                    }
                ]
            },
            {
                "define": {
                    "en": "empty bags, cases, etc. for putting your clothes and things in when you are travelling",
                    "vi": "túi rỗng, hộp, v.v. để đựng quần áo và đồ đạc của bạn khi bạn đang đi du lịch"
                },
                "examples": [
                    {
                        "en": "a new set of luggage",
                        "vi": "một bộ hành lý mới"
                    },
                    {
                        "en": "I need to buy some new luggage for my vacation next month.",
                        "vi": "Tôi cần mua một số hành lý mới cho kỳ nghỉ của tôi vào tháng tới."
                    },
                    {
                        "en": "The couple had matching luggage.",
                        "vi": "Cặp đôi có hành lý phù hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f65180419bb4a13893e4da72f05b017",
        "word": "technology",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/tekˈnɒlədʒi/",
            "us": "/tekˈnɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "technologically",
                "pos": "adverb"
            },
            {
                "word": "technologist",
                "pos": "noun"
            },
            {
                "word": "technology",
                "pos": "noun"
            },
            {
                "word": "technophile",
                "pos": "noun"
            },
            {
                "word": "technophobe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "scientific knowledge used in practical ways in industry, for example in designing new machines",
                    "vi": "kiến thức khoa học được sử dụng theo cách thực tế trong công nghiệp, ví dụ như trong thiết kế máy móc mới"
                },
                "examples": [
                    {
                        "en": "science and technology",
                        "vi": "khoa học và Công nghệ"
                    },
                    {
                        "en": "advances in communications technology",
                        "vi": "những tiến bộ trong công nghệ truyền thông"
                    },
                    {
                        "en": "advanced/modern technology",
                        "vi": "công nghệ tiên tiến / hiện đại"
                    },
                    {
                        "en": "to develop and use new technologies",
                        "vi": "phát triển và sử dụng công nghệ mới"
                    },
                    {
                        "en": "small businesses that are involved with emerging technologies",
                        "vi": "các doanh nghiệp nhỏ liên quan đến công nghệ mới nổi"
                    },
                    {
                        "en": "the use of the latest digital technology to create a virtual world",
                        "vi": "việc sử dụng công nghệ kỹ thuật số mới nhất để tạo ra một thế giới ảo"
                    },
                    {
                        "en": "This technology enables computers to read handwriting.",
                        "vi": "Công nghệ này cho phép máy tính đọc được chữ viết tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "machines or equipment designed using technology",
                    "vi": "máy móc hoặc thiết bị được thiết kế bằng công nghệ"
                },
                "examples": [
                    {
                        "en": "The scheme provides access to advanced computer technology in the classroom.",
                        "vi": "Chương trình cung cấp quyền truy cập vào công nghệ máy tính tiên tiến trong lớp học."
                    },
                    {
                        "en": "The company has invested in the latest technology.",
                        "vi": "Công ty đã đầu tư vào công nghệ mới nhất."
                    },
                    {
                        "en": "a wireless technology company",
                        "vi": "một công ty công nghệ không dây"
                    },
                    {
                        "en": "the technology sector/industry",
                        "vi": "lĩnh vực công nghệ / ngành công nghiệp"
                    }
                ]
            }
        ]
    },
    {
        "id": "ef47bf473aeb4a4aaceb9da81b2df6a2",
        "word": "toy",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/tɔɪ/",
            "us": "/tɔɪ/"
        },
        "nearby": [
            {
                "word": "toxin",
                "pos": "noun"
            },
            {
                "word": "toxoplasmosis",
                "pos": "noun"
            },
            {
                "word": "toy",
                "pos": "noun"
            },
            {
                "word": "toy",
                "pos": "adjective"
            },
            {
                "word": "toy",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object for children to play with",
                    "vi": "một đối tượng để trẻ em chơi với"
                },
                "examples": [
                    {
                        "en": "cuddly/stuffed toys",
                        "vi": "âu yếm / đồ chơi nhồi bông"
                    },
                    {
                        "en": "The children were playing happily with their toys.",
                        "vi": "Những đứa trẻ đang chơi vui vẻ với đồ chơi của chúng."
                    },
                    {
                        "en": "a toy shop/store",
                        "vi": "một cửa hàng / cửa hàng đồ chơi"
                    },
                    {
                        "en": "She's an entrepreneur and a designer of children's toys.",
                        "vi": "Cô ấy là một doanh nhân và một nhà thiết kế đồ chơi trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that you have for fun or pleasure rather than for a serious purpose",
                    "vi": "một đối tượng mà bạn có cho vui vẻ hoặc thích thú hơn là cho một mục đích nghiêm túc"
                },
                "examples": [
                    {
                        "en": "executive toys",
                        "vi": "đồ chơi điều hành"
                    },
                    {
                        "en": "My latest toy is this espresso coffee maker.",
                        "vi": "Đồ chơi mới nhất của tôi là chiếc máy pha cà phê espresso này."
                    }
                ]
            }
        ]
    },
    {
        "id": "dddbc646fe2a4187a13b9cb54a625e38",
        "word": "gadget",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡædʒɪt/",
            "us": "/ˈɡædʒɪt/"
        },
        "nearby": [
            {
                "word": "gad around",
                "pos": "phrasal verb"
            },
            {
                "word": "gadfly",
                "pos": "noun"
            },
            {
                "word": "gadget",
                "pos": "noun"
            },
            {
                "word": "gadgetry",
                "pos": "noun"
            },
            {
                "word": "gadolinium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small tool or device that does something useful",
                    "vi": "một công cụ hoặc thiết bị nhỏ làm điều gì đó hữu ích"
                },
                "examples": [
                    {
                        "en": "We live in a world filled with high-tech gadgets.",
                        "vi": "Chúng ta đang sống trong một thế giới tràn ngập các tiện ích công nghệ cao."
                    },
                    {
                        "en": "She has invented a nifty little gadget for undoing stubborn nuts and bolts.",
                        "vi": "Cô ấy đã phát minh ra một thiết bị nhỏ tiện lợi để hoàn tác các đai ốc và bu lông cứng đầu."
                    },
                    {
                        "en": "kids that hassle their parents to buy the latest electronic gadget",
                        "vi": "những đứa trẻ làm phiền bố mẹ chúng để mua thiết bị điện tử mới nhất"
                    },
                    {
                        "en": "Modern gadgets like these make a huge difference to home life.",
                        "vi": "Những tiện ích hiện đại như thế này tạo nên sự khác biệt rất lớn cho cuộc sống gia đình."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c78e8f70d5b4253ace376e6e9d08575",
        "word": "appliance",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈplaɪəns/",
            "us": "/əˈplaɪəns/"
        },
        "nearby": [
            {
                "word": "Johnny Appleseed",
                "pos": ""
            },
            {
                "word": "applet",
                "pos": "noun"
            },
            {
                "word": "appliance",
                "pos": "noun"
            },
            {
                "word": "applicability",
                "pos": "noun"
            },
            {
                "word": "applicable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine that is designed to do a particular thing in the home, such as preparing food, heating or cleaning",
                    "vi": "một chiếc máy được thiết kế để làm một việc cụ thể trong nhà, chẳng hạn như chuẩn bị thức ăn, sưởi ấm hoặc dọn dẹp"
                },
                "examples": [
                    {
                        "en": "electrical/household appliances",
                        "vi": "thiết bị điện / gia dụng"
                    },
                    {
                        "en": "They sell a wide range of domestic appliances—washing machines, dishwashers and so on.",
                        "vi": "Họ bán nhiều loại thiết bị gia dụng - máy giặt, máy rửa bát, v.v."
                    },
                    {
                        "en": "modern heating appliances of all types",
                        "vi": "thiết bị sưởi ấm hiện đại của tất cả các loại"
                    },
                    {
                        "en": "Always switch off appliances that are not in use.",
                        "vi": "Luôn tắt các thiết bị không sử dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ebfa7cccfd54421baee2052a30aafd21",
        "word": "cosmetic",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kɒzˈmetɪk/",
            "us": "/kɑːzˈmetɪk/"
        },
        "nearby": [
            {
                "word": "cosiness",
                "pos": "noun"
            },
            {
                "word": "cos lettuce",
                "pos": "noun"
            },
            {
                "word": "cosmetic",
                "pos": "noun"
            },
            {
                "word": "cosmetic",
                "pos": "adjective"
            },
            {
                "word": "cosmetically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance that you put on your face or body to make it more attractive",
                    "vi": "một chất mà bạn bôi lên mặt hoặc cơ thể để làm cho nó hấp dẫn hơn"
                },
                "examples": [
                    {
                        "en": "the cosmetics industry",
                        "vi": "ngành công nghiệp mỹ phẩm"
                    },
                    {
                        "en": "She found a job selling cosmetics.",
                        "vi": "Cô tìm được một công việc bán mỹ phẩm."
                    },
                    {
                        "en": "a cosmetic company",
                        "vi": "một công ty mỹ phẩm"
                    },
                    {
                        "en": "cosmetic products",
                        "vi": "sản phẩm làm đẹp"
                    },
                    {
                        "en": "We’re introducing a new line of cosmetics.",
                        "vi": "Chúng tôi đang giới thiệu một dòng mỹ phẩm mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "7b6397e5010c4b2aaeb69a601364a805",
        "word": "craft",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/krɑːft/",
            "us": "/kræft/"
        },
        "nearby": [
            {
                "word": "cradle-snatcher",
                "pos": "noun"
            },
            {
                "word": "cradle-snatching",
                "pos": "noun"
            },
            {
                "word": "craft",
                "pos": "noun"
            },
            {
                "word": "craft",
                "pos": "verb"
            },
            {
                "word": "craft beer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity involving a special skill at making things with your hands",
                    "vi": "một hoạt động liên quan đến một kỹ năng đặc biệt để làm đồ vật bằng tay của bạn"
                },
                "examples": [
                    {
                        "en": "traditional crafts like basket-weaving",
                        "vi": "thủ công truyền thống như đan rổ"
                    },
                    {
                        "en": "a craft fair/workshop",
                        "vi": "hội chợ / hội thảo thủ công"
                    }
                ]
            },
            {
                "define": {
                    "en": "all the skills needed for a particular activity",
                    "vi": "tất cả các kỹ năng cần thiết cho một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "chefs who learned their craft in top hotels",
                        "vi": "những đầu bếp đã học nghề ở những khách sạn hàng đầu"
                    },
                    {
                        "en": "the writer’s craft",
                        "vi": "thủ công của nhà văn"
                    }
                ]
            },
            {
                "define": {
                    "en": "skill in making people believe what you want them to believe",
                    "vi": "kỹ năng làm cho mọi người tin vào những gì bạn muốn họ tin"
                },
                "examples": [
                    {
                        "en": "He knew how to win by craft and diplomacy what he could not gain by force.",
                        "vi": "Anh biết cách giành được bằng thủ công và ngoại giao những gì anh không thể giành được bằng vũ lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "a boat or ship",
                    "vi": "một chiếc thuyền hoặc con tàu"
                },
                "examples": [
                    {
                        "en": "Hundreds of small craft bobbed around the liner as it steamed into the harbour.",
                        "vi": "Hàng trăm nghề thủ công nhỏ nhấp nhô xung quanh lớp lót khi nó được đưa vào bến cảng."
                    },
                    {
                        "en": "a landing/pleasure craft",
                        "vi": "một tàu hạ cánh / niềm vui"
                    }
                ]
            },
            {
                "define": {
                    "en": "an aircraft or spacecraft",
                    "vi": "một chiếc máy bay hoặc tàu vũ trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8bc149dc713e4ebb904945d8a114dd9a",
        "word": "fabric",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfæbrɪk/",
            "us": "/ˈfæbrɪk/"
        },
        "nearby": [
            {
                "word": "fable",
                "pos": "noun"
            },
            {
                "word": "fabled",
                "pos": "adjective"
            },
            {
                "word": "fabric",
                "pos": "noun"
            },
            {
                "word": "fabricate",
                "pos": "verb"
            },
            {
                "word": "fabrication",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "material made by weaving wool, cotton, silk, etc., used for making clothes, curtains, etc. and for covering furniture",
                    "vi": "vật liệu dệt len, bông, lụa, v.v., dùng để may quần áo, rèm cửa, v.v. và bọc đồ nội thất"
                },
                "examples": [
                    {
                        "en": "They sell a wide variety of printed cotton fabric.",
                        "vi": "Họ bán nhiều loại vải cotton in hình."
                    },
                    {
                        "en": "furnishing fabrics",
                        "vi": "vải trang trí nội thất"
                    }
                ]
            },
            {
                "define": {
                    "en": "the basic structure of a society, an organization, etc. that enables it to function successfully",
                    "vi": "cấu trúc cơ bản của một xã hội, một tổ chức, v.v. cho phép nó hoạt động thành công"
                },
                "examples": [
                    {
                        "en": "a trend which threatens the very fabric of society",
                        "vi": "một xu hướng đe dọa chính kết cấu của xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "the basic structure of a building, such as the walls, floor and roof",
                    "vi": "cấu trúc cơ bản của một tòa nhà, chẳng hạn như tường, sàn và mái nhà"
                },
                "examples": [
                    {
                        "en": "The city retains much of its historic fabric.",
                        "vi": "Thành phố vẫn giữ lại phần lớn vải lịch sử của nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "e0260a722f5d4d8aac370782c8429c3b",
        "word": "grocery",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡrəʊsəri/",
            "us": "/ˈɡrəʊsəri/"
        },
        "nearby": [
            {
                "word": "groat",
                "pos": "noun"
            },
            {
                "word": "grocer",
                "pos": "noun"
            },
            {
                "word": "grocery",
                "pos": "noun"
            },
            {
                "word": "grocery",
                "pos": "adjective"
            },
            {
                "word": "groceteria",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells food and other things used in the home. In American English ‘grocery store’ is often used to mean ‘supermarket’.",
                    "vi": "một cửa hàng bán thực phẩm và những thứ khác được sử dụng trong gia đình. Trong tiếng Anh Mỹ, 'cửa hàng tạp hóa' thường được dùng với nghĩa là 'siêu thị'."
                },
                "examples": [
                    {
                        "en": "the corner grocery store",
                        "vi": "cửa hàng tạp hóa ở góc phố"
                    }
                ]
            },
            {
                "define": {
                    "en": "food and other goods sold by a grocer or at a supermarket",
                    "vi": "thực phẩm và các hàng hóa khác do cửa hàng tạp hóa hoặc siêu thị bán"
                },
                "examples": [
                    {
                        "en": "He walked in and set the bag of groceries down on the floor.",
                        "vi": "Anh bước vào và đặt túi hàng tạp hóa xuống sàn."
                    },
                    {
                        "en": "Mom wanted me to get the groceries.",
                        "vi": "Mẹ muốn tôi đi lấy hàng tạp hóa."
                    }
                ]
            }
        ]
    },
    {
        "id": "68781c2d91e145ab8dc6add72ce91c6c",
        "word": "perfume",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpɜːfjuːm/",
            "us": "/pərˈfjuːm/"
        },
        "nearby": [
            {
                "word": "performer",
                "pos": "noun"
            },
            {
                "word": "the performing arts",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "verb"
            },
            {
                "word": "perfumed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a liquid, often made from flowers, that you put on your skin to make yourself smell nice",
                    "vi": "một chất lỏng, thường được làm từ hoa, bạn bôi lên da để làm cho mình có mùi thơm"
                },
                "examples": [
                    {
                        "en": "a bottle of expensive perfume",
                        "vi": "một lọ nước hoa đắt tiền"
                    },
                    {
                        "en": "We stock a wide range of perfumes.",
                        "vi": "Chúng tôi có nhiều loại nước hoa."
                    },
                    {
                        "en": "the perfume counter of the store",
                        "vi": "quầy nước hoa của cửa hàng"
                    },
                    {
                        "en": "She was wearing too much perfume.",
                        "vi": "Cô ấy đã xức quá nhiều nước hoa."
                    },
                    {
                        "en": "There was strong smell of cheap perfume in the car.",
                        "vi": "Có mùi nước hoa rẻ tiền trong xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a pleasant, often sweet, smell",
                    "vi": "một mùi dễ chịu, thường ngọt ngào"
                },
                "examples": [
                    {
                        "en": "the heady perfume of the roses",
                        "vi": "hương thơm nồng nàn của hoa hồng"
                    }
                ]
            }
        ]
    },
    {
        "id": "2f2c985634df45829d39fa9f9c951560",
        "word": "accessory",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əkˈsesəri/",
            "us": "/əkˈsesəri/"
        },
        "nearby": [
            {
                "word": "accession",
                "pos": "noun"
            },
            {
                "word": "accessorize",
                "pos": "verb"
            },
            {
                "word": "accessory",
                "pos": "noun"
            },
            {
                "word": "accessory",
                "pos": "adjective"
            },
            {
                "word": "access provider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra piece of equipment that is useful but not essential or that can be added to something else as a decoration",
                    "vi": "một phần thiết bị bổ sung hữu ích nhưng không cần thiết hoặc có thể được thêm vào một thứ khác như một vật trang trí"
                },
                "examples": [
                    {
                        "en": "We stock a large range of bicycle accessories.",
                        "vi": "Chúng tôi có một lượng lớn các phụ kiện xe đạp."
                    },
                    {
                        "en": "Our catalogue now includes a range of furnishings and accessories for the home.",
                        "vi": "Danh mục của chúng tôi hiện bao gồm một loạt các đồ nội thất và phụ kiện cho ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you can wear or carry that matches your clothes, for example a belt or a bag",
                    "vi": "một thứ mà bạn có thể mặc hoặc mang theo phù hợp với quần áo của mình, ví dụ như thắt lưng hoặc túi xách"
                },
                "examples": [
                    {
                        "en": "fashion accessories to dress up your wardrobe",
                        "vi": "phụ kiện thời trang để trang điểm cho tủ quần áo của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who helps somebody to commit a crime or who knows about it and protects the person from the police",
                    "vi": "người giúp ai đó phạm tội hoặc người biết về điều đó và bảo vệ người đó khỏi cảnh sát"
                },
                "examples": [
                    {
                        "en": "He was charged with being an accessory to murder.",
                        "vi": "Anh ta bị buộc tội là một phụ kiện cho tội giết người."
                    },
                    {
                        "en": "(old-fashioned) an accessory before/after the fact (= before/after the crime was committed)",
                        "vi": "(kiểu cũ) một phụ kiện trước / sau sự việc (= trước / sau khi tội ác được thực hiện)"
                    }
                ]
            }
        ]
    },
    {
        "id": "71bb5256bd444bf3b28dc939f7a6196b",
        "word": "cutlery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkʌtləri/",
            "us": "/ˈkʌtləri/"
        },
        "nearby": [
            {
                "word": "cut-in",
                "pos": "noun"
            },
            {
                "word": "cutlass",
                "pos": "noun"
            },
            {
                "word": "cutlery",
                "pos": "noun"
            },
            {
                "word": "cutlet",
                "pos": "noun"
            },
            {
                "word": "cut off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "knives, forks and spoons, used for eating and serving food",
                    "vi": "dao, nĩa và thìa dùng để ăn và dọn thức ăn"
                },
                "examples": [
                    {
                        "en": "Put the cutlery in the drawer.",
                        "vi": "Đặt dao kéo vào ngăn kéo."
                    },
                    {
                        "en": "a stainless steel cutlery set",
                        "vi": "một bộ dao kéo bằng thép không gỉ"
                    },
                    {
                        "en": "They had a canteen of cutlery as a wedding present.",
                        "vi": "Họ có một căng tin dao kéo như một món quà cưới."
                    },
                    {
                        "en": "a 24-piece cutlery set",
                        "vi": "bộ dao kéo 24 món"
                    }
                ]
            },
            {
                "define": {
                    "en": "knives, etc. that are sharp",
                    "vi": "dao, v.v. sắc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e8da06f720247e899a02151c599ecd6",
        "word": "food hall",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfuːd hɔːl/",
            "us": "/ˈfuːd hɔːl/"
        },
        "nearby": [
            {
                "word": "food court",
                "pos": "noun"
            },
            {
                "word": "food group",
                "pos": "noun"
            },
            {
                "word": "food hall",
                "pos": "noun"
            },
            {
                "word": "foodie",
                "pos": "noun"
            },
            {
                "word": "foodie",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large area in a department store where people can buy food",
                    "vi": "một khu vực rộng lớn trong cửa hàng bách hóa nơi mọi người có thể mua thực phẩm"
                },
                "examples": [
                    {
                        "en": "Selfridge's food hall in London was selling several varieties of French apples.",
                        "vi": "Phòng ăn của Selfridge ở London bán nhiều loại táo Pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "27dc6a059f534271bab260c47395d9ce",
        "word": "fragrance",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfreɪɡrəns/",
            "us": "/ˈfreɪɡrəns/"
        },
        "nearby": [
            {
                "word": "fragmentation grenade",
                "pos": "noun"
            },
            {
                "word": "fragmented",
                "pos": "adjective"
            },
            {
                "word": "fragrance",
                "pos": "noun"
            },
            {
                "word": "fragrant",
                "pos": "adjective"
            },
            {
                "word": "fragrantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pleasant smell",
                    "vi": "một mùi dễ chịu"
                },
                "examples": [
                    {
                        "en": "The bath oil comes in various fragrances.",
                        "vi": "Dầu tắm có nhiều mùi thơm khác nhau."
                    },
                    {
                        "en": "The flowers are chosen for their delicate fragrance.",
                        "vi": "Những bông hoa được chọn vì hương thơm tinh tế của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a liquid that you put on your skin in order to make yourself smell nice",
                    "vi": "một chất lỏng mà bạn bôi lên da để làm cho mình có mùi thơm"
                },
                "examples": [
                    {
                        "en": "an exciting new fragrance from Dior",
                        "vi": "một hương thơm mới thú vị từ Dior"
                    },
                    {
                        "en": "They are about to launch their first fragrance for men.",
                        "vi": "Họ chuẩn bị tung ra loại nước hoa đầu tiên dành cho nam giới."
                    }
                ]
            }
        ]
    },
    {
        "id": "b653bec81d9a421092f5f7374cfc0730",
        "word": "linen",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlɪnɪn/",
            "us": "/ˈlɪnɪn/"
        },
        "nearby": [
            {
                "word": "line management",
                "pos": "noun"
            },
            {
                "word": "line manager",
                "pos": "noun"
            },
            {
                "word": "linen",
                "pos": "noun"
            },
            {
                "word": "line of credit",
                "pos": "noun"
            },
            {
                "word": "line of latitude",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of cloth made from flax, used to make high-quality clothes, sheets, etc.",
                    "vi": "một loại vải làm từ cây lanh, được sử dụng để làm quần áo chất lượng cao, khăn trải giường, v.v."
                },
                "examples": [
                    {
                        "en": "a linen tablecloth",
                        "vi": "khăn trải bàn bằng vải lanh"
                    },
                    {
                        "en": "a fine linen shirt",
                        "vi": "một chiếc áo sơ mi vải lanh mịn"
                    }
                ]
            },
            {
                "define": {
                    "en": "sheets, tablecloths, pillowcases, etc.",
                    "vi": "khăn trải giường, khăn trải bàn, áo gối, v.v."
                },
                "examples": [
                    {
                        "en": "(British English) a linen cupboard",
                        "vi": "(Tiếng Anh Anh) một tủ vải lanh"
                    },
                    {
                        "en": "(North American English) a linen closet",
                        "vi": "(Tiếng Anh Bắc Mỹ) một tủ quần áo bằng vải lanh"
                    },
                    {
                        "en": "We change the bed linen once a week.",
                        "vi": "Chúng tôi thay khăn trải giường mỗi tuần một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to discuss your personal affairs in public, especially something embarrassing",
                    "vi": "để thảo luận về công việc cá nhân của bạn ở nơi công cộng, đặc biệt là điều gì đó đáng xấu hổ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3488e29a189844e893cc06bbd8e2cc08",
        "word": "stationery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsteɪʃənri/",
            "us": "/ˈsteɪʃəneri/"
        },
        "nearby": [
            {
                "word": "stationary",
                "pos": "adjective"
            },
            {
                "word": "stationer",
                "pos": "noun"
            },
            {
                "word": "stationery",
                "pos": "noun"
            },
            {
                "word": "the Stationery Office",
                "pos": ""
            },
            {
                "word": "station house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "materials for writing and for using in an office, for example paper, pens and envelopes",
                    "vi": "vật liệu để viết và sử dụng trong văn phòng, ví dụ như giấy, bút và phong bì"
                },
                "examples": [
                    {
                        "en": "The traffic was completely stationary.",
                        "vi": "Giao thông hoàn toàn đứng yên."
                    }
                ]
            },
            {
                "define": {
                    "en": "special paper for writing letters on",
                    "vi": "giấy đặc biệt để viết thư trên"
                },
                "examples": [
                    {
                        "en": "The logo featured on the letterhead stationery for the Association.",
                        "vi": "Logo đặc trưng trên giấy tiêu đề văn phòng phẩm của Hiệp hội."
                    },
                    {
                        "en": "handmade wedding stationery",
                        "vi": "văn phòng phẩm đám cưới thủ công"
                    }
                ]
            }
        ]
    },
    {
        "id": "685659cc3f694fde9dd960142c70e34e",
        "word": "bedding",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbedɪŋ/",
            "us": "/ˈbedɪŋ/"
        },
        "nearby": [
            {
                "word": "bedclothes",
                "pos": "noun"
            },
            {
                "word": "bedcover",
                "pos": "noun"
            },
            {
                "word": "bedding",
                "pos": "noun"
            },
            {
                "word": "bedding plant",
                "pos": "noun"
            },
            {
                "word": "bed down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the sheets and covers that you put on a bed, and often also the mattress and the pillows",
                    "vi": "khăn trải giường mà bạn đặt trên giường, và thường là cả nệm và gối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "straw, etc. for animals to sleep on",
                    "vi": "rơm, v.v. để động vật ngủ trên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "448891fa137a4fd890bff3bc85f56bb1",
        "word": "cookware",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʊkweə(r)/",
            "us": "/ˈkʊkwer/"
        },
        "nearby": [
            {
                "word": "Catherine Cookson",
                "pos": ""
            },
            {
                "word": "cook up",
                "pos": "phrasal verb"
            },
            {
                "word": "cookware",
                "pos": "noun"
            },
            {
                "word": "cool",
                "pos": "adjective"
            },
            {
                "word": "cool",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pots and containers used in cooking",
                    "vi": "nồi và hộp đựng được sử dụng trong nấu ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "389393574cc14fcf8b85f66d27609d8a",
        "word": "crockery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒkəri/",
            "us": "/ˈkrɑːkəri/"
        },
        "nearby": [
            {
                "word": "crock",
                "pos": "noun"
            },
            {
                "word": "crocked",
                "pos": "adjective"
            },
            {
                "word": "crockery",
                "pos": "noun"
            },
            {
                "word": "Davy Crockett",
                "pos": ""
            },
            {
                "word": "Crockford's",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "plates, cups, dishes, etc.",
                    "vi": "đĩa, chén, đĩa, v.v."
                },
                "examples": [
                    {
                        "en": "They would like crockery and cutlery as wedding presents.",
                        "vi": "Họ muốn đồ sành sứ và dao kéo làm quà cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "dishes, etc. that you use in the oven",
                    "vi": "các món ăn, v.v. mà bạn sử dụng trong lò"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be8166a5554f4589b9896f200240d40b",
        "word": "furnishings",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɜːnɪʃɪŋz/",
            "us": "/ˈfɜːrnɪʃɪŋz/"
        },
        "nearby": [
            {
                "word": "furnish",
                "pos": "verb"
            },
            {
                "word": "furnished",
                "pos": "adjective"
            },
            {
                "word": "furnishings",
                "pos": "noun"
            },
            {
                "word": "furniture",
                "pos": "noun"
            },
            {
                "word": "furniture beetle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the furniture, carpets, curtains, etc. in a room or house",
                    "vi": "đồ nội thất, thảm, rèm cửa, v.v. trong phòng hoặc nhà"
                },
                "examples": [
                    {
                        "en": "soft furnishings",
                        "vi": "đồ nội thất mềm"
                    },
                    {
                        "en": "The wallpaper should match the furnishings.",
                        "vi": "Hình nền phải phù hợp với đồ nội thất."
                    }
                ]
            }
        ]
    },
    {
        "id": "92168585dcbf4b47900e41102b49956a",
        "word": "glassware",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡlɑːsweə(r)/",
            "us": "/ˈɡlæswer/"
        },
        "nearby": [
            {
                "word": "glass over",
                "pos": "phrasal verb"
            },
            {
                "word": "glasspaper",
                "pos": "noun"
            },
            {
                "word": "glassware",
                "pos": "noun"
            },
            {
                "word": "glassy",
                "pos": "adjective"
            },
            {
                "word": "Glastonbury",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "objects made of glass",
                    "vi": "đồ vật làm bằng thủy tinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be33f918c4f54d1b829ab9dbd4948030",
        "word": "haberdashery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhæbəˈdæʃəri/",
            "us": "/ˈhæbərdæʃəri/"
        },
        "nearby": [
            {
                "word": "habeas corpus",
                "pos": "noun"
            },
            {
                "word": "haberdasher",
                "pos": "noun"
            },
            {
                "word": "haberdashery",
                "pos": "noun"
            },
            {
                "word": "habit",
                "pos": "noun"
            },
            {
                "word": "habitable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small articles for sewing, for example needles, pins, cotton and buttons",
                    "vi": "các mặt hàng nhỏ để may, ví dụ như kim, ghim, bông và cúc áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "men’s clothes",
                    "vi": "quần áo nam"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a shop or part of a shop where haberdashery is sold",
                    "vi": "một cửa hàng hoặc một phần của cửa hàng nơi bán đồ may mặc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c356092115284f5cb3c0abb2f8488dcb",
        "word": "skincare",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskɪnkeə(r)/",
            "us": "/ˈskɪnker/"
        },
        "nearby": [
            {
                "word": "skin",
                "pos": "noun"
            },
            {
                "word": "skin",
                "pos": "verb"
            },
            {
                "word": "skincare",
                "pos": "noun"
            },
            {
                "word": "skin-deep",
                "pos": "adjective"
            },
            {
                "word": "skinder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the use of creams and special products to look after your skin",
                    "vi": "việc sử dụng các loại kem và các sản phẩm đặc biệt để chăm sóc làn da của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "07af51d062a240238ab0021f3f69f31c",
        "word": "toiletries",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɔɪlətriz/",
            "us": "/ˈtɔɪlətriz/"
        },
        "nearby": [
            {
                "word": "toilet bag",
                "pos": "noun"
            },
            {
                "word": "toilet paper",
                "pos": "noun"
            },
            {
                "word": "toiletries",
                "pos": "noun"
            },
            {
                "word": "toilet roll",
                "pos": "noun"
            },
            {
                "word": "toiletry bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "things such as soap or toothpaste that you use for washing, cleaning your teeth, etc.",
                    "vi": "những thứ như xà phòng hoặc kem đánh răng mà bạn dùng để rửa, làm sạch răng, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "092ee48677cf4cfc9c8e058a1ce90532",
        "word": "white goods",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪt ɡʊdz/",
            "us": "/ˈwaɪt ɡʊdz/"
        },
        "nearby": [
            {
                "word": "white flight",
                "pos": "noun"
            },
            {
                "word": "white flour",
                "pos": "noun"
            },
            {
                "word": "white goods",
                "pos": "noun"
            },
            {
                "word": "Whitehall",
                "pos": "noun"
            },
            {
                "word": "the Whitehall Theatre",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "large pieces of electrical equipment in the house, such as washing machines, etc.",
                    "vi": "các thiết bị điện lớn trong nhà, chẳng hạn như máy giặt, v.v."
                },
                "examples": []
            }
        ]
    }
]