[
    {
        "id": "45034f10f57c4b9d988919e165039e76",
        "word": "pool",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/puːl/",
            "us": "/puːl/"
        },
        "nearby": [
            {
                "word": "pooh-pooh",
                "pos": "verb"
            },
            {
                "word": "Poohsticks",
                "pos": "noun"
            },
            {
                "word": "pool",
                "pos": "noun"
            },
            {
                "word": "pool",
                "pos": "verb"
            },
            {
                "word": "Poole",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of water that has been created for people to swim in",
                    "vi": "một vùng nước đã được tạo ra để mọi người bơi vào"
                },
                "examples": [
                    {
                        "en": "an indoor/outdoor pool",
                        "vi": "một hồ bơi trong nhà / ngoài trời"
                    },
                    {
                        "en": "Does the hotel have a pool?",
                        "vi": "Khách sạn có hồ bơi không?"
                    },
                    {
                        "en": "relaxing by the pool",
                        "vi": "thư giãn bên hồ bơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the building that contains a public pool",
                    "vi": "tòa nhà có một hồ bơi công cộng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small area of still water, especially one that has formed naturally",
                    "vi": "một vùng nước tĩnh nhỏ, đặc biệt là vùng nước đã hình thành tự nhiên"
                },
                "examples": [
                    {
                        "en": "freshwater/thermal pools",
                        "vi": "hồ bơi nước ngọt / nước nóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of liquid or light lying on a surface",
                    "vi": "một lượng nhỏ chất lỏng hoặc ánh sáng nằm trên bề mặt"
                },
                "examples": [
                    {
                        "en": "pool of something The body was lying in a pool of blood.",
                        "vi": "vũng máu. Cái xác nằm trong vũng máu."
                    },
                    {
                        "en": "a pool of light",
                        "vi": "một hồ bơi ánh sáng"
                    },
                    {
                        "en": "The water ran down out of their clothes and formed a pool on floor.",
                        "vi": "Nước chảy xuống quần áo của họ và tạo thành một hồ bơi trên sàn nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a supply of things or money that is shared by a group of people and can be used when needed",
                    "vi": "nguồn cung cấp đồ vật hoặc tiền bạc được chia sẻ bởi một nhóm người và có thể được sử dụng khi cần"
                },
                "examples": [
                    {
                        "en": "a pool of cars used by the firm’s sales force",
                        "vi": "một nhóm xe hơi được sử dụng bởi lực lượng bán hàng của công ty"
                    },
                    {
                        "en": "a pool car",
                        "vi": "một chiếc xe hồ bơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people available for work when needed",
                    "vi": "một nhóm người sẵn sàng làm việc khi cần thiết"
                },
                "examples": [
                    {
                        "en": "a pool of cheap labour",
                        "vi": "một nhóm lao động giá rẻ"
                    },
                    {
                        "en": "I started my career in the typing pool (= a group of people who shared a company’s typing work) over 40 years ago.",
                        "vi": "Tôi bắt đầu sự nghiệp của mình trong nhóm đánh máy (= một nhóm người chia sẻ công việc đánh máy của một công ty) hơn 40 năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game for two people played with 16 balls on a table, often in pubs and bars. Players use cues (= long sticks) to try to hit the balls into pockets at the edge of the table.",
                    "vi": "một trò chơi dành cho hai người chơi với 16 quả bóng trên bàn, thường ở các quán rượu và quán bar. Người chơi sử dụng các gợi ý (= gậy dài) để cố gắng đánh bóng vào túi ở mép bàn."
                },
                "examples": [
                    {
                        "en": "a pool table",
                        "vi": "một bàn bi-a"
                    },
                    {
                        "en": "to shoot (= play) pool",
                        "vi": "bắn (= chơi) hồ bơi"
                    },
                    {
                        "en": "Do you play pool?",
                        "vi": "Bạn có chơi bi-a không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a form of gambling in the UK in which people try to win money by saying what the results of football matches will be",
                    "vi": "một hình thức đánh bạc ở Vương quốc Anh trong đó mọi người cố gắng thắng tiền bằng cách nói kết quả của các trận đấu bóng đá sẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "He does the pools every week.",
                        "vi": "Anh ấy làm hồ bơi mỗi tuần."
                    },
                    {
                        "en": "a pools winner",
                        "vi": "một người chiến thắng hồ bơi"
                    }
                ]
            }
        ]
    },
    {
        "id": "c6c409d37f974e4d9e6722dabea8957f",
        "word": "poolroom",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpuːlruːm/",
            "us": "/ˈpuːlruːm/"
        },
        "nearby": [
            {
                "word": "pool",
                "pos": "verb"
            },
            {
                "word": "Poole",
                "pos": ""
            },
            {
                "word": "poolroom",
                "pos": "noun"
            },
            {
                "word": "poolside",
                "pos": "noun"
            },
            {
                "word": "poop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place for playing a game of pool",
                    "vi": "một nơi để chơi bi-a"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a betting shop",
                    "vi": "một cửa hàng cá cược"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2035c199194e4a75a215646f52df8494",
        "word": "baize",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/beɪz/",
            "us": "/beɪz/"
        },
        "nearby": [
            {
                "word": "bait",
                "pos": "verb"
            },
            {
                "word": "bait-and-switch",
                "pos": "noun"
            },
            {
                "word": "baize",
                "pos": "noun"
            },
            {
                "word": "bajillion",
                "pos": "noun"
            },
            {
                "word": "bake",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of thick cloth made of wool that is usually green, used especially for covering card tables and billiard, snooker or pool tables",
                    "vi": "một loại vải dày làm từ len thường có màu xanh lá cây, đặc biệt được sử dụng để phủ các bàn chơi bài và bàn bida, bi da hoặc bida."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0adb499346654b78ba95bd6004c1069e",
        "word": "billiard",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪliəd/",
            "us": "/ˈbɪljərd/"
        },
        "nearby": [
            {
                "word": "billfold",
                "pos": "noun"
            },
            {
                "word": "billhook",
                "pos": "noun"
            },
            {
                "word": "billiard",
                "pos": "adjective"
            },
            {
                "word": "billiards",
                "pos": "noun"
            },
            {
                "word": "Billie",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used for or connected with the game of billiards",
                    "vi": "được sử dụng cho hoặc kết nối với trò chơi bida"
                },
                "examples": [
                    {
                        "en": "a billiard cue",
                        "vi": "một tín hiệu bi-a"
                    }
                ]
            }
        ]
    },
    {
        "id": "b57c9bb3a6134430a771c4bab150c692",
        "word": "billiards",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪliədz/",
            "us": "/ˈbɪljərdz/"
        },
        "nearby": [
            {
                "word": "billhook",
                "pos": "noun"
            },
            {
                "word": "billiard",
                "pos": "adjective"
            },
            {
                "word": "billiards",
                "pos": "noun"
            },
            {
                "word": "Billie",
                "pos": ""
            },
            {
                "word": "billing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two people played with cues (= long sticks) and three balls on a long table covered with green cloth. Players try to hit the balls against each other and into pockets at the edge of the table.",
                    "vi": "một trò chơi dành cho hai người chơi với que tính (= que dài) và ba quả bóng trên một chiếc bàn dài phủ vải xanh. Người chơi cố gắng đánh các quả bóng vào nhau và vào túi ở mép bàn."
                },
                "examples": [
                    {
                        "en": "a game of billiards",
                        "vi": "một trò chơi bida"
                    }
                ]
            }
        ]
    },
    {
        "id": "227c2d2226e241eeb98a3ae606a9b465",
        "word": "break",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/breɪk/",
            "us": "/breɪk/"
        },
        "nearby": [
            {
                "word": "breadwinner",
                "pos": "noun"
            },
            {
                "word": "break",
                "pos": "verb"
            },
            {
                "word": "break",
                "pos": "noun"
            },
            {
                "word": "breakable",
                "pos": "adjective"
            },
            {
                "word": "breakage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short period of time when you stop what you are doing and rest, eat, etc.",
                    "vi": "một khoảng thời gian ngắn khi bạn dừng việc đang làm và nghỉ ngơi, ăn uống, v.v."
                },
                "examples": [
                    {
                        "en": "She was on her lunch break.",
                        "vi": "Cô ấy đang nghỉ trưa."
                    },
                    {
                        "en": "a coffee/tea break",
                        "vi": "một ly cà phê / trà"
                    },
                    {
                        "en": "Let's take a break.",
                        "vi": "Hãy nghỉ ngơi đi."
                    },
                    {
                        "en": "break for something a break for lunch",
                        "vi": "nghỉ ngơi cho một cái gì đó nghỉ ngơi cho bữa trưa"
                    },
                    {
                        "en": "a bathroom break (= a short period when somebody stops what they are doing to use the toilet)",
                        "vi": "nghỉ trong phòng tắm (= một khoảng thời gian ngắn khi ai đó ngừng việc họ đang làm để đi vệ sinh)"
                    },
                    {
                        "en": "She worked all day without a break.",
                        "vi": "Cô ấy đã làm việc cả ngày không nghỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time between lessons at school",
                    "vi": "một khoảng thời gian giữa các bài học ở trường"
                },
                "examples": [
                    {
                        "en": "Come and see me at break.",
                        "vi": "Hãy đến và gặp tôi lúc giải lao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time when something stops before starting again",
                    "vi": "một khoảng thời gian khi một cái gì đó dừng lại trước khi bắt đầu lại"
                },
                "examples": [
                    {
                        "en": "Employees can take a career break of up to one year.",
                        "vi": "Nhân viên có thể nghỉ việc lên đến một năm."
                    },
                    {
                        "en": "break in something a break in my daily routine",
                        "vi": "phá vỡ một cái gì đó phá vỡ trong thói quen hàng ngày của tôi"
                    },
                    {
                        "en": "break from something He is having a break from his successful television show.",
                        "vi": "break from something Anh ấy đang nghỉ giải lao khỏi chương trình truyền hình thành công của mình."
                    },
                    {
                        "en": "break from doing something I need a break from caring for the children.",
                        "vi": "nghỉ làm việc gì đó Tôi cần nghỉ chăm sóc bọn trẻ."
                    },
                    {
                        "en": "the summer/winter break",
                        "vi": "kỳ nghỉ hè / nghỉ đông"
                    },
                    {
                        "en": "(especially British English) the Christmas/Easter break (= the period at Christmas/Easter when most people do not work)",
                        "vi": "(đặc biệt là tiếng Anh Anh) kỳ nghỉ Giáng sinh / Lễ Phục sinh (= khoảng thời gian vào Lễ Giáng sinh / Lễ Phục sinh khi hầu hết mọi người không làm việc)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of time when a television or radio show stops for advertisements",
                    "vi": "một khoảng thời gian ngắn khi một chương trình truyền hình hoặc đài phát thanh ngừng quảng cáo"
                },
                "examples": [
                    {
                        "en": "More news after the break.",
                        "vi": "Thêm tin tức sau giờ nghỉ."
                    },
                    {
                        "en": "Most viewers tend to skip through the ad breaks.",
                        "vi": "Hầu hết người xem có xu hướng bỏ qua các phần ngắt quảng cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short holiday",
                    "vi": "một kỳ nghỉ ngắn ngày"
                },
                "examples": [
                    {
                        "en": "We had a weekend break in New York.",
                        "vi": "Chúng tôi đã có một kỳ nghỉ cuối tuần ở New York."
                    },
                    {
                        "en": "a well-earned break",
                        "vi": "một kỳ nghỉ kiếm được nhiều tiền"
                    },
                    {
                        "en": "a two/three-night break",
                        "vi": "nghỉ hai / ba đêm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the moment when a situation or a relationship that has existed for a time changes, ends or is interrupted",
                    "vi": "thời điểm mà một tình huống hoặc một mối quan hệ đã tồn tại trong một thời gian thay đổi, kết thúc hoặc bị gián đoạn"
                },
                "examples": [
                    {
                        "en": "I wanted to leave but was nervous about making the break.",
                        "vi": "Tôi muốn rời đi nhưng lo lắng về việc nghỉ giải lao."
                    },
                    {
                        "en": "break with somebody/something He needed to make a complete break with the past.",
                        "vi": "chia tay với ai đó / điều gì đó Anh ấy cần phải đoạn tuyệt hoàn toàn với quá khứ."
                    },
                    {
                        "en": "a break with tradition (= a change from what is accepted, in something such as art, behaviour, etc.)",
                        "vi": "đoạn tuyệt với truyền thống (= một sự thay đổi so với những gì được chấp nhận, trong một cái gì đó chẳng hạn như nghệ thuật, hành vi, v.v.)"
                    },
                    {
                        "en": "break in something a break in the weather (= a change from one type of weather to a different one)",
                        "vi": "phá vỡ điều gì đó nghỉ ngơi trong thời tiết (= sự thay đổi từ một kiểu thời tiết này sang kiểu thời tiết khác)"
                    },
                    {
                        "en": "a break in diplomatic relations",
                        "vi": "đứt gãy quan hệ ngoại giao"
                    },
                    {
                        "en": "break from something This event represents a real break from tradition.",
                        "vi": "phá vỡ một cái gì đó Sự kiện này đại diện cho một sự phá vỡ thực sự khỏi truyền thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a space or an opening between two or more things",
                    "vi": "một khoảng trống hoặc một khoảng trống giữa hai hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "We could see the moon through a break in the clouds.",
                        "vi": "Chúng tôi có thể nhìn thấy mặt trăng qua một đám mây."
                    },
                    {
                        "en": "Wait for a break in the traffic before crossing the road.",
                        "vi": "Chờ cho xe tắc nghẽn trước khi băng qua đường."
                    },
                    {
                        "en": "The track bends left through a break in the hedge.",
                        "vi": "Đường đi uốn cong bên trái thông qua một điểm gãy trong hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "an opportunity to do something, usually to get something that you want or to achieve success",
                    "vi": "cơ hội để làm điều gì đó, thường là để đạt được điều gì đó bạn muốn hoặc đạt được thành công"
                },
                "examples": [
                    {
                        "en": "I got my lucky break when I won a ‘Young Journalist of the Year’ competition.",
                        "vi": "Tôi đã có một cơ hội may mắn khi giành chiến thắng trong cuộc thi 'Nhà báo trẻ của năm'."
                    },
                    {
                        "en": "We've had a few bad breaks (= pieces of bad luck) along the way.",
                        "vi": "Chúng tôi đã có một vài lần đổ vỡ tồi tệ (= những phần kém may mắn) trong suốt chặng đường."
                    },
                    {
                        "en": "If you just give me a break, you won’t regret it.",
                        "vi": "Chỉ cần anh cho em nghỉ ngơi, anh sẽ không hối hận."
                    },
                    {
                        "en": "He's the director who gave her her first big break.",
                        "vi": "Anh ấy là giám đốc đã mang lại cho cô ấy bước đột phá lớn đầu tiên."
                    },
                    {
                        "en": "It's often difficult for talented newcomers to get the break they deserve.",
                        "vi": "Những người mới tài năng thường khó có được kỳ nghỉ xứng đáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where something, especially a bone in your body, has broken",
                    "vi": "nơi có thứ gì đó, đặc biệt là xương trong cơ thể bạn, bị gãy"
                },
                "examples": [
                    {
                        "en": "The X-ray showed there was no break in his leg.",
                        "vi": "Ảnh chụp X-quang cho thấy không có vết gãy ở chân của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a win in a game in which your opponent is serving",
                    "vi": "chiến thắng trong một trò chơi mà đối thủ của bạn đang giao bóng"
                },
                "examples": [
                    {
                        "en": "It was her second break in the set.",
                        "vi": "Đó là lần nghỉ thứ hai của cô trong phim trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of successful shots by one player; the number of points scored in a series of successful shots",
                    "vi": "một loạt các cú sút thành công của một cầu thủ; số điểm ghi được trong một loạt các cú sút thành công"
                },
                "examples": [
                    {
                        "en": "He's put together a magnificent break.",
                        "vi": "Anh ấy đã cùng nhau tạo nên một kỳ nghỉ tuyệt vời."
                    },
                    {
                        "en": "a 147 break (= the highest possible break in snooker)",
                        "vi": "break 147 (= break cao nhất có thể có trong bi da)"
                    },
                    {
                        "en": "The champion began with breaks of 74 and 58.",
                        "vi": "Nhà vô địch bắt đầu với các break ở 74 và 58."
                    }
                ]
            },
            {
                "define": {
                    "en": "the moment in the early hours of the morning when it begins to get light",
                    "vi": "thời điểm vào sáng sớm khi trời bắt đầu sáng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a complete end to any connection with a person, an organization, a way of life, etc.",
                    "vi": "một kết thúc hoàn toàn cho bất kỳ mối liên hệ nào với một người, một tổ chức, một lối sống, v.v."
                },
                "examples": [
                    {
                        "en": "She wanted to make a clean break with the past.",
                        "vi": "Cô muốn đoạn tuyệt với quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a break in a bone in one place",
                    "vi": "gãy xương ở một chỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody a chance; to not judge somebody too severely",
                    "vi": "để cho ai đó một cơ hội; không đánh giá ai đó quá nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Give the lad a break—it's only his second day on the job.",
                        "vi": "Hãy cho chàng trai nghỉ ngơi — đó mới chỉ là ngày thứ hai anh ta làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when somebody wants somebody else to stop doing or saying something that is annoying, or to stop saying something that is not true",
                    "vi": "được sử dụng khi ai đó muốn người khác ngừng làm hoặc nói điều gì đó gây khó chịu hoặc ngừng nói điều gì đó không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run towards something in order to try and escape",
                    "vi": "chạy về phía thứ gì đó để cố gắng trốn thoát"
                },
                "examples": [
                    {
                        "en": "He suddenly leapt up and made a break for the door.",
                        "vi": "Anh đột ngột nhảy lên và phá cửa."
                    },
                    {
                        "en": "They decided to make a break for it (= to try and escape) that night.",
                        "vi": "Họ quyết định nghỉ ngơi cho nó (= cố gắng trốn thoát) vào đêm hôm đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "faae56622fb848ae8349ae29b6825b6e",
        "word": "cue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kjuː/",
            "us": "/kjuː/"
        },
        "nearby": [
            {
                "word": "cudgel",
                "pos": "noun"
            },
            {
                "word": "cudgel",
                "pos": "verb"
            },
            {
                "word": "cue",
                "pos": "noun"
            },
            {
                "word": "cue",
                "pos": "verb"
            },
            {
                "word": "cue ball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action or event that is a signal for somebody to do something",
                    "vi": "một hành động hoặc sự kiện là tín hiệu cho ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "cue (for something) Jon's arrival was a cue for more champagne.",
                        "vi": "gợi ý (vì điều gì đó) Sự đến của Jon là một gợi ý cho thêm rượu sâm panh."
                    },
                    {
                        "en": "cue to do something I think that's my cue to explain why I'm here.",
                        "vi": "gợi ý để làm điều gì đó Tôi nghĩ đó là gợi ý của tôi để giải thích tại sao tôi ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a few words or an action in a play that is a signal for another actor to do something",
                    "vi": "một vài từ hoặc một hành động trong vở kịch là tín hiệu cho một diễn viên khác làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She stood in the wings and waited for her cue to go on.",
                        "vi": "Cô đứng trong cánh và chờ tín hiệu của mình tiếp tục."
                    },
                    {
                        "en": "She had not yet been given the cue to go on to the stage.",
                        "vi": "Cô vẫn chưa được gợi ý để bước lên sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long wooden stick with a leather tip, used for hitting the ball in the games of billiards, pool and snooker",
                    "vi": "một thanh gỗ dài có đầu bằng da, dùng để đánh bóng trong các trò chơi bida, bida và bi da"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at exactly the moment you expect or that is appropriate",
                    "vi": "vào đúng thời điểm bạn mong đợi hoặc điều đó là thích hợp"
                },
                "examples": [
                    {
                        "en": "‘Where is that boy?’ As if on cue, Simon appeared in the doorway.",
                        "vi": "Cậu ấy ở đâu vậy?' Như được báo trước, Simon xuất hiện ở ngưỡng cửa."
                    },
                    {
                        "en": "I can't just cry on cue!",
                        "vi": "Tôi không thể chỉ khóc vì gợi ý!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy what somebody else does as an example of how to behave or what to do",
                    "vi": "sao chép những gì người khác làm như một ví dụ về cách cư xử hoặc những gì phải làm"
                },
                "examples": [
                    {
                        "en": "Investors are taking their cue from the big banks and selling dollars.",
                        "vi": "Các nhà đầu tư đang lấy tín hiệu của họ từ các ngân hàng lớn và bán đô la."
                    },
                    {
                        "en": "They all took their cue from their leader.",
                        "vi": "Tất cả đều lấy tín hiệu từ người lãnh đạo của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2f0be43a6284a3aac0c0e9596109547",
        "word": "cue ball",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkjuː bɔːl/",
            "us": "/ˈkjuː bɔːl/"
        },
        "nearby": [
            {
                "word": "cue",
                "pos": "noun"
            },
            {
                "word": "cue",
                "pos": "verb"
            },
            {
                "word": "cue ball",
                "pos": "noun"
            },
            {
                "word": "cue card",
                "pos": "noun"
            },
            {
                "word": "cuff",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ball that is hit with the cue in games such as billiards and snooker",
                    "vi": "bóng được đánh bằng cái gợi ý trong các trò chơi như bida và bi da"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a618f832a6bf4d468bfd601908567ffa",
        "word": "cushion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʊʃn/",
            "us": "/ˈkʊʃn/"
        },
        "nearby": [
            {
                "word": "curvy",
                "pos": "adjective"
            },
            {
                "word": "Lord Curzon",
                "pos": ""
            },
            {
                "word": "cushion",
                "pos": "noun"
            },
            {
                "word": "cushion",
                "pos": "verb"
            },
            {
                "word": "cushioned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cloth bag filled with soft material or feathers that is used, for example, to make a seat more comfortable",
                    "vi": "Ví dụ, một túi vải chứa đầy vật liệu mềm hoặc lông vũ được sử dụng để làm cho một chỗ ngồi thoải mái hơn"
                },
                "examples": [
                    {
                        "en": "matching curtains and cushions",
                        "vi": "phù hợp với rèm cửa và đệm"
                    },
                    {
                        "en": "a floor cushion (= a large cushion that you put on the floor to sit on)",
                        "vi": "đệm sàn (= đệm lớn mà bạn đặt trên sàn để ngồi)"
                    },
                    {
                        "en": "(figurative) a cushion of moss on a rock",
                        "vi": "(nghĩa bóng) một lớp rêu trên đá"
                    },
                    {
                        "en": "I rested my elbow on a cushion.",
                        "vi": "Tôi tựa khuỷu tay lên đệm."
                    },
                    {
                        "en": "She plumped up the sofa cushions before the guests arrived.",
                        "vi": "Cô thu dọn đệm ghế sofa trước khi khách đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer of something between two surfaces that keeps them apart",
                    "vi": "một lớp thứ gì đó giữa hai bề mặt giúp chúng tách rời nhau"
                },
                "examples": [
                    {
                        "en": "A hovercraft rides on a cushion of air.",
                        "vi": "Một thủy phi cơ cưỡi trên đệm khí."
                    },
                    {
                        "en": "Underlay forms a cushion between the carpet and the floor, to minimize wear.",
                        "vi": "Lớp lót tạo thành một lớp đệm giữa thảm và sàn, để giảm thiểu mài mòn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that protects you against something unpleasant that might happen",
                    "vi": "thứ gì đó bảo vệ bạn chống lại điều gì đó khó chịu có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "His savings were a comfortable cushion against financial problems.",
                        "vi": "Khoản tiết kiệm của anh ấy là một tấm đệm thoải mái chống lại các vấn đề tài chính."
                    },
                    {
                        "en": "The team built up a safe cushion of two goals in the first half.",
                        "vi": "Đội khách đã ghi được bàn thắng dẫn trước hai bàn trong hiệp một."
                    }
                ]
            },
            {
                "define": {
                    "en": "the soft inside edge along each side of the table that the balls bounce off",
                    "vi": "mép trong mềm dọc theo mỗi cạnh của bàn mà các quả bóng bật ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "89b8c4165d784adc8eec964a02b7c355",
        "word": "frame",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/freɪm/",
            "us": "/freɪm/"
        },
        "nearby": [
            {
                "word": "frail",
                "pos": "adjective"
            },
            {
                "word": "frailty",
                "pos": "noun"
            },
            {
                "word": "frame",
                "pos": "noun"
            },
            {
                "word": "frame",
                "pos": "verb"
            },
            {
                "word": "framed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong border or structure of wood, metal, etc. that holds a picture, door, piece of glass, etc. in position",
                    "vi": "một đường viền chắc chắn hoặc cấu trúc bằng gỗ, kim loại, v.v. để giữ hình ảnh, cánh cửa, mảnh kính, v.v. ở đúng vị trí"
                },
                "examples": [
                    {
                        "en": "a picture/photo frame",
                        "vi": "một bức tranh / khung ảnh"
                    },
                    {
                        "en": "aluminium window frames",
                        "vi": "khung cửa sổ nhôm"
                    },
                    {
                        "en": "I'm going to paint the door frame white.",
                        "vi": "Tôi sẽ sơn khung cửa màu trắng."
                    },
                    {
                        "en": "She leaned against the frame of the door.",
                        "vi": "Cô tựa vào khung cửa."
                    },
                    {
                        "en": "in a frame pictures in gold frames",
                        "vi": "trong khung hình trong khung vàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the supporting structure of a piece of furniture, a building, a vehicle, etc. that gives it its shape",
                    "vi": "cấu trúc hỗ trợ của một món đồ nội thất, một tòa nhà, một chiếc xe, v.v. tạo cho nó hình dạng của nó"
                },
                "examples": [
                    {
                        "en": "a bicycle frame",
                        "vi": "khung xe đạp"
                    },
                    {
                        "en": "The bed frame is made of pine.",
                        "vi": "Khung giường được làm bằng gỗ thông."
                    },
                    {
                        "en": "the frame of an aircraft/a car/a bicycle",
                        "vi": "khung của máy bay / ô tô / xe đạp"
                    },
                    {
                        "en": "In the 1920s, federal office buildings were typically built with steel frames encased in concrete or granite.",
                        "vi": "Vào những năm 1920, các tòa nhà văn phòng liên bang thường được xây dựng bằng khung thép bọc bê tông hoặc đá granit."
                    }
                ]
            },
            {
                "define": {
                    "en": "a structure of plastic or metal that holds the lenses in a pair of glasses",
                    "vi": "một cấu trúc bằng nhựa hoặc kim loại giữ các thấu kính trong một cặp kính"
                },
                "examples": [
                    {
                        "en": "gold-rimmed frames",
                        "vi": "gọng vàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the form or structure of a person or animal’s body",
                    "vi": "hình dạng hoặc cấu trúc của cơ thể người hoặc động vật"
                },
                "examples": [
                    {
                        "en": "to have a small/slender/large frame",
                        "vi": "để có một khung hình nhỏ / mảnh mai / lớn"
                    },
                    {
                        "en": "The bed was shorter than his six-foot frame.",
                        "vi": "Chiếc giường ngắn hơn khung chân anh sáu mét."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general ideas or structure that form the background to something",
                    "vi": "những ý tưởng hoặc cấu trúc chung tạo nền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "in/within the frame of something In this course we hope to look at literature in the frame of its social and historical context.",
                        "vi": "trong / trong khuôn khổ của một cái gì đó Trong khóa học này, chúng tôi hy vọng sẽ xem xét văn học trong khung của bối cảnh xã hội và lịch sử của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the single photographs that a film or video is made of",
                    "vi": "một trong những bức ảnh đơn lẻ mà phim hoặc video được tạo ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a single picture in a comic strip",
                    "vi": "một bức tranh trong truyện tranh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the separate areas on an internet page that you can scroll through (= read by moving the text up or down)",
                    "vi": "một trong những vùng riêng biệt trên trang internet mà bạn có thể cuộn qua (= đọc bằng cách di chuyển văn bản lên hoặc xuống)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small wooden or metal frame covered with glass that you grow seeds or small plants in to protect them from cold weather",
                    "vi": "một khung nhỏ bằng gỗ hoặc kim loại được phủ bằng thủy tinh để bạn trồng hạt giống hoặc cây nhỏ vào đó để bảo vệ chúng khỏi thời tiết lạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a single section of play in the game of snooker, etc., or in bowling",
                    "vi": "một phần chơi duy nhất trong trò chơi bi da, v.v. hoặc trong trò chơi bowling"
                },
                "examples": [
                    {
                        "en": "He won the first frame easily.",
                        "vi": "Anh ấy đã giành được khung thành đầu tiên một cách dễ dàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "be taking part/not taking part in something",
                    "vi": "đang tham gia / không tham gia vào điều gì đó"
                },
                "examples": [
                    {
                        "en": "We won our match, so we're still in the frame for the championship.",
                        "vi": "Chúng tôi đã thắng trận đấu của mình, vì vậy chúng tôi vẫn đang ở trong khả năng vô địch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be wanted/not wanted by the police because you are/are not suspected of having committed a crime",
                    "vi": "bị cảnh sát truy nã / không truy nã bởi vì bạn / không bị nghi ngờ là đã phạm tội"
                },
                "examples": [
                    {
                        "en": "He was always in the frame for the killing.",
                        "vi": "Anh ta luôn ở trong khung cho việc giết người."
                    }
                ]
            }
        ]
    },
    {
        "id": "fbc82c06de8d47d098a7e0cb35d13546",
        "word": "pocket",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒkɪt/",
            "us": "/ˈpɑːkɪt/"
        },
        "nearby": [
            {
                "word": "Pocahontas",
                "pos": ""
            },
            {
                "word": "pocked",
                "pos": "adjective"
            },
            {
                "word": "pocket",
                "pos": "noun"
            },
            {
                "word": "pocket",
                "pos": "verb"
            },
            {
                "word": "pocketbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of material like a small bag sewn into or onto a piece of clothing so that you can carry things in it",
                    "vi": "một mảnh vật liệu nhỏ như một chiếc túi nhỏ được khâu vào hoặc vào một bộ quần áo để bạn có thể đựng những thứ trong đó"
                },
                "examples": [
                    {
                        "en": "a jacket/coat/shirt/trouser pocket",
                        "vi": "áo khoác / áo khoác / áo sơ mi / túi quần"
                    },
                    {
                        "en": "a back/a hip/an inside pocket",
                        "vi": "lưng / hông / túi trong"
                    },
                    {
                        "en": "in/into a pocket I put the note in my pocket.",
                        "vi": "vào / vào túi Tôi bỏ tờ tiền vào túi."
                    },
                    {
                        "en": "The three of us stood there, hands in pockets, and waited.",
                        "vi": "Ba người chúng tôi đứng đó, tay đút túi và chờ đợi."
                    },
                    {
                        "en": "She reached into her pocket and pulled out her phone.",
                        "vi": "Cô ấy thò tay vào túi và rút điện thoại ra."
                    },
                    {
                        "en": "out of/from a pocket Take your hands out of your pockets!",
                        "vi": "ra / khỏi túi Bỏ tay ra khỏi túi!"
                    },
                    {
                        "en": "Turn out your pockets (= empty your pockets).",
                        "vi": "Quay ra khỏi túi của bạn (= làm trống túi của bạn)."
                    },
                    {
                        "en": "a pocket dictionary (= one that is small enough to fit in your pocket)",
                        "vi": "từ điển bỏ túi (= một từ điển đủ nhỏ để bỏ vào túi của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small bag or container fastened to something so that you can put things in it, for example, in a car door or in a bag",
                    "vi": "một túi nhỏ hoặc hộp đựng được gắn chặt vào một thứ gì đó để bạn có thể đặt mọi thứ vào đó, chẳng hạn như ở cửa xe hơi hoặc trong túi"
                },
                "examples": [
                    {
                        "en": "Information about safety procedures is in the pocket in front of you (= on a plane).",
                        "vi": "Thông tin về các thủ tục an toàn ở trong túi trước mặt bạn (= trên máy bay)."
                    },
                    {
                        "en": "Forged passports were found in a secret pocket in the suitcase.",
                        "vi": "Hộ chiếu giả được tìm thấy trong một túi bí mật trong vali."
                    },
                    {
                        "en": "a 20 litre rucksack with a pocket for a water bottle and map",
                        "vi": "một ba lô 20 lít có túi đựng chai nước và bản đồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about the amount of money that you have to spend",
                    "vi": "được sử dụng để nói về số tiền mà bạn phải chi tiêu"
                },
                "examples": [
                    {
                        "en": "We have holidays to suit every pocket.",
                        "vi": "Chúng tôi có những ngày nghỉ để phù hợp với mọi túi tiền."
                    },
                    {
                        "en": "He had no intention of paying for the meal out of his own pocket.",
                        "vi": "Anh không có ý định trả tiền cho bữa ăn bằng tiền túi của mình."
                    },
                    {
                        "en": "The libel case was a huge drain on her pocket.",
                        "vi": "Vụ kiện phỉ báng là một sự tiêu hao rất lớn trong túi của cô ấy."
                    },
                    {
                        "en": "tourists with bulging pockets",
                        "vi": "khách du lịch với túi phình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small group or area that is different from everyone or everything around it",
                    "vi": "một nhóm nhỏ hoặc khu vực khác với mọi người hoặc mọi thứ xung quanh nó"
                },
                "examples": [
                    {
                        "en": "There are still a few isolated pockets of resistance to the new regime.",
                        "vi": "Vẫn còn một số ít người bị cô lập phản đối chế độ mới."
                    },
                    {
                        "en": "The country has large pockets of unemployment.",
                        "vi": "Nước này có tỷ lệ thất nghiệp lớn."
                    },
                    {
                        "en": "a pocket of air",
                        "vi": "một túi không khí"
                    },
                    {
                        "en": "Geologists have found a few remaining pockets of iron ore.",
                        "vi": "Các nhà địa chất đã tìm thấy một vài túi quặng sắt còn sót lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the holes or nets around the edges of the table used in the games of billiards, pool or snooker, which you have to hit the ball into",
                    "vi": "bất kỳ lỗ hoặc lưới nào xung quanh các cạnh của bàn được sử dụng trong các trò chơi bida, bida hoặc bi da mà bạn phải đánh bóng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two people are or live in each other’s pockets, they are too close to each other or spend too much time with each other",
                    "vi": "nếu hai người đang hoặc sống trong túi của nhau, họ ở quá gần nhau hoặc dành quá nhiều thời gian cho nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be controlled or strongly influenced by somebody",
                    "vi": "bị kiểm soát hoặc bị ảnh hưởng mạnh mẽ bởi ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if money burns a hole in your pocket, you want to spend it as soon as you have it",
                    "vi": "nếu tiền làm cháy một lỗ trong túi của bạn, bạn muốn tiêu nó ngay khi có nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to spend some of your own money on something",
                    "vi": "chi tiêu một số tiền của riêng bạn cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was forced to dip into her own pocket to pay for the repairs.",
                        "vi": "Cô buộc phải tự bỏ tiền túi ra để trả tiền sửa chữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have influence or power over somebody, for example, a police officer or a politician, especially by threatening them or by offering them money",
                    "vi": "để có ảnh hưởng hoặc quyền lực đối với ai đó, ví dụ, một sĩ quan cảnh sát hoặc một chính trị gia, đặc biệt là bằng cách đe dọa họ hoặc bằng cách cho họ tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be certain to win something",
                    "vi": "để chắc chắn giành được một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having gained/lost money as a result of something",
                    "vi": "có được / mất tiền do kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We're in pocket on that deal.",
                        "vi": "Chúng tôi đang bỏ túi về thỏa thuận đó."
                    },
                    {
                        "en": "That one mistake left him thousands of pounds out of pocket.",
                        "vi": "Một sai lầm đó đã khiến anh ta phải bỏ túi hàng nghìn bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get richer or make somebody richer, especially by taking unfair advantage of a situation or by being dishonest",
                    "vi": "để giàu hơn hoặc làm cho ai đó giàu hơn, đặc biệt là bằng cách lợi dụng hoàn cảnh không công bằng hoặc bằng cách không trung thực"
                },
                "examples": [
                    {
                        "en": "Health services are lining the drug companies’ pockets, according to the report.",
                        "vi": "Theo báo cáo, các dịch vụ y tế đang móc hầu bao của các công ty dược phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somebody’s pocket without them noticing",
                    "vi": "ăn trộm thứ gì đó từ túi của ai đó mà họ không nhận ra"
                },
                "examples": [
                    {
                        "en": "The back pocket on a pair of jeans is the easiest one to pick.",
                        "vi": "Túi sau của quần jean là túi dễ chọn nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend money or give it to somebody",
                    "vi": "tiêu tiền hoặc đưa nó cho ai đó"
                },
                "examples": [
                    {
                        "en": "I've heard he doesn't like putting his hand in his pocket.",
                        "vi": "Tôi nghe nói anh ấy không thích đút tay vào túi."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f18304892654c5abf9a85cc5c0d8689",
        "word": "pot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pɒt/",
            "us": "/pɑːt/"
        },
        "nearby": [
            {
                "word": "postwoman",
                "pos": "noun"
            },
            {
                "word": "posy",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "verb"
            },
            {
                "word": "potable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deep round container used for cooking things in",
                    "vi": "một thùng tròn sâu được sử dụng để nấu những thứ trong"
                },
                "examples": [
                    {
                        "en": "pots and pans",
                        "vi": "nồi và chảo"
                    },
                    {
                        "en": "You'll need a large cooking pot with a tight-fitting lid.",
                        "vi": "Bạn sẽ cần một nồi nấu lớn có nắp đậy kín."
                    }
                ]
            },
            {
                "define": {
                    "en": "a container made of glass, clay or plastic, used for storing food in",
                    "vi": "hộp đựng bằng thủy tinh, đất sét hoặc nhựa, được sử dụng để đựng thực phẩm trong"
                },
                "examples": [
                    {
                        "en": "a pot of jam",
                        "vi": "một nồi mứt"
                    },
                    {
                        "en": "a yoghurt pot",
                        "vi": "một nồi sữa chua"
                    }
                ]
            },
            {
                "define": {
                    "en": "a container of various kinds, made for a particular purpose",
                    "vi": "một thùng chứa nhiều loại khác nhau, được làm cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a coffee pot",
                        "vi": "một bình cà phê"
                    },
                    {
                        "en": "a pencil pot",
                        "vi": "một chậu bút chì"
                    },
                    {
                        "en": "Is there any more tea in the pot?",
                        "vi": "Còn trà nào trong bình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount contained in a pot",
                    "vi": "số lượng chứa trong một cái chậu"
                },
                "examples": [
                    {
                        "en": "They drank a pot of coffee.",
                        "vi": "Họ uống một tách cà phê."
                    },
                    {
                        "en": "I had such a craving for marmalade when I was pregnant that I ate a whole pot in one day.",
                        "vi": "Tôi đã rất thèm mứt cam khi mang thai đến nỗi tôi đã ăn hết một nồi trong một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bowl, etc. that is made by a potter",
                    "vi": "một cái bát, v.v. được làm bởi một người thợ gốm"
                },
                "examples": [
                    {
                        "en": "The newly made pots are glazed when they are completely dry.",
                        "vi": "Chậu mới làm xong được tráng men khi chúng khô hoàn toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the total amount of money that is bet in a card game",
                    "vi": "tổng số tiền được đặt cược trong một trò chơi bài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the money given by a group of people in order to do something together, for example to buy food, or available for a particular purpose",
                    "vi": "tất cả số tiền do một nhóm người đưa ra để làm điều gì đó cùng nhau, chẳng hạn như mua thức ăn hoặc sẵn sàng cho một mục đích cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "cannabis (= a drug (illegal in many countries) made from the dried leaves and flowers of the hemp plant, which gives the person smoking it a feeling of being relaxed)",
                    "vi": "Cần sa (= một loại thuốc (bất hợp pháp ở nhiều quốc gia) được làm từ lá và hoa khô của cây gai dầu, mang lại cho người hút cảm giác thư thái)"
                },
                "examples": [
                    {
                        "en": "pot smoking",
                        "vi": "hút thuốc lá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a shot that somebody fires without aiming carefully",
                    "vi": "một phát súng mà ai đó bắn mà không nhắm cẩn thận"
                },
                "examples": [
                    {
                        "en": "He took a pot at the neighbour's cat with his air rifle.",
                        "vi": "Anh ta lấy khẩu súng hơi bắn vào con mèo của hàng xóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of hitting a ball into one of the pockets around the edge of the table",
                    "vi": "hành động đánh bóng vào một trong các túi xung quanh mép bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a pot belly (= a large stomach that sticks out)",
                    "vi": "một cái bụng nồi (= một cái bụng lớn nhô ra ngoài)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large prize or reward that somebody hopes for but is unlikely to get",
                    "vi": "một giải thưởng lớn hoặc phần thưởng mà ai đó hy vọng nhưng không chắc sẽ nhận được"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become much less good because people are not working hard or taking care of things",
                    "vi": "trở nên kém tốt hơn nhiều bởi vì mọi người không làm việc chăm chỉ hoặc không quan tâm đến mọi thứ"
                },
                "examples": [
                    {
                        "en": "Her handwriting's gone to pot since she started using a computer all the time.",
                        "vi": "Chữ viết tay của cô ấy đã biến mất kể từ khi cô ấy bắt đầu sử dụng máy tính mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to change; in the process of changing",
                    "vi": "có khả năng thay đổi; trong quá trình thay đổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you should not criticize somebody for a fault that you have yourself",
                    "vi": "đã từng nói rằng bạn không nên chỉ trích ai đó vì lỗi mà bản thân bạn mắc phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when you take pot luck, you choose something or go somewhere without knowing very much about it, but hope that it will be good, pleasant, etc.",
                    "vi": "khi bạn lấy may mắn, bạn chọn một cái gì đó hoặc đi đâu đó mà không biết nhiều về nó, nhưng hy vọng rằng nó sẽ tốt, vừa ý, v.v."
                },
                "examples": [
                    {
                        "en": "It's pot luck whether you get good advice or not.",
                        "vi": "Thật may mắn cho dù bạn có nhận được lời khuyên tốt hay không."
                    },
                    {
                        "en": "You're welcome to stay to supper, but you'll have to take pot luck (= eat whatever is available).",
                        "vi": "Bạn có thể ở lại để ăn tối, nhưng bạn sẽ phải mất một chút may mắn (= ăn bất cứ thứ gì có sẵn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large amount of money",
                    "vi": "một số tiền rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put something into a space that is too small for it",
                    "vi": "đặt một cái gì đó vào một không gian quá nhỏ cho nó"
                },
                "examples": [
                    {
                        "en": "Writing a history of the world in a single volume is like putting a quart into a pint pot.",
                        "vi": "Viết lịch sử thế giới trong một tập cũng giống như bỏ một quart vào một cái nồi nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are impatient for something to happen, time seems to pass very slowly",
                    "vi": "Người ta thường nói rằng khi bạn thiếu kiên nhẫn cho một điều gì đó xảy ra, thời gian dường như trôi qua rất chậm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb2469e9a5e24d798e350a8e594a9b29",
        "word": "pot",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pɒt/",
            "us": "/pɑːt/"
        },
        "nearby": [
            {
                "word": "posy",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "noun"
            },
            {
                "word": "pot",
                "pos": "verb"
            },
            {
                "word": "potable",
                "pos": "adjective"
            },
            {
                "word": "potash",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put a plant into a flowerpot filled with soil",
                    "vi": "đặt cây vào lọ hoa đầy đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hit a ball into one of the pockets (= holes at the corners and edges of the table)",
                    "vi": "đánh bóng vào một trong các ô (= lỗ ở các góc và cạnh của bàn)"
                },
                "examples": [
                    {
                        "en": "He potted the black to take a 7–3 lead.",
                        "vi": "Anh ta bỏ quân đen dẫn trước 7–3."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill an animal or a bird by shooting it",
                    "vi": "giết một con vật hoặc một con chim bằng cách bắn nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9f429152c2e04cdd9ce724450e4db813",
        "word": "sink",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/sɪŋk/",
            "us": "/sɪŋk/"
        },
        "nearby": [
            {
                "word": "Sinhalese",
                "pos": "noun"
            },
            {
                "word": "sinister",
                "pos": "adjective"
            },
            {
                "word": "sink",
                "pos": "verb"
            },
            {
                "word": "sink",
                "pos": "noun"
            },
            {
                "word": "sink",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go down below the surface or towards the bottom of a liquid or soft substance",
                    "vi": "đi xuống dưới bề mặt hoặc xuống đáy của chất lỏng hoặc chất mềm"
                },
                "examples": [
                    {
                        "en": "The ship sank to the bottom of the sea.",
                        "vi": "Con tàu chìm xuống đáy biển."
                    },
                    {
                        "en": "The submarine sank after an explosion.",
                        "vi": "Chiếc tàu ngầm chìm sau một vụ nổ."
                    },
                    {
                        "en": "We're sinking!",
                        "vi": "Chúng ta đang chìm!"
                    },
                    {
                        "en": "sink into something The wheels started to sink into the mud.",
                        "vi": "chìm vào thứ gì đó Bánh xe bắt đầu chìm xuống bùn."
                    },
                    {
                        "en": "The little boat sank beneath the waves.",
                        "vi": "Con thuyền nhỏ chìm dưới sóng biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to damage a boat or ship so that it goes below the surface of the sea, etc.",
                    "vi": "làm hư hỏng một chiếc thuyền hoặc con tàu để nó đi xuống dưới mặt biển, v.v."
                },
                "examples": [
                    {
                        "en": "The battleship was sunk by a torpedo.",
                        "vi": "Chiến hạm bị ngư lôi đánh chìm."
                    },
                    {
                        "en": "Bombs sank all four carriers.",
                        "vi": "Bom đánh chìm cả bốn tàu sân bay."
                    },
                    {
                        "en": "Five brothers all died when their ship was sunk.",
                        "vi": "Năm anh em đều chết khi con tàu của họ bị chìm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move downwards, especially by falling or sitting down",
                    "vi": "để di chuyển xuống dưới, đặc biệt là bằng cách ngã hoặc ngồi xuống"
                },
                "examples": [
                    {
                        "en": "I sank into an armchair.",
                        "vi": "Tôi ngồi vào một chiếc ghế bành."
                    },
                    {
                        "en": "She sank back into her seat, exhausted.",
                        "vi": "Cô trở lại chỗ ngồi của mình, kiệt sức."
                    },
                    {
                        "en": "The old man had sunk to his knees.",
                        "vi": "Ông già đã khuỵu xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move slowly downwards",
                    "vi": "di chuyển từ từ xuống dưới"
                },
                "examples": [
                    {
                        "en": "The sun was sinking in the west.",
                        "vi": "Mặt trời đã lặn ở phía tây."
                    },
                    {
                        "en": "The sun had sunk below the horizon.",
                        "vi": "Mặt trời đã lặn xuống dưới đường chân trời."
                    },
                    {
                        "en": "The foundations of the building are starting to sink.",
                        "vi": "Nền móng của tòa nhà đang bắt đầu lún xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decrease in amount, volume, strength, etc.",
                    "vi": "để giảm số lượng, âm lượng, cường độ, v.v."
                },
                "examples": [
                    {
                        "en": "The pound has sunk to its lowest recorded level against the dollar.",
                        "vi": "Đồng bảng Anh đã giảm xuống mức thấp nhất được ghi nhận so với đồng đô la."
                    },
                    {
                        "en": "He is clearly sinking fast (= getting weaker quickly and will soon die).",
                        "vi": "Anh ta rõ ràng đang chìm nhanh (= trở nên yếu đi nhanh chóng và sẽ sớm chết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become quieter",
                    "vi": "trở nên yên tĩnh hơn"
                },
                "examples": [
                    {
                        "en": "Her voice sank to a whisper.",
                        "vi": "Giọng cô ấy chìm vào một tiếng thì thầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a deep hole in the ground",
                    "vi": "tạo một cái hố sâu trên mặt đất"
                },
                "examples": [
                    {
                        "en": "to sink a well/shaft/mine",
                        "vi": "đánh chìm giếng / trục / mỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to place something in the ground by digging",
                    "vi": "để đặt một cái gì đó trong lòng đất bằng cách đào"
                },
                "examples": [
                    {
                        "en": "to sink a post into the ground",
                        "vi": "để đánh chìm một cột xuống đất"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent somebody or somebody’s plans from succeeding",
                    "vi": "để ngăn không cho ai đó hoặc kế hoạch của ai đó thành công"
                },
                "examples": [
                    {
                        "en": "I think I've just sunk my chances of getting the job.",
                        "vi": "Tôi nghĩ rằng tôi đã đánh mất cơ hội nhận được công việc của mình."
                    },
                    {
                        "en": "If the car breaks down, we'll be sunk (= have serious problems).",
                        "vi": "Nếu xe bị hỏng, chúng ta sẽ bị chìm (= có vấn đề nghiêm trọng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit a ball into a hole in golf or snooker",
                    "vi": "đánh bóng vào lỗ trong gôn hoặc bi da"
                },
                "examples": [
                    {
                        "en": "He sank a 12-foot putt to win the match.",
                        "vi": "Anh ấy thực hiện cú đặt lòng dài 12m để giành chiến thắng trong trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drink something quickly, especially a large amount of alcohol",
                    "vi": "uống nhanh thứ gì đó, đặc biệt là một lượng lớn rượu"
                },
                "examples": [
                    {
                        "en": "They sank three pints each in 10 minutes.",
                        "vi": "Họ đánh chìm ba panh mỗi chiếc trong 10 phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a state of unhappiness or deep thought",
                    "vi": "rơi vào trạng thái không vui hoặc suy nghĩ sâu sắc"
                },
                "examples": [
                    {
                        "en": "She just sat there, sunk in thought.",
                        "vi": "Cô chỉ ngồi đó, chìm trong suy nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about people who leave an organization, a company, etc. that is having difficulties, without caring about the people who are left",
                    "vi": "dùng để nói về những người rời bỏ một tổ chức, một công ty, v.v. đang gặp khó khăn mà không quan tâm đến những người còn lại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody suddenly feels sad or depressed about something",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên cảm thấy buồn hoặc chán nản về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart sank when I saw how much work there was left.",
                        "vi": "Trái tim tôi chùng xuống khi tôi thấy bao nhiêu công việc còn lại."
                    },
                    {
                        "en": "She watched him go with a sinking heart.",
                        "vi": "Cô nhìn anh ra đi với trái tim chìm đắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to forget about your disagreements",
                    "vi": "đồng ý để quên đi những bất đồng của bạn"
                },
                "examples": [
                    {
                        "en": "We need to sink our differences and present a united opposition to the plan.",
                        "vi": "Chúng ta cần xóa bỏ sự khác biệt của mình và thống nhất phản đối kế hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant feeling that you get when you realize that something bad has happened or is going to happen",
                    "vi": "một cảm giác khó chịu mà bạn nhận được khi bạn nhận ra rằng điều gì đó tồi tệ đã xảy ra hoặc sắp xảy ra"
                },
                "examples": [
                    {
                        "en": "I had a horrible sinking feeling when I saw the ambulance outside the house.",
                        "vi": "Tôi có cảm giác chìm đắm khủng khiếp khi nhìn thấy xe cấp cứu bên ngoài ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a situation where you will either succeed by your own efforts or fail completely",
                    "vi": "ở trong một tình huống mà bạn sẽ thành công bằng nỗ lực của chính mình hoặc thất bại hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The new students were just left to sink or swim.",
                        "vi": "Các học sinh mới chỉ bị chìm hoặc bơi."
                    },
                    {
                        "en": "In a situation like this, you either sink or swim.",
                        "vi": "Trong tình huống như thế này, bạn có thể chìm hoặc bơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have such low moral standards that you do something very bad",
                    "vi": "có tiêu chuẩn đạo đức thấp đến mức bạn làm điều gì đó rất tệ"
                },
                "examples": [
                    {
                        "en": "Stealing from your friends? How could you sink so low?",
                        "vi": "Ăn trộm từ bạn bè của bạn? Làm thế nào bạn có thể chìm xuống thấp như vậy?"
                    },
                    {
                        "en": "I can't believe that anyone would sink to such depths.",
                        "vi": "Tôi không thể tin được rằng có ai đó lại chìm xuống vực sâu như vậy."
                    },
                    {
                        "en": "With this article the newspaper has sunk to a new low.",
                        "vi": "Với bài báo này, tờ báo đã chìm xuống một mức thấp mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a worse way than ever before",
                    "vi": "hành xử theo cách tồi tệ hơn bao giờ hết"
                },
                "examples": [
                    {
                        "en": "The government has stooped to an all-time low with this policy.",
                        "vi": "Chính phủ đã giảm mức thấp nhất mọi thời đại với chính sách này."
                    },
                    {
                        "en": "Reality TV has sunk to new lows.",
                        "vi": "Truyền hình thực tế đã chìm xuống mức thấp mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "296f9ef80b12407a97c8dca54c3394cf",
        "word": "snooker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsnuːkə(r)/",
            "us": "/ˈsnuːkər/"
        },
        "nearby": [
            {
                "word": "snood",
                "pos": "noun"
            },
            {
                "word": "snook",
                "pos": "noun"
            },
            {
                "word": "snooker",
                "pos": "noun"
            },
            {
                "word": "snooker",
                "pos": "verb"
            },
            {
                "word": "snoop",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game for two people played on a long table covered with green cloth. Players use cues (= long sticks) to hit a white ball against other balls (15 red and 6 of other colours) in order to get the coloured balls into pockets at the edge of the table, in a particular set order.",
                    "vi": "một trò chơi dành cho hai người được chơi trên một chiếc bàn dài phủ vải xanh. Người chơi sử dụng các dấu hiệu (= gậy dài) để đánh một quả bóng màu trắng vào các quả bóng khác (15 màu đỏ và 6 màu khác) để lấy các quả bóng màu vào túi ở cạnh bàn, theo một thứ tự đã đặt."
                },
                "examples": [
                    {
                        "en": "to play snooker",
                        "vi": "chơi bi da"
                    },
                    {
                        "en": "a game of snooker",
                        "vi": "một trò chơi bi da"
                    },
                    {
                        "en": "a snooker hall/player/table",
                        "vi": "một hội trường / người chơi / bàn bi da"
                    },
                    {
                        "en": "The ex-miner stunned the snooker world by winning his first tournament.",
                        "vi": "Cựu thợ mỏ đã làm kinh ngạc thế giới bi da khi giành chiến thắng trong giải đấu đầu tiên của mình."
                    },
                    {
                        "en": "We played a couple of frames of snooker in the evening.",
                        "vi": "Chúng tôi đã chơi một vài khung hình bi da vào buổi tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in snooker in which one player has made it very difficult for the opponent to play a shot within the rules",
                    "vi": "một vị trí trong bi da trong đó một người chơi đã gây khó khăn cho đối phương khi đánh một lượt theo luật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "896907742b4643e9b00f3595924502cf",
        "word": "snooker",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsnuːkə(r)/",
            "us": "/ˈsnuːkər/"
        },
        "nearby": [
            {
                "word": "snook",
                "pos": "noun"
            },
            {
                "word": "snooker",
                "pos": "noun"
            },
            {
                "word": "snooker",
                "pos": "verb"
            },
            {
                "word": "snoop",
                "pos": "verb"
            },
            {
                "word": "snoop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have your opponent in a snooker",
                    "vi": "để có đối thủ của bạn trong bi da"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make it impossible for somebody to do something, especially something they want to do",
                    "vi": "để khiến ai đó không thể làm điều gì đó, đặc biệt là điều họ muốn làm"
                },
                "examples": [
                    {
                        "en": "Any plans I'd had for the weekend were by now well and truly snookered.",
                        "vi": "Mọi kế hoạch của tôi vào cuối tuần giờ đã thành hiện thực và thực sự thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cheat or trick somebody",
                    "vi": "lừa dối hoặc lừa ai đó"
                },
                "examples": []
            }
        ]
    }
]