[
    {
        "id": "6df137e3829a463ca2827a2255c5188e",
        "word": "blog",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/blɒɡ/",
            "us": "/blɑːɡ/"
        },
        "nearby": [
            {
                "word": "block up",
                "pos": "phrasal verb"
            },
            {
                "word": "block vote",
                "pos": "noun"
            },
            {
                "word": "blog",
                "pos": "noun"
            },
            {
                "word": "blog",
                "pos": "verb"
            },
            {
                "word": "bloggable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a website where an individual person, or people representing an organization, write regularly about recent events or topics that interest them, usually with photos and links to other websites that they find interesting",
                    "vi": "một trang web nơi một cá nhân hoặc những người đại diện cho một tổ chức, thường xuyên viết về các sự kiện gần đây hoặc chủ đề mà họ quan tâm, thường kèm theo ảnh và liên kết đến các trang web khác mà họ thấy thú vị"
                },
                "examples": [
                    {
                        "en": "This is a link to the museum's blog.",
                        "vi": "Đây là một liên kết đến blog của bảo tàng."
                    },
                    {
                        "en": "You can post a comment on my blog here.",
                        "vi": "Bạn có thể gửi bình luận trên blog của tôi ở đây."
                    },
                    {
                        "en": "in a blog You can read about my trip in my blog.",
                        "vi": "trong blog Bạn có thể đọc về chuyến đi của tôi trong blog của tôi."
                    },
                    {
                        "en": "blog about something He writes a blog about living with diabetes.",
                        "vi": "blog về điều gì đó Anh ấy viết blog về việc sống chung với bệnh tiểu đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a1ea901709b468db775a293a0d86f86",
        "word": "chat",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/tʃæt/",
            "us": "/tʃæt/"
        },
        "nearby": [
            {
                "word": "chastity belt",
                "pos": "noun"
            },
            {
                "word": "chasuble",
                "pos": "noun"
            },
            {
                "word": "chat",
                "pos": "verb"
            },
            {
                "word": "chat",
                "pos": "noun"
            },
            {
                "word": "chatbot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk in a friendly, informal way to somebody",
                    "vi": "nói chuyện một cách thân thiện, thân mật với ai đó"
                },
                "examples": [
                    {
                        "en": "I'm sorry I can't stop to chat.",
                        "vi": "Tôi xin lỗi vì tôi không thể dừng lại để trò chuyện."
                    },
                    {
                        "en": "The two of us got chatting (= started chatting) at the bus stop.",
                        "vi": "Hai chúng tôi đã trò chuyện (= bắt đầu trò chuyện) tại trạm xe buýt."
                    },
                    {
                        "en": "chat to/with somebody My kids spend hours chatting on the phone to their friends.",
                        "vi": "trò chuyện với / với ai đó Con tôi dành hàng giờ để trò chuyện trên điện thoại với bạn bè của chúng."
                    },
                    {
                        "en": "chat away Within minutes of being introduced they were chatting away like old friends.",
                        "vi": "trò chuyện trong vòng vài phút sau khi được giới thiệu, họ đã trò chuyện như những người bạn cũ."
                    },
                    {
                        "en": "chat away to/with somebody Everyone here chats away to you as though they've known you for decades.",
                        "vi": "trò chuyện với / với ai đó Mọi người ở đây trò chuyện với bạn như thể họ đã biết bạn trong nhiều thập kỷ."
                    },
                    {
                        "en": "chat about something/somebody What were you chatting about?",
                        "vi": "trò chuyện về điều gì đó / ai đó Bạn đang trò chuyện về điều gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to exchange messages with somebody on the internet, when you can see and reply to messages immediately and have a written conversation",
                    "vi": "để trao đổi tin nhắn với ai đó trên internet, khi bạn có thể xem và trả lời tin nhắn ngay lập tức và có một cuộc trò chuyện bằng văn bản"
                },
                "examples": [
                    {
                        "en": "chat (to/with somebody) I've been chatting online with my best friend.",
                        "vi": "trò chuyện (với / với ai đó) Tôi đã trò chuyện trực tuyến với người bạn thân nhất của mình."
                    },
                    {
                        "en": "chat about something/somebody I use social media to chat about stuff as well.",
                        "vi": "trò chuyện về điều gì đó / người nào đó Tôi cũng sử dụng mạng xã hội để trò chuyện về mọi thứ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0fdc3bbd6d7c4256a113d1aa21ff189e",
        "word": "Facebook™",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfeɪsbʊk/",
            "us": "/ˈfeɪsbʊk/"
        },
        "nearby": [
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            },
            {
                "word": "Facebook",
                "pos": "noun"
            },
            {
                "word": "face card",
                "pos": "noun"
            },
            {
                "word": "facecloth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very popular social media website",
                    "vi": "một trang web truyền thông xã hội rất phổ biến"
                },
                "examples": [
                    {
                        "en": "on Facebook Are you on Facebook?",
                        "vi": "trên Facebook Bạn có đang ở trên Facebook không?"
                    },
                    {
                        "en": "via Facebook We keep in touch via Facebook.",
                        "vi": "qua Facebook Chúng tôi giữ liên lạc qua Facebook."
                    },
                    {
                        "en": "They posted the picture on the team's Facebook page.",
                        "vi": "Họ đã đăng bức ảnh lên trang Facebook của đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "43a79fc5443f478796bac5b37ee92d4a",
        "word": "friend",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/frend/",
            "us": "/frend/"
        },
        "nearby": [
            {
                "word": "Betty Friedan",
                "pos": ""
            },
            {
                "word": "Milton Friedman",
                "pos": ""
            },
            {
                "word": "friend",
                "pos": "noun"
            },
            {
                "word": "friend",
                "pos": "verb"
            },
            {
                "word": "friendless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person you know well and like, and who is not usually a member of your family",
                    "vi": "một người bạn biết rõ và thích, và người thường không phải là thành viên trong gia đình bạn"
                },
                "examples": [
                    {
                        "en": "This is my friend Tom.",
                        "vi": "Đây là Tom, bạn của tôi."
                    },
                    {
                        "en": "Is he a friend of yours?",
                        "vi": "Anh ấy có phải là bạn của bạn không?"
                    },
                    {
                        "en": "Jane's a friend of the family.",
                        "vi": "Jane là một người bạn của gia đình."
                    },
                    {
                        "en": "She's an old friend (= I have known her a long time).",
                        "vi": "Cô ấy là một người bạn cũ (= Tôi đã biết cô ấy từ lâu)."
                    },
                    {
                        "en": "He's one of my best friends.",
                        "vi": "Anh ấy là một trong những người bạn tốt nhất của tôi."
                    },
                    {
                        "en": "a close/good/dear friend",
                        "vi": "một người bạn thân / tốt / thân yêu"
                    },
                    {
                        "en": "a childhood/family/longtime friend",
                        "vi": "một thời thơ ấu / gia đình / người bạn lâu năm"
                    },
                    {
                        "en": "We've been friends for years.",
                        "vi": "Chúng tôi đã là bạn trong nhiều năm."
                    },
                    {
                        "en": "They had a quarrel, but they're friends again now.",
                        "vi": "Họ đã từng cãi nhau, nhưng giờ họ lại là bạn của nhau."
                    },
                    {
                        "en": "to become/remain friends",
                        "vi": "trở thành / vẫn là bạn bè"
                    },
                    {
                        "en": "as a friend I'm asking you as a friend not to tell anyone.",
                        "vi": "với tư cách là một người bạn, tôi yêu cầu bạn như một người bạn đừng nói với ai."
                    },
                    {
                        "en": "She wanted to share the news with family and friends.",
                        "vi": "Cô muốn chia sẻ tin tức với gia đình và bạn bè."
                    },
                    {
                        "en": "She has a wide circle of friends.",
                        "vi": "Cô ấy có nhiều bạn bè."
                    },
                    {
                        "en": "I heard about it through a friend of a friend.",
                        "vi": "Tôi nghe nói về nó thông qua một người bạn của một người bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is on your list of contacts on a social media website",
                    "vi": "một người có trong danh sách liên hệ của bạn trên một trang web truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "How many friends have you got on Facebook?",
                        "vi": "Bạn có bao nhiêu người bạn trên Facebook?"
                    },
                    {
                        "en": "Facebook friends",
                        "vi": "Bạn bè trên Facebook"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who supports an organization, a charity, etc., especially by giving or raising money; a person who supports a particular idea, etc.",
                    "vi": "một người hỗ trợ một tổ chức, một tổ chức từ thiện, v.v., đặc biệt là bằng cách cho hoặc quyên góp tiền; một người ủng hộ một ý tưởng cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the Friends of St Martin’s Hospital",
                        "vi": "Những người bạn của Bệnh viện St Martin"
                    },
                    {
                        "en": "a friend of democracy",
                        "vi": "một người bạn của nền dân chủ"
                    },
                    {
                        "en": "Theatre tickets are 10% cheaper for Friends.",
                        "vi": "Vé xem rạp rẻ hơn 10% cho Bạn bè."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the same interests and opinions as yourself, and who will help and support you",
                    "vi": "một người có cùng sở thích và quan điểm với bạn và người sẽ giúp đỡ và hỗ trợ bạn"
                },
                "examples": [
                    {
                        "en": "His eyes were moving from face to face: friend or foe?",
                        "vi": "Đôi mắt anh ta đang di chuyển từ mặt này sang mặt khác: bạn hay thù?"
                    },
                    {
                        "en": "among friends You're among friends here—you can speak freely.",
                        "vi": "giữa những người bạn Bạn là những người bạn ở đây — bạn có thể nói chuyện một cách tự do."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about or to somebody that you meet who is not actually a friend",
                    "vi": "được sử dụng để nói về hoặc với ai đó mà bạn gặp, người thực sự không phải là bạn"
                },
                "examples": [
                    {
                        "en": "I wish our friend at the next table would shut up.",
                        "vi": "Tôi ước gì người bạn của chúng tôi ở bàn bên cạnh sẽ im lặng."
                    },
                    {
                        "en": "My friends, let me introduce myself.",
                        "vi": "Bạn bè của tôi, hãy để tôi giới thiệu bản thân mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used by a member of parliament to refer to another member of parliament or by a lawyer to refer to another lawyer in a court of law",
                    "vi": "được một thành viên quốc hội sử dụng để chỉ một thành viên khác của quốc hội hoặc bởi một luật sư để chỉ một luật sư khác trong một tòa án luật"
                },
                "examples": [
                    {
                        "en": "my honourable friend, the member for Henley (= in the House of Commons)",
                        "vi": "người bạn đáng kính của tôi, thành viên của Henley (= trong Hạ viện)"
                    },
                    {
                        "en": "my noble friend (= in the House of Lords)",
                        "vi": "người bạn cao quý của tôi (= trong House of Lords)"
                    },
                    {
                        "en": "my learned friend (= in a court of law)",
                        "vi": "người bạn uyên bác của tôi (= trong tòa án pháp luật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of the Society of Friends",
                    "vi": "một thành viên của Hội những người bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that two friends are not having a romantic relationship with each other",
                    "vi": "từng nói rằng hai người bạn không có mối quan hệ lãng mạn với nhau"
                },
                "examples": [
                    {
                        "en": "They gradually got to know each other better but they remained just good friends.",
                        "vi": "Họ dần hiểu nhau hơn nhưng họ vẫn chỉ là bạn tốt của nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a friend who gives you help when you need it (is a true friend)",
                    "vi": "một người bạn giúp đỡ bạn khi bạn cần (là một người bạn thực sự)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to know important people who can help you",
                    "vi": "để biết những người quan trọng có thể giúp bạn"
                },
                "examples": [
                    {
                        "en": "‘How did he get promoted so quickly?’ ‘Oh, he has friends in high places.’",
                        "vi": "Làm thế nào mà anh ấy được thăng chức nhanh chóng như vậy?' 'Ồ, anh ấy có những người bạn ở những nơi cao.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become a friend of somebody",
                    "vi": "trở thành bạn của ai đó"
                },
                "examples": [
                    {
                        "en": "Simon finds it hard to make friends with other children.",
                        "vi": "Simon cảm thấy khó kết bạn với những đứa trẻ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of describing a dog",
                    "vi": "một cách mô tả một con chó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e313c508a6a4fce9f1b1b9cbc6344b5",
        "word": "profile",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈprəʊfaɪl/",
            "us": "/ˈprəʊfaɪl/"
        },
        "nearby": [
            {
                "word": "proficiency",
                "pos": "noun"
            },
            {
                "word": "proficient",
                "pos": "adjective"
            },
            {
                "word": "profile",
                "pos": "noun"
            },
            {
                "word": "profile",
                "pos": "verb"
            },
            {
                "word": "profiler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a description of somebody/something that gives useful information",
                    "vi": "mô tả về ai đó / điều gì đó cung cấp thông tin hữu ích"
                },
                "examples": [
                    {
                        "en": "We first build up a detailed profile of our customers and their requirements.",
                        "vi": "Trước tiên, chúng tôi xây dựng một hồ sơ chi tiết về khách hàng của chúng tôi và các yêu cầu của họ."
                    },
                    {
                        "en": "You can update your Facebook profile (= your description of yourself on a social media website).",
                        "vi": "Bạn có thể cập nhật hồ sơ Facebook của mình (= mô tả của bạn về bản thân trên một trang web truyền thông xã hội)."
                    },
                    {
                        "en": "He fits the profile of the killer.",
                        "vi": "Anh ta phù hợp với hồ sơ của kẻ giết người."
                    },
                    {
                        "en": "The magazine published a short profile of the new mayor.",
                        "vi": "Tạp chí đã xuất bản một hồ sơ ngắn của thị trưởng mới."
                    },
                    {
                        "en": "a job/employee profile",
                        "vi": "hồ sơ công việc / nhân viên"
                    },
                    {
                        "en": "His psychological profile is revealing.",
                        "vi": "Hồ sơ tâm lý của anh ta đang được tiết lộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general impression that somebody/something gives to the public and the amount of attention they receive",
                    "vi": "ấn tượng chung mà ai đó / điều gì đó mang lại cho công chúng và mức độ chú ý mà họ nhận được"
                },
                "examples": [
                    {
                        "en": "Her popularity has done great things for the profile of the sport.",
                        "vi": "Sự nổi tiếng của cô ấy đã làm nên những điều tuyệt vời cho hồ sơ của môn thể thao này."
                    },
                    {
                        "en": "The deal will certainly raise the company's international profile.",
                        "vi": "Thỏa thuận này chắc chắn sẽ nâng tầm quốc tế của công ty."
                    },
                    {
                        "en": "We want to improve the profile of women’s health issues.",
                        "vi": "Chúng tôi muốn cải thiện hồ sơ về các vấn đề sức khỏe của phụ nữ."
                    },
                    {
                        "en": "a campaign to boost the profile of the city as a cultural leader",
                        "vi": "một chiến dịch để nâng cao vị thế của thành phố với tư cách là một nhà lãnh đạo văn hóa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outline of a person’s face when you look from the side, not the front",
                    "vi": "đường nét của khuôn mặt một người khi bạn nhìn từ bên cạnh, không phải chính diện"
                },
                "examples": [
                    {
                        "en": "his strong profile",
                        "vi": "hồ sơ mạnh mẽ của anh ấy"
                    },
                    {
                        "en": "She presented her best profile to the camera.",
                        "vi": "Cô ấy đã trình bày hồ sơ đẹp nhất của mình trước ống kính."
                    },
                    {
                        "en": "in profile a picture of the president in profile",
                        "vi": "trong hồ sơ một bức ảnh của tổng thống trong hồ sơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the edge or outline of something that you see against a background",
                    "vi": "cạnh hoặc đường viền của thứ gì đó mà bạn nhìn thấy trên nền"
                },
                "examples": [
                    {
                        "en": "the profile of the tower against the sky",
                        "vi": "hồ sơ của tòa tháp trên bầu trời"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of attention somebody/something has from the public",
                    "vi": "mức độ chú ý của ai đó / điều gì đó từ công chúng"
                },
                "examples": [
                    {
                        "en": "This issue has had a high profile in recent months.",
                        "vi": "Vấn đề này đã nổi lên trong những tháng gần đây."
                    },
                    {
                        "en": "I advised her to keep a low profile for the next few days (= not to attract attention).",
                        "vi": "Tôi đã khuyên cô ấy nên giữ thái độ thấp trong vài ngày tới (= đừng thu hút sự chú ý)."
                    },
                    {
                        "en": "The story was given a low profile in today's papers.",
                        "vi": "Câu chuyện được đánh giá thấp trong các bài báo ngày nay."
                    }
                ]
            }
        ]
    },
    {
        "id": "2c24316e6e094c8db2119a12202b551b",
        "word": "social media",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈmiːdiə/",
            "us": "/ˌsəʊʃl ˈmiːdiə/"
        },
        "nearby": [
            {
                "word": "socially",
                "pos": "adverb"
            },
            {
                "word": "socially distanced",
                "pos": "adjective"
            },
            {
                "word": "social media",
                "pos": "noun"
            },
            {
                "word": "social media optimization",
                "pos": "noun"
            },
            {
                "word": "social network",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "websites and software programs used for social networking",
                    "vi": "các trang web và chương trình phần mềm được sử dụng cho mạng xã hội"
                },
                "examples": [
                    {
                        "en": "social media sites such as Facebook and Twitter",
                        "vi": "các trang mạng xã hội như Facebook và Twitter"
                    },
                    {
                        "en": "Companies need to invest in social media to make it work for them.",
                        "vi": "Các công ty cần đầu tư vào phương tiện truyền thông xã hội để làm cho nó hoạt động với họ."
                    },
                    {
                        "en": "Social media are changing the way people communicate, work, and shop.",
                        "vi": "Mạng xã hội đang thay đổi cách mọi người giao tiếp, làm việc và mua sắm."
                    }
                ]
            }
        ]
    },
    {
        "id": "df2a2166532f43c69c5efb3536546d43",
        "word": "social networking",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈnetwɜːkɪŋ/",
            "us": "/ˌsəʊʃl ˈnetwɜːrkɪŋ/"
        },
        "nearby": [
            {
                "word": "social media optimization",
                "pos": "noun"
            },
            {
                "word": "social network",
                "pos": "noun"
            },
            {
                "word": "social networking",
                "pos": "noun"
            },
            {
                "word": "social psychologist",
                "pos": "noun"
            },
            {
                "word": "social psychology",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "communication with people who share your interests using a website or other service on the internet",
                    "vi": "giao tiếp với những người có cùng sở thích với bạn bằng cách sử dụng một trang web hoặc dịch vụ khác trên internet"
                },
                "examples": [
                    {
                        "en": "a social networking site",
                        "vi": "một trang mạng xã hội"
                    },
                    {
                        "en": "tips for safe blogging and social networking",
                        "vi": "mẹo để viết blog và mạng xã hội an toàn"
                    }
                ]
            }
        ]
    },
    {
        "id": "7ce1f8b0a482495895a112354eb08c62",
        "word": "blog",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/blɒɡ/",
            "us": "/blɑːɡ/"
        },
        "nearby": [
            {
                "word": "block vote",
                "pos": "noun"
            },
            {
                "word": "blog",
                "pos": "noun"
            },
            {
                "word": "blog",
                "pos": "verb"
            },
            {
                "word": "bloggable",
                "pos": "adjective"
            },
            {
                "word": "blogger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep a blog; to write something in a blog",
                    "vi": "để giữ một blog; viết gì đó trong blog"
                },
                "examples": [
                    {
                        "en": "I will be blogging from the convention all week.",
                        "vi": "Tôi sẽ viết blog từ hội nghị cả tuần."
                    },
                    {
                        "en": "Here are some reactions to the story I blogged this morning.",
                        "vi": "Đây là một số phản ứng về câu chuyện tôi viết blog sáng nay."
                    },
                    {
                        "en": "He blogged that there wasn't much happening.",
                        "vi": "Anh ấy viết blog rằng không có nhiều chuyện xảy ra."
                    },
                    {
                        "en": "Make sure that the facts you blog about are accurate.",
                        "vi": "Đảm bảo rằng các dữ kiện bạn viết blog là chính xác."
                    }
                ]
            }
        ]
    },
    {
        "id": "32cf5bcde6334577984ac0576da4f5d0",
        "word": "blogger",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈblɒɡə(r)/",
            "us": "/ˈblɑːɡər/"
        },
        "nearby": [
            {
                "word": "blog",
                "pos": "verb"
            },
            {
                "word": "bloggable",
                "pos": "adjective"
            },
            {
                "word": "blogger",
                "pos": "noun"
            },
            {
                "word": "blogging",
                "pos": "noun"
            },
            {
                "word": "bloggy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who writes a blog",
                    "vi": "một người viết blog"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "328bb0de26024f4fa43de69a699524f2",
        "word": "blogging",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈblɒɡɪŋ/",
            "us": "/ˈblɑːɡɪŋ/"
        },
        "nearby": [
            {
                "word": "bloggable",
                "pos": "adjective"
            },
            {
                "word": "blogger",
                "pos": "noun"
            },
            {
                "word": "blogging",
                "pos": "noun"
            },
            {
                "word": "bloggy",
                "pos": "adjective"
            },
            {
                "word": "blogosphere",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of writing a blog",
                    "vi": "hoạt động viết blog"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4de6d423762e4f3297f70f421dbb070d",
        "word": "blog post",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈblɒɡ pəʊst/",
            "us": "/ˈblɑːɡ pəʊst/"
        },
        "nearby": [
            {
                "word": "bloggy",
                "pos": "adjective"
            },
            {
                "word": "blogosphere",
                "pos": "noun"
            },
            {
                "word": "blog post",
                "pos": "noun"
            },
            {
                "word": "blogroll",
                "pos": "noun"
            },
            {
                "word": "bloke",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing that forms part of a blog",
                    "vi": "một đoạn văn tạo thành một phần của blog"
                },
                "examples": [
                    {
                        "en": "I wrote a series of blog posts about my trip to Vietnam.",
                        "vi": "Tôi đã viết một loạt bài blog về chuyến đi của tôi đến Việt Nam."
                    },
                    {
                        "en": "I read your previous blog post on this topic.",
                        "vi": "Tôi đã đọc bài đăng trên blog trước đây của bạn về chủ đề này."
                    }
                ]
            }
        ]
    },
    {
        "id": "29872ab870bb44b399048a2bf0469547",
        "word": "friend request",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfrend rɪkwest/",
            "us": "/ˈfrend rɪkwest/"
        },
        "nearby": [
            {
                "word": "friendly fire",
                "pos": "noun"
            },
            {
                "word": "friendly society",
                "pos": "noun"
            },
            {
                "word": "friend request",
                "pos": "noun"
            },
            {
                "word": "Friends",
                "pos": ""
            },
            {
                "word": "friendship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an invitation to follow somebody's activity on social media",
                    "vi": "lời mời theo dõi hoạt động của ai đó trên mạng xã hội"
                },
                "examples": [
                    {
                        "en": "I got a friend request from someone I used to know years ago.",
                        "vi": "Tôi nhận được lời mời kết bạn từ một người mà tôi từng quen cách đây nhiều năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "1592d5ecec99434489fef931dff51675",
        "word": "Instagram™",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɪnstəɡræm/",
            "us": "/ˈɪnstəɡræm/"
        },
        "nearby": [
            {
                "word": "inspo",
                "pos": "noun"
            },
            {
                "word": "instability",
                "pos": "noun"
            },
            {
                "word": "Instagram",
                "pos": "noun"
            },
            {
                "word": "install",
                "pos": "verb"
            },
            {
                "word": "installation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social media website where people can share photographs and short videos",
                    "vi": "một trang web truyền thông xã hội nơi mọi người có thể chia sẻ ảnh và video ngắn"
                },
                "examples": [
                    {
                        "en": "She shared photos on Instagram with her fans.",
                        "vi": "Cô đã chia sẻ hình ảnh trên Instagram với người hâm mộ của mình."
                    },
                    {
                        "en": "Some people left some hateful comments on my last Insta post.",
                        "vi": "Một số người đã để lại một số bình luận ghét bỏ trên bài đăng cuối cùng trên Insta của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6bf3176f44546e4adda29b7d99fed64",
        "word": "like",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/laɪk/",
            "us": "/laɪk/"
        },
        "nearby": [
            {
                "word": "like",
                "pos": "preposition"
            },
            {
                "word": "-like",
                "pos": "combining form"
            },
            {
                "word": "like",
                "pos": "verb"
            },
            {
                "word": "like",
                "pos": "noun"
            },
            {
                "word": "like",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find somebody/something pleasant, attractive or of a good enough standard; to enjoy something",
                    "vi": "để tìm ai đó / điều gì đó dễ chịu, hấp dẫn hoặc có tiêu chuẩn đủ tốt; để thưởng thức một cái gì đó"
                },
                "examples": [
                    {
                        "en": "like somebody/something She's nice. I like her.",
                        "vi": "thích ai đó / cái gì đó Cô ấy rất tốt. Tôi thích cô ấy."
                    },
                    {
                        "en": "I really like him.",
                        "vi": "Tôi thực sự thích anh ấy."
                    },
                    {
                        "en": "Do you like their new house?",
                        "vi": "Bạn có thích ngôi nhà mới của họ không?"
                    },
                    {
                        "en": "Which tie do you like best?",
                        "vi": "Bạn thích cà vạt nào nhất?"
                    },
                    {
                        "en": "How did you like Japan (= did you find it pleasant)?",
                        "vi": "Bạn thích Nhật Bản như thế nào (= bạn có thấy nó dễ chịu không)?"
                    },
                    {
                        "en": "She's never liked swimming.",
                        "vi": "Cô ấy chưa bao giờ thích bơi lội."
                    },
                    {
                        "en": "I don't like the way he's looking at me.",
                        "vi": "Tôi không thích cách anh ấy nhìn tôi."
                    },
                    {
                        "en": "She liked the idea of being her own boss.",
                        "vi": "Cô thích ý tưởng trở thành ông chủ của chính mình."
                    },
                    {
                        "en": "The company didn't like the fact that I'd taken maternity leave.",
                        "vi": "Công ty không thích việc tôi nghỉ sinh."
                    },
                    {
                        "en": "You've got to go to school, whether you like it or not.",
                        "vi": "Bạn phải đi học, cho dù bạn muốn hay không."
                    },
                    {
                        "en": "like doing something We like having people to stay.",
                        "vi": "thích làm điều gì đó Chúng tôi muốn có người ở lại."
                    },
                    {
                        "en": "like somebody/something doing something I didn't like him taking all the credit.",
                        "vi": "như ai đó / điều gì đó làm điều gì đó mà tôi không thích anh ta nhận hết công lao."
                    },
                    {
                        "en": "(formal) I didn't like his taking all the credit.",
                        "vi": "(chính thức) Tôi không thích anh ta nhận hết công lao."
                    },
                    {
                        "en": "like to do something I like to see them enjoying themselves.",
                        "vi": "thích làm điều gì đó mà tôi thích để thấy họ thích thú."
                    },
                    {
                        "en": "like it when… I like it when you do that.",
                        "vi": "thích nó khi… tôi thích nó khi bạn làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with would or should as a polite way to say what you want or to ask what somebody wants",
                    "vi": "được sử dụng với would hoặc should như một cách lịch sự để nói những gì bạn muốn hoặc để hỏi ai đó muốn gì"
                },
                "examples": [
                    {
                        "en": "like something Would you like a drink?",
                        "vi": "thích gì đó Bạn có muốn uống không?"
                    },
                    {
                        "en": "like to do something I'd like to think it over.",
                        "vi": "muốn làm điều gì đó tôi muốn suy nghĩ kỹ."
                    },
                    {
                        "en": "I would like to thank you all for coming tonight.",
                        "vi": "Tôi muốn cảm ơn tất cả các bạn đã đến tối nay."
                    },
                    {
                        "en": "Would you like to come with us?",
                        "vi": "Bạn muốn đi cùng chúng tôi không?"
                    },
                    {
                        "en": "(formal) We would like to apologize for the delay.",
                        "vi": "(chính thức) Chúng tôi muốn xin lỗi vì sự chậm trễ này."
                    },
                    {
                        "en": "Would you like to see the rest of the house?",
                        "vi": "Bạn có muốn xem phần còn lại của ngôi nhà không?"
                    },
                    {
                        "en": "How can they afford it? That's what I'd like to know.",
                        "vi": "Làm thế nào họ có thể mua được? Đó là những gì tôi muốn biết."
                    },
                    {
                        "en": "like somebody/something to do something We'd like you to come and visit us.",
                        "vi": "thích ai đó / điều gì đó để làm điều gì đó Chúng tôi muốn bạn đến và thăm chúng tôi."
                    },
                    {
                        "en": "like for somebody to do something (North American English) I'd like for us to work together.",
                        "vi": "tôi muốn ai đó làm điều gì đó (tiếng Anh Bắc Mỹ) Tôi muốn chúng ta làm việc cùng nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prefer to do something; to prefer something to be made or to happen in a particular way",
                    "vi": "thích làm điều gì đó; thích một cái gì đó được thực hiện hoặc xảy ra theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "like to do something At weekends I like to sleep late.",
                        "vi": "thích làm gì đó Vào cuối tuần, tôi thích ngủ muộn."
                    },
                    {
                        "en": "like something + adj. I like my coffee strong.",
                        "vi": "như cái gì đó + adj. Tôi thích cà phê của tôi mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in negative sentences to mean ‘to be unwilling to do something’",
                    "vi": "được sử dụng trong câu phủ định có nghĩa là 'không sẵn sàng làm điều gì đó'"
                },
                "examples": [
                    {
                        "en": "not like to do something I didn't like to disturb you.",
                        "vi": "không thích làm điều gì đó tôi không thích làm phiền bạn."
                    },
                    {
                        "en": "not like doing something He doesn't like asking his parents for help.",
                        "vi": "không thích làm điều gì đó Anh ấy không thích nhờ bố mẹ giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want",
                    "vi": "muốn"
                },
                "examples": [
                    {
                        "en": "Do what you like—I don't care.",
                        "vi": "Làm những gì bạn thích — tôi không quan tâm."
                    },
                    {
                        "en": "You can dye your hair whatever colour you like.",
                        "vi": "Bạn có thể nhuộm tóc bất cứ màu gì bạn thích."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you like something on social media, a news website, a blog, etc. you show that you agree with it or that you think it is good by clicking a special button",
                    "vi": "nếu bạn thích điều gì đó trên mạng xã hội, trang web tin tức, blog, v.v., bạn thể hiện rằng bạn đồng ý với điều đó hoặc bạn cho rằng điều đó tốt bằng cách nhấp vào một nút đặc biệt"
                },
                "examples": [
                    {
                        "en": "By the next morning, over twenty of my friends had liked my new profile picture.",
                        "vi": "Đến sáng hôm sau, hơn hai mươi người bạn của tôi đã thích ảnh đại diện mới của tôi."
                    },
                    {
                        "en": "Over seven hundred Facebook users have already liked the company’s website.",
                        "vi": "Hơn bảy trăm người dùng Facebook đã thích trang web của công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that something bad has happened to you and you want some sympathy",
                    "vi": "được sử dụng để nhấn mạnh rằng điều gì đó tồi tệ đã xảy ra với bạn và bạn muốn được thông cảm"
                },
                "examples": [
                    {
                        "en": "How would you like it if someone called you a liar?",
                        "vi": "Bạn sẽ thích nó như thế nào nếu ai đó gọi bạn là kẻ nói dối?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to politely agree to something or to suggest something",
                    "vi": "được sử dụng để đồng ý một cách lịch sự điều gì đó hoặc để đề xuất điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Shall we stop now?’ ‘If you like.’",
                        "vi": "Chúng ta có nên dừng lại bây giờ không?' 'Nếu bạn thích.'"
                    },
                    {
                        "en": "If you like, we could go out this evening.",
                        "vi": "Nếu bạn thích, chúng ta có thể đi chơi tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you express something in a new way or when you are not confident about something",
                    "vi": "được sử dụng khi bạn thể hiện điều gì đó theo một cách mới hoặc khi bạn không tự tin về điều gì đó"
                },
                "examples": [
                    {
                        "en": "It was, if you like, the dawn of a new era.",
                        "vi": "Nếu bạn muốn, đó là bình minh của một kỷ nguyên mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to protest that something that has been said is not true or fair",
                    "vi": "được sử dụng để phản đối rằng điều gì đó đã được nói là không đúng sự thật hoặc công bằng"
                },
                "examples": [
                    {
                        "en": "‘She called you a cheat.’ ‘Well, I like that!’",
                        "vi": "Cô ấy gọi bạn là kẻ lừa đảo.' 'Chà, tôi thích điều đó!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you hope or believe that something is true",
                    "vi": "được sử dụng để nói rằng bạn hy vọng hoặc tin rằng điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "I like to think I'm broad-minded.",
                        "vi": "Tôi thích nghĩ rằng tôi có đầu óc rộng rãi."
                    },
                    {
                        "en": "I’d like to think that you were helping me because you wanted to, not because you felt you had to.",
                        "vi": "Tôi muốn nghĩ rằng bạn đã giúp tôi vì bạn muốn, không phải vì bạn cảm thấy mình phải làm vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is very good or you enjoy it",
                    "vi": "từng nói rằng một cái gì đó rất tốt hoặc bạn thích nó"
                },
                "examples": [
                    {
                        "en": "You get paid to eat chocolate. So what's not to like?",
                        "vi": "Bạn được trả tiền để ăn sô cô la. Vì vậy, những gì không thích?"
                    },
                    {
                        "en": "I love a good bagel—what’s not to like?",
                        "vi": "Tôi thích một chiếc bánh mì tròn ngon — không thích gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "a6e209b28bb040f19c23982a6fb85a37",
        "word": "like",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/laɪk/",
            "us": "/laɪk/"
        },
        "nearby": [
            {
                "word": "-like",
                "pos": "combining form"
            },
            {
                "word": "like",
                "pos": "verb"
            },
            {
                "word": "like",
                "pos": "noun"
            },
            {
                "word": "like",
                "pos": "conjunction"
            },
            {
                "word": "like",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the things that you like",
                    "vi": "những thứ mà bạn thích"
                },
                "examples": [
                    {
                        "en": "We all have different likes and dislikes.",
                        "vi": "Tất cả chúng ta đều có những điều thích và không thích khác nhau."
                    },
                    {
                        "en": "He is more than happy to discuss his life, his likes and his career.",
                        "vi": "Anh ấy rất vui khi được thảo luận về cuộc sống, sở thích và sự nghiệp của mình."
                    },
                    {
                        "en": "She is very cosmopolitan in her likes and attitudes.",
                        "vi": "Cô ấy rất quốc tế trong sở thích và thái độ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is similar to another",
                    "vi": "một người hoặc vật tương tự với người khác"
                },
                "examples": [
                    {
                        "en": "jazz, rock and the like (= similar types of music)",
                        "vi": "jazz, rock và những thứ tương tự (= các loại nhạc tương tự)"
                    },
                    {
                        "en": "I let the apartment to students, backpackers and such like.",
                        "vi": "Tôi để căn hộ cho sinh viên, khách du lịch ba lô và như vậy."
                    },
                    {
                        "en": "a man whose like we shall not see again",
                        "vi": "một người đàn ông giống như chúng ta sẽ không gặp lại"
                    },
                    {
                        "en": "They experienced a period of expansion the like of which the world had rarely seen.",
                        "vi": "Họ đã trải qua một thời kỳ mở rộng mà thế giới hiếm khi chứng kiến."
                    },
                    {
                        "en": "You're not comparing like with like.",
                        "vi": "Bạn không so sánh like với like."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something on social media, a news website, a blog, etc. receives a like, it means that somebody has shown that they agree with it or think it is good by clicking a special button",
                    "vi": "nếu nội dung nào đó trên phương tiện truyền thông xã hội, trang web tin tức, blog, v.v. nhận được lượt thích, điều đó có nghĩa là ai đó đã chứng tỏ rằng họ đồng ý với điều đó hoặc cho rằng điều đó tốt bằng cách nhấp vào một nút đặc biệt"
                },
                "examples": [
                    {
                        "en": "The band now has thousands of likes.",
                        "vi": "Ban nhạc hiện có hàng nghìn lượt thích."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to somebody/something that is considered as a type, especially one that is considered as good as somebody/something else",
                    "vi": "được sử dụng để chỉ ai đó / cái gì đó được coi là một loại, đặc biệt là một cái được coi là tốt như ai đó / cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "She didn't want to associate with the likes of me.",
                        "vi": "Cô ấy không muốn kết giao với những người như tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "09c49483e2464b2b9715210bc8dfc120",
        "word": "tweet",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/twiːt/",
            "us": "/twiːt/"
        },
        "nearby": [
            {
                "word": "tweener",
                "pos": "noun"
            },
            {
                "word": "tweeps",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "verb"
            },
            {
                "word": "tweetable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a message sent using the Twitter social media service",
                    "vi": "một tin nhắn được gửi bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "He started posting tweets via his cell phone to keep friends and family updated on his progress.",
                        "vi": "Anh ấy bắt đầu đăng các dòng tweet qua điện thoại di động của mình để cập nhật cho bạn bè và gia đình về sự tiến bộ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the short, high sound made by a small bird",
                    "vi": "âm thanh cao ngắn của một con chim nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cdda125fb98343fb91e95addf438d7d5",
        "word": "tweet",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/twiːt/",
            "us": "/twiːt/"
        },
        "nearby": [
            {
                "word": "tweeps",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "verb"
            },
            {
                "word": "tweetable",
                "pos": "adjective"
            },
            {
                "word": "tweeter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send a message or picture using the Twitter social media service",
                    "vi": "để gửi tin nhắn hoặc hình ảnh bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "tweet about something She's always tweeting about environmental issues.",
                        "vi": "tweet về điều gì đó Cô ấy luôn tweet về các vấn đề môi trường."
                    },
                    {
                        "en": "tweet something He tweeted a picture of himself with fans at the rally.",
                        "vi": "tweet gì đó Anh ấy đã tweet một bức ảnh của mình với người hâm mộ tại cuộc biểu tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "when birds tweet, they make a series of short, high sounds",
                    "vi": "khi chim tweet, chúng tạo ra một loạt âm thanh ngắn, cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a376d9bad3864df88bbea66f41800431",
        "word": "Twitter™",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtwɪtə(r)/",
            "us": "/ˈtwɪtər/"
        },
        "nearby": [
            {
                "word": "twitter",
                "pos": "verb"
            },
            {
                "word": "twitter",
                "pos": "noun"
            },
            {
                "word": "Twitter",
                "pos": "noun"
            },
            {
                "word": "Twitterati",
                "pos": "noun"
            },
            {
                "word": "Twitterverse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social media service that allows you to send out short messages about what you are doing or thinking, that people can access on the internet or on their mobile phones",
                    "vi": "một dịch vụ truyền thông xã hội cho phép bạn gửi những tin nhắn ngắn về những gì bạn đang làm hoặc suy nghĩ mà mọi người có thể truy cập trên internet hoặc trên điện thoại di động của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "35bef2e3127b4894a690bccfa060cee5",
        "word": "YouTube™",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈjuːtjuːb/",
            "us": "/ˈjuːtuːb/"
        },
        "nearby": [
            {
                "word": "the Youth Hostels Association",
                "pos": ""
            },
            {
                "word": "youthquake",
                "pos": "noun"
            },
            {
                "word": "YouTube",
                "pos": "noun"
            },
            {
                "word": "YouTuber",
                "pos": "noun"
            },
            {
                "word": "you've",
                "pos": "short form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a website where people can watch and share videos",
                    "vi": "một trang web nơi mọi người có thể xem và chia sẻ video"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c83009c24d5e423f88b048977372386e",
        "word": "chat room",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtʃæt ruːm/",
            "us": "/ˈtʃæt ruːm/"
        },
        "nearby": [
            {
                "word": "the Earl of Chatham",
                "pos": ""
            },
            {
                "word": "chatline",
                "pos": "noun"
            },
            {
                "word": "chat room",
                "pos": "noun"
            },
            {
                "word": "chat show",
                "pos": "noun"
            },
            {
                "word": "Chatsworth",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area on the internet where people can communicate with each other, usually about one particular topic",
                    "vi": "một khu vực trên internet nơi mọi người có thể giao tiếp với nhau, thường là về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "You can't believe all the stories you hear in internet chat rooms.",
                        "vi": "Bạn không thể tin được tất cả những câu chuyện bạn nghe được trong các phòng chat trên internet."
                    }
                ]
            }
        ]
    },
    {
        "id": "038e8bbb845e43a3bfe2a1a54de9110d",
        "word": "follow",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɒləʊ/",
            "us": "/ˈfɑːləʊ/"
        },
        "nearby": [
            {
                "word": "folky",
                "pos": "adjective"
            },
            {
                "word": "follicle",
                "pos": "noun"
            },
            {
                "word": "follow",
                "pos": "verb"
            },
            {
                "word": "follow about",
                "pos": "phrasal verb"
            },
            {
                "word": "follow around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come or go after or behind somebody/something",
                    "vi": "đến hoặc đi sau hoặc sau ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "follow somebody/something Follow me please.",
                        "vi": "làm theo ai đó / cái gì đó Hãy làm theo tôi."
                    },
                    {
                        "en": "follow somebody + adv./prep. He followed her into the house.",
                        "vi": "theo ai đó + adv./prep. Anh theo cô vào nhà."
                    },
                    {
                        "en": "They were followed down the street by a bunch of photographers.",
                        "vi": "Họ đã bị theo dõi trên đường phố bởi một loạt các nhiếp ảnh gia."
                    },
                    {
                        "en": "Wherever she led, they followed.",
                        "vi": "Bất cứ nơi nào cô ấy dẫn dắt, họ đều đi theo."
                    },
                    {
                        "en": "Sam walked in, with the rest of the boys following closely behind.",
                        "vi": "Sam bước vào, với những chàng trai còn lại theo sát phía sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come or go after or behind somebody in order to watch where they go and what they do",
                    "vi": "đến hoặc đi sau hoặc sau ai đó để xem họ đi đâu và làm gì"
                },
                "examples": [
                    {
                        "en": "I think we're being followed.",
                        "vi": "Tôi nghĩ rằng chúng tôi đang bị theo dõi."
                    },
                    {
                        "en": "Police followed the car along Station Road where it mounted the kerb again.",
                        "vi": "Cảnh sát đã bám theo chiếc xe dọc theo đường Station, nơi nó lại đi vào lề đường."
                    },
                    {
                        "en": "As she walked home, she had the feeling she was being followed.",
                        "vi": "Khi bước về nhà, cô có cảm giác mình đang bị theo dõi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come after something/somebody else in time or order; to happen as a result of something else",
                    "vi": "đến sau một cái gì đó / ai đó khác trong thời gian hoặc thứ tự; xảy ra như một kết quả của một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "follow (something/somebody) I remember little of the days that followed the accident.",
                        "vi": "theo (cái gì đó / ai đó) Tôi nhớ rất ít những ngày sau vụ tai nạn."
                    },
                    {
                        "en": "A period of unrest followed the president's resignation.",
                        "vi": "Một thời kỳ bất ổn kéo theo sự từ chức của tổng thống."
                    },
                    {
                        "en": "The first two classes are followed by a break of ten minutes.",
                        "vi": "Hai tiết học đầu tiên được tiếp nối với thời gian nghỉ giải lao trong 10 phút."
                    },
                    {
                        "en": "The main course was followed by fresh fruit.",
                        "vi": "Món chính được theo sau bởi trái cây tươi."
                    },
                    {
                        "en": "to follow I'll have soup and fish to follow.",
                        "vi": "để làm theo Tôi sẽ có súp và cá để làm theo."
                    },
                    {
                        "en": "A detailed news report will follow shortly.",
                        "vi": "Một bản tin chi tiết sẽ được cập nhật ngay sau đây."
                    },
                    {
                        "en": "There follows… There followed a short silence.",
                        "vi": "Sau đó ... Tiếp theo là một khoảng lặng ngắn."
                    },
                    {
                        "en": "as follows… The opening hours are as follows…",
                        "vi": "như sau… Giờ mở cửa như sau…"
                    },
                    {
                        "en": "follow on from something A new proposal followed on from the discussions.",
                        "vi": "tiếp theo từ một cái gì đó Một đề xuất mới được tiếp nối từ các cuộc thảo luận."
                    },
                    {
                        "en": "the workers' revolts that followed in the wake of the student uprising",
                        "vi": "các cuộc nổi dậy của công nhân sau cuộc nổi dậy của sinh viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something after something else",
                    "vi": "để làm một cái gì đó sau một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "follow something with something Give your contact details and follow this with a brief profile of yourself.",
                        "vi": "theo dõi một cái gì đó với một cái gì đó Cung cấp chi tiết liên hệ của bạn và theo dõi điều này với một hồ sơ ngắn gọn của bạn."
                    },
                    {
                        "en": "follow something up with something They follow up their March show with four UK dates next month.",
                        "vi": "theo dõi một cái gì đó với một cái gì đó Họ theo dõi chương trình tháng 3 của họ với bốn ngày ở Vương quốc Anh vào tháng tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept advice, instructions, etc. and do what you have been told or shown to do",
                    "vi": "chấp nhận lời khuyên, hướng dẫn, v.v. và làm những gì bạn được yêu cầu hoặc chỉ dẫn"
                },
                "examples": [
                    {
                        "en": "to follow rules/procedures/guidelines",
                        "vi": "tuân theo các quy tắc / thủ tục / hướng dẫn"
                    },
                    {
                        "en": "They said they were just following orders.",
                        "vi": "Họ nói rằng họ chỉ làm theo đơn đặt hàng."
                    },
                    {
                        "en": "He has trouble following simple instructions.",
                        "vi": "Anh ấy gặp khó khăn khi làm theo các hướng dẫn đơn giản."
                    },
                    {
                        "en": "Why didn't you follow my advice?",
                        "vi": "Tại sao bạn không làm theo lời khuyên của tôi?"
                    },
                    {
                        "en": "Turn right and follow signs to Dundee.",
                        "vi": "Rẽ phải và đi theo các biển báo đến Dundee."
                    },
                    {
                        "en": "I never follow a recipe completely.",
                        "vi": "Tôi không bao giờ làm theo một công thức hoàn toàn."
                    },
                    {
                        "en": "He followed a strict diet.",
                        "vi": "Anh tuân theo một chế độ ăn kiêng nghiêm ngặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept somebody/something as a guide, a leader or an example; to copy somebody/something",
                    "vi": "chấp nhận ai đó / điều gì đó như một hướng dẫn, một nhà lãnh đạo hoặc một ví dụ; để sao chép ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "follow (somebody/something) I encourage others to follow our example.",
                        "vi": "follow (ai đó / cái gì đó) Tôi khuyến khích những người khác noi gương chúng tôi."
                    },
                    {
                        "en": "The Senate is expected to follow the lead of the House.",
                        "vi": "Thượng viện dự kiến sẽ tuân theo sự dẫn dắt của Hạ viện."
                    },
                    {
                        "en": "We believe it is in our best interests to follow the path of economic openness and growth.",
                        "vi": "Chúng tôi tin rằng việc đi theo con đường kinh tế cởi mở và tăng trưởng là vì lợi ích tốt nhất của chúng tôi."
                    },
                    {
                        "en": "The movie follows the book faithfully.",
                        "vi": "Phim đi theo cuốn sách một cách trung thực."
                    },
                    {
                        "en": "They followed the teachings of Buddha.",
                        "vi": "Họ đã làm theo lời dạy của Đức Phật."
                    },
                    {
                        "en": "He always followed the latest fashions (= dressed in fashionable clothes).",
                        "vi": "Anh ấy luôn đi theo mốt mới nhất (= mặc quần áo thời trang)."
                    },
                    {
                        "en": "Where one airline leads, others follow.",
                        "vi": "Nơi một hãng hàng không dẫn đầu, những hãng khác sẽ theo sau."
                    },
                    {
                        "en": "follow somebody into something Laura followed her mother into the medical profession (= became a doctor like her mother).",
                        "vi": "follow somebody into something Laura theo mẹ vào ngành y (= trở thành bác sĩ như mẹ cô ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to click on a link in a website",
                    "vi": "để nhấp vào một liên kết trong một trang web"
                },
                "examples": [
                    {
                        "en": "Follow the links to sign up for the webinar.",
                        "vi": "Theo các liên kết để đăng ký hội thảo trên web."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go along a road, path, etc.",
                    "vi": "để đi dọc theo một con đường, con đường, v.v."
                },
                "examples": [
                    {
                        "en": "Follow this road until you get to the school, then turn left.",
                        "vi": "Đi theo con đường này cho đến khi bạn đến trường, sau đó rẽ trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go in the same direction as something or parallel to something",
                    "vi": "đi cùng hướng với một cái gì đó hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The lane follows the edge of a wood for about a mile.",
                        "vi": "Con đường chạy theo mép rừng khoảng một dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the logical result of something",
                    "vi": "là kết quả logic của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "follow from something I don't see how that follows from what you've just said.",
                        "vi": "theo dõi từ một cái gì đó Tôi không thấy làm thế nào mà tiếp theo từ những gì bạn vừa nói."
                    },
                    {
                        "en": "follow on from something Several conclusions follow on from his statement.",
                        "vi": "tiếp theo từ điều gì đó Một số kết luận tiếp theo từ tuyên bố của ông."
                    },
                    {
                        "en": "it follows that… If a = b and b = c it follows that a = c.",
                        "vi": "nó theo sau đó… Nếu a = b và b = c thì a = c."
                    },
                    {
                        "en": "It does not necessarily follow that sleep loss would cause these symptoms.",
                        "vi": "Không nhất thiết phải theo sau rằng mất ngủ sẽ gây ra các triệu chứng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to understand an explanation or the meaning of something",
                    "vi": "để hiểu một lời giải thích hoặc ý nghĩa của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Sorry, I don't follow.",
                        "vi": "Xin lỗi, tôi không theo dõi."
                    },
                    {
                        "en": "follow somebody Do you follow me?",
                        "vi": "theo dõi ai đó Bạn có theo dõi tôi không?"
                    },
                    {
                        "en": "follow something I couldn't really follow his argument.",
                        "vi": "theo một cái gì đó mà tôi thực sự không thể theo lập luận của anh ta."
                    },
                    {
                        "en": "The plot is almost impossible to follow.",
                        "vi": "Cốt truyện gần như không thể theo dõi."
                    },
                    {
                        "en": "to be easy/difficult/hard to follow",
                        "vi": "dễ / khó / khó theo dõi"
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch or listen to somebody/something very carefully",
                    "vi": "để xem hoặc lắng nghe ai đó / điều gì đó rất cẩn thận"
                },
                "examples": [
                    {
                        "en": "The children were following every word of the story intently.",
                        "vi": "Các em nhỏ chăm chú theo dõi từng lời kể của câu chuyện."
                    },
                    {
                        "en": "Her eyes followed him everywhere (= she was looking at him all the time).",
                        "vi": "Đôi mắt của cô ấy dõi theo anh ấy ở khắp mọi nơi (= cô ấy đã nhìn anh ấy mọi lúc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take an active interest in something and be aware of what is happening; to support a sports team",
                    "vi": "quan tâm tích cực đến một cái gì đó và nhận thức được những gì đang xảy ra; để hỗ trợ một đội thể thao"
                },
                "examples": [
                    {
                        "en": "We've been following this story for months.",
                        "vi": "Chúng tôi đã theo dõi câu chuyện này trong nhiều tháng."
                    },
                    {
                        "en": "Have you been following the basketball championships?",
                        "vi": "Bạn đã theo dõi các giải vô địch bóng rổ chưa?"
                    },
                    {
                        "en": "Millions of people followed the trial on TV.",
                        "vi": "Hàng triệu người đã theo dõi phiên tòa trên TV."
                    },
                    {
                        "en": "In his leisure time he follows West Ham United.",
                        "vi": "Trong thời gian rảnh rỗi, anh ấy theo dõi West Ham United."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose to regularly receive messages from a person, company, etc. using a social media service",
                    "vi": "chọn thường xuyên nhận tin nhắn từ một người, công ty, v.v. bằng cách sử dụng dịch vụ truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "I don’t follow many celebrities on Twitter any more.",
                        "vi": "Tôi không theo dõi nhiều người nổi tiếng trên Twitter nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be about the life or development of somebody/something",
                    "vi": "nói về cuộc sống hoặc sự phát triển của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The novel follows the fortunes of a village community in Scotland.",
                        "vi": "Cuốn tiểu thuyết kể về vận may của một cộng đồng làng ở Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop or happen in a particular way",
                    "vi": "để phát triển hoặc xảy ra theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "The day followed the usual pattern.",
                        "vi": "Ngày theo khuôn mẫu thông thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do the same job, have the same style of life, etc. as somebody else, especially somebody in your family",
                    "vi": "làm cùng một công việc, có cùng phong cách sống, v.v. với người khác, đặc biệt là ai đó trong gia đình bạn"
                },
                "examples": [
                    {
                        "en": "She works in television, following in her father's footsteps.",
                        "vi": "Cô làm việc trong lĩnh vực truyền hình, theo bước chân của cha mình."
                    },
                    {
                        "en": "He wanted to follow in his mother's footsteps and be a ballroom dancer.",
                        "vi": "Anh ấy muốn theo bước chân của mẹ mình và trở thành một vũ công khiêu vũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be guided by your sense of smell",
                    "vi": "được hướng dẫn bởi khứu giác của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go straight forward",
                    "vi": "đi thẳng về phía trước"
                },
                "examples": [
                    {
                        "en": "The garage is a mile ahead up the hill—just follow your nose.",
                        "vi": "Nhà để xe ở phía trước một dặm lên đồi — chỉ cần đi theo mũi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what seems right or reasonable, rather than following any particular rules",
                    "vi": "hành động theo những gì có vẻ đúng hoặc hợp lý, thay vì tuân theo bất kỳ quy tắc cụ thể nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a card of the same suit that has just been played",
                    "vi": "để chơi một thẻ của cùng một bộ đồ vừa được chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to act or behave in the way that somebody else has just done",
                    "vi": "hành động hoặc cư xử theo cách mà người khác đã làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "a81861410d3742019c93f32e7e7c5a59",
        "word": "follower",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɒləʊə(r)/",
            "us": "/ˈfɑːləʊər/"
        },
        "nearby": [
            {
                "word": "follow around",
                "pos": "phrasal verb"
            },
            {
                "word": "followee",
                "pos": "noun"
            },
            {
                "word": "follower",
                "pos": "noun"
            },
            {
                "word": "following",
                "pos": "adjective"
            },
            {
                "word": "following",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who supports and admires a particular person or set of ideas",
                    "vi": "một người ủng hộ và ngưỡng mộ một người hoặc một nhóm ý tưởng cụ thể"
                },
                "examples": [
                    {
                        "en": "the followers of Mahatma Gandhi",
                        "vi": "những người theo Mahatma Gandhi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very interested in a particular activity and follows all the recent news about it",
                    "vi": "một người rất quan tâm đến một hoạt động cụ thể và theo dõi tất cả các tin tức gần đây về nó"
                },
                "examples": [
                    {
                        "en": "keen followers of football",
                        "vi": "những tín đồ quan tâm của bóng đá"
                    },
                    {
                        "en": "a follower of fashion",
                        "vi": "một tín đồ của thời trang"
                    },
                    {
                        "en": "This book is only for the dedicated follower of modernist architecture.",
                        "vi": "Cuốn sách này chỉ dành cho những tín đồ chuyên dụng của kiến trúc hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who does things after somebody else has done them first",
                    "vi": "một người làm những việc sau khi người khác đã làm chúng trước"
                },
                "examples": [
                    {
                        "en": "She is a leader, not a follower.",
                        "vi": "Cô ấy là một nhà lãnh đạo, không phải là một người theo sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who chooses to regularly receive somebody’s messages using a social media service",
                    "vi": "một người chọn thường xuyên nhận được tin nhắn của ai đó bằng cách sử dụng dịch vụ truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "a celebrity with thousands of followers on Twitter",
                        "vi": "một người nổi tiếng với hàng nghìn người theo dõi trên Twitter"
                    }
                ]
            }
        ]
    },
    {
        "id": "2eac9606f70b4220b9eacb188d48ea53",
        "word": "friend",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/frend/",
            "us": "/frend/"
        },
        "nearby": [
            {
                "word": "Milton Friedman",
                "pos": ""
            },
            {
                "word": "friend",
                "pos": "noun"
            },
            {
                "word": "friend",
                "pos": "verb"
            },
            {
                "word": "friendless",
                "pos": "adjective"
            },
            {
                "word": "friendliness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to add somebody to your list of contacts on a social media website",
                    "vi": "để thêm ai đó vào danh sách liên hệ của bạn trên một trang web truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "The chat system only allows you to communicate with those you have friended on the site.",
                        "vi": "Hệ thống trò chuyện chỉ cho phép bạn giao tiếp với những người bạn đã kết bạn trên trang web."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9c68dfe5c6348cc8c6a5416a9e7d611",
        "word": "live-tweet",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlaɪv twiːt/",
            "us": "/ˈlaɪv twiːt/"
        },
        "nearby": [
            {
                "word": "live through",
                "pos": "phrasal verb"
            },
            {
                "word": "live together",
                "pos": "phrasal verb"
            },
            {
                "word": "live-tweet",
                "pos": "verb"
            },
            {
                "word": "live up to",
                "pos": "phrasal verb"
            },
            {
                "word": "liveware",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send messages about an event using the Twitter social media service while the event is happening",
                    "vi": "để gửi tin nhắn về một sự kiện bằng dịch vụ mạng xã hội Twitter trong khi sự kiện đang diễn ra"
                },
                "examples": [
                    {
                        "en": "Those of you who follow me on Twitter have probably noticed that I live-tweet the conferences I go to.",
                        "vi": "Những người trong số các bạn theo dõi tôi trên Twitter có lẽ đã nhận thấy rằng tôi trực tiếp tweet các hội nghị mà tôi tham dự."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed807989c0b245d29ff9dd10581e1a87",
        "word": "share",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ʃeə(r)/",
            "us": "/ʃer/"
        },
        "nearby": [
            {
                "word": "share",
                "pos": "verb"
            },
            {
                "word": "-share",
                "pos": "combining form"
            },
            {
                "word": "share",
                "pos": "noun"
            },
            {
                "word": "sharecropper",
                "pos": "noun"
            },
            {
                "word": "shareholder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one part of something that is divided between two or more people",
                    "vi": "một phần của cái gì đó được chia cho hai hoặc nhiều người"
                },
                "examples": [
                    {
                        "en": "share of something Next year we hope to have a greater share of the market.",
                        "vi": "chia sẻ điều gì đó Năm tới, chúng tôi hy vọng sẽ có thị phần lớn hơn."
                    },
                    {
                        "en": "The charity was supposed to have been given a share of the profits.",
                        "vi": "Tổ chức từ thiện lẽ ra đã được chia một phần lợi nhuận."
                    },
                    {
                        "en": "The party won its biggest share of the vote since 1992.",
                        "vi": "Đảng đã giành được tỷ lệ phiếu bầu lớn nhất kể từ năm 1992."
                    },
                    {
                        "en": "The new TV channel has continued to increase its share of advertising revenue.",
                        "vi": "Kênh truyền hình mới đã tiếp tục tăng tỷ trọng doanh thu quảng cáo."
                    },
                    {
                        "en": "The three hospitals will each receive an equal share of the money raised.",
                        "vi": "Ba bệnh viện mỗi bệnh viện sẽ nhận được một phần bằng nhau của số tiền quyên góp được."
                    },
                    {
                        "en": "Why should he be entitled to a larger share of the royalties?",
                        "vi": "Tại sao anh ta phải được hưởng một phần tiền bản quyền lớn hơn?"
                    },
                    {
                        "en": "How much was your share of the winnings?",
                        "vi": "Phần thắng của bạn là bao nhiêu?"
                    },
                    {
                        "en": "share in something I have a 50 per cent share in the business.",
                        "vi": "chia sẻ điều gì đó mà tôi có 50% cổ phần trong doanh nghiệp."
                    },
                    {
                        "en": "If you die before your husband, your share in the property may go directly to your children.",
                        "vi": "Nếu bạn chết trước chồng, phần tài sản của bạn có thể chuyển trực tiếp cho các con của bạn."
                    },
                    {
                        "en": "(British English) I'm looking for a flat share (= a flat that is shared by two or more people who are not related).",
                        "vi": "(Tiếng Anh Anh) Tôi đang tìm kiếm một cổ phần cố định (= một căn hộ được chia sẻ bởi hai hoặc nhiều người không có liên quan)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that somebody has in a particular activity that involves several people",
                    "vi": "phần mà ai đó có trong một hoạt động cụ thể liên quan đến nhiều người"
                },
                "examples": [
                    {
                        "en": "We all did our share.",
                        "vi": "Tất cả chúng tôi đã chia sẻ của chúng tôi."
                    },
                    {
                        "en": "share of something Everyone must accept their share of the blame.",
                        "vi": "chia sẻ về điều gì đó Mọi người đều phải chấp nhận chia sẻ của họ về sự đổ lỗi."
                    },
                    {
                        "en": "Churchill bore a huge share of the responsibility for this failure.",
                        "vi": "Churchill chịu một phần trách nhiệm rất lớn về thất bại này."
                    },
                    {
                        "en": "We must all do our share of the work.",
                        "vi": "Tất cả chúng ta phải chia sẻ công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of something that is thought to be normal or acceptable for one person or thing",
                    "vi": "một lượng thứ được cho là bình thường hoặc có thể chấp nhận được đối với một người hoặc một vật"
                },
                "examples": [
                    {
                        "en": "He always eats more than his share.",
                        "vi": "Anh ấy luôn ăn nhiều hơn phần của mình."
                    },
                    {
                        "en": "share of something I've had my share of luck in the past.",
                        "vi": "chia sẻ về điều gì đó mà tôi đã từng có phần may mắn trong quá khứ."
                    },
                    {
                        "en": "I've done my share of worrying for one day!",
                        "vi": "Tôi đã chia sẻ nỗi lo lắng của mình trong một ngày!"
                    },
                    {
                        "en": "The industry has had its share of problems this year.",
                        "vi": "Ngành công nghiệp này đã gặp phải những khó khăn trong năm nay."
                    },
                    {
                        "en": "a branch of literature which has yet to receive its full share of attention",
                        "vi": "một nhánh văn học vẫn chưa nhận được sự quan tâm đầy đủ của nó"
                    },
                    {
                        "en": "It is right to pay your full share of tax.",
                        "vi": "Việc thanh toán đầy đủ phần thuế của bạn là đúng đắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of sending on a message on social media for other people to see",
                    "vi": "hành động gửi tin nhắn trên mạng xã hội cho người khác xem"
                },
                "examples": [
                    {
                        "en": "The campaign has already received 180 000 shares on Twitter.",
                        "vi": "Chiến dịch đã nhận được 180 000 lượt chia sẻ trên Twitter."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the units of equal value into which a company is divided that are sold to raise money. People who own shares receive part of the company’s profits.",
                    "vi": "bất kỳ đơn vị nào có giá trị tương đương mà một công ty được chia ra được bán để gây quỹ. Những người sở hữu cổ phiếu nhận được một phần lợi nhuận của công ty."
                },
                "examples": [
                    {
                        "en": "to have/hold/own shares",
                        "vi": "có / nắm giữ / sở hữu cổ phiếu"
                    },
                    {
                        "en": "to buy/sell/trade shares",
                        "vi": "để mua / bán / giao dịch cổ phiếu"
                    },
                    {
                        "en": "The company purchased 5.5m shares of the stock this week.",
                        "vi": "Công ty đã mua 5,5 triệu cổ phiếu trong tuần này."
                    },
                    {
                        "en": "The company's shares fell 4.37 per cent.",
                        "vi": "Cổ phiếu của công ty giảm 4,37%."
                    },
                    {
                        "en": "Earnings per share are growing.",
                        "vi": "Thu nhập trên mỗi cổ phiếu đang tăng lên."
                    },
                    {
                        "en": "share in something They acquired shares in the company earlier this year.",
                        "vi": "chia sẻ trong một cái gì đó Họ đã mua lại cổ phần của công ty vào đầu năm nay."
                    },
                    {
                        "en": "shares in British Telecom",
                        "vi": "cổ phần trong Viễn thông Anh"
                    },
                    {
                        "en": "a fall in share prices",
                        "vi": "giá cổ phiếu giảm"
                    },
                    {
                        "en": "70% of our share capital is in the hands of international investors.",
                        "vi": "70% vốn cổ phần của chúng tôi nằm trong tay các nhà đầu tư quốc tế."
                    },
                    {
                        "en": "a share certificate",
                        "vi": "một chứng chỉ chia sẻ"
                    },
                    {
                        "en": "The airline's shares closed (= finished trading for the day) up 8p at 171p.",
                        "vi": "Cổ phiếu của hãng hàng không đóng cửa (= kết thúc giao dịch trong ngày) tăng 8p lúc 171p."
                    }
                ]
            },
            {
                "define": {
                    "en": "the broad curved blade (= metal cutting edge) of a plough",
                    "vi": "lưỡi cong rộng (= lưỡi cắt kim loại) của một cái cày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(more than) an amount of something that is considered to be reasonable or acceptable",
                    "vi": "(nhiều hơn) một lượng nào đó được coi là hợp lý hoặc có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "He has more than his fair share of problems.",
                        "vi": "Anh ấy có nhiều hơn những chia sẻ công bằng của mình về các vấn đề."
                    },
                    {
                        "en": "I've had my fair share of success in the past.",
                        "vi": "Tôi đã có những chia sẻ công bằng về thành công trong quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the largest or best part of something when it is divided",
                    "vi": "phần lớn nhất hoặc phần tốt nhất của thứ gì đó khi nó được chia ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a share of the available money or benefits that you believe you have a right to",
                    "vi": "một phần tiền hoặc lợi ích hiện có mà bạn tin rằng bạn có quyền"
                },
                "examples": [
                    {
                        "en": "Scotland is demanding a larger share of the national cake.",
                        "vi": "Scotland đang đòi hỏi một thị phần lớn hơn trong chiếc bánh quốc gia."
                    }
                ]
            }
        ]
    },
    {
        "id": "fffd9d3722564d859e33bab6b0ee40b1",
        "word": "Snapchat™",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsnæptʃæt/",
            "us": "/ˈsnæptʃæt/"
        },
        "nearby": [
            {
                "word": "snap",
                "pos": "exclamation"
            },
            {
                "word": "snap bean",
                "pos": "noun"
            },
            {
                "word": "Snapchat",
                "pos": "noun"
            },
            {
                "word": "snapdragon",
                "pos": "noun"
            },
            {
                "word": "snap out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social media service that allows you to send or share photos, short videos and messages. Photos, etc. sent or shared using this service disappear from view after a short time.",
                    "vi": "một dịch vụ truyền thông xã hội cho phép bạn gửi hoặc chia sẻ ảnh, video ngắn và tin nhắn. Ảnh, v.v. được gửi hoặc chia sẻ bằng dịch vụ này sẽ biến mất khỏi chế độ xem sau một thời gian ngắn."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b12abbcb6a14439a819444158ce2c3af",
        "word": "system operator",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɪstəm ɒpəreɪtə(r)/",
            "us": "/ˈsɪstəm ɑːpəreɪtər/"
        },
        "nearby": [
            {
                "word": "systemic",
                "pos": "adjective"
            },
            {
                "word": "systemically",
                "pos": "adverb"
            },
            {
                "word": "system operator",
                "pos": "noun"
            },
            {
                "word": "systems analysis",
                "pos": "noun"
            },
            {
                "word": "systems analyst",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who manages a computer system or electronic communication service",
                    "vi": "một người quản lý hệ thống máy tính hoặc dịch vụ liên lạc điện tử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea4a8403efc341baab9558a330337d1b",
        "word": "timeline",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtaɪmlaɪn/",
            "us": "/ˈtaɪmlaɪn/"
        },
        "nearby": [
            {
                "word": "timelessness",
                "pos": "noun"
            },
            {
                "word": "time limit",
                "pos": "noun"
            },
            {
                "word": "timeline",
                "pos": "noun"
            },
            {
                "word": "timeliness",
                "pos": "noun"
            },
            {
                "word": "time lock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a horizontal line that is used to represent time, with the past towards the left and the future towards the right",
                    "vi": "một đường ngang được sử dụng để biểu thị thời gian, với quá khứ hướng về bên trái và tương lai hướng về bên phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a list of all somebody’s social media activity on a particular website or software program in the order in which it happened, with the most recent activity shown at the beginning of the list",
                    "vi": "danh sách tất cả hoạt động truyền thông xã hội của ai đó trên một trang web hoặc chương trình phần mềm cụ thể theo thứ tự diễn ra, với hoạt động gần đây nhất được hiển thị ở đầu danh sách"
                },
                "examples": [
                    {
                        "en": "These days, your Facebook timeline can serve as a digital scrapbook of your life.",
                        "vi": "Ngày nay, dòng thời gian trên Facebook của bạn có thể đóng vai trò như một cuốn sổ lưu niệm kỹ thuật số về cuộc đời bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0808db9af29842b98c1e52df5bfaae0c",
        "word": "twitter",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtwɪtə(r)/",
            "us": "/ˈtwɪtər/"
        },
        "nearby": [
            {
                "word": "twitcher",
                "pos": "noun"
            },
            {
                "word": "twitchy",
                "pos": "adjective"
            },
            {
                "word": "twitter",
                "pos": "verb"
            },
            {
                "word": "twitter",
                "pos": "noun"
            },
            {
                "word": "Twitter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when birds twitter, they make a series of short, high sounds",
                    "vi": "khi chim twitter, chúng tạo ra một loạt âm thanh ngắn, cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk quickly in a high excited voice, especially about something that is not very important",
                    "vi": "nói nhanh bằng một giọng hào hứng, đặc biệt là về một thứ không quan trọng lắm"
                },
                "examples": [
                    {
                        "en": "twitter (on) (about somebody/something) Perry was always twittering on about something or other.",
                        "vi": "twitter (về) (về ai đó / cái gì đó) Perry luôn luôn twittering về cái gì đó hay cái khác."
                    },
                    {
                        "en": "+ speech ‘Oh, you are too kind,’ twittered Mrs Bennet.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to send a message or picture using the Twitter social media service",
                    "vi": "để gửi tin nhắn hoặc hình ảnh bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "Some members of Congress twittered through the President’s big speech.",
                        "vi": "Một số thành viên của Quốc hội đã xôn xao trong bài phát biểu lớn của Tổng thống."
                    }
                ]
            }
        ]
    },
    {
        "id": "2b3086c56f5c43ca871e4b9d3e52725c",
        "word": "web chat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈweb tʃæt/",
            "us": "/ˈweb tʃæt/"
        },
        "nearby": [
            {
                "word": "webcam",
                "pos": "noun"
            },
            {
                "word": "webcast",
                "pos": "noun"
            },
            {
                "word": "web chat",
                "pos": "noun"
            },
            {
                "word": "webcomic",
                "pos": "noun"
            },
            {
                "word": "Web-enabled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a live exchange of messages using the internet",
                    "vi": "trao đổi tin nhắn trực tiếp bằng internet"
                },
                "examples": [
                    {
                        "en": "In a web chat with fans, the singer revealed that her new album would be called ‘Lemonade’.",
                        "vi": "Trong một cuộc trò chuyện trên web với người hâm mộ, nữ ca sĩ tiết lộ rằng album mới của cô sẽ có tên là 'Lemonade'."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f120f253c134dff86c88d3070b4a58c",
        "word": "YouTuber",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈjuːtjuːbə(r)/",
            "us": "/ˈjuːtuːbər/"
        },
        "nearby": [
            {
                "word": "youthquake",
                "pos": "noun"
            },
            {
                "word": "YouTube",
                "pos": "noun"
            },
            {
                "word": "YouTuber",
                "pos": "noun"
            },
            {
                "word": "you've",
                "pos": "short form"
            },
            {
                "word": "yowl",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who creates or appears in videos on YouTube",
                    "vi": "một người tạo hoặc xuất hiện trong các video trên YouTube"
                },
                "examples": [
                    {
                        "en": "The most popular YouTubers include video game commentators, make-up artists and vloggers.",
                        "vi": "Những người dùng YouTube phổ biến nhất bao gồm bình luận viên trò chơi điện tử, nghệ sĩ trang điểm và vlogger."
                    }
                ]
            }
        ]
    },
    {
        "id": "afbd469e569d4faa9dac60a07e95adee",
        "word": "citizen journalism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɪtɪzn ˈdʒɜːnəlɪzəm/",
            "us": "/ˌsɪtɪzn ˈdʒɜːrnəlɪzəm/"
        },
        "nearby": [
            {
                "word": "citified",
                "pos": "adjective"
            },
            {
                "word": "citizen",
                "pos": "noun"
            },
            {
                "word": "citizen journalism",
                "pos": "noun"
            },
            {
                "word": "citizen journalist",
                "pos": "noun"
            },
            {
                "word": "Citizen Kane",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "reports and pictures of events recorded by ordinary people and shown especially on the internet",
                    "vi": "tường thuật và hình ảnh của các sự kiện được ghi lại bởi những người bình thường và đặc biệt là hiển thị trên internet"
                },
                "examples": [
                    {
                        "en": "citizen journalism websites",
                        "vi": "trang web báo chí công dân"
                    },
                    {
                        "en": "Distrust of the news media led to the rise of citizen journalism.",
                        "vi": "Sự thiếu tin tưởng của các phương tiện truyền thông đưa tin đã dẫn đến sự gia tăng của báo chí công dân."
                    },
                    {
                        "en": "The media used citizen journalism including camera phone photos and eyewitness accounts in covering the tsunami.",
                        "vi": "Các phương tiện truyền thông đã sử dụng báo chí của người dân bao gồm ảnh chụp từ điện thoại camera và tài khoản của nhân chứng để đưa tin về trận sóng thần."
                    }
                ]
            }
        ]
    },
    {
        "id": "b724acff9caf4ab98de37bc57983d70e",
        "word": "influencer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪnfluənsə(r)/",
            "us": "/ˈɪnfluənsər/"
        },
        "nearby": [
            {
                "word": "influence",
                "pos": "verb"
            },
            {
                "word": "influence peddling",
                "pos": "noun"
            },
            {
                "word": "influencer",
                "pos": "noun"
            },
            {
                "word": "influential",
                "pos": "adjective"
            },
            {
                "word": "influenza",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that influences somebody/something, especially a person with the ability to influence potential buyers of a product or service by recommending it on social media",
                    "vi": "một người hoặc sự vật có ảnh hưởng đến ai đó / điều gì đó, đặc biệt là một người có khả năng ảnh hưởng đến những người mua tiềm năng của một sản phẩm hoặc dịch vụ bằng cách giới thiệu sản phẩm hoặc dịch vụ đó trên phương tiện truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "the social media feeds of fashion influencers",
                        "vi": "nguồn cấp dữ liệu truyền thông xã hội của những người có ảnh hưởng đến thời trang"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb4f199a66954acf870585f112540111",
        "word": "live-blog",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪv blɒɡ/",
            "us": "/ˈlaɪv blɑːɡ/"
        },
        "nearby": [
            {
                "word": "Live Aid",
                "pos": ""
            },
            {
                "word": "live blog",
                "pos": "noun"
            },
            {
                "word": "live-blog",
                "pos": "verb"
            },
            {
                "word": "live by",
                "pos": "phrasal verb"
            },
            {
                "word": "live by doing",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to write about an experience and publish it on a blog while it is happening",
                    "vi": "để viết về một trải nghiệm và xuất bản nó trên blog trong khi nó đang diễn ra"
                },
                "examples": [
                    {
                        "en": "He live-blogged from the top of the mountain.",
                        "vi": "Anh ấy đã viết blog từ trên đỉnh núi."
                    },
                    {
                        "en": "live-blog something to live-blog an event/an election/a debate",
                        "vi": "live-blog cái gì đó để live-blog một sự kiện / một cuộc bầu cử / một cuộc tranh luận"
                    }
                ]
            }
        ]
    },
    {
        "id": "a890ac7ad7cc4b64a9f094d9f9bfac32",
        "word": "live blog",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪv blɒɡ/",
            "us": "/ˈlaɪv blɑːɡ/"
        },
        "nearby": [
            {
                "word": "live-action",
                "pos": "adjective"
            },
            {
                "word": "Live Aid",
                "pos": ""
            },
            {
                "word": "live blog",
                "pos": "noun"
            },
            {
                "word": "live-blog",
                "pos": "verb"
            },
            {
                "word": "live by",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a blog or a microblog on which a description of an event is given as it takes place",
                    "vi": "một blog hoặc một blog nhỏ có mô tả về một sự kiện được đưa ra khi nó diễn ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1e9b4315aa4b49959b1c9c356da9580d",
        "word": "social",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsəʊʃl/",
            "us": "/ˈsəʊʃl/"
        },
        "nearby": [
            {
                "word": "sociably",
                "pos": "adverb"
            },
            {
                "word": "social",
                "pos": "adjective"
            },
            {
                "word": "social",
                "pos": "noun"
            },
            {
                "word": "social bookmarking",
                "pos": "noun"
            },
            {
                "word": "social bubble",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of referring to all somebody's social media websites and software programs",
                    "vi": "một cách đề cập đến tất cả các trang web truyền thông xã hội và chương trình phần mềm của ai đó"
                },
                "examples": [
                    {
                        "en": "Don’t forget to check the band's socials to hear about future tour dates.",
                        "vi": "Đừng quên kiểm tra mạng xã hội của ban nhạc để biết về ngày lưu diễn trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a party that is organized by a group or club",
                    "vi": "một bữa tiệc được tổ chức bởi một nhóm hoặc câu lạc bộ"
                },
                "examples": [
                    {
                        "en": "a church social",
                        "vi": "một nhà thờ xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "social security (= money that the government pays regularly to people who are poor, unemployed, sick, etc.)",
                    "vi": "an sinh xã hội (= tiền mà chính phủ trả thường xuyên cho những người nghèo, thất nghiệp, ốm đau, v.v.)"
                },
                "examples": [
                    {
                        "en": "on the social We're living on the social now.",
                        "vi": "trên mạng xã hội Hiện nay chúng ta đang sống trên mạng xã hội."
                    }
                ]
            }
        ]
    },
    {
        "id": "b265f51cf416463c9ad167269d4c11a3",
        "word": "vlog",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/vlɒɡ/",
            "us": "/vlɑːɡ/"
        },
        "nearby": [
            {
                "word": "VLE",
                "pos": "noun"
            },
            {
                "word": "vlei",
                "pos": "noun"
            },
            {
                "word": "vlog",
                "pos": "verb"
            },
            {
                "word": "vlog",
                "pos": "noun"
            },
            {
                "word": "vlogger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep a vlog (= a video blog); to add something to a vlog",
                    "vi": "để giữ một vlog (= một blog video); thêm một cái gì đó vào vlog"
                },
                "examples": [
                    {
                        "en": "vlog about something Olive has a channel with her fiancé, where they vlog about their daily lives as a couple.",
                        "vi": "vlog về điều gì đó Olive có một kênh với chồng sắp cưới của cô ấy, nơi họ làm vlog về cuộc sống hàng ngày của họ như một cặp vợ chồng."
                    },
                    {
                        "en": "vlog something I'm going to try and vlog my trip to Daegu this weekend.",
                        "vi": "vlog gì đó tôi sẽ thử và vlog cho chuyến đi của tôi đến Daegu vào cuối tuần này."
                    }
                ]
            }
        ]
    },
    {
        "id": "14f42c46c0eb413796bd69d029c552e0",
        "word": "vlog",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/vlɒɡ/",
            "us": "/vlɑːɡ/"
        },
        "nearby": [
            {
                "word": "vlei",
                "pos": "noun"
            },
            {
                "word": "vlog",
                "pos": "verb"
            },
            {
                "word": "vlog",
                "pos": "noun"
            },
            {
                "word": "vlogger",
                "pos": "noun"
            },
            {
                "word": "vlogging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a blog in which most of the content is in the form of videos",
                    "vi": "một blog trong đó hầu hết nội dung ở dạng video"
                },
                "examples": [
                    {
                        "en": "I just finished watching Bob’s vlog. Impressive!",
                        "vi": "Tôi vừa xem xong vlog của Bob. Ấn tượng!"
                    }
                ]
            }
        ]
    },
    {
        "id": "2a02f1aedecf4448807ee4e97bfd3fbe",
        "word": "vlogger",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvlɒɡə(r)/",
            "us": "/ˈvlɑːɡər/"
        },
        "nearby": [
            {
                "word": "vlog",
                "pos": "verb"
            },
            {
                "word": "vlog",
                "pos": "noun"
            },
            {
                "word": "vlogger",
                "pos": "noun"
            },
            {
                "word": "vlogging",
                "pos": "noun"
            },
            {
                "word": "V-mail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who creates a vlog (= a video blog)",
                    "vi": "một người tạo vlog (= blog video)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f46b2e7a4cce468182bf9b892d250ac0",
        "word": "vlogging",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvlɒɡɪŋ/",
            "us": "/ˈvlɑːɡɪŋ/"
        },
        "nearby": [
            {
                "word": "vlog",
                "pos": "noun"
            },
            {
                "word": "vlogger",
                "pos": "noun"
            },
            {
                "word": "vlogging",
                "pos": "noun"
            },
            {
                "word": "V-mail",
                "pos": "noun"
            },
            {
                "word": "V-neck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of creating a vlog (= a video blog)",
                    "vi": "hoạt động tạo vlog (= blog video)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5032896b3ed9496789547402128fe332",
        "word": "weblog",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈweblɒɡ/",
            "us": "/ˈweblɑːɡ/"
        },
        "nearby": [
            {
                "word": "webinar",
                "pos": "noun"
            },
            {
                "word": "webisode",
                "pos": "noun"
            },
            {
                "word": "weblog",
                "pos": "noun"
            },
            {
                "word": "webmaster",
                "pos": "noun"
            },
            {
                "word": "web page",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a website where an individual person, or people representing an organization, write regularly about recent events or topics that interest them, usually with photos and links to other websites that they find interesting",
                    "vi": "một trang web nơi một cá nhân hoặc những người đại diện cho một tổ chức, thường xuyên viết về các sự kiện gần đây hoặc chủ đề mà họ quan tâm, thường kèm theo ảnh và liên kết đến các trang web khác mà họ thấy thú vị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d37a12d7d498401e929d4d5d7ff07dd7",
        "word": "blogosphere",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblɒɡəsfɪə(r)/",
            "us": "/ˈblɑːɡəsfɪr/"
        },
        "nearby": [
            {
                "word": "blogging",
                "pos": "noun"
            },
            {
                "word": "bloggy",
                "pos": "adjective"
            },
            {
                "word": "blogosphere",
                "pos": "noun"
            },
            {
                "word": "blog post",
                "pos": "noun"
            },
            {
                "word": "blogroll",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the personal websites that exist on the internet, viewed as a network of people communicating with each other",
                    "vi": "tất cả các trang web cá nhân tồn tại trên internet, được xem như một mạng lưới mọi người giao tiếp với nhau"
                },
                "examples": [
                    {
                        "en": "It's one of the top stories in the blogosphere.",
                        "vi": "Đó là một trong những câu chuyện hàng đầu trong thế giới blog."
                    },
                    {
                        "en": "the growing influence of the political blogosphere",
                        "vi": "ảnh hưởng ngày càng tăng của thế giới blog chính trị"
                    },
                    {
                        "en": "The story moved from the blogosphere to the mainstream press.",
                        "vi": "Câu chuyện chuyển từ thế giới blog sang báo chí chính thống."
                    },
                    {
                        "en": "The blogs are part of a constantly expanding blogosphere.",
                        "vi": "Các blog là một phần của thế giới blog không ngừng mở rộng."
                    }
                ]
            }
        ]
    },
    {
        "id": "77c2f43cbfaf4210a0a21101d0181740",
        "word": "blogroll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblɒɡrəʊl/",
            "us": "/ˈblɑːɡrəʊl/"
        },
        "nearby": [
            {
                "word": "blogosphere",
                "pos": "noun"
            },
            {
                "word": "blog post",
                "pos": "noun"
            },
            {
                "word": "blogroll",
                "pos": "noun"
            },
            {
                "word": "bloke",
                "pos": "noun"
            },
            {
                "word": "blokeish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list on a website of links to other websites that the website owner thinks are useful or interesting",
                    "vi": "danh sách trên một trang web gồm các liên kết đến các trang web khác mà chủ sở hữu trang web cho là hữu ích hoặc thú vị"
                },
                "examples": [
                    {
                        "en": "A blogroll can help your blog get more exposure.",
                        "vi": "Danh sách blog có thể giúp blog của bạn được hiển thị nhiều hơn."
                    },
                    {
                        "en": "Recent additions to the blogroll are highlighted.",
                        "vi": "Các bổ sung gần đây cho danh sách blog được đánh dấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "dd14b69a20264575943f33a896d88d0a",
        "word": "bulletin board",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʊlətɪn bɔːd/",
            "us": "/ˈbʊlətɪn bɔːrd/"
        },
        "nearby": [
            {
                "word": "bulleted",
                "pos": "adjective"
            },
            {
                "word": "bulletin",
                "pos": "noun"
            },
            {
                "word": "bulletin board",
                "pos": "noun"
            },
            {
                "word": "bullet point",
                "pos": "noun"
            },
            {
                "word": "bulletproof",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a board for putting notices on",
                    "vi": "một bảng để đặt thông báo trên"
                },
                "examples": [
                    {
                        "en": "Please keep an eye on the bulletin board for further details.",
                        "vi": "Vui lòng theo dõi bảng thông báo để biết thêm chi tiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place on a computer network where any user can write or read messages",
                    "vi": "một nơi trên mạng máy tính nơi bất kỳ người dùng nào cũng có thể viết hoặc đọc tin nhắn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73a148dcc54341368d1adf17808b3976",
        "word": "CMC",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː em ˈsiː/",
            "us": "/ˌsiː em ˈsiː/"
        },
        "nearby": [
            {
                "word": "CM",
                "pos": "abbreviation"
            },
            {
                "word": "CMA",
                "pos": ""
            },
            {
                "word": "CMC",
                "pos": "abbreviation"
            },
            {
                "word": "CMS",
                "pos": "noun"
            },
            {
                "word": "CND",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "computer-mediated communication’ (= communication by email, instant messaging, social media sites, etc.)",
                    "vi": "giao tiếp qua trung gian máy tính '(= giao tiếp qua email, tin nhắn tức thời, các trang web truyền thông xã hội, v.v.)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4f91a4ccb1445a68620d5f540cf7448",
        "word": "deepfake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdiːpfeɪk/",
            "us": "/ˈdiːpfeɪk/"
        },
        "nearby": [
            {
                "word": "deepen",
                "pos": "verb"
            },
            {
                "word": "deep end",
                "pos": "noun"
            },
            {
                "word": "deepfake",
                "pos": "noun"
            },
            {
                "word": "deep freeze",
                "pos": "noun"
            },
            {
                "word": "deep-frozen",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a video of a person in which their appearance has been digitally altered so that they look like somebody else",
                    "vi": "video về một người mà ngoại hình của họ đã được thay đổi kỹ thuật số để họ trông giống người khác"
                },
                "examples": [
                    {
                        "en": "Social media companies need to do more to combat deepfakes.",
                        "vi": "Các công ty truyền thông xã hội cần phải làm nhiều hơn nữa để chống lại nạn lừa đảo."
                    },
                    {
                        "en": "This is not the first deepfake video to go viral.",
                        "vi": "Đây không phải là video deepfake đầu tiên lan truyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "de999001a69a480ba9409921df9a3d1b",
        "word": "DM",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiː ˈem/",
            "us": "/ˌdiː ˈem/"
        },
        "nearby": [
            {
                "word": "D-lock",
                "pos": "noun"
            },
            {
                "word": "DLR",
                "pos": ""
            },
            {
                "word": "DM",
                "pos": "noun"
            },
            {
                "word": "DM",
                "pos": "verb"
            },
            {
                "word": "DMA",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a private message that you send on Twitter™ that will only be seen by the person you send it to (the abbreviation for ‘direct message’)",
                    "vi": "một tin nhắn riêng tư mà bạn gửi trên Twitter ™ mà chỉ người bạn gửi cho mới thấy (chữ viết tắt của 'tin nhắn trực tiếp')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31d655ec881d4738a3b1d3d954a2d40b",
        "word": "DM",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiː ˈem/",
            "us": "/ˌdiː ˈem/"
        },
        "nearby": [
            {
                "word": "DLR",
                "pos": ""
            },
            {
                "word": "DM",
                "pos": "noun"
            },
            {
                "word": "DM",
                "pos": "verb"
            },
            {
                "word": "DMA",
                "pos": "noun"
            },
            {
                "word": "DMs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send somebody a direct message (a private message that you send on Twitter™ that will only be seen by the person you send it to)",
                    "vi": "để gửi cho ai đó một tin nhắn trực tiếp (một tin nhắn riêng tư mà bạn gửi trên Twitter ™ sẽ chỉ có người mà bạn gửi tin nhắn đó xem được)"
                },
                "examples": [
                    {
                        "en": "DM somebody (something) I DM'd him my email address.",
                        "vi": "DM ai đó (cái gì đó) Tôi gửi cho anh ấy địa chỉ email của tôi."
                    },
                    {
                        "en": "DM (something) (to somebody) I'll DM the link to you.",
                        "vi": "DM (cái gì đó) (với ai đó) Tôi sẽ gửi liên kết đến DM cho bạn."
                    },
                    {
                        "en": "DM + adv./prep. She DM'd back right away.",
                        "vi": "DM + adv./prep. Cô ấy DM sẽ quay lại ngay."
                    }
                ]
            }
        ]
    },
    {
        "id": "8168ac531358405b97118178fced8458",
        "word": "flash mob",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæʃ mɒb/",
            "us": "/ˈflæʃ mɑːb/"
        },
        "nearby": [
            {
                "word": "Harry Flashman",
                "pos": ""
            },
            {
                "word": "flash memory",
                "pos": "noun"
            },
            {
                "word": "flash mob",
                "pos": "noun"
            },
            {
                "word": "flash mobber",
                "pos": "noun"
            },
            {
                "word": "flash mobbing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large group of people who arrange (by mobile phone or email) to gather together in a public place at exactly the same time, spend a short time doing something there and then quickly all leave at the same time",
                    "vi": "một nhóm lớn những người sắp xếp (qua điện thoại di động hoặc email) để tụ tập cùng một lúc ở một nơi công cộng, dành một khoảng thời gian ngắn để làm việc gì đó ở đó và sau đó nhanh chóng rời đi cùng một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "08cbe80e7e9847c7b810de0db08075fb",
        "word": "flash mobbing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæʃmɒbɪŋ/",
            "us": "/ˈflæʃmɑːbɪŋ/"
        },
        "nearby": [
            {
                "word": "flash mob",
                "pos": "noun"
            },
            {
                "word": "flash mobber",
                "pos": "noun"
            },
            {
                "word": "flash mobbing",
                "pos": "noun"
            },
            {
                "word": "flash on",
                "pos": "phrasal verb"
            },
            {
                "word": "flash past",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity in which a large group of people arrange (by mobile phone or email) to gather together in a public place at exactly the same time, spend a short time doing something there and then quickly all leave at the same time",
                    "vi": "một hoạt động trong đó một nhóm lớn người sắp xếp (qua điện thoại di động hoặc email) để tụ tập cùng nhau tại một địa điểm công cộng vào cùng một thời điểm, dành một khoảng thời gian ngắn để làm điều gì đó ở đó và sau đó nhanh chóng rời đi cùng một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8974abc274f6435cae9fef9605249a94",
        "word": "followee",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɒləʊˈiː/",
            "us": "/ˌfɑːləʊˈiː/"
        },
        "nearby": [
            {
                "word": "follow about",
                "pos": "phrasal verb"
            },
            {
                "word": "follow around",
                "pos": "phrasal verb"
            },
            {
                "word": "followee",
                "pos": "noun"
            },
            {
                "word": "follower",
                "pos": "noun"
            },
            {
                "word": "following",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, company, etc. whose messages on a microblogging service people choose to receive regularly",
                    "vi": "một người, công ty, v.v. có tin nhắn trên dịch vụ tiểu blog mà mọi người chọn nhận thường xuyên"
                },
                "examples": [
                    {
                        "en": "I often use Twitter recommendations to select new followees.",
                        "vi": "Tôi thường sử dụng các đề xuất của Twitter để chọn những người theo dõi mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "6145d1deb3ca4cabadc2ff294e95a12f",
        "word": "groom",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡruːm/",
            "us": "/ɡruːm/"
        },
        "nearby": [
            {
                "word": "grok",
                "pos": "verb"
            },
            {
                "word": "grommet",
                "pos": "noun"
            },
            {
                "word": "groom",
                "pos": "verb"
            },
            {
                "word": "groom",
                "pos": "noun"
            },
            {
                "word": "groomed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to clean or brush an animal",
                    "vi": "để làm sạch hoặc chải một con vật"
                },
                "examples": [
                    {
                        "en": "to groom a horse/dog/cat",
                        "vi": "chải lông cho ngựa / chó / mèo"
                    },
                    {
                        "en": "The horses are all well fed and groomed.",
                        "vi": "Những con ngựa đều được ăn uống đầy đủ và chải chuốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to clean the fur or skin of another animal or itself",
                    "vi": "để làm sạch lông hoặc da của động vật khác hoặc chính nó"
                },
                "examples": [
                    {
                        "en": "a female ape grooming her mate",
                        "vi": "một con vượn cái chải chuốt cho người bạn đời của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare or train somebody for an important job or position",
                    "vi": "để chuẩn bị hoặc đào tạo ai đó cho một công việc hoặc vị trí quan trọng"
                },
                "examples": [
                    {
                        "en": "groom somebody (for/as something) Our junior employees are being groomed for more senior roles.",
                        "vi": "chuẩn bị cho ai đó (cho / như một cái gì đó) Các nhân viên cấp dưới của chúng tôi đang được chuẩn bị cho các vai trò cấp cao hơn."
                    },
                    {
                        "en": "groom somebody to do something The eldest son is being groomed to take over when his father dies.",
                        "vi": "chú rể ai đó để làm điều gì đó Người con trai cả đang được chuẩn bị để tiếp quản khi cha anh qua đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare a child for a meeting, especially using social media, with the intention of performing an illegal sexual act",
                    "vi": "để chuẩn bị cho một đứa trẻ tham gia một cuộc họp, đặc biệt là sử dụng mạng xã hội, với ý định thực hiện một hành vi tình dục bất hợp pháp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7679d09b24e544ba82ae4b3e93107092",
        "word": "handle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhændl/",
            "us": "/ˈhændl/"
        },
        "nearby": [
            {
                "word": "handkerchief",
                "pos": "noun"
            },
            {
                "word": "handle",
                "pos": "verb"
            },
            {
                "word": "handle",
                "pos": "noun"
            },
            {
                "word": "handlebar",
                "pos": "noun"
            },
            {
                "word": "handlebar moustache",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a door, window, etc. that you use to open it",
                    "vi": "phần cửa ra vào, cửa sổ, v.v. mà bạn sử dụng để mở nó"
                },
                "examples": [
                    {
                        "en": "She turned the handle and opened the door.",
                        "vi": "Cô xoay tay cầm và mở cửa."
                    },
                    {
                        "en": "a door handle",
                        "vi": "một tay nắm cửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of an object, such as a cup, a bag or a tool, that you use to hold it or carry it",
                    "vi": "phần của một đồ vật, chẳng hạn như cốc, túi hoặc một dụng cụ mà bạn dùng để đựng hoặc mang theo"
                },
                "examples": [
                    {
                        "en": "the handle of a knife",
                        "vi": "cán dao"
                    },
                    {
                        "en": "a broom handle",
                        "vi": "cán chổi"
                    },
                    {
                        "en": "The handle's broken off this jug.",
                        "vi": "Tay cầm bị gãy khỏi cái bình này."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the number or type of handle mentioned",
                    "vi": "có số lượng hoặc loại tay cầm được đề cập"
                },
                "examples": [
                    {
                        "en": "a long-handled spoon",
                        "vi": "một cái thìa cán dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "a name or nickname",
                    "vi": "tên hoặc biệt hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person's username on a social media site or online forum",
                    "vi": "tên người dùng của một người trên trang mạng xã hội hoặc diễn đàn trực tuyến"
                },
                "examples": [
                    {
                        "en": "I added my handle at the top of my blog page so that readers could view my tweets as well as my blog posts.",
                        "vi": "Tôi đã thêm tay cầm của mình ở đầu trang blog của mình để người đọc có thể xem các tweet cũng như các bài đăng trên blog của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly become very angry",
                    "vi": "đột nhiên trở nên rất tức giận"
                },
                "examples": [
                    {
                        "en": "He seems to fly off the handle about the slightest thing these days.",
                        "vi": "Anh ấy dường như bay khỏi tay về những điều nhỏ nhặt nhất trong những ngày này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to understand or know about somebody/something, especially so that you can deal with it or them later",
                    "vi": "để hiểu hoặc biết về ai đó / điều gì đó, đặc biệt là để bạn có thể đối phó với nó hoặc họ sau này"
                },
                "examples": [
                    {
                        "en": "I can't get a handle on these sales figures.",
                        "vi": "Tôi không thể xử lý các số liệu bán hàng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody enough facts or knowledge for them to be able to deal with something",
                    "vi": "cung cấp cho ai đó đủ dữ kiện hoặc kiến thức để họ có thể đối phó với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Visiting the country should give us a better handle on understanding the problems.",
                        "vi": "Đến thăm đất nước nên chúng tôi có cách xử lý tốt hơn để hiểu rõ các vấn đề."
                    }
                ]
            }
        ]
    },
    {
        "id": "94899f80b3114c0e8f60e9f0c7328748",
        "word": "hashtag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæʃtæɡ/",
            "us": "/ˈhæʃtæɡ/"
        },
        "nearby": [
            {
                "word": "hashish",
                "pos": "noun"
            },
            {
                "word": "hash out",
                "pos": "phrasal verb"
            },
            {
                "word": "hashtag",
                "pos": "noun"
            },
            {
                "word": "Hasid",
                "pos": "noun"
            },
            {
                "word": "Hasidic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or phrase with the symbol ‘#’ in front of it, used on social media websites and apps so that you can search for all messages with the same subject",
                    "vi": "một từ hoặc cụm từ có ký hiệu '#' ở phía trước, được sử dụng trên các ứng dụng và trang web mạng xã hội để bạn có thể tìm kiếm tất cả các tin nhắn có cùng chủ đề"
                },
                "examples": [
                    {
                        "en": "I often use hashtags to search for trending topics.",
                        "vi": "Tôi thường sử dụng các thẻ bắt đầu bằng # để tìm kiếm các chủ đề thịnh hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "the symbol ( # ), especially one on a phone or computer keyboard",
                    "vi": "biểu tượng (#), đặc biệt là biểu tượng trên điện thoại hoặc bàn phím máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73ecd03009924b63aaa14cb56f1e36ae",
        "word": "hat tip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæt tɪp/",
            "us": "/ˈhæt tɪp/"
        },
        "nearby": [
            {
                "word": "hatstand",
                "pos": "noun"
            },
            {
                "word": "hatter",
                "pos": "noun"
            },
            {
                "word": "hat tip",
                "pos": "noun"
            },
            {
                "word": "Hatton Garden",
                "pos": ""
            },
            {
                "word": "hat-trick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used on the internet to acknowledge somebody's part in something, providing information or ideas for something",
                    "vi": "được sử dụng trên internet để thừa nhận ai đó tham gia vào điều gì đó, cung cấp thông tin hoặc ý tưởng cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "Hat tip to John Rowe for the link to this blog.",
                        "vi": "Lời khuyên cho John Rowe cho liên kết đến blog này."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b080804ad4d46d08746986261ad14cb",
        "word": "microblog",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊblɒɡ/",
            "us": "/ˈmaɪkrəʊblɑːɡ/"
        },
        "nearby": [
            {
                "word": "microbiologist",
                "pos": "noun"
            },
            {
                "word": "microbiology",
                "pos": "noun"
            },
            {
                "word": "microblog",
                "pos": "verb"
            },
            {
                "word": "microblog",
                "pos": "noun"
            },
            {
                "word": "microblogging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep a microblog",
                    "vi": "giữ một blog nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed7ce1704fc24dc9952f0432160d47f1",
        "word": "microblog",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊblɒɡ/",
            "us": "/ˈmaɪkrəʊblɑːɡ/"
        },
        "nearby": [
            {
                "word": "microbiology",
                "pos": "noun"
            },
            {
                "word": "microblog",
                "pos": "verb"
            },
            {
                "word": "microblog",
                "pos": "noun"
            },
            {
                "word": "microblogging",
                "pos": "noun"
            },
            {
                "word": "microbrew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a blog where you regularly post short messages, photos or videos either to a selected group of people, or so that they can be viewed by anyone, as a means of keeping people informed about your activities and thoughts",
                    "vi": "một blog nơi bạn thường xuyên đăng tin nhắn ngắn, ảnh hoặc video cho một nhóm người được chọn hoặc để bất kỳ ai cũng có thể xem họ, như một phương tiện giúp mọi người được thông báo về các hoạt động và suy nghĩ của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "50e188d23f0f4807ae3233f1978db690",
        "word": "microblogging",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊblɒɡɪŋ/",
            "us": "/ˈmaɪkrəʊblɑːɡɪŋ/"
        },
        "nearby": [
            {
                "word": "microblog",
                "pos": "verb"
            },
            {
                "word": "microblog",
                "pos": "noun"
            },
            {
                "word": "microblogging",
                "pos": "noun"
            },
            {
                "word": "microbrew",
                "pos": "noun"
            },
            {
                "word": "microbrewery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of sending regular short messages, photos or videos over the internet, either to a selected group of people, or so that they can be viewed by anyone, as a means of keeping people informed about your activities and thoughts",
                    "vi": "hoạt động gửi các tin nhắn ngắn, ảnh hoặc video thông thường qua internet, cho một nhóm người được chọn hoặc để bất kỳ ai cũng có thể xem họ, như một phương tiện giúp mọi người được thông báo về các hoạt động và suy nghĩ của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7ddaf3697b244b2796d53c413eae95b3",
        "word": "Myspace™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪspeɪs/",
            "us": "/ˈmaɪspeɪs/"
        },
        "nearby": [
            {
                "word": "myrtle",
                "pos": "noun"
            },
            {
                "word": "myself",
                "pos": "pronoun"
            },
            {
                "word": "Myspace",
                "pos": "noun"
            },
            {
                "word": "mysterious",
                "pos": "adjective"
            },
            {
                "word": "mysteriously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social media website",
                    "vi": "một trang web truyền thông xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "24c8e247a5534228a7765a3d8c9634d2",
        "word": "PM",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpiː ˈem/",
            "us": "/ˌpiː ˈem/"
        },
        "nearby": [
            {
                "word": "plz",
                "pos": "adverb"
            },
            {
                "word": "p.m.",
                "pos": "abbreviation"
            },
            {
                "word": "PM",
                "pos": "noun"
            },
            {
                "word": "PM",
                "pos": "verb"
            },
            {
                "word": "PMS",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main minister and leader of the government in some countries (the abbreviation for ‘prime minister’)",
                    "vi": "Bộ trưởng và lãnh đạo chính phủ ở một số quốc gia (viết tắt của 'thủ tướng')"
                },
                "examples": [
                    {
                        "en": "an interview with the PM",
                        "vi": "một cuộc phỏng vấn với Thủ tướng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a private message (= one that only the person who wrote it and the person who they sent it to can read) on social media or an online forum",
                    "vi": "một tin nhắn riêng tư (= một tin nhắn mà chỉ người đã viết nó và người được họ gửi cho nó mới có thể đọc được) trên phương tiện truyền thông xã hội hoặc một diễn đàn trực tuyến"
                },
                "examples": [
                    {
                        "en": "If you're interested, send me a PM.",
                        "vi": "Nếu bạn quan tâm, hãy gửi cho tôi một PM."
                    }
                ]
            }
        ]
    },
    {
        "id": "d589a5179b3d4c2f9331a580f06f5592",
        "word": "PM",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpiː ˈem/",
            "us": "/ˌpiː ˈem/"
        },
        "nearby": [
            {
                "word": "p.m.",
                "pos": "abbreviation"
            },
            {
                "word": "PM",
                "pos": "noun"
            },
            {
                "word": "PM",
                "pos": "verb"
            },
            {
                "word": "PMS",
                "pos": "noun"
            },
            {
                "word": "pneumatic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send somebody a private message (= one that only the person who wrote it and the person who they sent it to can read) on social media or an online forum",
                    "vi": "để gửi cho ai đó một tin nhắn riêng tư (= một tin nhắn mà chỉ người viết nó và người được họ gửi tin nhắn mới có thể đọc) trên phương tiện truyền thông xã hội hoặc diễn đàn trực tuyến"
                },
                "examples": [
                    {
                        "en": "PM somebody (something) You should PM me your address.",
                        "vi": "PM ai đó (cái gì đó) Bạn nên PM cho tôi địa chỉ của bạn."
                    },
                    {
                        "en": "PM something (to somebody) I'll PM my address to you.",
                        "vi": "PM một cái gì đó (cho ai đó) Tôi sẽ gửi địa chỉ của tôi cho bạn."
                    },
                    {
                        "en": "+ adv./prep. She PM'd back right away,",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "7580c12c394847a6a2c202f224962686",
        "word": "retweet",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈtwiːt/",
            "us": "/ˌriːˈtwiːt/"
        },
        "nearby": [
            {
                "word": "return ticket",
                "pos": "noun"
            },
            {
                "word": "return visit",
                "pos": "noun"
            },
            {
                "word": "retweet",
                "pos": "verb"
            },
            {
                "word": "retweet",
                "pos": "noun"
            },
            {
                "word": "Reuben",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if you retweet a message written by another user on the Twitter social media service, the message can be seen by all of the people who regularly receive messages from you",
                    "vi": "Nếu bạn đăng lại tin nhắn do người dùng khác viết trên dịch vụ mạng xã hội Twitter, tất cả những người thường xuyên nhận tin nhắn từ bạn đều có thể nhìn thấy tin nhắn đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "251c0aea7c534e928e6f5f7058475d28",
        "word": "retweet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːtwiːt/",
            "us": "/ˈriːtwiːt/"
        },
        "nearby": [
            {
                "word": "return visit",
                "pos": "noun"
            },
            {
                "word": "retweet",
                "pos": "verb"
            },
            {
                "word": "retweet",
                "pos": "noun"
            },
            {
                "word": "Reuben",
                "pos": ""
            },
            {
                "word": "Reuben sandwich",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a message written by another user on the Twitter social media service that you have retweeted so that it can be seen by all the people who regularly read messages written by you",
                    "vi": "một tin nhắn được viết bởi một người dùng khác trên dịch vụ mạng xã hội Twitter mà bạn đã tweet lại để tất cả những người thường xuyên đọc tin nhắn do bạn viết có thể nhìn thấy nó."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "19ff5f05fa0d489a8ea0fbb95d22ee7b",
        "word": "Second Life™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsekənd ˈlaɪf/",
            "us": "/ˌsekənd ˈlaɪf/"
        },
        "nearby": [
            {
                "word": "second language acquisition",
                "pos": "noun"
            },
            {
                "word": "second lieutenant",
                "pos": "noun"
            },
            {
                "word": "Second Life",
                "pos": "noun"
            },
            {
                "word": "secondly",
                "pos": "adverb"
            },
            {
                "word": "secondment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a virtual world on the internet where people can communicate with each other, play games and pretend to live another life",
                    "vi": "một thế giới ảo trên Internet, nơi mọi người có thể giao tiếp với nhau, chơi trò chơi và giả vờ sống một cuộc sống khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5219c4ac4b2e434f8a376bbdff095aed",
        "word": "social bookmarking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈbʊkmɑːkɪŋ/",
            "us": "/ˌsəʊʃl ˈbʊkmɑːrkɪŋ/"
        },
        "nearby": [
            {
                "word": "social",
                "pos": "adjective"
            },
            {
                "word": "social",
                "pos": "noun"
            },
            {
                "word": "social bookmarking",
                "pos": "noun"
            },
            {
                "word": "social bubble",
                "pos": "noun"
            },
            {
                "word": "social capital",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of bookmarking (= storing and labelling) the addresses of pages on the internet, using a special service that enables you to make them available to other internet users",
                    "vi": "một cách đánh dấu trang (= lưu trữ và gắn nhãn) địa chỉ của các trang trên internet, sử dụng một dịch vụ đặc biệt cho phép bạn cung cấp chúng cho những người dùng internet khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8cedfe65183a43fd87b86a5469d56952",
        "word": "troll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/trɒl/",
            "us": "/trəʊl/"
        },
        "nearby": [
            {
                "word": "Trojan",
                "pos": "noun, adjective"
            },
            {
                "word": "Trojan horse",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "verb"
            },
            {
                "word": "trolley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in Scandinavian stories) a creature that looks like an ugly person. Some trolls are very large and evil, others are small and friendly but like to trick people.",
                    "vi": "(trong những câu chuyện của người Scandinavia) một sinh vật trông giống như một người xấu xí. Một số troll rất lớn và xấu xa, một số khác thì nhỏ bé và thân thiện nhưng lại thích lừa người."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a message to a discussion group on the internet that somebody deliberately sends to make other people angry; a person who sends a message like this",
                    "vi": "một tin nhắn đến một nhóm thảo luận trên internet mà ai đó cố tình gửi để khiến người khác tức giận; một người gửi một tin nhắn như thế này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d99e39f935a4b97b8500ad105c730a2",
        "word": "Usenet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈjuːznet/",
            "us": "/ˈjuːznet/"
        },
        "nearby": [
            {
                "word": "uselessly",
                "pos": "adverb"
            },
            {
                "word": "uselessness",
                "pos": "noun"
            },
            {
                "word": "Usenet",
                "pos": "noun"
            },
            {
                "word": "U.S. English",
                "pos": ""
            },
            {
                "word": "user",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a service on the internet used by groups of users who email each other because they share a particular interest",
                    "vi": "một dịch vụ trên internet được sử dụng bởi các nhóm người dùng gửi email cho nhau vì họ có chung sở thích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "654d2eaa90354925919bbc28c934a0ad",
        "word": "VLE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌviː el ˈiː/",
            "us": "/ˌviː el ˈiː/"
        },
        "nearby": [
            {
                "word": "VJ",
                "pos": "noun"
            },
            {
                "word": "V-J Day",
                "pos": ""
            },
            {
                "word": "VLE",
                "pos": "noun"
            },
            {
                "word": "vlei",
                "pos": "noun"
            },
            {
                "word": "vlog",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a software system for teaching and learning using the internet (the abbreviation for ‘virtual learning environment’)",
                    "vi": "một hệ thống phần mềm để dạy và học sử dụng Internet (viết tắt của 'môi trường học tập ảo')"
                },
                "examples": [
                    {
                        "en": "the effective use of VLEs",
                        "vi": "việc sử dụng hiệu quả VLEs"
                    },
                    {
                        "en": "the challenges facing schools when they implement VLEs",
                        "vi": "những thách thức mà trường học phải đối mặt khi họ triển khai VLEs"
                    }
                ]
            }
        ]
    }
]