[
    {
        "id": "0ab87a25462349b7be2f24fe94fe80fe",
        "word": "give",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡɪv/",
            "us": "/ɡɪv/"
        },
        "nearby": [
            {
                "word": "git",
                "pos": "noun"
            },
            {
                "word": "githeri",
                "pos": "noun"
            },
            {
                "word": "give",
                "pos": "verb"
            },
            {
                "word": "give",
                "pos": "noun"
            },
            {
                "word": "give away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hand something to somebody so that they can look at it, use it or keep it for a time",
                    "vi": "giao một cái gì đó cho ai đó để họ có thể nhìn vào nó, sử dụng nó hoặc giữ nó trong một thời gian"
                },
                "examples": [
                    {
                        "en": "give something to somebody Give the letter to your mother when you've read it.",
                        "vi": "tặng một cái gì đó cho ai đó Đưa bức thư cho mẹ của bạn khi bạn đã đọc nó."
                    },
                    {
                        "en": "She gave her ticket to the woman at the check-in desk.",
                        "vi": "Cô đưa vé của mình cho người phụ nữ ở quầy làm thủ tục."
                    },
                    {
                        "en": "give somebody something Give your mother the letter.",
                        "vi": "cho ai đó một cái gì đó Đưa cho mẹ của bạn lá thư."
                    },
                    {
                        "en": "They were all given a box to carry.",
                        "vi": "Tất cả họ đều được phát một chiếc hộp để mang theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hand something to somebody as a present; to allow somebody to have something as a present",
                    "vi": "để trao một cái gì đó cho ai đó như một món quà; để cho phép ai đó có một cái gì đó như một món quà"
                },
                "examples": [
                    {
                        "en": "give somebody something What are you giving your father for his birthday?",
                        "vi": "tặng ai đó cái gì Bạn đang tặng gì cho bố của bạn vào ngày sinh nhật của ông ấy?"
                    },
                    {
                        "en": "She was given a huge bunch of flowers.",
                        "vi": "Cô ấy được tặng một bó hoa rất lớn."
                    },
                    {
                        "en": "Did you give the waiter a tip?",
                        "vi": "Bạn đã cho người phục vụ một tiền boa chưa?"
                    },
                    {
                        "en": "give something to somebody She gave a couple of pounds to the beggar.",
                        "vi": "đưa một cái gì đó cho ai đó Cô ấy đã đưa cho người ăn mày một vài pound."
                    },
                    {
                        "en": "give (something) We all agreed not to give presents this year.",
                        "vi": "tặng (cái gì đó) Tất cả chúng tôi đều đồng ý không tặng quà trong năm nay."
                    },
                    {
                        "en": "They say it's better to give than to receive.",
                        "vi": "Họ nói rằng tốt hơn là cho đi hơn là nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide somebody with something",
                    "vi": "cung cấp cho ai đó một cái gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something They were all thirsty so I gave them a drink.",
                        "vi": "cho ai đó thứ gì đó Họ đều khát nên tôi cho họ uống."
                    },
                    {
                        "en": "Give me your name and address.",
                        "vi": "Cho tôi tên và địa chỉ của bạn."
                    },
                    {
                        "en": "We've been given a 2 per cent pay increase.",
                        "vi": "Chúng tôi đã được tăng lương 2%."
                    },
                    {
                        "en": "I was hoping you would give me a job.",
                        "vi": "Tôi đã hy vọng bạn sẽ cho tôi một công việc."
                    },
                    {
                        "en": "He was given a new heart in a five-hour operation.",
                        "vi": "Anh ấy đã được trao một trái tim mới trong một ca phẫu thuật kéo dài 5 giờ đồng hồ."
                    },
                    {
                        "en": "Give me some time to decide.",
                        "vi": "Hãy cho tôi một thời gian để quyết định."
                    },
                    {
                        "en": "We should at least give him the opportunity to explain why he did this.",
                        "vi": "Ít nhất chúng ta nên cho anh ta cơ hội để giải thích lý do tại sao anh ta làm điều này."
                    },
                    {
                        "en": "This should give you some idea of the extent of the problem.",
                        "vi": "Điều này sẽ cung cấp cho bạn một số ý tưởng về mức độ của vấn đề."
                    },
                    {
                        "en": "Can you give us some sense of exactly what is at stake here?",
                        "vi": "Bạn có thể cho chúng tôi biết chính xác những gì đang bị đe dọa ở đây không?"
                    },
                    {
                        "en": "We'll give you all the help we can.",
                        "vi": "Chúng tôi sẽ cung cấp cho bạn tất cả sự giúp đỡ mà chúng tôi có thể."
                    },
                    {
                        "en": "She wants a job that gives her more responsibility.",
                        "vi": "Cô ấy muốn một công việc mang lại cho cô ấy nhiều trách nhiệm hơn."
                    },
                    {
                        "en": "Can I give you a ride to the station?",
                        "vi": "Tôi có thể cho bạn một chuyến xe đến nhà ga?"
                    },
                    {
                        "en": "I'll give you (= allow you to have) ten minutes to prepare your answer.",
                        "vi": "Tôi sẽ cho bạn (= cho phép bạn có) mười phút để chuẩn bị câu trả lời của bạn."
                    },
                    {
                        "en": "Don't give me any of that backchat (= don't be rude).",
                        "vi": "Đừng đưa cho tôi bất kỳ backchat đó (= đừng thô lỗ)."
                    },
                    {
                        "en": "give something to somebody He gives Italian lessons to his colleagues.",
                        "vi": "trao một cái gì đó cho ai đó Anh ấy đưa ra những bài học tiếng Ý cho đồng nghiệp của mình."
                    },
                    {
                        "en": "The reforms should give a better chance to the less able children.",
                        "vi": "Các cải cách nên tạo cơ hội tốt hơn cho những trẻ em kém khả năng hơn."
                    },
                    {
                        "en": "give something She gave some helpful advice.",
                        "vi": "đưa ra điều gì đó Cô ấy đã đưa ra một số lời khuyên hữu ích."
                    },
                    {
                        "en": "She gives the impression of being very busy.",
                        "vi": "Cô ấy tạo ấn tượng là rất bận rộn."
                    },
                    {
                        "en": "I was asked to give evidence at the trial.",
                        "vi": "Tôi được yêu cầu đưa ra bằng chứng tại phiên tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money to a charity, etc., to help people",
                    "vi": "để trả tiền cho một tổ chức từ thiện, v.v., để giúp đỡ mọi người"
                },
                "examples": [
                    {
                        "en": "We need your help—please give generously.",
                        "vi": "Chúng tôi cần sự giúp đỡ của bạn — vui lòng rộng lượng."
                    },
                    {
                        "en": "give to something They both gave regularly to charity.",
                        "vi": "cho một cái gì đó Cả hai đều thường xuyên cho từ thiện."
                    },
                    {
                        "en": "give something I gave a small donation.",
                        "vi": "cho một cái gì đó tôi đã cho một khoản đóng góp nhỏ."
                    },
                    {
                        "en": "give something to something A lot of people give money to good causes.",
                        "vi": "cho một cái gì đó cho một cái gì đó Rất nhiều người cho tiền vì những mục đích tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay in order to have or do something",
                    "vi": "trả tiền để có hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something I'll give you £100 and not a penny more!",
                        "vi": "cho ai đó thứ gì đó, tôi sẽ cho bạn £ 100 và không thêm một xu nào!"
                    },
                    {
                        "en": "give somebody something for something How much will you give me for the car?",
                        "vi": "cho ai đó cái gì đó cho cái gì Bạn sẽ cho tôi bao nhiêu tiền cho chiếc xe?"
                    },
                    {
                        "en": "give something I'd give anything to see him again.",
                        "vi": "cho một cái gì đó Tôi sẽ cho bất cứ điều gì để gặp lại anh ta."
                    },
                    {
                        "en": "give something for something I gave £50 for the lot.",
                        "vi": "cho một cái gì đó cho một cái gì đó Tôi đã trả £ 50 cho rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a noun to describe a particular action, giving the same meaning as the related verb",
                    "vi": "Được sử dụng với một danh từ để mô tả một hành động cụ thể, mang lại ý nghĩa tương tự như động từ liên quan"
                },
                "examples": [
                    {
                        "en": "give something She gave a shrug of her shoulders (= shrugged).",
                        "vi": "đưa ra một cái gì đó Cô ấy đã cho một cái nhún vai của cô ấy (= nhún vai)."
                    },
                    {
                        "en": "He turned to us and gave a big smile (= smiled broadly).",
                        "vi": "Anh ấy quay sang chúng tôi và nở một nụ cười thật tươi (= cười thật tươi)."
                    },
                    {
                        "en": "She looked up from her work and gave a yawn (= yawned).",
                        "vi": "Cô ấy ngước lên khỏi chỗ làm của mình và ngáp một cái (= ngáp dài)."
                    },
                    {
                        "en": "He gave a loud cry (= cried out loudly) and fell to the floor.",
                        "vi": "Anh ta hét lên một tiếng (= khóc không thành tiếng) và ngã xuống sàn."
                    },
                    {
                        "en": "Her work has given pleasure to (= pleased) millions of readers.",
                        "vi": "Tác phẩm của cô ấy đã mang lại niềm vui cho (= làm hài lòng) hàng triệu độc giả."
                    },
                    {
                        "en": "give somebody something He gave her a kiss (= kissed her).",
                        "vi": "cho ai đó thứ gì đó. Anh ấy đã cho cô ấy một nụ hôn (= đã hôn cô ấy)."
                    },
                    {
                        "en": "I have to admit that the news gave us a shock (= shocked us).",
                        "vi": "Tôi phải thừa nhận rằng tin tức đã gây cho chúng tôi một cú sốc (= khiến chúng tôi bị sốc)."
                    },
                    {
                        "en": "He gave me a suspicious look (= looked at me suspiciously).",
                        "vi": "Anh ta đưa cho tôi một cái nhìn nghi ngờ (= nhìn tôi nghi ngờ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a particular feeling in somebody",
                    "vi": "để tạo ra một cảm giác cụ thể ở ai đó"
                },
                "examples": [
                    {
                        "en": "All that driving has given me a headache.",
                        "vi": "Tất cả những gì lái xe đã làm cho tôi đau đầu."
                    },
                    {
                        "en": "Go for a walk. It'll give you an appetite.",
                        "vi": "Đi dạo. Nó sẽ mang lại cho bạn cảm giác ngon miệng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a phone call to somebody",
                    "vi": "gọi điện thoại cho ai đó"
                },
                "examples": [
                    {
                        "en": "Give me a call tomorrow.",
                        "vi": "Hãy gọi cho tôi vào ngày mai."
                    },
                    {
                        "en": "(British English) I'll give you a ring.",
                        "vi": "(Anh Anh) Tôi sẽ đưa cho bạn một chiếc nhẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to judge somebody/something to be of a particular standard",
                    "vi": "đánh giá ai đó / cái gì đó theo một tiêu chuẩn cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth She had given the assignment an A.",
                        "vi": "đưa cho ai đó / cái gì đó sth Cô ấy đã cho bài tập là A."
                    },
                    {
                        "en": "I give it ten out of ten for originality.",
                        "vi": "Tôi cho nó mười trên mười cho sự độc đáo."
                    },
                    {
                        "en": "give something He virtually never gives a grade of less than C.",
                        "vi": "đưa ra thứ gì đó Anh ấy hầu như không bao giờ cho điểm dưới C."
                    },
                    {
                        "en": "give something to somebody/something I gave top marks to her essay.",
                        "vi": "tặng một cái gì đó cho ai đó / cái gì đó mà tôi đã cho điểm cao nhất cho bài luận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass an illness onto somebody and make them ill",
                    "vi": "truyền bệnh cho ai đó và làm cho họ bị ốm"
                },
                "examples": [
                    {
                        "en": "give somebody something You've given me your cold.",
                        "vi": "cho ai đó một cái gì đó Bạn đã cho tôi cảm lạnh của bạn."
                    },
                    {
                        "en": "give something to somebody She'd given the bug to all her colleagues.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã đưa lỗi cho tất cả các đồng nghiệp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody suffer a particular punishment",
                    "vi": "để khiến ai đó phải chịu một hình phạt cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody something The judge gave him a nine-month suspended sentence.",
                        "vi": "cho ai đó thứ gì đó. Thẩm phán cho anh ta 9 tháng tù treo."
                    },
                    {
                        "en": "give something to somebody We discussed what punishment should be given to the boys.",
                        "vi": "đưa một cái gì đó cho ai đó Chúng tôi đã thảo luận về hình phạt nào nên được đưa ra cho các cậu bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you give a party, you organize it and invite people",
                    "vi": "nếu bạn tổ chức một bữa tiệc, bạn tổ chức nó và mời mọi người"
                },
                "examples": [
                    {
                        "en": "We're giving a party to celebrate our silver wedding.",
                        "vi": "Chúng tôi đang tổ chức một bữa tiệc để kỷ niệm đám cưới bạc của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform something in public",
                    "vi": "để biểu diễn một cái gì đó trước công chúng"
                },
                "examples": [
                    {
                        "en": "give something He gave a rousing performance of the Bob Marley song.",
                        "vi": "đưa ra thứ gì đó Anh ấy đã trình diễn bài hát của Bob Marley một cách sôi động."
                    },
                    {
                        "en": "She gave a reading from her latest volume of poetry.",
                        "vi": "Cô ấy đã đọc tập thơ mới nhất của mình."
                    },
                    {
                        "en": "The President will be giving a press conference this afternoon.",
                        "vi": "Tổng thống sẽ có một cuộc họp báo vào chiều nay."
                    },
                    {
                        "en": "give something to somebody She gave a fine speech to the waiting crowd.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã có một bài phát biểu hay trước đám đông đang chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use time, energy, etc. for somebody/something",
                    "vi": "để sử dụng thời gian, năng lượng, v.v. cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth I gave the matter a lot of thought.",
                        "vi": "cho ai đó / cái gì đó tôi đã suy nghĩ rất nhiều vấn đề."
                    },
                    {
                        "en": "give something to somebody/something I gave a lot of thought to the matter.",
                        "vi": "đưa cái gì đó cho ai đó / cái gì đó mà tôi đã suy nghĩ rất nhiều về vấn đề."
                    },
                    {
                        "en": "The government has given top priority to reforming the tax system.",
                        "vi": "Chính phủ đã dành ưu tiên hàng đầu cho việc cải cách hệ thống thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to predict that something will last a particular length of time",
                    "vi": "để dự đoán rằng điều gì đó sẽ tồn tại trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "That marriage won't last. I'll give them two years at the outside.",
                        "vi": "Cuộc hôn nhân đó sẽ không kéo dài. Tôi sẽ cho họ hai năm ở bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that a player or the ball is in a particular position or that a goal has been scored",
                    "vi": "để nói rằng một cầu thủ hoặc quả bóng đang ở một vị trí cụ thể hoặc một bàn thắng đã được ghi"
                },
                "examples": [
                    {
                        "en": "give somebody/something + adj. The umpire gave the ball out.",
                        "vi": "cho ai đó / cái gì đó + adj. Trọng tài chính đưa bóng ra ngoài."
                    },
                    {
                        "en": "give something The ref gave the goal.",
                        "vi": "đưa ra một cái gì đó Người giới thiệu đã đưa ra mục tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bend or stretch under pressure",
                    "vi": "uốn cong hoặc kéo dài dưới áp lực"
                },
                "examples": [
                    {
                        "en": "The branch began to give under his weight.",
                        "vi": "Cành bắt đầu cho dưới sức nặng của anh ta."
                    },
                    {
                        "en": "(figurative) We can't go on like this—something's got to give.",
                        "vi": "(nghĩa bóng) Chúng ta không thể tiếp tục như thế này - phải cho đi một cái gì đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to change your mind or give up some of your demands",
                    "vi": "đồng ý thay đổi ý định hoặc từ bỏ một số yêu cầu của bạn"
                },
                "examples": [
                    {
                        "en": "You're going to have to give a little.",
                        "vi": "Bạn sẽ phải cho một ít."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you do not accept what they say",
                    "vi": "từng nói với ai đó rằng bạn không chấp nhận những gì họ nói"
                },
                "examples": [
                    {
                        "en": "‘I didn't have time to do it.’ ‘Oh, don't give me that!’",
                        "vi": "Tôi không có thời gian để làm việc đó.' 'Ồ, đừng đưa tôi cái đó!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing, in a relationship, to accept what somebody else wants and to give up some of what you want",
                    "vi": "sẵn sàng, trong một mối quan hệ, chấp nhận những gì người khác muốn và từ bỏ một số điều bạn muốn"
                },
                "examples": [
                    {
                        "en": "You're going to have to learn to give and take.",
                        "vi": "Bạn sẽ phải học cách cho và nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react with equal force when somebody attacks or criticizes you",
                    "vi": "phản ứng với lực lượng ngang nhau khi ai đó tấn công hoặc chỉ trích bạn"
                },
                "examples": [
                    {
                        "en": "She can give as good as she gets.",
                        "vi": "Cô ấy có thể cho càng nhiều càng tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show your approval of somebody by clapping your hands",
                    "vi": "để thể hiện sự tán thành của bạn đối với ai đó bằng cách vỗ tay của bạn"
                },
                "examples": [
                    {
                        "en": "Give it up for Ed Sheeran!",
                        "vi": "Hãy từ bỏ nó cho Ed Sheeran!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you prefer a particular thing or person to the one that has just been mentioned",
                    "vi": "được sử dụng để nói rằng bạn thích một điều hoặc một người cụ thể hơn một điều vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "We don't go out much. Give me a quiet night in front of the TV any day!",
                        "vi": "Chúng tôi không đi chơi nhiều. Cho tôi một đêm yên tĩnh trước TV bất cứ ngày nào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is correct give or take a particular amount, it is approximately correct",
                    "vi": "nếu một cái gì đó là chính xác cho hoặc lấy một số lượng cụ thể, nó là gần đúng"
                },
                "examples": [
                    {
                        "en": "It'll take about three weeks, give or take a day or so.",
                        "vi": "Sẽ mất khoảng ba tuần, cho hoặc lâu hơn một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody believe/understand something",
                    "vi": "để làm cho ai đó tin / hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was given to understand that she had resigned.",
                        "vi": "Tôi được cho để hiểu rằng cô ấy đã từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to severely punish or criticize somebody for doing something wrong",
                    "vi": "trừng phạt nghiêm khắc hoặc chỉ trích ai đó đã làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "My son was rude to my friends so I gave him what for.",
                        "vi": "Con trai tôi vô lễ với bạn bè của tôi vì vậy tôi đã cho nó để làm gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask people to drink a toast to somebody",
                    "vi": "từng yêu cầu mọi người uống bánh mì nướng với ai đó"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, I give you Geoff Ogilby!",
                        "vi": "Thưa quý vị, tôi tặng quý vị Geoff Ogilby!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are admitting that something is true",
                    "vi": "được sử dụng khi bạn thừa nhận rằng điều gì đó là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what is happening?; what is the news?",
                    "vi": "chuyện gì đang xảy ra vậy ?; tin tức là gì?"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "463d5456dd2b487aad55b06d01b86e11",
        "word": "pay",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/peɪ/",
            "us": "/peɪ/"
        },
        "nearby": [
            {
                "word": "pawnshop",
                "pos": "noun"
            },
            {
                "word": "pawpaw",
                "pos": "noun"
            },
            {
                "word": "pay",
                "pos": "verb"
            },
            {
                "word": "pay",
                "pos": "noun"
            },
            {
                "word": "payable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody money for work, goods, services, etc.",
                    "vi": "để cung cấp cho ai đó tiền cho công việc, hàng hóa, dịch vụ, v.v."
                },
                "examples": [
                    {
                        "en": "Who's paying?",
                        "vi": "Ai trả tiền?"
                    },
                    {
                        "en": "pay for something I'll pay for the tickets.",
                        "vi": "trả tiền cho một cái gì đó Tôi sẽ trả tiền cho vé."
                    },
                    {
                        "en": "You have to pay extra for a single room.",
                        "vi": "Bạn phải trả thêm tiền cho một phòng đơn."
                    },
                    {
                        "en": "Many consumers are willing to pay more for better service.",
                        "vi": "Nhiều người tiêu dùng sẵn sàng trả nhiều tiền hơn để được phục vụ tốt hơn."
                    },
                    {
                        "en": "pay somebody for something Let me pay you for your time.",
                        "vi": "trả ai đó cho một cái gì đó Hãy để tôi trả cho bạn thời gian của bạn."
                    },
                    {
                        "en": "pay for somebody to do something Her parents paid for her to go to Canada.",
                        "vi": "trả tiền cho ai đó làm việc gì đó Cha mẹ cô ấy đã trả tiền để cô ấy đi Canada."
                    },
                    {
                        "en": "pay somebody Would you mind paying the taxi driver?",
                        "vi": "trả tiền cho ai đó Bạn có phiền trả tiền cho tài xế taxi không?"
                    },
                    {
                        "en": "pay somebody something She's paid $200 a day.",
                        "vi": "trả cho ai đó thứ gì đó Cô ấy được trả 200 đô la một ngày."
                    },
                    {
                        "en": "pay something Let me pay the bill.",
                        "vi": "trả một cái gì đó Hãy để tôi thanh toán hóa đơn."
                    },
                    {
                        "en": "pay by something Are you paying by card?",
                        "vi": "thanh toán bằng cái gì Bạn đang thanh toán bằng thẻ?"
                    },
                    {
                        "en": "pay (in) something to pay (in) cash",
                        "vi": "trả (bằng) cái gì đó để trả (bằng) tiền mặt"
                    },
                    {
                        "en": "pay something for something She pays £200 a week for this apartment.",
                        "vi": "trả một cái gì đó cho một cái gì đó Cô ấy trả £ 200 một tuần cho căn hộ này."
                    },
                    {
                        "en": "pay somebody/something to do something I don't pay you to sit around all day doing nothing!",
                        "vi": "trả tiền cho ai đó / cái gì đó để làm điều gì đó Tôi không trả tiền cho bạn để ngồi xung quanh cả ngày không làm gì cả!"
                    },
                    {
                        "en": "pay somebody something to do something I pay him £10 to clean the car.",
                        "vi": "trả cho ai đó một cái gì đó để làm một cái gì đó Tôi trả cho anh ta 10 bảng Anh để làm sạch xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody money that you owe them",
                    "vi": "để cho ai đó số tiền mà bạn nợ họ"
                },
                "examples": [
                    {
                        "en": "pay something to pay a fee/bill/fine/debt",
                        "vi": "trả một cái gì đó để trả một khoản phí / hóa đơn / tiền phạt / nợ"
                    },
                    {
                        "en": "to pay your rent",
                        "vi": "trả tiền thuê nhà của bạn"
                    },
                    {
                        "en": "Everyone has to pay their taxes.",
                        "vi": "Mọi người đều phải trả thuế của họ."
                    },
                    {
                        "en": "The union paid all her legal costs.",
                        "vi": "Công đoàn đã trả tất cả các chi phí pháp lý cho cô ấy."
                    },
                    {
                        "en": "pay something to somebody Membership fees should be paid to the secretary.",
                        "vi": "trả một cái gì đó cho ai đó Phí thành viên phải được trả cho thư ký."
                    },
                    {
                        "en": "pay somebody something He still hasn't paid me the money he owes me.",
                        "vi": "trả cho ai đó cái gì đó. Anh ấy vẫn chưa trả cho tôi số tiền mà anh ấy nợ tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or provide a particular amount of money for the work that somebody does",
                    "vi": "để cung cấp hoặc cung cấp một số tiền cụ thể cho công việc mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "Software firms generally pay well (= pay high salaries).",
                        "vi": "Các công ty phần mềm thường trả lương cao (= trả lương cao)."
                    },
                    {
                        "en": "jobs that pay less than £10 an hour",
                        "vi": "công việc trả ít hơn £ 10 một giờ"
                    },
                    {
                        "en": "I need to get a job that pays better.",
                        "vi": "Tôi cần kiếm một công việc trả lương cao hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with some nouns to show that you are giving or doing the thing mentioned",
                    "vi": "được sử dụng với một số danh từ để chỉ ra rằng bạn đang cho hoặc làm điều được đề cập"
                },
                "examples": [
                    {
                        "en": "pay something Most of the students weren't paying attention.",
                        "vi": "trả một cái gì đó Hầu hết các học sinh đã không chú ý."
                    },
                    {
                        "en": "pay something to something/somebody The director paid tribute to all she had done for the charity.",
                        "vi": "trả một cái gì đó cho cái gì đó / ai đó Giám đốc đã tri ân tất cả những gì cô ấy đã làm cho tổ chức từ thiện."
                    },
                    {
                        "en": "He paid a visit to Japan last year.",
                        "vi": "Anh ấy đã đến thăm Nhật Bản vào năm ngoái."
                    },
                    {
                        "en": "The film pays homage to classic Hollywood musicals.",
                        "vi": "Bộ phim bày tỏ lòng kính trọng với những vở nhạc kịch kinh điển của Hollywood."
                    },
                    {
                        "en": "pay somebody something I'll pay you a visit when I'm next in town.",
                        "vi": "trả cho ai đó thứ gì đó. Tôi sẽ đến thăm bạn khi tôi đến thị trấn lần sau."
                    },
                    {
                        "en": "He's always paying me compliments.",
                        "vi": "Anh ấy luôn khen ngợi tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a profit; to result in some advantage for somebody",
                    "vi": "để tạo ra lợi nhuận; để dẫn đến một số lợi thế cho ai đó"
                },
                "examples": [
                    {
                        "en": "It's hard to make farming pay.",
                        "vi": "Thật khó để làm cho công việc nông nghiệp được trả công."
                    },
                    {
                        "en": "Crime doesn't pay.",
                        "vi": "Tội gì không trả."
                    },
                    {
                        "en": "it pays to do something It pays to keep up to date with your work.",
                        "vi": "nó trả tiền để làm một cái gì đó Nó trả tiền để luôn cập nhật công việc của bạn."
                    },
                    {
                        "en": "it pays somebody to do something It would probably pay you to hire an accountant.",
                        "vi": "nó trả tiền cho ai đó để làm điều gì đó Nó có thể sẽ trả tiền cho bạn để thuê một kế toán."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suffer or be punished for your beliefs or actions",
                    "vi": "phải chịu đựng hoặc bị trừng phạt vì niềm tin hoặc hành động của bạn"
                },
                "examples": [
                    {
                        "en": "pay for something You'll pay for that remark!",
                        "vi": "trả tiền cho một cái gì đó Bạn sẽ trả tiền cho nhận xét đó!"
                    },
                    {
                        "en": "He will pay dearly for what he did.",
                        "vi": "Anh ta sẽ phải trả giá đắt cho những gì mình đã làm."
                    },
                    {
                        "en": "pay with something Many people paid with their lives (= they died).",
                        "vi": "trả giá bằng cái gì đó Nhiều người đã trả giá bằng mạng sống của họ (= họ đã chết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cost/pay a lot of money",
                    "vi": "tốn kém / trả nhiều tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a lot of trouble",
                    "vi": "rất nhiều rắc rối"
                },
                "examples": [
                    {
                        "en": "There'll be hell to pay when he finds out.",
                        "vi": "Sẽ có địa ngục phải trả khi anh ta phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay careful attention to somebody/something",
                    "vi": "chú ý cẩn thận đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "They gave little heed to the rumours.",
                        "vi": "Họ ít chú ý đến những tin đồn."
                    },
                    {
                        "en": "I paid no heed at the time but later I had cause to remember what he’d said.",
                        "vi": "Lúc đó tôi không để ý đến nhưng sau này tôi có lý do để nhớ những gì anh ấy đã nói."
                    },
                    {
                        "en": "Small businesses would be wise to take heed of the warnings contained in the Chancellor’s speech.",
                        "vi": "Các doanh nghiệp nhỏ sẽ là khôn ngoan khi chú ý đến những cảnh báo trong bài phát biểu của Thủ tướng."
                    },
                    {
                        "en": "She took little heed of her surroundings.",
                        "vi": "Cô ấy không để ý đến xung quanh mình."
                    },
                    {
                        "en": "They paid no heed to the advice.",
                        "vi": "Họ không để ý đến lời khuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person who provides the money for something can also control how it is spent",
                    "vi": "người cung cấp tiền cho một cái gì đó cũng có thể kiểm soát cách nó được chi tiêu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give no attention to somebody/something",
                    "vi": "không chú ý đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "People call him names sometimes, but he doesn't pay them any mind.",
                        "vi": "Đôi khi người ta gọi tên anh ấy, nhưng anh ấy không để tâm đến họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody with great respect in order to gain favour with them",
                    "vi": "đối xử với ai đó bằng sự tôn trọng tuyệt vời để có được sự ưu ái với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to work hard and gain experience, so that you deserve success or respect",
                    "vi": "để làm việc chăm chỉ và tích lũy kinh nghiệm, để bạn xứng đáng nhận được thành công hoặc sự tôn trọng"
                },
                "examples": [
                    {
                        "en": "As a young actor, he paid his dues in small roles.",
                        "vi": "Là một diễn viên trẻ, anh ấy đã đóng phí của mình trong những vai nhỏ."
                    },
                    {
                        "en": "She is incredibly qualified and has paid her dues to become president.",
                        "vi": "Cô ấy cực kỳ đủ tiêu chuẩn và đã trả phí để trở thành tổng thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do what is required or expected of you",
                    "vi": "để làm những gì được yêu cầu hoặc mong đợi ở bạn"
                },
                "examples": [
                    {
                        "en": "Vick paid his dues (= completed his punishment), and since being released from prison has been a model citizen.",
                        "vi": "Vick đã đóng phí (= hoàn thành hình phạt của mình), và kể từ khi ra tù, anh đã trở thành một công dân kiểu mẫu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to save as much money as it cost",
                    "vi": "để tiết kiệm càng nhiều tiền càng tốt"
                },
                "examples": [
                    {
                        "en": "The rail pass will pay for itself after about two trips.",
                        "vi": "Thẻ đường sắt sẽ tự thanh toán sau khoảng hai chuyến đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that something cost(s) a lot of money, especially if the money is wasted",
                    "vi": "được sử dụng để nhấn mạnh rằng một cái gì đó tốn rất nhiều tiền, đặc biệt là nếu số tiền đó bị lãng phí"
                },
                "examples": [
                    {
                        "en": "I paid good money for this jacket, and now look at it—it's ruined!",
                        "vi": "Tôi đã trả rất nhiều tiền cho chiếc áo khoác này, và bây giờ hãy nhìn nó — nó đã bị hỏng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to suffer because of bad luck, a mistake or something you have done",
                    "vi": "đau khổ vì không may mắn, một sai lầm hoặc điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "He looked terrible this morning. I think he's paying the penalty for all those late nights.",
                        "vi": "Anh ấy trông thật kinh khủng vào sáng nay. Tôi nghĩ anh ta phải trả giá phạt cho tất cả những đêm muộn đó."
                    },
                    {
                        "en": "They're now paying the price for past mistakes.",
                        "vi": "Giờ đây, họ đang phải trả giá cho những sai lầm trong quá khứ."
                    },
                    {
                        "en": "She thinks that any inconvenience is a price worth paying for living in such a beautiful place.",
                        "vi": "Cô cho rằng bất kỳ sự bất tiện nào cũng là cái giá phải trả khi sống ở một nơi đẹp đẽ như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to visit somebody or to send a message of good wishes as a sign of respect for them",
                    "vi": "đến thăm ai đó hoặc gửi một tin nhắn chúc tốt đẹp như một dấu hiệu của sự tôn trọng dành cho họ"
                },
                "examples": [
                    {
                        "en": "Many came to pay their last respects (= by attending somebody's funeral).",
                        "vi": "Nhiều người đến để bày tỏ lòng kính trọng lần cuối (= bằng cách tham dự đám tang của ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay too much money for something",
                    "vi": "trả quá nhiều tiền cho một thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make enough money to pay what it costs to keep it going",
                    "vi": "kiếm đủ tiền để trả những gì phải trả để tiếp tục hoạt động"
                },
                "examples": [
                    {
                        "en": "The bridge is still not paying its way.",
                        "vi": "Cây cầu vẫn không trả tiền theo cách của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay for everything yourself without having to rely on anyone else’s money",
                    "vi": "tự mình chi trả mọi thứ mà không phải dựa vào tiền của bất kỳ ai khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to borrow money from one person to pay back what you owe to another person; to take money from one thing to use for something else",
                    "vi": "vay tiền từ một người để trả lại những gì bạn nợ người khác; lấy tiền từ thứ này để sử dụng cho thứ khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used for saying that there is very little difference between two or more things that you can choose",
                    "vi": "được sử dụng để nói rằng có rất ít sự khác biệt giữa hai hoặc nhiều thứ mà bạn có thể chọn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e90716381f84b8f9ab34c01c08d4978",
        "word": "pay",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/peɪ/",
            "us": "/peɪ/"
        },
        "nearby": [
            {
                "word": "pawpaw",
                "pos": "noun"
            },
            {
                "word": "pay",
                "pos": "verb"
            },
            {
                "word": "pay",
                "pos": "noun"
            },
            {
                "word": "payable",
                "pos": "adjective"
            },
            {
                "word": "pay and display",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the money that somebody gets for doing regular work",
                    "vi": "số tiền mà ai đó nhận được để làm công việc thường xuyên"
                },
                "examples": [
                    {
                        "en": "Her job is hard work, but the pay is good.",
                        "vi": "Công việc của cô ấy là công việc khó khăn, nhưng lương rất tốt."
                    },
                    {
                        "en": "workers on low pay",
                        "vi": "công nhân lương thấp"
                    },
                    {
                        "en": "overtime/holiday pay",
                        "vi": "lương làm thêm giờ / ngày lễ"
                    },
                    {
                        "en": "Her monthly take-home pay after taxes is $2 600.",
                        "vi": "Tiền trả hàng tháng của cô ấy sau thuế là $ 2 600."
                    },
                    {
                        "en": "the principle of equal pay for equal work",
                        "vi": "nguyên tắc trả công bình đẳng cho công việc như nhau"
                    },
                    {
                        "en": "Two members of staff have been suspended on full pay.",
                        "vi": "Hai nhân viên đã bị đình chỉ lương."
                    },
                    {
                        "en": "a pay increase/cut",
                        "vi": "tăng / giảm lương"
                    },
                    {
                        "en": "(British English) a pay rise",
                        "vi": "(Tiếng Anh Anh) tăng lương"
                    },
                    {
                        "en": "(North American English) a pay raise",
                        "vi": "(Tiếng Anh Bắc Mỹ) tăng lương"
                    },
                    {
                        "en": "a 3 per cent pay offer",
                        "vi": "một đề nghị trả lương 3 phần trăm"
                    },
                    {
                        "en": "The company has imposed a two-year pay freeze.",
                        "vi": "Công ty đã áp dụng hình thức đóng băng lương trong hai năm."
                    },
                    {
                        "en": "the pay gap between men and women",
                        "vi": "chênh lệch lương giữa nam và nữ"
                    },
                    {
                        "en": "to make a pay claim (= to officially ask for an increase in pay)",
                        "vi": "để yêu cầu thanh toán (= chính thức yêu cầu tăng lương)"
                    },
                    {
                        "en": "They demanded improved pay and conditions.",
                        "vi": "Họ yêu cầu cải thiện lương và các điều kiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "working for somebody or for an organization, often secretly",
                    "vi": "làm việc cho ai đó hoặc cho một tổ chức, thường bí mật"
                },
                "examples": [
                    {
                        "en": "He was in the pay of the drugs barons.",
                        "vi": "Anh ta đã phải trả giá của những ông trùm ma túy."
                    }
                ]
            }
        ]
    },
    {
        "id": "027effaf67794d47b5eadf83abbae961",
        "word": "payment",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpeɪmənt/",
            "us": "/ˈpeɪmənt/"
        },
        "nearby": [
            {
                "word": "paymaster",
                "pos": "noun"
            },
            {
                "word": "the Paymaster General",
                "pos": ""
            },
            {
                "word": "payment",
                "pos": "noun"
            },
            {
                "word": "pay off",
                "pos": "phrasal verb"
            },
            {
                "word": "pay-off",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of paying somebody/something or of being paid",
                    "vi": "hành động trả tiền cho ai đó / cái gì đó hoặc được trả tiền"
                },
                "examples": [
                    {
                        "en": "What method of payment do you prefer?",
                        "vi": "Bạn thích phương thức thanh toán nào hơn?"
                    },
                    {
                        "en": "payment in cash/by cheque",
                        "vi": "thanh toán bằng tiền mặt / bằng séc"
                    },
                    {
                        "en": "They asked for payment in advance.",
                        "vi": "Họ yêu cầu thanh toán trước."
                    },
                    {
                        "en": "There will be a penalty for late payment of bills.",
                        "vi": "Sẽ có một khoản phạt nếu thanh toán chậm các hóa đơn."
                    },
                    {
                        "en": "to receive/accept/demand/withhold payment",
                        "vi": "để nhận / chấp nhận / yêu cầu / giữ lại thanh toán"
                    },
                    {
                        "en": "payment for something payment for goods/services",
                        "vi": "thanh toán cho một cái gì đó thanh toán cho hàng hóa / dịch vụ"
                    },
                    {
                        "en": "on payment of something The public has right of access, on payment of a fee.",
                        "vi": "khi thanh toán một thứ gì đó Công chúng có quyền tiếp cận, trả một khoản phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money paid or expected to be paid",
                    "vi": "một khoản tiền được trả hoặc dự kiến sẽ được trả"
                },
                "examples": [
                    {
                        "en": "a cash payment",
                        "vi": "thanh toán bằng tiền mặt"
                    },
                    {
                        "en": "It's important to make the payments on time.",
                        "vi": "Điều quan trọng là phải thực hiện thanh toán đúng hạn."
                    },
                    {
                        "en": "to receive/accept/demand/withhold a payment",
                        "vi": "để nhận / chấp nhận / yêu cầu / giữ lại một khoản thanh toán"
                    },
                    {
                        "en": "interest payments",
                        "vi": "thanh toán lãi suất"
                    },
                    {
                        "en": "They've never missed a mortgage payment.",
                        "vi": "Họ chưa bao giờ bỏ lỡ một khoản thanh toán thế chấp."
                    },
                    {
                        "en": "He agreed to make ten monthly payments of £50.",
                        "vi": "Anh ấy đã đồng ý thực hiện mười khoản thanh toán hàng tháng là 50 bảng Anh."
                    },
                    {
                        "en": "payment on something They are finding it difficult to meet the payments on their car.",
                        "vi": "thanh toán cho một cái gì đó Họ đang cảm thấy khó khăn để đáp ứng các khoản thanh toán trên xe của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a reward or an act of thanks for something you have done",
                    "vi": "một phần thưởng hoặc một hành động cảm ơn cho một điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "payment (for something) Is this all the payment I get for my efforts?",
                        "vi": "thanh toán (cho một cái gì đó) Đây có phải là tất cả khoản thanh toán mà tôi nhận được cho những nỗ lực của mình không?"
                    },
                    {
                        "en": "in payment for something We'd like you to accept this gift in payment for your kindness.",
                        "vi": "thanh toán cho thứ gì đó Chúng tôi muốn bạn nhận món quà này để thanh toán cho lòng tốt của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "after something has been paid",
                    "vi": "sau khi một cái gì đó đã được thanh toán"
                },
                "examples": [
                    {
                        "en": "Entry is only allowed on payment of the full registration fee.",
                        "vi": "Chỉ được phép vào cửa khi đã thanh toán đủ phí đăng ký."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c67ef8de05047d0938bc19bccf60059",
        "word": "receipt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈsiːt/",
            "us": "/rɪˈsiːt/"
        },
        "nearby": [
            {
                "word": "recce",
                "pos": "noun"
            },
            {
                "word": "recede",
                "pos": "verb"
            },
            {
                "word": "receipt",
                "pos": "noun"
            },
            {
                "word": "receivable",
                "pos": "adjective"
            },
            {
                "word": "receivables",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of paper or an electronic document that shows that goods or services have been paid for",
                    "vi": "một mảnh giấy hoặc một tài liệu điện tử cho thấy rằng hàng hoá hoặc dịch vụ đã được thanh toán"
                },
                "examples": [
                    {
                        "en": "Can I have a receipt, please?",
                        "vi": "Tôi có thể có một nhận xin vui lòng?"
                    },
                    {
                        "en": "receipt for something Do you need a receipt for that?",
                        "vi": "biên lai cho một cái gì đó Bạn có cần một biên lai cho cái đó?"
                    },
                    {
                        "en": "We will email the receipt to you.",
                        "vi": "Chúng tôi sẽ gửi biên nhận qua email cho bạn."
                    },
                    {
                        "en": "I kept the receipt, so I can return it if you don't like it.",
                        "vi": "Tôi đã giữ biên lai, vì vậy tôi có thể trả lại nếu bạn không thích."
                    },
                    {
                        "en": "to make out (= write) a receipt",
                        "vi": "để lập (= viết) một biên lai"
                    },
                    {
                        "en": "They have to submit receipts to support all expenditure.",
                        "vi": "Họ phải nộp biên lai để hỗ trợ mọi chi tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of receiving something",
                    "vi": "hành động nhận một cái gì đó"
                },
                "examples": [
                    {
                        "en": "You will get an automatic reply to your email confirming receipt.",
                        "vi": "Bạn sẽ nhận được thư trả lời tự động cho email xác nhận đã nhận."
                    },
                    {
                        "en": "receipt of something to acknowledge receipt of a letter",
                        "vi": "nhận một cái gì đó để xác nhận đã nhận một lá thư"
                    },
                    {
                        "en": "on receipt of something The goods will be dispatched on receipt of an order form.",
                        "vi": "khi nhận được thứ gì đó Hàng hóa sẽ được gửi đi khi nhận được đơn đặt hàng."
                    },
                    {
                        "en": "in receipt of something Are you in receipt of any state benefits?",
                        "vi": "khi nhận được một cái gì đó Bạn có đang nhận được bất kỳ phúc lợi nào của tiểu bang không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "money that a business, bank or government receives",
                    "vi": "tiền mà một doanh nghiệp, ngân hàng hoặc chính phủ nhận được"
                },
                "examples": [
                    {
                        "en": "net/gross receipts",
                        "vi": "tổng thu nhập ròng / tổng"
                    }
                ]
            }
        ]
    },
    {
        "id": "18b07416fc8b42298d8a730a0b10d1cf",
        "word": "rent",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rent/",
            "us": "/rent/"
        },
        "nearby": [
            {
                "word": "renown",
                "pos": "noun"
            },
            {
                "word": "renowned",
                "pos": "adjective"
            },
            {
                "word": "rent",
                "pos": "noun"
            },
            {
                "word": "rent",
                "pos": "verb"
            },
            {
                "word": "rent-a-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that you regularly pay so that you can use a house, room, etc.",
                    "vi": "một khoản tiền mà bạn phải trả thường xuyên để bạn có thể sử dụng một ngôi nhà, căn phòng, v.v."
                },
                "examples": [
                    {
                        "en": "I earn just about enough to pay the rent.",
                        "vi": "Tôi kiếm được chỉ đủ để trả tiền thuê nhà."
                    },
                    {
                        "en": "How much rent do you pay for this place?",
                        "vi": "Bạn phải trả bao nhiêu tiền thuê cho nơi này?"
                    },
                    {
                        "en": "The landlord has put the rent up again.",
                        "vi": "Chủ nhà đã tăng tiền thuê nhà một lần nữa."
                    },
                    {
                        "en": "The landlord charged them a month's rent in advance.",
                        "vi": "Chủ nhà đã tính trước cho họ một tháng tiền thuê nhà."
                    },
                    {
                        "en": "a high/low/fair rent",
                        "vi": "giá thuê cao / thấp / hợp lý"
                    },
                    {
                        "en": "He was evicted for rent arrears.",
                        "vi": "Anh ta bị đuổi ra khỏi nhà vì nợ tiền thuê nhà."
                    },
                    {
                        "en": "rent for something What's the average rent for homes in your part of town?",
                        "vi": "thuê cho một cái gì đó Giá thuê nhà trung bình cho những ngôi nhà trong thành phố của bạn là bao nhiêu?"
                    },
                    {
                        "en": "rent on something The rent on the two-bedroom flat was £250 a week.",
                        "vi": "thuê một thứ gì đó Giá thuê căn hộ hai phòng ngủ là 250 bảng một tuần."
                    },
                    {
                        "en": "at a … rent The supply of housing at affordable rents became inadequate.",
                        "vi": "với giá… thuê Nguồn cung nhà ở với giá thuê phải chăng trở nên thiếu hụt."
                    },
                    {
                        "en": "at a rent of something The property is available at a rent of £55,000 per annum.",
                        "vi": "với giá thuê của một cái gì đó Bất động sản có sẵn với giá thuê là 55.000 bảng Anh mỗi năm."
                    },
                    {
                        "en": "(British English) a rent book (= used to record payments of rent)",
                        "vi": "(Tiếng Anh Anh) sổ thuê (= được sử dụng để ghi lại các khoản thanh toán tiền thuê)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of money that you pay to use something for a particular period of time",
                    "vi": "số tiền bạn phải trả để sử dụng thứ gì đó trong một khoảng thời gian cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a torn place in a piece of material or clothing",
                    "vi": "một nơi bị rách trong một mảnh vật liệu hoặc quần áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "available to rent",
                    "vi": "có sẵn để thuê"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4bf576de5c44381a727c0d793c28d02",
        "word": "rent",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/rent/",
            "us": "/rent/"
        },
        "nearby": [
            {
                "word": "renowned",
                "pos": "adjective"
            },
            {
                "word": "rent",
                "pos": "noun"
            },
            {
                "word": "rent",
                "pos": "verb"
            },
            {
                "word": "rent-a-",
                "pos": "combining form"
            },
            {
                "word": "the Rent Act",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to regularly pay money to somebody so that you can use something that they own, such as a house, a room, some land, etc.",
                    "vi": "thường xuyên trả tiền cho ai đó để bạn có thể sử dụng thứ mà họ sở hữu, chẳng hạn như một ngôi nhà, một căn phòng, một số mảnh đất, v.v."
                },
                "examples": [
                    {
                        "en": "Are you looking to buy or rent?",
                        "vi": "Bạn đang muốn mua hoặc thuê?"
                    },
                    {
                        "en": "rent something to rent a house/an apartment",
                        "vi": "thuê một cái gì đó để thuê một ngôi nhà / một căn hộ"
                    },
                    {
                        "en": "to live in rented accommodation/housing/property",
                        "vi": "sống trong chỗ ở thuê / nhà ở / tài sản"
                    },
                    {
                        "en": "The property is available to rent on a short-term lease.",
                        "vi": "Tài sản có sẵn để cho thuê theo hợp đồng ngắn hạn."
                    },
                    {
                        "en": "We're looking for a house to rent in the area.",
                        "vi": "Chúng tôi đang tìm một ngôi nhà cho thuê trong khu vực."
                    },
                    {
                        "en": "rent something from somebody Who do you rent the land from?",
                        "vi": "thuê một cái gì đó từ ai đó Bạn thuê đất của ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to use something that you own such as a house or some land in exchange for regular payments",
                    "vi": "cho phép ai đó sử dụng thứ gì đó mà bạn sở hữu chẳng hạn như một ngôi nhà hoặc một số mảnh đất để đổi lấy các khoản thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "rent something (out) We rented our house out for a year when we went abroad.",
                        "vi": "thuê một cái gì đó (ra ngoài) Chúng tôi đã thuê nhà của mình trong một năm khi chúng tôi ra nước ngoài."
                    },
                    {
                        "en": "She bought a three-bedroom flat with the objective of renting two rooms.",
                        "vi": "Cô mua một căn hộ ba phòng ngủ với mục tiêu cho thuê hai phòng."
                    },
                    {
                        "en": "He is making a profit from renting out the property.",
                        "vi": "Anh ta đang kiếm được lợi nhuận từ việc cho thuê tài sản."
                    },
                    {
                        "en": "rent something (out) to somebody He rents rooms in his house to students.",
                        "vi": "thuê một cái gì đó (ngoài) cho ai đó Anh ấy cho sinh viên thuê các phòng trong nhà của mình."
                    },
                    {
                        "en": "The land is rented out to other farmers.",
                        "vi": "Đất được cho những người nông dân khác thuê."
                    },
                    {
                        "en": "She agreed to rent the room to me.",
                        "vi": "Cô ấy đồng ý cho tôi thuê phòng."
                    },
                    {
                        "en": "rent somebody something She agreed to rent me the room.",
                        "vi": "thuê ai đó một cái gì đó Cô ấy đồng ý cho tôi thuê phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money to somebody so that you can use something for a short period of time",
                    "vi": "trả tiền cho ai đó để bạn có thể sử dụng thứ gì đó trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "to rent a film/movie/DVD",
                        "vi": "thuê phim / phim / DVD"
                    },
                    {
                        "en": "We rented a car for the week and explored the area.",
                        "vi": "Chúng tôi thuê một chiếc xe trong tuần và khám phá khu vực này."
                    },
                    {
                        "en": "to rent a bike/van/boat",
                        "vi": "thuê xe đạp / xe van / thuyền"
                    },
                    {
                        "en": "They rented a meeting room in a downtown hotel.",
                        "vi": "Họ thuê một phòng họp trong một khách sạn ở trung tâm thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be available for somebody to use if they pay a particular amount of money",
                    "vi": "sẵn sàng cho ai đó sử dụng nếu họ trả một số tiền cụ thể"
                },
                "examples": [
                    {
                        "en": "The apartment rents for $500 a month.",
                        "vi": "Căn hộ cho thuê với giá $ 500 một tháng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c11d0ccf9e56473681e37c5d10f47ddf",
        "word": "sales slip",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈseɪlz slɪp/",
            "us": "/ˈseɪlz slɪp/"
        },
        "nearby": [
            {
                "word": "sales rep",
                "pos": "noun"
            },
            {
                "word": "salesroom",
                "pos": "noun"
            },
            {
                "word": "sales slip",
                "pos": "noun"
            },
            {
                "word": "sales talk",
                "pos": "noun"
            },
            {
                "word": "sales tax",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of paper that shows that goods or services have been paid for",
                    "vi": "một mảnh giấy cho thấy rằng hàng hóa hoặc dịch vụ đã được thanh toán cho"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0aa8f0e13fd343c592ddee61ad98b6f1",
        "word": "tip",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tɪp/",
            "us": "/tɪp/"
        },
        "nearby": [
            {
                "word": "Dimitri Tiomkin",
                "pos": ""
            },
            {
                "word": "-tion",
                "pos": "suffix"
            },
            {
                "word": "tip",
                "pos": "noun"
            },
            {
                "word": "tip",
                "pos": "verb"
            },
            {
                "word": "tip-in",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of advice about something practical",
                    "vi": "một lời khuyên nhỏ về điều gì đó thiết thực"
                },
                "examples": [
                    {
                        "en": "tip on/for doing something handy tips for buying a computer",
                        "vi": "mẹo về / để thực hiện một số mẹo hữu ích khi mua máy tính"
                    },
                    {
                        "en": "tip on/for something useful tips on how to save money",
                        "vi": "mách nước / để biết một số mẹo hữu ích về cách tiết kiệm tiền"
                    },
                    {
                        "en": "(British English, informal) Here are my top tips for interview success.",
                        "vi": "(Tiếng Anh Anh, không chính thức) Đây là những mẹo hàng đầu của tôi để thành công trong cuộc phỏng vấn."
                    },
                    {
                        "en": "The blog offered various beauty tips.",
                        "vi": "Blog cung cấp các mẹo làm đẹp khác nhau."
                    },
                    {
                        "en": "His money tips and tricks could save a typical family up to £6 000 a year.",
                        "vi": "Những lời khuyên và thủ thuật kiếm tiền của anh ấy có thể tiết kiệm cho một gia đình điển hình lên đến £ 6 000 một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret or expert piece of advice about what the result of a competition, etc. is likely to be, especially about which horse is likely to win a race",
                    "vi": "một lời khuyên bí mật hoặc lời khuyên của chuyên gia về kết quả của một cuộc thi, v.v., đặc biệt là về con ngựa nào có khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "a hot tip for the big race",
                        "vi": "một mẹo nóng cho cuộc đua lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "secret information that somebody gives, for example to the police, to warn them about an illegal activity that is going to happen or has happened",
                    "vi": "thông tin bí mật mà ai đó cung cấp, chẳng hạn như cho cảnh sát, để cảnh báo họ về một hoạt động bất hợp pháp sắp xảy ra hoặc đã xảy ra"
                },
                "examples": [
                    {
                        "en": "The man was arrested after an anonymous tip.",
                        "vi": "Người đàn ông đã bị bắt sau một mẹo ẩn danh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of extra money that you give to somebody, for example somebody who serves you in a restaurant",
                    "vi": "một số tiền nhỏ thêm mà bạn cho ai đó, ví dụ ai đó phục vụ bạn trong nhà hàng"
                },
                "examples": [
                    {
                        "en": "to leave a tip",
                        "vi": "để lại một đầu"
                    },
                    {
                        "en": "He gave the waiter a generous tip.",
                        "vi": "Anh ta đã đưa cho người phục vụ một khoản tiền boa hào phóng."
                    },
                    {
                        "en": "Someone put a dollar in the tip jar.",
                        "vi": "Ai đó đã bỏ một đô la vào lọ tiền boa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the thin, pointed end of something",
                    "vi": "đầu nhọn, mỏng của thứ gì đó"
                },
                "examples": [
                    {
                        "en": "the tips of your fingers",
                        "vi": "đầu ngón tay của bạn"
                    },
                    {
                        "en": "the tip of your nose",
                        "vi": "đầu mũi của bạn"
                    },
                    {
                        "en": "the northern tip of the island",
                        "vi": "mũi phía bắc của hòn đảo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small part that fits on or over the end of something",
                    "vi": "một phần nhỏ phù hợp với hoặc trên phần cuối của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a walking stick with a rubber tip",
                        "vi": "gậy chống có đầu cao su"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you can take rubbish and leave it",
                    "vi": "một nơi mà bạn có thể lấy rác và bỏ nó đi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an untidy place",
                    "vi": "một nơi bừa bộn"
                },
                "examples": [
                    {
                        "en": "Their flat is a tip!",
                        "vi": "Căn hộ của họ là một mẹo!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a word or name is on the tip of your tongue, you are sure that you know it but you cannot remember it",
                    "vi": "nếu một từ hoặc tên ở trên đầu lưỡi của bạn, bạn chắc chắn rằng bạn biết nó nhưng bạn không thể nhớ nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "only a small part of a much larger problem",
                    "vi": "chỉ là một phần nhỏ của một vấn đề lớn hơn nhiều"
                },
                "examples": [
                    {
                        "en": "This figure represents only the tip of the iceberg, since as many as 90% of cases go unreported.",
                        "vi": "Con số này chỉ đại diện cho phần nổi của tảng băng chìm, vì có tới 90% trường hợp không được báo cáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "c185bf595e0641b6b333929d89d99c5b",
        "word": "tip",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/tɪp/",
            "us": "/tɪp/"
        },
        "nearby": [
            {
                "word": "-tion",
                "pos": "suffix"
            },
            {
                "word": "tip",
                "pos": "noun"
            },
            {
                "word": "tip",
                "pos": "verb"
            },
            {
                "word": "tip-in",
                "pos": "noun"
            },
            {
                "word": "tip off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody an extra amount of money to thank them for something they have done for you as part of their job",
                    "vi": "cung cấp cho ai đó thêm một số tiền để cảm ơn họ vì điều gì đó họ đã làm cho bạn như một phần công việc của họ"
                },
                "examples": [
                    {
                        "en": "Americans were always welcome because they tended to tip heavily.",
                        "vi": "Người Mỹ luôn được chào đón vì họ có xu hướng boa nhiều."
                    },
                    {
                        "en": "tip somebody Did you remember to tip the waiter?",
                        "vi": "tip cho ai đó Bạn có nhớ tip cho người phục vụ không?"
                    },
                    {
                        "en": "tip somebody something She tipped the porter a dollar.",
                        "vi": "boa cho ai đó một cái gì đó Cô ấy cho người khuân vác một đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move so that one end or side is higher than the other; to move something into this position",
                    "vi": "để di chuyển sao cho một đầu hoặc một bên cao hơn đầu kia; để di chuyển một cái gì đó vào vị trí này"
                },
                "examples": [
                    {
                        "en": "(+ adv./prep.) The boat tipped to one side.",
                        "vi": "(+ adv./prep.) Con thuyền nghiêng sang một bên."
                    },
                    {
                        "en": "The seat tips forward to allow passengers into the back.",
                        "vi": "Ghế hướng về phía trước để cho phép hành khách vào phía sau."
                    },
                    {
                        "en": "tip something (+ adv./prep.) She tipped her head back and laughed loudly.",
                        "vi": "tip một cái gì đó (+ adv./prep.) Cô ấy ngửa đầu ra sau và cười lớn."
                    },
                    {
                        "en": "He tipped the wheelbarrow on its side.",
                        "vi": "Anh ta lật nghiêng chiếc xe cút kít."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something/somebody come out of a container or its/their position by holding or lifting it/them at an angle",
                    "vi": "để làm cho một cái gì đó / ai đó thoát ra khỏi thùng chứa hoặc vị trí của nó / của họ bằng cách giữ hoặc nâng nó / họ ở một góc"
                },
                "examples": [
                    {
                        "en": "She tipped the dirty water down the drain.",
                        "vi": "Cô dội nước bẩn xuống cống."
                    },
                    {
                        "en": "The bus stopped abruptly, nearly tipping me out of my seat.",
                        "vi": "Chiếc xe buýt đột ngột dừng lại, gần như lật úp tôi ra khỏi chỗ ngồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to touch something lightly so that it moves in a particular direction",
                    "vi": "chạm nhẹ vào một thứ gì đó để nó di chuyển theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "The goalkeeper just managed to tip the ball over the crossbar.",
                        "vi": "Thủ môn vừa đưa bóng đi vọt xà ngang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave rubbish somewhere outdoors in order to get rid of it",
                    "vi": "để rác ở một nơi nào đó ngoài trời để loại bỏ nó"
                },
                "examples": [
                    {
                        "en": "‘No tipping.’ (= for example, on a notice)",
                        "vi": "Không có tiền boa.' (= ví dụ: trên một thông báo)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say in advance that somebody/something will be successful",
                    "vi": "nói trước rằng ai đó / điều gì đó sẽ thành công"
                },
                "examples": [
                    {
                        "en": "be tipped for something The band is being tipped for the top.",
                        "vi": "được cho một cái gì đó. Ban nhạc đang được cho là đứng đầu."
                    },
                    {
                        "en": "The film is being hotly tipped for Oscar success.",
                        "vi": "Bộ phim đang được săn đón nhiệt tình vì thành công ở giải Oscar."
                    },
                    {
                        "en": "be tipped as something The senator has been tipped by many as a future president.",
                        "vi": "được cho là một cái gì đó Thượng nghị sĩ đã được nhiều người cho là một tổng thống tương lai."
                    },
                    {
                        "en": "She has been widely tipped as a future CEO.",
                        "vi": "Cô ấy đã được giới thiệu rộng rãi với tư cách là một giám đốc điều hành tương lai."
                    },
                    {
                        "en": "be tipped to do something The actor is tipped to win an Oscar for his performance.",
                        "vi": "được mách nước để làm điều gì đó Nam diễn viên được cho là sẽ giành được giải Oscar cho màn trình diễn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover the end or edge of something with a colour, a substance, etc.",
                    "vi": "để che phần cuối hoặc cạnh của thứ gì đó bằng màu, chất, v.v."
                },
                "examples": [
                    {
                        "en": "be tipped with something The wings are tipped with yellow.",
                        "vi": "được nghiêng với một cái gì đó Cánh được nghiêng với màu vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you admire somebody very much for something they have done",
                    "vi": "từng nói rằng bạn rất ngưỡng mộ ai đó vì những gì họ đã làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is/was raining heavily",
                    "vi": "trời đang mưa to"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to affect the result of something in one way rather than another",
                    "vi": "ảnh hưởng đến kết quả của điều gì đó theo cách này chứ không phải theo cách khác"
                },
                "examples": [
                    {
                        "en": "In an interview, smart presentation can tip the scales in your favour.",
                        "vi": "Trong một cuộc phỏng vấn, cách trình bày thông minh có thể đưa các thang điểm có lợi cho bạn."
                    },
                    {
                        "en": "New evidence tipped the balance against the prosecution.",
                        "vi": "Bằng chứng mới nghiêng về sự cân bằng chống lại việc truy tố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your plans or intentions known",
                    "vi": "để làm cho kế hoạch hoặc ý định của bạn được biết đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to weigh a particular amount",
                    "vi": "cân một lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "He tipped the scales at just over 80 kilos.",
                        "vi": "Anh ta cho rằng chiếc cân chỉ hơn 80 kg."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody secret information that they can use to gain an advantage for themselves",
                    "vi": "cung cấp cho ai đó thông tin bí mật mà họ có thể sử dụng để đạt được lợi thế cho mình"
                },
                "examples": [
                    {
                        "en": "There’s no way he would have bought those shares if someone in the company hadn’t tipped him the wink.",
                        "vi": "Sẽ không có chuyện anh ta mua số cổ phiếu đó nếu ai đó trong công ty không nháy mắt cho anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "476823c7ea5e49d3b782fc2db2128781",
        "word": "win",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/wɪn/",
            "us": "/wɪn/"
        },
        "nearby": [
            {
                "word": "wimp out",
                "pos": "phrasal verb"
            },
            {
                "word": "Lord Peter Wimsey",
                "pos": ""
            },
            {
                "word": "win",
                "pos": "verb"
            },
            {
                "word": "win",
                "pos": "noun"
            },
            {
                "word": "win around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be the most successful in a competition, race, battle, etc.",
                    "vi": "để thành công nhất trong một cuộc thi, cuộc đua, trận chiến, v.v."
                },
                "examples": [
                    {
                        "en": "Which team won?",
                        "vi": "Đội nào chiến thắng?"
                    },
                    {
                        "en": "win something to win an election",
                        "vi": "giành được một cái gì đó để giành chiến thắng trong một cuộc bầu cử"
                    },
                    {
                        "en": "to win a game/race/war/battle",
                        "vi": "để giành chiến thắng trong một trò chơi / cuộc đua / chiến tranh / trận chiến"
                    },
                    {
                        "en": "She loves to win an argument.",
                        "vi": "Cô ấy thích chiến thắng trong một cuộc tranh cãi."
                    },
                    {
                        "en": "win at something to win at cards/chess",
                        "vi": "chiến thắng ở một thứ gì đó để giành chiến thắng ở bài / cờ vua"
                    },
                    {
                        "en": "win (by something) (against somebody/something) France won by six goals to two against Denmark.",
                        "vi": "thắng (bằng cách nào đó) (chống lại ai đó / cái gì đó) Pháp đã thắng với cách biệt sáu bàn đến hai bàn trước Đan Mạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get something as the result of a competition, race, election, etc.",
                    "vi": "để có được thứ gì đó do kết quả của một cuộc cạnh tranh, chạy đua, bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "win something Britain won five gold medals.",
                        "vi": "giành được một cái gì đó Anh đã giành được năm huy chương vàng."
                    },
                    {
                        "en": "He won £3 000 in the lottery.",
                        "vi": "Anh ta đã trúng số £ 3 000 trong cuộc xổ số."
                    },
                    {
                        "en": "How many states did the Republicans win?",
                        "vi": "Đảng Cộng hòa đã giành được bao nhiêu bang?"
                    },
                    {
                        "en": "Everyone who takes part wins a small prize.",
                        "vi": "Tất cả những người tham gia sẽ giành được một giải thưởng nhỏ."
                    },
                    {
                        "en": "to win an award/a title",
                        "vi": "để giành được một giải thưởng / một danh hiệu"
                    },
                    {
                        "en": "win something from somebody The Conservatives won the seat from Labour in the last election.",
                        "vi": "giành được thứ gì đó từ ai đó Đảng Bảo thủ đã giành được ghế từ Lao động trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "win yourself/somebody something You've won yourself a trip to New York.",
                        "vi": "giành được cho mình / ai đó điều gì đó Bạn đã giành được cho mình một chuyến đi đến New York."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve or get something that you want, especially by your own efforts",
                    "vi": "để đạt được hoặc đạt được điều gì đó mà bạn muốn, đặc biệt là bằng nỗ lực của chính bạn"
                },
                "examples": [
                    {
                        "en": "They are trying to win support for their proposals.",
                        "vi": "Họ đang cố gắng giành được sự ủng hộ cho các đề xuất của họ."
                    },
                    {
                        "en": "The company has won a contract to supply books and materials to schools.",
                        "vi": "Công ty đã giành được hợp đồng cung cấp sách và tài liệu cho các trường học."
                    },
                    {
                        "en": "She won the admiration of many people in her battle against cancer.",
                        "vi": "Cô đã giành được sự ngưỡng mộ của nhiều người trong cuộc chiến chống lại căn bệnh ung thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful against somebody/something",
                    "vi": "để thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Despite strong opposition, the ruling party carried the day.",
                        "vi": "Bất chấp sự phản đối mạnh mẽ, đảng cầm quyền đã tiến hành ngày này."
                    },
                    {
                        "en": "Teamwork and persistence can still win the day.",
                        "vi": "Tinh thần đồng đội và sự bền bỉ vẫn có thể giành được chiến thắng trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win something very easily",
                    "vi": "để giành được một cái gì đó rất dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "whether you succeed or fail",
                    "vi": "cho dù bạn thành công hay thất bại"
                },
                "examples": [
                    {
                        "en": "Win or lose, we'll know we've done our best.",
                        "vi": "Dù thắng hay thua, chúng tôi sẽ biết mình đã cố gắng hết sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become famous or successful",
                    "vi": "trở nên nổi tiếng hoặc thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express sympathy for somebody who has been disappointed about something",
                    "vi": "được sử dụng để bày tỏ sự cảm thông cho ai đó đã thất vọng về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that there is no acceptable way of dealing with a particular situation",
                    "vi": "được sử dụng để nói rằng không có cách nào có thể chấp nhận được để đối phó với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "I can’t win. If I agree with her, she says I have no mind of my own; if I don’t, she says I’m being difficult.",
                        "vi": "Tôi không thể thắng. Nếu tôi đồng ý với cô ấy, cô ấy nói rằng tôi không có tâm trí của riêng mình; nếu tôi không làm vậy, cô ấy nói rằng tôi đang gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree to what somebody wants after you have failed to persuade them to do or let you do something else",
                    "vi": "đã từng đồng ý với những gì ai đó muốn sau khi bạn không thuyết phục được họ làm hoặc để bạn làm việc khác"
                },
                "examples": [
                    {
                        "en": "OK, you win. I'll admit I was wrong.",
                        "vi": "Được rồi bạn thắng. Tôi sẽ thừa nhận là tôi đã sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "308503eed08d41fe835db3eae28a3e48",
        "word": "due",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/djuː/",
            "us": "/duː/"
        },
        "nearby": [
            {
                "word": "dude ranch",
                "pos": "noun"
            },
            {
                "word": "dudgeon",
                "pos": "noun"
            },
            {
                "word": "due",
                "pos": "adjective"
            },
            {
                "word": "due",
                "pos": "noun"
            },
            {
                "word": "due",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "caused by somebody/something; because of somebody/something",
                    "vi": "do ai đó / cái gì đó gây ra; vì ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The team's success was largely due to her efforts.",
                        "vi": "Thành công của cả đội phần lớn là nhờ nỗ lực của cô ấy."
                    },
                    {
                        "en": "He argues that climate change is mainly due to the actions of industrialized countries.",
                        "vi": "Ông cho rằng biến đổi khí hậu chủ yếu là do hành động của các nước công nghiệp."
                    },
                    {
                        "en": "The increase in reported cases is partly due to growing public awareness of the disease.",
                        "vi": "Sự gia tăng các trường hợp được báo cáo một phần là do nhận thức của cộng đồng về căn bệnh này ngày càng tăng."
                    },
                    {
                        "en": "This increase is due in part to the strong economy.",
                        "vi": "Sự gia tăng này một phần là do nền kinh tế phát triển mạnh mẽ."
                    },
                    {
                        "en": "Most of the problems were due to human error.",
                        "vi": "Hầu hết các vấn đề là do lỗi của con người."
                    },
                    {
                        "en": "The delay to the flight was due to the fact that there was ice on the runway.",
                        "vi": "Chuyến bay bị hoãn là do có băng trên đường băng."
                    },
                    {
                        "en": "The project had to be abandoned due to a lack of government funding.",
                        "vi": "Dự án đã phải bỏ dở do thiếu vốn tài trợ của chính phủ."
                    },
                    {
                        "en": "Due to staff shortages, we are unable to offer a full buffet service on this train.",
                        "vi": "Do thiếu nhân viên, chúng tôi không thể cung cấp dịch vụ tự chọn đầy đủ trên chuyến tàu này."
                    }
                ]
            },
            {
                "define": {
                    "en": "arranged or expected",
                    "vi": "sắp xếp hoặc dự kiến"
                },
                "examples": [
                    {
                        "en": "When's the baby due?",
                        "vi": "Khi nào thì sinh em bé?"
                    },
                    {
                        "en": "The next train is due in five minutes.",
                        "vi": "Chuyến tàu tiếp theo sẽ đến sau năm phút nữa."
                    },
                    {
                        "en": "My essay's due next Friday (= it has to be given to the teacher by then).",
                        "vi": "Bài luận của tôi sẽ đến hạn vào thứ Sáu tới (= nó phải được đưa cho giáo viên vào lúc đó)."
                    },
                    {
                        "en": "due to do something Rose is due to start school in January.",
                        "vi": "do làm gì đó Rose sẽ bắt đầu đi học vào tháng Giêng."
                    },
                    {
                        "en": "due for something The band's first album is due for release later this month.",
                        "vi": "do gì đó Album đầu tiên của ban nhạc sẽ được phát hành vào cuối tháng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a sum of money is due, it must be paid immediately",
                    "vi": "khi đến hạn phải trả ngay một khoản tiền."
                },
                "examples": [
                    {
                        "en": "Payment is due on 1 October.",
                        "vi": "Thanh toán đến hạn vào ngày 1 tháng 10."
                    },
                    {
                        "en": "Membership fees are now due for the coming year.",
                        "vi": "Phí thành viên hiện đã đến hạn cho năm tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "owed to somebody as a debt, because it is their right or because they have done something to deserve it",
                    "vi": "nợ ai đó như một món nợ, bởi vì đó là quyền của họ hoặc bởi vì họ đã làm điều gì đó để xứng đáng với nó"
                },
                "examples": [
                    {
                        "en": "Have they been paid the money that is due to them?",
                        "vi": "Họ đã được trả số tiền đến hạn cho họ chưa?"
                    },
                    {
                        "en": "Our thanks are due to the whole team.",
                        "vi": "Cảm ơn của chúng tôi là do toàn bộ nhóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "owed something; deserving something",
                    "vi": "mắc nợ một cái gì đó; xứng đáng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "due something I'm still due 15 days' leave.",
                        "vi": "do cái gì đó tôi vẫn còn hạn nghỉ phép 15 ngày."
                    },
                    {
                        "en": "due for something She's due for promotion soon.",
                        "vi": "vì điều gì đó Cô ấy sắp được thăng chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "that is suitable or right in the circumstances",
                    "vi": "phù hợp hoặc đúng trong hoàn cảnh"
                },
                "examples": [
                    {
                        "en": "After due consideration, we have decided to appoint Mr Davis to the job.",
                        "vi": "Sau khi cân nhắc kỹ lưỡng, chúng tôi đã quyết định bổ nhiệm ông Davis."
                    },
                    {
                        "en": "Due allowance should be made for inexperience.",
                        "vi": "Dự phòng đến hạn nên được thực hiện cho những người thiếu kinh nghiệm."
                    },
                    {
                        "en": "(British English) He was charged with driving without due care and attention.",
                        "vi": "(Anh Anh) Anh ta bị buộc tội lái xe mà không được quan tâm và chú ý đúng mức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the praise they deserve, even if you do not really want to",
                    "vi": "để dành cho ai đó những lời khen ngợi mà họ xứng đáng được nhận, ngay cả khi bạn không thực sự muốn"
                },
                "examples": [
                    {
                        "en": "Give credit where credit is due—what the man does, he does well.",
                        "vi": "Cung cấp tín dụng khi tín dụng đến hạn — những gì người đàn ông làm, anh ta làm tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the right time and not before",
                    "vi": "vào đúng thời điểm và không phải trước đó"
                },
                "examples": [
                    {
                        "en": "Your request will be dealt with in due course.",
                        "vi": "Yêu cầu của bạn sẽ được giải quyết trong quá trình thích hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are going to disagree, usually quite strongly, with somebody",
                    "vi": "được sử dụng khi bạn sẽ không đồng ý, thường là khá mạnh mẽ, với ai đó"
                },
                "examples": [
                    {
                        "en": "With all due respect, the figures simply do not support you on this.",
                        "vi": "Với tất cả sự tôn trọng, các số liệu chỉ đơn giản là không hỗ trợ bạn về điều này."
                    },
                    {
                        "en": "With all due respect, I think you've misunderstood what he said.",
                        "vi": "Với tất cả sự tôn trọng, tôi nghĩ bạn đã hiểu sai những gì anh ấy nói."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c2aaca194e64e53affb2803cc293dd5",
        "word": "expense",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪkˈspens/",
            "us": "/ɪkˈspens/"
        },
        "nearby": [
            {
                "word": "expendable",
                "pos": "adjective"
            },
            {
                "word": "expenditure",
                "pos": "noun"
            },
            {
                "word": "expense",
                "pos": "noun"
            },
            {
                "word": "expense account",
                "pos": "noun"
            },
            {
                "word": "expensive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the money that you spend on something",
                    "vi": "số tiền mà bạn chi tiêu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The garden was transformed at great expense.",
                        "vi": "Khu vườn đã được chuyển đổi với chi phí lớn."
                    },
                    {
                        "en": "No expense was spared (= they spent as much money as was needed) to make the party a success.",
                        "vi": "Không có bất kỳ khoản chi phí nào được tiết kiệm (= họ đã chi nhiều tiền nếu cần) để làm cho bữa tiệc thành công."
                    },
                    {
                        "en": "He's arranged everything, no expense spared.",
                        "vi": "Anh ấy đã sắp xếp mọi thứ, không tiếc chi phí."
                    },
                    {
                        "en": "She always travels first-class regardless of expense.",
                        "vi": "Cô ấy luôn đi du lịch hạng nhất bất kể chi phí."
                    },
                    {
                        "en": "The results are well worth the expense.",
                        "vi": "Kết quả rất xứng đáng với chi phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that makes you spend money",
                    "vi": "thứ gì đó khiến bạn tiêu tiền"
                },
                "examples": [
                    {
                        "en": "Running a car is a big expense.",
                        "vi": "Chạy một chiếc xe hơi là một khoản chi phí lớn."
                    },
                    {
                        "en": "The company views its workers as an expense instead of an asset.",
                        "vi": "Công ty xem công nhân của mình như một khoản chi phí thay vì một tài sản."
                    }
                ]
            },
            {
                "define": {
                    "en": "money spent in doing a particular job, or for a particular purpose",
                    "vi": "tiền chi tiêu để làm một công việc cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "living/medical/travel expenses",
                        "vi": "chi phí sinh hoạt / y tế / đi lại"
                    },
                    {
                        "en": "legal/household expenses",
                        "vi": "chi phí hợp pháp / hộ gia đình"
                    },
                    {
                        "en": "The company has cut operating expenses to their lowest levels in three years",
                        "vi": "Công ty đã cắt giảm chi phí hoạt động xuống mức thấp nhất trong ba năm"
                    },
                    {
                        "en": "Can I give you something towards expenses?",
                        "vi": "Tôi có thể cho bạn một cái gì đó về chi phí?"
                    },
                    {
                        "en": "financial help to meet the expenses of an emergency",
                        "vi": "trợ giúp tài chính để đáp ứng các chi phí trong trường hợp khẩn cấp"
                    },
                    {
                        "en": "The payments he gets barely cover his expenses.",
                        "vi": "Các khoản thanh toán anh ta nhận được hầu như không trang trải chi phí của mình."
                    },
                    {
                        "en": "Property investors are entitled to offset the expenses incurred buying the property.",
                        "vi": "Các nhà đầu tư bất động sản được quyền bù đắp các chi phí phát sinh khi mua bất động sản đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that you spend while you are working and that your employer will pay back to you later",
                    "vi": "số tiền bạn tiêu khi đang làm việc và người chủ của bạn sẽ trả lại cho bạn sau này"
                },
                "examples": [
                    {
                        "en": "You can claim back your travelling/travel expenses.",
                        "vi": "Bạn có thể đòi lại chi phí đi lại / đi lại của mình."
                    },
                    {
                        "en": "We paid their expenses, but nothing more.",
                        "vi": "Chúng tôi đã trả chi phí của họ, nhưng không có gì hơn."
                    },
                    {
                        "en": "an all-expenses-paid trip",
                        "vi": "một chuyến đi được thanh toán toàn bộ chi phí"
                    },
                    {
                        "en": "on expenses (British English) to take a client out for a meal on expenses",
                        "vi": "về chi phí (tiếng Anh Anh) để đưa một khách hàng đi ăn uống với chi phí"
                    }
                ]
            },
            {
                "define": {
                    "en": "paid for by somebody",
                    "vi": "được ai đó trả tiền"
                },
                "examples": [
                    {
                        "en": "We were taken out for a meal at the company's expense.",
                        "vi": "Chúng tôi được đưa ra ngoài ăn uống với chi phí của công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you make a joke at somebody’s expense, you laugh at them and make them feel silly",
                    "vi": "nếu bạn làm một trò đùa với chi phí của ai đó, bạn cười họ và khiến họ cảm thấy ngớ ngẩn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with loss or damage to somebody/something",
                    "vi": "với mất mát hoặc thiệt hại cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He built up the business at the expense of his health.",
                        "vi": "Ông đã gây dựng công việc kinh doanh bằng cả sức khỏe của mình."
                    },
                    {
                        "en": "an education system that benefits bright children at the expense of those who are slower to learn",
                        "vi": "một hệ thống giáo dục mang lại lợi ích cho những đứa trẻ trong sáng nhưng những đứa trẻ chậm học hơn sẽ phải trả giá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend money on something",
                    "vi": "tiêu tiền vào thứ gì đó"
                },
                "examples": [
                    {
                        "en": "They went to all the expense of redecorating the house and then they moved.",
                        "vi": "Họ đã dốc toàn bộ chi phí trang trí lại ngôi nhà và sau đó họ chuyển đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody spend money on something",
                    "vi": "để khiến ai đó tiêu tiền vào thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Their visit put us to a lot of expense.",
                        "vi": "Chuyến thăm của họ khiến chúng tôi phải gánh chịu rất nhiều chi phí."
                    }
                ]
            }
        ]
    },
    {
        "id": "90a7b2605ccf444aa044f1588d35bf3a",
        "word": "fare",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/feə(r)/",
            "us": "/fer/"
        },
        "nearby": [
            {
                "word": "farce",
                "pos": "noun"
            },
            {
                "word": "farcical",
                "pos": "adjective"
            },
            {
                "word": "fare",
                "pos": "noun"
            },
            {
                "word": "fare",
                "pos": "verb"
            },
            {
                "word": "the Far East",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the money that you pay to travel by bus, plane, taxi, etc.",
                    "vi": "số tiền bạn phải trả để đi lại bằng xe buýt, máy bay, taxi, v.v."
                },
                "examples": [
                    {
                        "en": "bus/taxi fares",
                        "vi": "giá vé xe buýt / taxi"
                    },
                    {
                        "en": "train/rail fares",
                        "vi": "giá vé tàu / đường sắt"
                    },
                    {
                        "en": "Children travel (at) half fare.",
                        "vi": "Trẻ em đi du lịch (bằng) nửa giá vé."
                    },
                    {
                        "en": "When do they start paying full fare?",
                        "vi": "Khi nào họ bắt đầu trả tiền vé đầy đủ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a passenger in a taxi",
                    "vi": "một hành khách trên taxi"
                },
                "examples": [
                    {
                        "en": "The taxi driver picked up a fare at the station.",
                        "vi": "Người lái xe taxi đã tính tiền tại nhà ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "a range of food of a particular type",
                    "vi": "nhiều loại thực phẩm của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The restaurant provides good traditional fare.",
                        "vi": "Nhà hàng cung cấp các món ăn truyền thống tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is offered to the public, especially as a form of entertainment",
                    "vi": "thứ gì đó được cung cấp cho công chúng, đặc biệt là như một hình thức giải trí"
                },
                "examples": [
                    {
                        "en": "This movie is perfect family fare.",
                        "vi": "Đây là bộ phim hoàn hảo dành cho gia đình."
                    }
                ]
            }
        ]
    },
    {
        "id": "045cdaa83e6943a3a12a5701ff584626",
        "word": "fee",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/fiː/",
            "us": "/fiː/"
        },
        "nearby": [
            {
                "word": "fedora",
                "pos": "noun"
            },
            {
                "word": "fed up",
                "pos": "adjective"
            },
            {
                "word": "fee",
                "pos": "noun"
            },
            {
                "word": "feeble",
                "pos": "adjective"
            },
            {
                "word": "feeble-minded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that you pay for professional advice or services",
                    "vi": "một số tiền mà bạn phải trả cho lời khuyên hoặc dịch vụ chuyên nghiệp"
                },
                "examples": [
                    {
                        "en": "Employees are reimbursed for any legal fees incurred when they relocate.",
                        "vi": "Nhân viên được hoàn trả mọi chi phí pháp lý phát sinh khi chuyển nhà."
                    },
                    {
                        "en": "fee-paying schools (= that you have to pay to go to)",
                        "vi": "trường học trả phí (= bạn phải trả tiền để đi học)"
                    },
                    {
                        "en": "The school fees are expected to rise again next year.",
                        "vi": "Học phí dự kiến sẽ tăng trở lại trong năm tới."
                    },
                    {
                        "en": "Students take out loans to cover tuition fees.",
                        "vi": "Sinh viên vay để trang trải học phí."
                    },
                    {
                        "en": "fee for something Customers pay an annual fee for the service.",
                        "vi": "phí cho một thứ gì đó Khách hàng trả phí hàng năm cho dịch vụ."
                    },
                    {
                        "en": "fee for doing something Does the bank charge a fee for setting up the account?",
                        "vi": "phí để làm việc gì đó Ngân hàng có tính phí thiết lập tài khoản không?"
                    },
                    {
                        "en": "for a fee Users can block ads for a small monthly fee.",
                        "vi": "với một khoản phí Người dùng có thể chặn quảng cáo với một khoản phí nhỏ hàng tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money that you pay to join an organization, or to do something",
                    "vi": "một số tiền mà bạn trả để tham gia một tổ chức hoặc để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "a membership/subscription fee",
                        "vi": "phí thành viên / đăng ký"
                    },
                    {
                        "en": "There is no entrance fee to the gallery.",
                        "vi": "Không có phí vào cửa phòng trưng bày."
                    },
                    {
                        "en": "the TV licence fee",
                        "vi": "phí bản quyền truyền hình"
                    },
                    {
                        "en": "You have to pay a fee to enter the race.",
                        "vi": "Bạn phải trả một khoản phí để tham gia cuộc đua."
                    },
                    {
                        "en": "fee for something The registration fee for the event is £35.",
                        "vi": "lệ phí cho một cái gì đó Phí đăng ký cho sự kiện là £ 35."
                    }
                ]
            }
        ]
    },
    {
        "id": "3b3edb6f23f54a29bfd23ef805bff068",
        "word": "finance",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfaɪnæns/",
            "us": "/ˈfaɪnæns/"
        },
        "nearby": [
            {
                "word": "finalize",
                "pos": "verb"
            },
            {
                "word": "finally",
                "pos": "adverb"
            },
            {
                "word": "finance",
                "pos": "noun"
            },
            {
                "word": "finance",
                "pos": "verb"
            },
            {
                "word": "finance company",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money used to run a business, an activity or a project",
                    "vi": "tiền được sử dụng để điều hành một doanh nghiệp, một hoạt động hoặc một dự án"
                },
                "examples": [
                    {
                        "en": "The project will only go ahead if they can raise the necessary finance.",
                        "vi": "Dự án sẽ chỉ được tiến hành nếu họ có thể huy động được nguồn tài chính cần thiết."
                    },
                    {
                        "en": "to arrange/secure finance",
                        "vi": "sắp xếp / đảm bảo tài chính"
                    },
                    {
                        "en": "finance for something Finance for education comes from taxpayers.",
                        "vi": "tài chính cho một cái gì đó Tài chính cho giáo dục đến từ người nộp thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of managing money, especially by a government or commercial organization",
                    "vi": "hoạt động quản lý tiền, đặc biệt là của chính phủ hoặc tổ chức thương mại"
                },
                "examples": [
                    {
                        "en": "the Minister of Finance",
                        "vi": "Bộ trưởng Bộ tài chính"
                    },
                    {
                        "en": "the finance director/department/committee",
                        "vi": "giám đốc tài chính / bộ phận / ủy ban"
                    },
                    {
                        "en": "She's got a diploma in banking and finance.",
                        "vi": "Cô ấy có bằng tốt nghiệp về tài chính ngân hàng."
                    },
                    {
                        "en": "the world of high finance (= finance involving large companies or countries)",
                        "vi": "thế giới tài chính cao (= tài chính liên quan đến các công ty hoặc quốc gia lớn)"
                    },
                    {
                        "en": "an expert in public/personal/corporate finance",
                        "vi": "một chuyên gia trong lĩnh vực tài chính công / cá nhân / doanh nghiệp"
                    },
                    {
                        "en": "a finance company",
                        "vi": "một công ty tài chính"
                    }
                ]
            },
            {
                "define": {
                    "en": "the money available to a person, an organization or a country; the way this money is managed",
                    "vi": "số tiền có sẵn cho một người, một tổ chức hoặc một quốc gia; cách quản lý số tiền này"
                },
                "examples": [
                    {
                        "en": "government/public/personal finances",
                        "vi": "tài chính của chính phủ / công cộng / cá nhân"
                    },
                    {
                        "en": "They were unable to manage their finances.",
                        "vi": "Họ không thể quản lý tài chính của mình."
                    },
                    {
                        "en": "It's about time you sorted out your finances.",
                        "vi": "Đã đến lúc bạn sắp xếp tài chính của mình."
                    },
                    {
                        "en": "Moving house put a severe strain on our finances.",
                        "vi": "Chuyển nhà khiến tài chính của chúng tôi căng thẳng."
                    },
                    {
                        "en": "The firm’s finances are basically sound.",
                        "vi": "Tài chính của công ty về cơ bản là ổn định."
                    }
                ]
            }
        ]
    },
    {
        "id": "780545f8cf284bc5a90725da0ea8fb01",
        "word": "finance",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfaɪnæns/",
            "us": "/ˈfaɪnæns/"
        },
        "nearby": [
            {
                "word": "finally",
                "pos": "adverb"
            },
            {
                "word": "finance",
                "pos": "noun"
            },
            {
                "word": "finance",
                "pos": "verb"
            },
            {
                "word": "finance company",
                "pos": "noun"
            },
            {
                "word": "financial",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to provide money for a project",
                    "vi": "cung cấp tiền cho một dự án"
                },
                "examples": [
                    {
                        "en": "finance something He took a job to finance his stay in Germany.",
                        "vi": "tài trợ cho một cái gì đó Anh ấy đã nhận một công việc để trang trải cho thời gian ở Đức."
                    },
                    {
                        "en": "The building project will be financed by the government.",
                        "vi": "Dự án xây dựng sẽ được tài trợ bởi chính phủ."
                    },
                    {
                        "en": "be financed through something The research is financed through government grants.",
                        "vi": "được tài trợ thông qua một cái gì đó Nghiên cứu được tài trợ thông qua các khoản tài trợ của chính phủ."
                    },
                    {
                        "en": "be financed with something Today just 10% of car purchases are financed with loans.",
                        "vi": "được tài trợ bằng một thứ gì đó Ngày nay chỉ có 10% số tiền mua ô tô được tài trợ bằng các khoản vay."
                    }
                ]
            }
        ]
    },
    {
        "id": "b6a3fcaf2d3146519865036eea9720d0",
        "word": "financing",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfaɪnænsɪŋ/",
            "us": "/ˈfaɪnænsɪŋ/"
        },
        "nearby": [
            {
                "word": "financial year",
                "pos": "noun"
            },
            {
                "word": "financier",
                "pos": "noun"
            },
            {
                "word": "financing",
                "pos": "noun"
            },
            {
                "word": "finch",
                "pos": "noun"
            },
            {
                "word": "find",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money used to run a business, an activity or a project",
                    "vi": "tiền được sử dụng để điều hành một doanh nghiệp, một hoạt động hoặc một dự án"
                },
                "examples": [
                    {
                        "en": "The project will only go ahead if they can raise the necessary financing.",
                        "vi": "Dự án sẽ chỉ được tiến hành nếu họ có thể huy động được nguồn tài chính cần thiết."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8d94c11a7de443da323e4510eb6af90",
        "word": "pay back",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "pay as you earn",
                "pos": "noun"
            },
            {
                "word": "pay-as-you-go",
                "pos": "adjective"
            },
            {
                "word": "pay back",
                "pos": "phrasal verb"
            },
            {
                "word": "payback",
                "pos": "noun"
            },
            {
                "word": "pay bed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to return money that you borrowed from somebody",
                    "vi": "trả lại tiền mà bạn đã vay từ ai đó"
                },
                "examples": [
                    {
                        "en": "I'll pay you back next week.",
                        "vi": "Tôi sẽ trả lại cho bạn vào tuần tới."
                    },
                    {
                        "en": "You can pay back the loan over a period of three years.",
                        "vi": "Bạn có thể trả lại khoản vay trong thời hạn ba năm."
                    },
                    {
                        "en": "Did he ever pay you back that $100 he owes you?",
                        "vi": "Anh ta có bao giờ trả lại cho bạn 100 đô la mà anh ta nợ bạn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to punish somebody for making you or somebody else suffer",
                    "vi": "trừng phạt ai đó vì đã làm cho bạn hoặc ai đó khác đau khổ"
                },
                "examples": [
                    {
                        "en": "I'll pay him back for making me look like a fool in front of everyone.",
                        "vi": "Tôi sẽ trả lại anh ta vì đã khiến tôi trông như một kẻ ngốc trước mặt mọi người."
                    }
                ]
            }
        ]
    },
    {
        "id": "ead89f43b9664bc485eebda54e694831",
        "word": "penalty",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpenəlti/",
            "us": "/ˈpenəlti/"
        },
        "nearby": [
            {
                "word": "penal code",
                "pos": "noun"
            },
            {
                "word": "penalize",
                "pos": "verb"
            },
            {
                "word": "penalty",
                "pos": "noun"
            },
            {
                "word": "penalty area",
                "pos": "noun"
            },
            {
                "word": "penalty box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a punishment for breaking a law, rule or contract",
                    "vi": "hình phạt nếu vi phạm luật, quy tắc hoặc hợp đồng"
                },
                "examples": [
                    {
                        "en": "to impose a penalty",
                        "vi": "áp dụng một hình phạt"
                    },
                    {
                        "en": "Assault carries a maximum penalty of seven years' imprisonment.",
                        "vi": "Hành hung bị phạt tù cao nhất là bảy năm."
                    },
                    {
                        "en": "penalty for (doing) something The penalty for travelling without a ticket is £200.",
                        "vi": "hình phạt cho (làm) điều gì đó. Hình phạt cho việc đi du lịch không có vé là £ 200."
                    },
                    {
                        "en": "Contractors who fall behind schedule incur heavy financial penalties.",
                        "vi": "Các nhà thầu chậm tiến độ sẽ bị phạt nặng về tài chính."
                    },
                    {
                        "en": "Harsher penalties are being imposed for crimes involving firearms.",
                        "vi": "Các hình phạt khắc nghiệt hơn đang được áp dụng cho các tội danh liên quan đến súng."
                    },
                    {
                        "en": "a penalty clause in a contract",
                        "vi": "một điều khoản phạt trong hợp đồng"
                    },
                    {
                        "en": "without penalty You can withdraw money from the account at any time without penalty.",
                        "vi": "không bị phạt Bạn có thể rút tiền từ tài khoản bất cứ lúc nào mà không bị phạt."
                    },
                    {
                        "en": "on penalty of something The Romans prohibited the teaching of the Torah on penalty of death.",
                        "vi": "về hình phạt của một cái gì đó Người La Mã cấm giảng dạy Kinh Torah về hình phạt tử hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disadvantage suffered as a result of something",
                    "vi": "một thiệt thòi phải chịu do hậu quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "One of the penalties of fame is loss of privacy.",
                        "vi": "Một trong những hình phạt của sự nổi tiếng là mất quyền riêng tư."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disadvantage given to a player or a team when they break a rule",
                    "vi": "một bất lợi cho người chơi hoặc một đội khi họ vi phạm quy tắc"
                },
                "examples": [
                    {
                        "en": "He incurred a ten-second penalty in the first round.",
                        "vi": "Anh ta đã phải chịu một quả phạt đền mười giây trong hiệp đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chance to score a goal or point without any defending players, except the goalkeeper, trying to stop it; the goal or point that is given if it is successful. This chance is given because the other team has broken the rules.",
                    "vi": "cơ hội ghi bàn hoặc dứt điểm mà không có cầu thủ phòng ngự nào, ngoại trừ thủ môn, cố gắng cản phá; mục tiêu hoặc điểm được đưa ra nếu nó thành công. Cơ hội này được trao vì đội khác đã phạm luật."
                },
                "examples": [
                    {
                        "en": "Two minutes later Ford equalized with a penalty.",
                        "vi": "Hai phút sau, Ford gỡ hòa bằng một quả phạt đền."
                    },
                    {
                        "en": "We were awarded a penalty after a late tackle.",
                        "vi": "Chúng tôi đã được hưởng một quả phạt đền sau một pha bóng muộn."
                    },
                    {
                        "en": "I volunteered to take the penalty (= be the person who tries to score the goal/point)",
                        "vi": "Tôi tình nguyện thực hiện hình phạt (= là người cố gắng ghi bàn thắng / điểm)"
                    },
                    {
                        "en": "He missed a penalty in the last minute of the game.",
                        "vi": "Anh ấy đã bỏ lỡ một quả phạt đền ở phút cuối cùng của trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suffer because of bad luck, a mistake or something you have done",
                    "vi": "đau khổ vì không may mắn, một sai lầm hoặc điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "He looked terrible this morning. I think he's paying the penalty for all those late nights.",
                        "vi": "Anh ấy trông thật kinh khủng vào sáng nay. Tôi nghĩ anh ta phải trả giá phạt cho tất cả những đêm muộn đó."
                    },
                    {
                        "en": "They're now paying the price for past mistakes.",
                        "vi": "Giờ đây, họ đang phải trả giá cho những sai lầm trong quá khứ."
                    },
                    {
                        "en": "She thinks that any inconvenience is a price worth paying for living in such a beautiful place.",
                        "vi": "Cô cho rằng bất kỳ sự bất tiện nào cũng là cái giá phải trả khi sống ở một nơi đẹp đẽ như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "1aeedf06a94549648553b9a4f1e0619e",
        "word": "refund",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈriːfʌnd/",
            "us": "/ˈriːfʌnd/"
        },
        "nearby": [
            {
                "word": "the Refugee Council",
                "pos": ""
            },
            {
                "word": "refulgent",
                "pos": "adjective"
            },
            {
                "word": "refund",
                "pos": "noun"
            },
            {
                "word": "refund",
                "pos": "verb"
            },
            {
                "word": "refundable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sum of money that is paid back to you, especially because you paid too much or because you returned goods to a shop",
                    "vi": "một khoản tiền được trả lại cho bạn, đặc biệt là do bạn đã trả quá nhiều hoặc vì bạn đã trả lại hàng cho cửa hàng"
                },
                "examples": [
                    {
                        "en": "a tax refund",
                        "vi": "hoàn thuế"
                    },
                    {
                        "en": "to claim/demand/receive a refund",
                        "vi": "để yêu cầu / yêu cầu / nhận tiền hoàn lại"
                    },
                    {
                        "en": "If there is a delay of 12 hours or more, you will receive a full refund of the price of your trip.",
                        "vi": "Nếu chậm trễ từ 12 giờ trở lên, bạn sẽ được hoàn lại toàn bộ giá vé cho chuyến đi của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d77b3e9942b494995aec7306e98d7e7",
        "word": "refund",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈfʌnd/",
            "us": "/rɪˈfʌnd/"
        },
        "nearby": [
            {
                "word": "refulgent",
                "pos": "adjective"
            },
            {
                "word": "refund",
                "pos": "noun"
            },
            {
                "word": "refund",
                "pos": "verb"
            },
            {
                "word": "refundable",
                "pos": "adjective"
            },
            {
                "word": "refurbish",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody their money back, especially because they have paid too much or because they are not satisfied with something they bought",
                    "vi": "để trả lại tiền cho ai đó, đặc biệt là vì họ đã trả quá nhiều hoặc vì họ không hài lòng với thứ họ đã mua"
                },
                "examples": [
                    {
                        "en": "refund something Tickets cannot be exchanged or money refunded.",
                        "vi": "hoàn trả một cái gì đó Vé không thể đổi hoặc tiền được hoàn lại."
                    },
                    {
                        "en": "Your money will be refunded in full.",
                        "vi": "Tiền của bạn sẽ được hoàn trả đầy đủ."
                    },
                    {
                        "en": "refund something to somebody We will refund your money to you in full if you are not entirely satisfied.",
                        "vi": "hoàn trả một cái gì đó cho ai đó Chúng tôi sẽ hoàn trả đầy đủ tiền của bạn cho bạn nếu bạn không hoàn toàn hài lòng."
                    },
                    {
                        "en": "If you are not satisfied with the goods, the price will be refunded to you.",
                        "vi": "Nếu bạn không hài lòng về hàng hóa, giá cả sẽ được hoàn lại cho bạn."
                    },
                    {
                        "en": "refund somebody something We will refund you your money in full.",
                        "vi": "hoàn lại cho ai đó một cái gì đó Chúng tôi sẽ hoàn trả đầy đủ tiền của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd8f8376b3dd42368e193032a83f7c6c",
        "word": "a/per head",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/hed/",
            "us": "/hed/"
        },
        "nearby": [
            {
                "word": "he",
                "pos": "noun"
            },
            {
                "word": "HE",
                "pos": "abbreviation"
            },
            {
                "word": "head",
                "pos": "noun"
            },
            {
                "word": "-head",
                "pos": "suffix"
            },
            {
                "word": "head",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the body on top of the neck containing the eyes, nose, mouth and brain",
                    "vi": "phần cơ thể trên cổ có chứa mắt, mũi, miệng và não"
                },
                "examples": [
                    {
                        "en": "She nodded her head in agreement.",
                        "vi": "Cô gật đầu đồng ý."
                    },
                    {
                        "en": "He shook his head in disbelief.",
                        "vi": "Anh lắc đầu không tin."
                    },
                    {
                        "en": "The boys hung their heads in shame.",
                        "vi": "Các chàng trai gục đầu xấu hổ."
                    },
                    {
                        "en": "She turned her head to look at him.",
                        "vi": "Cô quay đầu nhìn anh."
                    },
                    {
                        "en": "They bowed their heads in prayer.",
                        "vi": "Họ cúi đầu cầu nguyện."
                    },
                    {
                        "en": "She tilted her head back and closed her eyes.",
                        "vi": "Cô ấy ngửa đầu ra sau và nhắm mắt lại."
                    },
                    {
                        "en": "to raise/lift/lower your head",
                        "vi": "nâng / nâng / hạ đầu của bạn"
                    },
                    {
                        "en": "He was shot in the head and died ten minutes later.",
                        "vi": "Anh ta bị bắn vào đầu và chết sau đó mười phút."
                    },
                    {
                        "en": "The driver suffered head injuries.",
                        "vi": "Tài xế bị thương ở đầu."
                    },
                    {
                        "en": "He still has a good head of hair (= a lot of hair).",
                        "vi": "Anh ấy vẫn còn đầu tóc tốt (= rất nhiều tóc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mind or brain",
                    "vi": "tâm trí hoặc bộ não"
                },
                "examples": [
                    {
                        "en": "I sometimes wonder what goes on in that head of yours.",
                        "vi": "Đôi khi tôi tự hỏi điều gì đang xảy ra trong đầu của bạn."
                    },
                    {
                        "en": "I wish you'd use your head (= think carefully before doing or saying something).",
                        "vi": "Tôi ước bạn sử dụng cái đầu của mình (= suy nghĩ cẩn thận trước khi làm hoặc nói điều gì đó)."
                    },
                    {
                        "en": "The thought never entered my head.",
                        "vi": "Ý nghĩ chưa bao giờ lọt vào đầu tôi."
                    },
                    {
                        "en": "His head was spinning (= he felt dizzy or confused) after only one drink.",
                        "vi": "Đầu anh ấy quay cuồng (= anh ấy cảm thấy chóng mặt hoặc bối rối) chỉ sau một lần uống rượu."
                    },
                    {
                        "en": "in somebody's head I can't work it out in my head—I need a calculator.",
                        "vi": "trong đầu của ai đó, tôi không thể tìm ra nó trong đầu - tôi cần một chiếc máy tính."
                    },
                    {
                        "en": "She started hearing voices in her head.",
                        "vi": "Cô ấy bắt đầu nghe thấy những giọng nói trong đầu mình."
                    },
                    {
                        "en": "into somebody's head Who's been putting such weird ideas into your head (= making you believe that)?",
                        "vi": "vào đầu ai đó Ai đã đưa những ý tưởng kỳ quặc như vậy vào đầu bạn (= khiến bạn tin điều đó)?"
                    },
                    {
                        "en": "out of somebody's head I can't get that tune out of my head.",
                        "vi": "ra khỏi đầu ai đó Tôi không thể lấy giai điệu đó ra khỏi đầu mình."
                    },
                    {
                        "en": "Try to put the exams out of your head (= stop thinking about them).",
                        "vi": "Cố gắng gạt các bài kiểm tra ra khỏi đầu bạn (= ngừng nghĩ về chúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the size of a person’s or animal’s head, used as a measurement of distance or height",
                    "vi": "kích thước của đầu người hoặc động vật, được sử dụng để đo khoảng cách hoặc chiều cao"
                },
                "examples": [
                    {
                        "en": "She's a good head taller than her sister.",
                        "vi": "Cô ấy cao hơn em gái mình một cái đầu."
                    },
                    {
                        "en": "The favourite won by a short head (= a distance slightly less than the length of a horse's head).",
                        "vi": "Con thích thắng bằng cái đầu ngắn (= một khoảng cách nhỏ hơn một chút so với chiều dài của đầu con ngựa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous pain in your head",
                    "vi": "một cơn đau liên tục trong đầu của bạn"
                },
                "examples": [
                    {
                        "en": "I woke up with a really bad head this morning.",
                        "vi": "Tôi thức dậy với một cái đầu thật tồi tệ vào sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a group of people or an organization",
                    "vi": "người phụ trách một nhóm người hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "head of something the heads of government/state",
                        "vi": "người đứng đầu một cái gì đó những người đứng đầu chính phủ / nhà nước"
                    },
                    {
                        "en": "She resigned as head of department.",
                        "vi": "Cô từ chức trưởng phòng."
                    },
                    {
                        "en": "I've asked the department head for an appointment.",
                        "vi": "Tôi đã yêu cầu trưởng bộ phận cho một cuộc hẹn."
                    },
                    {
                        "en": "a former head of the Hong Kong Stock Exchange",
                        "vi": "một cựu lãnh đạo của Sở giao dịch chứng khoán Hồng Kông"
                    },
                    {
                        "en": "He is deputy head of the National Railway Museum.",
                        "vi": "Ông là Phó giám đốc Bảo tàng Đường sắt Quốc gia."
                    },
                    {
                        "en": "the crowned heads (= the kings and queens) of Europe",
                        "vi": "những người đứng đầu được trao vương miện (= các vị vua và nữ hoàng) của Châu Âu"
                    },
                    {
                        "en": "I was head coach of a Little League basketball team in Pittsburgh.",
                        "vi": "Tôi là huấn luyện viên trưởng của một đội bóng rổ Little League ở Pittsburgh."
                    },
                    {
                        "en": "the head gardener/chef/waiter",
                        "vi": "người làm vườn / đầu bếp / bồi bàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a school or college",
                    "vi": "người phụ trách một trường học hoặc cao đẳng"
                },
                "examples": [
                    {
                        "en": "I've been called in to see the Head.",
                        "vi": "Tôi đã được gọi đến để gặp Thủ trưởng."
                    },
                    {
                        "en": "the deputy head",
                        "vi": "phó trưởng phòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a coin that has a picture of the head of a person on it, used as one choice when a coin is tossed to decide something",
                    "vi": "mặt của đồng xu có hình ảnh đầu của một người trên đó, được sử dụng như một sự lựa chọn khi tung đồng xu để quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "I called heads and it came down tails.",
                        "vi": "Tôi gọi đầu và nó rơi xuống đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the end of a long narrow object that is larger or wider than the rest of it",
                    "vi": "phần cuối của một vật dài hẹp lớn hơn hoặc rộng hơn phần còn lại của nó"
                },
                "examples": [
                    {
                        "en": "the head of a nail",
                        "vi": "đầu đinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the top or highest part of something",
                    "vi": "phần trên cùng hoặc phần cao nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "at the head of the page",
                        "vi": "ở đầu trang"
                    },
                    {
                        "en": "They finished the season at the head of their league.",
                        "vi": "Họ đã kết thúc mùa giải ở vị trí dẫn đầu giải đấu của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where a river begins",
                    "vi": "nơi bắt đầu của một con sông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most important seat at a table",
                    "vi": "chỗ ngồi quan trọng nhất trên bàn"
                },
                "examples": [
                    {
                        "en": "The President sat at the head of the table.",
                        "vi": "Chủ tịch nước ngồi đầu bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position at the front of a line of people",
                    "vi": "vị trí ở phía trước của một dòng người"
                },
                "examples": [
                    {
                        "en": "The prince rode at the head of his regiment.",
                        "vi": "Hoàng tử cưỡi trên đầu trung đoàn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mass of leaves or flowers at the end of a stem",
                    "vi": "khối lượng của lá hoặc hoa ở cuối thân cây"
                },
                "examples": [
                    {
                        "en": "Remove the dead heads to encourage new growth.",
                        "vi": "Loại bỏ những phần đầu chết để khuyến khích sự phát triển mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mass of small bubbles on the top of a glass of beer",
                    "vi": "một khối lượng bọt nhỏ trên đầu của một cốc bia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a spot on your skin that contains a thick yellow liquid (= pus)",
                    "vi": "phần trên da của bạn có chứa chất lỏng màu vàng đặc (= mủ)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the component of a sound or video recording system that converts data on the disk or tape into digital electronic data (and the other way round)",
                    "vi": "thành phần của hệ thống ghi âm thanh hoặc video chuyển đổi dữ liệu trên đĩa hoặc băng thành dữ liệu điện tử kỹ thuật số (và ngược lại)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say how many animals of a particular type are on a farm, in a herd, etc.",
                    "vi": "được sử dụng để nói có bao nhiêu động vật của một loại cụ thể ở trong một trang trại, trong một đàn, v.v."
                },
                "examples": [
                    {
                        "en": "200 head of sheep",
                        "vi": "200 đầu cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the pressure produced by steam in a small space",
                    "vi": "áp suất do hơi nước tạo ra trong một không gian nhỏ"
                },
                "examples": [
                    {
                        "en": "The old engine still manages to build up a good head of steam.",
                        "vi": "Động cơ cũ vẫn tạo ra một đầu hơi tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "oral sex (= using the mouth to give somebody sexual pleasure)",
                    "vi": "quan hệ tình dục bằng miệng (= dùng miệng để mang lại khoái cảm tình dục cho ai đó)"
                },
                "examples": [
                    {
                        "en": "to give head",
                        "vi": "đưa ra cái đầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the central part of a phrase, which has the same grammatical function as the whole phrase. In the phrase ‘the tall man in a suit’, man is the head.",
                    "vi": "phần trung tâm của cụm từ, có chức năng ngữ pháp giống như toàn bộ cụm từ. Trong cụm từ 'the high man in a suit', người đàn ông là người đứng đầu."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to force people to stop arguing and behave in a sensible way",
                    "vi": "buộc mọi người ngừng tranh cãi và cư xử một cách hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep trying to do something that will never be successful",
                    "vi": "tiếp tục cố gắng làm điều gì đó sẽ không bao giờ thành công"
                },
                "examples": [
                    {
                        "en": "Trying to reason with them was like banging my head against a brick wall.",
                        "vi": "Cố gắng lý luận với họ giống như đập đầu tôi vào tường gạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be much better than other people or things",
                    "vi": "tốt hơn nhiều so với những người khác hoặc những thứ khác"
                },
                "examples": [
                    {
                        "en": "His performance stood head and shoulders above the rest.",
                        "vi": "Màn trình diễn của anh ấy đứng đầu và vai trên phần còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout at somebody in an angry way, especially without reason",
                    "vi": "hét vào mặt ai đó một cách tức giận, đặc biệt là không có lý do"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you bring a situation to a head or if a situation comes to a head, you are forced to deal with it quickly because it suddenly becomes very bad",
                    "vi": "nếu bạn đưa một tình huống lên đầu hoặc nếu một tình huống xảy ra đối đầu, bạn buộc phải giải quyết nó nhanh chóng vì nó đột nhiên trở nên rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "The chairman's resignation finally brought matters to a head.",
                        "vi": "Việc từ chức của chủ tịch cuối cùng đã khiến vấn đề trở nên nhức nhối."
                    },
                    {
                        "en": "The dispute finally came to a head in March that year.",
                        "vi": "Cuối cùng, tranh chấp đã đi đến hồi kết vào tháng 3 năm đó."
                    },
                    {
                        "en": "Things came to a head when several of the nurses made a formal complaint.",
                        "vi": "Mọi việc trở nên căng thẳng khi một số y tá đưa ra đơn khiếu nại chính thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to admit that a problem exists or refuse to deal with it",
                    "vi": "từ chối thừa nhận rằng một vấn đề tồn tại hoặc từ chối giải quyết nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to understand something",
                    "vi": "không thể hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't make head nor tail of what he was saying.",
                        "vi": "Tôi không thể hiểu rõ anh ta đang nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel confused, upset and/or annoyed",
                    "vi": "làm cho ai đó cảm thấy bối rối, khó chịu và / hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Shut up! You're doing my head in.",
                        "vi": "Câm miệng! Bạn đang đâm đầu vào của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to do something very easily and without having to think too much",
                    "vi": "để có thể làm điều gì đó rất dễ dàng và không cần phải suy nghĩ quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody remember something by repeating it a lot of times",
                    "vi": "để làm cho ai đó nhớ điều gì đó bằng cách lặp lại nó nhiều lần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "covering your whole body",
                    "vi": "che toàn bộ cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "We were covered from head to foot in mud.",
                        "vi": "Chúng tôi ngập từ đầu đến chân trong bùn."
                    },
                    {
                        "en": "She was dressed from head to toe in red.",
                        "vi": "Cô ấy mặc đồ đỏ từ đầu đến chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sleep",
                    "vi": "ngủ"
                },
                "examples": [
                    {
                        "en": "I managed to get my head down for an hour.",
                        "vi": "Tôi cố gắng để có được đầu của tôi trong một giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid attracting attention to yourself",
                    "vi": "để tránh thu hút sự chú ý vào bản thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be able to understand or accept something",
                    "vi": "để có thể hiểu hoặc chấp nhận điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's dead. I can't get my head round it yet.",
                        "vi": "Cô ấy chết rồi. Tôi vẫn chưa thể quay đầu lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to understand or think something",
                    "vi": "để bắt đầu hiểu hoặc suy nghĩ điều gì đó"
                },
                "examples": [
                    {
                        "en": "When will you get it into your head that I don't want to discuss this any more!",
                        "vi": "Khi nào bạn sẽ hiểu nó vào đầu mà tôi không muốn thảo luận thêm về điều này nữa!"
                    },
                    {
                        "en": "For some reason she's got it into her head that I don't like her.",
                        "vi": "Vì lý do nào đó mà cô ấy nghĩ rằng tôi không thích cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to do what they want without trying to stop them",
                    "vi": "để cho phép ai đó làm những gì họ muốn mà không cố gắng ngăn cản họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody hopes about something that may not be possible or likely; to make somebody act or think in an unreasonable way",
                    "vi": "để cung cấp cho ai đó hy vọng về một cái gì đó có thể không khả thi hoặc có thể xảy ra; khiến ai đó hành động hoặc suy nghĩ theo cách không hợp lý"
                },
                "examples": [
                    {
                        "en": "Who's been putting ideas into his head?",
                        "vi": "Ai đang đưa ý tưởng vào đầu anh ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with somebody in a very direct and determined way",
                    "vi": "để đối phó với ai đó một cách rất trực tiếp và kiên quyết"
                },
                "examples": [
                    {
                        "en": "The company will be going head to head with the giant of the pharmaceuticals market.",
                        "vi": "Công ty sẽ đối đầu với gã khổng lồ của thị trường dược phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel drunk",
                    "vi": "làm cho bạn cảm thấy say"
                },
                "examples": [
                    {
                        "en": "That glass of wine has gone straight to my head.",
                        "vi": "Ly rượu đó đã xộc thẳng vào đầu tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel too proud of yourself in a way that other people find annoying",
                    "vi": "khiến bạn cảm thấy quá tự hào về bản thân theo cách mà người khác cảm thấy phiền phức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be aware of everything that is happening around you, even things that seem difficult or impossible to see",
                    "vi": "nhận thức được mọi thứ đang xảy ra xung quanh bạn, ngay cả những điều có vẻ khó hoặc không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "You can’t get away with anything in her class. She has eyes in the back of her head.",
                        "vi": "Bạn không thể thoát khỏi bất cứ thứ gì trong lớp của cô ấy. Cô ấy có đôi mắt ở phía sau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a sensible person",
                    "vi": "trở thành một người hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be good at something",
                    "vi": "trở nên giỏi hơn về cái gì đó"
                },
                "examples": [
                    {
                        "en": "to have a head for figures/business",
                        "vi": "để có một cái đầu cho các số liệu / kinh doanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody does not have a head for heights, they feel nervous and think they are going to fall when they look down from a high place",
                    "vi": "nếu ai đó không có đầu cho độ cao, họ cảm thấy lo lắng và nghĩ rằng họ sẽ bị ngã khi từ trên cao nhìn xuống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thinking about something that is not connected with what you are doing",
                    "vi": "suy nghĩ về điều gì đó không liên quan đến những gì bạn đang làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have ideas, plans, etc. that are not realistic",
                    "vi": "có những ý tưởng, kế hoạch, v.v. không thực tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a sensible person",
                    "vi": "trở thành một người hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have somewhere to live",
                    "vi": "có một nơi nào đó để sống"
                },
                "examples": [
                    {
                        "en": "Thanks to Bob’s generosity, I still have a roof over my head.",
                        "vi": "Cảm ơn sự hào phóng của Bob, tôi vẫn có một mái nhà trên đầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "for each person",
                    "vi": "Cho mỗi người"
                },
                "examples": [
                    {
                        "en": "The meal worked out at $20 a head.",
                        "vi": "Bữa ăn tính ra $ 20 một người."
                    }
                ]
            },
            {
                "define": {
                    "en": "moving forwards or downwards with your head in front of the rest of your body",
                    "vi": "di chuyển lên trên hoặc xuống dưới với đầu của bạn ở phía trước phần còn lại của cơ thể"
                },
                "examples": [
                    {
                        "en": "He fell head first down the stairs.",
                        "vi": "Anh ấy ngã đầu xuống cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "without thinking carefully about something before acting",
                    "vi": "mà không suy nghĩ kỹ về điều gì đó trước khi hành động"
                },
                "examples": [
                    {
                        "en": "She got divorced and rushed head first into another marriage.",
                        "vi": "Cô ấy đã ly hôn và lao đầu vào một cuộc hôn nhân khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "your head feels as though it is going round and round and you cannot balance, especially because you are ill or confused or have had a shock; to make you feel like this",
                    "vi": "đầu của bạn cảm thấy như thể nó quay vòng vòng và bạn không thể giữ thăng bằng, đặc biệt là vì bạn bị ốm hoặc bối rối hoặc bị sốc; để làm cho bạn cảm thấy như thế này"
                },
                "examples": [
                    {
                        "en": "Her head was spinning from the pain.",
                        "vi": "Đầu cô quay cuồng vì cơn đau."
                    },
                    {
                        "en": "His theories on economics are enough to make your head spin.",
                        "vi": "Những lý thuyết của ông về kinh tế học đủ khiến bạn quay cuồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "loving somebody very much",
                    "vi": "yêu ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "He's fallen head over heels in love with his boss.",
                        "vi": "Anh ta say đắm sếp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance",
                    "vi": "được sử dụng để hỏi ai đó mặt nào của đồng xu mà họ nghĩ sẽ hướng lên trên khi nó được tung ra để quyết định một điều gì đó tình cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that some people will be punished because of something that has happened",
                    "vi": "từng nói rằng một số người sẽ bị trừng phạt vì điều gì đó đã xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something that is exactly right",
                    "vi": "nói điều gì đó chính xác là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to force somebody to do something that they do not want to do, by making threats",
                    "vi": "buộc ai đó làm điều gì đó mà họ không muốn, bằng cách đe dọa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be proud of or not feel ashamed about something that you have done",
                    "vi": "tự hào hoặc không cảm thấy xấu hổ về điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "She managed to hold her head high and ignore what people were saying.",
                        "vi": "Cô ấy cố gắng ngẩng cao đầu và phớt lờ những gì mọi người đang nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to threaten somebody that you will hit them",
                    "vi": "từng đe dọa ai đó rằng bạn sẽ đánh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "involved in something that is too difficult for you to deal with",
                    "vi": "liên quan đến một cái gì đó quá khó đối với bạn"
                },
                "examples": [
                    {
                        "en": "After a week in the new job, I soon realized that I was in over my head.",
                        "vi": "Sau một tuần làm việc mới, tôi nhanh chóng nhận ra rằng mình đang làm quá sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remain calm in a difficult situation",
                    "vi": "giữ bình tĩnh trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She needed to keep a clear head if she was to remain in control.",
                        "vi": "Cô ấy cần phải giữ một cái đầu tỉnh táo nếu cô ấy muốn tiếp tục kiểm soát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with a difficult situation, especially one in which you have financial problems, and just manage to survive",
                    "vi": "để đối phó với một tình huống khó khăn, đặc biệt là một tình huống mà bạn gặp vấn đề tài chính và chỉ cần xoay sở để tồn tại"
                },
                "examples": [
                    {
                        "en": "I’m not sure how much longer we’ll be able to keep our heads above water.",
                        "vi": "Tôi không chắc chúng ta sẽ có thể giữ đầu trên mặt nước được bao lâu nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid attracting attention to yourself",
                    "vi": "để tránh thu hút sự chú ý vào bản thân"
                },
                "examples": [
                    {
                        "en": "If I were you, I’d keep your head down for a couple of weeks.",
                        "vi": "Nếu tôi là bạn, tôi sẽ giữ đầu bạn trong vài tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh very loudly and for a long time",
                    "vi": "cười rất lớn và trong một thời gian dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh, etc. a lot and very loudly",
                    "vi": "cười, v.v. rất nhiều và rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a bad mood; in an angry way",
                    "vi": "trong một tâm trạng tồi tệ; một cách tức giận"
                },
                "examples": [
                    {
                        "en": "I should keep out of his way. He’s like a bear with a sore head this morning.",
                        "vi": "Tôi nên tránh xa anh ta. Sáng nay anh ấy giống như một con gấu bị đau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become unable to act in a calm or sensible way",
                    "vi": "trở nên không thể hành động một cách bình tĩnh hoặc hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel annoyed, anxious or upset",
                    "vi": "để làm cho ai đó cảm thấy khó chịu, lo lắng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "When they spend all this time on social media, they are seeing things that mess with their heads.",
                        "vi": "Khi dành toàn bộ thời gian trên mạng xã hội, họ đang nhìn thấy những thứ rối tung lên trong đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be crazy",
                    "vi": "trở nên điên rồ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not spend time/effort on something, because it is not important or you are not interested in it",
                    "vi": "không dành thời gian / nỗ lực cho việc gì đó, vì nó không quan trọng hoặc bạn không quan tâm đến nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not hurt somebody physically in any way",
                    "vi": "để không làm tổn thương ai đó về mặt thể chất theo bất kỳ cách nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "just guessing or using your memory, without taking time to think carefully or check the facts",
                    "vi": "chỉ cần đoán hoặc sử dụng trí nhớ của bạn mà không mất thời gian suy nghĩ cẩn thận hoặc kiểm tra sự thật"
                },
                "examples": [
                    {
                        "en": "I can't remember the name off the top of my head, but I can look it up for you.",
                        "vi": "Tôi không thể nhớ ra cái tên trên đỉnh đầu của mình, nhưng tôi có thể tra cứu nó cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a young person who acts in a more sensible way than you would expect for a person of their age",
                    "vi": "được sử dụng để mô tả một người trẻ hành động theo cách hợp lý hơn bạn mong đợi đối với một người ở độ tuổi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they will have to accept any unpleasant results of something that they decide to do",
                    "vi": "được sử dụng để nói với ai đó rằng họ sẽ phải chấp nhận bất kỳ kết quả khó chịu nào của một điều gì đó mà họ quyết định làm"
                },
                "examples": [
                    {
                        "en": "Tell him the truth if you want to, but on your own head be it!",
                        "vi": "Hãy nói cho anh ấy biết sự thật nếu bạn muốn, nhưng bạn phải tự quyết định điều đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not knowing what you are saying or doing because of the effects of alcohol or drugs",
                    "vi": "không biết mình đang nói gì hoặc làm gì vì ảnh hưởng của rượu hoặc ma túy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "too difficult or complicated for somebody to understand",
                    "vi": "quá khó hoặc phức tạp để ai đó hiểu"
                },
                "examples": [
                    {
                        "en": "A lot of the jokes went (= were) right over my head.",
                        "vi": "Rất nhiều câu chuyện cười đã xảy ra ngay trong đầu tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a higher position of authority than somebody",
                    "vi": "lên một vị trí quyền lực cao hơn ai đó"
                },
                "examples": [
                    {
                        "en": "I couldn't help feeling jealous when she was promoted over my head.",
                        "vi": "Tôi không khỏi cảm thấy ghen tị khi cô ấy được thăng chức trên đầu tôi."
                    },
                    {
                        "en": "I’m not happy that you went over my head to ask for this time off.",
                        "vi": "Tôi không hài lòng khi bạn lướt qua đầu tôi để yêu cầu thời gian nghỉ này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money that is offered for capturing or killing somebody",
                    "vi": "một số tiền được cung cấp để bắt hoặc giết ai đó"
                },
                "examples": [
                    {
                        "en": "Ever since he killed the gang’s leader, there has been a price on his head.",
                        "vi": "Kể từ khi anh ta giết được thủ lĩnh của băng đảng, đã có một cái giá phải trả trên đầu anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to risk losing your job, damaging your reputation, etc. by doing or saying something",
                    "vi": "có nguy cơ mất việc, làm tổn hại danh tiếng của bạn, v.v. bằng cách làm hoặc nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's not a matter that I'm prepared to put my head on the block for.",
                        "vi": "Đó không phải là vấn đề mà tôi đã chuẩn bị sẵn sàng để đặt đầu của mình vào khối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think about or discuss something as a group",
                    "vi": "để suy nghĩ hoặc thảo luận về điều gì đó với tư cách một nhóm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something unpleasant rears its head or rears its ugly head, it appears or happens",
                    "vi": "nếu một cái gì đó khó chịu dựng lên đầu nó hoặc che cái đầu xấu xí của nó, nó sẽ xuất hiện hoặc xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make you feel that you can still hear something",
                    "vi": "để làm cho bạn cảm thấy rằng bạn vẫn có thể nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "His warning was still ringing in my ears.",
                        "vi": "Lời cảnh báo của anh ấy vẫn còn văng vẳng bên tai tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think hard in order to find an answer to something",
                    "vi": "suy nghĩ kỹ để tìm câu trả lời cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "Experts have been scratching their heads over the increase in teenage crime.",
                        "vi": "Các chuyên gia đã phải gãi đầu trước sự gia tăng tội phạm ở lứa tuổi thanh thiếu niên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make people think about something in a completely different way",
                    "vi": "để khiến mọi người nghĩ về điều gì đó theo một cách hoàn toàn khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be remembered for a long time",
                    "vi": "được ghi nhớ trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "One of his paintings in particular sticks in my mind.",
                        "vi": "Một trong những bức tranh của anh ấy đặc biệt ghi nhớ trong tâm trí tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start thinking something, especially something that other people think is stupid",
                    "vi": "đột nhiên bắt đầu nghĩ điều gì đó, đặc biệt là điều gì đó mà người khác nghĩ là ngu ngốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly decide to do something, especially something that other people think is stupid",
                    "vi": "đột nhiên quyết định làm điều gì đó, đặc biệt là điều mà người khác nghĩ là ngu ngốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a physical condition in which your head is painful or you cannot think clearly as a result of an illness or of drinking too much alcohol",
                    "vi": "một tình trạng thể chất mà đầu của bạn bị đau hoặc bạn không thể suy nghĩ rõ ràng do bệnh tật hoặc uống quá nhiều rượu"
                },
                "examples": [
                    {
                        "en": "You’re going to have a thick head in the morning!",
                        "vi": "Bạn sẽ có một cái đầu dày vào buổi sáng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a person feel too proud in a way that other people find annoying",
                    "vi": "làm cho một người cảm thấy quá tự hào theo cách mà người khác cảm thấy phiền phức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that two people can achieve more than one person working alone",
                    "vi": "từng nói rằng hai người có thể đạt được nhiều hơn một người làm việc một mình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid",
                    "vi": "được sử dụng để nói với ai đó hãy suy nghĩ về điều gì đó, đặc biệt là khi họ hỏi ý kiến của bạn hoặc nói điều gì đó ngu ngốc"
                },
                "examples": [
                    {
                        "en": "‘Why don't you want to see him again?’ ‘Oh, use your head!’",
                        "vi": "Tại sao bạn không muốn gặp lại anh ấy?' 'Ồ, sử dụng cái đầu của bạn!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "fb058bac6dbe49edb8b8f5b432010210",
        "word": "admission",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ədˈmɪʃn/",
            "us": "/ədˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "admissibility",
                "pos": "noun"
            },
            {
                "word": "admissible",
                "pos": "adjective"
            },
            {
                "word": "admission",
                "pos": "noun"
            },
            {
                "word": "admit",
                "pos": "verb"
            },
            {
                "word": "admit of",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of accepting somebody into an institution, organization, etc.; the right to enter a place or to join an institution or organization",
                    "vi": "hành động chấp nhận một người nào đó vào một cơ quan, tổ chức, v.v.; quyền vào một địa điểm hoặc gia nhập một cơ quan hoặc tổ chức"
                },
                "examples": [
                    {
                        "en": "Hospital admission is not necessary in most cases.",
                        "vi": "Nhập viện là không cần thiết trong hầu hết các trường hợp."
                    },
                    {
                        "en": "Hospital admissions for asthma attacks have doubled.",
                        "vi": "Số người nhập viện vì các cơn hen suyễn đã tăng gấp đôi."
                    },
                    {
                        "en": "the university admissions policy/office",
                        "vi": "văn phòng / chính sách tuyển sinh đại học"
                    },
                    {
                        "en": "They tried to get into the club but were refused admission.",
                        "vi": "Họ đã cố gắng vào câu lạc bộ nhưng bị từ chối nhập học."
                    },
                    {
                        "en": "She failed to gain admission to the university of her choice.",
                        "vi": "Cô không thể trúng tuyển vào trường đại học mà mình đã chọn."
                    },
                    {
                        "en": "Is there any charge for admission?",
                        "vi": "Nhập học có mất phí không?"
                    },
                    {
                        "en": "There was a steady decline in cinema admissions during the 1960s.",
                        "vi": "Số lượng tuyển sinh vào rạp chiếu phim đã giảm dần trong những năm 1960."
                    },
                    {
                        "en": "admission to something countries applying for admission to the European Union",
                        "vi": "nhập học vào một số quốc gia đăng ký gia nhập Liên minh Châu Âu"
                    },
                    {
                        "en": "Last admissions to the park are at 4 p.m.",
                        "vi": "Lần cuối vào công viên lúc 4 giờ chiều"
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement in which somebody admits that something is true, especially something wrong or bad that they have done",
                    "vi": "một tuyên bố trong đó ai đó thừa nhận rằng điều gì đó là đúng, đặc biệt là điều gì đó sai hoặc xấu mà họ đã làm"
                },
                "examples": [
                    {
                        "en": "He is a thief by his own admission (= he has admitted it).",
                        "vi": "Anh ta là một tên trộm bởi sự thừa nhận của chính anh ta (= anh ta đã thừa nhận điều đó)."
                    },
                    {
                        "en": "admission of something an admission of guilt/failure/defeat",
                        "vi": "thừa nhận điều gì đó là thừa nhận tội lỗi / thất bại / thất bại"
                    },
                    {
                        "en": "admission that… The minister's resignation was an admission that she had lied.",
                        "vi": "thừa nhận rằng… Bộ trưởng từ chức là một thừa nhận rằng cô ấy đã nói dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of money that you pay to go into a building or to an event",
                    "vi": "số tiền bạn phải trả để đi vào một tòa nhà hoặc một sự kiện"
                },
                "examples": [
                    {
                        "en": "admission charges/prices",
                        "vi": "phí / giá nhập học"
                    },
                    {
                        "en": "£5 admission",
                        "vi": "Nhập học £ 5"
                    },
                    {
                        "en": "What's the admission?",
                        "vi": "Nhập học là gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "80bcfdfa2e12442d97397a30b10ac1dd",
        "word": "bail",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/beɪl/",
            "us": "/beɪl/"
        },
        "nearby": [
            {
                "word": "Bahraini",
                "pos": "noun, adjective"
            },
            {
                "word": "bahu",
                "pos": "noun"
            },
            {
                "word": "bail",
                "pos": "noun"
            },
            {
                "word": "bail",
                "pos": "verb"
            },
            {
                "word": "bailey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that somebody agrees to pay if a person accused of a crime does not appear at their trial. When bail has been arranged, the accused person is allowed to go free until the trial.",
                    "vi": "tiền mà ai đó đồng ý trả nếu một người bị buộc tội không xuất hiện tại phiên tòa của họ. Khi đã được thu xếp tại ngoại, người bị buộc tội được tự do cho đến khi xét xử."
                },
                "examples": [
                    {
                        "en": "Can anyone put up bail for you?",
                        "vi": "Bất cứ ai có thể đưa ra bảo lãnh cho bạn?"
                    },
                    {
                        "en": "She was released on £2 000 bail.",
                        "vi": "Cô được tại ngoại với số tiền 2.000 bảng Anh."
                    },
                    {
                        "en": "Bail was set at $1 million.",
                        "vi": "Tiền bảo lãnh được ấn định là 1 triệu đô la."
                    },
                    {
                        "en": "The judge granted/refused bail.",
                        "vi": "Thẩm phán đã cấp / từ chối bảo lãnh."
                    },
                    {
                        "en": "on bail He committed another offence while he was out on bail (= after bail had been agreed).",
                        "vi": "tại ngoại Anh ta đã phạm một tội khác trong khi anh ta được tại ngoại (= sau khi đã đồng ý bảo lãnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "either of the two small pieces of wood on top of each set of three wooden posts (called stumps)",
                    "vi": "một trong hai mảnh gỗ nhỏ phía trên của mỗi bộ ba trụ gỗ (gọi là gốc cây)."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail to appear at your trial after you have paid money to be allowed to go free until the trial",
                    "vi": "không xuất hiện tại bản dùng thử của bạn sau khi bạn đã trả tiền để được phép sử dụng miễn phí cho đến khi dùng thử"
                },
                "examples": [
                    {
                        "en": "He skipped bail and went on the run for two weeks.",
                        "vi": "Anh ta đã bỏ qua bảo lãnh và bỏ trốn trong hai tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "109ff4eb6e094777a6b153cd2423ba34",
        "word": "bonus",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbəʊnəs/",
            "us": "/ˈbəʊnəs/"
        },
        "nearby": [
            {
                "word": "bonsai",
                "pos": "noun"
            },
            {
                "word": "bonsella",
                "pos": "noun"
            },
            {
                "word": "bonus",
                "pos": "noun"
            },
            {
                "word": "bon vivant",
                "pos": "noun"
            },
            {
                "word": "bon voyage",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra amount of money that is added to a payment, especially to somebody’s wages or salary as a reward",
                    "vi": "một khoản tiền bổ sung được thêm vào một khoản thanh toán, đặc biệt là tiền lương hoặc tiền lương của ai đó như một phần thưởng"
                },
                "examples": [
                    {
                        "en": "a £100 Christmas bonus",
                        "vi": "100 bảng tiền thưởng Giáng sinh"
                    },
                    {
                        "en": "productivity bonuses",
                        "vi": "tiền thưởng năng suất"
                    },
                    {
                        "en": "the row over bankers' bonuses",
                        "vi": "hàng về tiền thưởng của các chủ ngân hàng"
                    },
                    {
                        "en": "What is actually paid will depend on the bonus payments made at the end of the policy.",
                        "vi": "Số tiền thực sự được thanh toán sẽ phụ thuộc vào các khoản thanh toán tiền thưởng được thực hiện vào cuối hợp đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "anything pleasant that is extra and more or better than you were expecting",
                    "vi": "bất cứ điều gì thú vị bổ sung và nhiều hơn hoặc tốt hơn bạn mong đợi"
                },
                "examples": [
                    {
                        "en": "Being able to walk to work is an added bonus of the new job.",
                        "vi": "Có thể đi bộ đến nơi làm việc là một phần thưởng bổ sung của công việc mới."
                    },
                    {
                        "en": "As a bonus, club members can get free tickets for all the family.",
                        "vi": "Như một phần thưởng, các thành viên câu lạc bộ có thể nhận được vé miễn phí cho cả gia đình."
                    },
                    {
                        "en": "One of the great bonuses of retirement is having time to spare.",
                        "vi": "Một trong những phần thưởng tuyệt vời khi nghỉ hưu là có thời gian rảnh rỗi."
                    }
                ]
            }
        ]
    },
    {
        "id": "b483e347d0cc439899f80c53c255485a",
        "word": "bribe",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/braɪb/",
            "us": "/braɪb/"
        },
        "nearby": [
            {
                "word": "Brianna",
                "pos": ""
            },
            {
                "word": "briar",
                "pos": "noun"
            },
            {
                "word": "bribe",
                "pos": "noun"
            },
            {
                "word": "bribe",
                "pos": "verb"
            },
            {
                "word": "bribery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sum of money or something valuable that you give or offer to somebody to persuade them to help you, especially by doing something dishonest",
                    "vi": "một khoản tiền hoặc thứ gì đó có giá trị mà bạn đưa hoặc đề nghị cho ai đó để thuyết phục họ giúp đỡ bạn, đặc biệt là bằng cách làm điều gì đó không trung thực"
                },
                "examples": [
                    {
                        "en": "It was alleged that he had taken bribes while in office.",
                        "vi": "Người ta cho rằng ông đã nhận hối lộ khi còn đương chức."
                    },
                    {
                        "en": "She had been offered a $50 000 bribe to drop the charges.",
                        "vi": "Cô đã được đưa ra một khoản hối lộ $ 50 000 để bỏ qua các cáo buộc."
                    }
                ]
            }
        ]
    },
    {
        "id": "86fbfd11e14c414a914911930fa4f63e",
        "word": "bribe",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/braɪb/",
            "us": "/braɪb/"
        },
        "nearby": [
            {
                "word": "briar",
                "pos": "noun"
            },
            {
                "word": "bribe",
                "pos": "noun"
            },
            {
                "word": "bribe",
                "pos": "verb"
            },
            {
                "word": "bribery",
                "pos": "noun"
            },
            {
                "word": "bric-a-brac",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody money or something valuable in order to persuade them to help you, especially by doing something dishonest",
                    "vi": "cho ai đó tiền hoặc thứ gì đó có giá trị để thuyết phục họ giúp đỡ bạn, đặc biệt là bằng cách làm điều gì đó không trung thực"
                },
                "examples": [
                    {
                        "en": "bribe somebody (with something) They bribed the guards with cigarettes.",
                        "vi": "hối lộ ai đó (bằng cái gì đó) Họ hối lộ các lính canh bằng thuốc lá."
                    },
                    {
                        "en": "bribe somebody into doing something She was bribed into handing over secret information.",
                        "vi": "hối lộ ai đó làm điều gì đó Cô ấy đã bị hối lộ để chuyển giao thông tin bí mật."
                    },
                    {
                        "en": "bribe somebody to do something She bribed him to sign the certificate.",
                        "vi": "hối lộ ai đó để làm điều gì đó Cô đã hối lộ anh ta để ký giấy chứng nhận."
                    },
                    {
                        "en": "bribe your way… He managed to bribe his way onto the ship.",
                        "vi": "hối lộ theo cách của bạn… Anh ta đã tìm cách hối lộ để lên tàu."
                    },
                    {
                        "en": "He must have bribed his way out of the prison.",
                        "vi": "Chắc anh ta đã mua chuộc được đường ra khỏi nhà tù."
                    }
                ]
            }
        ]
    },
    {
        "id": "b698d1aca24e46b1a1f5ce64279fc3f1",
        "word": "cash transfer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkæʃ ˈtrænsfɜː(r)/",
            "us": "/ˌkæʃ ˈtrænsfɜːr/"
        },
        "nearby": [
            {
                "word": "cash-starved",
                "pos": "adjective"
            },
            {
                "word": "cash-strapped",
                "pos": "adjective"
            },
            {
                "word": "cash transfer",
                "pos": "noun"
            },
            {
                "word": "cash up",
                "pos": "phrasal verb"
            },
            {
                "word": "casing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of moving money from one bank or place to another; the money moved in this way",
                    "vi": "hành động chuyển tiền từ ngân hàng này sang ngân hàng hoặc nơi khác; tiền di chuyển theo cách này"
                },
                "examples": [
                    {
                        "en": "He made a cash transfer of $1 000 to his relatives in Haiti.",
                        "vi": "Anh ta đã chuyển khoản tiền mặt trị giá 1 000 đô la cho người thân của mình ở Haiti."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a71e7995ab4477099fc4407c5e8cc97",
        "word": "contactless",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒntæktləs/",
            "us": "/ˈkɑːntæktləs/"
        },
        "nearby": [
            {
                "word": "contact improvisation",
                "pos": "noun"
            },
            {
                "word": "contact lens",
                "pos": "noun"
            },
            {
                "word": "contactless",
                "pos": "adjective"
            },
            {
                "word": "contact sport",
                "pos": "noun"
            },
            {
                "word": "contact tracer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to the technology that allows a smart card (= a small plastic card used to store information electronically), mobile phone, etc. to contact an electronic device that it is not connected to, usually in order to make a payment",
                    "vi": "liên quan đến công nghệ cho phép thẻ thông minh (= một thẻ nhựa nhỏ dùng để lưu trữ thông tin điện tử), điện thoại di động, v.v. liên hệ với một thiết bị điện tử mà nó không được kết nối, thường là để thanh toán"
                },
                "examples": [
                    {
                        "en": "contactless cards",
                        "vi": "thẻ không tiếp xúc"
                    },
                    {
                        "en": "a contactless payment",
                        "vi": "thanh toán không tiếp xúc"
                    }
                ]
            }
        ]
    },
    {
        "id": "fd4a53ebb4a24a89a04effbe8cd3fae1",
        "word": "fine",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/faɪn/",
            "us": "/faɪn/"
        },
        "nearby": [
            {
                "word": "fine",
                "pos": "adjective"
            },
            {
                "word": "fine",
                "pos": "adverb"
            },
            {
                "word": "fine",
                "pos": "noun"
            },
            {
                "word": "fine",
                "pos": "verb"
            },
            {
                "word": "fine art",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sum of money that must be paid as punishment for breaking a law or rule",
                    "vi": "một khoản tiền phải được trả như sự trừng phạt nếu vi phạm luật hoặc quy tắc"
                },
                "examples": [
                    {
                        "en": "I got a parking fine for parking on double yellow lines.",
                        "vi": "Tôi bị phạt khi đậu xe trên vạch đôi màu vàng."
                    },
                    {
                        "en": "Offenders will be liable to a heavy fine (= one that costs a lot of money).",
                        "vi": "Người vi phạm sẽ phải chịu một khoản phạt nặng (= một khoản phải trả rất nhiều tiền)."
                    },
                    {
                        "en": "Under the new law, motorists face fines of up to £1 000.",
                        "vi": "Theo luật mới, người lái xe ô tô phải đối mặt với khoản tiền phạt lên tới 1.000 bảng Anh."
                    },
                    {
                        "en": "She has already paid over $2 000 in fines.",
                        "vi": "Cô ấy đã nộp hơn $ 2 000 tiền phạt."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac968c41b2f7490c88748549dcd04eab",
        "word": "incentive",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈsentɪv/",
            "us": "/ɪnˈsentɪv/"
        },
        "nearby": [
            {
                "word": "incense",
                "pos": "verb"
            },
            {
                "word": "incensed",
                "pos": "adjective"
            },
            {
                "word": "incentive",
                "pos": "noun"
            },
            {
                "word": "incentivize",
                "pos": "verb"
            },
            {
                "word": "inception",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that encourages you to do something",
                    "vi": "điều gì đó khuyến khích bạn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "There is no incentive for people to save fuel.",
                        "vi": "Không có động cơ khuyến khích mọi người tiết kiệm nhiên liệu."
                    },
                    {
                        "en": "There is an added incentive for you to buy from our catalogue—a free gift with every purchase.",
                        "vi": "Có một động lực bổ sung cho bạn khi mua hàng từ danh mục của chúng tôi — một món quà miễn phí khi mua hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a payment or concession (= a reduction in the amount of money that has to be paid) that encourages somebody to do something",
                    "vi": "một khoản thanh toán hoặc nhượng bộ (= giảm số tiền phải trả) khuyến khích ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "tax incentives to encourage savings",
                        "vi": "ưu đãi thuế để khuyến khích tiết kiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "ea1840758d9540338c246358f8322d50",
        "word": "invoice",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪnvɔɪs/",
            "us": "/ˈɪnvɔɪs/"
        },
        "nearby": [
            {
                "word": "in vivo",
                "pos": "adverb"
            },
            {
                "word": "invocation",
                "pos": "noun"
            },
            {
                "word": "invoice",
                "pos": "noun"
            },
            {
                "word": "invoice",
                "pos": "verb"
            },
            {
                "word": "invoke",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list of goods that have been sold, work that has been done, etc., showing what you must pay",
                    "vi": "danh sách hàng hóa đã được bán, công việc đã được thực hiện, v.v., cho thấy những gì bạn phải trả"
                },
                "examples": [
                    {
                        "en": "to send/issue/settle an invoice for the goods",
                        "vi": "để gửi / xuất / thanh toán hóa đơn cho hàng hóa"
                    },
                    {
                        "en": "an invoice for £250",
                        "vi": "một hóa đơn cho £ 250"
                    }
                ]
            }
        ]
    },
    {
        "id": "20210157269647468afc7401e8b55ce9",
        "word": "money transfer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmʌni trænsfɜː(r)/",
            "us": "/ˈmʌni trænsfɜːr/"
        },
        "nearby": [
            {
                "word": "money-spinner",
                "pos": "noun"
            },
            {
                "word": "money supply",
                "pos": "noun"
            },
            {
                "word": "money transfer",
                "pos": "noun"
            },
            {
                "word": "Mongol",
                "pos": "noun, adjective"
            },
            {
                "word": "Mongolia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of moving money from one bank or place to another; the money moved in this way",
                    "vi": "hành động chuyển tiền từ ngân hàng này sang ngân hàng hoặc nơi khác; tiền di chuyển theo cách này"
                },
                "examples": [
                    {
                        "en": "He made a money transfer of $1 000 to his relatives in Haiti.",
                        "vi": "Anh đã chuyển khoản 1 000 đô la cho người thân của mình ở Haiti."
                    }
                ]
            }
        ]
    },
    {
        "id": "6131988ad32946a3b47a48948a612783",
        "word": "pay off",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "the Paymaster General",
                "pos": ""
            },
            {
                "word": "payment",
                "pos": "noun"
            },
            {
                "word": "pay off",
                "pos": "phrasal verb"
            },
            {
                "word": "pay-off",
                "pos": "noun"
            },
            {
                "word": "payola",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be successful and bring good results",
                    "vi": "để thành công và mang lại kết quả tốt"
                },
                "examples": [
                    {
                        "en": "The gamble paid off.",
                        "vi": "Canh bạc đã được đền đáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay somebody what they have earned and tell them to leave their job",
                    "vi": "trả cho ai đó những gì họ đã kiếm được và yêu cầu họ nghỉ việc"
                },
                "examples": [
                    {
                        "en": "The crew were paid off as soon as the ship docked.",
                        "vi": "Thủy thủ đoàn đã được trả công ngay khi tàu cập cảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody money to prevent them from doing something or talking about something illegal or dishonest that you have done",
                    "vi": "cho ai đó tiền để ngăn họ làm điều gì đó hoặc nói về điều gì đó bất hợp pháp hoặc không trung thực mà bạn đã làm"
                },
                "examples": [
                    {
                        "en": "All the witnesses had been paid off.",
                        "vi": "Tất cả các nhân chứng đã được đền đáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish paying money owed for something",
                    "vi": "để hoàn thành việc trả tiền nợ cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We paid off our mortgage after fifteen years.",
                        "vi": "Chúng tôi đã trả hết thế chấp sau mười lăm năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "675287fd7cb84312acbaf3252191e2d1",
        "word": "prepaid",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpriːˈpeɪd/",
            "us": "/ˌpriːˈpeɪd/"
        },
        "nearby": [
            {
                "word": "prep",
                "pos": "verb"
            },
            {
                "word": "pre-packed",
                "pos": "adjective"
            },
            {
                "word": "prepaid",
                "pos": "adjective"
            },
            {
                "word": "preparation",
                "pos": "noun"
            },
            {
                "word": "preparatory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "paid for in advance",
                    "vi": "trả trước"
                },
                "examples": [
                    {
                        "en": "a prepaid mobile phone",
                        "vi": "một điện thoại di động trả trước"
                    },
                    {
                        "en": "A prepaid envelope is enclosed (= so you do not have to pay the cost of sending a letter).",
                        "vi": "Một phong bì trả trước được gửi kèm theo (= vì vậy bạn không phải trả phí gửi thư)."
                    }
                ]
            }
        ]
    },
    {
        "id": "7f03263d90f54d048edd65d3d2c2dadc",
        "word": "quotation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kwəʊˈteɪʃn/",
            "us": "/kwəʊˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "quotable",
                "pos": "adjective"
            },
            {
                "word": "quota system",
                "pos": "noun"
            },
            {
                "word": "quotation",
                "pos": "noun"
            },
            {
                "word": "quotation marks",
                "pos": "noun"
            },
            {
                "word": "quote",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of words or a short piece of writing taken from a book, play, speech, etc. and repeated because it is interesting or useful",
                    "vi": "một nhóm từ hoặc một đoạn văn bản ngắn được lấy từ một cuốn sách, vở kịch, bài phát biểu, v.v. và được lặp lại vì nó thú vị hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "a dictionary of quotations",
                        "vi": "từ điển danh ngôn"
                    },
                    {
                        "en": "Two short quotations will illustrate my point.",
                        "vi": "Hai trích dẫn ngắn sẽ minh họa quan điểm của tôi."
                    },
                    {
                        "en": "quotation from something The book began with a quotation from Goethe.",
                        "vi": "trích dẫn từ một cái gì đó Cuốn sách bắt đầu với một trích dẫn từ Goethe."
                    },
                    {
                        "en": "a direct quotation from a recent speech by the president",
                        "vi": "một trích dẫn trực tiếp từ một bài phát biểu gần đây của tổng thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of repeating something interesting or useful that another person has written or said",
                    "vi": "hành động lặp lại điều gì đó thú vị hoặc hữu ích mà người khác đã viết hoặc nói"
                },
                "examples": [
                    {
                        "en": "The writer illustrates his point by quotation from a number of sources.",
                        "vi": "Người viết minh họa quan điểm của mình bằng cách trích dẫn từ một số nguồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of how much money a particular piece of work will cost",
                    "vi": "một tuyên bố về số tiền mà một tác phẩm cụ thể sẽ có giá"
                },
                "examples": [
                    {
                        "en": "You need to get a written quotation before they start work.",
                        "vi": "Bạn cần nhận được một báo giá bằng văn bản trước khi họ bắt đầu công việc."
                    },
                    {
                        "en": "We’ll give you a free quotation for replacing your windows.",
                        "vi": "Chúng tôi sẽ cung cấp cho bạn một báo giá miễn phí cho việc thay thế các cửa sổ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of the current value of goods or shares",
                    "vi": "một tuyên bố về giá trị hiện tại của hàng hóa hoặc cổ phiếu"
                },
                "examples": [
                    {
                        "en": "the latest quotations from the Stock Exchange",
                        "vi": "báo giá mới nhất từ Sở giao dịch chứng khoán"
                    },
                    {
                        "en": "It was the first football club to have a full stock market quotation.",
                        "vi": "Đây là câu lạc bộ bóng đá đầu tiên có bảng báo giá đầy đủ trên thị trường chứng khoán."
                    }
                ]
            }
        ]
    },
    {
        "id": "62ff337ac10a4875b2a55c516f50dedc",
        "word": "ransom",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrænsəm/",
            "us": "/ˈrænsəm/"
        },
        "nearby": [
            {
                "word": "rankle",
                "pos": "verb"
            },
            {
                "word": "ransack",
                "pos": "verb"
            },
            {
                "word": "ransom",
                "pos": "noun"
            },
            {
                "word": "ransom",
                "pos": "verb"
            },
            {
                "word": "Arthur Ransome",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that is paid to somebody so that they will set free a person who is being kept as a prisoner by them",
                    "vi": "tiền được trả cho ai đó để họ trả tự do cho một người đang bị họ giam giữ như một tù nhân"
                },
                "examples": [
                    {
                        "en": "The kidnappers demanded a ransom of £50 000 from his family.",
                        "vi": "Những kẻ bắt cóc yêu cầu một khoản tiền chuộc 50.000 bảng Anh từ gia đình anh ta."
                    },
                    {
                        "en": "a ransom demand/note",
                        "vi": "một yêu cầu / lưu ý tiền chuộc"
                    },
                    {
                        "en": "ransom money",
                        "vi": "tiền chuộc"
                    },
                    {
                        "en": "They are refusing to pay ransom for her release.",
                        "vi": "Họ từ chối trả tiền chuộc để trả tự do cho cô ấy."
                    },
                    {
                        "en": "They stole cattle for ransom.",
                        "vi": "Họ ăn trộm gia súc để đòi tiền chuộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep somebody as a prisoner and demand that other people pay you an amount of money before you set them free",
                    "vi": "giữ ai đó làm tù nhân và yêu cầu người khác trả cho bạn một số tiền trước khi bạn thả họ ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take action that puts somebody in a very difficult situation in order to force them to do what you want",
                    "vi": "thực hiện hành động đưa ai đó vào một tình huống rất khó khăn để buộc họ làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "The company refused to be held to ransom by the union.",
                        "vi": "Công ty từ chối đòi tiền chuộc bởi công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large amount of money",
                    "vi": "một số tiền rất lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43ef2d59c93948af9e1a50eddd31483a",
        "word": "repay",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈpeɪ/",
            "us": "/rɪˈpeɪ/"
        },
        "nearby": [
            {
                "word": "repatriate",
                "pos": "verb"
            },
            {
                "word": "repatriation",
                "pos": "noun"
            },
            {
                "word": "repay",
                "pos": "verb"
            },
            {
                "word": "repayable",
                "pos": "adjective"
            },
            {
                "word": "repayment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay back the money that you have borrowed from somebody",
                    "vi": "để trả lại số tiền mà bạn đã vay từ ai đó"
                },
                "examples": [
                    {
                        "en": "repay something to repay a debt/loan/mortgage",
                        "vi": "trả một cái gì đó để trả một khoản nợ / khoản vay / thế chấp"
                    },
                    {
                        "en": "I'll repay the money I owe them next week.",
                        "vi": "Tôi sẽ trả lại số tiền tôi nợ họ vào tuần tới."
                    },
                    {
                        "en": "repay something to somebody The advance must be repaid to the publisher if the work is not completed on time.",
                        "vi": "hoàn trả một cái gì đó cho ai đó Khoản tiền tạm ứng phải được hoàn trả cho nhà xuất bản nếu công việc không được hoàn thành đúng hạn."
                    },
                    {
                        "en": "repay somebody When are you going to repay them?",
                        "vi": "trả nợ ai đó Khi nào bạn sẽ trả nợ cho họ?"
                    },
                    {
                        "en": "repay somebody something I fully intend to repay them the money that they lent me.",
                        "vi": "trả nợ cho ai đó một thứ mà tôi hoàn toàn có ý định trả lại họ số tiền mà họ đã cho tôi vay."
                    },
                    {
                        "en": "repay somebody for something I'll repay you for the ticket next week.",
                        "vi": "trả ơn ai đó cho một cái gì đó Tôi sẽ trả lại cho bạn vé vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give something to somebody or do something for them in return for something that they have done for you",
                    "vi": "để đưa một cái gì đó cho ai đó hoặc làm một cái gì đó cho họ để đáp lại một cái gì đó mà họ đã làm cho bạn"
                },
                "examples": [
                    {
                        "en": "repay somebody (for something) How can I ever repay you for your generosity?",
                        "vi": "trả ơn ai đó (vì điều gì đó) Làm thế nào tôi có thể trả ơn bạn vì sự hào phóng của bạn?"
                    },
                    {
                        "en": "repay something (with something) Their trust was repaid with fierce loyalty.",
                        "vi": "trả ơn một cái gì đó (bằng một cái gì đó) Sự tin tưởng của họ đã được đền đáp bằng lòng trung thành mãnh liệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something repays your attention, interest, study, etc., it is worth spending time to look at it, etc.",
                    "vi": "nếu điều gì đó đáp lại sự chú ý, quan tâm, nghiên cứu của bạn, v.v., thì bạn nên dành thời gian để xem xét nó, v.v."
                },
                "examples": [
                    {
                        "en": "The report repays careful reading.",
                        "vi": "Báo cáo trả lời đọc cẩn thận."
                    },
                    {
                        "en": "The charter can be seen in the town museum, which more than repays a visit.",
                        "vi": "Điều lệ có thể được nhìn thấy trong bảo tàng thị trấn, mà còn hơn là trả lại một chuyến thăm."
                    }
                ]
            }
        ]
    },
    {
        "id": "769ed33f19124170aab74b303fd82518",
        "word": "settle",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsetl/",
            "us": "/ˈsetl/"
        },
        "nearby": [
            {
                "word": "set text",
                "pos": "noun"
            },
            {
                "word": "setting",
                "pos": "noun"
            },
            {
                "word": "settle",
                "pos": "verb"
            },
            {
                "word": "settle",
                "pos": "noun"
            },
            {
                "word": "settled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put an end to an argument or a disagreement",
                    "vi": "để chấm dứt một cuộc tranh cãi hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "settle something to settle a dispute/a matter/an issue",
                        "vi": "giải quyết một cái gì đó để giải quyết một tranh chấp / một vấn đề / một vấn đề"
                    },
                    {
                        "en": "to settle a case/lawsuit/claim",
                        "vi": "để giải quyết một trường hợp / vụ kiện / yêu cầu bồi thường"
                    },
                    {
                        "en": "to settle an argument/a disagreement",
                        "vi": "để giải quyết một cuộc tranh cãi / một bất đồng"
                    },
                    {
                        "en": "It's time you settled your differences with your father.",
                        "vi": "Đã đến lúc bạn giải quyết những khác biệt của mình với cha mình."
                    },
                    {
                        "en": "I want this thing settled.",
                        "vi": "Tôi muốn điều này được giải quyết."
                    },
                    {
                        "en": "There is pressure on the unions to settle.",
                        "vi": "Có áp lực đối với các công đoàn để giải quyết."
                    },
                    {
                        "en": "The company has agreed to settle out of court (= come to an agreement without going to court).",
                        "vi": "Công ty đã đồng ý giải quyết ngoài tòa án (= đi đến một thỏa thuận mà không cần đến tòa án)."
                    },
                    {
                        "en": "Many cases are settled through negotiation.",
                        "vi": "Nhiều trường hợp được giải quyết thông qua thương lượng."
                    },
                    {
                        "en": "settle with somebody (for something) The corporation later settled with the singer for $1.5 million.",
                        "vi": "giải quyết với ai đó (vì điều gì đó) Công ty sau đó đã thanh toán với ca sĩ với giá 1,5 triệu đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide or arrange something finally",
                    "vi": "để quyết định hoặc sắp xếp một cái gì đó cuối cùng"
                },
                "examples": [
                    {
                        "en": "settle something It's all settled—we're leaving on the nine o'clock plane.",
                        "vi": "giải quyết một cái gì đó Mọi chuyện đã ổn thỏa — chúng ta sẽ lên máy bay chín giờ."
                    },
                    {
                        "en": "Good, that's settled, then.",
                        "vi": "Tốt, vậy là ổn thỏa."
                    },
                    {
                        "en": "Bob will be there? That settles it. I'm not coming.",
                        "vi": "Bob sẽ ở đó? Điều đó giải quyết nó. Tôi không đén."
                    },
                    {
                        "en": "He had to settle his affairs (= arrange all his personal business) in Paris before he could return home.",
                        "vi": "Anh ấy phải giải quyết công việc của mình (= sắp xếp mọi công việc cá nhân của mình) ở Paris trước khi anh ấy có thể trở về nhà."
                    },
                    {
                        "en": "it is settled that… It's been settled that we leave on the nine o'clock plane.",
                        "vi": "nó đã được giải quyết rằng ... Nó đã được giải quyết rằng chúng tôi rời đi trên máy bay chín giờ."
                    },
                    {
                        "en": "All the loose ends should be settled within 48 hours.",
                        "vi": "Tất cả các đầu lỏng lẻo phải được giải quyết trong vòng 48 giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a place your permanent home",
                    "vi": "để biến một nơi thành ngôi nhà vĩnh viễn của bạn"
                },
                "examples": [
                    {
                        "en": "She settled in Vienna after her father's death.",
                        "vi": "Cô định cư ở Vienna sau khi cha cô qua đời."
                    },
                    {
                        "en": "She is an American who settled here a couple of years ago.",
                        "vi": "Cô ấy là người Mỹ định cư ở đây vài năm trước."
                    },
                    {
                        "en": "The couple afterwards settled near Bournemouth.",
                        "vi": "Hai vợ chồng sau đó định cư gần Bournemouth."
                    },
                    {
                        "en": "He has now settled permanently in London.",
                        "vi": "Hiện anh ấy đã định cư lâu dài ở London."
                    },
                    {
                        "en": "He married and settled in a seaside cottage.",
                        "vi": "Anh kết hôn và định cư trong một ngôi nhà nhỏ ven biển."
                    },
                    {
                        "en": "His parents eventually settled in Paris.",
                        "vi": "Cha mẹ anh cuối cùng định cư ở Paris."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your permanent home in a country or an area as colonists",
                    "vi": "để làm nhà lâu dài của bạn ở một quốc gia hoặc một khu vực là thuộc địa"
                },
                "examples": [
                    {
                        "en": "settle something This region was settled by the Dutch in the nineteenth century.",
                        "vi": "giải quyết một cái gì đó Khu vực này đã được định cư bởi người Hà Lan vào thế kỷ XIX."
                    },
                    {
                        "en": "a fertile area that was densely settled in early times",
                        "vi": "một khu vực màu mỡ đã được định cư đông đúc trong thời kỳ đầu"
                    },
                    {
                        "en": "settle + adv./prep. They settled on undeveloped land along the Mississippi.",
                        "vi": "giải quyết + adv./prep. Họ định cư trên vùng đất chưa phát triển dọc theo Mississippi."
                    },
                    {
                        "en": "It was the worst drought since the British settled in Australia in 1788.",
                        "vi": "Đây là đợt hạn hán tồi tệ nhất kể từ khi người Anh định cư ở Úc vào năm 1788."
                    },
                    {
                        "en": "Very few Maori were living in the area when the first Europeans settled there.",
                        "vi": "Rất ít người Maori sinh sống trong khu vực khi những người châu Âu đầu tiên đến định cư ở đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself or somebody else comfortable in a new position",
                    "vi": "để làm cho bản thân hoặc người khác cảm thấy thoải mái trong một vị trí mới"
                },
                "examples": [
                    {
                        "en": "settle (back) (+ adv./prep.) Ellie settled back in her seat.",
                        "vi": "giải quyết (trở lại) (+ adv./prep.) Ellie ổn định trở lại chỗ ngồi của mình."
                    },
                    {
                        "en": "They prepared to settle in for the night (= make themselves comfortable for an evening at home).",
                        "vi": "Họ đã chuẩn bị ổn định cho buổi tối (= làm cho bản thân thoải mái cho một buổi tối ở nhà)."
                    },
                    {
                        "en": "settle somebody/yourself (+ adv./prep.) He settled himself comfortably in his usual chair.",
                        "vi": "ổn định ai đó / chính bạn (+ adv./prep.) Anh ấy ngồi ổn định một cách thoải mái trên chiếc ghế quen thuộc của mình."
                    },
                    {
                        "en": "I settled her on the sofa and put a blanket over her.",
                        "vi": "Tôi đặt cô ấy trên ghế sofa và đắp chăn cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something carefully in a position so that it does not move",
                    "vi": "đặt một cái gì đó cẩn thận vào một vị trí để nó không di chuyển"
                },
                "examples": [
                    {
                        "en": "She settled the blanket around her knees.",
                        "vi": "Cô đắp chăn quanh đầu gối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or make somebody/something become calm or relaxed",
                    "vi": "trở thành hoặc làm cho ai đó / điều gì đó trở nên bình tĩnh hoặc thư thái"
                },
                "examples": [
                    {
                        "en": "The baby wouldn't settle.",
                        "vi": "Đứa bé sẽ không ổn định."
                    },
                    {
                        "en": "settle somebody/something I took a pill to help settle my nerves.",
                        "vi": "ổn định ai đó / điều gì đó Tôi đã uống một viên thuốc để giúp ổn định thần kinh của tôi."
                    },
                    {
                        "en": "This should settle your stomach.",
                        "vi": "Điều này sẽ làm ổn định dạ dày của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall from above and come to rest on something; to stay for some time on something",
                    "vi": "rơi từ trên cao và đến để nghỉ ngơi trên một cái gì đó; ở lại một thời gian cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Dust had settled on everything.",
                        "vi": "Bụi đã bám trên mọi thứ."
                    },
                    {
                        "en": "Two birds settled on the fence.",
                        "vi": "Hai con chim đậu trên hàng rào."
                    },
                    {
                        "en": "I don't think the snow will settle (= remain on the ground without melting).",
                        "vi": "Tôi không nghĩ tuyết sẽ đọng lại (= vẫn ở trên mặt đất mà không tan)."
                    },
                    {
                        "en": "His gaze settled on her face.",
                        "vi": "Ánh mắt anh dừng lại trên khuôn mặt cô."
                    },
                    {
                        "en": "Slowly dusk began to settle.",
                        "vi": "Chạng vạng từ từ bắt đầu lắng xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sink slowly down; to make something do this",
                    "vi": "chìm từ từ xuống; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "The contents of the package may have settled in transit.",
                        "vi": "Nội dung của gói hàng có thể đã được giải quyết trong quá trình vận chuyển."
                    },
                    {
                        "en": "Don't drink it yet. Let the grounds settle.",
                        "vi": "Đừng uống nó được nêu ra. Hãy để các cơ sở giải quyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay the money that you owe",
                    "vi": "để trả số tiền mà bạn nợ"
                },
                "examples": [
                    {
                        "en": "settle something Please settle your bill before leaving the hotel.",
                        "vi": "giải quyết một cái gì đó Vui lòng thanh toán hóa đơn của bạn trước khi rời khách sạn."
                    },
                    {
                        "en": "The insurance company is refusing to settle her claim.",
                        "vi": "Công ty bảo hiểm đang từ chối giải quyết yêu cầu bồi thường của cô ấy."
                    },
                    {
                        "en": "They used the last of the money to settle their debts.",
                        "vi": "Họ đã sử dụng số tiền cuối cùng để giải quyết các khoản nợ của mình."
                    },
                    {
                        "en": "settle (up) (with somebody) Let me settle with you for the meal.",
                        "vi": "giải quyết (lên) (với ai đó) Để tôi giải quyết với bạn về bữa ăn."
                    },
                    {
                        "en": "I'll pay now—we can settle up later.",
                        "vi": "Tôi sẽ thanh toán ngay bây giờ — chúng ta có thể giải quyết sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wait for a situation to become clear or certain",
                    "vi": "để chờ một tình huống trở nên rõ ràng hoặc chắc chắn"
                },
                "examples": [
                    {
                        "en": "He waited for the dust to settle after the election before making any new decisions.",
                        "vi": "Anh ấy đợi cho cát bụi lắng xuống sau cuộc bầu cử trước khi đưa ra bất kỳ quyết định mới nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurt or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm tổn thương hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": [
                    {
                        "en": "‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’",
                        "vi": "Ai sẽ làm một điều như vậy?' 'Có lẽ ai đó có số điểm cũ để giải quyết.'"
                    },
                    {
                        "en": "An embittered Charlotte is determined to settle accounts with Elizabeth.",
                        "vi": "Charlotte chán nản quyết tâm thanh toán các khoản với Elizabeth."
                    }
                ]
            }
        ]
    },
    {
        "id": "4eff1c823f244b6fb955c8621f8815e5",
        "word": "voucher",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvaʊtʃə(r)/",
            "us": "/ˈvaʊtʃər/"
        },
        "nearby": [
            {
                "word": "votive candle",
                "pos": "noun"
            },
            {
                "word": "vouch",
                "pos": "verb"
            },
            {
                "word": "voucher",
                "pos": "noun"
            },
            {
                "word": "vouch for",
                "pos": "phrasal verb"
            },
            {
                "word": "vouchsafe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a printed piece of paper or an electronic code that can be used instead of money to pay for something, or that allows you to pay less than the usual price of something",
                    "vi": "một mảnh giấy in hoặc một mã điện tử có thể được sử dụng thay vì tiền để trả cho một thứ gì đó hoặc cho phép bạn trả ít hơn giá thông thường của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a voucher for a free meal",
                        "vi": "một phiếu ăn uống miễn phí"
                    },
                    {
                        "en": "The company issues travel vouchers to all managers.",
                        "vi": "Công ty phát hành phiếu du lịch cho tất cả các quản lý."
                    },
                    {
                        "en": "This discount voucher entitles you to 10% off your next purchase.",
                        "vi": "Voucher giảm giá này cho phép bạn giảm giá 10% cho lần mua hàng tiếp theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "cfd438f272ef41acade24a75e502bb44",
        "word": "be in arrears",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈrɪəz/",
            "us": "/əˈrɪrz/"
        },
        "nearby": [
            {
                "word": "arrayed",
                "pos": "adjective"
            },
            {
                "word": "arré",
                "pos": "exclamation"
            },
            {
                "word": "arrears",
                "pos": "noun"
            },
            {
                "word": "arrest",
                "pos": "verb"
            },
            {
                "word": "arrest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that somebody owes that they have not paid at the right time",
                    "vi": "tiền mà ai đó nợ mà họ đã không trả đúng lúc"
                },
                "examples": [
                    {
                        "en": "rent/mortgage/tax arrears",
                        "vi": "tiền thuê / thế chấp / nợ thuế"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be late in paying money that you owe",
                    "vi": "chậm trả tiền mà bạn nợ"
                },
                "examples": [
                    {
                        "en": "We're two months in arrears with the rent.",
                        "vi": "Chúng tôi còn nợ hai tháng tiền thuê nhà."
                    },
                    {
                        "en": "Our tenants have fallen into arrears with their rent.",
                        "vi": "Những người thuê nhà của chúng tôi đã rơi vào tình trạng nợ tiền thuê nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "if money or a person is paid in arrears for work, the money is paid after the work has been done",
                    "vi": "nếu tiền hoặc một người được trả trước cho công việc, tiền sẽ được trả sau khi công việc đã hoàn thành"
                },
                "examples": [
                    {
                        "en": "You will be paid monthly in arrears.",
                        "vi": "Bạn sẽ được trả nợ hàng tháng."
                    }
                ]
            }
        ]
    },
    {
        "id": "bea872534978479bbbe9e6cb10a8f2b8",
        "word": "blank cheque",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌblæŋk ˈtʃek/",
            "us": "/ˌblæŋk ˈtʃek/"
        },
        "nearby": [
            {
                "word": "blank",
                "pos": "verb"
            },
            {
                "word": "blank call",
                "pos": "noun"
            },
            {
                "word": "blank cheque",
                "pos": "noun"
            },
            {
                "word": "blanket",
                "pos": "noun"
            },
            {
                "word": "blanket",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cheque that is signed but which does not have the amount of money to be paid written on it",
                    "vi": "séc có chữ ký nhưng không có số tiền phải trả được viết trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "permission or authority to do something that is necessary in a particular situation",
                    "vi": "sự cho phép hoặc quyền hạn để làm điều gì đó cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "The President was given a blank check by Congress to continue the war.",
                        "vi": "Tổng thống đã được Quốc hội trao cho một tấm séc trắng để tiếp tục cuộc chiến."
                    }
                ]
            }
        ]
    },
    {
        "id": "a7cd79ecfec647209d3e4124a09d8056",
        "word": "cash in hand",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kæʃ/",
            "us": "/kæʃ/"
        },
        "nearby": [
            {
                "word": "Casey at the Bat",
                "pos": ""
            },
            {
                "word": "Casey Jones",
                "pos": ""
            },
            {
                "word": "cash",
                "pos": "noun"
            },
            {
                "word": "Johnny Cash",
                "pos": ""
            },
            {
                "word": "cash",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money in the form of coins or notes",
                    "vi": "tiền dưới dạng tiền xu hoặc tiền giấy"
                },
                "examples": [
                    {
                        "en": "How much cash do you have on you?",
                        "vi": "Bạn có bao nhiêu tiền mặt?"
                    },
                    {
                        "en": "Customers are offered a 10% discount if they pay cash.",
                        "vi": "Khách hàng được chiết khấu 10% nếu thanh toán tiền mặt."
                    },
                    {
                        "en": "a cash payment",
                        "vi": "thanh toán bằng tiền mặt"
                    },
                    {
                        "en": "in cash Payments can be made by card or in cash.",
                        "vi": "bằng tiền mặt Thanh toán có thể được thực hiện bằng thẻ hoặc bằng tiền mặt."
                    },
                    {
                        "en": "The thieves stole £500 in cash.",
                        "vi": "Những tên trộm đã lấy trộm 500 bảng Anh tiền mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "money in any form",
                    "vi": "tiền dưới mọi hình thức"
                },
                "examples": [
                    {
                        "en": "The museum needs to find ways of raising cash.",
                        "vi": "Bảo tàng cần tìm cách huy động tiền mặt."
                    },
                    {
                        "en": "I'm short of cash right now.",
                        "vi": "Tôi đang thiếu tiền mặt ngay bây giờ."
                    },
                    {
                        "en": "I'm constantly strapped for cash (= without enough money).",
                        "vi": "Tôi liên tục thiếu tiền mặt (= không có đủ tiền)."
                    },
                    {
                        "en": "Local schools have been starved of cash for a number of years.",
                        "vi": "Các trường học địa phương đã thiếu tiền mặt trong một số năm."
                    },
                    {
                        "en": "The company is desperate for an injection of cash to ease its debts.",
                        "vi": "Công ty đang tuyệt vọng về việc bơm tiền mặt để giảm bớt các khoản nợ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "with immediate payment of cash",
                    "vi": "thanh toán ngay bằng tiền mặt"
                },
                "examples": [
                    {
                        "en": "to pay for something cash down",
                        "vi": "thanh toán cho một cái gì đó bằng tiền mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you pay for goods and services cash in hand, you pay in cash, especially so that the person being paid can avoid paying tax on the amount",
                    "vi": "nếu bạn thanh toán cho hàng hoá và dịch vụ bằng tiền mặt, bạn phải trả bằng tiền mặt, đặc biệt để người được thanh toán có thể tránh phải trả thuế cho số tiền"
                },
                "examples": [
                    {
                        "en": "a cash-in-hand payment of £20",
                        "vi": "một khoản thanh toán bằng tiền mặt trị giá £ 20"
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of paying for goods when they are delivered",
                    "vi": "một hệ thống thanh toán cho hàng hóa khi chúng được giao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c0de531e50e340a890b91b238cf5d2b5",
        "word": "in arrears",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈrɪəz/",
            "us": "/əˈrɪrz/"
        },
        "nearby": [
            {
                "word": "arrayed",
                "pos": "adjective"
            },
            {
                "word": "arré",
                "pos": "exclamation"
            },
            {
                "word": "arrears",
                "pos": "noun"
            },
            {
                "word": "arrest",
                "pos": "verb"
            },
            {
                "word": "arrest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that somebody owes that they have not paid at the right time",
                    "vi": "tiền mà ai đó nợ mà họ đã không trả đúng lúc"
                },
                "examples": [
                    {
                        "en": "rent/mortgage/tax arrears",
                        "vi": "tiền thuê / thế chấp / nợ thuế"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be late in paying money that you owe",
                    "vi": "chậm trả tiền mà bạn nợ"
                },
                "examples": [
                    {
                        "en": "We're two months in arrears with the rent.",
                        "vi": "Chúng tôi còn nợ hai tháng tiền thuê nhà."
                    },
                    {
                        "en": "Our tenants have fallen into arrears with their rent.",
                        "vi": "Những người thuê nhà của chúng tôi đã rơi vào tình trạng nợ tiền thuê nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "if money or a person is paid in arrears for work, the money is paid after the work has been done",
                    "vi": "nếu tiền hoặc một người được trả trước cho công việc, tiền sẽ được trả sau khi công việc đã hoàn thành"
                },
                "examples": [
                    {
                        "en": "You will be paid monthly in arrears.",
                        "vi": "Bạn sẽ được trả nợ hàng tháng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a59f2fc53c9d431c9108d946866dc133",
        "word": "instalment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈstɔːlmənt/",
            "us": "/ɪnˈstɔːlmənt/"
        },
        "nearby": [
            {
                "word": "installation",
                "pos": "noun"
            },
            {
                "word": "installment plan",
                "pos": "noun"
            },
            {
                "word": "instalment",
                "pos": "noun"
            },
            {
                "word": "instance",
                "pos": "noun"
            },
            {
                "word": "instance",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a number of payments that are made regularly over a period of time until something has been paid for",
                    "vi": "một trong số các khoản thanh toán được thực hiện thường xuyên trong một khoảng thời gian cho đến khi một khoản nào đó đã được thanh toán"
                },
                "examples": [
                    {
                        "en": "by/in instalments We paid for the car by/in instalments.",
                        "vi": "trả góp. Chúng tôi đã trả từng phần cho chiếc xe."
                    },
                    {
                        "en": "The final instalment on the loan is due next week.",
                        "vi": "Khoản vay cuối cùng sẽ đến hạn vào tuần tới."
                    },
                    {
                        "en": "The loan can be repaid in 24 monthly instalments.",
                        "vi": "Khoản vay có thể được trả góp trong 24 tháng."
                    },
                    {
                        "en": "They were unable to keep up (= continue to pay regularly) the instalments.",
                        "vi": "Họ không thể theo kịp (= tiếp tục thanh toán thường xuyên) các khoản trả góp."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the parts of a story that appears regularly over a period of time in a newspaper, on television, etc.",
                    "vi": "một trong những phần của câu chuyện xuất hiện thường xuyên trong một khoảng thời gian trên báo chí, truyền hình, v.v."
                },
                "examples": [
                    {
                        "en": "The ‘Screwtape Letters’ were published in instalments from May to November 1941.",
                        "vi": "Những bức thư kiểu vít' được xuất bản thành nhiều phần từ tháng 5 đến tháng 11 năm 1941."
                    },
                    {
                        "en": "Now for the second instalment of our exclusive three-part series.",
                        "vi": "Bây giờ là phần thứ hai của loạt ba phần độc quyền của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "e69aed02db3249bca10a62dc476e3e30",
        "word": "IOU",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaɪ əʊ ˈjuː/",
            "us": "/ˌaɪ əʊ ˈjuː/"
        },
        "nearby": [
            {
                "word": "IoT",
                "pos": "noun"
            },
            {
                "word": "iota",
                "pos": "noun"
            },
            {
                "word": "IOU",
                "pos": "noun"
            },
            {
                "word": "IOW",
                "pos": ""
            },
            {
                "word": "Iowa",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written promise that you will pay somebody the money you owe them (a way of writing ‘I owe you’)",
                    "vi": "một lời hứa bằng văn bản rằng bạn sẽ trả cho ai đó số tiền bạn nợ họ (một cách viết 'Tôi nợ bạn')"
                },
                "examples": [
                    {
                        "en": "an IOU for £100",
                        "vi": "một IOU với giá £ 100"
                    }
                ]
            }
        ]
    },
    {
        "id": "1f7407bdc3094f29861bb2c7fc7244fd",
        "word": "lump sum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlʌmp ˈsʌm/",
            "us": "/ˌlʌmp ˈsʌm/"
        },
        "nearby": [
            {
                "word": "lumpen",
                "pos": "adjective"
            },
            {
                "word": "lumpish",
                "pos": "adjective"
            },
            {
                "word": "lump sum",
                "pos": "noun"
            },
            {
                "word": "lumpy",
                "pos": "adjective"
            },
            {
                "word": "lunacy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that is paid at one time and not on separate occasions",
                    "vi": "một số tiền được thanh toán cùng một lúc và không phải vào các dịp riêng biệt"
                },
                "examples": [
                    {
                        "en": "She was given a lump sum when she retired.",
                        "vi": "Cô ấy đã được nhận một lần khi nghỉ hưu."
                    }
                ]
            }
        ]
    },
    {
        "id": "cfa44fdf0be1405cb8e70dcbf6045159",
        "word": "micropayment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊpeɪmənt/",
            "us": "/ˈmaɪkrəʊpeɪmənt/"
        },
        "nearby": [
            {
                "word": "microorganism",
                "pos": "noun"
            },
            {
                "word": "micro party",
                "pos": "noun"
            },
            {
                "word": "micropayment",
                "pos": "noun"
            },
            {
                "word": "microphone",
                "pos": "noun"
            },
            {
                "word": "microplastic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small payment that you make online, for example each time you use a particular page or service on the internet",
                    "vi": "một khoản thanh toán rất nhỏ mà bạn thực hiện trực tuyến, chẳng hạn như mỗi lần bạn sử dụng một trang hoặc dịch vụ cụ thể trên internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "710653dd4dcc41dda316c568d45aec17",
        "word": "overdue",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvəˈdjuː/",
            "us": "/ˌəʊvərˈduː/"
        },
        "nearby": [
            {
                "word": "overdrive",
                "pos": "noun"
            },
            {
                "word": "overdub",
                "pos": "verb"
            },
            {
                "word": "overdue",
                "pos": "adjective"
            },
            {
                "word": "over easy",
                "pos": "adjective"
            },
            {
                "word": "overeat",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not paid, done, returned, etc. by the required or expected time",
                    "vi": "không được thanh toán, thực hiện, trả lại, v.v. theo thời gian yêu cầu hoặc dự kiến"
                },
                "examples": [
                    {
                        "en": "an overdue payment/library book",
                        "vi": "thanh toán quá hạn / sách thư viện"
                    },
                    {
                        "en": "The rent is now overdue.",
                        "vi": "Tiền thuê nhà hiện đã quá hạn."
                    },
                    {
                        "en": "Her baby is two weeks overdue.",
                        "vi": "Em bé của cô ấy đã quá hạn hai tuần."
                    },
                    {
                        "en": "This car is overdue for a service.",
                        "vi": "Chiếc xe này đã quá hạn cho một dịch vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "that should have happened or been done before now",
                    "vi": "điều đó đáng lẽ đã xảy ra hoặc đã được thực hiện trước đây"
                },
                "examples": [
                    {
                        "en": "overdue reforms",
                        "vi": "cải cách quá hạn"
                    },
                    {
                        "en": "A book like this is long overdue.",
                        "vi": "Một cuốn sách như thế này đã quá hạn từ lâu."
                    }
                ]
            }
        ]
    },
    {
        "id": "69744f17bd9b4d6b95affb412a9837a2",
        "word": "overheads",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊvəhedz/",
            "us": "/ˈəʊvərhedz/"
        },
        "nearby": [
            {
                "word": "overhead",
                "pos": "noun"
            },
            {
                "word": "overhead projector",
                "pos": "noun"
            },
            {
                "word": "overheads",
                "pos": "noun"
            },
            {
                "word": "overhear",
                "pos": "verb"
            },
            {
                "word": "overheat",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "regular costs that you have when you are running a business or an organization, such as rent, electricity, wages, etc.",
                    "vi": "chi phí thường xuyên mà bạn có khi điều hành một doanh nghiệp hoặc một tổ chức, chẳng hạn như tiền thuê nhà, điện, tiền lương, v.v."
                },
                "examples": [
                    {
                        "en": "labour/​production costs",
                        "vi": "chi phí lao động / sản xuất"
                    },
                    {
                        "en": "rising costs",
                        "vi": "Chi phí tăng"
                    }
                ]
            }
        ]
    },
    {
        "id": "ff3da85cdb87464b987c942e504300f8",
        "word": "payable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪəbl/",
            "us": "/ˈpeɪəbl/"
        },
        "nearby": [
            {
                "word": "pay",
                "pos": "verb"
            },
            {
                "word": "pay",
                "pos": "noun"
            },
            {
                "word": "payable",
                "pos": "adjective"
            },
            {
                "word": "pay and display",
                "pos": "noun"
            },
            {
                "word": "pay as you earn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that must be paid or can be paid",
                    "vi": "cái đó phải trả hoặc có thể trả"
                },
                "examples": [
                    {
                        "en": "A 10 per cent deposit is payable in advance.",
                        "vi": "Phải trả trước 10% tiền đặt cọc."
                    },
                    {
                        "en": "The price is payable in monthly instalments.",
                        "vi": "Giá trả góp hàng tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a cheque, etc. is made payable to somebody, their name is written on it and they can then pay it into their bank account",
                    "vi": "khi séc, v.v. được trả cho ai đó, tên của họ được viết trên đó và sau đó họ có thể thanh toán vào tài khoản ngân hàng của mình"
                },
                "examples": [
                    {
                        "en": "Please make the cheque payable to Rose Roger.",
                        "vi": "Vui lòng thanh toán séc cho Rose Roger."
                    },
                    {
                        "en": "Include a check made payable to the Texas Department of Transportation.",
                        "vi": "Bao gồm séc được trả cho Bộ Giao thông Vận tải Texas."
                    }
                ]
            }
        ]
    },
    {
        "id": "225bacf583984057bdbed33566293be1",
        "word": "pay-as-you-go",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpeɪ əz jə ˈɡəʊ/",
            "us": "/ˌpeɪ əz jə ˈɡəʊ/"
        },
        "nearby": [
            {
                "word": "pay and display",
                "pos": "noun"
            },
            {
                "word": "pay as you earn",
                "pos": "noun"
            },
            {
                "word": "pay-as-you-go",
                "pos": "adjective"
            },
            {
                "word": "pay back",
                "pos": "phrasal verb"
            },
            {
                "word": "payback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a system of paying for a service just before you use it rather than paying for it later",
                    "vi": "được kết nối với một hệ thống thanh toán cho một dịch vụ ngay trước khi bạn sử dụng nó thay vì trả tiền cho nó sau này"
                },
                "examples": [
                    {
                        "en": "pay-as-you-go phones",
                        "vi": "điện thoại trả tiền khi di chuyển"
                    }
                ]
            }
        ]
    },
    {
        "id": "b38192ff04164ef9a67b3a8b6d9d8c33",
        "word": "pay up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "pay stub",
                "pos": "noun"
            },
            {
                "word": "pay TV",
                "pos": "noun"
            },
            {
                "word": "pay up",
                "pos": "phrasal verb"
            },
            {
                "word": "paywall",
                "pos": "noun"
            },
            {
                "word": "PB",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay all the money that you owe to somebody, especially when you do not want to or when the payment is late",
                    "vi": "để trả tất cả số tiền mà bạn nợ ai đó, đặc biệt là khi bạn không muốn hoặc khi thanh toán chậm"
                },
                "examples": [
                    {
                        "en": "I had a hard time getting him to pay up.",
                        "vi": "Tôi đã rất khó khăn để bắt anh ta trả tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "c1aad72d24874365875efd645e7e8b99",
        "word": "top-up",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒp ʌp/",
            "us": "/ˈtɑːp ʌp/"
        },
        "nearby": [
            {
                "word": "top ten",
                "pos": "noun"
            },
            {
                "word": "top up",
                "pos": "phrasal verb"
            },
            {
                "word": "top-up",
                "pos": "noun"
            },
            {
                "word": "top-up card",
                "pos": "noun"
            },
            {
                "word": "toque",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a payment that you make to increase the amount of money, etc. to the level that is needed",
                    "vi": "một khoản thanh toán mà bạn thực hiện để tăng số tiền, v.v. đến mức cần thiết"
                },
                "examples": [
                    {
                        "en": "a phone top-up (= to buy more time for calls)",
                        "vi": "nạp tiền điện thoại (= để có thêm thời gian cho các cuộc gọi)"
                    },
                    {
                        "en": "Students will have to pay top-up fees (= fees that are above the basic level).",
                        "vi": "Học sinh sẽ phải trả phí đầu vào (= phí trên mức cơ bản)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of a drink that you add to a cup or glass in order to fill it again",
                    "vi": "một lượng đồ uống mà bạn thêm vào cốc hoặc ly để làm đầy lại"
                },
                "examples": [
                    {
                        "en": "Can I give anyone a top-up?",
                        "vi": "Tôi có thể nạp tiền cho ai không?"
                    }
                ]
            }
        ]
    }
]