[
    {
        "id": "edf293d41d654b53afcfaf0c96670ca0",
        "word": "castle",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkɑːsl/",
            "us": "/ˈkæsl/"
        },
        "nearby": [
            {
                "word": "cast iron",
                "pos": "noun"
            },
            {
                "word": "cast-iron",
                "pos": "adjective"
            },
            {
                "word": "castle",
                "pos": "noun"
            },
            {
                "word": "Barbara Castle",
                "pos": ""
            },
            {
                "word": "Castle Howard",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large strong building with thick, high walls and towers, built in the past by kings or queens, or other important people, to defend themselves against attack",
                    "vi": "một tòa nhà lớn kiên cố với những bức tường và tháp cao, dày, được xây dựng trong quá khứ bởi các vị vua hoặc hoàng hậu, hoặc những người quan trọng khác, để tự vệ trước sự tấn công"
                },
                "examples": [
                    {
                        "en": "a medieval castle",
                        "vi": "một lâu đài thời trung cổ"
                    },
                    {
                        "en": "Windsor Castle",
                        "vi": "Lâu đài Windsor"
                    },
                    {
                        "en": "in/at the castle They were invited to a banquet in the castle.",
                        "vi": "trong / tại lâu đài Họ được mời đến một bữa tiệc trong lâu đài."
                    },
                    {
                        "en": "They sought safety within the castle walls.",
                        "vi": "Họ tìm kiếm sự an toàn trong các bức tường lâu đài."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four pieces placed in the corner squares of the board at the start of the game, usually made to look like a castle",
                    "vi": "bất kỳ quân nào trong số bốn quân cờ được đặt trong các ô vuông góc của bàn cờ khi bắt đầu trò chơi, thường được làm để trông giống như một lâu đài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to have) plans or dreams that are not likely to happen or come true",
                    "vi": "(có) kế hoạch hoặc ước mơ không có khả năng xảy ra hoặc trở thành hiện thực"
                },
                "examples": [
                    {
                        "en": "As a child he would wander round the boatyards, building castles in the air about owning a boat one day.",
                        "vi": "Khi còn là một đứa trẻ, ông thường đi lang thang quanh các xưởng đóng thuyền, xây dựng các lâu đài trên không trung và sở hữu một chiếc thuyền vào một ngày nào đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s home is a place where they can be private and safe and do as they like",
                    "vi": "nhà của một người là nơi mà họ có thể riêng tư và an toàn và làm theo ý thích của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e16695d5e0e8431d897cfd251fa811ca",
        "word": "palace",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈpæləs/",
            "us": "/ˈpæləs/"
        },
        "nearby": [
            {
                "word": "PAL",
                "pos": "noun"
            },
            {
                "word": "Pal",
                "pos": "noun"
            },
            {
                "word": "palace",
                "pos": "noun"
            },
            {
                "word": "palace coup",
                "pos": "noun"
            },
            {
                "word": "the Palace of Westminster",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official home of a king, queen, president, etc.",
                    "vi": "nhà chính thức của vua, hoàng hậu, tổng thống, v.v."
                },
                "examples": [
                    {
                        "en": "Buckingham Palace",
                        "vi": "cung điện Buckingham"
                    },
                    {
                        "en": "the royal/presidential palace",
                        "vi": "dinh thự hoàng gia / tổng thống"
                    },
                    {
                        "en": "He spent his early days at the Palace of Versailles.",
                        "vi": "Ông đã dành những ngày đầu tiên của mình tại Cung điện Versailles."
                    },
                    {
                        "en": "the palace gates/grounds/walls",
                        "vi": "cổng / sân / tường cung điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of referring to the people who live or work in a palace, especially the British royal family and their advisers",
                    "vi": "một cách đề cập đến những người sống hoặc làm việc trong cung điện, đặc biệt là hoàng gia Anh và các cố vấn của họ"
                },
                "examples": [
                    {
                        "en": "The Palace last night refused to comment on the reports.",
                        "vi": "Cung điện đêm qua từ chối bình luận về các báo cáo."
                    },
                    {
                        "en": "a Palace spokesman",
                        "vi": "một phát ngôn viên của Cung điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "any large impressive house",
                    "vi": "bất kỳ ngôi nhà lớn ấn tượng"
                },
                "examples": [
                    {
                        "en": "The Old Town has a whole collection of churches, palaces and mosques.",
                        "vi": "Old Town có một bộ sưu tập toàn bộ các nhà thờ, cung điện và nhà thờ Hồi giáo."
                    },
                    {
                        "en": "Even this small house was a veritable palace compared to his tent.",
                        "vi": "Ngay cả ngôi nhà nhỏ này cũng là một cung điện thực sự so với căn lều của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large public building, such as a hotel or cinema",
                    "vi": "một tòa nhà công cộng lớn, chẳng hạn như khách sạn hoặc rạp chiếu phim"
                },
                "examples": [
                    {
                        "en": "the Strand Palace Hotel",
                        "vi": "khách sạn Strand Palace"
                    }
                ]
            }
        ]
    },
    {
        "id": "651b194e89b244a4b9dc9ee2d5fdb72e",
        "word": "costume",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɒstjuːm/",
            "us": "/ˈkɑːstuːm/"
        },
        "nearby": [
            {
                "word": "the cost of living",
                "pos": "noun"
            },
            {
                "word": "cost price",
                "pos": "noun"
            },
            {
                "word": "costume",
                "pos": "noun"
            },
            {
                "word": "costumed",
                "pos": "adjective"
            },
            {
                "word": "costume drama",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the clothes worn by people from a particular place or during a particular historical period",
                    "vi": "quần áo được mặc bởi những người từ một địa điểm cụ thể hoặc trong một giai đoạn lịch sử cụ thể"
                },
                "examples": [
                    {
                        "en": "an exhibition of Victorian costumes",
                        "vi": "triển lãm trang phục thời Victoria"
                    },
                    {
                        "en": "She wore a traditional costume of bright pink silk.",
                        "vi": "Cô diện trang phục truyền thống lụa hồng rực rỡ."
                    },
                    {
                        "en": "in… costume a painting of an old woman in Welsh costume",
                        "vi": "trong… trang phục một bức tranh vẽ một bà già trong trang phục xứ Wales"
                    },
                    {
                        "en": "Many locals dressed in period costume (= typical of a particular time in history) for the celebrations.",
                        "vi": "Nhiều người dân địa phương mặc trang phục thời kỳ (= điển hình của một thời điểm cụ thể trong lịch sử) cho lễ kỷ niệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the clothes worn by actors in a play or film, or worn by somebody to make them look like somebody/something else",
                    "vi": "quần áo của các diễn viên mặc trong một vở kịch hoặc bộ phim hoặc được ai đó mặc để khiến họ trông giống ai đó / thứ gì đó khác"
                },
                "examples": [
                    {
                        "en": "The former dancer has also designed the costumes.",
                        "vi": "Cựu vũ công cũng đã thiết kế trang phục."
                    },
                    {
                        "en": "The costumes for this production were gorgeous.",
                        "vi": "Trang phục cho sản xuất này rất lộng lẫy."
                    },
                    {
                        "en": "They are already planning their costumes for Halloween.",
                        "vi": "Họ đã lên kế hoạch trang phục cho Halloween."
                    },
                    {
                        "en": "in a costume He went to the party in a giant chicken costume.",
                        "vi": "trong một bộ trang phục. Anh ấy đến bữa tiệc trong một bộ trang phục con gà khổng lồ."
                    },
                    {
                        "en": "in costume The actors were still in costume and make-up.",
                        "vi": "trong trang phục Các diễn viên vẫn mặc trang phục và trang điểm."
                    },
                    {
                        "en": "She has four costume changes during the play.",
                        "vi": "Cô ấy có bốn lần thay đổi trang phục trong suốt vở kịch."
                    },
                    {
                        "en": "a costume designer",
                        "vi": "một nhà thiết kế trang phục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing worn for swimming, especially the type worn by women and girls",
                    "vi": "một bộ quần áo mặc khi đi bơi, đặc biệt là loại quần áo của phụ nữ và trẻ em gái"
                },
                "examples": [
                    {
                        "en": "If you’d like a swim, we can lend you a costume.",
                        "vi": "Nếu bạn muốn bơi, chúng tôi có thể cho bạn mượn trang phục."
                    }
                ]
            }
        ]
    },
    {
        "id": "098207fbb1a04f66a837afd929c7d454",
        "word": "abbey",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈæbi/",
            "us": "/ˈæbi/"
        },
        "nearby": [
            {
                "word": "abba",
                "pos": "noun"
            },
            {
                "word": "abbess",
                "pos": "noun"
            },
            {
                "word": "abbey",
                "pos": "noun"
            },
            {
                "word": "Abbie",
                "pos": ""
            },
            {
                "word": "abbot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large church together with a group of buildings in which monks or nuns live or lived in the past",
                    "vi": "một nhà thờ lớn cùng với một nhóm các tòa nhà trong đó các tu sĩ hoặc nữ tu sĩ sống hoặc đã sống trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Westminster Abbey",
                        "vi": "Tu viện Westminster"
                    },
                    {
                        "en": "a ruined abbey",
                        "vi": "một tu viện đổ nát"
                    }
                ]
            }
        ]
    },
    {
        "id": "604a8c3b95fc40a5b1146a55e2207310",
        "word": "arrow",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈærəʊ/",
            "us": "/ˈærəʊ/"
        },
        "nearby": [
            {
                "word": "arrogantly",
                "pos": "adverb"
            },
            {
                "word": "arrogate",
                "pos": "verb"
            },
            {
                "word": "arrow",
                "pos": "noun"
            },
            {
                "word": "arrowhead",
                "pos": "noun"
            },
            {
                "word": "arrowroot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin stick with a sharp point at one end, which is shot from a bow",
                    "vi": "một cây gậy mỏng với một đầu nhọn ở một đầu, được bắn từ một cây cung"
                },
                "examples": [
                    {
                        "en": "a bow and arrow",
                        "vi": "một cái cung tên và mũi tên"
                    },
                    {
                        "en": "to fire/shoot an arrow",
                        "vi": "bắn / bắn một mũi tên"
                    },
                    {
                        "en": "The road continues as straight as an arrow.",
                        "vi": "Con đường tiếp tục thẳng như một mũi tên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark or sign like an arrow (➞), used to show direction or position",
                    "vi": "một dấu hoặc dấu hiệu giống như mũi tên (➞), được sử dụng để chỉ hướng hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "Follow the arrows.",
                        "vi": "Theo các mũi tên."
                    },
                    {
                        "en": "Use the arrow keys to move the cursor.",
                        "vi": "Sử dụng các phím mũi tên để di chuyển con trỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "14c5d460db0b4c30be588c39c4e19b70",
        "word": "exhibit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪɡˈzɪbɪt/",
            "us": "/ɪɡˈzɪbɪt/"
        },
        "nearby": [
            {
                "word": "exhaust pipe",
                "pos": "noun"
            },
            {
                "word": "exhibit",
                "pos": "verb"
            },
            {
                "word": "exhibit",
                "pos": "noun"
            },
            {
                "word": "exhibition",
                "pos": "noun"
            },
            {
                "word": "exhibitionism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object or a collection of objects put in a public place, for example a museum, so that people can see it",
                    "vi": "một đồ vật hoặc một bộ sưu tập đồ vật được đặt ở nơi công cộng, ví dụ như bảo tàng để mọi người có thể nhìn thấy nó"
                },
                "examples": [
                    {
                        "en": "The museum contains some interesting exhibits on Spanish rural life.",
                        "vi": "Bảo tàng có một số cuộc triển lãm thú vị về cuộc sống nông thôn Tây Ban Nha."
                    }
                ]
            },
            {
                "define": {
                    "en": "a collection of things, for example works of art, that are shown to the public",
                    "vi": "một bộ sưu tập những thứ, ví dụ như tác phẩm nghệ thuật, được giới thiệu cho công chúng"
                },
                "examples": [
                    {
                        "en": "The new exhibit will tour a dozen US cities next year.",
                        "vi": "Triển lãm mới sẽ tham quan hàng chục thành phố của Hoa Kỳ vào năm tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is used in court to prove that somebody is guilty or not guilty",
                    "vi": "một thứ được sử dụng tại tòa án để chứng minh rằng ai đó có tội hoặc không có tội"
                },
                "examples": [
                    {
                        "en": "The first exhibit was a knife which the prosecution claimed was the murder weapon.",
                        "vi": "Tang vật đầu tiên là một con dao mà bên công tố cho là hung khí giết người."
                    }
                ]
            }
        ]
    },
    {
        "id": "aa0ad2cf626b48538423d993ffee858c",
        "word": "monument",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒnjumənt/",
            "us": "/ˈmɑːnjumənt/"
        },
        "nearby": [
            {
                "word": "monty",
                "pos": "noun"
            },
            {
                "word": "Monty Python's Flying Circus",
                "pos": ""
            },
            {
                "word": "monument",
                "pos": "noun"
            },
            {
                "word": "the Monument",
                "pos": ""
            },
            {
                "word": "monumental",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building, column, statue, etc. built to remind people of a famous person or event",
                    "vi": "một tòa nhà, cột, tượng, v.v. được xây dựng để nhắc nhở mọi người về một nhân vật hoặc sự kiện nổi tiếng"
                },
                "examples": [
                    {
                        "en": "A monument to him was erected in St Paul's Cathedral.",
                        "vi": "Một tượng đài cho ông đã được dựng lên trong Nhà thờ St Paul."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building that has special historical importance",
                    "vi": "một tòa nhà có tầm quan trọng lịch sử đặc biệt"
                },
                "examples": [
                    {
                        "en": "an ancient monument",
                        "vi": "một di tích cổ đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that remains as a good example of somebody’s qualities or of what they did",
                    "vi": "một điều vẫn là một ví dụ điển hình về phẩm chất của ai đó hoặc về những gì họ đã làm"
                },
                "examples": [
                    {
                        "en": "These recordings are a monument to his talent as a pianist.",
                        "vi": "Những bản thu âm này là một tượng đài cho tài năng của anh ấy như một nghệ sĩ piano."
                    }
                ]
            }
        ]
    },
    {
        "id": "b4c4cd7eca9549539b7feee78d65e584",
        "word": "pyramid",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpɪrəmɪd/",
            "us": "/ˈpɪrəmɪd/"
        },
        "nearby": [
            {
                "word": "John Pym",
                "pos": ""
            },
            {
                "word": "pyorrhoea",
                "pos": "noun"
            },
            {
                "word": "pyramid",
                "pos": "noun"
            },
            {
                "word": "pyramidal",
                "pos": "adjective"
            },
            {
                "word": "pyramid scheme",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building with a square or triangular base and sloping sides that meet in a point at the top. The ancient Egyptians built stone pyramids as places to bury their kings and queens.",
                    "vi": "một tòa nhà lớn có nền hình vuông hoặc hình tam giác và các mặt dốc gặp nhau tại một điểm ở trên cùng. Người Ai Cập cổ đại đã xây dựng các kim tự tháp bằng đá để làm nơi chôn cất các vị vua và hoàng hậu của họ."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a solid shape with a square or triangular base and sloping sides that meet in a point at the top",
                    "vi": "một hình dạng vững chắc có đáy là hình vuông hoặc hình tam giác và các mặt dốc gặp nhau tại một điểm ở trên cùng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an object or a pile of things that has the shape of a pyramid",
                    "vi": "một đồ vật hoặc một đống đồ vật có hình dạng của một kim tự tháp"
                },
                "examples": [
                    {
                        "en": "a pyramid of cans in a shop window",
                        "vi": "một kim tự tháp của lon trong cửa sổ cửa hàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a system in which there are fewer people at each level as you get near the top",
                    "vi": "một tổ chức hoặc một hệ thống trong đó có ít người hơn ở mỗi cấp khi bạn lên gần đỉnh"
                },
                "examples": [
                    {
                        "en": "a management pyramid",
                        "vi": "một kim tự tháp quản lý"
                    }
                ]
            }
        ]
    },
    {
        "id": "d01399d5a5bb4d9fb0910466104e6262",
        "word": "ruin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈruːɪn/",
            "us": "/ˈruːɪn/"
        },
        "nearby": [
            {
                "word": "rug rat",
                "pos": "noun"
            },
            {
                "word": "ruin",
                "pos": "verb"
            },
            {
                "word": "ruin",
                "pos": "noun"
            },
            {
                "word": "ruination",
                "pos": "noun"
            },
            {
                "word": "ruined",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state or process of being destroyed or severely damaged",
                    "vi": "trạng thái hoặc quá trình bị phá hủy hoặc bị hư hỏng nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "A large number of churches fell into ruin after the revolution.",
                        "vi": "Một số lượng lớn các nhà thờ rơi vào cảnh đổ nát sau cuộc cách mạng."
                    },
                    {
                        "en": "The house had been left to go to ruin.",
                        "vi": "Ngôi nhà đã bị bỏ lại để trở thành đống đổ nát."
                    },
                    {
                        "en": "The terrorist attack had left the city in a state of ruin",
                        "vi": "Cuộc tấn công khủng bố đã khiến thành phố rơi vào tình trạng hoang tàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the parts of a building that remain after it has been destroyed or severely damaged",
                    "vi": "các phần của một tòa nhà vẫn còn sau khi nó đã bị phá hủy hoặc bị hư hại nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "The old mill is now little more than a ruin.",
                        "vi": "Nhà máy cũ bây giờ không còn là một đống đổ nát."
                    },
                    {
                        "en": "We visited the ruins of a Norman castle.",
                        "vi": "Chúng tôi đã đến thăm tàn tích của một lâu đài Norman."
                    },
                    {
                        "en": "Two bodies were found among the charred ruins of the house.",
                        "vi": "Hai thi thể được tìm thấy giữa đống đổ nát của ngôi nhà."
                    },
                    {
                        "en": "(figurative) He was determined to build a new life out of the ruins of his career.",
                        "vi": "(nghĩa bóng) Anh quyết tâm xây dựng cuộc sống mới từ đống đổ nát của sự nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of having no money, of having lost your job, position, etc.",
                    "vi": "thực tế là không có tiền, bị mất công việc, chức vụ, v.v."
                },
                "examples": [
                    {
                        "en": "The divorce ultimately led to his ruin.",
                        "vi": "Cuộc ly hôn cuối cùng đã dẫn đến sự hủy hoại của anh ta."
                    },
                    {
                        "en": "The bank stepped in to save the company from financial ruin.",
                        "vi": "Ngân hàng đã vào cuộc để cứu công ty khỏi sự điêu tàn về tài chính."
                    },
                    {
                        "en": "The war brought the country to the brink of ruin.",
                        "vi": "Chiến tranh đã đưa đất nước đến bờ vực hoang tàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that causes a person, company, etc. to lose all their money, job, position, etc.",
                    "vi": "điều gì đó khiến một người, công ty, v.v. mất hết tiền bạc, công việc, chức vụ, v.v."
                },
                "examples": [
                    {
                        "en": "Gambling was his ruin.",
                        "vi": "Cờ bạc là tàn tích của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get into a bad condition",
                    "vi": "rơi vào tình trạng tồi tệ"
                },
                "examples": [
                    {
                        "en": "They let the house go to rack and ruin.",
                        "vi": "Họ để cho ngôi nhà lên giá và đổ nát."
                    }
                ]
            },
            {
                "define": {
                    "en": "destroyed or severely damaged",
                    "vi": "bị phá hủy hoặc bị hư hại nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "Years of fighting have left the area in ruins.",
                        "vi": "Nhiều năm chiến đấu đã khiến khu vực này trở nên hoang tàn."
                    },
                    {
                        "en": "The church now lies in ruins.",
                        "vi": "Nhà thờ bây giờ nằm trong đống đổ nát."
                    },
                    {
                        "en": "The scandal left his reputation in ruins.",
                        "vi": "Vụ bê bối khiến danh tiếng của anh bị hủy hoại."
                    },
                    {
                        "en": "Their plans for a comeback now lie in ruins.",
                        "vi": "Kế hoạch trở lại của họ giờ tan thành mây khói."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9e720aa6d554703916a57a2923f868b",
        "word": "armour",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɑːmə(r)/",
            "us": "/ˈɑːrmər/"
        },
        "nearby": [
            {
                "word": "armorial",
                "pos": "adjective"
            },
            {
                "word": "armor-plated",
                "pos": "adjective"
            },
            {
                "word": "armour",
                "pos": "noun"
            },
            {
                "word": "armoured",
                "pos": "adjective"
            },
            {
                "word": "armoured personnel carrier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "special metal clothing that soldiers wore in the past to protect their bodies while fighting; special clothing that soldiers or police officers wear to protect their bodies",
                    "vi": "quần áo kim loại đặc biệt mà những người lính mặc trong quá khứ để bảo vệ cơ thể của họ khi chiến đấu; quần áo đặc biệt mà binh lính hoặc sĩ quan cảnh sát mặc để bảo vệ cơ thể của họ"
                },
                "examples": [
                    {
                        "en": "a suit of armour",
                        "vi": "một bộ áo giáp"
                    },
                    {
                        "en": "police officers in full body armour",
                        "vi": "cảnh sát mặc áo giáp toàn thân"
                    },
                    {
                        "en": "(figurative) Monkeys do not have any kind of protective armour and use their brains to solve problems.",
                        "vi": "(nghĩa bóng) Khỉ không có bất kỳ loại áo giáp bảo vệ nào và sử dụng bộ não của chúng để giải quyết vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "metal covers that protect ships and military vehicles such as tanks",
                    "vi": "vỏ kim loại bảo vệ tàu và các phương tiện quân sự như xe tăng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "military vehicles used in war",
                    "vi": "xe quân sự dùng trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "an attack by infantry and armour",
                        "vi": "một cuộc tấn công của bộ binh và thiết giáp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a weak point in somebody’s argument, character, etc., that can be used in an attack",
                    "vi": "một điểm yếu trong lập luận, nhân vật, v.v. của ai đó, có thể được sử dụng trong một cuộc tấn công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who saves somebody, especially a woman, from a dangerous situation",
                    "vi": "một người đàn ông cứu ai đó, đặc biệt là một người phụ nữ, khỏi một tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "She's still waiting for a knight in shining armour to come and rescue her.",
                        "vi": "Cô ấy vẫn đang chờ một hiệp sĩ trong bộ giáp sáng chói đến và giải cứu cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "9507beb0ede64b388b5c0fd4e369b256",
        "word": "bath",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bɑːθ/",
            "us": "/bæθ/"
        },
        "nearby": [
            {
                "word": "Norman Bates",
                "pos": ""
            },
            {
                "word": "batgirl",
                "pos": "noun"
            },
            {
                "word": "bath",
                "pos": "noun"
            },
            {
                "word": "bath",
                "pos": "verb"
            },
            {
                "word": "Bath",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large, long container that you put water in and then get into to wash your whole body",
                    "vi": "một cái thùng lớn và dài mà bạn cho nước vào rồi lấy nước đó để rửa toàn bộ cơ thể"
                },
                "examples": [
                    {
                        "en": "I'm in the bath!",
                        "vi": "Tôi ở trong bôn tăm!"
                    },
                    {
                        "en": "bath taps",
                        "vi": "vòi tắm"
                    },
                    {
                        "en": "a bath with shower attachment",
                        "vi": "một bồn tắm với vòi hoa sen đính kèm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of washing your whole body by sitting or lying in water",
                    "vi": "một hành động rửa toàn bộ cơ thể của bạn bằng cách ngồi hoặc nằm trong nước"
                },
                "examples": [
                    {
                        "en": "(British English) I think I'll have a bath and go to bed.",
                        "vi": "(Anh Anh) Tôi nghĩ tôi sẽ đi tắm và đi ngủ."
                    },
                    {
                        "en": "(especially North American English) to take a bath",
                        "vi": "(đặc biệt là người Anh ở Bắc Mỹ) đi tắm"
                    },
                    {
                        "en": "She took the baby upstairs to give him a bath.",
                        "vi": "Cô bế đứa bé lên gác để tắm cho nó."
                    },
                    {
                        "en": "It's the children's bath time.",
                        "vi": "Đã đến giờ tắm của bọn trẻ."
                    },
                    {
                        "en": "When she got home she decided she needed a bath.",
                        "vi": "Khi về đến nhà, cô quyết định mình cần đi tắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the water in a bath ready to use",
                    "vi": "nước trong bồn tắm đã sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "a long soak in a hot bath",
                        "vi": "ngâm mình lâu trong bồn tắm nước nóng"
                    },
                    {
                        "en": "Please run a bath for me (= fill the bath with water).",
                        "vi": "Please run a bath for me (= đổ đầy nước vào bồn tắm)."
                    },
                    {
                        "en": "I lay soaking in a hot bubble bath.",
                        "vi": "Tôi nằm ngâm mình trong bồn nước nóng đầy bọt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public building where you can go to swim",
                    "vi": "một tòa nhà công cộng nơi bạn có thể đi bơi"
                },
                "examples": [
                    {
                        "en": "My father took me to the baths every Sunday.",
                        "vi": "Cha tôi đưa tôi đi tắm vào Chủ nhật hàng tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public place where people went in the past to wash or have a bath",
                    "vi": "một nơi công cộng mà trước đây mọi người đã đến để tắm rửa hoặc tắm rửa"
                },
                "examples": [
                    {
                        "en": "Roman villas and baths",
                        "vi": "Biệt thự La Mã và nhà tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a container with a liquid such as water or a dye in it, in which something is washed or placed for a period of time. Baths are used in industrial, chemical and medical processes.",
                    "vi": "một vật chứa có chất lỏng như nước hoặc thuốc nhuộm, trong đó một thứ gì đó được rửa hoặc đặt trong một khoảng thời gian. Bồn tắm được sử dụng trong các quy trình công nghiệp, hóa chất và y tế."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to lose money on a business agreement",
                    "vi": "mất tiền trong một thỏa thuận kinh doanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31ee3c5a39e14df7ad0f5743e3d8b8f8",
        "word": "bow",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/bəʊ/",
            "us": "/bəʊ/"
        },
        "nearby": [
            {
                "word": "bow1",
                "pos": "verb"
            },
            {
                "word": "bow1",
                "pos": "noun"
            },
            {
                "word": "bow2",
                "pos": "noun"
            },
            {
                "word": "bow2",
                "pos": "verb"
            },
            {
                "word": "Clara Bow",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a weapon used for shooting arrows, consisting of a long curved piece of wood or metal with a tight string joining its ends",
                    "vi": "một vũ khí được sử dụng để bắn tên, bao gồm một mảnh gỗ hoặc kim loại dài cong với một sợi dây chặt chẽ nối các đầu của nó"
                },
                "examples": [
                    {
                        "en": "He was armed with a bow and arrow.",
                        "vi": "Anh ta được trang bị cung tên."
                    },
                    {
                        "en": "She drew and aimed her bow.",
                        "vi": "Cô ấy vẽ và nhắm vào cây cung của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a knot with two loops and two loose ends which is used for decoration on clothes, in hair, etc. or for tying shoes",
                    "vi": "một nút thắt với hai vòng và hai đầu rời dùng để trang trí trên quần áo, trên tóc, v.v. hoặc để buộc giày"
                },
                "examples": [
                    {
                        "en": "to tie your shoelaces in a bow",
                        "vi": "buộc dây giày của bạn trong một chiếc nơ"
                    },
                    {
                        "en": "Her hair was tied back in a neat bow.",
                        "vi": "Tóc cô được buộc lại thành một chiếc nơ gọn gàng."
                    },
                    {
                        "en": "a dress decorated with bows and ribbons",
                        "vi": "một chiếc váy được trang trí bằng nơ và ruy băng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long thin piece of wood with thin string stretched along it, used for playing musical instruments such as the violin",
                    "vi": "một miếng gỗ mỏng dài với dây mảnh kéo dài dọc theo nó, được sử dụng để chơi các nhạc cụ như đàn vi-ô-lông"
                },
                "examples": [
                    {
                        "en": "She drew the bow across the strings.",
                        "vi": "Cô vẽ chiếc nơ trên dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have more than one skill or plan that you can use if you need to",
                    "vi": "có nhiều kỹ năng hoặc kế hoạch mà bạn có thể sử dụng nếu cần"
                },
                "examples": [
                    {
                        "en": "The exhibition shows that he has other strings to his artistic bow.",
                        "vi": "Triển lãm cho thấy anh ấy có những sợi dây khác với cung nghệ thuật của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "1127a9a260694778a6898557c7b13bef",
        "word": "cannon",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkænən/",
            "us": "/ˈkænən/"
        },
        "nearby": [
            {
                "word": "cannily",
                "pos": "adverb"
            },
            {
                "word": "George Canning",
                "pos": ""
            },
            {
                "word": "cannon",
                "pos": "noun"
            },
            {
                "word": "cannon",
                "pos": "verb"
            },
            {
                "word": "cannonade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old type of large, heavy gun, usually on wheels, that fires solid metal or stone balls",
                    "vi": "một loại súng lớn, hạng nặng cũ, thường có bánh xe, bắn ra kim loại rắn hoặc bi đá"
                },
                "examples": [
                    {
                        "en": "Three cannon opened fire.",
                        "vi": "Ba phát đại bác nổ súng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a gun that fires many shots from an aircraft or tank",
                    "vi": "một khẩu súng bắn nhiều phát từ máy bay hoặc xe tăng"
                },
                "examples": [
                    {
                        "en": "a burst of cannon fire",
                        "vi": "một loạt pháo"
                    }
                ]
            }
        ]
    },
    {
        "id": "3bd27bec7a7e418da81e1d562964b792",
        "word": "carriage",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkærɪdʒ/",
            "us": "/ˈkærɪdʒ/"
        },
        "nearby": [
            {
                "word": "carport",
                "pos": "noun"
            },
            {
                "word": "carrel",
                "pos": "noun"
            },
            {
                "word": "carriage",
                "pos": "noun"
            },
            {
                "word": "carriage clock",
                "pos": "noun"
            },
            {
                "word": "carriage house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a separate section of a train for carrying passengers",
                    "vi": "một phần riêng biệt của một đoàn tàu để chở hành khách"
                },
                "examples": [
                    {
                        "en": "a railway carriage",
                        "vi": "một toa xe lửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a road vehicle, usually with four wheels, that is pulled by one or more horses and was used in the past to carry people",
                    "vi": "phương tiện giao thông đường bộ, thường có bốn bánh, được kéo bởi một hoặc nhiều con ngựa và được sử dụng để chở người trong quá khứ."
                },
                "examples": [
                    {
                        "en": "a horse-drawn carriage",
                        "vi": "xe ngựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or cost of transporting goods from one place to another",
                    "vi": "hành động hoặc chi phí vận chuyển hàng hóa từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "£16.95 including VAT and carriage",
                        "vi": "£ 16,95 bao gồm VAT và vận chuyển"
                    },
                    {
                        "en": "Orders are despatched within 28 days but allow time for carriage.",
                        "vi": "Các đơn đặt hàng được gửi đi trong vòng 28 ngày nhưng vẫn có thời gian để vận chuyển."
                    },
                    {
                        "en": "a contract for the carriage of goods",
                        "vi": "hợp đồng vận chuyển hàng hóa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a moving part of a machine that supports or moves another part, for example on a typewriter",
                    "vi": "một bộ phận chuyển động của máy hỗ trợ hoặc di chuyển bộ phận khác, ví dụ trên máy đánh chữ"
                },
                "examples": [
                    {
                        "en": "a carriage return (= the act of starting a new line when typing)",
                        "vi": "dấu xuống dòng (= hành động bắt đầu một dòng mới khi nhập)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody holds and moves their head and body",
                    "vi": "cách mà ai đó giữ và di chuyển đầu và cơ thể của họ"
                },
                "examples": [
                    {
                        "en": "She showed her pedigree on her face and in her carriage.",
                        "vi": "Cô ấy thể hiện phả hệ của mình trên khuôn mặt và trong xe ngựa của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6eb4291b09544c3b82637cbc75cac0aa",
        "word": "chariot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃæriət/",
            "us": "/ˈtʃæriət/"
        },
        "nearby": [
            {
                "word": "Charing Cross",
                "pos": ""
            },
            {
                "word": "Charing Cross Road",
                "pos": ""
            },
            {
                "word": "chariot",
                "pos": "noun"
            },
            {
                "word": "charioteer",
                "pos": "noun"
            },
            {
                "word": "Chariots of Fire",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an open vehicle with two wheels, pulled by horses, used in ancient times in battle and for racing",
                    "vi": "một phương tiện hở có hai bánh, được kéo bởi ngựa, được sử dụng trong thời cổ đại để chiến đấu và đua xe"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ad675e5588b848c892c7adbd0af33dd7",
        "word": "crown",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kraʊn/",
            "us": "/kraʊn/"
        },
        "nearby": [
            {
                "word": "crowdsource",
                "pos": "verb"
            },
            {
                "word": "crowdsourcing",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "verb"
            },
            {
                "word": "Crown Agent",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object in the shape of a circle, usually made of gold and precious stones, that a king or queen wears on his or her head on official occasions",
                    "vi": "một vật có dạng hình tròn, thường được làm bằng vàng và đá quý, mà vua hoặc hoàng hậu đội trên đầu trong những dịp chính thức"
                },
                "examples": [
                    {
                        "en": "The crown was placed upon the new monarch's head.",
                        "vi": "Vương miện được đặt trên đầu của quốc vương mới."
                    },
                    {
                        "en": "the emperor's jewel-encrusted crown",
                        "vi": "vương miện nạm ngọc của hoàng đế"
                    }
                ]
            },
            {
                "define": {
                    "en": "the government of a country, thought of as being represented by a king or queen",
                    "vi": "chính phủ của một quốc gia, được coi là được đại diện bởi vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "land owned by the Crown",
                        "vi": "đất thuộc sở hữu của Crown"
                    },
                    {
                        "en": "a Minister of the Crown",
                        "vi": "một Bộ trưởng của Vương miện"
                    },
                    {
                        "en": "Who's appearing for the Crown (= bringing a criminal charge against somebody on behalf of the state) in this case?",
                        "vi": "Ai sẽ xuất hiện vì Crown (= thay mặt tiểu bang đưa ra cáo buộc hình sự đối với ai đó) trong trường hợp này?"
                    },
                    {
                        "en": "a piece of Crown land",
                        "vi": "một mảnh đất Crown"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position or power of a king or queen",
                    "vi": "vị trí hoặc quyền lực của một vị vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "She refused the crown (= refused to become queen).",
                        "vi": "Cô ấy từ chối vương miện (= từ chối trở thành nữ hoàng)."
                    },
                    {
                        "en": "his claim to the French crown",
                        "vi": "tuyên bố của anh ấy đối với vương miện Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a circle of flowers, leaves, etc. that is worn on somebody’s head, sometimes as a sign of victory",
                    "vi": "một vòng hoa, lá, v.v. được đội trên đầu ai đó, đôi khi là dấu hiệu của chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the position of winning a sports competition",
                    "vi": "vị trí chiến thắng trong một cuộc thi thể thao"
                },
                "examples": [
                    {
                        "en": "She is determined to retain her Wimbledon crown.",
                        "vi": "Cô quyết tâm giữ lại vương miện Wimbledon của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top part of the head or a hat",
                    "vi": "phần trên của đầu hoặc một chiếc mũ"
                },
                "examples": [
                    {
                        "en": "There were raindrops on his bald crown.",
                        "vi": "Có những hạt mưa trên vương miện hói của anh ta."
                    },
                    {
                        "en": "She swept her hair into a bun at the crown of her head.",
                        "vi": "Cô búi tóc thành búi cao trên đỉnh đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest part of something",
                    "vi": "phần cao nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the crown of a hill",
                        "vi": "vương miện của một ngọn đồi"
                    },
                    {
                        "en": "from the crown of the final bend",
                        "vi": "từ đỉnh của khúc cua cuối cùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a plant just above and below the ground",
                    "vi": "phần của cây ngay trên và dưới mặt đất"
                },
                "examples": [
                    {
                        "en": "Roses bloom on shoots that sprout from the crown of the mother plant.",
                        "vi": "Hoa hồng nở trên các chồi mọc ra từ ngọn của cây mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of a tree or other plant",
                    "vi": "ngọn cây hoặc cây khác"
                },
                "examples": [
                    {
                        "en": "Nests were built high in the crowns of trees.",
                        "vi": "Tổ được xây cao trên những tán cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artificial cover for a damaged tooth",
                    "vi": "một vỏ bọc nhân tạo cho một chiếc răng bị hư hỏng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of the tooth that is above the gum",
                    "vi": "phần răng ở trên nướu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "anything in the shape of a crown, especially as a decoration or a badge",
                    "vi": "bất cứ thứ gì có hình vương miện, đặc biệt là đồ trang trí hoặc huy hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit of money in several European countries",
                    "vi": "một đơn vị tiền ở một số nước Châu Âu"
                },
                "examples": [
                    {
                        "en": "Czech crowns",
                        "vi": "Mão Czech"
                    }
                ]
            },
            {
                "define": {
                    "en": "an old British coin worth five shillings (= now 25p)",
                    "vi": "một đồng xu cũ của Anh trị giá năm shilling (= bây giờ là 25p)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most attractive or valuable part of something",
                    "vi": "phần hấp dẫn hoặc giá trị nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The Knightsbridge branch is the jewel in the crown of a 500-strong chain of stores.",
                        "vi": "Chi nhánh Knightsbridge là viên ngọc quý trên vương miện của chuỗi 500 cửa hàng lớn mạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c7e266bde59846c2be5a4ca57612b7db",
        "word": "dungeon",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʌndʒən/",
            "us": "/ˈdʌndʒən/"
        },
        "nearby": [
            {
                "word": "dungarees",
                "pos": "noun"
            },
            {
                "word": "Dungeness",
                "pos": ""
            },
            {
                "word": "dungeon",
                "pos": "noun"
            },
            {
                "word": "dungheap",
                "pos": "noun"
            },
            {
                "word": "Dunhill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dark underground room used as a prison, especially in a castle",
                    "vi": "một căn phòng tối dưới lòng đất được sử dụng như một nhà tù, đặc biệt là trong một lâu đài"
                },
                "examples": [
                    {
                        "en": "Throw him into the dungeons!",
                        "vi": "Hãy ném anh ta vào ngục tối!"
                    }
                ]
            }
        ]
    },
    {
        "id": "c881cac2bc0f43ed91bfe83f9bfd0597",
        "word": "fort",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɔːt/",
            "us": "/fɔːrt/"
        },
        "nearby": [
            {
                "word": "Bruce Forsyth",
                "pos": ""
            },
            {
                "word": "forsythia",
                "pos": "noun"
            },
            {
                "word": "fort",
                "pos": "noun"
            },
            {
                "word": "Fort Collins",
                "pos": ""
            },
            {
                "word": "forte",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or buildings built in order to defend an area against attack",
                    "vi": "một tòa nhà hoặc các tòa nhà được xây dựng để bảo vệ một khu vực chống lại sự tấn công"
                },
                "examples": [
                    {
                        "en": "the remains of a Roman fort",
                        "vi": "tàn tích của một pháo đài La Mã"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where soldiers live and have their training",
                    "vi": "một nơi mà binh lính sống và đào tạo của họ"
                },
                "examples": [
                    {
                        "en": "Fort Drum",
                        "vi": "Fort Drum"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the responsibility for something or care of somebody while other people are away or out",
                    "vi": "có trách nhiệm đối với điều gì đó hoặc chăm sóc ai đó trong khi người khác đi vắng hoặc vắng mặt"
                },
                "examples": [
                    {
                        "en": "Why not have a day off? I'll hold the fort for you.",
                        "vi": "Tại sao không có một ngày nghỉ? Tôi sẽ giữ pháo đài cho bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "67719a1c8e6842ee99475f92ec0f951f",
        "word": "fortress",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɔːtrəs/",
            "us": "/ˈfɔːrtrəs/"
        },
        "nearby": [
            {
                "word": "Fortnum & Mason",
                "pos": ""
            },
            {
                "word": "Fortran",
                "pos": "noun"
            },
            {
                "word": "fortress",
                "pos": "noun"
            },
            {
                "word": "Fort Sumter",
                "pos": ""
            },
            {
                "word": "Fort Ticonderoga",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or place that has been made stronger and protected against attack",
                    "vi": "một tòa nhà hoặc địa điểm đã được xây dựng mạnh mẽ hơn và được bảo vệ chống lại sự tấn công"
                },
                "examples": [
                    {
                        "en": "a fortress town enclosed by four miles of ramparts",
                        "vi": "một thị trấn pháo đài được bao quanh bởi bốn dặm thành lũy"
                    },
                    {
                        "en": "Fear of terrorist attack has turned the conference centre into a fortress.",
                        "vi": "Nỗi lo bị tấn công khủng bố đã biến trung tâm hội nghị thành pháo đài."
                    }
                ]
            }
        ]
    },
    {
        "id": "466346181dce47dba7faad697b052997",
        "word": "shield",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ʃiːld/",
            "us": "/ʃiːld/"
        },
        "nearby": [
            {
                "word": "shibboleth",
                "pos": "noun"
            },
            {
                "word": "shied",
                "pos": "verb"
            },
            {
                "word": "shield",
                "pos": "noun"
            },
            {
                "word": "The Shield",
                "pos": ""
            },
            {
                "word": "shield",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of metal or leather carried by soldiers in the past to protect the body when fighting",
                    "vi": "một mảnh kim loại hoặc da lớn được binh lính mang theo để bảo vệ cơ thể khi chiến đấu"
                },
                "examples": [
                    {
                        "en": "She did not recognize the coat of arms on his shield.",
                        "vi": "Cô không nhận ra quốc huy trên khiên của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment made from strong plastic, used by the police to protect themselves from angry crowds",
                    "vi": "một thiết bị làm từ nhựa cứng, được cảnh sát sử dụng để bảo vệ mình khỏi đám đông giận dữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing used to protect somebody/something, especially by forming a barrier",
                    "vi": "một người hoặc vật được sử dụng để bảo vệ ai đó / điều gì đó, đặc biệt là bằng cách tạo thành một rào cản"
                },
                "examples": [
                    {
                        "en": "Water is not an effective shield against the sun's more harmful rays.",
                        "vi": "Nước không phải là một lá chắn hiệu quả chống lại các tia có hại của mặt trời."
                    },
                    {
                        "en": "She hid her true feelings behind a shield of cold indifference.",
                        "vi": "Cô ấy che giấu cảm xúc thật của mình đằng sau một tấm khiên thờ ơ lạnh lùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a plate or screen that protects a machine or the person using it from damage or injury",
                    "vi": "tấm hoặc màn hình bảo vệ máy hoặc người sử dụng máy khỏi bị hư hỏng hoặc thương tích"
                },
                "examples": [
                    {
                        "en": "A heat shield protects the worker’s hands.",
                        "vi": "Một tấm chắn nhiệt bảo vệ đôi tay của người lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object in the shape of a shield, given as a prize in a sports competition, etc.",
                    "vi": "một vật có hình dạng của một chiếc khiên, được tặng như một giải thưởng trong một cuộc thi thể thao, v.v."
                },
                "examples": [
                    {
                        "en": "The prince presented the shield to the winners.",
                        "vi": "Hoàng tử trao chiếc khiên cho những người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a drawing or model of a shield showing a coat of arms",
                    "vi": "một bản vẽ hoặc mô hình của một chiếc khiên có huy hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a police officer’s badge",
                    "vi": "huy hiệu cảnh sát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b40037d9224042c88e01933786a3fde6",
        "word": "spear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/spɪə(r)/",
            "us": "/spɪr/"
        },
        "nearby": [
            {
                "word": "speak to",
                "pos": "phrasal verb"
            },
            {
                "word": "speak up",
                "pos": "phrasal verb"
            },
            {
                "word": "spear",
                "pos": "noun"
            },
            {
                "word": "spear",
                "pos": "verb"
            },
            {
                "word": "speargun",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a weapon with a long wooden handle and a sharp metal point used for fighting, hunting and fishing in the past",
                    "vi": "một vũ khí có cán dài bằng gỗ và có đầu nhọn bằng kim loại dùng để chiến đấu, săn bắn và đánh cá trong quá khứ"
                },
                "examples": [
                    {
                        "en": "She had a fish impaled on the point of her spear.",
                        "vi": "Cô ấy bị một con cá đâm vào mũi giáo của mình."
                    },
                    {
                        "en": "The tribesmen were armed with spears and shields.",
                        "vi": "Những người trong bộ lạc được trang bị giáo và khiên."
                    },
                    {
                        "en": "a 5 000-year-old stone spear point",
                        "vi": "một mũi giáo bằng đá 5000 năm tuổi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the long pointed stem of some plants",
                    "vi": "thân dài nhọn của một số cây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "91cb2952b9574f57ad037f186b704a6e",
        "word": "sword",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/sɔːd/",
            "us": "/sɔːrd/"
        },
        "nearby": [
            {
                "word": "swop",
                "pos": "verb"
            },
            {
                "word": "swop",
                "pos": "noun"
            },
            {
                "word": "sword",
                "pos": "noun"
            },
            {
                "word": "sword dance",
                "pos": "noun"
            },
            {
                "word": "swordfish",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a weapon with a long metal blade (= sharp cutting part) and a handle",
                    "vi": "một vũ khí có một lưỡi kim loại dài (= phần cắt sắc) và một tay cầm"
                },
                "examples": [
                    {
                        "en": "to draw/sheathe a sword (= to take it out of/put it into its cover)",
                        "vi": "để rút / bọc một thanh kiếm (= lấy nó ra / cất nó vào vỏ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something that has both advantages and disadvantages",
                    "vi": "trở thành một cái gì đó có cả ưu điểm và nhược điểm"
                },
                "examples": [
                    {
                        "en": "Fame is a double-edged sword.",
                        "vi": "Sự nổi tiếng là con dao hai lưỡi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight or argue with somebody",
                    "vi": "chiến đấu hoặc tranh luận với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "people who write books, poems, etc. have a greater effect on history and human affairs than soldiers and wars",
                    "vi": "người viết sách, làm thơ, v.v ... có tác dụng đối với lịch sử và con người hơn là binh lính và chiến tranh."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to kill somebody with a sword",
                    "vi": "giết ai đó bằng một thanh gươm"
                },
                "examples": [
                    {
                        "en": "All the men were put to the sword.",
                        "vi": "Tất cả những người đàn ông đều bị đưa ra gươm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bad or unpleasant thing that might happen to you at any time and that makes you feel worried or frightened",
                    "vi": "một điều tồi tệ hoặc khó chịu có thể xảy ra với bạn bất cứ lúc nào và điều đó khiến bạn cảm thấy lo lắng hoặc sợ hãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop fighting and return to peaceful activities",
                    "vi": "ngừng chiến đấu và trở lại hoạt động hòa bình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e22b4c3c69824bc992c7bb0d1f8fc8e8",
        "word": "amphitheatre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæmfɪθɪətə(r)/",
            "us": "/ˈæmfɪθiːətər/"
        },
        "nearby": [
            {
                "word": "amphibian",
                "pos": "noun"
            },
            {
                "word": "amphibious",
                "pos": "adjective"
            },
            {
                "word": "amphitheatre",
                "pos": "noun"
            },
            {
                "word": "amphora",
                "pos": "noun"
            },
            {
                "word": "amphoteric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a round building without a roof and with rows of seats that rise in steps around an open space. Amphitheatres were used especially in ancient Greece and Rome for public entertainments.",
                    "vi": "một tòa nhà hình tròn không có mái che và với các hàng ghế xếp thành từng bậc xung quanh một không gian mở. Amphitheatres được sử dụng đặc biệt ở Hy Lạp và La Mã cổ đại để giải trí công cộng."
                },
                "examples": [
                    {
                        "en": "The Roman amphitheatre stands just outside the fortress walls.",
                        "vi": "Nhà hát La Mã nằm ngay bên ngoài các bức tường của pháo đài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room, hall or theatre with rows of seats that rise in steps",
                    "vi": "một căn phòng, hội trường hoặc nhà hát với các hàng ghế nâng lên theo từng bậc thang"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an open space that is surrounded by high sloping land",
                    "vi": "một không gian mở được bao quanh bởi vùng đất dốc cao"
                },
                "examples": [
                    {
                        "en": "The path emerges from the gorge into an open amphitheatre with slopes all around.",
                        "vi": "Con đường đi ra từ hẻm núi vào một giảng đường mở với những con dốc xung quanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "592aaf112c5b45f9aa9389fd97b425b3",
        "word": "battlements",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbætlmənts/",
            "us": "/ˈbætlmənts/"
        },
        "nearby": [
            {
                "word": "battle-hardened",
                "pos": "adjective"
            },
            {
                "word": "The Battle Hymn of the Republic",
                "pos": ""
            },
            {
                "word": "battlements",
                "pos": "noun"
            },
            {
                "word": "the Battle of Britain",
                "pos": ""
            },
            {
                "word": "the Battle of the Atlantic",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a low wall around the top of a castle with spaces in it that people inside could shoot through",
                    "vi": "một bức tường thấp xung quanh đỉnh của một lâu đài với những khoảng trống mà những người bên trong có thể bắn xuyên qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "775b8dd819ea4ac88b72296f5084f912",
        "word": "coach",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəʊtʃ/",
            "us": "/kəʊtʃ/"
        },
        "nearby": [
            {
                "word": "Co.",
                "pos": "abbreviation"
            },
            {
                "word": "co-",
                "pos": "prefix"
            },
            {
                "word": "coach",
                "pos": "noun"
            },
            {
                "word": "coach",
                "pos": "verb"
            },
            {
                "word": "coach house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who trains a person or team in sport",
                    "vi": "một người huấn luyện một người hoặc một đội thể thao"
                },
                "examples": [
                    {
                        "en": "the head/assistant coach",
                        "vi": "huấn luyện viên trưởng / trợ lý"
                    },
                    {
                        "en": "a basketball/football coach",
                        "vi": "một huấn luyện viên bóng rổ / bóng đá"
                    },
                    {
                        "en": "the team coach",
                        "vi": "huấn luyện viên đội"
                    },
                    {
                        "en": "the England coach",
                        "vi": "huấn luyện viên đội tuyển Anh"
                    },
                    {
                        "en": "Italy’s national coach",
                        "vi": "Huấn luyện viên đội tuyển quốc gia Ý"
                    },
                    {
                        "en": "Coach Bob Shapiro",
                        "vi": "Huấn luyện viên Bob Shapiro"
                    },
                    {
                        "en": "the Giants coach Tom Coughlin",
                        "vi": "huấn luyện viên của Người khổng lồ Tom Coughlin"
                    },
                    {
                        "en": "coach of/with/for somebody/something the coach of the New York Knicks",
                        "vi": "huấn luyện viên của / với / cho ai đó / một cái gì đó huấn luyện viên của New York Knicks"
                    },
                    {
                        "en": "a coach with the Chicago Cubs",
                        "vi": "một huấn luyện viên với Chicago Cubs"
                    },
                    {
                        "en": "a coach for the US Olympic team",
                        "vi": "một huấn luyện viên cho đội Olympic Hoa Kỳ"
                    },
                    {
                        "en": "He is a former college football coach.",
                        "vi": "Anh ấy là một cựu huấn luyện viên bóng đá của trường đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who gives private lessons to somebody, often to prepare them for an exam",
                    "vi": "một người thường giảng bài cho ai đó, để chuẩn bị cho kỳ thi"
                },
                "examples": [
                    {
                        "en": "a maths coach",
                        "vi": "một huấn luyện viên toán học"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is employed by somebody to give them advice about how to achieve the things they want in their life and work",
                    "vi": "một người được ai đó thuê để cho họ lời khuyên về cách đạt được những điều họ muốn trong cuộc sống và công việc của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a comfortable bus for carrying passengers over long distances",
                    "vi": "một chiếc xe buýt thoải mái để chở hành khách trên một quãng đường dài"
                },
                "examples": [
                    {
                        "en": "to take/get a coach",
                        "vi": "để lấy / nhận một huấn luyện viên"
                    },
                    {
                        "en": "by coach Travel is by coach overnight to Berlin.",
                        "vi": "bằng xe khách. Du lịch bằng xe qua đêm đến Berlin."
                    },
                    {
                        "en": "on a coach Four passengers on the coach were seriously injured in the crash.",
                        "vi": "trên một xe khách Bốn hành khách trên xe bị thương nặng trong vụ va chạm."
                    },
                    {
                        "en": "a coach tour/journey/trip",
                        "vi": "một chuyến xe du lịch / hành trình / chuyến đi"
                    },
                    {
                        "en": "coach to/for… She was seen boarding a coach to Southampton.",
                        "vi": "huấn luyện viên đến / cho… Cô ấy đã được nhìn thấy lên một huấn luyện viên đến Southampton."
                    },
                    {
                        "en": "coach from… I got off the coach from London and walked home.",
                        "vi": "huấn luyện viên từ… Tôi xuống xe từ Luân Đôn và đi bộ về nhà."
                    },
                    {
                        "en": "They went to Italy on a coach tour.",
                        "vi": "Họ đã đến Ý trong một chuyến du lịch bằng xe khách."
                    },
                    {
                        "en": "a coach driver/passenger/operator",
                        "vi": "một người lái xe / hành khách / người điều hành"
                    },
                    {
                        "en": "a coach station (= where coaches start and end their journey)",
                        "vi": "trạm xe buýt (= nơi xe khách bắt đầu và kết thúc hành trình của họ)"
                    },
                    {
                        "en": "a coach party (= a group of people travelling together on a coach)",
                        "vi": "một bữa tiệc huấn luyện viên (= một nhóm người đi cùng nhau trên một xe huấn luyện viên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a separate section of a train for carrying passengers",
                    "vi": "một phần riêng biệt của một đoàn tàu để chở hành khách"
                },
                "examples": [
                    {
                        "en": "a railway coach",
                        "vi": "một huấn luyện viên đường sắt"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large closed vehicle with four wheels, pulled by horses, used in the past for carrying passengers",
                    "vi": "một loại xe kín lớn có bốn bánh, do ngựa kéo, ngày xưa được dùng để chở khách"
                },
                "examples": [
                    {
                        "en": "This is the old coach road.",
                        "vi": "Đây là con đường cũ."
                    },
                    {
                        "en": "a gateway wide enough for a coach and four (= pulled by four horses) to drive through",
                        "vi": "một cửa ngõ đủ rộng để một huấn luyện viên và bốn (= do bốn con ngựa kéo) lái qua"
                    }
                ]
            },
            {
                "define": {
                    "en": "the cheapest seats in a plane",
                    "vi": "ghế rẻ nhất trên máy bay"
                },
                "examples": [
                    {
                        "en": "to fly coach",
                        "vi": "huấn luyện viên bay"
                    },
                    {
                        "en": "coach fares/passengers/seats",
                        "vi": "giá vé xe khách / hành khách / chỗ ngồi"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause something to fail, for example a plan",
                    "vi": "gây ra một cái gì đó không thành công, ví dụ như một kế hoạch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a06f9834051e41baac9899148f2626fb",
        "word": "cobbles",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒblz/",
            "us": "/ˈkɑːblz/"
        },
        "nearby": [
            {
                "word": "cobbled",
                "pos": "adjective"
            },
            {
                "word": "cobbler",
                "pos": "noun"
            },
            {
                "word": "cobbles",
                "pos": "noun"
            },
            {
                "word": "cobblestone",
                "pos": "adjective"
            },
            {
                "word": "cobblestone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small round stones used to make the surfaces of roads, especially in the past",
                    "vi": "đá tròn nhỏ được sử dụng để làm mặt đường, đặc biệt là trong quá khứ"
                },
                "examples": [
                    {
                        "en": "a cart clattering over the cobbles",
                        "vi": "một chiếc xe đẩy lạch cạch trên những viên sỏi"
                    }
                ]
            }
        ]
    },
    {
        "id": "6b848f9049b84224aef6b3d204b86472",
        "word": "drawbridge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɔːbrɪdʒ/",
            "us": "/ˈdrɔːbrɪdʒ/"
        },
        "nearby": [
            {
                "word": "draw back",
                "pos": "phrasal verb"
            },
            {
                "word": "drawback",
                "pos": "noun"
            },
            {
                "word": "drawbridge",
                "pos": "noun"
            },
            {
                "word": "drawcard",
                "pos": "noun"
            },
            {
                "word": "draw down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bridge that can be pulled up, for example to stop people from entering a castle or to allow ships to pass under it",
                    "vi": "một cây cầu có thể được kéo lên, chẳng hạn như để ngăn mọi người vào lâu đài hoặc cho phép tàu bè đi qua nó"
                },
                "examples": [
                    {
                        "en": "to raise/lower the drawbridge",
                        "vi": "để nâng / hạ cầu kéo"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9ff65ef83bc4fed834d0e780ec62af5",
        "word": "fortification",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɔːtɪfɪˈkeɪʃn/",
            "us": "/ˌfɔːrtɪfɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "fortieth",
                "pos": "noun"
            },
            {
                "word": "fortieth",
                "pos": "ordinal number"
            },
            {
                "word": "fortification",
                "pos": "noun"
            },
            {
                "word": "fortify",
                "pos": "verb"
            },
            {
                "word": "fortiori",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tower, wall, gun position, etc. built to defend a place against attack",
                    "vi": "một tháp, tường, vị trí đặt súng, v.v. được xây dựng để bảo vệ một nơi chống lại cuộc tấn công"
                },
                "examples": [
                    {
                        "en": "the ramparts and fortifications of the Old Town",
                        "vi": "thành lũy và công sự của Phố cổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of fortifying or making something stronger",
                    "vi": "hành động củng cố hoặc làm cho một cái gì đó mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "plans for the fortification of the city",
                        "vi": "kế hoạch củng cố thành phố"
                    }
                ]
            }
        ]
    },
    {
        "id": "e8f6b9e179a24ceb85ec60b13c7a7644",
        "word": "galley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæli/",
            "us": "/ˈɡæli/"
        },
        "nearby": [
            {
                "word": "galleried",
                "pos": "adjective"
            },
            {
                "word": "gallery",
                "pos": "noun"
            },
            {
                "word": "galley",
                "pos": "noun"
            },
            {
                "word": "galliard",
                "pos": "noun"
            },
            {
                "word": "Gallic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long flat ship with sails, especially one used by the ancient Greeks or Romans in war, usually rowed by slaves or prisoners",
                    "vi": "một con tàu phẳng dài có buồm, đặc biệt là con tàu được người Hy Lạp hoặc La Mã cổ đại sử dụng trong chiến tranh, thường được chèo bởi nô lệ hoặc tù nhân"
                },
                "examples": [
                    {
                        "en": "a galley slave",
                        "vi": "một nô lệ galley"
                    }
                ]
            },
            {
                "define": {
                    "en": "the kitchen on a ship or plane",
                    "vi": "nhà bếp trên tàu hoặc máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a28c870f07a14531a701018e0e57878b",
        "word": "gallows",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæləʊz/",
            "us": "/ˈɡæləʊz/"
        },
        "nearby": [
            {
                "word": "gallop",
                "pos": "noun"
            },
            {
                "word": "galloping",
                "pos": "adjective"
            },
            {
                "word": "gallows",
                "pos": "noun"
            },
            {
                "word": "gallows humour",
                "pos": "noun"
            },
            {
                "word": "gallstone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a structure on which people, for example criminals, are killed by hanging",
                    "vi": "một cấu trúc mà trên đó mọi người, ví dụ như tội phạm, bị giết bằng cách treo cổ"
                },
                "examples": [
                    {
                        "en": "to send a man to the gallows (= to send him to his death by hanging)",
                        "vi": "đưa một người đàn ông lên giá treo cổ (= đưa anh ta đến cái chết của anh ta bằng cách treo cổ)"
                    },
                    {
                        "en": "The public were waiting to see the hated hangman swing from his own gallows.",
                        "vi": "Công chúng đang chờ xem kẻ treo cổ bị ghét bỏ khỏi giá treo cổ của chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba76654536874c0fbcbe96b9b5168b6a",
        "word": "guy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡaɪ/",
            "us": "/ɡaɪ/"
        },
        "nearby": [
            {
                "word": "guv",
                "pos": "exclamation"
            },
            {
                "word": "guv'nor",
                "pos": "noun"
            },
            {
                "word": "guy",
                "pos": "noun"
            },
            {
                "word": "Guy",
                "pos": ""
            },
            {
                "word": "Guyana",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man",
                    "vi": "một người đàn ông"
                },
                "examples": [
                    {
                        "en": "a big/little guy",
                        "vi": "một anh chàng to lớn / nhỏ bé"
                    },
                    {
                        "en": "a nice/good/lovely/great guy",
                        "vi": "một chàng trai tốt / tốt / đáng yêu / tuyệt vời"
                    },
                    {
                        "en": "a cool/tough/smart guy",
                        "vi": "một chàng trai mát mẻ / cứng rắn / thông minh"
                    },
                    {
                        "en": "a young guy",
                        "vi": "một chàng trai trẻ"
                    },
                    {
                        "en": "an old guy",
                        "vi": "một ông già"
                    },
                    {
                        "en": "a white/black guy",
                        "vi": "một anh chàng da trắng / da đen"
                    },
                    {
                        "en": "The poor guy must have been terrified.",
                        "vi": "Anh chàng tội nghiệp hẳn đã vô cùng kinh hãi."
                    },
                    {
                        "en": "a Dutch/French/Korean guy",
                        "vi": "một anh chàng Hà Lan / Pháp / Hàn Quốc"
                    },
                    {
                        "en": "At the end of the film the bad guy gets shot.",
                        "vi": "Cuối phim, kẻ xấu bị bắn."
                    },
                    {
                        "en": "While the cops should be the good guys, it's much more complex than that.",
                        "vi": "Mặc dù cảnh sát nên là những người tốt, nhưng nó phức tạp hơn thế nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people of either sex",
                    "vi": "một nhóm người của một trong hai giới tính"
                },
                "examples": [
                    {
                        "en": "Come on, you guys, let's get going!",
                        "vi": "Nào, các bạn, chúng ta hãy bắt đầu!"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a model of a man dressed in old clothes that is burned on a bonfire on 5 November during the celebrations for Bonfire Night",
                    "vi": "(ở Anh) mô hình một người đàn ông mặc quần áo cũ bị đốt trên đống lửa vào ngày 5 tháng 11 trong lễ kỷ niệm Đêm lửa trại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rope used to keep a pole or tent in a secure position",
                    "vi": "một sợi dây dùng để giữ cột hoặc lều ở vị trí an toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5be6a5ca230044f7903075b637a4520b",
        "word": "moat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məʊt/",
            "us": "/məʊt/"
        },
        "nearby": [
            {
                "word": "moan",
                "pos": "noun"
            },
            {
                "word": "moaner",
                "pos": "noun"
            },
            {
                "word": "moat",
                "pos": "noun"
            },
            {
                "word": "moated",
                "pos": "adjective"
            },
            {
                "word": "mob",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deep wide channel that was dug around a castle, etc. and filled with water to make it more difficult for enemies to attack",
                    "vi": "một con kênh sâu rộng được đào xung quanh lâu đài, v.v. và chứa đầy nước để khiến kẻ thù khó tấn công hơn"
                },
                "examples": [
                    {
                        "en": "The castle was ringed by a moat spanned by a wooden drawbridge.",
                        "vi": "Lâu đài được bao quanh bởi một con hào được bắc qua một chiếc cầu kéo bằng gỗ."
                    }
                ]
            }
        ]
    },
    {
        "id": "bbf90b52037e49259c8c21f558da0da2",
        "word": "mummy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmʌmi/",
            "us": "/ˈmʌmi/"
        },
        "nearby": [
            {
                "word": "Mummerset",
                "pos": "noun"
            },
            {
                "word": "mummify",
                "pos": "verb"
            },
            {
                "word": "mummy",
                "pos": "noun"
            },
            {
                "word": "mummy's boy",
                "pos": "noun"
            },
            {
                "word": "mumps",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child’s word for a mother",
                    "vi": "lời của một đứa trẻ dành cho mẹ"
                },
                "examples": [
                    {
                        "en": "‘I want my mummy!’ he wailed.",
                        "vi": "Tôi muốn xác ướp của tôi!' anh ấy đã khóc."
                    },
                    {
                        "en": "It hurts, Mummy!",
                        "vi": "Đau quá, Mẹ ơi!"
                    },
                    {
                        "en": "Mummy and Daddy will be back soon.",
                        "vi": "Mẹ và bố sẽ sớm quay lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a body of a human or an animal that has been mummified",
                    "vi": "cơ thể người hoặc động vật đã được ướp xác"
                },
                "examples": [
                    {
                        "en": "an Egyptian mummy",
                        "vi": "một xác ướp Ai Cập"
                    }
                ]
            }
        ]
    },
    {
        "id": "a2fba50e11434b279d063bbf6626c450",
        "word": "papyrus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pəˈpaɪrəs/",
            "us": "/pəˈpaɪrəs/"
        },
        "nearby": [
            {
                "word": "Papua New Guinean",
                "pos": "noun, adjective"
            },
            {
                "word": "Papworth Hospital",
                "pos": ""
            },
            {
                "word": "papyrus",
                "pos": "noun"
            },
            {
                "word": "par",
                "pos": "noun"
            },
            {
                "word": "par.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall plant with thick stems that grows in water, especially in Africa",
                    "vi": "một loại cây cao với thân dày mọc trong nước, đặc biệt là ở Châu Phi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "paper made from the stems of the papyrus plant, used in ancient Egypt for writing and drawing on",
                    "vi": "giấy làm từ thân cây cói, được sử dụng ở Ai Cập cổ đại để viết và vẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a document or piece of paper made of papyrus",
                    "vi": "một tài liệu hoặc mảnh giấy làm bằng giấy cói"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "28ed882481a044ffb8a386af78b58e19",
        "word": "relic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrelɪk/",
            "us": "/ˈrelɪk/"
        },
        "nearby": [
            {
                "word": "reliance",
                "pos": "noun"
            },
            {
                "word": "reliant",
                "pos": "adjective"
            },
            {
                "word": "relic",
                "pos": "noun"
            },
            {
                "word": "relief",
                "pos": "noun"
            },
            {
                "word": "relief map",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object, a tradition, a system, etc. that has survived from the past",
                    "vi": "một đối tượng, một truyền thống, một hệ thống, v.v. đã tồn tại từ quá khứ"
                },
                "examples": [
                    {
                        "en": "The building stands as the last remaining relic of the town's cotton industry.",
                        "vi": "Tòa nhà là di tích cuối cùng còn sót lại của ngành công nghiệp bông của thị trấn."
                    },
                    {
                        "en": "Videotapes may already seem like relics of a bygone era.",
                        "vi": "Các băng video có thể đã giống như di tích của một thời đại đã qua."
                    },
                    {
                        "en": "The pictures on the walls were relics from the days before her marriage.",
                        "vi": "Những bức tranh trên tường là di vật từ những ngày trước khi kết hôn của cô."
                    },
                    {
                        "en": "Our transportation system is a relic of the past.",
                        "vi": "Hệ thống giao thông của chúng tôi là một di tích của quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of the body or clothing of a holy person, or something that they owned, that is kept after their death and respected as a religious object",
                    "vi": "một phần cơ thể hoặc quần áo của một thánh nhân, hoặc một thứ gì đó mà họ sở hữu, được lưu giữ sau khi họ chết và được tôn trọng như một vật tôn giáo"
                },
                "examples": [
                    {
                        "en": "holy relics",
                        "vi": "thánh tích"
                    }
                ]
            }
        ]
    },
    {
        "id": "c3ce8e62b46146769e941a577a937a23",
        "word": "scaffold",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskæfəʊld/",
            "us": "/ˈskæfəʊld/"
        },
        "nearby": [
            {
                "word": "scads",
                "pos": "noun"
            },
            {
                "word": "Scafell Pike",
                "pos": ""
            },
            {
                "word": "scaffold",
                "pos": "noun"
            },
            {
                "word": "scaffolding",
                "pos": "noun"
            },
            {
                "word": "scalability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a platform used when executing criminals by cutting off their heads or hanging them from a rope",
                    "vi": "một nền tảng được sử dụng khi hành quyết tội phạm bằng cách chặt đầu của họ hoặc treo họ trên một sợi dây"
                },
                "examples": [
                    {
                        "en": "to be sent to the scaffold",
                        "vi": "được đưa lên đoạn đầu đài"
                    },
                    {
                        "en": "on the scaffold to die on the scaffold",
                        "vi": "trên giàn giáo chết trên giàn giáo"
                    },
                    {
                        "en": "She was led to the scaffold in front of a crowd of several hundred",
                        "vi": "Cô được dẫn lên đoạn đầu đài trước đám đông vài trăm người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a structure made of scaffolding, for workers to stand on when they are working on a building",
                    "vi": "một cấu trúc làm bằng giàn giáo, để công nhân đứng trên khi họ đang làm việc trên một tòa nhà"
                },
                "examples": []
            }
        ]
    }
]