[
    {
        "id": "9c5ca856067b445fa0554a55cf94d6c9",
        "word": "abandon",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈbændən/",
            "us": "/əˈbændən/"
        },
        "nearby": [
            {
                "word": "abaft",
                "pos": "adverb"
            },
            {
                "word": "abalone",
                "pos": "noun"
            },
            {
                "word": "abandon",
                "pos": "verb"
            },
            {
                "word": "abandon",
                "pos": "noun"
            },
            {
                "word": "abandoned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to leave somebody, especially somebody you are responsible for, with no intention of returning",
                    "vi": "rời bỏ ai đó, đặc biệt là ai đó mà bạn chịu trách nhiệm, không có ý định quay trở lại"
                },
                "examples": [
                    {
                        "en": "abandon somebody The baby had been abandoned by its mother.",
                        "vi": "bỏ rơi ai đó Đứa bé đã bị mẹ nó bỏ rơi."
                    },
                    {
                        "en": "People often simply abandon their pets when they go abroad.",
                        "vi": "Mọi người thường bỏ rơi vật nuôi của họ khi họ ra nước ngoài."
                    },
                    {
                        "en": "abandon somebody to something ‘We have been abandoned to our fate,’ said one resident.",
                        "vi": "từ bỏ ai đó cho một cái gì đó 'Chúng tôi đã bị bỏ mặc cho số phận của chúng tôi,' một người dân nói."
                    },
                    {
                        "en": "The study showed a deep fear among the elderly of being abandoned to the care of strangers.",
                        "vi": "Nghiên cứu cho thấy nỗi sợ hãi sâu sắc của người cao tuổi khi bị bỏ rơi cho sự chăm sóc của người lạ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a thing or place, especially because it is impossible or dangerous to stay",
                    "vi": "rời khỏi một thứ hoặc địa điểm, đặc biệt là vì không thể hoặc nguy hiểm ở lại"
                },
                "examples": [
                    {
                        "en": "abandon something Snow forced many drivers to abandon their vehicles.",
                        "vi": "bỏ rơi một thứ gì đó Snow buộc nhiều tài xế phải bỏ xe của họ."
                    },
                    {
                        "en": "He gave the order to abandon ship (= to leave the ship because it was sinking).",
                        "vi": "Anh ta ra lệnh từ bỏ con tàu (= rời khỏi con tàu vì nó đang chìm)."
                    },
                    {
                        "en": "abandon something to somebody/something They had to abandon their lands to the invading forces.",
                        "vi": "từ bỏ một cái gì đó cho ai đó / cái gì đó Họ đã phải từ bỏ vùng đất của mình cho các lực lượng xâm lược."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something, especially before it is finished; to stop having something",
                    "vi": "ngừng làm việc gì đó, đặc biệt là trước khi nó kết thúc; ngừng có một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They abandoned the match because of rain.",
                        "vi": "Họ bỏ dở trận đấu vì trời mưa."
                    },
                    {
                        "en": "The plans for reform were quietly abandoned.",
                        "vi": "Các kế hoạch cải cách lặng lẽ bị từ bỏ."
                    },
                    {
                        "en": "She abandoned hope of any reconciliation.",
                        "vi": "Cô từ bỏ hy vọng về bất kỳ sự hòa giải nào."
                    },
                    {
                        "en": "We had to abandon any further attempt at negotiation.",
                        "vi": "Chúng tôi đã phải từ bỏ bất kỳ nỗ lực thương lượng nào nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop supporting or helping somebody; to stop believing in something",
                    "vi": "ngừng hỗ trợ hoặc giúp đỡ ai đó; ngừng tin vào điều gì đó"
                },
                "examples": [
                    {
                        "en": "abandon somebody The country abandoned its political leaders after the war.",
                        "vi": "bỏ rơi ai đó Đất nước đã bỏ rơi các nhà lãnh đạo chính trị của mình sau chiến tranh."
                    },
                    {
                        "en": "abandon something By 1930 he had abandoned his Marxist principles.",
                        "vi": "từ bỏ một cái gì đó Đến năm 1930, ông đã từ bỏ các nguyên tắc mácxít của mình."
                    },
                    {
                        "en": "This principle has now been effectively abandoned.",
                        "vi": "Nguyên tắc này hiện đã bị loại bỏ một cách hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel an emotion so strongly that you can feel nothing else",
                    "vi": "để cảm nhận một cảm xúc mạnh mẽ đến mức bạn không thể cảm thấy gì khác"
                },
                "examples": [
                    {
                        "en": "He abandoned himself to despair.",
                        "vi": "Anh đã bỏ rơi mình để rồi tuyệt vọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "10c88d212f9846538e3086efc31c2f7b",
        "word": "pessimism",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpesɪmɪzəm/",
            "us": "/ˈpesɪmɪzəm/"
        },
        "nearby": [
            {
                "word": "peso",
                "pos": "noun"
            },
            {
                "word": "pessary",
                "pos": "noun"
            },
            {
                "word": "pessimism",
                "pos": "noun"
            },
            {
                "word": "pessimist",
                "pos": "noun"
            },
            {
                "word": "pessimistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling that bad things will happen and that something will not be successful",
                    "vi": "cảm giác rằng điều tồi tệ sẽ xảy ra và điều gì đó sẽ không thành công"
                },
                "examples": [
                    {
                        "en": "There is a mood of pessimism in the company about future job prospects.",
                        "vi": "Có tâm trạng bi quan trong công ty về triển vọng công việc trong tương lai."
                    },
                    {
                        "en": "This widespread pessimism does not seem justified.",
                        "vi": "Sự bi quan lan rộng này dường như không được biện minh."
                    }
                ]
            }
        ]
    },
    {
        "id": "f063a84d646b431cbcfe3c0353a31ddb",
        "word": "pessimistic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌpesɪˈmɪstɪk/",
            "us": "/ˌpesɪˈmɪstɪk/"
        },
        "nearby": [
            {
                "word": "pessimism",
                "pos": "noun"
            },
            {
                "word": "pessimist",
                "pos": "noun"
            },
            {
                "word": "pessimistic",
                "pos": "adjective"
            },
            {
                "word": "pessimistically",
                "pos": "adverb"
            },
            {
                "word": "pest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "expecting bad things to happen or something not to be successful; showing this",
                    "vi": "mong đợi những điều tồi tệ xảy ra hoặc điều gì đó không thành công; hiển thị cái này"
                },
                "examples": [
                    {
                        "en": "They appeared surprisingly pessimistic about their chances of winning.",
                        "vi": "Họ tỏ ra bi quan một cách đáng ngạc nhiên về cơ hội chiến thắng của mình."
                    },
                    {
                        "en": "a pessimistic view of life",
                        "vi": "một cái nhìn bi quan về cuộc sống"
                    },
                    {
                        "en": "I think you're being far too pessimistic.",
                        "vi": "Tôi nghĩ rằng bạn đang quá bi quan."
                    }
                ]
            }
        ]
    },
    {
        "id": "30c764f6f378444dbbf9062785b96e53",
        "word": "pessimistically",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌpesɪˈmɪstɪkli/",
            "us": "/ˌpesɪˈmɪstɪkli/"
        },
        "nearby": [
            {
                "word": "pessimist",
                "pos": "noun"
            },
            {
                "word": "pessimistic",
                "pos": "adjective"
            },
            {
                "word": "pessimistically",
                "pos": "adverb"
            },
            {
                "word": "pest",
                "pos": "noun"
            },
            {
                "word": "PEST analysis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that shows that you expect bad things to happen or something not to be successful",
                    "vi": "theo cách cho thấy rằng bạn mong đợi những điều tồi tệ sẽ xảy ra hoặc điều gì đó không thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5c878c88da843b3aabd715f879a6b2b",
        "word": "abandonment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbændənmənt/",
            "us": "/əˈbændənmənt/"
        },
        "nearby": [
            {
                "word": "abandon",
                "pos": "noun"
            },
            {
                "word": "abandoned",
                "pos": "adjective"
            },
            {
                "word": "abandonment",
                "pos": "noun"
            },
            {
                "word": "abase",
                "pos": "verb"
            },
            {
                "word": "abasement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of leaving a person, thing or place with no intention of returning",
                    "vi": "hành động rời bỏ một người, một vật hoặc một nơi nào đó mà không có ý định quay trở lại"
                },
                "examples": [
                    {
                        "en": "their childhood abandonment by their mother",
                        "vi": "thời thơ ấu của họ bị mẹ bỏ rơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of giving up an idea or stopping an activity with no intention of returning to it",
                    "vi": "hành động từ bỏ một ý tưởng hoặc dừng một hoạt động mà không có ý định quay lại với nó"
                },
                "examples": [
                    {
                        "en": "the government’s abandonment of its new economic policy",
                        "vi": "chính phủ từ bỏ chính sách kinh tế mới của mình"
                    }
                ]
            }
        ]
    },
    {
        "id": "9a7f3741d9c84c73abddf05eda9c4807",
        "word": "abdicate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæbdɪkeɪt/",
            "us": "/ˈæbdɪkeɪt/"
        },
        "nearby": [
            {
                "word": "ABC",
                "pos": "abbreviation"
            },
            {
                "word": "ABD",
                "pos": "abbreviation"
            },
            {
                "word": "abdicate",
                "pos": "verb"
            },
            {
                "word": "abdication",
                "pos": "noun"
            },
            {
                "word": "the abdication crisis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give up the position of being king, queen or emperor",
                    "vi": "từ bỏ vị trí là vua, hoàng hậu hoặc hoàng đế"
                },
                "examples": [
                    {
                        "en": "He abdicated in favour of his son.",
                        "vi": "Ông thoái vị để ủng hộ con trai mình."
                    },
                    {
                        "en": "abdicate something She was forced to abdicate the throne of Spain.",
                        "vi": "thoái vị một cái gì đó Cô bị buộc phải thoái vị ngai vàng của Tây Ban Nha."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail or refuse to perform a duty",
                    "vi": "không hoặc từ chối thực hiện nhiệm vụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6e930c9e7357473fa370c866859b8827",
        "word": "abdication",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæbdɪˈkeɪʃn/",
            "us": "/ˌæbdɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "ABD",
                "pos": "abbreviation"
            },
            {
                "word": "abdicate",
                "pos": "verb"
            },
            {
                "word": "abdication",
                "pos": "noun"
            },
            {
                "word": "the abdication crisis",
                "pos": "noun"
            },
            {
                "word": "abdomen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of giving up the position of being king or queen",
                    "vi": "hành động từ bỏ vị trí vua hoặc hoàng hậu"
                },
                "examples": [
                    {
                        "en": "the chain of events leading to the king's abdication",
                        "vi": "chuỗi sự kiện dẫn đến sự thoái vị của nhà vua"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of failing or refusing to perform a duty",
                    "vi": "thực tế là không hoặc từ chối thực hiện nhiệm vụ"
                },
                "examples": [
                    {
                        "en": "a complete abdication of responsibility by the government",
                        "vi": "sự thoái thác hoàn toàn trách nhiệm của chính phủ"
                    }
                ]
            }
        ]
    },
    {
        "id": "cf35d7c382544f9f866966306b18dc53",
        "word": "abort",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbɔːt/",
            "us": "/əˈbɔːrt/"
        },
        "nearby": [
            {
                "word": "aboriginal",
                "pos": "noun"
            },
            {
                "word": "aborigine",
                "pos": "noun"
            },
            {
                "word": "abort",
                "pos": "verb"
            },
            {
                "word": "abortion",
                "pos": "noun"
            },
            {
                "word": "abortionist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to end a pregnancy early in order to prevent a baby from developing and being born alive",
                    "vi": "kết thúc thai kỳ sớm để tránh thai nhi phát triển và sinh ra còn sống"
                },
                "examples": [
                    {
                        "en": "to abort a child/pregnancy/fetus",
                        "vi": "phá thai / mang thai / bào thai"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give birth to a child or young animal too early for it to survive",
                    "vi": "sinh con hoặc động vật non quá sớm để nó có thể sống sót"
                },
                "examples": [
                    {
                        "en": "The virus can cause pregnant animals to abort.",
                        "vi": "Vi rút có thể làm cho động vật mang thai bị sẩy thai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end or cause something to end before it has been completed, especially because it is likely to fail",
                    "vi": "kết thúc hoặc khiến điều gì đó kết thúc trước khi nó được hoàn thành, đặc biệt là vì nó có khả năng thất bại"
                },
                "examples": [
                    {
                        "en": "(computing) If the wrong password is given the program aborts.",
                        "vi": "(máy tính) Nếu mật khẩu sai được cung cấp, chương trình sẽ ngừng hoạt động."
                    },
                    {
                        "en": "abort something We had no option but to abort the mission.",
                        "vi": "hủy bỏ một cái gì đó Chúng tôi không có lựa chọn nào khác ngoài việc hủy bỏ nhiệm vụ."
                    },
                    {
                        "en": "The plan was aborted at the last minute.",
                        "vi": "Kế hoạch bị hủy bỏ vào phút cuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "116e76d1a12342b4b8ab7a0311b710fd",
        "word": "a miss is as good as a mile",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/mɪs/",
            "us": "/mɪs/"
        },
        "nearby": [
            {
                "word": "misrule",
                "pos": "noun"
            },
            {
                "word": "miss",
                "pos": "verb"
            },
            {
                "word": "miss",
                "pos": "noun"
            },
            {
                "word": "missal",
                "pos": "noun"
            },
            {
                "word": "the Miss America pageant",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used before the family name, or the first and family names, of a woman who is not married, in order to speak or write to her politely",
                    "vi": "được sử dụng trước họ, hoặc họ và tên của một người phụ nữ chưa kết hôn, để nói hoặc viết thư cho cô ấy một cách lịch sự"
                },
                "examples": [
                    {
                        "en": "That's all, thank you, Miss Lipman.",
                        "vi": "Đó là tất cả, cảm ơn cô, cô Lipman."
                    }
                ]
            },
            {
                "define": {
                    "en": "a title given to the winner of a beauty contest in a particular country, town, etc.",
                    "vi": "danh hiệu được trao cho người chiến thắng một cuộc thi sắc đẹp ở một quốc gia, thị trấn cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Miss Brighton",
                        "vi": "Cô Brighton"
                    },
                    {
                        "en": "the Miss World contest",
                        "vi": "cuộc thi Hoa hậu Thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially by men to address a young woman when they do not know her name",
                    "vi": "được đàn ông đặc biệt sử dụng để xưng hô với một phụ nữ trẻ khi họ không biết tên của cô ấy"
                },
                "examples": [
                    {
                        "en": "Will that be all, Miss?",
                        "vi": "Sẽ là tất cả, thưa cô?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a form of address by children in some schools to a woman teacher, whether she is married or not",
                    "vi": "được sử dụng như một dạng xưng hô của trẻ em ở một số trường với một giáo viên nữ, cho dù cô ấy đã kết hôn hay chưa"
                },
                "examples": [
                    {
                        "en": "Good morning, Miss!",
                        "vi": "Chúc quí cô buổi sáng tốt lành!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a girl or young woman",
                    "vi": "một cô gái hoặc phụ nữ trẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a failure to hit, catch or reach something",
                    "vi": "thất bại trong việc đánh, bắt hoặc tiếp cận một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The penalty miss cost us the game.",
                        "vi": "Quả phạt đền đã khiến chúng ta phải trả giá bằng trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide not to do something, eat something, etc.",
                    "vi": "quyết định không làm một cái gì đó, ăn một cái gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "I think I'll give badminton a miss tonight.",
                        "vi": "Tôi nghĩ tôi sẽ bỏ lỡ môn cầu lông tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is no real difference between only just failing in something and failing in it badly because the result is still the same",
                    "vi": "không có sự khác biệt thực sự giữa việc chỉ thất bại trong một cái gì đó và thất bại trong đó một cách tồi tệ bởi vì kết quả vẫn như nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "838b77ddefec42329e1580aa7a2ce9b4",
        "word": "bang goes something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/bæŋ/",
            "us": "/bæŋ/"
        },
        "nearby": [
            {
                "word": "bang",
                "pos": "verb"
            },
            {
                "word": "bang",
                "pos": "noun"
            },
            {
                "word": "bang",
                "pos": "adverb"
            },
            {
                "word": "bang",
                "pos": "exclamation"
            },
            {
                "word": "bang about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "exactly; completely",
                    "vi": "một cách chính xác; hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Our computers are bang up to date.",
                        "vi": "Máy tính của chúng tôi được cập nhật."
                    },
                    {
                        "en": "My estimate was bang on target.",
                        "vi": "Ước tính của tôi đã đạt mục tiêu."
                    },
                    {
                        "en": "You’re bang on time, as usual",
                        "vi": "Bạn vẫn đúng giờ, như thường lệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you say that something you hoped to have or achieve is no longer possible",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó bạn hy vọng có hoặc đạt được không còn khả thi nữa"
                },
                "examples": [
                    {
                        "en": "Bang went my hopes of promotion.",
                        "vi": "Bang đi với hy vọng thăng tiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with definite proof that you have committed a crime, so that you cannot claim to be innocent",
                    "vi": "với bằng chứng chắc chắn rằng bạn đã phạm tội, do đó bạn không thể tuyên bố là vô tội"
                },
                "examples": [
                    {
                        "en": "We've got you bang to rights handling stolen property.",
                        "vi": "Chúng tôi đã giúp bạn có quyền xử lý tài sản bị đánh cắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to explode or burst (= break apart) with a loud noise; to make a sudden loud noise",
                    "vi": "nổ hoặc nổ tung (= vỡ ra) với một tiếng ồn lớn; tạo ra một tiếng ồn lớn đột ngột"
                },
                "examples": [
                    {
                        "en": "A balloon suddenly went bang.",
                        "vi": "Một quả bóng bay đột nhiên nổ tung."
                    }
                ]
            }
        ]
    },
    {
        "id": "40c8c8b843134304b2f86e6092dec6a4",
        "word": "crestfallen",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrestfɔːlən/",
            "us": "/ˈkrestfɔːlən/"
        },
        "nearby": [
            {
                "word": "crest",
                "pos": "verb"
            },
            {
                "word": "crested",
                "pos": "adjective"
            },
            {
                "word": "crestfallen",
                "pos": "adjective"
            },
            {
                "word": "Cretaceous",
                "pos": "adjective"
            },
            {
                "word": "the Cretaceous",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sad and disappointed because you have failed and you did not expect to",
                    "vi": "buồn và thất vọng vì bạn đã thất bại và bạn không mong đợi"
                },
                "examples": [
                    {
                        "en": "Mrs Clark looked quite crestfallen all of a sudden.",
                        "vi": "Bà Clark đột nhiên trông khá bối rối."
                    }
                ]
            }
        ]
    },
    {
        "id": "48a1f4f2949642d6a47c2098ddfdcdcc",
        "word": "cut your losses",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/lɒs/",
            "us": "/lɔːs/"
        },
        "nearby": [
            {
                "word": "loser",
                "pos": "noun"
            },
            {
                "word": "lose yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "loss",
                "pos": "noun"
            },
            {
                "word": "loss adjuster",
                "pos": "noun"
            },
            {
                "word": "loss-leader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of no longer having something or as much of something; the process that leads to this",
                    "vi": "trạng thái không còn có một cái gì đó hoặc nhiều cái gì đó; quá trình dẫn đến điều này"
                },
                "examples": [
                    {
                        "en": "I want to report the loss of a package.",
                        "vi": "Tôi muốn báo cáo việc mất một gói hàng."
                    },
                    {
                        "en": "Insure your instrument against loss or damage.",
                        "vi": "Bảo đảm thiết bị của bạn không bị mất hoặc hư hỏng."
                    },
                    {
                        "en": "weight loss",
                        "vi": "giảm cân"
                    },
                    {
                        "en": "hearing/memory loss",
                        "vi": "giảm thính lực / trí nhớ"
                    },
                    {
                        "en": "The closure of the factory will lead to a number of job losses.",
                        "vi": "Việc đóng cửa nhà máy sẽ dẫn đến một số người mất việc làm."
                    },
                    {
                        "en": "When she died I was filled with a sense of loss.",
                        "vi": "Khi cô ấy mất, tôi tràn ngập cảm giác mất mát."
                    },
                    {
                        "en": "loss of something He suffered a loss of confidence.",
                        "vi": "mất một cái gì đó Anh ấy bị mất tự tin."
                    },
                    {
                        "en": "loss of earnings/income (= the money you do not earn because you are prevented from working)",
                        "vi": "mất thu nhập / thu nhập (= số tiền bạn không kiếm được vì bạn bị ngăn cản làm việc)"
                    },
                    {
                        "en": "The loss of her job was a terrible blow.",
                        "vi": "Việc cô ấy bị mất việc là một cú đánh khủng khiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that has been lost by a business or an organization",
                    "vi": "tiền đã bị thất thoát bởi một doanh nghiệp hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "The company has announced net losses of $1.5 million.",
                        "vi": "Công ty đã thông báo lỗ ròng 1,5 triệu đô la."
                    },
                    {
                        "en": "The banks incurred huge losses.",
                        "vi": "Các ngân hàng bị lỗ rất lớn."
                    },
                    {
                        "en": "loss on something We made a loss on (= lost money on) the deal.",
                        "vi": "thua lỗ đối với một thứ gì đó Chúng tôi đã lỗ khi (= mất tiền khi) giao dịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the death of a person",
                    "vi": "cái chết của một người"
                },
                "examples": [
                    {
                        "en": "He is mourning the loss of his wife.",
                        "vi": "Anh ấy đang để tang cho sự mất mát của người vợ của mình."
                    },
                    {
                        "en": "the tragic loss of a child",
                        "vi": "sự mất mát bi thảm của một đứa trẻ"
                    },
                    {
                        "en": "Enemy troops suffered heavy losses.",
                        "vi": "Quân địch bị tổn thất nặng."
                    },
                    {
                        "en": "The drought caused widespread loss of life.",
                        "vi": "Hạn hán gây ra thiệt hại về nhân mạng trên diện rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the disadvantage that is caused when somebody leaves, or when a useful or valuable object is taken away; a person who causes a disadvantage by leaving",
                    "vi": "sự bất lợi gây ra khi ai đó rời đi, hoặc khi một đồ vật hữu ích hoặc có giá trị bị lấy đi; một người gây ra bất lợi bằng cách bỏ đi"
                },
                "examples": [
                    {
                        "en": "a loss to somebody/something Her departure is a big loss to the school.",
                        "vi": "một mất mát đối với ai đó / điều gì đó Sự ra đi của cô ấy là một mất mát lớn đối với nhà trường."
                    },
                    {
                        "en": "She will be a great loss to the company.",
                        "vi": "Cô ấy sẽ là một tổn thất lớn cho công ty."
                    },
                    {
                        "en": "She wouldn't be able to attend the lecture, which was no great loss.",
                        "vi": "Cô ấy sẽ không thể tham dự buổi diễn thuyết, đó không phải là một mất mát lớn."
                    },
                    {
                        "en": "His death is a sad loss to all who knew him.",
                        "vi": "Cái chết của anh ấy là một mất mát đau buồn cho tất cả những người biết anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a failure to win a contest",
                    "vi": "thất bại trong việc giành chiến thắng trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "Brazil’s 2–1 loss to Argentina",
                        "vi": "Brazil thua 2–1 trước Argentina"
                    }
                ]
            },
            {
                "define": {
                    "en": "not knowing what to say or do",
                    "vi": "không biết phải nói gì hoặc làm gì"
                },
                "examples": [
                    {
                        "en": "His comments left me at a loss for words.",
                        "vi": "Những lời bình luận của anh ấy khiến tôi không nói nên lời."
                    },
                    {
                        "en": "I'm at a loss what to do next.",
                        "vi": "Tôi không biết phải làm gì tiếp theo."
                    },
                    {
                        "en": "We are at a loss to understand his actions.",
                        "vi": "Chúng tôi không hiểu được hành động của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that loses you money",
                    "vi": "theo cách khiến bạn mất tiền"
                },
                "examples": [
                    {
                        "en": "We are now operating at a loss.",
                        "vi": "Hiện chúng tôi đang hoạt động thua lỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that if somebody chooses not to do something, they will not obtain a benefit they could have had",
                    "vi": "được sử dụng để nói rằng nếu ai đó chọn không làm điều gì đó, họ sẽ không đạt được lợi ích mà họ có thể có"
                },
                "examples": [
                    {
                        "en": "If people can't appreciate how great this film is, it's their loss.",
                        "vi": "Nếu mọi người không thể đánh giá cao bộ phim này tuyệt vời như thế nào thì đó là sự mất mát của họ."
                    },
                    {
                        "en": "I can see you don't trust me. Well, that's your loss",
                        "vi": "Tôi có thể thấy bạn không tin tưởng tôi. Chà, đó là mất mát của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something that is not successful before the situation becomes even worse",
                    "vi": "ngừng làm điều gì đó không thành công trước khi tình hình trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "I decided to cut my losses and move back to England.",
                        "vi": "Tôi quyết định cắt lỗ và quay trở lại Anh."
                    },
                    {
                        "en": "He decided to cut his losses and sell the shares before they sank further.",
                        "vi": "Anh quyết định cắt lỗ và bán cổ phiếu trước khi chúng chìm sâu hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "173f543eb5724d74bc49d8e62c5d4f04",
        "word": "give somebody/something up as a bad job",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒɒb/",
            "us": "/dʒɑːb/"
        },
        "nearby": [
            {
                "word": "Joanna",
                "pos": ""
            },
            {
                "word": "Joanne",
                "pos": ""
            },
            {
                "word": "job",
                "pos": "noun"
            },
            {
                "word": "Job",
                "pos": "noun"
            },
            {
                "word": "job action",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work for which you receive regular payment",
                    "vi": "làm việc mà bạn nhận được thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "I don't have a job at present.",
                        "vi": "Hiện tại tôi không có việc làm."
                    },
                    {
                        "en": "He's trying to get a job.",
                        "vi": "Anh ấy đang cố gắng kiếm một công việc."
                    },
                    {
                        "en": "I'm thinking of applying for a new job.",
                        "vi": "Tôi đang nghĩ đến việc xin một công việc mới."
                    },
                    {
                        "en": "to look for/find a job",
                        "vi": "tìm kiếm / tìm việc làm"
                    },
                    {
                        "en": "Did they offer you the job?",
                        "vi": "Họ có cung cấp cho bạn công việc không?"
                    },
                    {
                        "en": "job as something She took a job as a waitress.",
                        "vi": "job as something Cô ấy đã nhận một công việc như một nhân viên phục vụ bàn."
                    },
                    {
                        "en": "job with somebody/something She's just started a job with a travel company.",
                        "vi": "job with somebody / something Cô ấy vừa bắt đầu công việc với một công ty du lịch."
                    },
                    {
                        "en": "His brother's just lost his job.",
                        "vi": "Anh trai anh ấy vừa bị mất việc."
                    },
                    {
                        "en": "to leave/quit your job",
                        "vi": "nghỉ việc / bỏ việc của bạn"
                    },
                    {
                        "en": "Don't be late again if you want to keep your job.",
                        "vi": "Đừng đến muộn một lần nữa nếu bạn muốn tiếp tục công việc của mình."
                    },
                    {
                        "en": "a temporary/permanent job",
                        "vi": "một công việc tạm thời / lâu dài"
                    },
                    {
                        "en": "a summer/Saturday/holiday/vacation job",
                        "vi": "một công việc mùa hè / thứ bảy / ngày lễ / kỳ nghỉ"
                    },
                    {
                        "en": "Both my parents have full-time jobs.",
                        "vi": "Cả bố mẹ tôi đều có công việc toàn thời gian."
                    },
                    {
                        "en": "Many women are in part-time jobs.",
                        "vi": "Nhiều phụ nữ đang làm công việc bán thời gian."
                    },
                    {
                        "en": "She's never had a steady job (= a job that is not going to end suddenly).",
                        "vi": "Cô ấy chưa bao giờ có một công việc ổn định (= một công việc sẽ không kết thúc đột ngột)."
                    },
                    {
                        "en": "It's one of the top jobs in management.",
                        "vi": "Đó là một trong những công việc hàng đầu trong quản lý."
                    },
                    {
                        "en": "job of something one of the people under consideration for the job of managing director",
                        "vi": "công việc của một cái gì đó một trong những người đang được xem xét cho vị trí giám đốc quản lý"
                    },
                    {
                        "en": "in a job an increase in the number of people in jobs (= having jobs)",
                        "vi": "trong một công việc, số lượng người có việc làm tăng lên (= có việc làm)"
                    },
                    {
                        "en": "out of a job He's been out of a job (= unemployed) for six months now.",
                        "vi": "out of a job Anh ấy đã mất việc làm (= thất nghiệp) được sáu tháng rồi."
                    },
                    {
                        "en": "The takeover of the company is bound to mean more job losses.",
                        "vi": "Việc tiếp quản công ty chắc chắn đồng nghĩa với việc mất việc làm nhiều hơn."
                    },
                    {
                        "en": "There is so much competition in the job market currently.",
                        "vi": "Có rất nhiều cạnh tranh trong thị trường việc làm hiện nay."
                    },
                    {
                        "en": "He certainly knows his job (= is very good at his job).",
                        "vi": "Anh ấy chắc chắn biết công việc của mình (= rất giỏi trong công việc của mình)."
                    },
                    {
                        "en": "I'm only doing my job (= I'm doing what I am paid to do).",
                        "vi": "I'm only doing my job (= Tôi đang làm những gì tôi được trả tiền để làm)."
                    },
                    {
                        "en": "These projects will help create jobs in rural areas.",
                        "vi": "Các dự án này sẽ giúp tạo việc làm ở các vùng nông thôn."
                    },
                    {
                        "en": "The alternative would have been to cut jobs to contain costs.",
                        "vi": "Giải pháp thay thế là cắt giảm việc làm để giảm chi phí."
                    },
                    {
                        "en": "The closure of the factory will mean the loss of over 800 jobs.",
                        "vi": "Việc đóng cửa nhà máy sẽ đồng nghĩa với việc mất đi hơn 800 việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular task or piece of work that you have to do",
                    "vi": "một nhiệm vụ hoặc một phần công việc cụ thể mà bạn phải làm"
                },
                "examples": [
                    {
                        "en": "I've got various jobs around the house to do.",
                        "vi": "Tôi có nhiều công việc xung quanh nhà để làm."
                    },
                    {
                        "en": "Sorting these papers out is going to be a long job.",
                        "vi": "Việc sắp xếp những giấy tờ này sẽ là một công việc lâu dài."
                    },
                    {
                        "en": "The builder has a couple of jobs on at the moment.",
                        "vi": "Người xây dựng có một vài công việc vào lúc này."
                    },
                    {
                        "en": "job of doing something She's taken on the job of organizing the Christmas party.",
                        "vi": "job of doing something Cô ấy đảm nhận công việc tổ chức bữa tiệc Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a responsibility or duty",
                    "vi": "một trách nhiệm hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "He said he wouldn't do it because it wasn't his job.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không làm điều đó vì đó không phải là công việc của anh ấy."
                    },
                    {
                        "en": "somebody's job to do something It's not my job to lock up!",
                        "vi": "nhiệm vụ của ai đó để làm điều gì đó Không phải việc của tôi là nhốt!"
                    },
                    {
                        "en": "It's the job of the press to expose wrongdoing.",
                        "vi": "Đó là công việc của báo chí để vạch trần những hành vi sai trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a crime, especially stealing",
                    "vi": "một tội ác, đặc biệt là ăn cắp"
                },
                "examples": [
                    {
                        "en": "a bank job",
                        "vi": "một công việc ngân hàng"
                    },
                    {
                        "en": "He got six months for that last job he did.",
                        "vi": "Anh ấy có sáu tháng cho công việc cuối cùng mà anh ấy đã làm."
                    },
                    {
                        "en": "an inside job (= done by somebody in the organization where the crime happens)",
                        "vi": "một công việc bên trong (= được thực hiện bởi ai đó trong tổ chức nơi tội phạm xảy ra)"
                    },
                    {
                        "en": "The gang bungled the job and got caught.",
                        "vi": "Cả nhóm đã làm hỏng công việc và bị bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular kind of thing",
                    "vi": "một loại điều cụ thể"
                },
                "examples": [
                    {
                        "en": "It's real wood—not one of those plastic jobs.",
                        "vi": "Đó là gỗ thật - không phải là một trong những công việc bằng nhựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item of work that is done by a computer as a single unit",
                    "vi": "một hạng mục công việc được thực hiện bởi máy tính như một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "The job can be processed overnight.",
                        "vi": "Công việc có thể được xử lý trong một sớm một chiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to allow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để cho phép điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "unemployed for a short time. People say ‘between jobs’ to avoid saying ‘unemployed’.",
                    "vi": "thất nghiệp trong một thời gian ngắn. Người ta nói 'giữa các công việc' để tránh nói 'thất nghiệp'."
                },
                "examples": [
                    {
                        "en": "He's between jobs at the moment so he's using the time to do some voluntary work.",
                        "vi": "Hiện tại anh ấy đang bận rộn với nhiều công việc nên anh ấy đang sử dụng thời gian để làm một số công việc tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very difficult or unpleasant job or time",
                    "vi": "một công việc hoặc thời gian rất khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've had a devil of a job finding you.",
                        "vi": "Tôi đã có một công việc quỷ dữ tìm thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something well, badly, etc.",
                    "vi": "để làm điều gì đó tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "They did a very professional job.",
                        "vi": "Họ đã làm một công việc rất chuyên nghiệp."
                    },
                    {
                        "en": "You've certainly made an excellent job of the kitchen (= for example, painting it).",
                        "vi": "Bạn chắc chắn đã hoàn thành xuất sắc công việc bếp núc (= ví dụ: sơn nhà)."
                    },
                    {
                        "en": "We haven’t done a very good job on the publicity for the show.",
                        "vi": "Chúng tôi đã không làm tốt công việc quảng bá cho chương trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be effective or successful in doing what you want",
                    "vi": "để trở nên hiệu quả hoặc thành công trong việc làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "This extra strong glue should do the job.",
                        "vi": "Keo cực mạnh này sẽ thực hiện công việc."
                    },
                    {
                        "en": "Try wedging it open—that should do the job.",
                        "vi": "Hãy thử mở nó ra — điều đó sẽ thực hiện được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/yourself to lose their/your job because the role is no longer required",
                    "vi": "khiến ai đó / chính bạn mất việc của họ / của bạn vì vai trò không còn cần thiết"
                },
                "examples": [
                    {
                        "en": "Our aim as a charity is to help people so successfully that we do ourselves out of a job.",
                        "vi": "Mục đích của chúng tôi với tư cách là một tổ chức từ thiện là giúp mọi người thành công đến mức chúng tôi hoàn thành công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to stop trying to help somebody or to do something because there is no hope of success",
                    "vi": "quyết định ngừng cố gắng giúp đỡ ai đó hoặc làm điều gì đó bởi vì không có hy vọng thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they have done well at something",
                    "vi": "được sử dụng để nói với ai đó rằng họ đã làm tốt một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about a situation or that somebody is lucky that something happened",
                    "vi": "được sử dụng để nói rằng bạn hài lòng về một tình huống hoặc ai đó may mắn vì điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "It's a good job you were there to help.",
                        "vi": "Đó là một công việc tốt bạn đã ở đó để giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "people use the expression jobs for the boys when they are criticizing the fact that somebody in power has given work to friends or relatives",
                    "vi": "mọi người sử dụng các công việc biểu đạt cho các cậu bé khi họ đang chỉ trích việc ai đó nắm quyền đã giao việc cho bạn bè hoặc người thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "exactly what is needed in a particular situation",
                    "vi": "chính xác những gì cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "That cup of tea was just the job.",
                        "vi": "Đó là một tách trà chỉ là công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept a bad or difficult situation and do as well as you can",
                    "vi": "chấp nhận một tình huống xấu hoặc khó khăn và làm tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not worth doing because it is against the rules or because it might cause you to lose your job",
                    "vi": "không đáng làm vì nó trái với quy tắc hoặc vì nó có thể khiến bạn mất việc"
                },
                "examples": [
                    {
                        "en": "It's more than my job's worth to let you in without a ticket.",
                        "vi": "Công việc của tôi còn hơn cả việc để bạn vào mà không cần vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a particular job",
                    "vi": "trong khi làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "No sleeping on the job!",
                        "vi": "Không ngủ trong công việc!"
                    },
                    {
                        "en": "on-the-job training",
                        "vi": "vào đào tạo nghề"
                    }
                ]
            },
            {
                "define": {
                    "en": "having sex",
                    "vi": "quan hệ tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop working in order to go on strike",
                    "vi": "ngừng làm việc để đình công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56ce49609caa4d8f86e05d17f5810733",
        "word": "negativity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌneɡəˈtɪvəti/",
            "us": "/ˌneɡəˈtɪvəti/"
        },
        "nearby": [
            {
                "word": "negative gearing",
                "pos": "noun"
            },
            {
                "word": "negatively",
                "pos": "adverb"
            },
            {
                "word": "negativity",
                "pos": "noun"
            },
            {
                "word": "negator",
                "pos": "noun"
            },
            {
                "word": "negging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of tending to consider only the bad side of something/somebody; a lack of enthusiasm or hope",
                    "vi": "thực tế là có xu hướng chỉ xem xét mặt xấu của điều gì đó / ai đó; thiếu nhiệt tình hoặc hy vọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c937233a6af14d7490fd821cfc9d9429",
        "word": "so much for something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/səʊ/",
            "us": "/səʊ/"
        },
        "nearby": [
            {
                "word": "snugly",
                "pos": "adverb"
            },
            {
                "word": "snugness",
                "pos": "noun"
            },
            {
                "word": "so",
                "pos": "adverb"
            },
            {
                "word": "So.",
                "pos": "abbreviation"
            },
            {
                "word": "so",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to such a great degree",
                    "vi": "đến một mức độ tuyệt vời"
                },
                "examples": [
                    {
                        "en": "Don't look so angry.",
                        "vi": "Đừng tức giận như vậy."
                    },
                    {
                        "en": "There's no need to worry so.",
                        "vi": "Không cần phải lo lắng như vậy."
                    },
                    {
                        "en": "Why has it taken so long?",
                        "vi": "Tại sao nó mất nhiều thời gian như vậy?"
                    },
                    {
                        "en": "That wasn't so bad, was it?",
                        "vi": "Điều đó không quá tệ, phải không?"
                    },
                    {
                        "en": "so… (that)… She spoke so quietly (that) I could hardly hear her.",
                        "vi": "vì vậy… (điều đó)… Cô ấy nói rất nhỏ (điều đó) tôi khó có thể nghe thấy cô ấy."
                    },
                    {
                        "en": "What is it that's so important it can't wait five minutes?",
                        "vi": "Điều gì là quan trọng đến mức không thể đợi năm phút?"
                    },
                    {
                        "en": "He was so impressed that he jumped up and down with excitement.",
                        "vi": "Anh ấy ấn tượng đến mức nhảy cẫng lên vì phấn khích."
                    },
                    {
                        "en": "She gets so caught up in her fame that she neglects her true friends.",
                        "vi": "Cô ấy bị cuốn vào danh vọng của mình đến nỗi cô ấy bỏ bê những người bạn thực sự của mình."
                    },
                    {
                        "en": "It was so incredibly cheap it was unbelievable.",
                        "vi": "Nó rẻ đến mức không thể tin được."
                    },
                    {
                        "en": "so… as to do something I'm not so stupid as to believe that.",
                        "vi": "vì vậy… để làm điều gì đó tôi không ngu ngốc đến mức tin vào điều đó."
                    },
                    {
                        "en": "(formal, especially British English) Would you be so kind as to lock the door when you leave?",
                        "vi": "(trang trọng, đặc biệt là tiếng Anh Anh) Bạn có vui lòng khóa cửa khi rời đi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "very; extremely",
                    "vi": "hết sức; cực kì"
                },
                "examples": [
                    {
                        "en": "I'm so glad to see you.",
                        "vi": "Tôi rất vui mừng khi thấy bạn."
                    },
                    {
                        "en": "The girls looked so pretty in their summer dresses.",
                        "vi": "Các cô gái trông thật xinh xắn trong trang phục mùa hè."
                    },
                    {
                        "en": "I was pleased that so many people turned up.",
                        "vi": "Tôi rất vui vì có rất nhiều người đến tham gia."
                    },
                    {
                        "en": "We have so much to do.",
                        "vi": "Chúng tôi có rất nhiều việc phải làm."
                    },
                    {
                        "en": "It's so good to have you back.",
                        "vi": "Thật tốt khi có bạn trở lại."
                    },
                    {
                        "en": "We've worked so hard to get to this point.",
                        "vi": "Chúng tôi đã làm việc rất chăm chỉ để đạt được điểm này."
                    },
                    {
                        "en": "They came so close to winning.",
                        "vi": "Họ đã đến rất gần với chiến thắng."
                    },
                    {
                        "en": "You're going to Harvard! That's so great!",
                        "vi": "Bạn sẽ đến Harvard! Thật tuyệt vời!"
                    },
                    {
                        "en": "Their attitude is so very English.",
                        "vi": "Thái độ của họ rất là tiếng Anh."
                    },
                    {
                        "en": "The article was just so much (= nothing but) nonsense.",
                        "vi": "Bài báo chỉ là quá nhiều (= không có gì nhưng) vô nghĩa."
                    },
                    {
                        "en": "I am so pleased with this new book.",
                        "vi": "Tôi rất hài lòng với cuốn sách mới này."
                    },
                    {
                        "en": "(British English) He sat there ever so quietly.",
                        "vi": "(Anh Anh) Anh ấy đã ngồi đó lặng lẽ như vậy."
                    },
                    {
                        "en": "(British English) I do love it so.",
                        "vi": "(Anh Anh) Tôi rất thích nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "not to the same degree",
                    "vi": "không cùng một mức độ"
                },
                "examples": [
                    {
                        "en": "I haven't enjoyed myself so much for a long time.",
                        "vi": "Đã lâu rồi tôi không được tận hưởng nhiều như vậy."
                    },
                    {
                        "en": "I have never felt so humiliated in my entire life.",
                        "vi": "Tôi chưa bao giờ cảm thấy nhục nhã như vậy trong suốt cuộc đời mình."
                    },
                    {
                        "en": "It wasn't so good as last time.",
                        "vi": "Nó không tốt như lần trước."
                    },
                    {
                        "en": "It's not so easy as you'd think.",
                        "vi": "Nó không dễ dàng như bạn nghĩ."
                    },
                    {
                        "en": "He was not so quick a learner as his brother.",
                        "vi": "Anh ấy không phải là một người học quá nhanh như anh trai của mình."
                    },
                    {
                        "en": "It's not so much a hobby as a career (= more like a career than a hobby).",
                        "vi": "Nó không phải là một sở thích nhiều như một nghề nghiệp (= giống một nghề nghiệp hơn là một sở thích)."
                    },
                    {
                        "en": "(disapproving) Off she went without so much as (= without even) a ‘goodbye’.",
                        "vi": "(không tán thành) Cô ấy đã đi mà không cần (= thậm chí không có) một lời 'tạm biệt'."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show the size, amount or number of something",
                    "vi": "được sử dụng để hiển thị kích thước, số lượng hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The fish was about so big (= said when using your hands to show the size).",
                        "vi": "Con cá to như vậy (= nói khi dùng tay để hiển thị kích thước)."
                    },
                    {
                        "en": "There are only so many (= only a limited number of) hours in a day.",
                        "vi": "Chỉ có rất nhiều (= chỉ một số lượng giới hạn) giờ trong một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer back to something that has already been mentioned",
                    "vi": "được sử dụng để đề cập đến một cái gì đó đã được đề cập đến"
                },
                "examples": [
                    {
                        "en": "‘Is he coming?’ ‘I hope so.’",
                        "vi": "Anh ấy đến?' 'Tôi cũng mong là như vậy.'"
                    },
                    {
                        "en": "‘Did they mind?’ ‘I don't think so.’",
                        "vi": "Họ có phiền không?' 'Tôi không nghĩ vậy.'"
                    },
                    {
                        "en": "If she notices, she never says so.",
                        "vi": "Nếu cô ấy để ý, cô ấy không bao giờ nói như vậy."
                    },
                    {
                        "en": "I might be away next week. If so, I won't be able to see you.",
                        "vi": "Tôi có thể đi xa vào tuần tới. Nếu vậy, tôi sẽ không thể gặp bạn."
                    },
                    {
                        "en": "We are very busy—so much so that we won't be able to take time off this year.",
                        "vi": "Chúng tôi rất bận - đến nỗi chúng tôi sẽ không thể nghỉ ngơi trong năm nay."
                    },
                    {
                        "en": "Programs are expensive, and even more so if you have to keep altering them.",
                        "vi": "Các chương trình rất tốn kém, và thậm chí còn hơn thế nữa nếu bạn phải tiếp tục thay đổi chúng."
                    },
                    {
                        "en": "I hear that you're a writer—is that so (= is that true)?",
                        "vi": "Tôi nghe nói rằng bạn là một nhà văn — có phải vậy không (= có đúng như vậy không)?"
                    },
                    {
                        "en": "George is going to help me, or so he says (= that is what he says but I am not sure if I believe him).",
                        "vi": "George sẽ giúp tôi, hoặc anh ấy nói (= đó là những gì anh ấy nói nhưng tôi không chắc mình có tin anh ấy không)."
                    },
                    {
                        "en": "They asked me to call them and I did so (= I called).",
                        "vi": "Họ yêu cầu tôi gọi cho họ và tôi đã làm như vậy (= Tôi đã gọi)."
                    },
                    {
                        "en": "She leaked the story to the media and, in so doing, helped bring down the president.",
                        "vi": "Cô ấy đã tiết lộ câu chuyện với giới truyền thông và làm như vậy đã giúp hạ bệ tổng thống."
                    },
                    {
                        "en": "He thinks I dislike him but that just isn't so.",
                        "vi": "Anh ấy nghĩ tôi không thích anh ấy nhưng không phải vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "also",
                    "vi": "cũng thế"
                },
                "examples": [
                    {
                        "en": "Times have changed and so have I.",
                        "vi": "Thời đại đã thay đổi và tôi cũng vậy."
                    },
                    {
                        "en": "‘I prefer the first version.’ ‘So do we.’",
                        "vi": "Tôi thích phiên bản đầu tiên hơn.' 'Chúng ta cũng thế.'"
                    },
                    {
                        "en": "Temperatures are rising in Canada, and so too are the annual blueberry harvests.",
                        "vi": "Nhiệt độ đang tăng lên ở Canada, và mùa thu hoạch việt quất hàng năm cũng vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree that something is true, especially when you are surprised",
                    "vi": "đã từng đồng ý rằng điều gì đó là đúng, đặc biệt là khi bạn ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "‘You were there, too.’ ‘So I was—I'd forgotten.’",
                        "vi": "Bạn cũng ở đó.' \"Vì vậy, tôi đã - tôi đã quên.\""
                    },
                    {
                        "en": "‘There's another one.’ ‘So there is.’",
                        "vi": "Còn một cái khác. 'Vì vậy, có.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used, often with a negative, before adjectives and noun phrases to emphasize something that you are saying",
                    "vi": "được sử dụng, thường với một phủ định, trước các tính từ và cụm danh từ để nhấn mạnh điều gì đó mà bạn đang nói"
                },
                "examples": [
                    {
                        "en": "He is so not the right person for you.",
                        "vi": "Anh ấy không phải là người phù hợp với bạn."
                    },
                    {
                        "en": "That is so not cool.",
                        "vi": "Điều đó không phải là mát mẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used, especially by children, to say that what somebody says is not the case and the opposite is true",
                    "vi": "được sử dụng, đặc biệt là bởi trẻ em, để nói rằng những gì ai đó nói không phải như vậy và điều ngược lại là đúng"
                },
                "examples": [
                    {
                        "en": "‘You're not telling the truth, are you?’ ‘I am, so!’",
                        "vi": "Bạn không nói sự thật, phải không?' 'Tôi rất!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are showing somebody how to do something or telling them how something happened",
                    "vi": "được sử dụng khi bạn chỉ cho ai đó cách làm điều gì đó hoặc cho họ biết điều gì đó đã xảy ra như thế nào"
                },
                "examples": [
                    {
                        "en": "Stand with your arms out, so.",
                        "vi": "Hãy đứng với cánh tay của bạn, vì vậy."
                    },
                    {
                        "en": "(literary) So it was that he finally returned home.",
                        "vi": "(văn học) Vậy là cuối cùng anh ấy cũng đã trở về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "used at the end of a list to show that it continues in the same way",
                    "vi": "được sử dụng ở cuối danh sách để cho thấy rằng nó tiếp tục theo cùng một cách"
                },
                "examples": [
                    {
                        "en": "We discussed everything—when to go, what to see and so on.",
                        "vi": "Chúng tôi đã thảo luận về mọi thứ — đi khi nào, xem gì, v.v."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give an important extra reason why something is true",
                    "vi": "được sử dụng để cung cấp thêm một lý do quan trọng tại sao điều gì đó là đúng"
                },
                "examples": [
                    {
                        "en": "His achievement is remarkable; all the more so because he had no help at all.",
                        "vi": "Thành tích của anh ấy thật đáng nể; hơn thế nữa bởi vì anh ta không có sự giúp đỡ nào cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a number, an amount, etc. to show that it is not exact",
                    "vi": "được sử dụng sau một số, một số tiền, v.v. để cho thấy rằng nó không chính xác"
                },
                "examples": [
                    {
                        "en": "There were twenty or so (= about twenty) people there.",
                        "vi": "Có khoảng hai mươi (= khoảng hai mươi) người ở đó."
                    },
                    {
                        "en": "We stayed for an hour or so.",
                        "vi": "Chúng tôi ở lại trong một giờ hoặc lâu hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the intention of doing something",
                    "vi": "với ý định làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We went early so as to get good seats.",
                        "vi": "Chúng tôi đã đi sớm để có được chỗ ngồi tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you accept something and will not try to change it or cannot change it",
                    "vi": "được sử dụng để thể hiện rằng bạn chấp nhận điều gì đó và sẽ không cố gắng thay đổi nó hoặc không thể thay đổi nó"
                },
                "examples": [
                    {
                        "en": "If he doesn't want to be involved, then so be it.",
                        "vi": "Nếu anh ấy không muốn tham gia, thì cứ thế."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you have finished talking about something",
                    "vi": "được sử dụng để cho thấy rằng bạn đã nói xong về điều gì đó"
                },
                "examples": [
                    {
                        "en": "So much for the situation in Germany. Now we turn our attention to France.",
                        "vi": "Rất nhiều cho tình hình ở Đức. Bây giờ chúng tôi chuyển sự chú ý sang Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that something has not been successful or useful",
                    "vi": "được sử dụng để gợi ý rằng điều gì đó không thành công hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "So much for that idea!",
                        "vi": "Có rất nhiều ý kiến!"
                    }
                ]
            },
            {
                "define": {
                    "en": "in such a way that",
                    "vi": "trong một cách như vậy mà"
                },
                "examples": [
                    {
                        "en": "The programme has been so organized that none of the talks overlap.",
                        "vi": "Chương trình đã được tổ chức đến mức không có cuộc hội đàm nào trùng lặp."
                    }
                ]
            }
        ]
    },
    {
        "id": "6107a3d41a684340baa99efe9d4ae34e",
        "word": "so near and yet so far",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/nɪə(r)/",
            "us": "/nɪr/"
        },
        "nearby": [
            {
                "word": "near",
                "pos": "preposition"
            },
            {
                "word": "near",
                "pos": "adjective"
            },
            {
                "word": "near",
                "pos": "adverb"
            },
            {
                "word": "near",
                "pos": "verb"
            },
            {
                "word": "nearby",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "at a short distance away",
                    "vi": "ở một khoảng cách ngắn"
                },
                "examples": [
                    {
                        "en": "A bomb exploded somewhere near.",
                        "vi": "Một quả bom đã phát nổ ở đâu đó gần đó."
                    },
                    {
                        "en": "She took a step nearer.",
                        "vi": "Cô ấy tiến gần hơn một bước."
                    },
                    {
                        "en": "Visitors came from near and far.",
                        "vi": "Du khách gần xa đến tham dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short time away in the future",
                    "vi": "một thời gian ngắn trong tương lai"
                },
                "examples": [
                    {
                        "en": "The exams are drawing near.",
                        "vi": "Các kỳ thi đang đến gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost",
                    "vi": "hầu hết"
                },
                "examples": [
                    {
                        "en": "a near-perfect performance",
                        "vi": "một màn trình diễn gần như hoàn hảo"
                    },
                    {
                        "en": "I'm as near certain as can be.",
                        "vi": "Tôi gần như chắc chắn có thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "as accurately as",
                    "vi": "chính xác như"
                },
                "examples": [
                    {
                        "en": "There were about 3 000 people there, as near as I could judge.",
                        "vi": "Có khoảng 3.000 người ở đó, gần như tôi có thể đánh giá được."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that an amount is so nearly correct that the difference does not matter",
                    "vi": "được sử dụng để nói rằng một số tiền gần đúng đến mức chênh lệch không quan trọng"
                },
                "examples": [
                    {
                        "en": "It will cost £350, or as near as dammit.",
                        "vi": "Nó sẽ có giá £ 350, hoặc gần như chết tiệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is so nearly true that the difference does not matter",
                    "vi": "được sử dụng để nói rằng một cái gì đó gần như đúng đến nỗi sự khác biệt không quan trọng"
                },
                "examples": [
                    {
                        "en": "We've been here twenty years, near enough.",
                        "vi": "Chúng tôi đã ở đây hai mươi năm, gần đủ rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "far from; not at all",
                    "vi": "xa Tu; không có gì"
                },
                "examples": [
                    {
                        "en": "The job doesn't pay anywhere near enough for me.",
                        "vi": "Công việc không trả đủ cho tôi."
                    },
                    {
                        "en": "Older cars are nowhere near as fuel-efficient as modern cars.",
                        "vi": "Những chiếc ô tô cũ giờ không tiết kiệm nhiên liệu bằng những chiếc ô tô hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost; almost completely",
                    "vi": "hầu hết; gần như hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The first stage is pretty near finished.",
                        "vi": "Giai đoạn đầu tiên là khá gần hoàn thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to comment on something that was almost successful but in fact failed",
                    "vi": "đã từng nhận xét về điều gì đó gần như thành công nhưng thực tế lại thất bại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8797b47121c642ebac536386b39a85f6",
        "word": "throw your hand in",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hænd/",
            "us": "/hænd/"
        },
        "nearby": [
            {
                "word": "hamstring",
                "pos": "verb"
            },
            {
                "word": "Tony Hancock",
                "pos": ""
            },
            {
                "word": "hand",
                "pos": "noun"
            },
            {
                "word": "hand",
                "pos": "verb"
            },
            {
                "word": "hand around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the body at the end of the arm, including the fingers and thumb",
                    "vi": "phần cơ thể ở cuối cánh tay, bao gồm các ngón tay và ngón cái"
                },
                "examples": [
                    {
                        "en": "Ian placed a hand on her shoulder.",
                        "vi": "Ian đặt một tay lên vai cô."
                    },
                    {
                        "en": "Keep both hands on the steering wheel at all times.",
                        "vi": "Luôn giữ cả hai tay trên vô lăng."
                    },
                    {
                        "en": "She had a large diamond on the ring finger of her left hand.",
                        "vi": "Cô có một viên kim cương lớn trên ngón áp út của bàn tay trái."
                    },
                    {
                        "en": "in your hand He was holding a large mug of coffee in his right hand.",
                        "vi": "trong tay bạn Anh ấy đang cầm một cốc cà phê lớn trên tay phải."
                    },
                    {
                        "en": "Put your hand up if you know the answer.",
                        "vi": "Đưa tay lên nếu bạn biết câu trả lời."
                    },
                    {
                        "en": "She was on (her) hands and knees (= crawling on the floor) looking for an earring.",
                        "vi": "Cô ấy chống tay và đầu gối (= bò trên sàn) tìm bông tai."
                    },
                    {
                        "en": "Couples strolled past holding hands.",
                        "vi": "Cặp đôi nắm tay nhau đi dạo qua."
                    },
                    {
                        "en": "She introduced us and we shook hands.",
                        "vi": "Cô ấy giới thiệu chúng tôi và chúng tôi bắt tay nhau."
                    },
                    {
                        "en": "Give me your hand (= hold my hand) while we cross the road.",
                        "vi": "Đưa tay cho tôi (= nắm tay tôi) khi chúng ta băng qua đường."
                    },
                    {
                        "en": "The crowd threw up their hands (= lifted them into the air) in dismay.",
                        "vi": "Đám đông giơ tay (= nhấc lên không trung) trong sự thất kinh."
                    },
                    {
                        "en": "He killed the snake with his bare hands (= using only his hands).",
                        "vi": "Anh ta giết con rắn bằng tay không (= chỉ dùng tay)."
                    },
                    {
                        "en": "a hand gesture/signal",
                        "vi": "một cử chỉ / tín hiệu tay"
                    },
                    {
                        "en": "a hand towel (= a small towel for drying your hands on)",
                        "vi": "một chiếc khăn lau tay (= một chiếc khăn nhỏ để lau khô tay của bạn)"
                    },
                    {
                        "en": "a hand drill (= one that is used by turning a handle rather than powered by electricity)",
                        "vi": "máy khoan cầm tay (= máy được sử dụng bằng cách xoay tay cầm thay vì chạy bằng điện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "using the hand or number of hands mentioned",
                    "vi": "sử dụng bàn tay hoặc số lượng bàn tay được đề cập"
                },
                "examples": [
                    {
                        "en": "a one-handed catch",
                        "vi": "bắt bằng một tay"
                    },
                    {
                        "en": "left-handed scissors (= intended to be held in your left hand)",
                        "vi": "kéo tay trái (= dự định cầm bằng tay trái của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "help in doing something",
                    "vi": "giúp đỡ trong việc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The neighbours are always willing to lend a hand.",
                        "vi": "Những người hàng xóm luôn sẵn lòng giúp một tay."
                    },
                    {
                        "en": "hand with something Let me give you a hand with those bags (= help you to carry them).",
                        "vi": "hand with something Hãy để tôi giúp bạn một tay với những chiếc túi đó (= giúp bạn xách chúng)."
                    },
                    {
                        "en": "Do you need a hand with those invoices?",
                        "vi": "Bạn có cần một tay với những hóa đơn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part or role that somebody/something plays in a particular situation; somebody’s influence in a situation",
                    "vi": "một phần hoặc vai trò mà ai đó / điều gì đó đóng trong một tình huống cụ thể; ảnh hưởng của ai đó trong một tình huống"
                },
                "examples": [
                    {
                        "en": "Early reports suggest the hand of rebel forces in the bombings.",
                        "vi": "Các báo cáo ban đầu cho thấy có bàn tay của lực lượng nổi dậy trong các vụ đánh bom."
                    },
                    {
                        "en": "Several of his colleagues had a hand in his downfall.",
                        "vi": "Một số đồng nghiệp của ông đã nhúng tay vào sự sụp đổ của ông."
                    },
                    {
                        "en": "This appointment was an attempt to strengthen her hand in policy discussions.",
                        "vi": "Việc bổ nhiệm này là một nỗ lực để củng cố sự tham gia của bà trong các cuộc thảo luận chính sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a clock or watch that points to the numbers",
                    "vi": "một bộ phận của đồng hồ hoặc đồng hồ chỉ vào các số"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who does physical work on a farm or in a factory",
                    "vi": "một người làm công việc thể chất ở nông trại hoặc trong nhà máy"
                },
                "examples": [
                    {
                        "en": "The farmer would bring in hired hands to help him harvest the crop.",
                        "vi": "Người nông dân sẽ làm thuê để giúp anh ta thu hoạch vụ mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sailor on a ship",
                    "vi": "một thủy thủ trên một con tàu"
                },
                "examples": [
                    {
                        "en": "All hands on deck!",
                        "vi": "Tất cả các tay trên boong!"
                    }
                ]
            },
            {
                "define": {
                    "en": "by a person rather than a machine",
                    "vi": "bởi một người chứ không phải một cỗ máy"
                },
                "examples": [
                    {
                        "en": "hand-painted pottery",
                        "vi": "đồ gốm bằng tay"
                    },
                    {
                        "en": "hand-knitted",
                        "vi": "đan tay"
                    },
                    {
                        "en": "This item should be hand-washed.",
                        "vi": "Mặt hàng này nên được giặt tay."
                    },
                    {
                        "en": "Mail for hand delivery is put in a separate tray.",
                        "vi": "Thư gửi tận tay được để trong khay riêng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of playing cards given to one player in a game",
                    "vi": "một bộ thẻ chơi được trao cho một người chơi trong trò chơi"
                },
                "examples": [
                    {
                        "en": "to be dealt a good/bad hand",
                        "vi": "được xử lý một bàn tay tốt / xấu"
                    },
                    {
                        "en": "(figurative) She felt that life had dealt her a bad hand.",
                        "vi": "(nghĩa bóng) Cô ấy cảm thấy rằng cuộc đời đã giáng cho cô ấy một bàn tay tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "one stage of a game of cards",
                    "vi": "một giai đoạn của trò chơi bài"
                },
                "examples": [
                    {
                        "en": "I'll have to leave after this hand.",
                        "vi": "Tôi sẽ phải rời đi sau bàn tay này."
                    },
                    {
                        "en": "Who dealt the last hand?",
                        "vi": "Ai đã xử lý bàn tay cuối cùng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular style of writing",
                    "vi": "một phong cách viết cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit for measuring the height of a horse, equal to 4 inches or 10.16 centimetres",
                    "vi": "đơn vị đo chiều cao của ngựa, bằng 4 inch hoặc 10,16 cm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everyone helps or must help, especially in a difficult situation",
                    "vi": "mọi người giúp đỡ hoặc phải giúp đỡ, đặc biệt là trong một hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "There are 30 people coming to dinner tonight, so it's all hands on deck.",
                        "vi": "Có 30 người đến ăn tối tối nay, vì vậy tất cả đều sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to you in time or distance",
                    "vi": "gần với bạn trong thời gian hoặc khoảng cách"
                },
                "examples": [
                    {
                        "en": "Help was at hand.",
                        "vi": "Giúp đỡ đã ở trong tầm tay."
                    },
                    {
                        "en": "The property is ideally located with all local amenities close at hand.",
                        "vi": "Nơi nghỉ này tọa lạc tại một vị trí lý tưởng với tất cả các tiện nghi địa phương nằm trong tầm tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you experience something at the hands of somebody, they are the cause of it",
                    "vi": "nếu bạn trải nghiệm điều gì đó dưới bàn tay của ai đó, họ là nguyên nhân của nó"
                },
                "examples": [
                    {
                        "en": "They suffered years of repression at the hands of the old regime.",
                        "vi": "Họ phải chịu nhiều năm đàn áp dưới bàn tay của chế độ cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show skill at making or doing things with your hands",
                    "vi": "thể hiện kỹ năng làm hoặc làm mọi thứ bằng tay của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tie somebody’s hands and feet together so that they cannot move or escape",
                    "vi": "trói tay và chân của ai đó lại với nhau để họ không thể di chuyển hoặc trốn thoát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent somebody from doing what they want by creating rules, limits, etc.",
                    "vi": "để ngăn ai đó làm những gì họ muốn bằng cách tạo ra các quy tắc, giới hạn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is better to keep something that you already have than to risk losing it by trying to get much more",
                    "vi": "tốt hơn là bạn nên giữ một thứ mà bạn đã có hơn là mạo hiểm đánh mất nó bằng cách cố gắng kiếm được nhiều hơn nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to harm somebody who has helped you or supported you",
                    "vi": "làm hại ai đó đã giúp đỡ bạn hoặc hỗ trợ bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "by a person rather than a machine",
                    "vi": "bởi một người chứ không phải một cỗ máy"
                },
                "examples": [
                    {
                        "en": "The fabric was painted by hand.",
                        "vi": "Vải được vẽ bằng tay."
                    },
                    {
                        "en": "Delicate clothes should be washed by hand.",
                        "vi": "Quần áo mỏng nên được giặt bằng tay."
                    },
                    {
                        "en": "We can apply the power of computational tools in solving mathematical problems that cannot be solved by hand.",
                        "vi": "Chúng ta có thể áp dụng sức mạnh của các công cụ tính toán trong việc giải quyết các vấn đề toán học mà không thể giải quyết bằng tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a letter is delivered by hand, it is delivered by the person who wrote it, or somebody who is sent by them, rather than by post",
                    "vi": "nếu một bức thư được gửi bằng tay, thì nó sẽ được gửi bởi người viết nó, hoặc ai đó được họ gửi, chứ không phải qua đường bưu điện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you pay for goods and services cash in hand, you pay in cash, especially so that the person being paid can avoid paying tax on the amount",
                    "vi": "nếu bạn thanh toán cho hàng hoá và dịch vụ bằng tiền mặt, bạn phải trả bằng tiền mặt, đặc biệt để người được thanh toán có thể tránh phải trả thuế cho số tiền"
                },
                "examples": [
                    {
                        "en": "a cash-in-hand payment of £20",
                        "vi": "một khoản thanh toán bằng tiền mặt trị giá £ 20"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass to a different owner",
                    "vi": "để chuyển cho một chủ sở hữu khác"
                },
                "examples": [
                    {
                        "en": "The house has changed hands several times.",
                        "vi": "Ngôi nhà đã nhiều lần đổi chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "near; in a place where somebody/something can be reached easily",
                    "vi": "gần; ở một nơi mà ai đó / thứ gì đó có thể tiếp cận dễ dàng"
                },
                "examples": [
                    {
                        "en": "There are good cafes and a restaurant close at hand.",
                        "vi": "Có những quán cà phê tốt và một nhà hàng gần ngay tầm tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "an influence that controls or limits something",
                    "vi": "một ảnh hưởng kiểm soát hoặc hạn chế một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need to free business from the dead hand of bureaucracy.",
                        "vi": "Chúng ta cần giải phóng doanh nghiệp khỏi bàn tay chết chóc của bộ máy quan liêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who do not have enough to do often start to do wrong",
                    "vi": "những người không có đủ năng lực để làm thường bắt đầu làm sai"
                },
                "examples": [
                    {
                        "en": "She blamed the crimes on the local jobless teenagers. ‘The devil makes work for idle hands,’ she would say.",
                        "vi": "Cô đổ lỗi cho những thanh thiếu niên thất nghiệp tại địa phương. Cô ấy sẽ nói: 'Ma quỷ kiếm việc làm cho những đôi tay nhàn rỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to trust somebody and be willing to do what they say",
                    "vi": "tin tưởng ai đó và sẵn sàng làm những gì họ nói"
                },
                "examples": [
                    {
                        "en": "She'll have them eating out of her hand in no time.",
                        "vi": "Cô ấy sẽ nhanh chóng để chúng ăn sạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become controlled by somebody",
                    "vi": "bị ai đó kiểm soát"
                },
                "examples": [
                    {
                        "en": "The town fell into enemy hands.",
                        "vi": "Thị trấn rơi vào tay kẻ thù."
                    },
                    {
                        "en": "We don't want this document falling into the wrong hands.",
                        "vi": "Chúng tôi không muốn tài liệu này rơi vào tay kẻ xấu."
                    },
                    {
                        "en": "After the war, the hotel fell into the hands of an American consortium.",
                        "vi": "Sau chiến tranh, khách sạn rơi vào tay một tập đoàn của Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong control or discipline",
                    "vi": "kiểm soát hoặc kỷ luật mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Those children need a firm hand to make them behave.",
                        "vi": "Những đứa trẻ đó cần một bàn tay cứng rắn để bắt chúng cư xử."
                    }
                ]
            },
            {
                "define": {
                    "en": "by experiencing, seeing, etc. something yourself rather than being told about it by somebody else",
                    "vi": "bằng cách tự mình trải nghiệm, nhìn thấy, v.v. điều gì đó thay vì được người khác kể về nó"
                },
                "examples": [
                    {
                        "en": "The President visited the area to see the devastation at first hand.",
                        "vi": "Tổng thống đã đến thăm khu vực này để tận mắt chứng kiến sự tàn phá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring or hold your hands together",
                    "vi": "mang hoặc nắm tay của bạn lại với nhau"
                },
                "examples": [
                    {
                        "en": "She kept her hands folded in her lap.",
                        "vi": "Cô ấy vẫn để tay trong lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody do something that they do not want to do or make them do it sooner than they had intended",
                    "vi": "để khiến ai đó làm điều gì đó mà họ không muốn làm hoặc khiến họ làm điều đó sớm hơn họ đã dự định"
                },
                "examples": [
                    {
                        "en": "They decided to strike to force the management’s hand.",
                        "vi": "Họ quyết định đình công để buộc sự ra tay của ban quản lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get an advantage over somebody so that you are in control of a particular situation",
                    "vi": "để có được lợi thế hơn ai đó để bạn có thể kiểm soát một tình huống cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do physical work",
                    "vi": "làm công việc thể chất"
                },
                "examples": [
                    {
                        "en": "He's not frightened of getting his hands dirty.",
                        "vi": "Anh ấy không sợ bị bẩn tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get, have, etc. the opportunity to do what you want to do and to make your own decisions",
                    "vi": "để có, có, v.v. cơ hội để làm những gì bạn muốn làm và đưa ra quyết định của riêng bạn"
                },
                "examples": [
                    {
                        "en": "I was given a free hand in designing the syllabus.",
                        "vi": "Tôi đã được giao một tay miễn phí trong việc thiết kế giáo trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show your approval of somebody by clapping your hands; to be applauded in this way",
                    "vi": "để thể hiện sự tán thành của bạn đối với ai đó bằng cách vỗ tay của bạn; được tán thưởng theo cách này"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, let’s give a big hand to our special guests tonight.",
                        "vi": "Thưa quý vị và các bạn, hãy chung tay thật lớn cho những vị khách đặc biệt của chúng ta vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody",
                    "vi": "để giúp ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to ask somebody for something, especially money, in a very polite way that makes you seem less important",
                    "vi": "yêu cầu ai đó cho một cái gì đó, đặc biệt là tiền, theo một cách rất lịch sự khiến bạn có vẻ ít quan trọng hơn"
                },
                "examples": [
                    {
                        "en": "There’s no way he’ll go cap in hand to his brother.",
                        "vi": "Không đời nào anh ta lại tiếp tay với anh trai mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "permission to marry somebody, especially a woman",
                    "vi": "cho phép kết hôn với ai đó, đặc biệt là một người phụ nữ"
                },
                "examples": [
                    {
                        "en": "He asked the general for his daughter's hand in marriage.",
                        "vi": "Ông xin tướng quân cho con gái ông kết hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "working closely with somebody, especially in a secret and/or illegal way",
                    "vi": "hợp tác chặt chẽ với ai đó, đặc biệt là theo cách bí mật và / hoặc bất hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two people are hand in hand, they are holding each other’s hand",
                    "vi": "nếu hai người tay trong tay, họ đang nắm tay nhau"
                },
                "examples": [
                    {
                        "en": "They walked through the park hand in hand.",
                        "vi": "Họ tay trong tay đi dạo qua công viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two things go hand in hand, they are closely connected and one thing causes the other",
                    "vi": "nếu hai thứ đi đôi với nhau, chúng có mối liên hệ chặt chẽ với nhau và một thứ gây ra"
                },
                "examples": [
                    {
                        "en": "Poverty and poor health often go hand in hand.",
                        "vi": "Nghèo đói và sức khỏe kém thường đi đôi với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "easily and without any doubt",
                    "vi": "dễ dàng và không nghi ngờ gì"
                },
                "examples": [
                    {
                        "en": "They won hands down.",
                        "vi": "Họ đã thắng trong tay."
                    },
                    {
                        "en": "It is hands down the best movie this year.",
                        "vi": "Đây là bộ phim hay nhất năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to touch something/somebody",
                    "vi": "được sử dụng để nói với ai đó đừng chạm vào thứ gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "Get your hands off my wife!",
                        "vi": "Bỏ tay ra khỏi vợ tôi!"
                    },
                    {
                        "en": "Hey, hands off! That's my drink!",
                        "vi": "Này, bỏ tay ra! Đó là đồ uống của tôi!"
                    },
                    {
                        "en": "She warned her brother to keep his hands off her bag.",
                        "vi": "Cô cảnh báo anh trai mình đừng bỏ tay ra khỏi túi xách của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell a group of people to raise one hand in the air if they know the answer to a question, etc.",
                    "vi": "được sử dụng để yêu cầu một nhóm người giơ một tay lên trời nếu họ biết câu trả lời cho một câu hỏi, v.v."
                },
                "examples": [
                    {
                        "en": "Hands up all those who want to go swimming.",
                        "vi": "Giơ tay lên tất cả những ai muốn đi bơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used by somebody who is threatening people with a gun to tell them to raise both hands in the air",
                    "vi": "bị ai đó dùng súng đe dọa mọi người để bảo họ giơ cả hai tay lên trời"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very busy or too busy to do something else",
                    "vi": "rất bận hoặc quá bận để làm việc khác"
                },
                "examples": [
                    {
                        "en": "She certainly has her hands full with four kids in the house.",
                        "vi": "Cô ấy chắc chắn có đầy đủ bốn đứa trẻ trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to do what you want to do because of rules, promises, etc.",
                    "vi": "không thể làm những gì bạn muốn làm vì các quy tắc, lời hứa, v.v."
                },
                "examples": [
                    {
                        "en": "I really wish I could help but my hands are tied.",
                        "vi": "Tôi thực sự ước tôi có thể giúp đỡ nhưng tay tôi bị trói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have complete control or influence over somebody",
                    "vi": "có toàn quyền kiểm soát hoặc ảnh hưởng đến ai đó"
                },
                "examples": [
                    {
                        "en": "Even before he plays a note, he has the audience in the palm of his hand.",
                        "vi": "Ngay cả trước khi anh ấy chơi một nốt nhạc, anh ấy đã có khán giả trong lòng bàn tay của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have nothing to do or not be busy",
                    "vi": "không có gì để làm hoặc không bận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in a position where you have power or control over somebody/something",
                    "vi": "ở vị trí mà bạn có quyền lực hoặc quyền kiểm soát ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She had the whip hand and it was useless to resist.",
                        "vi": "Cô đã nắm trong tay chiếc roi và có chống cự cũng vô ích."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of doing something or of treating people that is much stronger and less sensitive than it needs to be",
                    "vi": "một cách làm điều gì đó hoặc đối xử với những người mạnh mẽ hơn và ít nhạy cảm hơn mức cần thiết"
                },
                "examples": [
                    {
                        "en": "the heavy hand of management",
                        "vi": "bàn tay nặng nề của quản lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody support in a difficult situation",
                    "vi": "để hỗ trợ ai đó trong một hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "Do you want me to come along and hold your hand?",
                        "vi": "Bạn có muốn tôi đi cùng và nắm tay bạn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to admit that you have made a mistake or are responsible for something bad",
                    "vi": "thừa nhận rằng bạn đã mắc sai lầm hoặc chịu trách nhiệm cho một điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "I have to hold my hands up and admit that some of the problems have been all my own fault.",
                        "vi": "Tôi phải cố chấp và thừa nhận rằng một số vấn đề là do lỗi của tôi."
                    },
                    {
                        "en": "The solicitor confirmed that his clients were holding their hands up to the offences.",
                        "vi": "Luật sư xác nhận rằng khách hàng của mình đã tiếp tay cho hành vi phạm tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "being taken care of or dealt with by somebody that you think you can rely on",
                    "vi": "được chăm sóc hoặc giải quyết bởi một người nào đó mà bạn nghĩ rằng bạn có thể dựa vào"
                },
                "examples": [
                    {
                        "en": "Can I leave these queries in your capable hands?",
                        "vi": "Tôi có thể để những truy vấn này trong tay bạn có năng lực không?"
                    },
                    {
                        "en": "He retired feeling confident that his company was in safe hands.",
                        "vi": "Ông đã nghỉ hưu và cảm thấy tự tin rằng công ty của mình đã nằm trong tay an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have time or money in hand, it is left and available to be used",
                    "vi": "nếu bạn có thời gian hoặc tiền bạc trong tay, nó sẽ còn lại và có sẵn để sử dụng"
                },
                "examples": [
                    {
                        "en": "We managed to redecorate the house and still have some savings in hand.",
                        "vi": "Chúng tôi đã xoay sở để trang trí lại ngôi nhà và vẫn còn một số tiền tiết kiệm trong tay."
                    },
                    {
                        "en": "She completed the first part of the exam with over an hour in hand.",
                        "vi": "Cô đã hoàn thành phần thi đầu tiên với hơn một giờ trong tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have a particular situation in hand, you are in control of it",
                    "vi": "nếu bạn có một tình huống cụ thể trong tay, bạn có quyền kiểm soát nó"
                },
                "examples": [
                    {
                        "en": "Don’t worry about the travel arrangements—everything is in hand.",
                        "vi": "Đừng lo lắng về việc sắp xếp việc đi lại — mọi thứ đã có trong tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the job, question, etc. in hand is the one that you are dealing with",
                    "vi": "công việc, câu hỏi, v.v. trong tay là công việc mà bạn đang giải quyết"
                },
                "examples": [
                    {
                        "en": "Please confine your comments to the topic in hand.",
                        "vi": "Vui lòng giới hạn ý kiến của bạn vào chủ đề trong tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody works a week, month, etc. in hand, they are paid for the work a week, etc. after they have completed it",
                    "vi": "nếu ai đó làm việc trong tay một tuần, một tháng, v.v., họ được trả công cho công việc đó một tuần, v.v. sau khi họ hoàn thành nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "being taken care of or controlled by somebody",
                    "vi": "được chăm sóc hoặc kiểm soát bởi ai đó"
                },
                "examples": [
                    {
                        "en": "The matter is now in the hands of my lawyer.",
                        "vi": "Vấn đề bây giờ nằm trong tay luật sư của tôi."
                    },
                    {
                        "en": "At that time, the castle was in enemy hands.",
                        "vi": "Khi đó, lâu đài đã nằm trong tay kẻ thù."
                    }
                ]
            },
            {
                "define": {
                    "en": "being taken care of well by somebody",
                    "vi": "được ai đó chăm sóc tốt"
                },
                "examples": [
                    {
                        "en": "I've left the kids in safe hands—with my parents.",
                        "vi": "Tôi đã để bọn trẻ trong tay an toàn — với cha mẹ tôi."
                    },
                    {
                        "en": "Their problem was in the safe hands of the experts.",
                        "vi": "Vấn đề của họ đã nằm trong tay các chuyên gia an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you use the words an iron fist/hand when describing the way that somebody behaves, you mean that they treat people severely. This treatment may be hidden behind a kind appearance (the velvet glove).",
                    "vi": "nếu bạn sử dụng các từ như một nắm đấm / bàn tay sắt khi mô tả cách một người nào đó cư xử, bạn có nghĩa là họ đối xử nghiêm khắc với mọi người. Phương pháp điều trị này có thể ẩn sau vẻ ngoài tử tế (chiếc găng tay nhung)."
                },
                "examples": [
                    {
                        "en": "They promised that the army would strike with an iron fist at any resistance.",
                        "vi": "Họ hứa rằng quân đội sẽ tấn công bằng nắm đấm sắt vào bất kỳ sự kháng cự nào."
                    },
                    {
                        "en": "The iron hand in the velvet glove approach seems to work best with this age group.",
                        "vi": "Phương pháp tiếp cận bàn tay sắt trong cách tiếp cận găng tay nhung dường như hiệu quả nhất với nhóm tuổi này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are too busy to do anything else",
                    "vi": "từng nói rằng bạn quá bận để làm bất cứ điều gì khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two people join hands, they hold each other’s hands",
                    "vi": "nếu hai người nắm tay nhau, họ nắm tay nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to work together in doing something",
                    "vi": "làm việc cùng nhau để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Education has been reluctant to join hands with business.",
                        "vi": "Giáo dục đã miễn cưỡng bắt tay với kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to occasionally do something that you used to do a lot so that you do not lose your skill at it",
                    "vi": "thỉnh thoảng làm điều gì đó mà bạn đã từng làm rất nhiều để bạn không mất kỹ năng làm việc đó"
                },
                "examples": [
                    {
                        "en": "She retired last year but still teaches the odd class to keep her hand in.",
                        "vi": "Cô đã nghỉ hưu năm ngoái nhưng vẫn dạy lớp lẻ để bám trụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very familiar with somebody/something",
                    "vi": "trở nên rất quen thuộc với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "This is where I grew up. I know this area like the back of my hand.",
                        "vi": "Đây là nơi tôi lớn lên. Tôi biết khu vực này như mu bàn tay của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to catch somebody that you are annoyed with",
                    "vi": "để bắt ai đó mà bạn khó chịu"
                },
                "examples": [
                    {
                        "en": "Wait till I get my hands on him!",
                        "vi": "Chờ cho đến khi tôi chạm tay vào anh ấy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to find or get something",
                    "vi": "để tìm hoặc lấy một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "I know their address is here somewhere, but I can't lay my hands on it right now.",
                        "vi": "Tôi biết địa chỉ của họ ở đâu đó, nhưng tôi không thể đặt tay vào nó ngay bây giờ."
                    },
                    {
                        "en": "I desperately need to get my hands on some money by Monday.",
                        "vi": "Tôi rất cần kiếm một số tiền trước thứ Hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend all the money you earn on basic needs such as food without being able to save any money",
                    "vi": "chi tiêu tất cả số tiền bạn kiếm được cho các nhu cầu cơ bản như thực phẩm mà không thể tiết kiệm được tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make/lose money very fast and in large quantities",
                    "vi": "kiếm / mất tiền rất nhanh và với số lượng lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that a job is made easier if a lot of people help",
                    "vi": "thường nói rằng một công việc sẽ dễ dàng hơn nếu có nhiều người giúp đỡ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do no work",
                    "vi": "không làm việc gì"
                },
                "examples": [
                    {
                        "en": "She hasn't done a hand's turn all week.",
                        "vi": "Cô ấy đã không làm một tay cả tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do nothing to help somebody",
                    "vi": "không làm gì để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "The children never lift a finger to help around the house.",
                        "vi": "Những đứa trẻ không bao giờ nhấc một ngón tay để giúp đỡ xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold out your hand for somebody to shake",
                    "vi": "đưa tay ra cho ai đó bắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "no longer your responsibility",
                    "vi": "không còn là trách nhiệm của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "on both/all sides; in both/all directions",
                    "vi": "trên cả hai / tất cả các bên; ở cả hai / tất cả các hướng"
                },
                "examples": [
                    {
                        "en": "Mist curled from the water on either hand.",
                        "vi": "Sương mù cuộn tròn trên mặt nước trên hai bàn tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "available, especially to help",
                    "vi": "có sẵn, đặc biệt là để giúp đỡ"
                },
                "examples": [
                    {
                        "en": "The emergency services were on hand with medical advice.",
                        "vi": "Các dịch vụ khẩn cấp đã có mặt với lời khuyên y tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have somebody/something on your hands, you are responsible for or have to deal with them/it",
                    "vi": "nếu bạn có ai đó / thứ gì đó trong tay, bạn phải chịu trách nhiệm hoặc phải giải quyết với họ / điều đó"
                },
                "examples": [
                    {
                        "en": "Let me take care of the invitations—you've enough on your hands with the caterers.",
                        "vi": "Hãy để tôi lo việc mời — bạn có đủ trong tay với những người phục vụ ăn uống."
                    },
                    {
                        "en": "They’ll have a fight on their hands if they want to close down the school.",
                        "vi": "Họ sẽ có một cuộc chiến tay đôi nếu họ muốn đóng cửa trường học."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce different points of view, ideas, etc., especially when they are opposites",
                    "vi": "được sử dụng để giới thiệu các quan điểm, ý tưởng, v.v. khác nhau, đặc biệt khi chúng đối lập nhau"
                },
                "examples": [
                    {
                        "en": "On the one hand they'd love to have kids, but on the other, they don't want to give up their freedom.",
                        "vi": "Một mặt họ muốn có con, nhưng mặt khác, họ không muốn từ bỏ sự tự do của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult or impossible to control",
                    "vi": "khó hoặc không thể kiểm soát"
                },
                "examples": [
                    {
                        "en": "Unemployment is getting out of hand.",
                        "vi": "Thất nghiệp đang vượt quá tầm tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you reject, etc. something out of hand, you do so immediately without thinking about it fully or listening to other people’s arguments",
                    "vi": "nếu bạn từ chối điều gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "All our suggestions were dismissed out of hand.",
                        "vi": "Tất cả các đề xuất của chúng tôi đã bị gạt ra khỏi tầm tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer your responsibility",
                    "vi": "không còn là trách nhiệm của bạn"
                },
                "examples": [
                    {
                        "en": "I'm afraid the matter is now out of my hands.",
                        "vi": "Tôi e rằng vấn đề bây giờ nằm ngoài tầm tay của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to achieve success by judging your position to be stronger than it really is",
                    "vi": "không đạt được thành công bằng cách đánh giá vị trí của bạn mạnh hơn thực tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who can do, or is doing, a job",
                    "vi": "một người có thể làm hoặc đang làm một công việc"
                },
                "examples": [
                    {
                        "en": "We need an extra pair of hands if we're going to finish on time.",
                        "vi": "Chúng tôi cần thêm một đôi tay nếu chúng tôi sẽ hoàn thành đúng thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do exactly what an enemy, opponent, etc. wants so that they gain the advantage in a particular situation",
                    "vi": "làm chính xác những gì kẻ thù, đối thủ, v.v. muốn để họ giành được lợi thế trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "If we get the police involved, we'll be playing right into the protesters' hands.",
                        "vi": "Nếu chúng tôi để cảnh sát vào cuộc, chúng tôi sẽ chơi ngay vào tay những người biểu tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend money or give it to somebody",
                    "vi": "tiêu tiền hoặc đưa nó cho ai đó"
                },
                "examples": [
                    {
                        "en": "I've heard he doesn't like putting his hand in his pocket.",
                        "vi": "Tôi nghe nói anh ấy không thích đút tay vào túi."
                    }
                ]
            },
            {
                "define": {
                    "en": "easily controlled or influenced by another person",
                    "vi": "dễ dàng bị kiểm soát hoặc bị ảnh hưởng bởi một người khác"
                },
                "examples": [
                    {
                        "en": "She'll persuade him. He's like putty in her hands.",
                        "vi": "Cô ấy sẽ thuyết phục anh ta. Anh ấy giống như cục bột trong tay cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit or threaten to hit somebody",
                    "vi": "đánh hoặc đe dọa đánh ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person that you can trust to do a job well",
                    "vi": "một người mà bạn có thể tin tưởng để hoàn thành tốt công việc"
                },
                "examples": [
                    {
                        "en": "Colleagues regard him as a safe pair of hands.",
                        "vi": "Đồng nghiệp coi anh như một đôi tay an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "by being told about something by somebody else who has seen it or heard about it, not by experiencing, seeing, etc. it yourself",
                    "vi": "bằng cách được kể về điều gì đó bởi một người nào đó đã nhìn thấy hoặc nghe nói về điều đó, chứ không phải bằng cách tự mình trải nghiệm, nhìn thấy, v.v."
                },
                "examples": [
                    {
                        "en": "I'm fed up of hearing about these decisions third hand!",
                        "vi": "Tôi chán ngấy khi nghe về những quyết định thứ ba này!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your plans or intentions known",
                    "vi": "để làm cho kế hoạch hoặc ý định của bạn được biết đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of voting for or against something in which people raise their hands to vote",
                    "vi": "một cách biểu quyết cho hoặc chống lại điều gì đó trong đó mọi người giơ tay biểu quyết"
                },
                "examples": [
                    {
                        "en": "The vote was passed by a show of hands.",
                        "vi": "Cuộc biểu quyết đã được thông qua bằng một cái giơ tay."
                    },
                    {
                        "en": "Let’s have a show of hands. Who’s in favour of the proposal?",
                        "vi": "Hãy giơ tay. Ai ủng hộ đề xuất?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop yourself from doing something; to prevent you from doing something",
                    "vi": "ngăn bản thân làm điều gì đó; để ngăn bạn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "It was prudence, not logic, that stayed his hand.",
                        "vi": "Đó là sự thận trọng, không phải logic, nằm trong tay anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself do something that you are afraid of",
                    "vi": "để khiến bản thân làm điều gì đó mà bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Taking her courage in both hands, she opened the door and walked in.",
                        "vi": "Lấy hết can đảm trên cả hai tay, cô mở cửa bước vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with somebody in a strict way in order to improve their behaviour",
                    "vi": "đối phó với ai đó một cách nghiêm ngặt để cải thiện hành vi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to deal with a particular situation yourself because you are not happy with the way that others are dealing with it",
                    "vi": "để tự mình đối phó với một tình huống cụ thể bởi vì bạn không hài lòng với cách mà những người khác đang đối phó với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them",
                    "vi": "làm điều gì đó bất hợp pháp để trừng phạt ai đó đã làm điều gì đó sai trái, thay vì để cảnh sát xử lý họ"
                },
                "examples": [
                    {
                        "en": "After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.",
                        "vi": "Sau hàng loạt vụ trộm trên địa bàn, cảnh sát lo ngại cư dân có thể sa lưới pháp luật."
                    },
                    {
                        "en": "When police failed to arrest the suspect, local people took the law into their own hands and beat him up.",
                        "vi": "Khi cảnh sát không bắt được nghi phạm, người dân địa phương đã lao vào luật pháp và đánh anh ta tới tấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to risk being killed",
                    "vi": "có nguy cơ bị giết"
                },
                "examples": [
                    {
                        "en": "You take your life in your hands just crossing the road here.",
                        "vi": "Bạn nắm lấy mạng sống của mình trong tay khi băng qua đường ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something or taking part in something, especially because you are not successful",
                    "vi": "ngừng làm điều gì đó hoặc tham gia vào điều gì đó, đặc biệt là vì bạn không thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to raise both hands in the air to show that you are feeling annoyed or upset about something",
                    "vi": "giơ cả hai tay lên trời để thể hiện rằng bạn đang cảm thấy bực mình hoặc khó chịu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "We threw up our hands in despair at the scale of the problem.",
                        "vi": "Chúng tôi đã vung tay lên trong tuyệt vọng trước quy mô của vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you can reach or get easily",
                    "vi": "mà bạn có thể tiếp cận hoặc lấy dễ dàng"
                },
                "examples": [
                    {
                        "en": "I'm afraid I don't have the latest figures to hand.",
                        "vi": "Tôi e rằng tôi không có số liệu mới nhất trong tay."
                    },
                    {
                        "en": "Keep a pen and paper to hand for details of this week’s competition.",
                        "vi": "Hãy cầm bút và giấy để biết chi tiết về cuộc thi tuần này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something such as an activity or a sport for the first time",
                    "vi": "để làm một cái gì đó chẳng hạn như một hoạt động hoặc một môn thể thao lần đầu tiên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start doing something or be able to do something, especially when you do it well",
                    "vi": "để bắt đầu làm điều gì đó hoặc có thể làm điều gì đó, đặc biệt là khi bạn làm tốt điều đó"
                },
                "examples": [
                    {
                        "en": "Jim can turn his hand to most jobs around the house.",
                        "vi": "Jim có thể trở tay với hầu hết các công việc xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of somebody’s needs so well that they do not have to do anything for themselves",
                    "vi": "chăm sóc nhu cầu của ai đó thật tốt để họ không phải làm bất cứ điều gì cho bản thân"
                },
                "examples": [
                    {
                        "en": "He seems to expect me to wait on him hand and foot.",
                        "vi": "Anh ta dường như mong đợi tôi chờ đợi anh ta bằng tay và chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to be responsible for or involved with somebody/something",
                    "vi": "từ chối chịu trách nhiệm hoặc liên quan đến ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "When her son was arrested again she washed her hands of him.",
                        "vi": "Khi con trai bà bị bắt một lần nữa, bà đã rửa tay cho nó."
                    },
                    {
                        "en": "I’ve washed my hands of the whole sordid business.",
                        "vi": "Tôi đã rửa sạch bàn tay của mình cho toàn bộ công việc bẩn thỉu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win something very easily",
                    "vi": "để giành được một cái gì đó rất dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to press somebody’s hand very hard when you shake hands",
                    "vi": "ấn mạnh tay ai đó khi bạn bắt tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hold your hands together, and twist and press them together in a way that shows you are anxious or upset, especially when you cannot change the situation",
                    "vi": "nắm hai tay lại với nhau, xoắn và ép chúng vào nhau theo cách thể hiện bạn đang lo lắng hoặc buồn bã, đặc biệt là khi bạn không thể thay đổi tình hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7b98e5905c2344b89b9c3bf9129371a4",
        "word": "write off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "write-in candidate",
                "pos": "noun"
            },
            {
                "word": "write into",
                "pos": "phrasal verb"
            },
            {
                "word": "write off",
                "pos": "phrasal verb"
            },
            {
                "word": "write-off",
                "pos": "noun"
            },
            {
                "word": "write out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to write to an organization or a company, usually in order to ask them to send you something",
                    "vi": "viết thư cho một tổ chức hoặc một công ty, thường là để yêu cầu họ gửi cho bạn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I've written off for the catalogue.",
                        "vi": "Tôi đã viết ra cho danh mục."
                    },
                    {
                        "en": "He decided to write off for the brochure.",
                        "vi": "Anh ấy quyết định viết tắt cho tập tài liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cancel a debt; to recognize that something is a failure, has no value, etc.",
                    "vi": "để hủy bỏ một khoản nợ; để nhận ra rằng một cái gì đó là một thất bại, không có giá trị, v.v."
                },
                "examples": [
                    {
                        "en": "to write off a debt/an investment",
                        "vi": "xóa nợ / đầu tư"
                    }
                ]
            },
            {
                "define": {
                    "en": "to damage something, especially a vehicle, so badly that it cannot be repaired or would cost more to repair than to replace",
                    "vi": "làm hỏng một thứ gì đó, đặc biệt là một chiếc xe, nặng đến mức không thể sửa chữa được hoặc sẽ tốn nhiều chi phí sửa chữa hơn là thay thế"
                },
                "examples": [
                    {
                        "en": "He’s written off two cars this year.",
                        "vi": "Anh ấy đã viết ra hai chiếc xe hơi trong năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide that somebody/something is a failure or not worth paying any attention to",
                    "vi": "để quyết định rằng ai đó / điều gì đó là thất bại hoặc không đáng để chú ý đến"
                },
                "examples": [
                    {
                        "en": "Don't write me off as a failure just because of that one time when things didn't go right.",
                        "vi": "Đừng coi tôi là một kẻ thất bại chỉ vì lần đó khi mọi thứ không như ý."
                    }
                ]
            }
        ]
    },
    {
        "id": "7205b8b7d74349ff83bdae75cb8cb0fd",
        "word": "the writing is on the wall",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈraɪtɪŋ/",
            "us": "/ˈraɪtɪŋ/"
        },
        "nearby": [
            {
                "word": "write-up",
                "pos": "noun"
            },
            {
                "word": "writhe",
                "pos": "verb"
            },
            {
                "word": "writing",
                "pos": "noun"
            },
            {
                "word": "writing desk",
                "pos": "noun"
            },
            {
                "word": "writing paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of writing, in contrast to reading, speaking, etc.",
                    "vi": "hoạt động viết, ngược lại với đọc, nói, v.v."
                },
                "examples": [
                    {
                        "en": "Our son’s having problems with his reading and writing (= at school)",
                        "vi": "Con trai chúng tôi gặp vấn đề về đọc và viết (= ở trường)"
                    },
                    {
                        "en": "a writing case (= containing paper, pens, etc.)",
                        "vi": "hộp đựng viết (= đựng giấy, bút, v.v.)"
                    },
                    {
                        "en": "Every morning the children do writing.",
                        "vi": "Mỗi sáng bọn trẻ tập viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of writing books, articles, etc., especially as a job",
                    "vi": "hoạt động viết sách, bài báo, v.v., đặc biệt là một công việc"
                },
                "examples": [
                    {
                        "en": "Only later did she discover a talent for writing.",
                        "vi": "Mãi sau này, cô mới phát hiện ra tài năng viết lách."
                    },
                    {
                        "en": "I wanted to try out a new style of writing.",
                        "vi": "Tôi muốn thử một phong cách viết mới."
                    },
                    {
                        "en": "creative writing",
                        "vi": "văn bản sáng tạo"
                    },
                    {
                        "en": "feminist/travel writing",
                        "vi": "nữ quyền / viết du lịch"
                    },
                    {
                        "en": "He is leaving the band to concentrate on his writing.",
                        "vi": "Anh ấy sẽ rời ban nhạc để tập trung vào việc viết lách của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "books, articles, etc. in general",
                    "vi": "sách, bài báo, v.v. nói chung"
                },
                "examples": [
                    {
                        "en": "The review is a brilliant piece of writing.",
                        "vi": "Đánh giá là một tác phẩm tuyệt vời của văn bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "words that have been written or painted on something",
                    "vi": "những từ đã được viết hoặc vẽ trên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "There was writing all over the desk.",
                        "vi": "Có chữ viết trên khắp bàn làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way in which somebody forms letters when they write",
                    "vi": "cách cụ thể mà ai đó tạo thành các chữ cái khi họ viết"
                },
                "examples": [
                    {
                        "en": "Who's this from? I don't recognize the writing.",
                        "vi": "Cái này của ai? Tôi không nhận dạng được chữ viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of pieces of writing, especially by a particular person or on a particular subject",
                    "vi": "một nhóm các bài viết, đặc biệt là của một người cụ thể hoặc về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "His experiences in India influenced his later writings.",
                        "vi": "Những kinh nghiệm của ông ở Ấn Độ đã ảnh hưởng đến các bài viết sau này của ông."
                    },
                    {
                        "en": "the writings of Hegel",
                        "vi": "các tác phẩm của Hegel"
                    },
                    {
                        "en": "writings on something His writings on complex subjects are clear and definitive.",
                        "vi": "các bài viết về một cái gì đó Các bài viết của anh ấy về các chủ đề phức tạp rất rõ ràng và dứt khoát."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the form of a letter, document, etc. (that gives proof of something)",
                    "vi": "dưới dạng một lá thư, tài liệu, v.v. (cung cấp bằng chứng về điều gì đó)"
                },
                "examples": [
                    {
                        "en": "All telephone reservations must be confirmed in writing.",
                        "vi": "Tất cả các đặt phòng qua điện thoại phải được xác nhận bằng văn bản."
                    },
                    {
                        "en": "Could you put your complaint in writing?",
                        "vi": "Bạn có thể gửi đơn khiếu nại của mình bằng văn bản không?"
                    },
                    {
                        "en": "You must get it in writing.",
                        "vi": "Bạn phải nhận được nó bằng văn bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are describing a situation in which there are signs that something is going to have problems or that it is going to be a failure",
                    "vi": "được sử dụng khi bạn đang mô tả một tình huống mà trong đó có dấu hiệu cho thấy một cái gì đó sẽ có vấn đề hoặc nó sẽ thất bại"
                },
                "examples": [
                    {
                        "en": "It is amazing that not one of them saw the writing on the wall.",
                        "vi": "Thật ngạc nhiên là không ai trong số họ nhìn thấy chữ viết trên tường."
                    }
                ]
            }
        ]
    },
    {
        "id": "19205bac565f478a91bd88386900479f",
        "word": "you win",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪn/",
            "us": "/wɪn/"
        },
        "nearby": [
            {
                "word": "wimp out",
                "pos": "phrasal verb"
            },
            {
                "word": "Lord Peter Wimsey",
                "pos": ""
            },
            {
                "word": "win",
                "pos": "verb"
            },
            {
                "word": "win",
                "pos": "noun"
            },
            {
                "word": "win around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be the most successful in a competition, race, battle, etc.",
                    "vi": "để thành công nhất trong một cuộc thi, cuộc đua, trận chiến, v.v."
                },
                "examples": [
                    {
                        "en": "Which team won?",
                        "vi": "Đội nào chiến thắng?"
                    },
                    {
                        "en": "win something to win an election",
                        "vi": "giành được một cái gì đó để giành chiến thắng trong một cuộc bầu cử"
                    },
                    {
                        "en": "to win a game/race/war/battle",
                        "vi": "để giành chiến thắng trong một trò chơi / cuộc đua / chiến tranh / trận chiến"
                    },
                    {
                        "en": "She loves to win an argument.",
                        "vi": "Cô ấy thích chiến thắng trong một cuộc tranh cãi."
                    },
                    {
                        "en": "win at something to win at cards/chess",
                        "vi": "chiến thắng ở một thứ gì đó để giành chiến thắng ở bài / cờ vua"
                    },
                    {
                        "en": "win (by something) (against somebody/something) France won by six goals to two against Denmark.",
                        "vi": "thắng (bằng cách nào đó) (chống lại ai đó / cái gì đó) Pháp đã thắng với cách biệt sáu bàn đến hai bàn trước Đan Mạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get something as the result of a competition, race, election, etc.",
                    "vi": "để có được thứ gì đó do kết quả của một cuộc cạnh tranh, chạy đua, bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "win something Britain won five gold medals.",
                        "vi": "giành được một cái gì đó Anh đã giành được năm huy chương vàng."
                    },
                    {
                        "en": "He won £3 000 in the lottery.",
                        "vi": "Anh ta đã trúng số £ 3 000 trong cuộc xổ số."
                    },
                    {
                        "en": "How many states did the Republicans win?",
                        "vi": "Đảng Cộng hòa đã giành được bao nhiêu bang?"
                    },
                    {
                        "en": "Everyone who takes part wins a small prize.",
                        "vi": "Tất cả những người tham gia sẽ giành được một giải thưởng nhỏ."
                    },
                    {
                        "en": "to win an award/a title",
                        "vi": "để giành được một giải thưởng / một danh hiệu"
                    },
                    {
                        "en": "win something from somebody The Conservatives won the seat from Labour in the last election.",
                        "vi": "giành được thứ gì đó từ ai đó Đảng Bảo thủ đã giành được ghế từ Lao động trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "win yourself/somebody something You've won yourself a trip to New York.",
                        "vi": "giành được cho mình / ai đó điều gì đó Bạn đã giành được cho mình một chuyến đi đến New York."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve or get something that you want, especially by your own efforts",
                    "vi": "để đạt được hoặc đạt được điều gì đó mà bạn muốn, đặc biệt là bằng nỗ lực của chính bạn"
                },
                "examples": [
                    {
                        "en": "They are trying to win support for their proposals.",
                        "vi": "Họ đang cố gắng giành được sự ủng hộ cho các đề xuất của họ."
                    },
                    {
                        "en": "The company has won a contract to supply books and materials to schools.",
                        "vi": "Công ty đã giành được hợp đồng cung cấp sách và tài liệu cho các trường học."
                    },
                    {
                        "en": "She won the admiration of many people in her battle against cancer.",
                        "vi": "Cô đã giành được sự ngưỡng mộ của nhiều người trong cuộc chiến chống lại căn bệnh ung thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful against somebody/something",
                    "vi": "để thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Despite strong opposition, the ruling party carried the day.",
                        "vi": "Bất chấp sự phản đối mạnh mẽ, đảng cầm quyền đã tiến hành ngày này."
                    },
                    {
                        "en": "Teamwork and persistence can still win the day.",
                        "vi": "Tinh thần đồng đội và sự bền bỉ vẫn có thể giành được chiến thắng trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win something very easily",
                    "vi": "để giành được một cái gì đó rất dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "whether you succeed or fail",
                    "vi": "cho dù bạn thành công hay thất bại"
                },
                "examples": [
                    {
                        "en": "Win or lose, we'll know we've done our best.",
                        "vi": "Dù thắng hay thua, chúng tôi sẽ biết mình đã cố gắng hết sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become famous or successful",
                    "vi": "trở nên nổi tiếng hoặc thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express sympathy for somebody who has been disappointed about something",
                    "vi": "được sử dụng để bày tỏ sự cảm thông cho ai đó đã thất vọng về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that there is no acceptable way of dealing with a particular situation",
                    "vi": "được sử dụng để nói rằng không có cách nào có thể chấp nhận được để đối phó với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "I can’t win. If I agree with her, she says I have no mind of my own; if I don’t, she says I’m being difficult.",
                        "vi": "Tôi không thể thắng. Nếu tôi đồng ý với cô ấy, cô ấy nói rằng tôi không có tâm trí của riêng mình; nếu tôi không làm vậy, cô ấy nói rằng tôi đang gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree to what somebody wants after you have failed to persuade them to do or let you do something else",
                    "vi": "đã từng đồng ý với những gì ai đó muốn sau khi bạn không thuyết phục được họ làm hoặc để bạn làm việc khác"
                },
                "examples": [
                    {
                        "en": "OK, you win. I'll admit I was wrong.",
                        "vi": "Được rồi bạn thắng. Tôi sẽ thừa nhận là tôi đã sai."
                    }
                ]
            }
        ]
    }
]