[
    {
        "id": "f968515e0635463aa43907ed2271f812",
        "word": "door",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dɔː(r)/",
            "us": "/dɔːr/"
        },
        "nearby": [
            {
                "word": "Doona",
                "pos": "noun"
            },
            {
                "word": "Doonesbury",
                "pos": ""
            },
            {
                "word": "door",
                "pos": "noun"
            },
            {
                "word": "doorbell",
                "pos": "noun"
            },
            {
                "word": "do-or-die",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of wood, glass, etc. that is opened and closed so that people can get in and out of a room, building, car, etc.; a similar thing in a cupboard",
                    "vi": "một miếng gỗ, thủy tinh, v.v. được đóng mở để mọi người có thể ra vào phòng, tòa nhà, xe hơi, v.v.; một thứ tương tự trong tủ"
                },
                "examples": [
                    {
                        "en": "Open the door!",
                        "vi": "Mở cửa!"
                    },
                    {
                        "en": "Close the door behind you, please.",
                        "vi": "Làm ơn đóng cửa lại."
                    },
                    {
                        "en": "The door closed behind him.",
                        "vi": "Cánh cửa đóng lại sau lưng anh."
                    },
                    {
                        "en": "to shut/slam/lock/unlock the door",
                        "vi": "đóng / sập / khóa / mở khóa cửa"
                    },
                    {
                        "en": "a knock on/at the door",
                        "vi": "một tiếng gõ cửa"
                    },
                    {
                        "en": "to knock/bang on the door",
                        "vi": "gõ / đập cửa"
                    },
                    {
                        "en": "to answer the door (= to go and open it because somebody has knocked on it or rung the bell)",
                        "vi": "để trả lời cánh cửa (= đi và mở nó vì ai đó đã gõ hoặc rung chuông)"
                    },
                    {
                        "en": "the front/back/side door (= at the entrance at the front/back/side of a building)",
                        "vi": "cửa trước / sau / bên (= ở lối vào ở phía trước / sau / bên của một tòa nhà)"
                    },
                    {
                        "en": "the bedroom/kitchen/car/garage door",
                        "vi": "cửa phòng ngủ / bếp / ô tô / ga ra"
                    },
                    {
                        "en": "a four-door saloon car",
                        "vi": "một chiếc xe saloon bốn cửa"
                    },
                    {
                        "en": "the fridge door",
                        "vi": "cửa tủ lạnh"
                    },
                    {
                        "en": "the door frame/handle/lock",
                        "vi": "khung cửa / tay nắm / khóa"
                    },
                    {
                        "en": "door to something There are double doors to the rear garden.",
                        "vi": "cửa vào cái gì Có cửa đôi vào khu vườn phía sau."
                    },
                    {
                        "en": "The door to his office opened.",
                        "vi": "Cửa phòng làm việc của anh ta mở ra."
                    },
                    {
                        "en": "door into/onto something Each bedroom has a door onto the balcony.",
                        "vi": "cửa vào / vào một cái gì đó Mỗi phòng ngủ đều có cửa ra ban công."
                    }
                ]
            },
            {
                "define": {
                    "en": "the space when a door is open",
                    "vi": "không gian khi một cánh cửa mở ra"
                },
                "examples": [
                    {
                        "en": "through a/the door Marc appeared through a door at the far end of the room.",
                        "vi": "qua a / cánh cửa Marc xuất hiện qua một cánh cửa ở cuối căn phòng."
                    },
                    {
                        "en": "As we walked through the door, the phone rang.",
                        "vi": "Khi chúng tôi bước qua cửa, điện thoại reo."
                    },
                    {
                        "en": "(informal) in the door She's just arrived—she's just come in the door",
                        "vi": "(thân mật) ở cửa Cô ấy vừa đến — cô ấy vừa vào cửa"
                    },
                    {
                        "en": "(informal) out the door He walked out the door.",
                        "vi": "(thân mật) ra khỏi cửa Anh ấy bước ra khỏi cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area close to the entrance of a building",
                    "vi": "khu vực gần lối vào của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "at the door There's somebody at the door (= at the front door of a house).",
                        "vi": "ở cửa Có ai đó ở cửa (= ở cửa trước của một ngôi nhà)."
                    },
                    {
                        "en": "‘Can I help you?’ asked the man at the door.",
                        "vi": "Tôi có thể giúp bạn?' người đàn ông ở cửa hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a house, room, etc. that is a particular number of houses, rooms, etc. away from another",
                    "vi": "một ngôi nhà, căn phòng, v.v. đó là một số nhà, phòng, v.v. cụ thể ở cách xa"
                },
                "examples": [
                    {
                        "en": "the family that lives three doors up from us",
                        "vi": "gia đình sống cách chúng ta ba cửa"
                    },
                    {
                        "en": "Our other branch is just a few doors down the road.",
                        "vi": "Chi nhánh còn lại của chúng tôi chỉ cách vài cánh cửa trên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of money made by selling tickets for an event",
                    "vi": "số tiền kiếm được bằng cách bán vé cho một sự kiện"
                },
                "examples": [
                    {
                        "en": "50% of the door will go to the Red Cross.",
                        "vi": "50% cánh cửa sẽ đến với Chữ Thập Đỏ."
                    },
                    {
                        "en": "Performers keep 75% of the door.",
                        "vi": "Người biểu diễn giữ 75% cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "so ill that you may die",
                    "vi": "ốm đến nỗi bạn có thể chết"
                },
                "examples": [
                    {
                        "en": "I suppose you won’t be coming to the party if you’re at death’s door!",
                        "vi": "Tôi cho rằng bạn sẽ không đến bữa tiệc nếu bạn đang ở ngưỡng cửa tử thần!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a lot of people beat a path to somebody’s door, they are all interested in something that person has to sell, or can do or tell them",
                    "vi": "nếu nhiều người đánh bại con đường dẫn đến cửa nhà ai đó, họ đều quan tâm đến thứ mà người đó phải bán, hoặc có thể làm hoặc nói với họ"
                },
                "examples": [
                    {
                        "en": "Top theatrical agents are beating a path to the teenager's door.",
                        "vi": "Các nhân viên sân khấu hàng đầu đang đánh một con đường dẫn đến cửa thiếu niên."
                    }
                ]
            },
            {
                "define": {
                    "en": "without the public being allowed to attend or know what is happening; in private",
                    "vi": "mà công chúng không được phép tham dự hoặc biết điều gì đang xảy ra; riêng"
                },
                "examples": [
                    {
                        "en": "The meeting was held behind closed doors.",
                        "vi": "Cuộc họp được tổ chức sau những cánh cửa đóng kín."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work at the entrance to a theatre, club, etc., for example collecting tickets from people as they enter",
                    "vi": "để làm việc tại lối vào nhà hát, câu lạc bộ, v.v., chẳng hạn như thu thập vé từ mọi người khi họ bước vào"
                },
                "examples": [
                    {
                        "en": "He was working the door at the event.",
                        "vi": "Anh ấy đang mở cửa tại sự kiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "in an unfair or indirect way",
                    "vi": "theo cách không công bằng hoặc gián tiếp"
                },
                "examples": [
                    {
                        "en": "He used his friends to help him get into the civil service by the back door.",
                        "vi": "Anh ta đã sử dụng bạn bè của mình để giúp anh ta vào dịch vụ dân sự bằng cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it unlikely that something will happen",
                    "vi": "để làm cho nó không chắc rằng một cái gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "She was careful not to close the door on the possibility of further talks.",
                        "vi": "Cô ấy đã cẩn thận không đóng cửa về khả năng có những cuộc nói chuyện tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop trading",
                    "vi": "ngừng giao dịch"
                },
                "examples": [
                    {
                        "en": "The factory closed its doors for the last time in 2009.",
                        "vi": "Nhà máy đóng cửa lần cuối vào năm 2009."
                    },
                    {
                        "en": "The company closed shop and left the US last year.",
                        "vi": "Công ty đã đóng cửa hàng và rời Mỹ vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to prevent or avoid loss or damage when it is already too late to do so",
                    "vi": "để cố gắng ngăn ngừa hoặc tránh mất mát hoặc thiệt hại khi đã quá muộn để làm như vậy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to provide) the means of getting or reaching something; (to create) the opportunity for something",
                    "vi": "(cung cấp) các phương tiện để có được hoặc đạt được một cái gì đó; (để tạo ra) cơ hội cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The agreement will open the door to increased international trade.",
                        "vi": "Hiệp định sẽ mở ra cánh cửa cho thương mại quốc tế gia tăng."
                    },
                    {
                        "en": "Our courses are the door to success in English.",
                        "vi": "Các khóa học của chúng tôi là cánh cửa dẫn đến thành công trong tiếng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "from building to building",
                    "vi": "từ tòa nhà này sang tòa nhà khác"
                },
                "examples": [
                    {
                        "en": "The journey takes about an hour door to door.",
                        "vi": "Cuộc hành trình mất khoảng một giờ đến cửa."
                    },
                    {
                        "en": "a door-to-door salesman",
                        "vi": "nhân viên bán hàng tận nơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "at an early stage, especially in a game or competition",
                    "vi": "ở giai đoạn đầu, đặc biệt là trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "Suddenly we lost three home matches early doors.",
                        "vi": "Đột nhiên, chúng tôi thua ba trận sân nhà sớm."
                    },
                    {
                        "en": "The team had the game in the bag early doors after tries from Ellis and Wilkins.",
                        "vi": "Đội đã có một trò chơi trong túi sớm sau những nỗ lực từ Ellis và Wilkins."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to enter an organization, a field of business, etc. that could bring you success",
                    "vi": "quản lý để gia nhập một tổ chức, một lĩnh vực kinh doanh, v.v. có thể mang lại thành công cho bạn"
                },
                "examples": [
                    {
                        "en": "I always wanted to work in TV but it took me two years to get a foot in the door.",
                        "vi": "Tôi luôn muốn làm việc trong lĩnh vực truyền hình nhưng tôi đã mất hai năm để có được một chân vào cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have enough money to avoid going hungry; to stop somebody feeling hungry",
                    "vi": "có đủ tiền để tránh đói; để ngăn ai đó cảm thấy đói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say that somebody is responsible for something that has gone wrong",
                    "vi": "để nói rằng ai đó phải chịu trách nhiệm cho một cái gì đó đã xảy ra sai"
                },
                "examples": [
                    {
                        "en": "The blame for the disaster has been laid firmly at the government’s door.",
                        "vi": "Việc đổ lỗi cho thảm họa đã được đặt ra trước cửa chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that there is still the possibility of doing something",
                    "vi": "để đảm bảo rằng vẫn có khả năng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "We have left the door open for further talks.",
                        "vi": "Chúng tôi đã để ngỏ cánh cửa cho các cuộc đàm phán tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody never to come to your home again",
                    "vi": "từng nói với ai đó đừng bao giờ đến nhà bạn nữa"
                },
                "examples": [
                    {
                        "en": "Go! And never darken my door again!",
                        "vi": "Đi! Và không bao giờ làm tối cửa của tôi nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide opportunities for somebody to do something and be successful",
                    "vi": "để cung cấp cơ hội cho ai đó làm điều gì đó và thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not inside a building",
                    "vi": "không bên trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "You should spend more time out of doors in the fresh air.",
                        "vi": "Bạn nên dành nhiều thời gian ra khỏi cửa để tiếp xúc với không khí trong lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody to leave, because they are no longer welcome",
                    "vi": "yêu cầu ai đó rời đi, bởi vì họ không còn được chào đón"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to shut a door hard when somebody is trying to come in",
                    "vi": "đóng chặt cửa khi ai đó đang cố gắng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to talk to somebody or meet them, in a rude way",
                    "vi": "từ chối nói chuyện với ai đó hoặc gặp họ, một cách thô lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "directly to somebody’s house",
                    "vi": "trực tiếp đến nhà của ai đó"
                },
                "examples": [
                    {
                        "en": "We promise to deliver to your door within 48 hours of you ordering.",
                        "vi": "Chúng tôi cam kết sẽ giao hàng đến tận nơi trong vòng 48 giờ kể từ khi bạn đặt hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e5b49cae425a4140859e4ac6c5b8b462",
        "word": "downstairs",
        "pos": "adverb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌdaʊnˈsteəz/",
            "us": "/ˌdaʊnˈsterz/"
        },
        "nearby": [
            {
                "word": "downstage",
                "pos": "adjective"
            },
            {
                "word": "downstage",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adjective"
            },
            {
                "word": "downstairs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "down the stairs; on or to a floor of a house or building lower than the one you are on, especially the one at ground level",
                    "vi": "xuống cầu thang; trên hoặc tầng của một ngôi nhà hoặc tòa nhà thấp hơn tầng bạn đang ở, đặc biệt là tầng trệt"
                },
                "examples": [
                    {
                        "en": "I couldn't sleep so I went downstairs and watched TV.",
                        "vi": "Tôi không thể ngủ được vì vậy tôi đi xuống nhà và xem TV."
                    },
                    {
                        "en": "I heard someone coming downstairs.",
                        "vi": "Tôi nghe thấy ai đó đang đi xuống cầu thang."
                    },
                    {
                        "en": "She rushed downstairs and burst into the kitchen.",
                        "vi": "Cô lao xuống lầu và xông vào bếp."
                    },
                    {
                        "en": "Wait downstairs in the hall.",
                        "vi": "Chờ ở sảnh dưới lầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "8a9f10b711274481a09200e2a0729ad9",
        "word": "downstairs",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌdaʊnˈsteəz/",
            "us": "/ˌdaʊnˈsterz/"
        },
        "nearby": [
            {
                "word": "downstairs",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adjective"
            },
            {
                "word": "downstairs",
                "pos": "noun"
            },
            {
                "word": "downstate",
                "pos": "adverb"
            },
            {
                "word": "downstate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the lower floor of a house or building, especially the one at ground level",
                    "vi": "tầng dưới của một ngôi nhà hoặc tòa nhà, đặc biệt là tầng trệt"
                },
                "examples": [
                    {
                        "en": "We're painting the downstairs.",
                        "vi": "Chúng tôi đang sơn tầng dưới."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a6a2e49dd454803802124c68896e6d9",
        "word": "floor",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/flɔː(r)/",
            "us": "/flɔːr/"
        },
        "nearby": [
            {
                "word": "flood tide",
                "pos": "noun"
            },
            {
                "word": "floodwater",
                "pos": "noun"
            },
            {
                "word": "floor",
                "pos": "noun"
            },
            {
                "word": "floor",
                "pos": "verb"
            },
            {
                "word": "floorboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the surface of a room that you walk on",
                    "vi": "bề mặt của một căn phòng mà bạn đi qua"
                },
                "examples": [
                    {
                        "en": "a wooden/concrete/tiled floor",
                        "vi": "sàn gỗ / bê tông / lát gạch"
                    },
                    {
                        "en": "His glass fell to the floor and broke.",
                        "vi": "Kính của anh ấy rơi xuống sàn và vỡ nát."
                    },
                    {
                        "en": "on the floor The body was lying on the kitchen floor.",
                        "vi": "trên sàn nhà Thi thể nằm trên sàn bếp."
                    },
                    {
                        "en": "ceramic floor tiles",
                        "vi": "sàn gạch men"
                    },
                    {
                        "en": "The furniture and floor coverings date from the 1920s.",
                        "vi": "Đồ nội thất và trải sàn có niên đại từ những năm 1920."
                    },
                    {
                        "en": "The alterations should give us extra floor space.",
                        "vi": "Các thay đổi sẽ cung cấp cho chúng tôi thêm không gian sàn."
                    },
                    {
                        "en": "The study was stacked from floor to ceiling with books.",
                        "vi": "Nghiên cứu được xếp chồng lên nhau từ sàn đến trần với sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the bottom surface of a vehicle",
                    "vi": "bề mặt dưới cùng của một chiếc xe"
                },
                "examples": [
                    {
                        "en": "The floor of the car was covered in cigarette ends.",
                        "vi": "Sàn xe ngập trong tàn thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the rooms that are on the same level of a building",
                    "vi": "tất cả các phòng trên cùng một tầng của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "Their apartment occupies the top floor of the building.",
                        "vi": "Căn hộ của họ nằm trên tầng cao nhất của tòa nhà."
                    },
                    {
                        "en": "on the… floor Her office is on the second floor.",
                        "vi": "trên tầng… Văn phòng của cô ấy ở tầng hai."
                    },
                    {
                        "en": "a cafe on the mezzanine floor",
                        "vi": "một quán cà phê trên tầng lửng"
                    },
                    {
                        "en": "The upper floors of the building will contain function rooms.",
                        "vi": "Các tầng trên của tòa nhà sẽ bố trí các phòng chức năng."
                    },
                    {
                        "en": "the Irish guy who lives two floors above",
                        "vi": "anh chàng người Ireland sống ở hai tầng trên"
                    },
                    {
                        "en": "There is a lift to all floors.",
                        "vi": "Có thang máy lên tất cả các tầng."
                    },
                    {
                        "en": "on… floors Their house is on three floors (= it has three floors).",
                        "vi": "trên… tầng Ngôi nhà của họ ở ba tầng (= nó có ba tầng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ground at the bottom of the sea, a forest, etc.",
                    "vi": "mặt đất dưới đáy biển, một khu rừng, v.v."
                },
                "examples": [
                    {
                        "en": "the ocean/sea/forest floor",
                        "vi": "đáy đại dương / biển / rừng"
                    },
                    {
                        "en": "A layer of fine mud spread over the floor of the cave.",
                        "vi": "Một lớp bùn mịn trải dài trên nền hang."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a building where discussions or debates are held, especially in a parliament; the people who attend a discussion or debate",
                    "vi": "phần của một tòa nhà nơi các cuộc thảo luận hoặc tranh luận được tổ chức, đặc biệt là trong quốc hội; những người tham gia một cuộc thảo luận hoặc tranh luận"
                },
                "examples": [
                    {
                        "en": "Opposition politicians registered their protest on the floor of the House.",
                        "vi": "Các chính trị gia đối lập đã đăng ký cuộc biểu tình của họ trên sàn của Hạ viện."
                    },
                    {
                        "en": "We will now take any questions from the floor.",
                        "vi": "Bây giờ chúng tôi sẽ lấy bất kỳ câu hỏi nào từ sàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area in a building that is used for a particular activity",
                    "vi": "một khu vực trong tòa nhà được sử dụng cho một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "on the floor of the Stock Exchange (= where trading takes place)",
                        "vi": "trên sàn của Sở giao dịch chứng khoán (= nơi diễn ra giao dịch)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest level allowed for wages or prices",
                    "vi": "mức thấp nhất cho phép đối với tiền lương hoặc giá cả"
                },
                "examples": [
                    {
                        "en": "Prices have gone through the floor (= fallen to a very low level).",
                        "vi": "Giá đã giảm sàn (= giảm xuống mức rất thấp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become involved in a plan, project, etc. at the beginning",
                    "vi": "tham gia vào một kế hoạch, dự án, v.v. ngay từ đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get/be given/have the right to speak during a discussion or debate",
                    "vi": "được / được cho / có quyền phát biểu trong một cuộc thảo luận hoặc tranh luận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to speak during a discussion or debate, especially for a long time so that nobody else is able to say anything",
                    "vi": "nói trong một cuộc thảo luận hoặc tranh luận, đặc biệt là trong một thời gian dài để không ai khác có thể nói bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "She held the floor for over an hour.",
                        "vi": "Cô ấy đã giữ sàn hơn một giờ đồng hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start dancing on a dance floor",
                    "vi": "bắt đầu khiêu vũ trên sàn nhảy"
                },
                "examples": [
                    {
                        "en": "Couples took the floor for the last dance of the evening.",
                        "vi": "Các cặp đôi đã lên sàn cho buổi khiêu vũ cuối cùng của buổi tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat somebody completely in an argument or a competition",
                    "vi": "để đánh bại ai đó hoàn toàn trong một cuộc tranh cãi hoặc một cuộc cạnh tranh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7b4d7d7070124b309507e7ac0e02bfbb",
        "word": "front",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/frʌnt/",
            "us": "/frʌnt/"
        },
        "nearby": [
            {
                "word": "frond",
                "pos": "noun"
            },
            {
                "word": "front of house",
                "pos": "adverb"
            },
            {
                "word": "front",
                "pos": "noun"
            },
            {
                "word": "front",
                "pos": "adjective"
            },
            {
                "word": "front",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part or side of something that faces forward; the side of something that you look at first",
                    "vi": "một phần hoặc một mặt của cái gì đó hướng về phía trước; mặt của một cái gì đó mà bạn nhìn vào đầu tiên"
                },
                "examples": [
                    {
                        "en": "The front of the building was covered with ivy.",
                        "vi": "Mặt trước của tòa nhà được bao phủ bởi cây thường xuân."
                    },
                    {
                        "en": "The front of the car was badly damaged.",
                        "vi": "Phần đầu xe hư hỏng nặng."
                    },
                    {
                        "en": "on the front The book has a picture of Rome on the front.",
                        "vi": "ở mặt trước Cuốn sách có hình thành Rome ở mặt trước."
                    },
                    {
                        "en": "up the front The jacket zips up the front.",
                        "vi": "lên phía trước Áo khoác kéo khóa phía trước."
                    },
                    {
                        "en": "down the front a green sleeveless top which buttons down the front",
                        "vi": "xuống phía trước một chiếc áo không tay màu xanh lá cây có nút ở phía trước"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position that is directly ahead of somebody/something",
                    "vi": "vị trí trực tiếp phía trước ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I turned round to face the front.",
                        "vi": "Tôi quay tròn mặt trước."
                    },
                    {
                        "en": "Keep your eyes to the front and walk straight ahead.",
                        "vi": "Giữ mắt của bạn về phía trước và đi thẳng về phía trước."
                    },
                    {
                        "en": "at the front of something There's a garden at the front of the house.",
                        "vi": "ở phía trước của một cái gì đó Có một khu vườn ở phía trước của ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of something that is furthest forward",
                    "vi": "phần của cái gì đó xa nhất về phía trước"
                },
                "examples": [
                    {
                        "en": "The singer came to the front of the stage.",
                        "vi": "Nữ ca sĩ bước ra trước sân khấu."
                    },
                    {
                        "en": "The teacher made me move my seat to the front of the classroom.",
                        "vi": "Cô giáo bắt tôi chuyển chỗ ngồi ra trước lớp."
                    },
                    {
                        "en": "at the front She always sits at the front.",
                        "vi": "ở phía trước Cô ấy luôn ngồi ở phía trước."
                    },
                    {
                        "en": "at the front of something Put your fare into the box at the front of the bus.",
                        "vi": "ở phía trước của một cái gì đó Bỏ tiền vé của bạn vào hộp ở phía trước xe buýt."
                    },
                    {
                        "en": "in the front I prefer to travel in the front (= next to the driver in a car).",
                        "vi": "ở phía trước Tôi thích đi phía trước (= bên cạnh người lái xe trong ô tô)."
                    },
                    {
                        "en": "in the front of something Write your name in the front of the book (= the first few pages).",
                        "vi": "ở phía trước của một cái gì đó Viết tên của bạn ở phía trước của cuốn sách (= vài trang đầu tiên)."
                    },
                    {
                        "en": "to the front (of something) The dining room is to the front of the house.",
                        "vi": "phía trước (của cái gì đó) Phòng ăn ở phía trước của ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of somebody’s body that faces forwards",
                    "vi": "phần cơ thể của ai đó hướng về phía trước"
                },
                "examples": [
                    {
                        "en": "on your front She was lying on her front.",
                        "vi": "ở phía trước của bạn Cô ấy đã nằm trên mặt trước của cô ấy."
                    },
                    {
                        "en": "down your front I spilled coffee down my front.",
                        "vi": "xuống phía trước của bạn, tôi đã làm đổ cà phê xuống phía trước của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a large building, especially a church, that faces west, north, etc.",
                    "vi": "Mặt bên của một tòa nhà lớn, đặc biệt là nhà thờ, quay mặt về hướng Tây, Bắc, v.v."
                },
                "examples": [
                    {
                        "en": "the west front of the cathedral",
                        "vi": "mặt trước phía tây của nhà thờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the road or area of land along the edge of the sea, a lake or a river",
                    "vi": "con đường hoặc khu vực đất dọc theo mép biển, hồ hoặc sông"
                },
                "examples": [
                    {
                        "en": "Couples walked hand in hand along the front.",
                        "vi": "Cặp đôi tay trong tay đi dọc phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area where fighting takes place during a war",
                    "vi": "một khu vực xảy ra giao tranh trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "More British troops have been sent to the front.",
                        "vi": "Nhiều quân đội Anh đã được gửi đến mặt trận."
                    },
                    {
                        "en": "to serve at the front",
                        "vi": "phục vụ ở phía trước"
                    },
                    {
                        "en": "fighting a war on two fronts",
                        "vi": "chiến đấu trên hai mặt trận"
                    },
                    {
                        "en": "Reports from the battle fronts became briefer and vaguer.",
                        "vi": "Các báo cáo từ các mặt trận chiến đấu trở nên ngắn gọn và mơ hồ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area of activity",
                    "vi": "một lĩnh vực hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "on the… front Things are looking unsettled on the economic front.",
                        "vi": "trên… mặt trận Mọi thứ đang có vẻ bất ổn trên mặt trận kinh tế."
                    },
                    {
                        "en": "Things should get a little easier on the work front soon.",
                        "vi": "Mọi thứ sẽ sớm dễ dàng hơn một chút trên mặt trận công việc."
                    },
                    {
                        "en": "Progress has been made on all fronts.",
                        "vi": "Tiến bộ đã được thực hiện trên tất cả các mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaviour that is not what it appears to be, done in order to hide somebody's true feelings or opinions",
                    "vi": "hành vi không giống như nó xuất hiện, được thực hiện để che giấu cảm xúc hoặc ý kiến thực sự của ai đó"
                },
                "examples": [
                    {
                        "en": "It's not always easy to put on a brave front for the family.",
                        "vi": "Không phải lúc nào cũng dễ dàng đặt ra một mặt trận dũng cảm cho gia đình."
                    },
                    {
                        "en": "front for something Rudeness is just a front for her shyness.",
                        "vi": "bình phong cho một điều gì đó Rudeness chỉ là bình phong cho sự nhút nhát của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an organization that is used to hide an illegal or secret activity",
                    "vi": "một người hoặc một tổ chức được sử dụng để che giấu một hoạt động bất hợp pháp hoặc bí mật"
                },
                "examples": [
                    {
                        "en": "The travel company is just a front for drug trafficking.",
                        "vi": "Công ty du lịch chỉ là bình phong cho hoạt động buôn bán ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some political organizations",
                    "vi": "được sử dụng trong tên của một số tổ chức chính trị"
                },
                "examples": [
                    {
                        "en": "the Animal Liberation Front",
                        "vi": "Mặt trận giải phóng động vật"
                    }
                ]
            },
            {
                "define": {
                    "en": "the line where a mass of cold air meets a mass of warm air",
                    "vi": "dòng mà một khối không khí lạnh gặp một khối không khí ấm"
                },
                "examples": [
                    {
                        "en": "a cold/warm front",
                        "vi": "mặt trước lạnh / ấm"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you put on a piece of clothing back to front, you make a mistake and put the back where the front should be",
                    "vi": "nếu bạn mặc một bộ quần áo trở lại phía trước, bạn đã mắc lỗi và đặt mặt sau vào vị trí của mặt trước"
                },
                "examples": [
                    {
                        "en": "I think you've got that sweater on back to front.",
                        "vi": "Tôi nghĩ bạn đã có chiếc áo len đó ở mặt sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "in somebody’s presence; in front of somebody",
                    "vi": "trong sự hiện diện của ai đó; trước mặt ai đó"
                },
                "examples": [
                    {
                        "en": "He had seen his life's work destroyed before his very eyes.",
                        "vi": "Anh đã chứng kiến công việc của cuộc đời mình bị phá hủy ngay trước mắt anh."
                    },
                    {
                        "en": "Before our very eyes, the bird snatched the fish from the plate and flew off.",
                        "vi": "Trước mắt chúng tôi, con chim đã giật lấy con cá trong đĩa và bay đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with immediate payment of cash",
                    "vi": "thanh toán ngay bằng tiền mặt"
                },
                "examples": [
                    {
                        "en": "to pay for something cash up front",
                        "vi": "trả trước cho thứ gì đó bằng tiền mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show people that all members of a group have the same opinion about things",
                    "vi": "để cho mọi người thấy rằng tất cả các thành viên của một nhóm đều có cùng quan điểm về mọi thứ"
                },
                "examples": [
                    {
                        "en": "The prime minister stressed the need to present a united front.",
                        "vi": "Thủ tướng nhấn mạnh sự cần thiết phải trình bày một mặt trận thống nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "in or into the most important position",
                    "vi": "ở hoặc vào vị trí quan trọng nhất"
                },
                "examples": [
                    {
                        "en": "The issue has moved front and center in his presidential campaign.",
                        "vi": "Vấn đề này đã trở thành trung tâm trong chiến dịch tranh cử tổng thống của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that is further forward than somebody/something but not very far away",
                    "vi": "ở một vị trí xa hơn về phía trước hơn ai đó / cái gì đó nhưng không ở rất xa"
                },
                "examples": [
                    {
                        "en": "Their house is the one with the big garden in front.",
                        "vi": "Ngôi nhà của họ là ngôi nhà có khu vườn lớn phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in first place in a race or competition",
                    "vi": "ở vị trí đầu tiên trong một cuộc đua hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "The blue team is currently in front with a lead of six points.",
                        "vi": "Đội bóng áo xanh hiện đang dẫn trước với sáu điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that is further forward than somebody/something but not very far away",
                    "vi": "ở một vị trí xa hơn về phía trước hơn ai đó / cái gì đó nhưng không ở rất xa"
                },
                "examples": [
                    {
                        "en": "The car in front of me stopped suddenly and I had to brake.",
                        "vi": "Chiếc xe phía trước dừng lại đột ngột và tôi phải phanh gấp."
                    },
                    {
                        "en": "The bus stops right in front of our house.",
                        "vi": "Xe buýt dừng ngay trước cửa nhà chúng tôi."
                    },
                    {
                        "en": "He was standing in front of me in the line.",
                        "vi": "Anh ấy đang đứng trước mặt tôi trong hàng."
                    },
                    {
                        "en": "She is now entitled to put ‘Professor’ in front of her name.",
                        "vi": "Bây giờ cô ấy có quyền đặt 'Giáo sư' trước tên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position facing somebody/something",
                    "vi": "ở vị trí đối mặt với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "to perform in front of a big crowd/audience",
                        "vi": "biểu diễn trước một đám đông lớn / khán giả"
                    },
                    {
                        "en": "She spends all day sitting in front of (= working at) her computer.",
                        "vi": "Cô ấy dành cả ngày để ngồi trước (= làm việc tại) máy tính của mình."
                    },
                    {
                        "en": "She's a natural in front of the camera (= being filmed/photographed).",
                        "vi": "Cô ấy rất tự nhiên trước ống kính (= được quay phim / chụp ảnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something in front of somebody, you do it when they are there",
                    "vi": "nếu bạn làm điều gì đó trước mặt ai đó, bạn làm điều đó khi họ ở đó"
                },
                "examples": [
                    {
                        "en": "Please don't talk about it in front of the children.",
                        "vi": "Xin đừng nói về nó trước mặt bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "still to come; not yet passed",
                    "vi": "vẫn sẽ đến; chưa vượt qua"
                },
                "examples": [
                    {
                        "en": "Don't give up. You still have your whole life in front of you.",
                        "vi": "Đừng bỏ cuộc. Bạn vẫn còn cả cuộc đời trước mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take an active part in what you are telling or persuading others to do",
                    "vi": "tham gia tích cực vào những gì bạn đang nói hoặc thuyết phục người khác làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in the part of a theatre, restaurant, etc. where the public sits",
                    "vi": "trong một phần của nhà hát, nhà hàng, v.v. nơi công chúng ngồi"
                },
                "examples": [
                    {
                        "en": "There's only a small audience out front tonight.",
                        "vi": "Chỉ có một lượng nhỏ khán giả ở phía trước đêm nay."
                    },
                    {
                        "en": "He cooked while she sat out front and waited tables.",
                        "vi": "Anh nấu ăn trong khi cô ngồi ngoài bàn đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the area near to the entrance to a building",
                    "vi": "trong khu vực gần lối vào một tòa nhà"
                },
                "examples": [
                    {
                        "en": "I’ll wait for you out (the) front.",
                        "vi": "Tôi sẽ đợi bạn ở phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "as payment in advance",
                    "vi": "như thanh toán trước"
                },
                "examples": [
                    {
                        "en": "We'll pay you half up front and the other half when you've finished the job.",
                        "vi": "Chúng tôi sẽ trả trước cho bạn một nửa và nửa còn lại khi bạn hoàn thành công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a forward position",
                    "vi": "ở một vị trí phía trước"
                },
                "examples": [
                    {
                        "en": "to play up front",
                        "vi": "chơi trước"
                    }
                ]
            }
        ]
    },
    {
        "id": "239c36bb08904abcaefc51886d301528",
        "word": "upstairs",
        "pos": "adverb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌʌpˈsteəz/",
            "us": "/ˌʌpˈsterz/"
        },
        "nearby": [
            {
                "word": "upstage",
                "pos": "verb"
            },
            {
                "word": "Upstairs, Downstairs",
                "pos": ""
            },
            {
                "word": "upstairs",
                "pos": "adverb"
            },
            {
                "word": "upstairs",
                "pos": "adjective"
            },
            {
                "word": "upstairs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "up the stairs; on or to a floor of a house or other building higher than the one that you are on",
                    "vi": "lên cầu thang; trên hoặc tầng của một ngôi nhà hoặc tòa nhà khác cao hơn tầng mà bạn đang ở"
                },
                "examples": [
                    {
                        "en": "to run/walk/head upstairs",
                        "vi": "chạy / đi bộ / đi lên lầu"
                    },
                    {
                        "en": "The cat belongs to the people who live upstairs.",
                        "vi": "Con mèo thuộc về những người sống trên lầu."
                    },
                    {
                        "en": "She went upstairs to get dressed.",
                        "vi": "Cô lên lầu mặc quần áo."
                    },
                    {
                        "en": "I carried her bags upstairs.",
                        "vi": "Tôi xách túi của cô ấy lên lầu."
                    },
                    {
                        "en": "I turned and walked back upstairs.",
                        "vi": "Tôi quay lưng bước lên lầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e68cda394724f1eaddc13a9d742c12d",
        "word": "upstairs",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌʌpˈsteəz/",
            "us": "/ˌʌpˈsterz/"
        },
        "nearby": [
            {
                "word": "upstairs",
                "pos": "adverb"
            },
            {
                "word": "upstairs",
                "pos": "adjective"
            },
            {
                "word": "upstairs",
                "pos": "noun"
            },
            {
                "word": "upstanding",
                "pos": "adjective"
            },
            {
                "word": "upstart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the floor or floors in a building that are above the ground floor",
                    "vi": "tầng hoặc các tầng trong một tòa nhà cao hơn tầng trệt"
                },
                "examples": [
                    {
                        "en": "We've converted the upstairs into an office.",
                        "vi": "Chúng tôi đã chuyển đổi tầng trên thành một văn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "34b56a7880b6485986c02a8f7b84a2f1",
        "word": "wall",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/wɔːl/",
            "us": "/wɔːl/"
        },
        "nearby": [
            {
                "word": "walk-up",
                "pos": "noun"
            },
            {
                "word": "walkway",
                "pos": "noun"
            },
            {
                "word": "wall",
                "pos": "noun"
            },
            {
                "word": "wall",
                "pos": "verb"
            },
            {
                "word": "wallaby",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, solid structure that rises straight up from the ground, made of stone, brick or concrete, that surrounds, divides or protects an area of land",
                    "vi": "một cấu trúc dài, vững chắc mọc thẳng lên khỏi mặt đất, bằng đá, gạch hoặc bê tông, bao quanh, phân chia hoặc bảo vệ một khu vực đất"
                },
                "examples": [
                    {
                        "en": "to build a wall",
                        "vi": "xây một bức tường"
                    },
                    {
                        "en": "a brick/concrete wall",
                        "vi": "một bức tường gạch / bê tông"
                    },
                    {
                        "en": "The fields were divided by stone walls.",
                        "vi": "Các cánh đồng bị chia cắt bởi những bức tường đá."
                    },
                    {
                        "en": "He sat on the wall and watched the others playing.",
                        "vi": "Anh ta ngồi trên tường và quan sát những người khác đang chơi."
                    },
                    {
                        "en": "The enemy set up camp just outside the city walls.",
                        "vi": "Kẻ thù dựng trại ngay bên ngoài các bức tường thành."
                    },
                    {
                        "en": "a private garden hidden behind high walls",
                        "vi": "một khu vườn riêng ẩn sau những bức tường cao"
                    },
                    {
                        "en": "They quickly climbed over the wall and ran off.",
                        "vi": "Họ nhanh chóng trèo qua tường và bỏ chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the sides of a building or room",
                    "vi": "bất kỳ mặt nào của tòa nhà hoặc căn phòng"
                },
                "examples": [
                    {
                        "en": "She leaned against the wall.",
                        "vi": "Cô dựa vào tường."
                    },
                    {
                        "en": "on the wall Colourful abstract paintings hung on the walls.",
                        "vi": "trên tường Những bức tranh trừu tượng đầy màu sắc treo trên tường."
                    },
                    {
                        "en": "He drilled a hole in the wall.",
                        "vi": "Anh ta đã khoan một lỗ trên tường."
                    },
                    {
                        "en": "Books lined the walls.",
                        "vi": "Sách xếp các bức tường."
                    },
                    {
                        "en": "I'm going to paint the walls white and the ceiling pink.",
                        "vi": "Tôi sẽ sơn tường màu trắng và trần nhà màu hồng."
                    },
                    {
                        "en": "the row of tables along the back wall",
                        "vi": "dãy bàn dọc theo bức tường phía sau"
                    },
                    {
                        "en": "Pictures covered the walls.",
                        "vi": "Hình ảnh phủ kín các bức tường."
                    },
                    {
                        "en": "wall between A and B the wall between the living room and the dining room",
                        "vi": "bức tường giữa A và B bức tường giữa phòng khách và phòng ăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that forms a barrier or stops you from making progress",
                    "vi": "thứ gì đó tạo thành rào cản hoặc ngăn cản bạn tiến bộ"
                },
                "examples": [
                    {
                        "en": "The boat struck a solid wall of water.",
                        "vi": "Con thuyền va phải một bức tường nước vững chắc."
                    },
                    {
                        "en": "The investigators were confronted by a wall of silence.",
                        "vi": "Các điều tra viên đã phải đối mặt với một bức tường im lặng."
                    },
                    {
                        "en": "a solid wall of fog",
                        "vi": "một bức tường sương mù vững chắc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer layer of something hollow such as an organ of the body or a cell of an animal or a plant",
                    "vi": "lớp bên ngoài của một cái gì đó rỗng như cơ quan của cơ thể hoặc tế bào của động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "the abdominal wall",
                        "vi": "thành bụng"
                    },
                    {
                        "en": "the wall of an artery",
                        "vi": "thành động mạch"
                    },
                    {
                        "en": "Heating food breaks down plant cell walls so they can release more of their nutrients.",
                        "vi": "Làm nóng thức ăn sẽ phá vỡ thành tế bào thực vật để chúng có thể giải phóng nhiều chất dinh dưỡng hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a space on a social media website where you can share messages, photos, etc. with other users",
                    "vi": "một không gian trên trang web truyền thông xã hội nơi bạn có thể chia sẻ tin nhắn, ảnh, v.v. với những người dùng khác"
                },
                "examples": [
                    {
                        "en": "She posted a pink baby romper on her Facebook wall, announcing they were expecting a girl.",
                        "vi": "Cô ấy đã đăng một bức ảnh trẻ sơ sinh màu hồng trên tường Facebook của mình, thông báo rằng họ đang mong đợi một bé gái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep trying to do something that will never be successful",
                    "vi": "tiếp tục cố gắng làm điều gì đó sẽ không bao giờ thành công"
                },
                "examples": [
                    {
                        "en": "Trying to reason with them was like banging my head against a brick wall.",
                        "vi": "Cố gắng lý luận với họ giống như đập đầu tôi vào tường gạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be so full of energy or so excited that you cannot keep still",
                    "vi": "tràn đầy năng lượng hoặc phấn khích đến mức bạn không thể đứng yên"
                },
                "examples": [
                    {
                        "en": "The kids have been bouncing off the walls all day.",
                        "vi": "Những đứa trẻ đã được tung lên tường cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to make any progress because there is a difficulty that stops you",
                    "vi": "không thể đạt được bất kỳ tiến bộ nào bởi vì có một khó khăn ngăn cản bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who watches others without being noticed",
                    "vi": "một người quan sát người khác mà không bị chú ý"
                },
                "examples": [
                    {
                        "en": "I'd love to be a fly on the wall when he tells her the news.",
                        "vi": "Tôi thích trở thành một con ruồi trên tường khi anh ấy nói với cô ấy tin tức."
                    },
                    {
                        "en": "fly-on-the-wall documentaries (= in which people are filmed going about their normal lives as if the camera were not there)",
                        "vi": "phim tài liệu bay trên tường (= trong đó mọi người được quay về cuộc sống bình thường của họ như thể không có máy quay)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail because of lack of money",
                    "vi": "thất bại vì thiếu tiền"
                },
                "examples": [
                    {
                        "en": "Many firms have gone to the wall in this recession.",
                        "vi": "Nhiều công ty đã đi đến chân tường trong cuộc suy thoái này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are describing a situation in which there are signs that something is going to have problems or that it is going to be a failure",
                    "vi": "được sử dụng khi bạn đang mô tả một tình huống mà trong đó có dấu hiệu cho thấy một cái gì đó sẽ có vấn đề hoặc nó sẽ thất bại"
                },
                "examples": [
                    {
                        "en": "It is amazing that not one of them saw the handwriting on the wall.",
                        "vi": "Thật ngạc nhiên là không ai trong số họ nhìn thấy chữ viết tay trên tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult situation in which you are forced to do something but are unable to make the choices that you would like",
                    "vi": "rơi vào một tình huống khó khăn mà bạn buộc phải làm điều gì đó nhưng không thể đưa ra lựa chọn mà bạn muốn"
                },
                "examples": [
                    {
                        "en": "We had our backs to the wall with no choice but to sell.",
                        "vi": "Chúng tôi đã dựa lưng vào tường, không còn lựa chọn nào khác ngoài việc bán đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reach a point when you cannot continue or make any more progress",
                    "vi": "đạt đến một điểm khi bạn không thể tiếp tục hoặc tiến bộ thêm"
                },
                "examples": [
                    {
                        "en": "We hit a wall and we weren't scoring.",
                        "vi": "Chúng tôi va phải một bức tường và chúng tôi không ghi bàn."
                    },
                    {
                        "en": "I’ve hit a wall with my marathon training.",
                        "vi": "Tôi đã đụng phải một bức tường với bài tập chạy marathon của mình."
                    },
                    {
                        "en": "What do you do when you hit the wall at work?",
                        "vi": "Bạn làm gì khi bạn va vào tường tại nơi làm việc?"
                    }
                ]
            },
            {
                "define": {
                    "en": "unusual or slightly crazy",
                    "vi": "bất thường hoặc hơi điên rồ"
                },
                "examples": [
                    {
                        "en": "Some of his ideas are really off the wall.",
                        "vi": "Một số ý tưởng của anh ấy thực sự không thành công."
                    },
                    {
                        "en": "off-the-wall ideas",
                        "vi": "ý tưởng độc đáo"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are talking about keeping something secret",
                    "vi": "được sử dụng khi bạn nói về việc giữ bí mật điều gì đó"
                },
                "examples": [
                    {
                        "en": "Don't let this go further than these four walls (= Don't tell anyone else who is not in the room now).",
                        "vi": "Đừng để chuyện này đi xa hơn bốn bức tường này (= Đừng nói với ai khác hiện không có trong phòng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "crazy or angry",
                    "vi": "điên hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "That noise is driving me up the wall.",
                        "vi": "Tiếng ồn đó đang đẩy tôi lên tường."
                    },
                    {
                        "en": "I mustn't be late or Dad will go up the wall.",
                        "vi": "Tôi không được đến muộn nếu không bố sẽ đi lên tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn people to be careful what they say because other people may be listening",
                    "vi": "được sử dụng để cảnh báo mọi người hãy cẩn thận với những gì họ nói vì người khác có thể đang nghe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you are describing a situation in which there are signs that something is going to have problems or that it is going to be a failure",
                    "vi": "được sử dụng khi bạn đang mô tả một tình huống mà trong đó có dấu hiệu cho thấy một cái gì đó sẽ có vấn đề hoặc nó sẽ thất bại"
                },
                "examples": [
                    {
                        "en": "It is amazing that not one of them saw the writing on the wall.",
                        "vi": "Thật ngạc nhiên là không ai trong số họ nhìn thấy chữ viết trên tường."
                    }
                ]
            }
        ]
    },
    {
        "id": "aba68eab74e0414dac97e2d943fc9ceb",
        "word": "window",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈwɪndəʊ/",
            "us": "/ˈwɪndəʊ/"
        },
        "nearby": [
            {
                "word": "windmill",
                "pos": "noun"
            },
            {
                "word": "the Windmill Theatre",
                "pos": ""
            },
            {
                "word": "window",
                "pos": "noun"
            },
            {
                "word": "window box",
                "pos": "noun"
            },
            {
                "word": "window cleaner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening in the wall or roof of a building, car, etc., usually covered with glass, that allows light and air to come in and people to see out; the glass in a window",
                    "vi": "một khe hở trên tường hoặc mái của một tòa nhà, ô tô, v.v., thường được che bằng kính, cho phép ánh sáng và không khí đi vào và mọi người có thể nhìn ra ngoài; kính trong cửa sổ"
                },
                "examples": [
                    {
                        "en": "out of the window She looked out of the window.",
                        "vi": "ngoài cửa sổ Cô ấy nhìn ra ngoài cửa sổ."
                    },
                    {
                        "en": "through the window He saw her through the rear window of the car.",
                        "vi": "qua cửa sổ Anh nhìn thấy cô qua cửa sổ phía sau xe hơi."
                    },
                    {
                        "en": "to open/close the window",
                        "vi": "để mở / đóng cửa sổ"
                    },
                    {
                        "en": "the bedroom/kitchen/car window",
                        "vi": "cửa sổ phòng ngủ / bếp / xe hơi"
                    },
                    {
                        "en": "a broken window",
                        "vi": "một cửa sổ bị vỡ"
                    },
                    {
                        "en": "The burglars smashed a window to get in.",
                        "vi": "Những tên trộm đã đập vỡ một cửa sổ để vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "the glass at the front of a shop and the area behind it where goods are shown to the public",
                    "vi": "kính ở phía trước của một cửa hàng và khu vực phía sau nó, nơi hàng hóa được trưng bày cho công chúng"
                },
                "examples": [
                    {
                        "en": "in the window I saw the dress I wanted in the window.",
                        "vi": "trong cửa sổ, tôi nhìn thấy chiếc váy mà tôi muốn trên cửa sổ."
                    },
                    {
                        "en": "a window display",
                        "vi": "màn hình cửa sổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area of something that you can see through, for example to talk to somebody or read something on the other side",
                    "vi": "một khu vực nhỏ của thứ gì đó mà bạn có thể nhìn xuyên qua, chẳng hạn như để nói chuyện với ai đó hoặc đọc một cái gì đó ở phía bên kia"
                },
                "examples": [
                    {
                        "en": "There was a long line of people at the box-office window.",
                        "vi": "Có một hàng dài người ở cửa sổ phòng vé."
                    },
                    {
                        "en": "We tapped on the window to get their attention.",
                        "vi": "Chúng tôi gõ vào cửa sổ để thu hút sự chú ý của họ."
                    },
                    {
                        "en": "The address must be clearly visible through the window of the envelope.",
                        "vi": "Địa chỉ phải được nhìn thấy rõ ràng qua cửa sổ của phong bì."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area within a frame on a computer screen, in which a particular program is operating or in which information of a particular type is shown",
                    "vi": "một khu vực trong khung trên màn hình máy tính, trong đó một chương trình cụ thể đang hoạt động hoặc trong đó thông tin của một loại cụ thể được hiển thị"
                },
                "examples": [
                    {
                        "en": "to create/open a window",
                        "vi": "để tạo / mở một cửa sổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of seeing and learning about something",
                    "vi": "một cách nhìn và học hỏi về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Television is a sort of window on the world.",
                        "vi": "Truyền hình là một loại cửa sổ trên thế giới."
                    },
                    {
                        "en": "It gave me an intriguing window into the way people live.",
                        "vi": "Nó đã cho tôi một cửa sổ hấp dẫn về cách mọi người sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a time when there is an opportunity to do something, although it may not last long",
                    "vi": "thời điểm khi có cơ hội để làm điều gì đó, mặc dù nó có thể không kéo dài"
                },
                "examples": [
                    {
                        "en": "We now have a small window of opportunity in which to make our views known.",
                        "vi": "Bây giờ chúng tôi có một cơ hội nhỏ để làm cho quan điểm của chúng tôi được biết đến."
                    },
                    {
                        "en": "Do you have a window next Monday?",
                        "vi": "Bạn có cửa sổ vào thứ Hai tới không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop existing; to disappear completely",
                    "vi": "ngừng tồn tại; biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "As soon as the kids arrived, order went out of the window.",
                        "vi": "Ngay sau khi những đứa trẻ đến, đơn đặt hàng đã bay ra khỏi cửa sổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "231fb2bcb4d5406bbd66e58a75bd0553",
        "word": "corner",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkɔːnə(r)/",
            "us": "/ˈkɔːrnər/"
        },
        "nearby": [
            {
                "word": "corned beef",
                "pos": "noun"
            },
            {
                "word": "cornelian",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "noun"
            },
            {
                "word": "corner",
                "pos": "verb"
            },
            {
                "word": "cornerback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of something where two or more sides, lines or edges join",
                    "vi": "một phần của thứ gì đó có hai hoặc nhiều cạnh, đường hoặc cạnh nối với nhau"
                },
                "examples": [
                    {
                        "en": "the four corners of a square",
                        "vi": "bốn góc của một hình vuông"
                    },
                    {
                        "en": "I hit my knee on the corner of the table.",
                        "vi": "Tôi đập đầu gối vào góc bàn."
                    },
                    {
                        "en": "Write your address in the top right-hand corner of the letter.",
                        "vi": "Viết địa chỉ của bạn ở góc trên cùng bên phải của bức thư."
                    },
                    {
                        "en": "the left/right corner",
                        "vi": "góc trái / phải"
                    },
                    {
                        "en": "the north-west/north-east/south-east/south-west corner",
                        "vi": "góc tây bắc / đông bắc / nam đông / tây nam"
                    },
                    {
                        "en": "A smile lifted the corner of his mouth.",
                        "vi": "Một nụ cười nhếch lên khóe miệng."
                    },
                    {
                        "en": "in the corner of something a speck of dirt in the corner of her eye",
                        "vi": "trong góc của thứ gì đó có một đốm bẩn trong khóe mắt của cô ấy"
                    },
                    {
                        "en": "He scored with a shot into the bottom corner of the goal.",
                        "vi": "Anh ấy đã ghi bàn bằng một cú sút vào góc thấp khung thành."
                    },
                    {
                        "en": "She tucked the ball into the corner of the net.",
                        "vi": "Cô ấy đệm bóng vào góc lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the number of corners mentioned; involving the number of groups mentioned",
                    "vi": "với số lượng các góc đã nêu; liên quan đến số lượng các nhóm được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-cornered hat",
                        "vi": "một chiếc mũ ba góc"
                    },
                    {
                        "en": "a three-cornered fight",
                        "vi": "một cuộc chiến ba góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the place inside a room or a box where two sides join; the area around this place",
                    "vi": "nơi bên trong một căn phòng hoặc một cái hộp mà hai bên tham gia vào nhau; khu vực xung quanh nơi này"
                },
                "examples": [
                    {
                        "en": "A large desk occupies another corner of the room.",
                        "vi": "Một bàn làm việc lớn chiếm một góc khác của căn phòng."
                    },
                    {
                        "en": "He found a quiet corner and got on with his work.",
                        "vi": "Anh tìm một góc yên tĩnh và tiếp tục với công việc của mình."
                    },
                    {
                        "en": "in the corner They made straight for the table in the corner.",
                        "vi": "ở góc Họ đã làm thẳng cho cái bàn trong góc."
                    },
                    {
                        "en": "in the corner of something She spotted him sitting in the corner of the bar.",
                        "vi": "trong góc của cái gì đó Cô phát hiện ra anh ta đang ngồi trong góc của quầy bar."
                    },
                    {
                        "en": "We found an empty booth in a dark corner of the pub.",
                        "vi": "Chúng tôi tìm thấy một gian hàng trống trong một góc tối của quán rượu."
                    },
                    {
                        "en": "There was a television in the far corner of the bedroom.",
                        "vi": "Có một chiếc tivi ở góc xa của phòng ngủ."
                    },
                    {
                        "en": "a corner table/seat/cupboard",
                        "vi": "một cái bàn / chỗ ngồi / cái tủ ở góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two streets join",
                    "vi": "một nơi mà hai con phố nối với nhau"
                },
                "examples": [
                    {
                        "en": "The wind hit him as he turned the corner.",
                        "vi": "Gió ập vào anh khi anh rẽ vào góc đường."
                    },
                    {
                        "en": "corner of A and B the last house before the corner of Beach Road and Hill Avenue",
                        "vi": "căn góc A và B căn nhà cuối cùng trước góc đường Beach và đại lộ Hill"
                    },
                    {
                        "en": "on the corner There was a group of youths standing on the street corner.",
                        "vi": "ở góc phố Có một nhóm thanh niên đang đứng ở góc phố."
                    },
                    {
                        "en": "on the corner of something There’s a hotel on the corner of my street.",
                        "vi": "ở góc của cái gì đó Có một khách sạn ở góc đường của tôi."
                    },
                    {
                        "en": "at the corner (of something) Turn right at the corner of Sunset and Crescent Heights Boulevards.",
                        "vi": "ở góc (của một cái gì đó) Rẽ phải ở góc của Đại lộ Hoàng hôn và Lưỡi liềm."
                    },
                    {
                        "en": "around/round the corner The bus stop is around the corner, I think.",
                        "vi": "xung quanh / vòng quanh góc Trạm xe buýt ở quanh góc, tôi nghĩ."
                    },
                    {
                        "en": "around/round the corner from something the bookshop around the corner from our hotel",
                        "vi": "xung quanh / vòng quanh góc từ một cái gì đó hiệu sách xung quanh góc từ khách sạn của chúng tôi"
                    },
                    {
                        "en": "(at the) corner with something the big tree at the corner with Hill Street",
                        "vi": "(ở góc) với một cái gì đó cái cây lớn ở góc với Phố Hill"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road",
                    "vi": "một khúc cua gấp trên một con đường"
                },
                "examples": [
                    {
                        "en": "The car was taking the corners too fast.",
                        "vi": "Chiếc xe đã vào góc quá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a region or an area of a place (sometimes used for one that is far away or difficult to reach)",
                    "vi": "một khu vực hoặc một khu vực của một địa điểm (đôi khi được sử dụng cho một địa điểm ở xa hoặc khó tiếp cận)"
                },
                "examples": [
                    {
                        "en": "She lives in a quiet corner of rural Yorkshire.",
                        "vi": "Cô sống ở một góc yên tĩnh của vùng nông thôn Yorkshire."
                    },
                    {
                        "en": "Students come here from the four corners of the world.",
                        "vi": "Sinh viên đến đây từ bốn phương."
                    },
                    {
                        "en": "He knew every corner of the old town.",
                        "vi": "Anh biết mọi ngóc ngách của khu phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation",
                    "vi": "Một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "to back/drive/force somebody into a corner",
                        "vi": "lùi / lái xe / buộc ai đó vào một góc"
                    },
                    {
                        "en": "They had got her in a corner, and there wasn't much she could do about it.",
                        "vi": "Họ đã dồn cô ấy vào một góc, và cô ấy không thể làm được gì nhiều."
                    },
                    {
                        "en": "He was used to talking his way out of tight corners.",
                        "vi": "Anh ấy đã quen với việc nói theo cách của mình từ những góc hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a free kick or hit that you take from the corner of your opponent’s end of the field",
                    "vi": "một quả đá phạt hoặc cú đánh mà bạn thực hiện từ góc cuối sân của đối phương"
                },
                "examples": [
                    {
                        "en": "Moore took the corner.",
                        "vi": "Moore thực hiện quả phạt góc."
                    },
                    {
                        "en": "The referee awarded a corner.",
                        "vi": "Trọng tài cho hưởng quả phạt góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the four corners of a ring; the supporters who help in the corner",
                    "vi": "bất kỳ trong bốn góc của một chiếc nhẫn; những người ủng hộ giúp đỡ trong góc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very near",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "Her house is just around the corner.",
                        "vi": "Nhà cô ấy ở ngay góc phố."
                    },
                    {
                        "en": "(figurative) There were good times around the corner (= they would soon come).",
                        "vi": "(nghĩa bóng) Đã có những khoảng thời gian tuyệt vời (= họ sẽ sớm đến)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support and encourage somebody; to have somebody who supports and encourages you",
                    "vi": "để hỗ trợ và khuyến khích ai đó; để có ai đó ủng hộ và khuyến khích bạn"
                },
                "examples": [
                    {
                        "en": "He's been in my corner all these years and I can never thank him enough.",
                        "vi": "Anh ấy đã ở trong góc của tôi suốt những năm qua và tôi không bao giờ có thể cảm ơn anh ấy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go across the corner of an area and not around the sides of it, because it is quicker",
                    "vi": "để đi qua góc của một khu vực chứ không phải xung quanh các cạnh của nó, bởi vì nó nhanh hơn"
                },
                "examples": [
                    {
                        "en": "There’s a worn patch on the grass because everyone cuts (off) the corner.",
                        "vi": "Có một mảng cỏ đã mòn vì mọi người cắt bỏ (cắt bỏ) góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something in the easiest, cheapest or quickest way, often by ignoring rules or leaving something out",
                    "vi": "để làm điều gì đó theo cách dễ nhất, rẻ nhất hoặc nhanh nhất, thường bằng cách bỏ qua các quy tắc hoặc bỏ qua điều gì đó"
                },
                "examples": [
                    {
                        "en": "To be competitive, they paid low wages and cut corners on health and safety.",
                        "vi": "Để cạnh tranh, họ trả lương thấp và cắt giảm sức khỏe và an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defend your/somebody’s position against other people",
                    "vi": "để bảo vệ lập trường của bạn / ai đó trước những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like somebody/something",
                    "vi": "thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She's always had a soft corner for you.",
                        "vi": "Cô ấy luôn có một góc mềm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "The captain's knee injury leaves the team in a tight corner.",
                        "vi": "Chấn thương đầu gối của đội trưởng khiến đội bóng gặp khó khăn trong thế trận."
                    },
                    {
                        "en": "She’ll always help if you’re in a tight spot.",
                        "vi": "Cô ấy sẽ luôn giúp đỡ nếu bạn gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation",
                    "vi": "trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She’ll always help you if you’re in a spot.",
                        "vi": "Cô ấy sẽ luôn giúp bạn nếu bạn đang ở trong tình trạng khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it",
                    "vi": "nhìn thấy vật gì đó một cách tình cờ hoặc không rõ ràng lắm vì bạn nhìn thấy vật đó từ phía bên mắt mình và không nhìn thẳng vào vật đó"
                },
                "examples": [
                    {
                        "en": "Out of the corner of her eye, she saw him coming closer.",
                        "vi": "Qua khóe mắt, cô thấy anh đang tiến lại gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass a very important point in an illness or a difficult situation and begin to improve",
                    "vi": "vượt qua một điểm rất quan trọng trong một căn bệnh hoặc một tình huống khó khăn và bắt đầu cải thiện"
                },
                "examples": [
                    {
                        "en": "The country's economy has finally turned the corner.",
                        "vi": "Nền kinh tế của đất nước cuối cùng cũng đã rẽ vào ngõ ngách."
                    }
                ]
            }
        ]
    },
    {
        "id": "a2f08dc6bdb2473a831a45f039d204b5",
        "word": "cupboard",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkʌbəd/",
            "us": "/ˈkʌbərd/"
        },
        "nearby": [
            {
                "word": "cup",
                "pos": "noun"
            },
            {
                "word": "cup",
                "pos": "verb"
            },
            {
                "word": "cupboard",
                "pos": "noun"
            },
            {
                "word": "cupcake",
                "pos": "noun"
            },
            {
                "word": "cup final",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of furniture with doors and shelves used for storing dishes, food, clothes, etc.",
                    "vi": "một món đồ nội thất có cửa và kệ dùng để đựng bát đĩa, thức ăn, quần áo, v.v."
                },
                "examples": [
                    {
                        "en": "kitchen cupboards",
                        "vi": "tủ bếp"
                    },
                    {
                        "en": "a stationery/linen cupboard",
                        "vi": "tủ đựng đồ văn phòng phẩm / vải lanh"
                    },
                    {
                        "en": "a cupboard door",
                        "vi": "cửa tủ"
                    },
                    {
                        "en": "There's plenty of food in the cupboards.",
                        "vi": "Có rất nhiều thức ăn trong tủ."
                    },
                    {
                        "en": "I found it hidden in the back of a cupboard.",
                        "vi": "Tôi tìm thấy nó được giấu trong mặt sau của một cái tủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a space in a wall with a door that reaches the ground, used for storing things",
                    "vi": "một không gian trong bức tường có cửa chạm đất, dùng để chứa đồ"
                },
                "examples": [
                    {
                        "en": "The kitchen has built-in cupboards and shelves.",
                        "vi": "Phòng bếp có tủ và kệ được thiết kế sẵn."
                    },
                    {
                        "en": "The tool kit is in the cupboard under the stairs.",
                        "vi": "Bộ dụng cụ để trong tủ dưới gầm cầu thang."
                    },
                    {
                        "en": "a store cupboard",
                        "vi": "một cái tủ cửa hàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is no money for something",
                    "vi": "thường nói rằng không có tiền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They are seeking more funds but the cupboard is bare.",
                        "vi": "Họ đang tìm kiếm thêm tiền nhưng cái tủ thì trống rỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "love that somebody, especially a child, shows towards somebody else in order to get something",
                    "vi": "yêu ai đó, đặc biệt là một đứa trẻ, thể hiện đối với người khác để có được một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something shocking, embarrassing, etc. that has happened to you or your family in the past that you want to keep secret",
                    "vi": "điều gì đó gây sốc, đáng xấu hổ, v.v. đã xảy ra với bạn hoặc gia đình bạn trong quá khứ mà bạn muốn giữ bí mật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be75d5ee8bbb40de83ec40d1eacb9f44",
        "word": "downstairs",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌdaʊnˈsteəz/",
            "us": "/ˌdaʊnˈsterz/"
        },
        "nearby": [
            {
                "word": "downstage",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adjective"
            },
            {
                "word": "downstairs",
                "pos": "noun"
            },
            {
                "word": "downstate",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on a floor of a house or building lower than the one you are on, especially the one at ground level",
                    "vi": "trên một tầng của ngôi nhà hoặc tòa nhà thấp hơn tầng bạn đang ở, đặc biệt là tầng ở tầng trệt"
                },
                "examples": [
                    {
                        "en": "a downstairs bathroom",
                        "vi": "phòng tắm ở tầng dưới"
                    },
                    {
                        "en": "I knocked on the door of my downstairs neighbour.",
                        "vi": "Tôi gõ cửa nhà hàng xóm ở tầng dưới."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec54059e84cb41b9b6186a7c30913b7f",
        "word": "first floor",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌfɜːst ˈflɔː(r)/",
            "us": "/ˌfɜːrst ˈflɔːr/"
        },
        "nearby": [
            {
                "word": "the first family",
                "pos": "noun"
            },
            {
                "word": "first finger",
                "pos": "noun"
            },
            {
                "word": "first floor",
                "pos": "noun"
            },
            {
                "word": "first-floor",
                "pos": "adjective"
            },
            {
                "word": "the First Folio",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the level of a building above the ground level",
                    "vi": "mức độ của một tòa nhà trên mặt đất"
                },
                "examples": [
                    {
                        "en": "Menswear is on the first floor.",
                        "vi": "Menswear ở tầng một."
                    }
                ]
            },
            {
                "define": {
                    "en": "the floor of a building that is at the same level as the ground outside",
                    "vi": "tầng của một tòa nhà bằng với mặt đất bên ngoài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bafea92e061a4a71aa840c428ecec71f",
        "word": "ground floor",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌɡraʊnd ˈflɔː(r)/",
            "us": "/ˌɡraʊnd ˈflɔːr/"
        },
        "nearby": [
            {
                "word": "grounded",
                "pos": "adjective"
            },
            {
                "word": "grounder",
                "pos": "noun"
            },
            {
                "word": "ground floor",
                "pos": "noun"
            },
            {
                "word": "groundhog",
                "pos": "noun"
            },
            {
                "word": "Groundhog Day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the floor of a building that is at the same level as the ground outside",
                    "vi": "tầng của một tòa nhà bằng với mặt đất bên ngoài"
                },
                "examples": [
                    {
                        "en": "a ground-floor window",
                        "vi": "cửa sổ ở tầng trệt"
                    },
                    {
                        "en": "I live on the ground floor.",
                        "vi": "Tôi sống ở tầng trệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become involved in a plan, project, etc. at the beginning",
                    "vi": "tham gia vào một kế hoạch, dự án, v.v. ngay từ đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "44ab4d9fa5f240aeb6d915b23f9645f7",
        "word": "level",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlevl/",
            "us": "/ˈlevl/"
        },
        "nearby": [
            {
                "word": "leukaemia",
                "pos": "noun"
            },
            {
                "word": "levee",
                "pos": "noun"
            },
            {
                "word": "level",
                "pos": "noun"
            },
            {
                "word": "level",
                "pos": "adjective"
            },
            {
                "word": "level",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the height of something in relation to the ground or to what it used to be",
                    "vi": "chiều cao của một cái gì đó so với mặt đất hoặc so với những gì nó từng là"
                },
                "examples": [
                    {
                        "en": "The cables are buried one metre below ground level.",
                        "vi": "Các dây cáp được chôn dưới mặt đất một mét."
                    },
                    {
                        "en": "The floodwater nearly reached roof level.",
                        "vi": "Nước lũ gần ngập mái nhà."
                    },
                    {
                        "en": "The river has fallen to its lowest level since 2012.",
                        "vi": "Con sông đã giảm xuống mức thấp nhất kể từ năm 2012."
                    },
                    {
                        "en": "the level rose/dropped/decreased/increased",
                        "vi": "mức độ tăng / giảm / giảm / tăng"
                    },
                    {
                        "en": "on a level with something On the second floor you are on a level with (= at the same height as) the treetops.",
                        "vi": "trên tầng với thứ gì đó Trên tầng hai, bạn ở trên tầng với (= ở cùng độ cao với) ngọn cây."
                    },
                    {
                        "en": "on a level The tables are not on a level (= the same height).",
                        "vi": "trên một mức Các bảng không nằm trên một mức (= cùng một chiều cao)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a floor of a building; a layer of ground",
                    "vi": "một tầng của một tòa nhà; một lớp đất"
                },
                "examples": [
                    {
                        "en": "a multi-level parking lot",
                        "vi": "bãi đậu xe nhiều tầng"
                    },
                    {
                        "en": "Take the elevator to Level Four.",
                        "vi": "Đi thang máy lên Tầng 4."
                    },
                    {
                        "en": "on a level The restaurant is on the level below this one.",
                        "vi": "trên một cấp độ Nhà hàng ở cấp độ thấp hơn một cấp độ này."
                    },
                    {
                        "en": "The library is all on one level.",
                        "vi": "Thư viện là tất cả trên một cấp độ."
                    },
                    {
                        "en": "Archaeologists found pottery in the lowest level of the site.",
                        "vi": "Các nhà khảo cổ tìm thấy đồ gốm ở tầng thấp nhất của di chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of something that exists in a particular situation at a particular time",
                    "vi": "số lượng thứ gì đó tồn tại trong một tình huống cụ thể tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "a low level of support for the proposed changes",
                        "vi": "mức hỗ trợ thấp cho những thay đổi được đề xuất"
                    },
                    {
                        "en": "Increase your level of activity to burn more calories.",
                        "vi": "Tăng mức độ hoạt động của bạn để đốt cháy nhiều calo hơn."
                    },
                    {
                        "en": "to raise/reduce the level of something",
                        "vi": "để nâng cao / giảm mức độ của một cái gì đó"
                    },
                    {
                        "en": "They have achieved higher levels of efficiency.",
                        "vi": "Họ đã đạt được mức hiệu quả cao hơn."
                    },
                    {
                        "en": "A change of course may be needed if the current level of violence continues.",
                        "vi": "Tất nhiên có thể cần thay đổi nếu mức độ bạo lực hiện tại vẫn tiếp tục."
                    },
                    {
                        "en": "low/high/elevated blood cholesterol levels",
                        "vi": "mức cholesterol trong máu thấp / cao / cao"
                    },
                    {
                        "en": "a reduction/a rise/a decrease/an increase/a change in energy levels",
                        "vi": "giảm / tăng / giảm / tăng / thay đổi mức năng lượng"
                    },
                    {
                        "en": "at a/the… level Profits were at the same level as the year before.",
                        "vi": "ở mức a / mức… Lợi nhuận ở mức tương tự như năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular standard or quality",
                    "vi": "một tiêu chuẩn hoặc chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "The hotel's level of service is consistently high.",
                        "vi": "Mức độ dịch vụ của khách sạn luôn ở mức cao."
                    },
                    {
                        "en": "The participants had different levels of education.",
                        "vi": "Những người tham gia có trình độ học vấn khác nhau."
                    },
                    {
                        "en": "He studied French to degree level.",
                        "vi": "Anh ấy học tiếng Pháp để lấy bằng cấp."
                    },
                    {
                        "en": "What is the level of this course?",
                        "vi": "Cấp độ của khóa học này là gì?"
                    },
                    {
                        "en": "It is difficult to maintain this level of performance.",
                        "vi": "Rất khó để duy trì phong độ này."
                    },
                    {
                        "en": "at a… level She has played tennis at a high level.",
                        "vi": "ở cấp độ… Cô ấy đã chơi quần vợt ở trình độ cao."
                    },
                    {
                        "en": "on a level Both players are on a level (= of the same standard).",
                        "vi": "trên một cấp độ Cả hai người chơi đều ở cùng một cấp độ (= cùng tiêu chuẩn)."
                    },
                    {
                        "en": "I refuse to sink to their level (= behave as badly as them).",
                        "vi": "Tôi từ chối chìm xuống cấp độ của họ (= cư xử tồi tệ như họ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position or rank in a scale of size or importance",
                    "vi": "một vị trí hoặc thứ hạng trong thang quy mô hoặc tầm quan trọng"
                },
                "examples": [
                    {
                        "en": "the upper levels of government",
                        "vi": "các cấp trên của chính phủ"
                    },
                    {
                        "en": "at (a) … level Discussions are currently being held at national level.",
                        "vi": "ở (a)… cấp Các cuộc thảo luận hiện đang được tổ chức ở cấp quốc gia."
                    },
                    {
                        "en": "at local/international level",
                        "vi": "ở cấp địa phương / quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of looking at, reacting to or understanding something",
                    "vi": "một cách cụ thể để xem xét, phản ứng hoặc hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "on a… level On a more personal level, I would like to thank Jean for all the help she has given me.",
                        "vi": "ở mức độ… Ở mức độ cá nhân hơn, tôi muốn cảm ơn Jean vì tất cả sự giúp đỡ mà cô ấy đã dành cho tôi."
                    },
                    {
                        "en": "Fables can be understood on various levels.",
                        "vi": "Truyện ngụ ngôn có thể được hiểu theo nhiều cấp độ khác nhau."
                    },
                    {
                        "en": "at a… level At a conscious level, I was quite satisfied with my life.",
                        "vi": "ở mức độ… Ở mức độ ý thức, tôi khá hài lòng với cuộc sống của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a series of stages in a computer game. Players progress from easy to more advanced levels within the game.",
                    "vi": "một trong một loạt các giai đoạn trong trò chơi trên máy tính. Người chơi tiến bộ từ cấp độ dễ đến cấp độ cao hơn trong trò chơi."
                },
                "examples": [
                    {
                        "en": "a computer game with 15 levels",
                        "vi": "một trò chơi máy tính có 15 cấp độ"
                    },
                    {
                        "en": "Players advance to the next level by collecting all the pieces and constructing the spaceship.",
                        "vi": "Người chơi tiến tới cấp độ tiếp theo bằng cách thu thập tất cả các mảnh và xây dựng tàu vũ trụ."
                    },
                    {
                        "en": "Each level is randomly generated so each game is different.",
                        "vi": "Mỗi cấp độ được tạo ngẫu nhiên nên mỗi trận đấu là khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device used to test whether a surface is level, consisting of a glass tube partly filled with liquid with a bubble of air inside. The position of the bubble indicates whether the surface is level.",
                    "vi": "một thiết bị dùng để kiểm tra xem bề mặt có bằng phẳng hay không, bao gồm một ống thủy tinh chứa một phần chất lỏng với bọt khí bên trong. Vị trí của bong bóng cho biết bề mặt có bằng phẳng hay không."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "honest; legal",
                    "vi": "Trung thực; hợp pháp"
                },
                "examples": [
                    {
                        "en": "I'm not convinced he's on the level.",
                        "vi": "Tôi không tin anh ấy ở đẳng cấp."
                    },
                    {
                        "en": "Are you sure this deal is on the level?",
                        "vi": "Bạn có chắc chắn thỏa thuận này là ở cấp độ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "as good, bad, important, etc. as somebody/something else",
                    "vi": "tốt, xấu, quan trọng, v.v. như ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "This place is on a level with the best French restaurants.",
                        "vi": "Nơi này là một đẳng cấp với các nhà hàng Pháp tốt nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "as good, bad, important, etc. as somebody/something else",
                    "vi": "tốt, xấu, quan trọng, v.v. như ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "This place is on a par with the best French restaurants.",
                        "vi": "Nơi này được xếp ngang hàng với những nhà hàng tốt nhất của Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to further improve or develop something that is already successful",
                    "vi": "để cải thiện hơn nữa hoặc phát triển một cái gì đó đã thành công"
                },
                "examples": [
                    {
                        "en": "He decided to move to New York to take his career to the next level.",
                        "vi": "Anh quyết định chuyển đến New York để đưa sự nghiệp của mình lên một tầm cao mới."
                    },
                    {
                        "en": "We are taking web design to the next level.",
                        "vi": "Chúng tôi đang đưa thiết kế web lên một tầm cao mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "e2f5b6ca37854afdbeb3c5f6ca50e47b",
        "word": "roof",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ruːf/",
            "us": "/ruːf/"
        },
        "nearby": [
            {
                "word": "roo",
                "pos": "noun"
            },
            {
                "word": "rood screen",
                "pos": "noun"
            },
            {
                "word": "roof",
                "pos": "noun"
            },
            {
                "word": "roof",
                "pos": "verb"
            },
            {
                "word": "roofer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the structure that covers or forms the top of a building or vehicle",
                    "vi": "cấu trúc bao phủ hoặc tạo thành phần trên cùng của một tòa nhà hoặc phương tiện"
                },
                "examples": [
                    {
                        "en": "a flat/sloping/pitched roof",
                        "vi": "mái bằng / dốc / dốc"
                    },
                    {
                        "en": "Offices on the upper floors have access to a roof terrace.",
                        "vi": "Văn phòng ở các tầng trên có lối đi lên sân thượng."
                    },
                    {
                        "en": "a tin/slate/tiled/thatched roof",
                        "vi": "một mái nhà thiếc / đá phiến / lát gạch / tranh"
                    },
                    {
                        "en": "The corner of the classroom was damp where the roof had leaked.",
                        "vi": "Góc phòng học ẩm thấp nơi mái tôn dột."
                    },
                    {
                        "en": "Tim climbed on to the garage roof.",
                        "vi": "Tim trèo lên mái nhà để xe."
                    },
                    {
                        "en": "The roof of the car was not damaged in the accident.",
                        "vi": "Phần mui của chiếc ô tô không bị hư hỏng trong vụ tai nạn."
                    },
                    {
                        "en": "Offices on the upper floors have access to a roof terrace.",
                        "vi": "Văn phòng ở các tầng trên có lối đi lên sân thượng."
                    },
                    {
                        "en": "We stepped out onto the roof of the building.",
                        "vi": "Chúng tôi bước ra sân thượng của tòa nhà."
                    },
                    {
                        "en": "I have solar panels on my roof.",
                        "vi": "Tôi có các tấm pin mặt trời trên mái nhà của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of roof mentioned",
                    "vi": "có loại mái được đề cập"
                },
                "examples": [
                    {
                        "en": "flat-roofed buildings",
                        "vi": "tòa nhà mái bằng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of an underground space such as a tunnel or cave",
                    "vi": "trên cùng của một không gian ngầm như đường hầm hoặc hang động"
                },
                "examples": [
                    {
                        "en": "The roof of the tunnel was starting to collapse.",
                        "vi": "Mái của đường hầm bắt đầu sập xuống."
                    },
                    {
                        "en": "The cave had a very low roof.",
                        "vi": "Hang động có mái rất thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top of the inside of your mouth",
                    "vi": "đầu bên trong miệng của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to rise or increase very quickly",
                    "vi": "tăng hoặc tăng rất nhanh"
                },
                "examples": [
                    {
                        "en": "House prices here have gone through the roof.",
                        "vi": "Giá nhà ở đây đã lên tới nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very angry",
                    "vi": "trở nên rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have somewhere to live",
                    "vi": "có một nơi nào đó để sống"
                },
                "examples": [
                    {
                        "en": "Thanks to Bob’s generosity, I still have a roof over my head.",
                        "vi": "Cảm ơn sự hào phóng của Bob, tôi vẫn có một mái nhà trên đầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce or make somebody produce a lot of noise in a building, for example by shouting or cheering",
                    "vi": "để tạo ra hoặc khiến ai đó tạo ra nhiều tiếng ồn trong một tòa nhà, chẳng hạn như bằng cách la hét hoặc cổ vũ"
                },
                "examples": [
                    {
                        "en": "Their cheers raised the roof.",
                        "vi": "Tiếng hò reo của họ đã nâng nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the same building or house",
                    "vi": "trong cùng một tòa nhà hoặc một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "There are various stores and restaurants all under one roof.",
                        "vi": "Có nhiều cửa hàng và nhà hàng khác nhau dưới một mái nhà."
                    },
                    {
                        "en": "I don't think I can live under the same roof as you any longer.",
                        "vi": "Tôi không nghĩ mình có thể sống chung dưới một mái nhà với các bạn nữa."
                    },
                    {
                        "en": "We're good friends but we could never live under the same roof.",
                        "vi": "Chúng tôi là bạn tốt của nhau nhưng chúng tôi không bao giờ có thể sống chung dưới một mái nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "in your home",
                    "vi": "ở nhà bạn"
                },
                "examples": [
                    {
                        "en": "I don't want her under my roof again.",
                        "vi": "Tôi không muốn cô ấy ở dưới mái nhà của tôi một lần nữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "50641ea4bdfd4e01a69aa21ce1fde76a",
        "word": "stair",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/steə(r)/",
            "us": "/ster/"
        },
        "nearby": [
            {
                "word": "stainless steel",
                "pos": "noun"
            },
            {
                "word": "stair",
                "pos": "adjective"
            },
            {
                "word": "stair",
                "pos": "noun"
            },
            {
                "word": "staircase",
                "pos": "noun"
            },
            {
                "word": "stairlift",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of steps built between two floors inside a building",
                    "vi": "một tập hợp các bước được xây dựng giữa hai tầng trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "We had to carry the piano up three flights of stairs.",
                        "vi": "Chúng tôi phải khiêng cây đàn lên ba bậc cầu thang."
                    },
                    {
                        "en": "He climbed the stairs to his bedroom",
                        "vi": "Anh ấy leo lên cầu thang vào phòng ngủ của mình"
                    },
                    {
                        "en": "up/down the stairs The children ran up the stairs.",
                        "vi": "lên / xuống cầu thang Bọn trẻ chạy lên cầu thang."
                    },
                    {
                        "en": "on the stairs He remembered passing her on the stairs.",
                        "vi": "trên cầu thang Anh nhớ đã đèo cô trên cầu thang."
                    },
                    {
                        "en": "at the bottom/top of the stairs",
                        "vi": "ở dưới cùng / trên cùng của cầu thang"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the steps in a set of stairs",
                    "vi": "một trong những bước trong một bộ cầu thang"
                },
                "examples": [
                    {
                        "en": "How many stairs are there up to the second floor?",
                        "vi": "Có bao nhiêu cầu thang lên tầng hai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of stairs inside a building including the banisters (= posts and bars that are fixed at the side)",
                    "vi": "một bộ cầu thang bên trong tòa nhà bao gồm cả lan can (= trụ và thanh được cố định ở bên cạnh)"
                },
                "examples": [
                    {
                        "en": "The house had a panelled hall and a fine oak stair.",
                        "vi": "Ngôi nhà có một sảnh ốp và một cầu thang bằng gỗ sồi mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the part of a house where the servants lived in the past",
                    "vi": "trong phần của một ngôi nhà nơi những người hầu ở trong quá khứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3fb4734c2d40479585b7e74cf1764406",
        "word": "upstairs",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌʌpˈsteəz/",
            "us": "/ˌʌpˈsterz/"
        },
        "nearby": [
            {
                "word": "Upstairs, Downstairs",
                "pos": ""
            },
            {
                "word": "upstairs",
                "pos": "adverb"
            },
            {
                "word": "upstairs",
                "pos": "adjective"
            },
            {
                "word": "upstairs",
                "pos": "noun"
            },
            {
                "word": "upstanding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on a floor of a house or other building that is higher than the one that you are on",
                    "vi": "trên tầng của một ngôi nhà hoặc tòa nhà khác cao hơn tầng mà bạn đang ở"
                },
                "examples": [
                    {
                        "en": "an upstairs room/window/bathroom",
                        "vi": "một phòng trên lầu / cửa sổ / phòng tắm"
                    },
                    {
                        "en": "Bob looked up and saw the light in the upstairs bedroom.",
                        "vi": "Bob nhìn lên và thấy ánh sáng trong phòng ngủ trên lầu."
                    },
                    {
                        "en": "She rents a small upstairs apartment in a family's house.",
                        "vi": "Cô thuê một căn hộ nhỏ trên lầu trong ngôi nhà của một gia đình."
                    },
                    {
                        "en": "The restaurant has a great upstairs bar with very comfortable seating.",
                        "vi": "Nhà hàng có một quầy bar trên lầu tuyệt vời với chỗ ngồi rất thoải mái."
                    }
                ]
            }
        ]
    },
    {
        "id": "6cbce04441044a31bc7e57ffddb7c20b",
        "word": "back door",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌbæk ˈdɔː(r)/",
            "us": "/ˌbæk ˈdɔːr/"
        },
        "nearby": [
            {
                "word": "backcrawl",
                "pos": "noun"
            },
            {
                "word": "backdate",
                "pos": "verb"
            },
            {
                "word": "back door",
                "pos": "noun"
            },
            {
                "word": "back-door",
                "pos": "adjective"
            },
            {
                "word": "back down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the door at the back or side of a building",
                    "vi": "cửa ở phía sau hoặc bên hông của một tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in an unfair or indirect way",
                    "vi": "theo cách không công bằng hoặc gián tiếp"
                },
                "examples": [
                    {
                        "en": "He used his friends to help him get into the civil service by the back door.",
                        "vi": "Anh ta đã sử dụng bạn bè của mình để giúp anh ta vào dịch vụ dân sự bằng cửa sau."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9d0282151154f93a84391192246c032",
        "word": "balcony",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbælkəni/",
            "us": "/ˈbælkəni/"
        },
        "nearby": [
            {
                "word": "George Balanchine",
                "pos": ""
            },
            {
                "word": "balancing act",
                "pos": "noun"
            },
            {
                "word": "balcony",
                "pos": "noun"
            },
            {
                "word": "bald",
                "pos": "adjective"
            },
            {
                "word": "bald eagle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a platform that is built on the upstairs outside wall of a building, with a wall or rail around it. You can get out onto a balcony from an upstairs room.",
                    "vi": "một nền tảng được xây dựng trên bức tường bên ngoài tầng trên của một tòa nhà, với một bức tường hoặc đường ray xung quanh nó. Bạn có thể ra ban công từ phòng trên lầu."
                },
                "examples": [
                    {
                        "en": "We had drinks on the hotel balcony.",
                        "vi": "Chúng tôi đã có đồ uống trên ban công khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of seats upstairs in a theatre",
                    "vi": "một khu vực ghế trên lầu trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1b0dbf54a18f488e9ef65c648206ebc3",
        "word": "ceiling",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːlɪŋ/",
            "us": "/ˈsiːlɪŋ/"
        },
        "nearby": [
            {
                "word": "CEFR",
                "pos": "abbreviation"
            },
            {
                "word": "ceilidh",
                "pos": "noun"
            },
            {
                "word": "ceiling",
                "pos": "noun"
            },
            {
                "word": "ceiling rose",
                "pos": "noun"
            },
            {
                "word": "celandine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top inside surface of a room",
                    "vi": "bề mặt bên trong trên cùng của một căn phòng"
                },
                "examples": [
                    {
                        "en": "a large room with a high ceiling",
                        "vi": "một căn phòng lớn với trần nhà cao"
                    },
                    {
                        "en": "The walls and ceiling were painted white.",
                        "vi": "Tường và trần được sơn màu trắng."
                    },
                    {
                        "en": "A large chandelier hangs from the ceiling.",
                        "vi": "Một chiếc đèn chùm lớn treo trên trần nhà."
                    },
                    {
                        "en": "on a ceiling a fly on the ceiling",
                        "vi": "trên trần nhà bay trên trần nhà"
                    },
                    {
                        "en": "ceiling of something The ceiling of her room was low.",
                        "vi": "trần của cái gì đó Trần phòng của cô ấy thấp."
                    },
                    {
                        "en": "She lay on her back staring up at the ceiling.",
                        "vi": "Cô nằm ngửa, nhìn chằm chằm lên trần nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest limit or amount of something",
                    "vi": "giới hạn cao nhất hoặc số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The government has decided to lift price ceilings on bread and milk.",
                        "vi": "Chính phủ đã quyết định nâng trần giá bánh mì và sữa."
                    },
                    {
                        "en": "The reality is the economy is hitting the ceiling and the growth rate must slow.",
                        "vi": "Thực tế là nền kinh tế đang tăng kịch trần và tốc độ tăng trưởng phải chậm lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the greatest height at which a particular aircraft is able to fly",
                    "vi": "độ cao lớn nhất mà một chiếc máy bay cụ thể có thể bay"
                },
                "examples": [
                    {
                        "en": "an aircraft with a ceiling of 20 000 feet",
                        "vi": "một chiếc máy bay có trần bay 20.000 feet"
                    }
                ]
            }
        ]
    },
    {
        "id": "e1d7909d8f0b4d5ea67cb86c15080aa3",
        "word": "entrance",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈentrəns/",
            "us": "/ˈentrəns/"
        },
        "nearby": [
            {
                "word": "entr'acte",
                "pos": "noun"
            },
            {
                "word": "entrails",
                "pos": "noun"
            },
            {
                "word": "entrance1",
                "pos": "noun"
            },
            {
                "word": "entrance2",
                "pos": "verb"
            },
            {
                "word": "entrance hall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a door, gate, passage, etc. used for entering a room, building or place",
                    "vi": "cửa, cổng, lối đi, v.v. được sử dụng để vào phòng, tòa nhà hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "the front/back/side entrance of the house",
                        "vi": "lối vào trước / sau / bên hông của ngôi nhà"
                    },
                    {
                        "en": "A separate entrance leads to the garden.",
                        "vi": "Một lối vào riêng dẫn ra khu vườn."
                    },
                    {
                        "en": "At last we reached the entrance of the cave.",
                        "vi": "Cuối cùng thì chúng tôi cũng đến được cửa hang."
                    },
                    {
                        "en": "entrance to something Protesters blocked the entrance to the building.",
                        "vi": "lối vào một cái gì đó Người biểu tình đã chặn lối vào tòa nhà."
                    },
                    {
                        "en": "A lighthouse marks the entrance to the harbour.",
                        "vi": "Một ngọn hải đăng đánh dấu lối vào bến cảng."
                    },
                    {
                        "en": "at the entrance I'll meet you at the main entrance.",
                        "vi": "ở lối vào, tôi sẽ gặp bạn ở lối vào chính."
                    },
                    {
                        "en": "Guards were posted at the entrance.",
                        "vi": "Bảo vệ đã được bố trí ở lối vào."
                    },
                    {
                        "en": "an entrance hall",
                        "vi": "một sảnh vào"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of entering a room, building or place, especially in a way that attracts the attention of other people",
                    "vi": "hành động bước vào một căn phòng, tòa nhà hoặc địa điểm, đặc biệt là theo cách thu hút sự chú ý của người khác"
                },
                "examples": [
                    {
                        "en": "His sudden entrance took everyone by surprise.",
                        "vi": "Sự ra vào đột ngột của anh khiến mọi người không khỏi ngạc nhiên."
                    },
                    {
                        "en": "A fanfare signalled the entrance of the king.",
                        "vi": "Một cuộc phô trương báo hiệu sự ra vào của nhà vua."
                    },
                    {
                        "en": "She made her entrance after all the other guests had arrived.",
                        "vi": "Cô ấy vào cửa sau khi tất cả những vị khách khác đã đến."
                    },
                    {
                        "en": "The hero makes his entrance (= walks onto the stage) in Scene 2.",
                        "vi": "Người anh hùng đi vào (= bước lên sân khấu) trong Cảnh 2."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to enter a building or place",
                    "vi": "quyền hoặc cơ hội để vào một tòa nhà hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "They were refused entrance to the exhibition.",
                        "vi": "Họ đã bị từ chối vào cửa triển lãm."
                    },
                    {
                        "en": "The police were unable to gain entrance to the house.",
                        "vi": "Cảnh sát không thể vào được ngôi nhà."
                    },
                    {
                        "en": "an entrance fee (= money paid to go into a museum, etc.)",
                        "vi": "phí vào cửa (= tiền phải trả để vào viện bảo tàng, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of becoming involved in something",
                    "vi": "hành động tham gia vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company made a dramatic entrance into the export market.",
                        "vi": "Công ty đã thâm nhập mạnh mẽ vào thị trường xuất khẩu."
                    },
                    {
                        "en": "her entrance into politics",
                        "vi": "bước vào chính trị của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "permission to become a member of a club, society, university, etc.",
                    "vi": "được phép trở thành thành viên của câu lạc bộ, xã hội, trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "a university entrance exam",
                        "vi": "một kỳ thi tuyển sinh đại học"
                    },
                    {
                        "en": "What are the entrance requirements for this course?",
                        "vi": "Yêu cầu đầu vào cho khóa học này là gì?"
                    },
                    {
                        "en": "students hoping to gain entrance to college",
                        "vi": "học sinh hy vọng vào được đại học"
                    },
                    {
                        "en": "entrance (to something) Entrance to the golf club is by sponsorship only.",
                        "vi": "lối vào (đến một cái gì đó) Lối vào câu lạc bộ gôn chỉ được tài trợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e833c93163142e28a8bdaedaf7e4fe3",
        "word": "first-floor",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfɜːst ˈflɔː(r)/",
            "us": "/ˌfɜːrst ˈflɔːr/"
        },
        "nearby": [
            {
                "word": "first finger",
                "pos": "noun"
            },
            {
                "word": "first floor",
                "pos": "noun"
            },
            {
                "word": "first-floor",
                "pos": "adjective"
            },
            {
                "word": "the First Folio",
                "pos": ""
            },
            {
                "word": "first-foot",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on the level of a building that is above the ground level",
                    "vi": "ở cấp độ của một tòa nhà cao hơn mặt đất"
                },
                "examples": [
                    {
                        "en": "a first-floor flat",
                        "vi": "căn hộ tầng một"
                    }
                ]
            },
            {
                "define": {
                    "en": "on the floor of a building that is at the same level as the ground outside",
                    "vi": "trên tầng của một tòa nhà ngang bằng với mặt đất bên ngoài"
                },
                "examples": [
                    {
                        "en": "a first-floor apartment",
                        "vi": "một căn hộ ở tầng một"
                    }
                ]
            }
        ]
    },
    {
        "id": "895b9f685f144861b5370a23851001d7",
        "word": "front door",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfrʌnt ˈdɔː(r)/",
            "us": "/ˌfrʌnt ˈdɔːr/"
        },
        "nearby": [
            {
                "word": "frontbencher",
                "pos": "noun"
            },
            {
                "word": "front desk",
                "pos": "noun"
            },
            {
                "word": "front door",
                "pos": "noun"
            },
            {
                "word": "front end",
                "pos": "noun"
            },
            {
                "word": "front-end",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main entrance to a house, usually at the front",
                    "vi": "lối vào chính của một ngôi nhà, thường ở phía trước"
                },
                "examples": [
                    {
                        "en": "There's someone at the front door.",
                        "vi": "Có ai đó ở cửa trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3b47f8d7e3644c6b6f98c19fd191ca6",
        "word": "indoor",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɪndɔː(r)/",
            "us": "/ˈɪndɔːr/"
        },
        "nearby": [
            {
                "word": "Indonesia",
                "pos": "noun"
            },
            {
                "word": "Indonesian",
                "pos": "noun, adjective"
            },
            {
                "word": "indoor",
                "pos": "adjective"
            },
            {
                "word": "indoors",
                "pos": "adverb"
            },
            {
                "word": "indrawn",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "located, done or used inside a building",
                    "vi": "nằm, thực hiện hoặc sử dụng bên trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "an indoor swimming pool",
                        "vi": "một bể bơi trong nhà"
                    },
                    {
                        "en": "indoor games",
                        "vi": "trò chơi trong nhà"
                    },
                    {
                        "en": "Poor indoor air quality can result in increased risk of asthma and allergies.",
                        "vi": "Chất lượng không khí trong nhà kém có thể làm tăng nguy cơ mắc bệnh hen suyễn và dị ứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to sports played indoors",
                    "vi": "liên quan đến các môn thể thao chơi trong nhà"
                },
                "examples": [
                    {
                        "en": "the world indoor 200 metres champion",
                        "vi": "nhà vô địch thế giới 200 mét trong nhà"
                    }
                ]
            }
        ]
    },
    {
        "id": "cc1acd49b9b145cba1d8bf1da8334990",
        "word": "indoors",
        "pos": "adverb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌɪnˈdɔːz/",
            "us": "/ˌɪnˈdɔːrz/"
        },
        "nearby": [
            {
                "word": "Indonesian",
                "pos": "noun, adjective"
            },
            {
                "word": "indoor",
                "pos": "adjective"
            },
            {
                "word": "indoors",
                "pos": "adverb"
            },
            {
                "word": "indrawn",
                "pos": "adjective"
            },
            {
                "word": "indubitable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "inside or into a building",
                    "vi": "bên trong hoặc vào một tòa nhà"
                },
                "examples": [
                    {
                        "en": "I prefer to stay indoors in this really hot weather.",
                        "vi": "Tôi thích ở trong nhà hơn trong thời tiết thực sự nóng nực này."
                    },
                    {
                        "en": "Let's go indoors.",
                        "vi": "Vào nhà đi."
                    },
                    {
                        "en": "I was indoors watching TV when I heard shouting in the street.",
                        "vi": "Tôi đang ở trong nhà xem TV thì nghe thấy tiếng la hét ngoài đường."
                    },
                    {
                        "en": "Many herbs can be grown indoors.",
                        "vi": "Nhiều loại thảo mộc có thể được trồng trong nhà."
                    },
                    {
                        "en": "She added that in Hong Kong most cats were kept indoors.",
                        "vi": "Cô nói thêm rằng ở Hồng Kông hầu hết mèo được nuôi trong nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "b622d450cfd643fba3b29fe6e096527a",
        "word": "outdoor",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈaʊtdɔː(r)/",
            "us": "/ˈaʊtdɔːr/"
        },
        "nearby": [
            {
                "word": "outdistance",
                "pos": "verb"
            },
            {
                "word": "outdo",
                "pos": "verb"
            },
            {
                "word": "outdoor",
                "pos": "adjective"
            },
            {
                "word": "outdoors",
                "pos": "adverb"
            },
            {
                "word": "outdoors",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used, happening or located outside rather than in a building",
                    "vi": "được sử dụng, đang diễn ra hoặc nằm bên ngoài thay vì trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "outdoor pursuits/recreation/activities",
                        "vi": "theo đuổi / giải trí / hoạt động ngoài trời"
                    },
                    {
                        "en": "They sell camping equipment, hiking gear and outdoor clothing.",
                        "vi": "Họ bán thiết bị cắm trại, đồ đi bộ đường dài và quần áo ngoài trời."
                    },
                    {
                        "en": "an outdoor swimming pool",
                        "vi": "một bể bơi ngoài trời"
                    },
                    {
                        "en": "I'm not really the outdoor type (= I prefer indoor activities).",
                        "vi": "Tôi thực sự không phải là người thích hoạt động ngoài trời (= Tôi thích các hoạt động trong nhà hơn)."
                    },
                    {
                        "en": "a cafe with indoor and outdoor seating",
                        "vi": "một quán cà phê có chỗ ngồi trong nhà và ngoài trời"
                    }
                ]
            }
        ]
    },
    {
        "id": "a1988985450a40fd8e1f1dab8a63453e",
        "word": "outdoors",
        "pos": "adverb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌaʊtˈdɔːz/",
            "us": "/ˌaʊtˈdɔːrz/"
        },
        "nearby": [
            {
                "word": "outdo",
                "pos": "verb"
            },
            {
                "word": "outdoor",
                "pos": "adjective"
            },
            {
                "word": "outdoors",
                "pos": "adverb"
            },
            {
                "word": "outdoors",
                "pos": "noun"
            },
            {
                "word": "outdoorsman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "outside, rather than in a building",
                    "vi": "bên ngoài, thay vì trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "The rain prevented them from eating outdoors.",
                        "vi": "Mưa khiến chúng không thể kiếm ăn ngoài trời."
                    },
                    {
                        "en": "The seeds may be sown outdoors in the spring.",
                        "vi": "Hạt giống có thể được gieo ngoài trời vào mùa xuân."
                    },
                    {
                        "en": "It is often too cold to venture outdoors.",
                        "vi": "Thường quá lạnh để mạo hiểm ngoài trời."
                    },
                    {
                        "en": "The children were encouraged to paint and draw both indoors and outdoors.",
                        "vi": "Các em được khuyến khích vẽ và vẽ cả trong nhà và ngoài trời."
                    }
                ]
            }
        ]
    },
    {
        "id": "3fe1017e8f4b42538e1872cee64d9179",
        "word": "doorbell",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɔːbel/",
            "us": "/ˈdɔːrbel/"
        },
        "nearby": [
            {
                "word": "Doonesbury",
                "pos": ""
            },
            {
                "word": "door",
                "pos": "noun"
            },
            {
                "word": "doorbell",
                "pos": "noun"
            },
            {
                "word": "do-or-die",
                "pos": "adjective"
            },
            {
                "word": "door furniture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bell with a button outside a house that you push to let the people inside know that you are there",
                    "vi": "một chiếc chuông có nút bấm bên ngoài ngôi nhà mà bạn ấn để những người bên trong biết rằng bạn đang ở đó"
                },
                "examples": [
                    {
                        "en": "to ring the doorbell",
                        "vi": "bấm chuông cửa"
                    },
                    {
                        "en": "He refused to answer the doorbell.",
                        "vi": "Anh từ chối trả lời chuông cửa."
                    },
                    {
                        "en": "I heard the doorbell ring, and went to see who was there.",
                        "vi": "Tôi nghe thấy tiếng chuông cửa, và đi xem ai ở đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "3f5d615c12124a7ab1782abe89e28b50",
        "word": "doorstep",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɔːstep/",
            "us": "/ˈdɔːrstep/"
        },
        "nearby": [
            {
                "word": "door prize",
                "pos": "noun"
            },
            {
                "word": "The Doors",
                "pos": ""
            },
            {
                "word": "doorstep",
                "pos": "noun"
            },
            {
                "word": "doorstep",
                "pos": "verb"
            },
            {
                "word": "doorstop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a step outside a door of a building, or the area that is very close to the door",
                    "vi": "bước ra ngoài cửa của một tòa nhà hoặc khu vực rất gần cửa"
                },
                "examples": [
                    {
                        "en": "The police turned up on their doorstep at 3 o'clock this morning.",
                        "vi": "Cảnh sát có mặt trước cửa nhà họ lúc 3 giờ sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thick piece of bread, usually one that is made into a sandwich",
                    "vi": "một miếng bánh mì dày, thường là một miếng bánh mì được làm thành sandwich"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very close to where a person lives",
                    "vi": "rất gần nơi một người sống"
                },
                "examples": [
                    {
                        "en": "The nightlife is great with bars and clubs right on the doorstep.",
                        "vi": "Cuộc sống về đêm thật tuyệt vời với các quán bar và câu lạc bộ ngay trước cửa nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "c8717e53d707427e93881a48f95ba194",
        "word": "doorway",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɔːweɪ/",
            "us": "/ˈdɔːrweɪ/"
        },
        "nearby": [
            {
                "word": "doorstep",
                "pos": "verb"
            },
            {
                "word": "doorstop",
                "pos": "noun"
            },
            {
                "word": "doorway",
                "pos": "noun"
            },
            {
                "word": "do out",
                "pos": "phrasal verb"
            },
            {
                "word": "do out of",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening into a building or a room, where the door is",
                    "vi": "một sự mở cửa vào một tòa nhà hoặc một căn phòng, nơi có cánh cửa"
                },
                "examples": [
                    {
                        "en": "She stood in the doorway for a moment before going in.",
                        "vi": "Cô đứng ở ngưỡng cửa một lúc trước khi đi vào."
                    },
                    {
                        "en": "homeless people sleeping in shop doorways",
                        "vi": "những người vô gia cư ngủ trong cửa hàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "3d5dcc98e0ac4d1ea654030cd6b0d7c3",
        "word": "entry",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈentri/",
            "us": "/ˈentri/"
        },
        "nearby": [
            {
                "word": "entropy",
                "pos": "noun"
            },
            {
                "word": "entrust",
                "pos": "verb"
            },
            {
                "word": "entry",
                "pos": "noun"
            },
            {
                "word": "entry-level",
                "pos": "adjective"
            },
            {
                "word": "Entryphone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of going into or getting into a place",
                    "vi": "một hành động đi vào hoặc đến một nơi"
                },
                "examples": [
                    {
                        "en": "She made her entry to the sound of thunderous applause.",
                        "vi": "Cô ấy đã nhập cuộc trong tiếng vỗ tay như sấm."
                    },
                    {
                        "en": "The children were surprised by the sudden entry of their teacher.",
                        "vi": "Bọn trẻ ngạc nhiên trước sự đột ngột của cô giáo."
                    },
                    {
                        "en": "They block the entry of the HIV virus into the cells.",
                        "vi": "Chúng ngăn chặn sự xâm nhập của vi rút HIV vào các tế bào."
                    },
                    {
                        "en": "entry into something How did the thieves gain entry into the building?",
                        "vi": "xâm nhập vào một cái gì đó Làm thế nào những tên trộm xâm nhập vào tòa nhà?"
                    },
                    {
                        "en": "entry to something Efforts to effect an entry to the flooded submarine were unsuccessful.",
                        "vi": "lối vào một cái gì đó Những nỗ lực để thực hiện một lối vào tàu ngầm ngập nước đã không thành công."
                    },
                    {
                        "en": "Drugs come into the country through five main entry points.",
                        "vi": "Ma túy vào nước này thông qua 5 cửa khẩu chính."
                    },
                    {
                        "en": "There are security checks at the point of entry.",
                        "vi": "Có kiểm tra an ninh tại điểm nhập cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to enter a place",
                    "vi": "quyền hoặc cơ hội để vào một nơi"
                },
                "examples": [
                    {
                        "en": "No Entry (= for example, on a sign)",
                        "vi": "Không có mục nhập (= ví dụ: trên một dấu hiệu)"
                    },
                    {
                        "en": "entry to something Entry to the museum is free.",
                        "vi": "vào cửa một cái gì đó Vào cửa bảo tàng là miễn phí."
                    },
                    {
                        "en": "entry into something to be granted/refused entry into the country",
                        "vi": "nhập cảnh vào một cái gì đó để được cấp / từ chối nhập cảnh vào đất nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you do, write or make to take part in a competition, for example answering a set of questions",
                    "vi": "điều gì đó bạn làm, viết hoặc làm để tham gia một cuộc thi, chẳng hạn như trả lời một bộ câu hỏi"
                },
                "examples": [
                    {
                        "en": "There have been some impressive entries in the wildlife photography section (= impressive photographs).",
                        "vi": "Đã có một số bài dự thi ấn tượng trong phần nhiếp ảnh động vật hoang dã (= những bức ảnh ấn tượng)."
                    },
                    {
                        "en": "The closing date for entries is 31 March.",
                        "vi": "Ngày đóng cửa cho các mục là 31 tháng Ba."
                    },
                    {
                        "en": "The winning entry will be published in next month's issue.",
                        "vi": "Bài dự thi chiến thắng sẽ được xuất bản trong số ra tháng tới."
                    },
                    {
                        "en": "The sender of the first correct entry drawn will win a weekend for two in Venice.",
                        "vi": "Người gửi bài viết đúng đầu tiên được rút thăm sẽ giành chiến thắng trong hai ngày cuối tuần ở Venice."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of taking part in a competition, race, etc.",
                    "vi": "hành động tham gia vào một cuộc thi, cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "Entry is open to anyone over the age of 18.",
                        "vi": "Mọi người trên 18 tuổi đều có thể vào cửa."
                    },
                    {
                        "en": "an entry form/fee",
                        "vi": "một biểu mẫu / lệ phí tham gia"
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of people who are taking part in a competition, race, etc.",
                    "vi": "tổng số người đang tham gia một cuộc thi, cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "There's a record entry for this year's marathon.",
                        "vi": "Có một mục nhập kỷ lục cho cuộc thi marathon năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item, for example a piece of information, that is written or printed in a dictionary, an account book, a diary, etc.",
                    "vi": "một mục, ví dụ một đoạn thông tin, được viết hoặc in trong từ điển, sổ tài khoản, nhật ký, v.v."
                },
                "examples": [
                    {
                        "en": "an encyclopedia entry",
                        "vi": "Một mục nhập bách khoa toàn thư"
                    },
                    {
                        "en": "a blog/diary/journal entry",
                        "vi": "một mục blog / nhật ký / tạp chí"
                    },
                    {
                        "en": "entry in something There is no entry in his diary for that day.",
                        "vi": "entry in something Không có mục nào trong nhật ký của anh ấy cho ngày hôm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of recording information in a computer, book, etc.",
                    "vi": "hành động ghi lại thông tin trong máy tính, sách, v.v."
                },
                "examples": [
                    {
                        "en": "The job involves filing and data entry.",
                        "vi": "Công việc liên quan đến việc lập hồ sơ và nhập dữ liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to take part in something or become a member of a group",
                    "vi": "quyền hoặc cơ hội tham gia vào điều gì đó hoặc trở thành thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "entry into something countries seeking entry into the European Union",
                        "vi": "nhập cảnh vào một số quốc gia đang tìm cách gia nhập Liên minh Châu Âu"
                    },
                    {
                        "en": "It is extremely difficult for new companies to gain entry into the market.",
                        "vi": "Các công ty mới gia nhập thị trường là điều vô cùng khó khăn."
                    },
                    {
                        "en": "entry to something She applied for entry to Nottingham University.",
                        "vi": "entry to something Cô ấy đã nộp đơn xin vào Đại học Nottingham."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of taking part in an activity or becoming a member of a group",
                    "vi": "hành động tham gia vào một hoạt động hoặc trở thành thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "entry into something Things changed forever with the entry of women into the workforce.",
                        "vi": "thâm nhập vào một cái gì đó Mọi thứ đã thay đổi mãi mãi với sự gia nhập của phụ nữ vào lực lượng lao động."
                    },
                    {
                        "en": "That was before the American entry into the war.",
                        "vi": "Đó là trước khi người Mỹ tham chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a door, gate or passage where you enter a building; an entrance hall",
                    "vi": "cửa, cổng hoặc lối đi mà bạn bước vào một tòa nhà; một sảnh vào"
                },
                "examples": [
                    {
                        "en": "You can leave your umbrella in the entry.",
                        "vi": "Bạn có thể để ô của bạn ở lối vào."
                    },
                    {
                        "en": "the dramatic entry to the gallery",
                        "vi": "lối vào phòng trưng bày ấn tượng"
                    }
                ]
            }
        ]
    },
    {
        "id": "4b188d304e2f42f6b0c776d16dc3dd98",
        "word": "open-plan",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌəʊpən ˈplæn/",
            "us": "/ˌəʊpən ˈplæn/"
        },
        "nearby": [
            {
                "word": "open out",
                "pos": "phrasal verb"
            },
            {
                "word": "open-pit",
                "pos": "adjective"
            },
            {
                "word": "open-plan",
                "pos": "adjective"
            },
            {
                "word": "open prison",
                "pos": "noun"
            },
            {
                "word": "open sandwich",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an open-plan building or area does not have inside walls dividing it up into rooms",
                    "vi": "một tòa nhà hoặc khu vực không gian mở không có tường bên trong chia thành các phòng"
                },
                "examples": [
                    {
                        "en": "an open-plan office",
                        "vi": "một văn phòng không gian mở"
                    }
                ]
            }
        ]
    },
    {
        "id": "7d013901b6014910820d8c91b3634ca3",
        "word": "rooftop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈruːftɒp/",
            "us": "/ˈruːftɑːp/"
        },
        "nearby": [
            {
                "word": "roofing",
                "pos": "noun"
            },
            {
                "word": "roof rack",
                "pos": "noun"
            },
            {
                "word": "rooftop",
                "pos": "noun"
            },
            {
                "word": "rooibos",
                "pos": "noun"
            },
            {
                "word": "rook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outside part of the roof of a building",
                    "vi": "phần bên ngoài của mái nhà của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "From the hill we looked out over the rooftops of Athens.",
                        "vi": "Từ trên đồi, chúng tôi nhìn ra những mái nhà của Athens."
                    },
                    {
                        "en": "The prisoners staged a rooftop protest.",
                        "vi": "Các tù nhân đã tổ chức một cuộc biểu tình trên sân thượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about something in a very public way",
                    "vi": "để nói về điều gì đó một cách rất công khai"
                },
                "examples": [
                    {
                        "en": "He was in love and wanted to shout it from the rooftops.",
                        "vi": "Anh yêu và muốn hét lên từ những mái nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea0c3e912ea44d688121308f8930e29a",
        "word": "step",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/step/",
            "us": "/step/"
        },
        "nearby": [
            {
                "word": "stent",
                "pos": "noun"
            },
            {
                "word": "stentorian",
                "pos": "adjective"
            },
            {
                "word": "step",
                "pos": "noun"
            },
            {
                "word": "step",
                "pos": "verb"
            },
            {
                "word": "step-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a series of things that you do in order to achieve something",
                    "vi": "một trong những việc bạn làm để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "We are taking steps to prevent pollution.",
                        "vi": "Chúng tôi đang thực hiện các bước để ngăn chặn ô nhiễm."
                    },
                    {
                        "en": "It's a big step giving up your job and moving halfway across the world.",
                        "vi": "Đó là một bước tiến lớn khi từ bỏ công việc của bạn và di chuyển nửa vòng trái đất."
                    },
                    {
                        "en": "a necessary/an important/a positive step",
                        "vi": "một bước cần thiết / quan trọng / tích cực"
                    },
                    {
                        "en": "step toward(s) something This was a first step towards a united Europe.",
                        "vi": "bước tới (những) thứ gì đó Đây là bước đầu tiên hướng tới một châu Âu thống nhất."
                    },
                    {
                        "en": "This won't solve the problem but it's a step in the right direction.",
                        "vi": "Điều này sẽ không giải quyết được vấn đề nhưng đó là một bước đi đúng hướng."
                    },
                    {
                        "en": "The new drug represents a major step forward in the treatment of the disease.",
                        "vi": "Loại thuốc mới thể hiện một bước tiến lớn trong việc điều trị căn bệnh này."
                    },
                    {
                        "en": "Closing the factory would be a retrograde step.",
                        "vi": "Đóng cửa nhà máy sẽ là một bước đi ngược lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a series of things that somebody does or that happen, which forms part of a process",
                    "vi": "một trong một loạt những điều ai đó làm hoặc điều đó xảy ra, tạo thành một phần của quá trình"
                },
                "examples": [
                    {
                        "en": "Having completed the first stage, you can move on to step 2.",
                        "vi": "Sau khi hoàn thành giai đoạn đầu tiên, bạn có thể chuyển sang bước 2."
                    },
                    {
                        "en": "If you follow all the steps, nothing will go wrong.",
                        "vi": "Nếu bạn làm theo tất cả các bước, sẽ không có gì sai."
                    },
                    {
                        "en": "I'd like to take this idea a step further.",
                        "vi": "Tôi muốn thực hiện ý tưởng này một bước xa hơn."
                    },
                    {
                        "en": "This was a big step up (= to a better position) in his career.",
                        "vi": "Đây là một bước tiến lớn (= lên một vị trí tốt hơn) trong sự nghiệp của anh ấy."
                    },
                    {
                        "en": "I'll explain it to you step by step.",
                        "vi": "Tôi sẽ giải thích nó cho bạn từng bước."
                    },
                    {
                        "en": "a step-by-step guide to building your own home",
                        "vi": "hướng dẫn từng bước để xây dựng ngôi nhà của riêng bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of lifting your foot and putting it down in order to walk or move somewhere; the sound this makes",
                    "vi": "hành động nhấc chân của bạn và đặt nó xuống để đi bộ hoặc di chuyển đến một nơi nào đó; âm thanh này tạo ra"
                },
                "examples": [
                    {
                        "en": "a baby’s first steps",
                        "vi": "những bước đầu tiên của em bé"
                    },
                    {
                        "en": "He took a step towards the door.",
                        "vi": "Anh bước một bước về phía cửa."
                    },
                    {
                        "en": "We heard steps outside.",
                        "vi": "Chúng tôi đã nghe thấy những bước bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the distance that you cover when you take a step",
                    "vi": "khoảng cách mà bạn bao gồm khi bạn bước một bước"
                },
                "examples": [
                    {
                        "en": "It's only a few steps further.",
                        "vi": "Nó chỉ còn một vài bước nữa."
                    },
                    {
                        "en": "He turned around and retraced his steps (= went back the way he had come).",
                        "vi": "Anh ta quay lại và lùi bước (= quay lại con đường anh ta đã đến)."
                    },
                    {
                        "en": "She moved a step closer to me.",
                        "vi": "Cô ấy tiến lại gần tôi một bước."
                    },
                    {
                        "en": "(figurative) The hotel is only a short step (= a short distance) from the beach.",
                        "vi": "(nghĩa bóng) Khách sạn chỉ cách bãi biển một bước chân ngắn (= một khoảng cách ngắn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a surface that you put your foot on in order to walk to a higher or lower level, especially one of a series",
                    "vi": "một bề mặt mà bạn đặt chân lên để đi đến một cấp độ cao hơn hoặc thấp hơn, đặc biệt là một trong những"
                },
                "examples": [
                    {
                        "en": "She was sitting on the bottom step of the staircase.",
                        "vi": "Cô ấy đang ngồi ở bậc dưới cùng của cầu thang."
                    },
                    {
                        "en": "We walked down some stone steps to the beach.",
                        "vi": "Chúng tôi đi bộ xuống một số bậc đá để đến bãi biển."
                    },
                    {
                        "en": "A short flight of steps led up to the door.",
                        "vi": "Một quãng đường ngắn dẫn đến cánh cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of movements that you make with your feet and which form a dance",
                    "vi": "một loạt các chuyển động bạn thực hiện bằng chân và tạo thành một điệu nhảy"
                },
                "examples": [
                    {
                        "en": "Do you know the steps of this dance?",
                        "vi": "Bạn có biết các bước của điệu nhảy này?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that somebody walks",
                    "vi": "con đường mà ai đó đi bộ"
                },
                "examples": [
                    {
                        "en": "He walked with a quick light step.",
                        "vi": "Anh bước đi với bước chân nhẹ nhàng nhanh chóng."
                    },
                    {
                        "en": "There was a smile on her face and a spring in her step.",
                        "vi": "Có một nụ cười trên khuôn mặt của cô ấy và một mùa xuân trong bước đi của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of exercise that you do by stepping on and off a raised piece of equipment",
                    "vi": "một loại bài tập mà bạn thực hiện bằng cách bước lên và xuống một thiết bị nâng lên"
                },
                "examples": [
                    {
                        "en": "step aerobics",
                        "vi": "bước thể dục nhịp điệu"
                    },
                    {
                        "en": "a step class",
                        "vi": "một lớp học bước"
                    }
                ]
            },
            {
                "define": {
                    "en": "a stepladder",
                    "vi": "một người phụ nữ"
                },
                "examples": [
                    {
                        "en": "a pair of steps",
                        "vi": "một cặp bước"
                    },
                    {
                        "en": "We need the steps to get into the attic.",
                        "vi": "Chúng ta cần các bước để lên gác mái."
                    }
                ]
            },
            {
                "define": {
                    "en": "the interval between two notes that are next to each other in a scale",
                    "vi": "khoảng thời gian giữa hai nốt nhạc cạnh nhau trong thang âm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change the way you are walking so that you do not walk in the same rhythm as the people you are walking or marching with",
                    "vi": "thay đổi cách bạn đang đi bộ để bạn không đi cùng nhịp với những người bạn đang đi bộ hoặc diễu hành cùng"
                },
                "examples": [
                    {
                        "en": "The soldiers turned without once breaking step.",
                        "vi": "Những người lính quay lại không một lần đứt bước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the way you are walking so that you start walking in the same rhythm as the person you are walking with",
                    "vi": "thay đổi cách bạn đang đi để bạn bắt đầu đi cùng nhịp với người bạn đang đi cùng"
                },
                "examples": [
                    {
                        "en": "He caught her up and fell into step beside her.",
                        "vi": "Anh bắt kịp cô và bước vào bên cạnh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "putting your feet on the ground in the right/wrong way, according to the rhythm of the music or the people you are moving with",
                    "vi": "đặt chân của bạn trên mặt đất đúng / sai, theo nhịp điệu của âm nhạc hoặc những người bạn đang di chuyển cùng"
                },
                "examples": [
                    {
                        "en": "He was out of step with the music.",
                        "vi": "Anh ấy đã lạc nhịp với âm nhạc."
                    },
                    {
                        "en": "She had trouble keeping in step with the others.",
                        "vi": "Cô ấy gặp khó khăn trong việc giữ bước với những người khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "having ideas that are the same as or different from other people’s",
                    "vi": "có ý tưởng giống hoặc khác với ý tưởng của người khác"
                },
                "examples": [
                    {
                        "en": "She was out of step with her colleagues.",
                        "vi": "Cô lạc nhịp với đồng nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to walk carefully",
                    "vi": "đi bộ cẩn thận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a careful and sensible way",
                    "vi": "cư xử một cách cẩn thận và hợp lý"
                },
                "examples": [
                    {
                        "en": "You’d better watch your step with him if you don’t want trouble.",
                        "vi": "Tốt hơn hết bạn nên theo dõi bước đi của mình cùng anh ấy nếu không muốn gặp rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that every time you make progress, something bad happens that means that the situation is worse than before",
                    "vi": "thường nói rằng mỗi khi bạn đạt được tiến bộ, điều gì đó tồi tệ xảy ra có nghĩa là tình hình còn tồi tệ hơn trước."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when you are one step ahead of somebody/something, you manage to avoid them or to achieve something more quickly than they do",
                    "vi": "khi bạn đi trước ai đó / điều gì đó một bước, bạn xoay sở để tránh họ hoặc đạt được điều gì đó nhanh hơn họ làm"
                },
                "examples": [
                    {
                        "en": "She's always one step ahead of the competition.",
                        "vi": "Cô ấy luôn đi trước đối thủ một bước."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you do something one step at a time you do it slowly and gradually",
                    "vi": "khi bạn làm điều gì đó từng bước một, bạn làm điều đó từ từ và dần dần"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "184cfd53fe3b4975b4d302966ee4827d",
        "word": "broom closet",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbruːm klɒzɪt/",
            "us": "/ˈbruːm klɑːzɪt/"
        },
        "nearby": [
            {
                "word": "Brookside",
                "pos": ""
            },
            {
                "word": "broom",
                "pos": "noun"
            },
            {
                "word": "broom closet",
                "pos": "noun"
            },
            {
                "word": "broom cupboard",
                "pos": "noun"
            },
            {
                "word": "broomstick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large built-in closet used for keeping cleaning equipment, etc. in",
                    "vi": "một tủ quần áo lớn tích hợp được sử dụng để giữ thiết bị làm sạch, v.v. trong"
                },
                "examples": [
                    {
                        "en": "There's a broom closet under the stairs.",
                        "vi": "Có một tủ đựng chổi dưới cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very small room",
                    "vi": "một căn phòng rất nhỏ"
                },
                "examples": [
                    {
                        "en": "I couldn't afford more than a broom closet to set up office in.",
                        "vi": "Tôi không thể mua được nhiều hơn một cái tủ đựng chổi để làm văn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "820304c529bc4e1ea2d24d837ed4f6ba",
        "word": "broom cupboard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbruːm kʌbəd/",
            "us": "/ˈbruːm kʌbərd/"
        },
        "nearby": [
            {
                "word": "broom",
                "pos": "noun"
            },
            {
                "word": "broom closet",
                "pos": "noun"
            },
            {
                "word": "broom cupboard",
                "pos": "noun"
            },
            {
                "word": "broomstick",
                "pos": "noun"
            },
            {
                "word": "Bros",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large built-in cupboard used for keeping cleaning equipment, etc. in",
                    "vi": "một tủ lớn tích hợp được sử dụng để giữ thiết bị làm sạch, v.v. trong"
                },
                "examples": [
                    {
                        "en": "There's a broom cupboard under the stairs.",
                        "vi": "Có một cái tủ đựng chổi dưới cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very small room",
                    "vi": "một căn phòng rất nhỏ"
                },
                "examples": [
                    {
                        "en": "I couldn't afford more than a broom cupboard to set up office in.",
                        "vi": "Tôi không thể mua được nhiều hơn một cái tủ đựng chổi để mở văn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "79ec94d585c64b319766746a92a9dadd",
        "word": "chimney",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃɪmni/",
            "us": "/ˈtʃɪmni/"
        },
        "nearby": [
            {
                "word": "chimera",
                "pos": "noun"
            },
            {
                "word": "chime with",
                "pos": "phrasal verb"
            },
            {
                "word": "chimney",
                "pos": "noun"
            },
            {
                "word": "chimney breast",
                "pos": "noun"
            },
            {
                "word": "chimney piece",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a structure through which smoke or steam is carried up away from a fire, etc. and through the roof of a building; the part of this that is above the roof",
                    "vi": "một cấu trúc mà qua đó khói hoặc hơi nước được bốc lên từ đám cháy, v.v. và xuyên qua mái của một tòa nhà; phần của cái này ở trên mái nhà"
                },
                "examples": [
                    {
                        "en": "He threw a bit of paper onto the fire and it flew up the chimney.",
                        "vi": "Anh ta ném một chút giấy lên ngọn lửa và nó bay lên theo ống khói."
                    },
                    {
                        "en": "the factory chimneys of an industrial landscape",
                        "vi": "ống khói nhà máy của một cảnh quan công nghiệp"
                    },
                    {
                        "en": "This chimney doesn’t draw very well.",
                        "vi": "Cái ống khói này vẽ không đẹp lắm."
                    },
                    {
                        "en": "factory chimneys belching smoke over the town",
                        "vi": "ống khói nhà máy ợ khói bao trùm thị trấn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a narrow opening in an area of rock that a person can climb up",
                    "vi": "một khe hở hẹp trong một khu vực đá mà một người có thể trèo lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e0f797e74db047d4b8913760d18a2352",
        "word": "extension",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪkˈstenʃn/",
            "us": "/ɪkˈstenʃn/"
        },
        "nearby": [
            {
                "word": "extended",
                "pos": "adjective"
            },
            {
                "word": "extended family",
                "pos": "noun"
            },
            {
                "word": "extension",
                "pos": "noun"
            },
            {
                "word": "extension agent",
                "pos": "noun"
            },
            {
                "word": "extension lead",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of increasing the area of activity, group of people, etc. that is affected by something",
                    "vi": "hành động tăng khu vực hoạt động, nhóm người, v.v. bị ảnh hưởng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "the extension of new technology into developing countries",
                        "vi": "sự mở rộng của công nghệ mới vào các nước đang phát triển"
                    },
                    {
                        "en": "a gradual extension of the powers of central government",
                        "vi": "mở rộng dần quyền lực của chính quyền trung ương"
                    },
                    {
                        "en": "The bank plans various extensions to its credit facilities.",
                        "vi": "Ngân hàng có kế hoạch mở rộng khác nhau cho các cơ sở tín dụng của mình."
                    },
                    {
                        "en": "My home life was becoming no more than an extension of my job.",
                        "vi": "Cuộc sống ở nhà của tôi không chỉ là một phần mở rộng của công việc của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a new room or rooms that are added to a house",
                    "vi": "một căn phòng mới hoặc những căn phòng được thêm vào một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "They're building an extension to their house.",
                        "vi": "Họ đang xây dựng một phần mở rộng cho ngôi nhà của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a new part that is added to a building",
                    "vi": "một phần mới được thêm vào một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a planned two-storey extension to the hospital",
                        "vi": "dự kiến mở rộng hai tầng cho bệnh viện"
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra period of time allowed for something",
                    "vi": "thêm một khoảng thời gian được phép cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He's been granted an extension of the contract for another year.",
                        "vi": "Anh ấy đã được gia hạn hợp đồng thêm một năm."
                    },
                    {
                        "en": "a visa extension",
                        "vi": "gia hạn thị thực"
                    },
                    {
                        "en": "She was given an extension to finish writing her thesis.",
                        "vi": "Cô ấy đã được gia hạn để hoàn thành việc viết luận án của mình."
                    },
                    {
                        "en": "(British English) The pub had an extension (= was allowed to stay open longer) on Christmas Eve.",
                        "vi": "(Tiếng Anh Anh) Quán rượu đã được mở rộng (= được phép mở cửa lâu hơn) vào đêm Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra phone line connected to a central phone in a house or to a switchboard in a large building. In a large building, each extension usually has its own number.",
                    "vi": "một đường dây điện thoại phụ kết nối với điện thoại trung tâm trong nhà hoặc với tổng đài trong một tòa nhà lớn. Trong một tòa nhà lớn, mỗi phần mở rộng thường có số hiệu riêng."
                },
                "examples": [
                    {
                        "en": "We have an extension in the bedroom.",
                        "vi": "Chúng tôi có một phần mở rộng trong phòng ngủ."
                    },
                    {
                        "en": "What's your extension number?",
                        "vi": "Số máy nhánh của bạn là gì?"
                    },
                    {
                        "en": "Can I have extension 4332 please?",
                        "vi": "Cho tôi xin số máy lẻ 4332 được không?"
                    },
                    {
                        "en": "I'll give you my extension number, so you can phone me directly.",
                        "vi": "Tôi sẽ cung cấp cho bạn số máy nhánh của tôi, vì vậy bạn có thể gọi điện trực tiếp cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making something longer or larger; the thing that is made longer and larger",
                    "vi": "hành động làm một cái gì đó dài hơn hoặc lớn hơn; thứ được làm dài hơn và lớn hơn"
                },
                "examples": [
                    {
                        "en": "The extension of the subway will take several months.",
                        "vi": "Việc gia hạn tàu điện ngầm sẽ mất vài tháng."
                    },
                    {
                        "en": "extensions to the original railway track",
                        "vi": "phần mở rộng cho đường ray ban đầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "pieces of artificial hair that are added to somebody's own hair to make it longer",
                    "vi": "những phần tóc nhân tạo được thêm vào tóc của ai đó để làm cho nó dài hơn"
                },
                "examples": [
                    {
                        "en": "These extensions are very easy to use and won't damage your own hair.",
                        "vi": "Những phần mở rộng này rất dễ sử dụng và sẽ không làm hỏng tóc của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a college or university that offers courses to students who are not studying full-time; a programme of study for these students",
                    "vi": "một phần của trường cao đẳng hoặc đại học cung cấp các khóa học cho sinh viên không học toàn thời gian; một chương trình học cho những sinh viên này"
                },
                "examples": [
                    {
                        "en": "La Salle Extension University",
                        "vi": "Đại học Mở rộng La Salle"
                    },
                    {
                        "en": "extension courses",
                        "vi": "các khóa học mở rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of three letters that are placed after the dot (= small round mark) at the end of the name of a file and that show what type of file it is",
                    "vi": "bộ ba chữ cái được đặt sau dấu chấm (= dấu tròn nhỏ) ở cuối tên tệp và cho biết loại tệp đó là"
                },
                "examples": [
                    {
                        "en": "The extension .doc indicates a word-processing file.",
                        "vi": "Phần mở rộng .doc chỉ ra một tệp xử lý văn bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra length of electric wire, used when the wire on an electrical device is not long enough",
                    "vi": "thêm chiều dài của dây điện, được sử dụng khi dây trên thiết bị điện không đủ dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "taking the argument or situation one stage further",
                    "vi": "đưa lập luận hoặc tình huống lên một giai đoạn nữa"
                },
                "examples": [
                    {
                        "en": "The blame lies with the teachers and, by extension, with the Education Service.",
                        "vi": "Trách nhiệm thuộc về các giáo viên và nói chung là với Sở Giáo dục."
                    }
                ]
            }
        ]
    },
    {
        "id": "e2d12f0ae45a449f8c39f33212023e0f",
        "word": "exterior",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪkˈstɪəriə(r)/",
            "us": "/ɪkˈstɪriər/"
        },
        "nearby": [
            {
                "word": "extent",
                "pos": "noun"
            },
            {
                "word": "extenuating",
                "pos": "adjective"
            },
            {
                "word": "exterior",
                "pos": "noun"
            },
            {
                "word": "exterior",
                "pos": "adjective"
            },
            {
                "word": "exterior angle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outside of something, especially a building",
                    "vi": "bên ngoài của một cái gì đó, đặc biệt là một tòa nhà"
                },
                "examples": [
                    {
                        "en": "The exterior of the house needs painting.",
                        "vi": "Mặt ngoài của ngôi nhà cần sơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that somebody appears or behaves, especially when this is very different from their real feelings or character",
                    "vi": "cách mà ai đó xuất hiện hoặc cư xử, đặc biệt là khi điều này rất khác với cảm xúc hoặc tính cách thực của họ"
                },
                "examples": [
                    {
                        "en": "Beneath his confident exterior, he was desperately nervous.",
                        "vi": "Bên dưới vẻ ngoài tự tin, anh ấy đang lo lắng tột độ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd67623a4eee435bad114c882aef8a7e",
        "word": "fire escape",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfaɪər ɪskeɪp/",
            "us": "/ˈfaɪər ɪskeɪp/"
        },
        "nearby": [
            {
                "word": "fire-eater",
                "pos": "noun"
            },
            {
                "word": "fire engine",
                "pos": "noun"
            },
            {
                "word": "fire escape",
                "pos": "noun"
            },
            {
                "word": "fire extinguisher",
                "pos": "noun"
            },
            {
                "word": "firefight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "metal stairs or a ladder on the outside of a building that people can use to escape from a fire",
                    "vi": "cầu thang kim loại hoặc thang bên ngoài tòa nhà mà mọi người có thể sử dụng để thoát khỏi đám cháy"
                },
                "examples": [
                    {
                        "en": "The thief got away down the fire escape.",
                        "vi": "Tên trộm đã xuống xe thoát hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "890ff5c0dabd41329342d95e3d5934e5",
        "word": "interior",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈtɪəriə(r)/",
            "us": "/ɪnˈtɪriər/"
        },
        "nearby": [
            {
                "word": "interim",
                "pos": "adjective"
            },
            {
                "word": "interim",
                "pos": "noun"
            },
            {
                "word": "interior",
                "pos": "noun"
            },
            {
                "word": "interior",
                "pos": "adjective"
            },
            {
                "word": "interior angle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the inside part of something",
                    "vi": "phần bên trong của cái gì đó"
                },
                "examples": [
                    {
                        "en": "the interior of a building/a car",
                        "vi": "nội thất của một tòa nhà / một chiếc xe hơi"
                    },
                    {
                        "en": "The original interior of the hotel has been replaced.",
                        "vi": "Nội thất ban đầu của khách sạn đã được thay thế."
                    }
                ]
            },
            {
                "define": {
                    "en": "the central part of a country or continent that is a long way from the coast",
                    "vi": "phần trung tâm của một quốc gia hoặc lục địa cách xa bờ biển"
                },
                "examples": [
                    {
                        "en": "an expedition into the interior of Australia",
                        "vi": "một cuộc thám hiểm vào nội địa của Úc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a country’s own affairs rather than those that involve other countries",
                    "vi": "công việc riêng của một quốc gia hơn là những công việc liên quan đến các quốc gia khác"
                },
                "examples": [
                    {
                        "en": "the Department/Minister of the Interior",
                        "vi": "Vụ / Bộ trưởng Bộ Nội vụ"
                    }
                ]
            }
        ]
    },
    {
        "id": "003d498cb9e642a79997fa05cca3edfc",
        "word": "porch",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pɔːtʃ/",
            "us": "/pɔːrtʃ/"
        },
        "nearby": [
            {
                "word": "pop-up",
                "pos": "adjective"
            },
            {
                "word": "porcelain",
                "pos": "noun"
            },
            {
                "word": "porch",
                "pos": "noun"
            },
            {
                "word": "porcine",
                "pos": "adjective"
            },
            {
                "word": "porcini",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small area at the entrance to a building, such as a house or a church, that is covered by a roof and often has walls",
                    "vi": "một khu vực nhỏ ở lối vào một tòa nhà, chẳng hạn như một ngôi nhà hoặc một nhà thờ, có mái che và thường có tường"
                },
                "examples": [
                    {
                        "en": "She stood in the porch and rang the doorbell.",
                        "vi": "Cô đứng trong hiên nhà và bấm chuông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a platform with an open front and a roof, built onto the side of a house on the ground floor",
                    "vi": "một nền tảng với một mặt trước mở và một mái nhà, được xây dựng ở phía bên của một ngôi nhà ở tầng trệt"
                },
                "examples": [
                    {
                        "en": "They were sitting out on the porch in the cool evening air.",
                        "vi": "Họ đang ngồi ngoài hiên trong không khí mát mẻ buổi tối."
                    },
                    {
                        "en": "After dinner we sat on the front porch and talked for hours.",
                        "vi": "Sau bữa tối, chúng tôi ngồi trên hiên trước và nói chuyện hàng giờ."
                    },
                    {
                        "en": "The screened porch looks across the backyard into the woods.",
                        "vi": "Hàng hiên có màn che nhìn qua sân sau vào rừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "7dc9d978832b4289ad70c73705878db5",
        "word": "shutter",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃʌtə(r)/",
            "us": "/ˈʃʌtər/"
        },
        "nearby": [
            {
                "word": "shut out",
                "pos": "phrasal verb"
            },
            {
                "word": "shutout",
                "pos": "noun"
            },
            {
                "word": "shutter",
                "pos": "noun"
            },
            {
                "word": "shutterbug",
                "pos": "noun"
            },
            {
                "word": "shuttered",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a pair of wooden or metal covers that can be closed over the outside of a window to keep out light or protect the windows from damage",
                    "vi": "một trong hai tấm bìa bằng gỗ hoặc kim loại có thể đóng lại bên ngoài cửa sổ để tránh ánh sáng hoặc bảo vệ cửa sổ khỏi bị hư hại"
                },
                "examples": [
                    {
                        "en": "to open/close the shutters",
                        "vi": "để mở / đóng cửa chớp"
                    },
                    {
                        "en": "They explored, throwing open the shutters in each of the big rooms.",
                        "vi": "Họ khám phá, mở cửa chớp trong từng phòng lớn."
                    },
                    {
                        "en": "(British English, figurative) More than 70 000 shopkeepers have been forced to put up the shutters (= close down their businesses) in the past year.",
                        "vi": "(Tiếng Anh Anh, nghĩa bóng) Hơn 70 000 chủ cửa hàng đã bị buộc phải đóng cửa (= đóng cửa các cơ sở kinh doanh của họ) trong năm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a camera that opens to allow light to pass through the lens when you take a photograph",
                    "vi": "phần của máy ảnh mở ra để cho phép ánh sáng đi qua ống kính khi bạn chụp ảnh"
                },
                "examples": [
                    {
                        "en": "the quiet click of the shutter",
                        "vi": "tiếng nhấp yên lặng của màn trập"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop letting somebody know what your thoughts or feelings are; to stop letting yourself think about something",
                    "vi": "ngừng cho ai đó biết suy nghĩ hoặc cảm xúc của bạn là gì; ngừng để bản thân suy nghĩ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He brought down the shutters on the image of the dying girl.",
                        "vi": "Anh ta hạ cánh cửa chớp xuống hình ảnh cô gái đang hấp hối."
                    },
                    {
                        "en": "I could feel the shutters coming down in her mind.",
                        "vi": "Tôi có thể cảm thấy cửa chớp tắt dần trong tâm trí cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cd614b10ea54c8086e6a977ed045850",
        "word": "staircase",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsteəkeɪs/",
            "us": "/ˈsterkeɪs/"
        },
        "nearby": [
            {
                "word": "stair",
                "pos": "adjective"
            },
            {
                "word": "stair",
                "pos": "noun"
            },
            {
                "word": "staircase",
                "pos": "noun"
            },
            {
                "word": "stairlift",
                "pos": "noun"
            },
            {
                "word": "stairway",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of stairs inside a building including the banisters (= posts and bars that are fixed at the side)",
                    "vi": "một bộ cầu thang bên trong tòa nhà bao gồm cả lan can (= trụ và thanh được cố định ở bên cạnh)"
                },
                "examples": [
                    {
                        "en": "a marble/stone/wooden staircase",
                        "vi": "cầu thang bằng đá cẩm thạch / đá / gỗ"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e800886f2724086bc7e6bb60e63917e",
        "word": "storey",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈstɔːri/",
            "us": "/ˈstɔːri/"
        },
        "nearby": [
            {
                "word": "store up",
                "pos": "phrasal verb"
            },
            {
                "word": "store window",
                "pos": "noun"
            },
            {
                "word": "storey",
                "pos": "noun"
            },
            {
                "word": "storied",
                "pos": "adjective"
            },
            {
                "word": "stork",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a level of a building; a floor",
                    "vi": "cấp của một tòa nhà; một tầng"
                },
                "examples": [
                    {
                        "en": "the upper/lower storey of the house",
                        "vi": "tầng trên / tầng dưới của ngôi nhà"
                    },
                    {
                        "en": "a single-storey/two-storey building",
                        "vi": "một tòa nhà một tầng / hai tầng"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the number of levels mentioned",
                    "vi": "có số lượng các cấp độ được đề cập"
                },
                "examples": [
                    {
                        "en": "a four-storeyed building",
                        "vi": "một tòa nhà bốn tầng"
                    }
                ]
            }
        ]
    },
    {
        "id": "6e4bf33dec6f467ba0980de9f023e302",
        "word": "threshold",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈθreʃhəʊld/",
            "us": "/ˈθreʃhəʊld/"
        },
        "nearby": [
            {
                "word": "thresh",
                "pos": "verb"
            },
            {
                "word": "threshing",
                "pos": "noun"
            },
            {
                "word": "threshold",
                "pos": "noun"
            },
            {
                "word": "threw",
                "pos": ""
            },
            {
                "word": "thrice",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the floor or ground at the bottom of a doorway, considered as the entrance to a building or room",
                    "vi": "sàn hoặc mặt đất ở cuối ô cửa, được coi là lối vào một tòa nhà hoặc căn phòng"
                },
                "examples": [
                    {
                        "en": "He stepped across the threshold.",
                        "vi": "Anh bước qua ngưỡng cửa."
                    },
                    {
                        "en": "on the threshold She stood hesitating on the threshold.",
                        "vi": "ở ngưỡng cửa Cô ấy đứng lưỡng lự trước ngưỡng cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the level at which something starts to happen or have an effect",
                    "vi": "mức độ mà tại đó điều gì đó bắt đầu xảy ra hoặc có ảnh hưởng"
                },
                "examples": [
                    {
                        "en": "He has a low boredom threshold (= he gets bored easily).",
                        "vi": "Anh ấy có ngưỡng buồn chán thấp (= anh ấy dễ chán)."
                    },
                    {
                        "en": "I have a high pain threshold (= I can suffer a lot of pain before I start to react).",
                        "vi": "Tôi có ngưỡng chịu đau cao (= Tôi có thể bị đau rất nhiều trước khi bắt đầu phản ứng)."
                    },
                    {
                        "en": "My earnings are just above the tax threshold (= more than the amount at which you start paying tax).",
                        "vi": "Thu nhập của tôi chỉ cao hơn ngưỡng thuế (= nhiều hơn số tiền bạn bắt đầu trả thuế)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the point just before a new situation, period of life, etc. begins",
                    "vi": "điểm ngay trước khi một tình huống mới, giai đoạn cuộc sống, v.v. bắt đầu"
                },
                "examples": [
                    {
                        "en": "on the threshold of something She felt as though she was on the threshold of a new life.",
                        "vi": "trước ngưỡng cửa của điều gì đó Cô ấy cảm thấy như thể cô ấy đang ở ngưỡng cửa của một cuộc sống mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a08ffe04dab4a8e8aec6869c13d00a4",
        "word": "tile",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/taɪl/",
            "us": "/taɪl/"
        },
        "nearby": [
            {
                "word": "tilde",
                "pos": "noun"
            },
            {
                "word": "Bill Tilden",
                "pos": ""
            },
            {
                "word": "tile",
                "pos": "noun"
            },
            {
                "word": "tile",
                "pos": "verb"
            },
            {
                "word": "tiler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat, usually square, piece of baked clay, carpet or other material that is used in rows for covering walls and floors",
                    "vi": "phẳng, thường là hình vuông, mảnh đất sét nung, thảm hoặc vật liệu khác được sử dụng thành hàng để phủ tường và sàn nhà"
                },
                "examples": [
                    {
                        "en": "ceramic floor tiles",
                        "vi": "sàn gạch men"
                    },
                    {
                        "en": "carpet tiles",
                        "vi": "gạch thảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of baked clay that is used in rows for covering roofs",
                    "vi": "một mảnh đất sét nung được sử dụng thành hàng để lợp mái nhà"
                },
                "examples": [
                    {
                        "en": "We lost a few tiles in the storm.",
                        "vi": "Chúng tôi đã mất một vài viên gạch trong cơn bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the small flat pieces that are used in particular board games",
                    "vi": "bất kỳ miếng phẳng nhỏ nào được sử dụng trong các trò chơi trên bàn cờ cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stay out late enjoying yourself",
                    "vi": "ở ngoài khuya tận hưởng bản thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d846bb66a6934cbb8b72bb2e9ac57a11",
        "word": "windowsill",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɪndəʊsɪl/",
            "us": "/ˈwɪndəʊsɪl/"
        },
        "nearby": [
            {
                "word": "window shade",
                "pos": "noun"
            },
            {
                "word": "window shopping",
                "pos": "noun"
            },
            {
                "word": "windowsill",
                "pos": "noun"
            },
            {
                "word": "window tax",
                "pos": "noun"
            },
            {
                "word": "window washer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow shelf below a window, either inside or outside",
                    "vi": "một kệ hẹp bên dưới cửa sổ, bên trong hoặc bên ngoài"
                },
                "examples": [
                    {
                        "en": "Place the plants on a sunny windowsill.",
                        "vi": "Đặt cây trên bệ cửa sổ đầy nắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "773d5b87b502405781c37bb45fd994b1",
        "word": "alcove",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈælkəʊv/",
            "us": "/ˈælkəʊv/"
        },
        "nearby": [
            {
                "word": "alcopop",
                "pos": "noun"
            },
            {
                "word": "Louisa May Alcott",
                "pos": ""
            },
            {
                "word": "alcove",
                "pos": "noun"
            },
            {
                "word": "the Aldeburgh Festival",
                "pos": ""
            },
            {
                "word": "al dente",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in a room that is formed by part of a wall being built further back than the rest of the wall",
                    "vi": "một khu vực trong phòng được hình thành bởi một phần của bức tường được xây lùi xa hơn phần còn lại của bức tường"
                },
                "examples": [
                    {
                        "en": "The bookcase fits neatly into the alcove.",
                        "vi": "Tủ sách nằm gọn trong hốc tường."
                    }
                ]
            }
        ]
    },
    {
        "id": "d5e3f18330b3449e8bcd78ea6f75e8b0",
        "word": "annexe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæneks/",
            "us": "/ˈæneks/"
        },
        "nearby": [
            {
                "word": "annex",
                "pos": "verb"
            },
            {
                "word": "annexation",
                "pos": "noun"
            },
            {
                "word": "annexe",
                "pos": "noun"
            },
            {
                "word": "Annie Get Your Gun",
                "pos": ""
            },
            {
                "word": "Annie Hall",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building that is added to, or is near, a larger one and that provides extra living or work space",
                    "vi": "một tòa nhà được thêm vào hoặc ở gần, một tòa nhà lớn hơn và cung cấp thêm không gian sống hoặc làm việc"
                },
                "examples": [
                    {
                        "en": "Our rooms were in the annexe.",
                        "vi": "Phòng của chúng tôi nằm trong khu nhà phụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra section of a document",
                    "vi": "một phần bổ sung của tài liệu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f7273602f4c4dda9fac5b16e09074fb",
        "word": "bay window",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbeɪ ˈwɪndəʊ/",
            "us": "/ˌbeɪ ˈwɪndəʊ/"
        },
        "nearby": [
            {
                "word": "bay tree",
                "pos": "noun"
            },
            {
                "word": "Baywatch",
                "pos": ""
            },
            {
                "word": "bay window",
                "pos": "noun"
            },
            {
                "word": "bazaar",
                "pos": "noun"
            },
            {
                "word": "bazooka",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large window, usually with glass on three sides, that sticks out from the outside wall of a house",
                    "vi": "một cửa sổ lớn, thường có kính ở ba mặt, nhô ra khỏi bức tường bên ngoài của một ngôi nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2edd5e9901b4422aaa2b4a3766373e6b",
        "word": "breezeway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbriːzweɪ/",
            "us": "/ˈbriːzweɪ/"
        },
        "nearby": [
            {
                "word": "breeze block",
                "pos": "noun"
            },
            {
                "word": "breeze through",
                "pos": "phrasal verb"
            },
            {
                "word": "breezeway",
                "pos": "noun"
            },
            {
                "word": "breezily",
                "pos": "adverb"
            },
            {
                "word": "breeziness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an outside passage with a roof and open sides between two separate parts of a building",
                    "vi": "lối đi bên ngoài có mái che và các mặt thoáng giữa hai phần riêng biệt của tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d1cf35bb410546e998618e2ec4c872aa",
        "word": "canopy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænəpi/",
            "us": "/ˈkænəpi/"
        },
        "nearby": [
            {
                "word": "canoodle",
                "pos": "verb"
            },
            {
                "word": "can opener",
                "pos": "noun"
            },
            {
                "word": "canopy",
                "pos": "noun"
            },
            {
                "word": "canst",
                "pos": "verb"
            },
            {
                "word": "cant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cover that is fixed or hangs above a bed, seat, etc. as a shelter or decoration",
                    "vi": "một tấm phủ được cố định hoặc treo phía trên giường, chỗ ngồi, v.v. làm nơi trú ẩn hoặc trang trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a layer of something that spreads over an area like a roof, especially branches of trees in a forest",
                    "vi": "một lớp thứ gì đó trải rộng trên một khu vực như mái nhà, đặc biệt là các cành cây trong rừng"
                },
                "examples": [
                    {
                        "en": "The canopy of a rainforest is about 10 metres thick.",
                        "vi": "Tán của một khu rừng nhiệt đới dày khoảng 10 mét."
                    },
                    {
                        "en": "a canopy of leaves",
                        "vi": "một tán lá"
                    },
                    {
                        "en": "a glorious canopy of stars",
                        "vi": "một tán sao huy hoàng"
                    },
                    {
                        "en": "We could see the sky through gaps in the forest canopy.",
                        "vi": "Chúng tôi có thể nhìn thấy bầu trời qua những khoảng trống trong tán rừng."
                    },
                    {
                        "en": "The trees formed a leafy canopy above their heads.",
                        "vi": "Cây cối tạo thành một tán lá trên đầu."
                    },
                    {
                        "en": "a thick canopy of branches",
                        "vi": "một tán cây dày"
                    }
                ]
            },
            {
                "define": {
                    "en": "a roof that is supported on posts and is sometimes also attached at one side to a building",
                    "vi": "một mái nhà được hỗ trợ trên các cột và đôi khi cũng được gắn ở một bên của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a new steel entrance canopy for the building",
                        "vi": "một mái che lối vào bằng thép mới cho tòa nhà"
                    },
                    {
                        "en": "a fabric canopy to provide shade in the backyard",
                        "vi": "một tán vải để cung cấp bóng râm ở sân sau"
                    }
                ]
            },
            {
                "define": {
                    "en": "a cover for the cockpit of an aircraft",
                    "vi": "nắp buồng lái máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b95a3f4c2f064039a08f7bbddd177661",
        "word": "chimney stack",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃɪmni stæk/",
            "us": "/ˈtʃɪmni stæk/"
        },
        "nearby": [
            {
                "word": "chimney piece",
                "pos": "noun"
            },
            {
                "word": "chimney pot",
                "pos": "noun"
            },
            {
                "word": "chimney stack",
                "pos": "noun"
            },
            {
                "word": "chimney sweep",
                "pos": "noun"
            },
            {
                "word": "chimpanzee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the chimney that is above the roof of a building",
                    "vi": "một phần của ống khói phía trên mái của một tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very tall chimney, especially one in a factory",
                    "vi": "một ống khói rất cao, đặc biệt là một trong một nhà máy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "12f2674191ea4166a6516955ab64bf6d",
        "word": "doorknob",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɔːnɒb/",
            "us": "/ˈdɔːrnɑːb/"
        },
        "nearby": [
            {
                "word": "door furniture",
                "pos": "noun"
            },
            {
                "word": "doorkeeper",
                "pos": "noun"
            },
            {
                "word": "doorknob",
                "pos": "noun"
            },
            {
                "word": "door knocker",
                "pos": "noun"
            },
            {
                "word": "doorman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of round handle for a door that you turn in order to open the door",
                    "vi": "một loại tay nắm tròn cho cánh cửa mà bạn xoay để mở cửa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d9ea605e964c43ee92a4a7a6e4798239",
        "word": "door knocker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɔː nɒkə(r)/",
            "us": "/ˈdɔːr nɑːkər/"
        },
        "nearby": [
            {
                "word": "doorkeeper",
                "pos": "noun"
            },
            {
                "word": "doorknob",
                "pos": "noun"
            },
            {
                "word": "door knocker",
                "pos": "noun"
            },
            {
                "word": "doorman",
                "pos": "noun"
            },
            {
                "word": "doormat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal object attached to the outside of the door of a house, etc. that you hit against the door to attract attention",
                    "vi": "một vật kim loại gắn bên ngoài cửa nhà, v.v. mà bạn đập vào cửa để thu hút sự chú ý"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c32326f055ee4f7882f54d46cf8601cb",
        "word": "downspout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaʊnspaʊt/",
            "us": "/ˈdaʊnspaʊt/"
        },
        "nearby": [
            {
                "word": "downsize",
                "pos": "verb"
            },
            {
                "word": "downsizing",
                "pos": "noun"
            },
            {
                "word": "downspout",
                "pos": "noun"
            },
            {
                "word": "Down's syndrome",
                "pos": "noun"
            },
            {
                "word": "downstage",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe that carries rainwater from the roof of a building to a drain",
                    "vi": "ống dẫn nước mưa từ mái của một tòa nhà đến cống thoát nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "02fd0ba9bf304b8680fdd56edb7b8f51",
        "word": "drainpipe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdreɪnpaɪp/",
            "us": "/ˈdreɪnpaɪp/"
        },
        "nearby": [
            {
                "word": "drained",
                "pos": "adjective"
            },
            {
                "word": "draining board",
                "pos": "noun"
            },
            {
                "word": "drainpipe",
                "pos": "noun"
            },
            {
                "word": "drake",
                "pos": "noun"
            },
            {
                "word": "Francis Drake",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe that carries rainwater from the roof of a building to a drain",
                    "vi": "ống dẫn nước mưa từ mái của một tòa nhà đến cống thoát nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a pipe that carries dirty water or other liquid waste away from a building",
                    "vi": "đường ống dẫn nước bẩn hoặc chất thải lỏng khác ra khỏi tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ee7b82f75523478e82ae8a53d5005716",
        "word": "facade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fəˈsɑːd/",
            "us": "/fəˈsɑːd/"
        },
        "nearby": [
            {
                "word": "fabulous",
                "pos": "adjective"
            },
            {
                "word": "fabulously",
                "pos": "adverb"
            },
            {
                "word": "facade",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front of a building",
                    "vi": "mặt trước của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a classical facade",
                        "vi": "một mặt tiền cổ điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that somebody/something appears to be, which is different from the way somebody/something really is",
                    "vi": "cách mà ai đó / cái gì đó xuất hiện, khác với cách ai đó / cái gì đó thực sự là"
                },
                "examples": [
                    {
                        "en": "She managed to maintain a facade of indifference.",
                        "vi": "Cô cố gắng duy trì vẻ ngoài thờ ơ."
                    },
                    {
                        "en": "They seem happy together, but it’s all a facade.",
                        "vi": "Họ có vẻ hạnh phúc bên nhau, nhưng tất cả chỉ là mặt tiền."
                    },
                    {
                        "en": "Squalor and poverty lay behind the city's glittering facade.",
                        "vi": "Sự tù túng và nghèo đói nằm sau mặt tiền lấp lánh của thành phố."
                    }
                ]
            }
        ]
    },
    {
        "id": "e0b78a62b5ad4511a8774ddc4a274d09",
        "word": "foyer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔɪeɪ/",
            "us": "/ˈfɔɪər/"
        },
        "nearby": [
            {
                "word": "foxtrot",
                "pos": "noun"
            },
            {
                "word": "foxy",
                "pos": "adjective"
            },
            {
                "word": "foyer",
                "pos": "noun"
            },
            {
                "word": "Foyle's",
                "pos": ""
            },
            {
                "word": "FPA",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large open space inside the entrance of a theatre or hotel where people can meet or wait",
                    "vi": "một không gian mở rộng lớn bên trong lối vào của một nhà hát hoặc khách sạn, nơi mọi người có thể gặp gỡ hoặc chờ đợi"
                },
                "examples": [
                    {
                        "en": "I’ll meet you in the foyer at 7 o’clock.",
                        "vi": "Tôi sẽ gặp bạn ở tiền sảnh lúc 7 giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an entrance hall in a private house or flat",
                    "vi": "lối vào nhà riêng hoặc căn hộ"
                },
                "examples": [
                    {
                        "en": "An elegant foyer leads directly to the living room.",
                        "vi": "Một tiền sảnh trang nhã dẫn thẳng đến phòng khách."
                    }
                ]
            }
        ]
    },
    {
        "id": "c9ac51e5de6b4660b5f013d88caf3d74",
        "word": "frontage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfrʌntɪdʒ/",
            "us": "/ˈfrʌntɪdʒ/"
        },
        "nearby": [
            {
                "word": "front",
                "pos": "adjective"
            },
            {
                "word": "front",
                "pos": "verb"
            },
            {
                "word": "frontage",
                "pos": "noun"
            },
            {
                "word": "frontage road",
                "pos": "noun"
            },
            {
                "word": "frontal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front of a building, especially when this faces a road or river",
                    "vi": "mặt trước của một tòa nhà, đặc biệt khi tòa nhà này đối diện với đường hoặc sông"
                },
                "examples": [
                    {
                        "en": "the baroque frontage of Milan Cathedral",
                        "vi": "mặt tiền baroque của Nhà thờ Milan"
                    },
                    {
                        "en": "The building’s street frontages are mostly of glass.",
                        "vi": "Mặt tiền của tòa nhà chủ yếu bằng kính."
                    }
                ]
            },
            {
                "define": {
                    "en": "land that is next to a building, a street or an area of water",
                    "vi": "đất bên cạnh một tòa nhà, một đường phố hoặc một khu vực có nước"
                },
                "examples": [
                    {
                        "en": "They bought two miles of river frontage along the Colorado.",
                        "vi": "Họ mua hai dặm mặt tiền sông dọc theo Colorado."
                    }
                ]
            }
        ]
    },
    {
        "id": "21f99e94ae444436ac92210aa6479880",
        "word": "gable",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡeɪbl/",
            "us": "/ˈɡeɪbl/"
        },
        "nearby": [
            {
                "word": "gabfest",
                "pos": "noun"
            },
            {
                "word": "gabion",
                "pos": "noun"
            },
            {
                "word": "gable",
                "pos": "noun"
            },
            {
                "word": "Clark Gable",
                "pos": ""
            },
            {
                "word": "gabled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the upper part of the end wall of a building, between the two sloping sides of the roof, that is like a triangle in shape",
                    "vi": "Phần trên của bức tường cuối của một tòa nhà, giữa hai mặt dốc của mái, giống như một hình tam giác."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bf4da360864749d2b0569ff66bd2a15f",
        "word": "guttering",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌtərɪŋ/",
            "us": "/ˈɡʌtərɪŋ/"
        },
        "nearby": [
            {
                "word": "gutter",
                "pos": "noun"
            },
            {
                "word": "gutter",
                "pos": "verb"
            },
            {
                "word": "guttering",
                "pos": "noun"
            },
            {
                "word": "the gutter press",
                "pos": "noun"
            },
            {
                "word": "guttersnipe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of gutters on a building; the material used to make gutters",
                    "vi": "hệ thống máng xối trên tòa nhà; vật liệu được sử dụng để làm máng xối"
                },
                "examples": [
                    {
                        "en": "a length of guttering",
                        "vi": "chiều dài của rãnh nước"
                    }
                ]
            }
        ]
    },
    {
        "id": "eebaf979d3a44d37ab604a0e4bfd2b21",
        "word": "knocker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnɒkə(r)/",
            "us": "/ˈnɑːkər/"
        },
        "nearby": [
            {
                "word": "knock-down",
                "pos": "adjective"
            },
            {
                "word": "knock-down-drag-out",
                "pos": "adjective"
            },
            {
                "word": "knocker",
                "pos": "noun"
            },
            {
                "word": "knocking copy",
                "pos": "noun"
            },
            {
                "word": "knocking shop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal object attached to the outside of the door of a house, etc. that you hit against the door to attract attention",
                    "vi": "một vật kim loại gắn bên ngoài cửa nhà, v.v. mà bạn đập vào cửa để thu hút sự chú ý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is always criticizing somebody/something",
                    "vi": "một người luôn chỉ trích ai đó / điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an offensive word for a woman’s breasts",
                    "vi": "một từ xúc phạm cho bộ ngực của phụ nữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "45809921161d47cbaaf806e2aa6e26de",
        "word": "mantelpiece",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmæntlpiːs/",
            "us": "/ˈmæntlpiːs/"
        },
        "nearby": [
            {
                "word": "manspreading",
                "pos": "noun"
            },
            {
                "word": "manta",
                "pos": "noun"
            },
            {
                "word": "mantelpiece",
                "pos": "noun"
            },
            {
                "word": "mantis",
                "pos": "noun"
            },
            {
                "word": "mantle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shelf above a fireplace",
                    "vi": "một cái kệ phía trên lò sưởi"
                },
                "examples": [
                    {
                        "en": "There was a clock on the mantelpiece.",
                        "vi": "Có một chiếc đồng hồ trên lò sưởi."
                    }
                ]
            }
        ]
    },
    {
        "id": "0eb653b6239e46cd9bfad6eb8e0fbe81",
        "word": "mezzanine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmezəniːn/",
            "us": "/ˈmezəniːn/"
        },
        "nearby": [
            {
                "word": "meze",
                "pos": "noun"
            },
            {
                "word": "mezuzah",
                "pos": "noun"
            },
            {
                "word": "mezzanine",
                "pos": "noun"
            },
            {
                "word": "mezzo-soprano",
                "pos": "noun"
            },
            {
                "word": "mezzotint",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a floor that is built between two floors of a building and is smaller than the other floors",
                    "vi": "một tầng được xây dựng giữa hai tầng của một tòa nhà và nhỏ hơn các tầng khác"
                },
                "examples": [
                    {
                        "en": "a bedroom on the mezzanine",
                        "vi": "một phòng ngủ trên gác lửng"
                    },
                    {
                        "en": "a mezzanine floor",
                        "vi": "một tầng lửng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the first area of seats above the ground floor in a theatre; the first few rows of these seats",
                    "vi": "khu vực ghế đầu tiên phía trên tầng trệt trong rạp hát; vài hàng ghế đầu tiên của những ghế này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7bd4c3ee4dce4ddc9da12a785c824671",
        "word": "partition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pɑːˈtɪʃn/",
            "us": "/pɑːrˈtɪʃn/"
        },
        "nearby": [
            {
                "word": "partisan",
                "pos": "noun"
            },
            {
                "word": "partisanship",
                "pos": "noun"
            },
            {
                "word": "partition",
                "pos": "noun"
            },
            {
                "word": "partition",
                "pos": "verb"
            },
            {
                "word": "Partition",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall or screen that separates one part of a room from another",
                    "vi": "một bức tường hoặc bức bình phong ngăn cách một phần của căn phòng với phần khác"
                },
                "examples": [
                    {
                        "en": "The cafe was divided up by glass partitions.",
                        "vi": "Quán cà phê được ngăn bằng vách kính."
                    },
                    {
                        "en": "I could hear him snoring through the thin partition walls.",
                        "vi": "Tôi có thể nghe thấy tiếng anh ngáy qua những bức tường ngăn mỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the division of one country into two or more countries",
                    "vi": "sự phân chia một quốc gia thành hai hoặc nhiều quốc gia"
                },
                "examples": [
                    {
                        "en": "the partition of Germany after the war",
                        "vi": "sự phân chia của nước Đức sau chiến tranh"
                    }
                ]
            }
        ]
    },
    {
        "id": "88eb2d3cc45d424f8ab1192a61746ba1",
        "word": "skirting board",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskɜːtɪŋ bɔːd/",
            "us": "/ˈskɜːrtɪŋ bɔːrd/"
        },
        "nearby": [
            {
                "word": "skirt",
                "pos": "noun"
            },
            {
                "word": "skirt",
                "pos": "verb"
            },
            {
                "word": "skirting board",
                "pos": "noun"
            },
            {
                "word": "ski run",
                "pos": "noun"
            },
            {
                "word": "skit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of wood that is fixed along the bottom of the walls in a house",
                    "vi": "một mảnh gỗ hẹp được cố định dọc theo đáy tường trong một ngôi nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9a8d9383e29745b68e1318d599fe3aee",
        "word": "stairwell",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteəwel/",
            "us": "/ˈsterwel/"
        },
        "nearby": [
            {
                "word": "stairlift",
                "pos": "noun"
            },
            {
                "word": "stairway",
                "pos": "noun"
            },
            {
                "word": "stairwell",
                "pos": "noun"
            },
            {
                "word": "stake",
                "pos": "noun"
            },
            {
                "word": "stake",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the space in a building in which the stairs are built",
                    "vi": "không gian trong một tòa nhà, trong đó cầu thang được xây dựng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba80c2bc87314188b40245a48e3e17dc",
        "word": "stilt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stɪlt/",
            "us": "/stɪlt/"
        },
        "nearby": [
            {
                "word": "still life",
                "pos": "noun"
            },
            {
                "word": "stillness",
                "pos": "noun"
            },
            {
                "word": "stilt",
                "pos": "noun"
            },
            {
                "word": "stilted",
                "pos": "adjective"
            },
            {
                "word": "stiltedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a set of posts that support a building so that it is high above the ground or water",
                    "vi": "một trong những tập hợp các trụ đỡ một tòa nhà sao cho nó ở trên cao so với mặt đất hoặc mặt nước"
                },
                "examples": [
                    {
                        "en": "The houses are built on stilts to prevent flooding during the rainy season.",
                        "vi": "Những ngôi nhà sàn được xây dựng để chống ngập úng trong mùa mưa lũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of two long pieces of wood that have a step on the side that you can stand on, so that you can walk above the ground",
                    "vi": "một trong hai miếng gỗ dài có bậc ở bên cạnh để bạn có thể đứng, để bạn có thể đi trên mặt đất"
                },
                "examples": [
                    {
                        "en": "a circus performer on stilts",
                        "vi": "biểu diễn xiếc trên cà kheo"
                    }
                ]
            }
        ]
    },
    {
        "id": "90de7faac66448fa8571855939a7b933",
        "word": "stoop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stuːp/",
            "us": "/stuːp/"
        },
        "nearby": [
            {
                "word": "stool pigeon",
                "pos": "noun"
            },
            {
                "word": "stoop",
                "pos": "verb"
            },
            {
                "word": "stoop",
                "pos": "noun"
            },
            {
                "word": "stooped",
                "pos": "adjective"
            },
            {
                "word": "stoop to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if somebody has a stoop, their shoulders are always bent forward",
                    "vi": "nếu ai đó khom lưng, vai của họ luôn hướng về phía trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a raised area outside the door of a house with steps leading up to it",
                    "vi": "một khu vực nâng cao bên ngoài cửa của một ngôi nhà với các bậc thang dẫn đến nó"
                },
                "examples": [
                    {
                        "en": "the front stoop",
                        "vi": "khom lưng trước"
                    },
                    {
                        "en": "We sat talking on the stoop until midnight.",
                        "vi": "Chúng tôi ngồi nói chuyện rôm rả đến nửa đêm."
                    }
                ]
            }
        ]
    },
    {
        "id": "31be519dd28148afa7b4fd2ef552d388",
        "word": "thatch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/θætʃ/",
            "us": "/θætʃ/"
        },
        "nearby": [
            {
                "word": "that",
                "pos": "adverb"
            },
            {
                "word": "thataway",
                "pos": "adverb"
            },
            {
                "word": "thatch",
                "pos": "noun"
            },
            {
                "word": "thatch",
                "pos": "verb"
            },
            {
                "word": "thatched",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dried straw, reeds, etc. used for making a roof; a roof made of this material",
                    "vi": "rơm, rạ khô, lau sậy ... dùng làm mái che; một mái nhà làm bằng vật liệu này"
                },
                "examples": [
                    {
                        "en": "a roof made of thatch",
                        "vi": "một mái nhà làm bằng tranh"
                    },
                    {
                        "en": "The thatch was badly damaged in the storm.",
                        "vi": "Nhà tranh bị hư hỏng nặng trong trận bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "thick hair on somebody’s head",
                    "vi": "tóc dày trên đầu ai đó"
                },
                "examples": [
                    {
                        "en": "He had a thatch of thick brown hair.",
                        "vi": "Anh ta có một mái tóc dày màu nâu."
                    },
                    {
                        "en": "Fortunately, I've got a reasonably thick thatch left.",
                        "vi": "May mắn thay, tôi còn lại một lớp vải dày tương đối dày."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc5a382e7f1a4bdc944541134e6613aa",
        "word": "veranda",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vəˈrændə/",
            "us": "/vəˈrændə/"
        },
        "nearby": [
            {
                "word": "Vera",
                "pos": ""
            },
            {
                "word": "veracity",
                "pos": "noun"
            },
            {
                "word": "veranda",
                "pos": "noun"
            },
            {
                "word": "verb",
                "pos": "noun"
            },
            {
                "word": "verbal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a platform with an open front and a roof, built onto the side of a house on the ground floor",
                    "vi": "một nền tảng với một mặt trước mở và một mái nhà, được xây dựng ở phía bên của một ngôi nhà ở tầng trệt"
                },
                "examples": [
                    {
                        "en": "After dinner, we sat talking on the veranda.",
                        "vi": "Sau bữa tối, chúng tôi ngồi nói chuyện trên hiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a roof over the part of the street where people walk in front of a shop",
                    "vi": "một mái nhà trên một phần của đường phố nơi mọi người đi bộ trước cửa hàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d9d2005583043909780baa4e592075d",
        "word": "weathervane",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈweðəveɪn/",
            "us": "/ˈweðərveɪn/"
        },
        "nearby": [
            {
                "word": "weatherstrip",
                "pos": "noun"
            },
            {
                "word": "weatherstripping",
                "pos": "noun"
            },
            {
                "word": "weathervane",
                "pos": "noun"
            },
            {
                "word": "weave",
                "pos": "verb"
            },
            {
                "word": "weave",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal object on the roof of a building that turns easily in the wind and shows which direction the wind is blowing from",
                    "vi": "một vật kim loại trên mái của một tòa nhà dễ dàng quay theo gió và cho biết gió đang thổi từ hướng nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c62f0f0fdb064a9abea91c1bf359fb4d",
        "word": "window ledge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪndəʊ ledʒ/",
            "us": "/ˈwɪndəʊ ledʒ/"
        },
        "nearby": [
            {
                "word": "window cleaner",
                "pos": "noun"
            },
            {
                "word": "window dressing",
                "pos": "noun"
            },
            {
                "word": "window ledge",
                "pos": "noun"
            },
            {
                "word": "windowless",
                "pos": "adjective"
            },
            {
                "word": "windowpane",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow shelf below a window, either inside or outside",
                    "vi": "một kệ hẹp bên dưới cửa sổ, bên trong hoặc bên ngoài"
                },
                "examples": []
            }
        ]
    }
]