[
    {
        "id": "c884147c2c5f4797a16f694cb9e9c10c",
        "word": "joint",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dʒɔɪnt/",
            "us": "/dʒɔɪnt/"
        },
        "nearby": [
            {
                "word": "joinery",
                "pos": "noun"
            },
            {
                "word": "join in",
                "pos": "phrasal verb"
            },
            {
                "word": "joint",
                "pos": "adjective"
            },
            {
                "word": "joint",
                "pos": "noun"
            },
            {
                "word": "joint",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving two or more people together",
                    "vi": "liên quan đến hai hoặc nhiều người cùng nhau"
                },
                "examples": [
                    {
                        "en": "a joint account (= a bank account in the name of more than one person, for example shared by a couple)",
                        "vi": "một tài khoản chung (= tài khoản ngân hàng đứng tên nhiều hơn một người, ví dụ như được chia sẻ bởi một cặp vợ chồng)"
                    },
                    {
                        "en": "The report was a joint effort (= we worked on it together).",
                        "vi": "Báo cáo là một nỗ lực chung (= chúng tôi đã làm việc cùng nhau)."
                    },
                    {
                        "en": "They finished in joint first place.",
                        "vi": "Họ đã hoàn thành ở vị trí đầu tiên chung."
                    },
                    {
                        "en": "They were joint owners of the house (= they owned it together).",
                        "vi": "Họ là chủ sở hữu chung của ngôi nhà (= họ cùng sở hữu)."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c6babb43dd241be80a4c9aa7bffc88e",
        "word": "jointly",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒɔɪntli/",
            "us": "/ˈdʒɔɪntli/"
        },
        "nearby": [
            {
                "word": "jointed",
                "pos": "adjective"
            },
            {
                "word": "joint family",
                "pos": "noun"
            },
            {
                "word": "jointly",
                "pos": "adverb"
            },
            {
                "word": "joint resolution",
                "pos": "noun"
            },
            {
                "word": "joint-stock company",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that involves two or more people or groups together",
                    "vi": "theo cách liên quan đến hai hoặc nhiều người hoặc nhiều nhóm cùng nhau"
                },
                "examples": [
                    {
                        "en": "The event was organized jointly by students and staff.",
                        "vi": "Sự kiện được tổ chức bởi sinh viên và nhân viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "00deeab5518948ca8a252e7bafd1f5de",
        "word": "collaborate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˈlæbəreɪt/",
            "us": "/kəˈlæbəreɪt/"
        },
        "nearby": [
            {
                "word": "the Coliseum",
                "pos": ""
            },
            {
                "word": "colitis",
                "pos": "noun"
            },
            {
                "word": "collaborate",
                "pos": "verb"
            },
            {
                "word": "collaboration",
                "pos": "noun"
            },
            {
                "word": "collaborative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to work together with somebody in order to produce or achieve something",
                    "vi": "làm việc cùng với ai đó để sản xuất hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "Researchers around the world are collaborating to develop a new vaccine.",
                        "vi": "Các nhà nghiên cứu trên khắp thế giới đang hợp tác để phát triển một loại vắc xin mới."
                    },
                    {
                        "en": "collaborate (with somebody) (on something) We have collaborated on many projects over the years.",
                        "vi": "cộng tác (với ai đó) (về điều gì đó) Chúng tôi đã hợp tác trong nhiều dự án trong nhiều năm."
                    },
                    {
                        "en": "collaborate (with somebody) (in something/in doing something) She agreed to collaborate with him in writing her biography.",
                        "vi": "cộng tác (với ai đó) (trong việc gì đó / đang làm gì đó) Cô ấy đã đồng ý cộng tác với anh ấy trong việc viết tiểu sử của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help the enemy who has taken control of your country during a war",
                    "vi": "để giúp kẻ thù đã kiểm soát đất nước của bạn trong một cuộc chiến tranh"
                },
                "examples": [
                    {
                        "en": "He was accused of collaborating with the enemy.",
                        "vi": "Ông bị buộc tội cộng tác với kẻ thù."
                    }
                ]
            }
        ]
    },
    {
        "id": "485fcc6c4b3844f2907a30e1cf072e2c",
        "word": "collaboration",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˌlæbəˈreɪʃn/",
            "us": "/kəˌlæbəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "colitis",
                "pos": "noun"
            },
            {
                "word": "collaborate",
                "pos": "verb"
            },
            {
                "word": "collaboration",
                "pos": "noun"
            },
            {
                "word": "collaborative",
                "pos": "adjective"
            },
            {
                "word": "collaboratively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of working with another person or group of people to create or produce something",
                    "vi": "hành động làm việc với một người hoặc một nhóm người khác để tạo ra hoặc sản xuất một cái gì đó"
                },
                "examples": [
                    {
                        "en": "It was a collaboration that produced extremely useful results.",
                        "vi": "Đó là một sự hợp tác tạo ra kết quả cực kỳ hữu ích."
                    },
                    {
                        "en": "The new plane was a triumph of European industrial and technical collaboration.",
                        "vi": "Chiếc máy bay mới là một thành công của sự hợp tác kỹ thuật và công nghiệp châu Âu."
                    },
                    {
                        "en": "collaboration with somebody (on something) the results of a fruitful collaboration with the industry",
                        "vi": "cộng tác với ai đó (về điều gì đó) là kết quả của sự hợp tác hiệu quả với ngành"
                    },
                    {
                        "en": "in collaboration with somebody She wrote the book in collaboration with one of her students.",
                        "vi": "cộng tác với ai đó Cô ấy đã viết cuốn sách với sự cộng tác của một trong những sinh viên của mình."
                    },
                    {
                        "en": "in collaboration with somebody on something The government worked in close collaboration with teachers on the new curriculum.",
                        "vi": "phối hợp với ai đó về một vấn đề gì đó Chính phủ đã phối hợp chặt chẽ với các giáo viên về chương trình giảng dạy mới."
                    },
                    {
                        "en": "collaboration between A and B collaboration between the teachers and the government",
                        "vi": "sự hợp tác giữa A và B Sự hợp tác giữa giáo viên và chính phủ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of work produced by two or more people or groups of people working together",
                    "vi": "một tác phẩm được sản xuất bởi hai hoặc nhiều người hoặc nhiều nhóm người cùng làm việc"
                },
                "examples": [
                    {
                        "en": "collaboration with somebody/something The exhibiton is a collaboration with the Australian Centre for the Moving Image.",
                        "vi": "sự hợp tác với ai đó / cái gì đó Triển lãm là sự hợp tác với Trung tâm Hình ảnh Chuyển động của Úc."
                    },
                    {
                        "en": "collaboration between A and B This mission was a collaboration between the National Space Agency of Japan and NASA.",
                        "vi": "sự hợp tác giữa A và B Nhiệm vụ này là sự hợp tác giữa Cơ quan Vũ trụ Quốc gia Nhật Bản và NASA."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of helping the enemy during a war when they have taken control of your country",
                    "vi": "hành động giúp đỡ kẻ thù trong chiến tranh khi họ đã kiểm soát đất nước của bạn"
                },
                "examples": [
                    {
                        "en": "his wartime collaboration with the Nazis",
                        "vi": "sự hợp tác trong thời chiến của anh ấy với Đức Quốc xã"
                    }
                ]
            }
        ]
    },
    {
        "id": "7a7f7277c05944aeaeeb2709f6e923c2",
        "word": "collaborative",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˈlæbərətɪv/",
            "us": "/kəˈlæbəreɪtɪv/"
        },
        "nearby": [
            {
                "word": "collaborate",
                "pos": "verb"
            },
            {
                "word": "collaboration",
                "pos": "noun"
            },
            {
                "word": "collaborative",
                "pos": "adjective"
            },
            {
                "word": "collaboratively",
                "pos": "adverb"
            },
            {
                "word": "collaborator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving, or done by, several people or groups of people working together",
                    "vi": "liên quan, hoặc được thực hiện bởi một số người hoặc nhóm người làm việc cùng nhau"
                },
                "examples": [
                    {
                        "en": "collaborative projects/studies/research",
                        "vi": "dự án hợp tác / nghiên cứu / nghiên cứu"
                    },
                    {
                        "en": "a collaborative effort/venture",
                        "vi": "một nỗ lực hợp tác / liên doanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "4a392ba067014b6b9063ead0de0d8fdc",
        "word": "collective",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˈlektɪv/",
            "us": "/kəˈlektɪv/"
        },
        "nearby": [
            {
                "word": "collected",
                "pos": "adjective"
            },
            {
                "word": "collection",
                "pos": "noun"
            },
            {
                "word": "collective",
                "pos": "adjective"
            },
            {
                "word": "collective",
                "pos": "noun"
            },
            {
                "word": "collective bargaining",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done or shared by all members of a group of people; involving a whole group or society",
                    "vi": "được thực hiện hoặc chia sẻ bởi tất cả các thành viên của một nhóm người; liên quan đến toàn bộ nhóm hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "collective leadership/decision-making/responsibility",
                        "vi": "lãnh đạo tập thể / ra quyết định / trách nhiệm"
                    },
                    {
                        "en": "collective memory (= things that a group of people or a community know or remember, that are often passed from parents to children)",
                        "vi": "trí nhớ tập thể (= những thứ mà một nhóm người hoặc một cộng đồng biết hoặc nhớ, thường được truyền từ cha mẹ sang con cái)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to all members of a group",
                    "vi": "được sử dụng để chỉ tất cả các thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "The collective name for mast, boom and sails on a boat is the ‘rig’.",
                        "vi": "Tên chung của cột buồm, cần và buồm trên thuyền là 'giàn khoan'."
                    }
                ]
            }
        ]
    },
    {
        "id": "597f1936900d421d8211973131776b73",
        "word": "cooperate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊˈɒpəreɪt/",
            "us": "/kəʊˈɑːpəreɪt/"
        },
        "nearby": [
            {
                "word": "James Fenimore Cooper",
                "pos": ""
            },
            {
                "word": "Tommy Cooper",
                "pos": ""
            },
            {
                "word": "cooperate",
                "pos": "verb"
            },
            {
                "word": "cooperation",
                "pos": "noun"
            },
            {
                "word": "cooperative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to work together with somebody else in order to achieve something",
                    "vi": "làm việc cùng với ai đó khác để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The two groups agreed to cooperate with each other.",
                        "vi": "Hai nhóm đã đồng ý hợp tác với nhau."
                    },
                    {
                        "en": "They had cooperated closely in the planning of the project.",
                        "vi": "Họ đã hợp tác chặt chẽ trong việc lập kế hoạch của dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be helpful by doing what somebody asks you to do",
                    "vi": "trở nên hữu ích bằng cách làm những gì ai đó yêu cầu bạn làm"
                },
                "examples": [
                    {
                        "en": "Their captors told them they would be killed unless they cooperated.",
                        "vi": "Những kẻ bắt giữ họ nói với họ rằng họ sẽ bị giết trừ khi họ hợp tác."
                    },
                    {
                        "en": "The company has agreed to cooperate with the employment survey.",
                        "vi": "Công ty đã đồng ý hợp tác khảo sát việc làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "6786e950f37e4f79a1c2e399e50d34e8",
        "word": "cooperation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊˌɒpəˈreɪʃn/",
            "us": "/kəʊˌɑːpəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "Tommy Cooper",
                "pos": ""
            },
            {
                "word": "cooperate",
                "pos": "verb"
            },
            {
                "word": "cooperation",
                "pos": "noun"
            },
            {
                "word": "cooperative",
                "pos": "adjective"
            },
            {
                "word": "cooperative",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of doing something together or of working together towards a shared aim",
                    "vi": "thực tế là làm điều gì đó cùng nhau hoặc cùng nhau hướng tới mục tiêu chung"
                },
                "examples": [
                    {
                        "en": "They offered their cooperation on the project.",
                        "vi": "Họ đề nghị hợp tác trong dự án."
                    },
                    {
                        "en": "in cooperation with somebody a report produced by the government in cooperation with the chemical industry",
                        "vi": "hợp tác với ai đó một báo cáo do chính phủ hợp tác với ngành công nghiệp hóa chất thực hiện"
                    },
                    {
                        "en": "cooperation between A and B We would like to see closer cooperation between parents and schools.",
                        "vi": "sự hợp tác giữa A và B Chúng tôi mong muốn thấy được sự hợp tác chặt chẽ hơn nữa giữa phụ huynh và nhà trường."
                    },
                    {
                        "en": "cooperation with somebody We should like to thank you for your cooperation with us.",
                        "vi": "hợp tác với ai đó Chúng tôi muốn cảm ơn bạn đã hợp tác với chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a desire to be helpful and do as you are asked",
                    "vi": "mong muốn được hữu ích và làm theo yêu cầu của bạn"
                },
                "examples": [
                    {
                        "en": "We would be grateful for your cooperation in clearing the hall as quickly as possible.",
                        "vi": "Chúng tôi xin chân thành cảm ơn sự hợp tác của bạn trong việc dọn hội trường nhanh nhất có thể."
                    }
                ]
            }
        ]
    },
    {
        "id": "1f9567cdeeaa4840baf991eb191e2b73",
        "word": "cooperative",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊˈɒpərətɪv/",
            "us": "/kəʊˈɑːpərətɪv/"
        },
        "nearby": [
            {
                "word": "cooperate",
                "pos": "verb"
            },
            {
                "word": "cooperation",
                "pos": "noun"
            },
            {
                "word": "cooperative",
                "pos": "adjective"
            },
            {
                "word": "cooperative",
                "pos": "noun"
            },
            {
                "word": "the Cooperative for American Relief Everywhere",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving doing something together or working together with others towards a shared aim",
                    "vi": "liên quan đến việc làm điều gì đó cùng nhau hoặc cùng làm việc với những người khác để hướng tới mục tiêu chung"
                },
                "examples": [
                    {
                        "en": "Cooperative activity is essential to effective community work.",
                        "vi": "Hoạt động hợp tác là cần thiết để làm việc cộng đồng hiệu quả."
                    },
                    {
                        "en": "The documentary was a cooperative effort by film-makers from five countries.",
                        "vi": "Bộ phim tài liệu là một nỗ lực hợp tác của các nhà làm phim từ năm quốc gia."
                    },
                    {
                        "en": "This is a cooperative venture with the University of Copenhagen.",
                        "vi": "Đây là một liên doanh hợp tác với Đại học Copenhagen."
                    }
                ]
            },
            {
                "define": {
                    "en": "helpful by doing what you are asked to do",
                    "vi": "hữu ích bằng cách làm những gì bạn được yêu cầu làm"
                },
                "examples": [
                    {
                        "en": "Employees will generally be more cooperative if their views are taken seriously.",
                        "vi": "Nhân viên nói chung sẽ hợp tác hơn nếu quan điểm của họ được xem xét một cách nghiêm túc."
                    }
                ]
            },
            {
                "define": {
                    "en": "owned and run by the people involved, with the profits shared by them",
                    "vi": "do những người liên quan sở hữu và điều hành, với lợi nhuận được chia sẻ bởi họ"
                },
                "examples": [
                    {
                        "en": "a cooperative farm",
                        "vi": "một trang trại hợp tác"
                    },
                    {
                        "en": "The cooperative movement started in Britain in the nineteenth century.",
                        "vi": "Phong trào hợp tác hóa bắt đầu ở Anh vào thế kỷ XIX."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8894b582f024fa7ad8b26999ccabd93",
        "word": "coordinate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊˈɔːdɪneɪt/",
            "us": "/kəʊˈɔːrdɪneɪt/"
        },
        "nearby": [
            {
                "word": "co-opt",
                "pos": "verb"
            },
            {
                "word": "coop up",
                "pos": "phrasal verb"
            },
            {
                "word": "coordinate",
                "pos": "verb"
            },
            {
                "word": "coordinate",
                "pos": "noun"
            },
            {
                "word": "coordinate clause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to organize the different parts of an activity and the people involved in it so that it works well",
                    "vi": "tổ chức các phần khác nhau của một hoạt động và những người tham gia vào nó để nó hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "coordinate something They appointed a new manager to coordinate the work of the team.",
                        "vi": "điều phối một cái gì đó Họ đã bổ nhiệm một người quản lý mới để điều phối công việc của nhóm."
                    },
                    {
                        "en": "We need to develop a coordinated approach to the problem.",
                        "vi": "Chúng ta cần phát triển một cách tiếp cận phối hợp để giải quyết vấn đề."
                    },
                    {
                        "en": "a carefully coordinated policy",
                        "vi": "một chính sách được phối hợp cẩn thận"
                    },
                    {
                        "en": "coordinate something with something We try to coordinate our activities with those of other groups.",
                        "vi": "phối hợp một cái gì đó với cái gì đó Chúng tôi cố gắng phối hợp các hoạt động của chúng tôi với các hoạt động của các nhóm khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the different parts of your body work well together",
                    "vi": "để làm cho các bộ phận khác nhau của cơ thể bạn hoạt động tốt cùng nhau"
                },
                "examples": [
                    {
                        "en": "the part of the brain that coordinates body movements",
                        "vi": "phần não điều phối các chuyển động của cơ thể"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you coordinate clothes, furniture, etc. or if they coordinate, they look nice together",
                    "vi": "nếu bạn phối quần áo, đồ đạc, v.v. hoặc nếu chúng phối hợp, chúng trông rất đẹp với nhau"
                },
                "examples": [
                    {
                        "en": "This shade coordinates with a wide range of other colours.",
                        "vi": "Bóng râm này phối hợp với một loạt các màu khác."
                    },
                    {
                        "en": "The company has extended its coordinated clothing range.",
                        "vi": "Công ty đã mở rộng phạm vi quần áo phối hợp của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a7ca7b583354df9a8d4a2079e4859f4",
        "word": "coordination",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kəʊˌɔːdɪˈneɪʃn/",
            "us": "/kəʊˌɔːrdɪˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "Coordinated Universal Time",
                "pos": "noun"
            },
            {
                "word": "coordinating conjunction",
                "pos": "noun"
            },
            {
                "word": "coordination",
                "pos": "noun"
            },
            {
                "word": "coordinator",
                "pos": "noun"
            },
            {
                "word": "Coors",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of making parts of something, groups of people, etc. work together in an efficient and organized way",
                    "vi": "hành động làm cho các bộ phận của một cái gì đó, các nhóm người, v.v. hoạt động cùng nhau một cách hiệu quả và có tổ chức"
                },
                "examples": [
                    {
                        "en": "The aim was to improve the coordination of services.",
                        "vi": "Mục đích là để cải thiện sự phối hợp của các dịch vụ."
                    },
                    {
                        "en": "coordination between A and B a need for greater coordination between departments",
                        "vi": "sự phối hợp giữa A và B cần có sự phối hợp nhiều hơn giữa các bộ phận"
                    },
                    {
                        "en": "coordination in something a lack of coordination in conservation policy",
                        "vi": "phối hợp trong một cái gì đó thiếu phối hợp trong chính sách bảo tồn"
                    },
                    {
                        "en": "in coordination with somebody/something a pamphlet produced by the government in coordination with (= working together with) the Sports Council",
                        "vi": "phối hợp với ai đó / cái gì đó một cuốn sách nhỏ do chính phủ phối hợp với (= làm việc cùng với) Hội đồng thể thao sản xuất"
                    },
                    {
                        "en": "advice on colour coordination (= choosing colours that look nice together, for example in clothes or furniture)",
                        "vi": "lời khuyên về cách phối hợp màu sắc (= chọn các màu trông đẹp mắt với nhau, ví dụ như trong quần áo hoặc đồ nội thất)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to control your movements well",
                    "vi": "khả năng kiểm soát chuyển động của bạn tốt"
                },
                "examples": [
                    {
                        "en": "You need good hand-eye coordination to play ball games.",
                        "vi": "Bạn cần phối hợp tốt giữa tay và mắt để chơi trò chơi bóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ba0dba8305c46e5baa4536108bd20ca",
        "word": "collude",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈluːd/",
            "us": "/kəˈluːd/"
        },
        "nearby": [
            {
                "word": "colloquium",
                "pos": "noun"
            },
            {
                "word": "colloquy",
                "pos": "noun"
            },
            {
                "word": "collude",
                "pos": "verb"
            },
            {
                "word": "collusion",
                "pos": "noun"
            },
            {
                "word": "collusive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to work together secretly or illegally in order to trick other people",
                    "vi": "làm việc cùng nhau một cách bí mật hoặc bất hợp pháp để lừa người khác"
                },
                "examples": [
                    {
                        "en": "collude (with somebody) (in something/in doing something) Several people had colluded in the murder.",
                        "vi": "thông đồng (với ai đó) (trong việc gì đó / đang làm gì đó) Một số người đã thông đồng trong vụ giết người."
                    },
                    {
                        "en": "collude (with somebody) (to do something) They colluded with terrorists to overthrow the government.",
                        "vi": "collude (with somebody) (to do something) Họ cấu kết với bọn khủng bố để lật đổ chính phủ."
                    },
                    {
                        "en": "The president accused his opponents of colluding with foreigners.",
                        "vi": "Tổng thống cáo buộc các đối thủ của ông thông đồng với người nước ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "616c6dc1a2ee402abad1a68bc7b0772f",
        "word": "collusion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈluːʒn/",
            "us": "/kəˈluːʒn/"
        },
        "nearby": [
            {
                "word": "colloquy",
                "pos": "noun"
            },
            {
                "word": "collude",
                "pos": "verb"
            },
            {
                "word": "collusion",
                "pos": "noun"
            },
            {
                "word": "collusive",
                "pos": "adjective"
            },
            {
                "word": "collywobbles",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "secret agreement especially in order to do something dishonest or to trick people",
                    "vi": "thỏa thuận bí mật đặc biệt là để làm điều gì đó không trung thực hoặc để lừa mọi người"
                },
                "examples": [
                    {
                        "en": "in collusion with somebody The police were corrupt and were operating in collusion with the drug dealers.",
                        "vi": "thông đồng với ai đó Cảnh sát đã tham nhũng và đang hoạt động thông đồng với những kẻ buôn bán ma túy."
                    },
                    {
                        "en": "collusion (between A and B) There was collusion between the two witnesses (= they gave the same false evidence).",
                        "vi": "thông đồng (giữa A và B) Có sự thông đồng giữa hai nhân chứng (= họ đưa ra cùng một bằng chứng giả)."
                    }
                ]
            }
        ]
    },
    {
        "id": "bab5b07ccedc4651baf4a3eb47204a65",
        "word": "collusive",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈluːsɪv/",
            "us": "/kəˈluːsɪv/"
        },
        "nearby": [
            {
                "word": "collude",
                "pos": "verb"
            },
            {
                "word": "collusion",
                "pos": "noun"
            },
            {
                "word": "collusive",
                "pos": "adjective"
            },
            {
                "word": "collywobbles",
                "pos": "noun"
            },
            {
                "word": "colobus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or based on a secret agreement especially in order to do something dishonest or to trick people",
                    "vi": "có hoặc dựa trên một thỏa thuận bí mật, đặc biệt là để làm điều gì đó không trung thực hoặc lừa mọi người"
                },
                "examples": [
                    {
                        "en": "There is a secret collusive relationship between politics and the media which the outside world rarely glimpses.",
                        "vi": "Có một mối quan hệ thông đồng bí mật giữa chính trị và truyền thông mà thế giới bên ngoài hiếm khi nhìn thấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6d8f3cb752a46bebdcde4c7b01b557b",
        "word": "common ground",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒmən ˈɡraʊnd/",
            "us": "/ˌkɑːmən ˈɡraʊnd/"
        },
        "nearby": [
            {
                "word": "Common Era",
                "pos": "noun"
            },
            {
                "word": "common fraction",
                "pos": "noun"
            },
            {
                "word": "common ground",
                "pos": "noun"
            },
            {
                "word": "commonhold",
                "pos": "noun"
            },
            {
                "word": "common land",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "opinions, interests and aims that you share with somebody, although you may not agree with them about other things",
                    "vi": "ý kiến, sở thích và mục đích mà bạn chia sẻ với ai đó, mặc dù bạn có thể không đồng ý với họ về những điều khác"
                },
                "examples": [
                    {
                        "en": "Despite our disagreements, we have been able to find some common ground.",
                        "vi": "Bất chấp những bất đồng của chúng tôi, chúng tôi đã có thể tìm thấy một số điểm chung."
                    },
                    {
                        "en": "We found ourselves on common ground on the question of education.",
                        "vi": "Chúng tôi thấy mình có điểm chung về vấn đề giáo dục."
                    },
                    {
                        "en": "to find common ground between the two sides",
                        "vi": "để tìm ra điểm chung giữa hai bên"
                    },
                    {
                        "en": "Both parties in the debate shared some common ground.",
                        "vi": "Cả hai bên trong cuộc tranh luận đều chia sẻ một số điểm chung."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb857fe09c434cda830b45a5f6615411",
        "word": "make common cause with somebody",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmən/",
            "us": "/ˈkɑːmən/"
        },
        "nearby": [
            {
                "word": "commodity",
                "pos": "noun"
            },
            {
                "word": "commodore",
                "pos": "noun"
            },
            {
                "word": "common",
                "pos": "adjective"
            },
            {
                "word": "common",
                "pos": "noun"
            },
            {
                "word": "the Common Agricultural Policy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "happening often; existing in large numbers or in many places",
                    "vi": "xảy ra thường xuyên; tồn tại với số lượng lớn hoặc ở nhiều nơi"
                },
                "examples": [
                    {
                        "en": "a common problem/occurrence/practice",
                        "vi": "một vấn đề chung / sự cố / thực hành"
                    },
                    {
                        "en": "a common feature/theme",
                        "vi": "một tính năng / chủ đề chung"
                    },
                    {
                        "en": "the most common type of injury",
                        "vi": "loại thương tích phổ biến nhất"
                    },
                    {
                        "en": "Breast cancer is the most common form of cancer among women in this country.",
                        "vi": "Ung thư vú là dạng ung thư phổ biến nhất ở phụ nữ nước này."
                    },
                    {
                        "en": "Jackson is a common English name.",
                        "vi": "Jackson là một tên tiếng Anh thông dụng."
                    },
                    {
                        "en": "Some birds that were once a common sight are now becoming rare.",
                        "vi": "Một số loài chim từng là cảnh thường thấy nay trở nên hiếm hoi."
                    },
                    {
                        "en": "a common spelling mistake",
                        "vi": "một lỗi chính tả phổ biến"
                    },
                    {
                        "en": "Suicide is the most common cause of death amongst men in this age group.",
                        "vi": "Tự tử là nguyên nhân tử vong phổ biến nhất ở nam giới trong độ tuổi này."
                    },
                    {
                        "en": "common in somebody/something The disease is very common in young horses.",
                        "vi": "common in somebody / something Bệnh rất phổ biến ở ngựa non."
                    },
                    {
                        "en": "Allergies to milk are quite common in childhood.",
                        "vi": "Dị ứng với sữa khá phổ biến ở trẻ nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "shared by or belonging to two or more people or by the people in a group",
                    "vi": "được chia sẻ bởi hoặc thuộc về hai hoặc nhiều người hoặc bởi những người trong một nhóm"
                },
                "examples": [
                    {
                        "en": "They share a common interest in photography.",
                        "vi": "Họ có chung sở thích chụp ảnh."
                    },
                    {
                        "en": "to have a common ancestor/enemy",
                        "vi": "có một tổ tiên / kẻ thù chung"
                    },
                    {
                        "en": "the need to cooperate to achieve a common goal",
                        "vi": "nhu cầu hợp tác để đạt được mục tiêu chung"
                    },
                    {
                        "en": "We are working together for a common purpose.",
                        "vi": "Chúng tôi đang làm việc cùng nhau vì một mục đích chung."
                    },
                    {
                        "en": "The various groups all learn Arabic, so they have a common language.",
                        "vi": "Các nhóm khác nhau đều học tiếng Ả Rập, vì vậy họ có một ngôn ngữ chung."
                    },
                    {
                        "en": "common ownership of the land",
                        "vi": "sở hữu chung đất"
                    },
                    {
                        "en": "This decision was taken for the common good (= the advantage of everyone).",
                        "vi": "Quyết định này được thực hiện vì lợi ích chung (= lợi ích của mọi người)."
                    },
                    {
                        "en": "It is, by common consent, Scotland's prettiest coast (= everyone agrees that it is).",
                        "vi": "Theo sự đồng ý chung, nó là bờ biển đẹp nhất Scotland (= mọi người đều đồng ý rằng nó là như vậy)."
                    },
                    {
                        "en": "common to somebody/something basic features that are common to all human languages",
                        "vi": "chung cho ai đó / một cái gì đó các tính năng cơ bản chung cho tất cả các ngôn ngữ của con người"
                    },
                    {
                        "en": "This attitude is common to most young men in the armed services.",
                        "vi": "Thái độ này là phổ biến đối với hầu hết thanh niên trong các dịch vụ vũ trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "ordinary; not unusual or special",
                    "vi": "bình thường; không bất thường hoặc đặc biệt"
                },
                "examples": [
                    {
                        "en": "Shakespeare's work was popular among the common people in his day.",
                        "vi": "Tác phẩm của Shakespeare rất phổ biến trong giới bình dân vào thời của ông."
                    },
                    {
                        "en": "In most people's eyes she was nothing more than a common criminal.",
                        "vi": "Trong mắt hầu hết mọi người, cô ấy chẳng khác gì một tên tội phạm bình thường."
                    },
                    {
                        "en": "You'd think he'd have the common courtesy to apologize (= this would be the polite behaviour that people would expect).",
                        "vi": "Bạn sẽ nghĩ rằng anh ấy sẽ có phép lịch sự thông thường để xin lỗi (= đây sẽ là cách cư xử lịch sự mà mọi người mong đợi)."
                    },
                    {
                        "en": "It's only common decency to let her know what's happening (= people would expect it).",
                        "vi": "Việc cho cô ấy biết điều gì đang xảy ra (= mọi người sẽ mong đợi điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "found or living in quite large numbers; not rare",
                    "vi": "được tìm thấy hoặc sống với số lượng khá lớn; không hiếm"
                },
                "examples": [
                    {
                        "en": "the common garden frog",
                        "vi": "con ếch vườn chung"
                    },
                    {
                        "en": "I wanted a recording of the common cuckoo.",
                        "vi": "Tôi muốn có một bản ghi âm của con chim cu gáy thông thường."
                    },
                    {
                        "en": "The swordfish is not common in European waters.",
                        "vi": "Cá kiếm không phổ biến ở các vùng biển châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "typical of somebody from a low social class and not having good manners",
                    "vi": "điển hình của một người nào đó từ một tầng lớp xã hội thấp và không có cách cư xử tốt"
                },
                "examples": [
                    {
                        "en": "She thought he was very common and uneducated.",
                        "vi": "Cô cho rằng anh rất bình thường và vô học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something that everyone knows, especially in a particular community or group",
                    "vi": "trở thành thứ mà mọi người đều biết, đặc biệt là trong một cộng đồng hoặc một nhóm cụ thể"
                },
                "examples": [
                    {
                        "en": "Their relationship is common knowledge.",
                        "vi": "Mối quan hệ của họ là kiến thức chung."
                    }
                ]
            },
            {
                "define": {
                    "en": "ordinary; with no special features",
                    "vi": "bình thường; không có tính năng đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the ability of a powerful or famous person to talk to and understand ordinary people",
                    "vi": "khả năng của một người quyền lực hoặc nổi tiếng để nói chuyện và hiểu những người bình thường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be united with somebody about something that you both agree on, believe in or wish to achieve",
                    "vi": "thống nhất với ai đó về điều gì đó mà cả hai bạn đều đồng ý, tin tưởng hoặc mong muốn đạt được"
                },
                "examples": []
            }
        ]
    }
]