[
    {
        "id": "6cb77027a1424487b43b5dff47cccd1b",
        "word": "fly",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/flaɪ/",
            "us": "/flaɪ/"
        },
        "nearby": [
            {
                "word": "flux",
                "pos": "noun"
            },
            {
                "word": "fly-drive",
                "pos": "noun"
            },
            {
                "word": "fly",
                "pos": "verb"
            },
            {
                "word": "fly",
                "pos": "noun"
            },
            {
                "word": "fly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move through the air, using wings",
                    "vi": "di chuyển trong không khí, sử dụng đôi cánh"
                },
                "examples": [
                    {
                        "en": "Penguins can't fly.",
                        "vi": "Chim cánh cụt không thể bay."
                    },
                    {
                        "en": "+ adv./prep. A stork flew slowly past.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "A wasp had flown in through the window.",
                        "vi": "Một con ong bắp cày bay qua cửa sổ."
                    },
                    {
                        "en": "Geese fly south in the fall.",
                        "vi": "Ngỗng bay về phía nam vào mùa thu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move through air or space",
                    "vi": "để di chuyển trong không khí hoặc không gian"
                },
                "examples": [
                    {
                        "en": "fly (from A) (to B) They were on a plane flying from London to New York.",
                        "vi": "bay (từ A) (đến B) Họ đã ở trên một chiếc máy bay bay từ London đến New York."
                    },
                    {
                        "en": "fly (to B) (from A) Lufthansa fly to La Paz from Frankfurt.",
                        "vi": "bay (đến B) (từ A) Lufthansa bay đến La Paz từ Frankfurt."
                    },
                    {
                        "en": "+ adv./prep. Enemy planes fly overhead.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "to fly at the speed of sound",
                        "vi": "bay với tốc độ âm thanh"
                    },
                    {
                        "en": "The aircraft was declared fully functional and fit to fly.",
                        "vi": "Máy bay đã được tuyên bố là đầy đủ chức năng và phù hợp để bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel in an aircraft or a spacecraft",
                    "vi": "đi du lịch trên máy bay hoặc tàu vũ trụ"
                },
                "examples": [
                    {
                        "en": "Is this the first time that you've flown?",
                        "vi": "Đây có phải là lần đầu tiên bạn bay?"
                    },
                    {
                        "en": "fly (from A) (to B) I'm flying to Hong Kong tomorrow.",
                        "vi": "bay (từ A) (đến B) Ngày mai tôi sẽ bay đến Hồng Kông."
                    },
                    {
                        "en": "fly + adv./prep. I was flying home to visit my family.",
                        "vi": "bay + adv./prep. Tôi đang bay về quê thăm gia đình."
                    },
                    {
                        "en": "+ noun I always fly business class.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "We're flying KLM.",
                        "vi": "Chúng tôi đang bay KLM."
                    }
                ]
            },
            {
                "define": {
                    "en": "to control an aircraft, etc. in the air",
                    "vi": "điều khiển máy bay, v.v. trên không"
                },
                "examples": [
                    {
                        "en": "He's learning to fly.",
                        "vi": "Anh ấy đang học bay."
                    },
                    {
                        "en": "fly something a pilot trained to fly large passenger planes",
                        "vi": "bay thứ gì đó mà một phi công được đào tạo để lái máy bay chở khách lớn"
                    },
                    {
                        "en": "children flying kites",
                        "vi": "trẻ em thả diều"
                    }
                ]
            },
            {
                "define": {
                    "en": "to transport goods or passengers in a plane",
                    "vi": "để vận chuyển hàng hóa hoặc hành khách trên máy bay"
                },
                "examples": [
                    {
                        "en": "The stranded tourists were finally flown home.",
                        "vi": "Những du khách mắc kẹt cuối cùng đã được đưa về nhà."
                    },
                    {
                        "en": "He had flowers specially flown in for the ceremony.",
                        "vi": "Anh ấy đã có những bông hoa đặc biệt bay đến cho buổi lễ."
                    },
                    {
                        "en": "Orders were given to fly the prisoners to the US.",
                        "vi": "Lệnh đưa các tù nhân đến Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move through the air for a particular distance; to travel over an ocean or area of land in an aircraft",
                    "vi": "để di chuyển trong không khí trong một khoảng cách cụ thể; đi du lịch trên đại dương hoặc khu vực đất liền bằng máy bay"
                },
                "examples": [
                    {
                        "en": "Some birds fly huge distances when they migrate.",
                        "vi": "Một số loài chim bay khoảng cách rất xa khi chúng di cư."
                    },
                    {
                        "en": "Who was the first person to fly the Atlantic?",
                        "vi": "Ai là người đầu tiên bay qua Đại Tây Dương?"
                    },
                    {
                        "en": "Only four airlines are currently allowed to fly transatlantic routes from Heathrow.",
                        "vi": "Hiện chỉ có bốn hãng hàng không được phép bay các đường bay xuyên Đại Tây Dương từ Heathrow."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go or move quickly",
                    "vi": "đi hoặc di chuyển nhanh chóng"
                },
                "examples": [
                    {
                        "en": "The train was flying along.",
                        "vi": "Con tàu đã bay dọc theo."
                    },
                    {
                        "en": "She gasped and her hand flew to her mouth.",
                        "vi": "Cô thở hổn hển và tay cô đưa lên miệng."
                    },
                    {
                        "en": "It's late—I must fly.",
                        "vi": "Muộn rồi - tôi phải bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move suddenly and with force",
                    "vi": "di chuyển đột ngột và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "(+ adv./prep.) A large stone came flying in through the window.",
                        "vi": "(+ adv./prep.) Một viên đá lớn bay vào qua cửa sổ."
                    },
                    {
                        "en": "Several people were hit by flying glass.",
                        "vi": "Một số người đã bị kính bay rơi trúng đầu."
                    },
                    {
                        "en": "+ adj. David gave the door a kick and it flew open.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to seem to pass very quickly",
                    "vi": "dường như trôi qua rất nhanh"
                },
                "examples": [
                    {
                        "en": "Doesn't time fly?",
                        "vi": "Thời gian không trôi?"
                    },
                    {
                        "en": "fly by/past Summer has just flown by.",
                        "vi": "bay qua / đã qua Mùa hè vừa bay qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a flag flies, or if you fly it, it is displayed, for example on a pole (= a long piece of wood or metal)",
                    "vi": "nếu một lá cờ bay hoặc nếu bạn bay nó, nó sẽ được hiển thị, chẳng hạn như trên một cây sào (= một miếng gỗ hoặc kim loại dài)"
                },
                "examples": [
                    {
                        "en": "Flags were flying at half mast on all public buildings.",
                        "vi": "Các lá cờ được treo ở một nửa cột trên tất cả các tòa nhà công cộng."
                    },
                    {
                        "en": "fly something to fly the Stars and Stripes",
                        "vi": "bay một cái gì đó để bay các ngôi sao và sọc"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move around freely",
                    "vi": "di chuyển tự do"
                },
                "examples": [
                    {
                        "en": "hair flying in the wind",
                        "vi": "tóc bay trong gió"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be talked about by many people",
                    "vi": "được nhiều người nói đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to escape from somebody/something",
                    "vi": "thoát khỏi ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Both suspects have flown the country.",
                        "vi": "Cả hai nghi phạm đã bay về nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful",
                    "vi": "để đạt thanh công"
                },
                "examples": [
                    {
                        "en": "It remains to be seen whether his project will fly.",
                        "vi": "Vẫn còn phải xem liệu dự án của anh ấy có bay hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit a ball high into the air",
                    "vi": "đánh một quả bóng lên cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a straight line",
                    "vi": "trong một đường thẳng"
                },
                "examples": [
                    {
                        "en": "The villages are no more than a mile apart as the crow flies.",
                        "vi": "Các làng cách nhau không quá một dặm khi quạ bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the wanted person has escaped",
                    "vi": "kẻ bị truy nã đã trốn thoát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to act without careful thought and without a plan that you have made in advance, hoping that you will be lucky and be successful",
                    "vi": "hành động mà không suy nghĩ kỹ lưỡng và không có kế hoạch mà bạn đã lập trước, hy vọng rằng bạn sẽ gặp may mắn và thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to escape from a place",
                    "vi": "trốn thoát khỏi một nơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show your support for your country, an organization or an idea to encourage or persuade others to do the same",
                    "vi": "để thể hiện sự ủng hộ của bạn đối với quốc gia, tổ chức của bạn hoặc một ý tưởng để khuyến khích hoặc thuyết phục người khác làm như vậy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be successful",
                    "vi": "để đạt thanh công"
                },
                "examples": [
                    {
                        "en": "British cinema has been flying high recently, winning several coveted awards.",
                        "vi": "Điện ảnh Anh gần đây đã bay cao, giành được nhiều giải thưởng đáng mơ ước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to oppose or be the opposite of something that is usual or expected",
                    "vi": "phản đối hoặc đối lập với điều gì đó bình thường hoặc được mong đợi"
                },
                "examples": [
                    {
                        "en": "Such a proposal is flying in the face of common sense.",
                        "vi": "Một đề xuất như vậy đang bay theo lẽ thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become suddenly very angry",
                    "vi": "đột nhiên trở nên rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to test out public opinion on a subject",
                    "vi": "để kiểm tra dư luận về một chủ đề"
                },
                "examples": [
                    {
                        "en": "The company is flying a kite to see if this plan provokes any interest.",
                        "vi": "Công ty đang thả diều để xem liệu kế hoạch này có gây ra bất kỳ sự quan tâm nào hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become able to fly and leave its nest",
                    "vi": "để có thể bay và rời khỏi tổ của nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to leave home and live somewhere else",
                    "vi": "rời khỏi nhà và sống ở một nơi khác"
                },
                "examples": [
                    {
                        "en": "Her children have flown the nest.",
                        "vi": "Các con của bà đã bay về tổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start saying or doing something that does not seem to be connected to what has gone before",
                    "vi": "đột nhiên bắt đầu nói hoặc làm điều gì đó dường như không liên quan đến những gì đã xảy ra trước đó"
                },
                "examples": [
                    {
                        "en": "He never sticks to the point but keeps going off at a tangent.",
                        "vi": "Anh ấy không bao giờ dính vào vấn đề mà tiếp tục đi theo hướng tiếp tuyến."
                    },
                    {
                        "en": "Laura’s mind went off at a tangent.",
                        "vi": "Tâm trí của Laura đi theo hướng tiếp tuyến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly become very angry",
                    "vi": "đột nhiên trở nên rất tức giận"
                },
                "examples": [
                    {
                        "en": "He seems to fly off the handle about the slightest thing these days.",
                        "vi": "Anh ấy dường như bay khỏi tay về những điều nhỏ nhặt nhất trong những ngày này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop existing; to disappear completely",
                    "vi": "ngừng tồn tại; biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "As soon as the kids arrived, order went out of the window.",
                        "vi": "Ngay sau khi những đứa trẻ đến, đơn đặt hàng đã bay ra khỏi cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall, especially as a result of not seeing something under your feet",
                    "vi": "ngã, đặc biệt là do không nhìn thấy thứ gì đó dưới chân bạn"
                },
                "examples": [
                    {
                        "en": "Someone's going to go flying if you don't pick up these toys.",
                        "vi": "Ai đó sẽ bay nếu bạn không nhặt những món đồ chơi này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to go away and stop annoying you or interfering",
                    "vi": "được sử dụng để nói với ai đó biến đi và ngừng làm phiền bạn hoặc can thiệp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to represent your country or organization",
                    "vi": "đại diện cho quốc gia hoặc tổ chức của bạn"
                },
                "examples": [
                    {
                        "en": "Our exporters keep the flag flying at international trade exhibitions.",
                        "vi": "Các nhà xuất khẩu của chúng tôi giữ lá cờ tung bay tại các triển lãm thương mại quốc tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attack somebody by hitting them or speaking angrily to them",
                    "vi": "tấn công ai đó bằng cách đánh họ hoặc nói một cách giận dữ với họ"
                },
                "examples": [
                    {
                        "en": "He let fly at me with his fist.",
                        "vi": "Anh ta dùng nắm đấm bay về phía tôi."
                    },
                    {
                        "en": "She let fly with a stream of abuse.",
                        "vi": "Cô ấy thả rông với một luồng lạm dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not believe something will ever happen",
                    "vi": "được sử dụng để cho thấy rằng bạn không tin rằng điều gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "‘With a bit of luck, we'll be finished by the end of the year.’ ‘Yes, and pigs might fly!’",
                        "vi": "Với một chút may mắn, chúng tôi sẽ hoàn thành vào cuối năm nay.' \"Vâng, và lợn có thể bay!\""
                    }
                ]
            },
            {
                "define": {
                    "en": "time seems to pass very quickly",
                    "vi": "thời gian dường như trôi qua rất nhanh"
                },
                "examples": [
                    {
                        "en": "How time flies! I've got to go now.",
                        "vi": "Thời gian trôi qua làm sao! Tôi phải đi bây giờ."
                    },
                    {
                        "en": "Time has flown since the holiday began.",
                        "vi": "Thời gian đã trôi đi kể từ khi kỳ nghỉ bắt đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "454a6800e000467b8e164d58f6e47322",
        "word": "call",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kɔːl/",
            "us": "/kɔːl/"
        },
        "nearby": [
            {
                "word": "caliphate",
                "pos": "noun"
            },
            {
                "word": "calisthenics",
                "pos": "noun"
            },
            {
                "word": "call",
                "pos": "verb"
            },
            {
                "word": "call",
                "pos": "noun"
            },
            {
                "word": "CALL",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody/something a particular name; to use a particular name or title when you are talking to somebody",
                    "vi": "để đặt cho ai đó / cái gì đó một cái tên cụ thể; sử dụng một tên hoặc chức danh cụ thể khi bạn đang nói chuyện với ai đó"
                },
                "examples": [
                    {
                        "en": "call somebody/something + noun They decided to call the baby Mark.",
                        "vi": "gọi ai đó / cái gì đó + danh từ Họ quyết định gọi em bé là Mark."
                    },
                    {
                        "en": "His name's Hiroshi but everyone calls him Hiro.",
                        "vi": "Tên anh ấy là Hiroshi nhưng mọi người gọi anh ấy là Hiro."
                    },
                    {
                        "en": "be called + noun What's their son called?",
                        "vi": "được gọi là + danh từ Con trai của họ được gọi là gì?"
                    },
                    {
                        "en": "I don't know anyone called Scott.",
                        "vi": "Tôi không biết ai tên là Scott."
                    },
                    {
                        "en": "I've forgotten what the firm he works for is called.",
                        "vi": "Tôi đã quên cái công ty mà anh ấy làm việc có tên là gì."
                    },
                    {
                        "en": "What's it called again? Oh yes, a router.",
                        "vi": "Nó được gọi là gì nữa? Ồ vâng, một bộ định tuyến."
                    },
                    {
                        "en": "to be commonly/often called something",
                        "vi": "thường được gọi là một cái gì đó"
                    },
                    {
                        "en": "This group of artists and poets is sometimes called the New York School.",
                        "vi": "Nhóm nghệ sĩ và nhà thơ này đôi khi được gọi là Trường phái New York."
                    },
                    {
                        "en": "call somebody/something after somebody/something They called their first daughter after her grandmother.",
                        "vi": "gọi ai đó / cái gì đó sau ai đó / cái gì đó Họ gọi con gái đầu lòng của họ sau khi bà của cô ấy."
                    },
                    {
                        "en": "The cheese is called after the town of the same name.",
                        "vi": "Pho mát được gọi theo tên của thị trấn cùng tên."
                    },
                    {
                        "en": "call somebody/something by something We call each other by our first names here.",
                        "vi": "gọi ai đó / cái gì đó bằng cái gì đó Chúng tôi gọi nhau bằng tên của chúng tôi ở đây."
                    },
                    {
                        "en": "The plant is called by different names in different parts of the country.",
                        "vi": "Cây được gọi bằng nhiều tên khác nhau ở các vùng khác nhau của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to phone somebody",
                    "vi": "gọi cho ai đó"
                },
                "examples": [
                    {
                        "en": "I'll call again later.",
                        "vi": "Tôi sẽ gọi lại sau."
                    },
                    {
                        "en": "I got a message to call home immediately.",
                        "vi": "Tôi nhận được một tin nhắn để gọi về nhà ngay lập tức."
                    },
                    {
                        "en": "call somebody/something to do something I called the office to tell them I'd be late.",
                        "vi": "gọi ai đó / cái gì đó để làm gì đó Tôi đã gọi đến văn phòng để nói với họ rằng tôi sẽ đến muộn."
                    },
                    {
                        "en": "call to do something People called to ask how they could help.",
                        "vi": "gọi để làm điều gì đó Mọi người được gọi để hỏi cách họ có thể giúp đỡ."
                    },
                    {
                        "en": "call somebody/something My brother called me from Spain last night.",
                        "vi": "gọi cho ai đó / cái gì đó Anh trai tôi đã gọi cho tôi từ Tây Ban Nha đêm qua."
                    },
                    {
                        "en": "Call us toll-free on this number.",
                        "vi": "Gọi cho chúng tôi theo số điện thoại miễn phí."
                    },
                    {
                        "en": "Call 0800 33344 for a free copy.",
                        "vi": "Gọi 0800 33344 để có bản sao miễn phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody/something to come quickly to a particular place by phoning",
                    "vi": "để yêu cầu ai đó / điều gì đó nhanh chóng đến một địa điểm cụ thể bằng cách gọi điện"
                },
                "examples": [
                    {
                        "en": "call somebody/something Someone called the police.",
                        "vi": "gọi ai đó / cái gì đó Ai đó đã gọi cảnh sát."
                    },
                    {
                        "en": "to call an ambulance/a doctor",
                        "vi": "gọi xe cấp cứu / bác sĩ"
                    },
                    {
                        "en": "call something for somebody I'll call a taxi for you.",
                        "vi": "Gọi cái gì đó cho ai đó Tôi sẽ gọi taxi cho bạn."
                    },
                    {
                        "en": "call somebody something I'll call you a taxi.",
                        "vi": "gọi cho ai đó cái gì đó tôi sẽ gọi cho bạn một chiếc taxi."
                    },
                    {
                        "en": "call somebody/something to something Fire crews were called to the building at 9 p.m.",
                        "vi": "gọi ai đó / cái gì đó với cái gì đó Đội cứu hỏa đã được gọi đến tòa nhà lúc 9 giờ tối"
                    },
                    {
                        "en": "The doctor has been called to an urgent case.",
                        "vi": "Bác sĩ đã được gọi đến một trường hợp khẩn cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe somebody/something in a particular way; to consider somebody/something to be something",
                    "vi": "để mô tả ai đó / cái gì đó theo một cách cụ thể; coi ai đó / cái gì đó là một cái gì đó"
                },
                "examples": [
                    {
                        "en": "call somebody/something + noun I wouldn't call German an easy language.",
                        "vi": "gọi ai đó / cái gì đó + danh từ Tôi sẽ không gọi tiếng Đức là một ngôn ngữ dễ hiểu."
                    },
                    {
                        "en": "Are you calling me a liar?",
                        "vi": "Bạn nói tôi là kẻ nói dối phải không?"
                    },
                    {
                        "en": "She now calls Southern California home (= she lives there).",
                        "vi": "Bây giờ cô ấy gọi Nam California là nhà (= cô ấy sống ở đó)."
                    },
                    {
                        "en": "He was in the front room, or the lounge or whatever you want to call it.",
                        "vi": "Anh ấy đang ở phòng trước, phòng khách hoặc bất cứ thứ gì bạn muốn gọi."
                    },
                    {
                        "en": "I make it ten pounds forty-three you owe me. Let's call it ten pounds.",
                        "vi": "Tôi làm cho nó mười bảng bốn mươi ba bạn nợ tôi. Hãy gọi nó là mười bảng Anh."
                    },
                    {
                        "en": "call yourself + noun They call themselves ‘The Gang’.",
                        "vi": "tự gọi mình + danh từ Họ tự gọi mình là 'The Gang'."
                    },
                    {
                        "en": "call somebody/something + adj. Would you call it blue or green?",
                        "vi": "gọi ai đó / cái gì đó + adj. Bạn sẽ gọi nó là xanh lam hay xanh lá cây?"
                    },
                    {
                        "en": "You could hardly call the show perfect, but it was successful.",
                        "vi": "Bạn khó có thể gọi buổi biểu diễn là hoàn hảo, nhưng nó đã thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to claim that you are a particular type of person, especially when other people question whether this is true",
                    "vi": "để khẳng định rằng bạn là một kiểu người cụ thể, đặc biệt khi người khác đặt câu hỏi liệu điều này có đúng không"
                },
                "examples": [
                    {
                        "en": "Call yourself a friend? So why won't you help me, then?",
                        "vi": "Tự gọi mình là bạn? Vậy tại sao bạn không giúp tôi?"
                    },
                    {
                        "en": "She's no right to call herself a feminist.",
                        "vi": "Cô ấy không có quyền gọi mình là một nhà nữ quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout or say something loudly to attract somebody’s attention",
                    "vi": "hét lên hoặc nói to điều gì đó để thu hút sự chú ý của ai đó"
                },
                "examples": [
                    {
                        "en": "I thought I heard somebody calling.",
                        "vi": "Tôi nghĩ rằng tôi đã nghe thấy ai đó đang gọi."
                    },
                    {
                        "en": "call (out) to somebody (for something) She called out to her father for help.",
                        "vi": "gọi (ra) với ai đó (vì điều gì đó) Cô ấy đã gọi bố cô ấy để được giúp đỡ."
                    },
                    {
                        "en": "call (out) to somebody to do something Someone called to him to wait.",
                        "vi": "gọi (ra) với ai đó để làm điều gì đó Ai đó đã gọi anh ta để đợi."
                    },
                    {
                        "en": "call something Did somebody call my name?",
                        "vi": "gọi cái gì đó Có ai gọi tên tôi không?"
                    },
                    {
                        "en": "call out (something) People in the audience called out requests.",
                        "vi": "gọi ra (một cái gì đó) Những người trong khán giả đã gọi ra yêu cầu."
                    },
                    {
                        "en": "+ speech ‘See you later!’ she called.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody to come by shouting or speaking loudly",
                    "vi": "yêu cầu ai đó đến bằng cách hét lên hoặc nói to"
                },
                "examples": [
                    {
                        "en": "call somebody + adv./prep. Will you call the kids in for lunch?",
                        "vi": "gọi ai đó + adv./prep. Bạn sẽ gọi bọn trẻ vào ăn trưa chứ?"
                    },
                    {
                        "en": "call (somebody) He heard me call him and came to the door.",
                        "vi": "gọi (ai đó) Anh ấy nghe thấy tôi gọi anh ấy và ra cửa."
                    },
                    {
                        "en": "Did you call?",
                        "vi": "Bạn đã gọi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to order somebody to come to a place",
                    "vi": "ra lệnh cho ai đó đến một nơi"
                },
                "examples": [
                    {
                        "en": "be called + adv./prep. Several candidates were called for a second interview.",
                        "vi": "được gọi là + adv./prep. Một số ứng viên đã được gọi cho cuộc phỏng vấn thứ hai."
                    },
                    {
                        "en": "The ambassador was called back to London by the prime minister.",
                        "vi": "Đại sứ đã được thủ tướng gọi trở lại London."
                    },
                    {
                        "en": "He felt called to the priesthood (= had a strong feeling that he must become a priest).",
                        "vi": "Anh ấy cảm thấy được gọi đến chức tư tế (= có cảm giác mạnh mẽ rằng anh ấy phải trở thành một linh mục)."
                    },
                    {
                        "en": "be called to do something You may be called to give evidence.",
                        "vi": "được gọi để làm điều gì đó Bạn có thể được gọi để cung cấp bằng chứng."
                    },
                    {
                        "en": "She was called to testify before a Senate subcommittee.",
                        "vi": "Cô đã được gọi để làm chứng trước một tiểu ban của Thượng viện."
                    },
                    {
                        "en": "call somebody The defence says it plans to call four witnesses.",
                        "vi": "gọi ai đó Bộ bào chữa cho biết họ có kế hoạch gọi bốn nhân chứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to order something to happen; to announce that something will happen",
                    "vi": "để ra lệnh cho một cái gì đó xảy ra; để thông báo rằng điều gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "call something to call a meeting/strike",
                        "vi": "gọi một cái gì đó để gọi một cuộc họp / đình công"
                    },
                    {
                        "en": "call something for… The prime minister has called an election for 8 June.",
                        "vi": "gọi một cái gì đó cho… Thủ tướng đã kêu gọi một cuộc bầu cử vào ngày 8 tháng Sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a short visit to a person or place",
                    "vi": "để thực hiện một chuyến thăm ngắn đến một người hoặc một địa điểm"
                },
                "examples": [
                    {
                        "en": "I'll call round and see you on my way home.",
                        "vi": "Tôi sẽ gọi lại và hẹn gặp bạn trên đường về nhà."
                    },
                    {
                        "en": "call on somebody Let's call on John.",
                        "vi": "kêu gọi ai đó Hãy kêu gọi John."
                    },
                    {
                        "en": "call to do something He was out when I called to see him.",
                        "vi": "gọi để làm gì đó Anh ấy đã ra ngoài khi tôi gọi để gặp anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the noise that is typical for it",
                    "vi": "để tạo ra tiếng ồn đặc trưng cho nó"
                },
                "examples": [
                    {
                        "en": "The cuckoo called across the trees to its mate.",
                        "vi": "Con chim cu gáy gọi bạn tình qua những tán cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to predict what the result of something will be",
                    "vi": "dự đoán kết quả của một cái gì đó sẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "call something It's a very open game that is very hard to call.",
                        "vi": "gọi một cái gì đó Đó là một trò chơi rất mở và rất khó để gọi."
                    },
                    {
                        "en": "to be difficult/impossible to call",
                        "vi": "khó / không thể gọi"
                    },
                    {
                        "en": "The result of this election is going to be too close to call.",
                        "vi": "Kết quả của cuộc bầu cử này sẽ quá gần để gọi."
                    },
                    {
                        "en": "call it for somebody Most media pundits called it for the Conservatives.",
                        "vi": "gọi nó cho ai đó Hầu hết các chuyên gia truyền thông gọi nó cho đảng Bảo thủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say which side of a coin you think will face upwards after it is thrown",
                    "vi": "để nói mặt nào của đồng xu mà bạn nghĩ sẽ hướng lên sau khi nó được ném"
                },
                "examples": [
                    {
                        "en": "to call heads/tails",
                        "vi": "để gọi đầu / đuôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout out the steps for people performing a square dance or country dance",
                    "vi": "hét lên các bước cho những người đang biểu diễn điệu nhảy vuông hoặc điệu nhảy đồng quê"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remember somebody/something",
                    "vi": "để nhớ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She couldn't call to mind where she had seen him before.",
                        "vi": "Cô không thể nhớ được nơi cô đã gặp anh trước đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remind you of somebody/something",
                    "vi": "để nhắc bạn về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The painting brings to mind some of Picasso's early works.",
                        "vi": "Bức tranh gợi nhớ đến một số tác phẩm đầu tiên của Picasso."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody to do what they are threatening to do, because you believe that they will not be cruel or brave enough to do it",
                    "vi": "nói với ai đó làm những gì họ đang đe dọa làm, bởi vì bạn tin rằng họ sẽ không đủ tàn nhẫn hoặc dũng cảm để làm điều đó"
                },
                "examples": [
                    {
                        "en": "She was tempted to call his bluff, hardly able to believe he’d carry out his threat.",
                        "vi": "Cô bị cám dỗ để gọi điện vô tội vạ cho anh ta, khó có thể tin rằng anh ta sẽ thực hiện lời đe dọa của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make use of something",
                    "vi": "để sử dụng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Chess is a game that calls into play all your powers of concentration.",
                        "vi": "Cờ vua là một trò chơi đòi hỏi bạn phải phát huy hết khả năng tập trung của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to doubt something or make others doubt something",
                    "vi": "nghi ngờ điều gì đó hoặc khiến người khác nghi ngờ điều gì đó"
                },
                "examples": [
                    {
                        "en": "His honesty has never been called into question.",
                        "vi": "Sự trung thực của anh ấy chưa bao giờ bị nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide or agree to stop doing something",
                    "vi": "để quyết định hoặc đồng ý ngừng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "After forty years in politics I think it's time for me to call it a day (= to retire).",
                        "vi": "Sau bốn mươi năm hoạt động chính trị, tôi nghĩ đã đến lúc tôi phải gọi đó là một ngày (= nghỉ hưu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to end a contest, argument, etc. because both sides seem equal",
                    "vi": "đồng ý kết thúc một cuộc tranh luận, tranh luận, v.v. vì cả hai bên đều có vẻ bình đẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to decide to stop doing something",
                    "vi": "quyết định ngừng làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to use offensive words about somebody",
                    "vi": "sử dụng những từ xúc phạm về ai đó"
                },
                "examples": [
                    {
                        "en": "Stop calling me names!",
                        "vi": "Đừng gọi tên tôi nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person who controls a situation",
                    "vi": "trở thành người kiểm soát tình huống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say exactly what you think without trying to hide your opinion",
                    "vi": "nói chính xác những gì bạn nghĩ mà không cố gắng che giấu ý kiến của bạn"
                },
                "examples": [
                    {
                        "en": "I believe in calling a spade a spade.",
                        "vi": "Tôi tin vào việc gọi một thuổng là một thuổng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or decide that it is time for something to finish",
                    "vi": "để nói hoặc quyết định rằng đã đến lúc điều gì đó phải kết thúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody explain a mistake, etc. because they are responsible for it",
                    "vi": "để khiến ai đó giải thích sai lầm, v.v. bởi vì họ phải chịu trách nhiệm về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to ask people in a meeting to be quiet so that the meeting can start or continue",
                    "vi": "yêu cầu mọi người trong cuộc họp im lặng để cuộc họp có thể bắt đầu hoặc tiếp tục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to order somebody to obey the formal rules of a meeting; to start a formal meeting",
                    "vi": "ra lệnh cho ai đó tuân theo các quy tắc chính thức của một cuộc họp; để bắt đầu một cuộc họp chính thức"
                },
                "examples": [
                    {
                        "en": "The argument continued until the chairman called them both to order.",
                        "vi": "Cuộc tranh cãi tiếp tục cho đến khi chủ tọa gọi cả hai ra trật tự."
                    },
                    {
                        "en": "The president brought the meeting to order at 9.15 a.m.",
                        "vi": "Chủ tịch đưa cuộc họp vào trật tự lúc 9 giờ 15 sáng."
                    },
                    {
                        "en": "As the meeting was brought to order, the councillor immediately stood and began to protest.",
                        "vi": "Khi cuộc họp đã đi vào nề nếp, ủy viên hội đồng ngay lập tức đứng dậy và bắt đầu phản đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person who provides the money for something can also control how it is spent",
                    "vi": "người cung cấp tiền cho một cái gì đó cũng có thể kiểm soát cách nó được chi tiêu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "called to see somebody in authority because you have done something wrong",
                    "vi": "được gọi để gặp ai đó có thẩm quyền bởi vì bạn đã làm sai điều gì đó"
                },
                "examples": [
                    {
                        "en": "I got called on the carpet for being late.",
                        "vi": "Tôi đã được gọi trên thảm vì đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not criticize somebody for a fault that you have yourself",
                    "vi": "đã từng nói rằng bạn không nên chỉ trích ai đó vì lỗi mà bản thân bạn mắc phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used instead of a name that you cannot remember",
                    "vi": "được sử dụng thay cho một cái tên mà bạn không thể nhớ"
                },
                "examples": [
                    {
                        "en": "She's just gone out with old what-d'you-call-him.",
                        "vi": "Cô ấy vừa đi chơi với cái-bạn-gọi-là-anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "cc048da6184745f2a316f2b69274d332",
        "word": "call",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kɔːl/",
            "us": "/kɔːl/"
        },
        "nearby": [
            {
                "word": "calisthenics",
                "pos": "noun"
            },
            {
                "word": "call",
                "pos": "verb"
            },
            {
                "word": "call",
                "pos": "noun"
            },
            {
                "word": "CALL",
                "pos": "abbreviation"
            },
            {
                "word": "James Callaghan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of speaking to somebody on the phone",
                    "vi": "hành động nói chuyện điện thoại với ai đó"
                },
                "examples": [
                    {
                        "en": "to get/receive a call from somebody",
                        "vi": "để nhận / nhận cuộc gọi từ ai đó"
                    },
                    {
                        "en": "to give somebody/make a call",
                        "vi": "để cho ai đó / thực hiện một cuộc gọi"
                    },
                    {
                        "en": "I'll take (= answer) the call upstairs.",
                        "vi": "Tôi sẽ nhận (= trả lời) cuộc gọi lên lầu."
                    },
                    {
                        "en": "I left a message but he didn't return my call.",
                        "vi": "Tôi đã nhắn lại nhưng anh ấy không gọi lại cho tôi."
                    },
                    {
                        "en": "a local/long-distance call",
                        "vi": "một cuộc gọi nội hạt / đường dài"
                    },
                    {
                        "en": "An emergency call was made at 9 p.m.",
                        "vi": "Một cuộc gọi khẩn cấp được thực hiện lúc 9 giờ tối"
                    },
                    {
                        "en": "They put out a distress call and were towed into harbour",
                        "vi": "Họ đưa ra một cuộc gọi khẩn cấp và được kéo vào bến cảng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a shout or loud sound made to attract attention",
                    "vi": "một tiếng hét hoặc âm thanh lớn được tạo ra để thu hút sự chú ý"
                },
                "examples": [
                    {
                        "en": "a call for help",
                        "vi": "một cuộc gọi để được giúp đỡ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a loud sound made by a bird or an animal",
                    "vi": "một âm thanh lớn của một con chim hoặc một con vật"
                },
                "examples": [
                    {
                        "en": "the distinctive call of the cuckoo",
                        "vi": "tiếng kêu đặc biệt của chim cu gáy"
                    },
                    {
                        "en": "The call of the barn owl is often described as a screech or scream.",
                        "vi": "Tiếng kêu của cú chuồng thường được mô tả như một tiếng rít hoặc la hét."
                    }
                ]
            },
            {
                "define": {
                    "en": "a request, an order or a demand for somebody to do something or to go somewhere",
                    "vi": "một yêu cầu, một mệnh lệnh hoặc một yêu cầu ai đó làm điều gì đó hoặc đi đâu đó"
                },
                "examples": [
                    {
                        "en": "The government has resisted the calls of the international community.",
                        "vi": "Chính phủ đã chống lại những lời kêu gọi của cộng đồng quốc tế."
                    },
                    {
                        "en": "call for something calls for national unity",
                        "vi": "kêu gọi một cái gì đó kêu gọi đoàn kết dân tộc"
                    },
                    {
                        "en": "This is the last call for passengers travelling on British Airways flight 199 to Rome.",
                        "vi": "Đây là cuộc gọi cuối cùng dành cho hành khách đi trên chuyến bay 199 của British Airways đến Rome."
                    },
                    {
                        "en": "call for somebody to do something calls for the minister to resign",
                        "vi": "kêu gọi ai đó làm điều gì đó kêu gọi bộ trưởng từ chức"
                    },
                    {
                        "en": "call to something (formal) The book is a call to action.",
                        "vi": "gọi một cái gì đó (trang trọng) Cuốn sách là một lời kêu gọi hành động."
                    },
                    {
                        "en": "The mosque was sounding the call to prayer.",
                        "vi": "Nhà thờ Hồi giáo đang vang lên lời kêu gọi cầu nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "no demand for something; no reason for somebody’s behaviour",
                    "vi": "không có nhu cầu về một cái gì đó; không có lý do cho hành vi của ai đó"
                },
                "examples": [
                    {
                        "en": "no call for something There isn't a lot of call for small specialist shops nowadays.",
                        "vi": "không có gì gọi cho một cái gì đó Không có nhiều cuộc gọi cho các cửa hàng chuyên gia nhỏ ngày nay."
                    },
                    {
                        "en": "no call (for somebody) to do something There was no call for you to go upsetting everyone like that.",
                        "vi": "Không có lời kêu gọi nào (cho ai đó) để làm điều gì đó Không có lời kêu gọi nào để bạn đi làm phiền mọi người như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a demand or pressure placed on somebody/something",
                    "vi": "một yêu cầu hoặc áp lực đặt lên ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She is a busy woman with many calls on her time.",
                        "vi": "Cô ấy là một phụ nữ bận rộn với nhiều cuộc gọi vào thời gian của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short visit to somebody’s house",
                    "vi": "một chuyến thăm ngắn đến nhà ai đó"
                },
                "examples": [
                    {
                        "en": "The doctor has five calls to make this morning.",
                        "vi": "Bác sĩ có năm cuộc gọi sáng nay."
                    },
                    {
                        "en": "I'm afraid this isn't a social call.",
                        "vi": "Tôi e rằng đây không phải là một cuộc gọi xã hội."
                    },
                    {
                        "en": "call on somebody (old-fashioned) to pay a call on an old friend",
                        "vi": "kêu gọi ai đó (kiểu cũ) trả tiền cho một người bạn cũ"
                    },
                    {
                        "en": "on a call The doctor is out on a call.",
                        "vi": "đang gọi điện Bác sĩ không có mặt trong cuộc gọi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong feeling of attraction that a particular place has for you",
                    "vi": "một cảm giác hấp dẫn mạnh mẽ mà một địa điểm cụ thể dành cho bạn"
                },
                "examples": [
                    {
                        "en": "the call of the sea/your homeland",
                        "vi": "tiếng gọi của biển / quê hương của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong feeling that you want to do something, especially a particular job",
                    "vi": "cảm giác mạnh mẽ rằng bạn muốn làm điều gì đó, đặc biệt là một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "He felt the call to the priesthood early on in his life.",
                        "vi": "Anh đã cảm nhận được sự kêu gọi đến với chức tư tế từ rất sớm trong cuộc đời mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decision",
                    "vi": "một quyết định"
                },
                "examples": [
                    {
                        "en": "It's your call!",
                        "vi": "Đó là cuộc gọi của bạn!"
                    },
                    {
                        "en": "a good/bad call",
                        "vi": "một cuộc gọi tốt / xấu"
                    },
                    {
                        "en": "That's a tough call.",
                        "vi": "Đó là một cuộc gọi khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decision made by the umpire",
                    "vi": "một quyết định do trọng tài đưa ra"
                },
                "examples": [
                    {
                        "en": "There was a disputed call in the second set.",
                        "vi": "Có một cuộc gọi tranh chấp trong set thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a player’s bid or turn to bid",
                    "vi": "giá thầu của một người chơi hoặc chuyển sang đặt giá thầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "always ready to obey somebody’s orders",
                    "vi": "luôn sẵn sàng tuân theo mệnh lệnh của ai đó"
                },
                "examples": [
                    {
                        "en": "She is constantly at the beck and call of her invalid father.",
                        "vi": "Cô liên tục bị người cha tàn nhẫn của mình gọi điện."
                    },
                    {
                        "en": "Don't expect to have me at your beck and call.",
                        "vi": "Đừng mong đợi có tôi ở bên và gọi cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a higher standard or level than is required for a job or task",
                    "vi": "đến một tiêu chuẩn hoặc cấp độ cao hơn mức cần thiết cho một công việc hoặc nhiệm vụ"
                },
                "examples": [
                    {
                        "en": "She went above and beyond the call of duty in her efforts to save his life.",
                        "vi": "Cô ấy đã vượt lên trên cả lời kêu gọi của nhiệm vụ trong nỗ lực cứu sống anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the need to go to the toilet",
                    "vi": "nhu cầu đi vệ sinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a strong request to fight in the army; a strong request to defend something or get ready for a fight about something",
                    "vi": "yêu cầu mạnh mẽ để chiến đấu trong quân đội; một yêu cầu mạnh mẽ để bảo vệ một cái gì đó hoặc sẵn sàng cho một cuộc chiến về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A leading environmentalist has issued a call to arms to companies and the public to do more about plastic waste.",
                        "vi": "Một nhà môi trường hàng đầu đã đưa ra lời kêu gọi các công ty và công chúng hành động nhiều hơn nữa đối với rác thải nhựa."
                    },
                    {
                        "en": "The president's speech was a call to arms to restore the vitality of the American dream.",
                        "vi": "Bài phát biểu của tổng thống là một lời kêu gọi vũ khí để khôi phục sức sống của giấc mơ Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you only just manage to avoid an accident, etc.",
                    "vi": "một tình huống mà bạn chỉ xoay sở để tránh tai nạn, v.v."
                },
                "examples": [
                    {
                        "en": "He had a close shave when his brakes failed on the mountain road.",
                        "vi": "Anh ta đã bị cạo sát khi không phanh được trên đường núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the most important person or thing competing for somebody’s time, money, etc. and to be dealt with or paid for before other people or things",
                    "vi": "trở thành người hoặc vật quan trọng nhất đang tranh giành thời gian, tiền bạc, v.v. của ai đó và được xử lý hoặc trả giá trước những người hoặc vật khác"
                },
                "examples": [
                    {
                        "en": "The children always have first call on her time.",
                        "vi": "Những đứa trẻ luôn có cuộc gọi đầu tiên vào thời gian của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "available for work if necessary, especially in an emergency",
                    "vi": "sẵn sàng làm việc nếu cần thiết, đặc biệt là trong trường hợp khẩn cấp"
                },
                "examples": [
                    {
                        "en": "I'll be on call the night of the party.",
                        "vi": "Tôi sẽ gọi vào đêm của bữa tiệc."
                    },
                    {
                        "en": "The doctor had been on call for 48 hours and was exhausted.",
                        "vi": "Bác sĩ đã gọi trong 48 giờ và đã kiệt sức."
                    }
                ]
            }
        ]
    },
    {
        "id": "3543d22305fb404da1e405dcda46e24d",
        "word": "dive",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/daɪv/",
            "us": "/daɪv/"
        },
        "nearby": [
            {
                "word": "Divali",
                "pos": "noun"
            },
            {
                "word": "divan",
                "pos": "noun"
            },
            {
                "word": "dive",
                "pos": "verb"
            },
            {
                "word": "dive",
                "pos": "noun"
            },
            {
                "word": "dive-bomb",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to jump into water with your head and arms going in first",
                    "vi": "nhảy xuống nước với đầu và cánh tay của bạn đi vào đầu tiên"
                },
                "examples": [
                    {
                        "en": "dive (from/off something) (into something) We dived into the river to cool off.",
                        "vi": "lặn (từ / tắt cái gì đó) (vào cái gì đó) Chúng tôi lặn xuống sông để tắm mát."
                    },
                    {
                        "en": "dive off something He dived off the bridge.",
                        "vi": "lặn khỏi cái gì đó Anh ấy đã lặn khỏi cây cầu."
                    },
                    {
                        "en": "dive in Sam walked to the deep end of the pool and dived in.",
                        "vi": "lặn trong Sam đi bộ đến cuối vực sâu và lặn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to swim underwater wearing breathing equipment, collecting or looking at things",
                    "vi": "bơi dưới nước đeo thiết bị thở, thu thập hoặc nhìn mọi thứ"
                },
                "examples": [
                    {
                        "en": "to dive for pearls",
                        "vi": "lặn tìm ngọc trai"
                    },
                    {
                        "en": "The main purpose of his holiday to Greece was to go diving.",
                        "vi": "Mục đích chính trong kỳ nghỉ của anh đến Hy Lạp là để đi lặn biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a deeper level underwater",
                    "vi": "để đi đến một tầng sâu hơn dưới nước"
                },
                "examples": [
                    {
                        "en": "The submarine dived to avoid being seen.",
                        "vi": "Chiếc tàu ngầm lặn xuống để tránh bị nhìn thấy."
                    },
                    {
                        "en": "The whale dived as the harpoon struck it.",
                        "vi": "Con cá voi lao xuống khi chiếc lao đâm vào nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go steeply down through the air",
                    "vi": "đi xuống dốc trong không khí"
                },
                "examples": [
                    {
                        "en": "The seagulls soared then dived.",
                        "vi": "Những con hải âu bay vút lên rồi lặn xuống."
                    },
                    {
                        "en": "The plane dived down to attack.",
                        "vi": "Máy bay lao xuống tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or jump quickly in a particular direction, especially to avoid something, to try to catch a ball, etc.",
                    "vi": "để di chuyển hoặc nhảy nhanh theo một hướng cụ thể, đặc biệt là để tránh thứ gì đó, cố gắng bắt bóng, v.v."
                },
                "examples": [
                    {
                        "en": "dive for something We heard an explosion and dived for cover (= got into a place where we would be protected).",
                        "vi": "lặn tìm thứ gì đó Chúng tôi nghe thấy một tiếng nổ và lặn tìm chỗ ẩn nấp (= vào một nơi mà chúng tôi sẽ được bảo vệ)."
                    },
                    {
                        "en": "The goalie dived for the ball, but missed it.",
                        "vi": "Thủ môn đã lao xuống tìm bóng nhưng lại trượt."
                    },
                    {
                        "en": "+ adv./prep. It started to rain so we dived into the nearest cafe.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "He dived headlong into the ditch.",
                        "vi": "Anh ta lao thẳng xuống mương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall deliberately when somebody tackles you",
                    "vi": "cố tình ngã khi ai đó xử lý bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall suddenly",
                    "vi": "đột ngột rơi"
                },
                "examples": [
                    {
                        "en": "The share price dived from 75p to an all-time low of 50p.",
                        "vi": "Giá cổ phiếu giảm từ 75p xuống mức thấp nhất mọi thời đại là 50p."
                    }
                ]
            }
        ]
    },
    {
        "id": "ccd5388151114080a879eecc472e51c6",
        "word": "lay",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/leɪ/",
            "us": "/leɪ/"
        },
        "nearby": [
            {
                "word": "laxative",
                "pos": "noun"
            },
            {
                "word": "laxity",
                "pos": "noun"
            },
            {
                "word": "lay",
                "pos": "verb"
            },
            {
                "word": "lay",
                "pos": "adjective"
            },
            {
                "word": "lay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put somebody/something in a particular position, especially when it is done gently or carefully",
                    "vi": "để đặt ai đó / cái gì đó vào một vị trí cụ thể, đặc biệt là khi nó được thực hiện một cách nhẹ nhàng hoặc cẩn thận"
                },
                "examples": [
                    {
                        "en": "lay somebody/something + adv./prep. He laid a hand on my arm.",
                        "vi": "lay ai đó / cái gì đó + adv./prep. Anh ấy đặt tay lên cánh tay tôi."
                    },
                    {
                        "en": "Relatives laid wreaths on the grave.",
                        "vi": "Người thân đặt vòng hoa trên mộ."
                    },
                    {
                        "en": "She laid the baby down gently on the bed.",
                        "vi": "Cô nhẹ nhàng đặt đứa bé xuống giường."
                    },
                    {
                        "en": "Red roses were laid at the memorial.",
                        "vi": "Hoa hồng đỏ đã được đặt tại đài tưởng niệm."
                    },
                    {
                        "en": "She noticed some paintings laid against the far wall.",
                        "vi": "Cô nhận thấy một số bức tranh được đặt trên bức tường phía xa."
                    },
                    {
                        "en": "The horse laid back its ears.",
                        "vi": "Con ngựa nằm ngửa tai."
                    },
                    {
                        "en": "lay something His mother visited the murder scene yesterday to lay flowers.",
                        "vi": "lay gì đó Mẹ nó đến thăm hiện trường giết người hôm qua để đặt hoa."
                    },
                    {
                        "en": "lay somebody/something + adj. The cloth should be laid flat.",
                        "vi": "lay ai đó / cái gì đó + adj. Vải phải được đặt phẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spread something on something; to cover something with a layer of something",
                    "vi": "để lan truyền một cái gì đó trên một cái gì đó; phủ một thứ gì đó bằng một lớp thứ gì đó"
                },
                "examples": [
                    {
                        "en": "lay A on/over B Before they started they laid newspaper on the floor.",
                        "vi": "đặt A trên / trên B Trước khi bắt đầu, họ đặt báo trên sàn."
                    },
                    {
                        "en": "The grapes were laid to dry on racks.",
                        "vi": "Nho đã được phơi khô trên giá."
                    },
                    {
                        "en": "They carefully laid a blanket over the body.",
                        "vi": "Họ cẩn thận đắp một tấm chăn lên người."
                    },
                    {
                        "en": "B is laid with A The floor was laid with newspaper.",
                        "vi": "B được lát bằng A Sàn được lát bằng giấy báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something down, especially on the floor, ready to be used",
                    "vi": "để đặt thứ gì đó xuống, đặc biệt là trên sàn, sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "to lay a carpet/cable/pipe",
                        "vi": "trải thảm / cáp / đường ống"
                    },
                    {
                        "en": "to lay tiles/bricks",
                        "vi": "xếp gạch / gạch"
                    },
                    {
                        "en": "The first high-speed track was laid between Paris and Lyons.",
                        "vi": "Đường cao tốc đầu tiên được đặt giữa Paris và Lyons."
                    },
                    {
                        "en": "Thirteen U-boats left their base to lay mines in British waters.",
                        "vi": "13 chiếc U-boat rời căn cứ để đặt mìn trong vùng biển của Anh."
                    },
                    {
                        "en": "The foundations of the house are being laid today.",
                        "vi": "Nền móng của ngôi nhà đang được đặt ngày hôm nay."
                    },
                    {
                        "en": "(figurative) A series of short-term goals lays the foundation for long-term success.",
                        "vi": "(nghĩa bóng) Một loạt các mục tiêu ngắn hạn đặt nền tảng cho thành công lâu dài."
                    },
                    {
                        "en": "(figurative) They had laid the groundwork for future development.",
                        "vi": "(nghĩa bóng) Họ đã đặt nền móng cho sự phát triển trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a bird, an insect, a fish, etc. lays eggs, it produces them from its body",
                    "vi": "Nếu một con chim, một con côn trùng, một con cá, v.v. đẻ trứng, nó sẽ sản sinh ra chúng từ cơ thể của nó"
                },
                "examples": [
                    {
                        "en": "The cuckoo lays its eggs in other birds' nests.",
                        "vi": "Chim cu gáy đẻ trứng vào tổ của các loài chim khác."
                    },
                    {
                        "en": "new-laid eggs",
                        "vi": "trứng mới đẻ"
                    },
                    {
                        "en": "The hens are not laying well (= not producing many eggs).",
                        "vi": "Gà mái đẻ không tốt (= không đẻ nhiều trứng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange knives, forks, plates, etc. on a table ready for a meal",
                    "vi": "sắp xếp dao, nĩa, đĩa, v.v. trên bàn sẵn sàng cho bữa ăn"
                },
                "examples": [
                    {
                        "en": "to lay the table",
                        "vi": "đặt bàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to present a proposal, some information, etc. to somebody for them to think about and decide on",
                    "vi": "trình bày một đề xuất, một số thông tin, v.v. cho ai đó để họ suy nghĩ và quyết định"
                },
                "examples": [
                    {
                        "en": "The bill was laid before Parliament.",
                        "vi": "Dự luật đã được đưa ra trước Quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody/something in a particular position or state, especially a difficult or unpleasant one",
                    "vi": "đặt ai đó / cái gì đó vào một vị trí hoặc trạng thái cụ thể, đặc biệt là một vị trí khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "to lay a responsibility/burden on somebody",
                        "vi": "đặt trách nhiệm / gánh nặng cho ai đó"
                    },
                    {
                        "en": "to lay somebody under an obligation to do something",
                        "vi": "yêu cầu ai đó có nghĩa vụ phải làm điều gì đó"
                    },
                    {
                        "en": "Failing to act now will merely lay the burden on future generations.",
                        "vi": "Không hành động ngay bây giờ sẽ chỉ tạo gánh nặng cho các thế hệ tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a noun to form a phrase that has the same meaning as the verb related to the noun",
                    "vi": "được sử dụng với một danh từ để tạo thành một cụm từ có cùng nghĩa với động từ liên quan đến danh từ."
                },
                "examples": [
                    {
                        "en": "to lay the blame on somebody (= to blame somebody)",
                        "vi": "đổ lỗi cho ai đó (= đổ lỗi cho ai đó)"
                    },
                    {
                        "en": "Our teacher lays great stress on good spelling (= stresses it strongly).",
                        "vi": "Giáo viên của chúng tôi rất căng thẳng về việc viết tốt chính tả (= nhấn mạnh điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare something in detail",
                    "vi": "để chuẩn bị một cái gì đó chi tiết"
                },
                "examples": [
                    {
                        "en": "Little did he know they had laid a trap for him.",
                        "vi": "Anh không hề biết rằng họ đã giăng một cái bẫy cho anh."
                    },
                    {
                        "en": "She began to lay her plans for her escape.",
                        "vi": "Cô bắt đầu lên kế hoạch cho cuộc chạy trốn của mình."
                    },
                    {
                        "en": "Bad weather can upset even the best-laid plans.",
                        "vi": "Thời tiết xấu có thể làm đảo lộn ngay cả những kế hoạch tốt nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have sex with somebody",
                    "vi": "làm tình với ai đó"
                },
                "examples": [
                    {
                        "en": "He went out hoping to get laid that night.",
                        "vi": "Anh ấy đã đi ra ngoài với hy vọng sẽ được nằm trong đêm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare a fire by arranging wood, sticks or coal",
                    "vi": "chuẩn bị nhóm lửa bằng cách sắp xếp gỗ, que hoặc than"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to bet money on something; to place a bet",
                    "vi": "đặt cược tiền vào một cái gì đó; đặt cược"
                },
                "examples": [
                    {
                        "en": "lay something to lay a bet",
                        "vi": "đặt một cái gì đó để đặt cược"
                    },
                    {
                        "en": "lay something on something She had laid $100 on the favourite.",
                        "vi": "đặt một cái gì đó trên một cái gì đó Cô ấy đã đặt 100 đô la cho cái yêu thích."
                    },
                    {
                        "en": "I think he’ll come, but I wouldn’t lay money on it.",
                        "vi": "Tôi nghĩ anh ấy sẽ đến, nhưng tôi sẽ không đặt tiền vào nó."
                    },
                    {
                        "en": "lay (somebody) something (that)… I’ll lay you any money you like (that) he won’t come.",
                        "vi": "lay (ai đó) cái gì đó (cái đó)… Tôi sẽ đưa cho bạn bất kỳ khoản tiền nào bạn thích (cái đó) anh ta sẽ không đến."
                    }
                ]
            }
        ]
    },
    {
        "id": "1cbe92248e144285b264df4ead7a0e3d",
        "word": "mate",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/meɪt/",
            "us": "/meɪt/"
        },
        "nearby": [
            {
                "word": "match with",
                "pos": "phrasal verb"
            },
            {
                "word": "matchwood",
                "pos": "noun"
            },
            {
                "word": "mate",
                "pos": "noun"
            },
            {
                "word": "mate",
                "pos": "verb"
            },
            {
                "word": "mater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a friend",
                    "vi": "một người bạn"
                },
                "examples": [
                    {
                        "en": "They've been best mates since school.",
                        "vi": "Họ đã là bạn tốt nhất kể từ khi đi học."
                    },
                    {
                        "en": "I was with a mate.",
                        "vi": "Tôi đã ở với một người bạn đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a friendly way of addressing somebody, especially between men",
                    "vi": "được sử dụng như một cách xưng hô thân thiện với ai đó, đặc biệt là giữa nam giới"
                },
                "examples": [
                    {
                        "en": "Sorry mate, you'll have to wait.",
                        "vi": "Xin lỗi người bạn đời, bạn sẽ phải đợi."
                    },
                    {
                        "en": "All right, mate?",
                        "vi": "Được không, anh bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person you share an activity or accommodation with",
                    "vi": "một người mà bạn chia sẻ hoạt động hoặc chỗ ở với"
                },
                "examples": [
                    {
                        "en": "workmates/teammates/playmates/classmates",
                        "vi": "đồng nghiệp / đồng đội / bạn cùng chơi / bạn cùng lớp"
                    },
                    {
                        "en": "my room-mate/flatmate",
                        "vi": "bạn cùng phòng / bạn cùng phòng của tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the sexual partner of a bird or animal",
                    "vi": "bạn tình của một con chim hoặc động vật"
                },
                "examples": [
                    {
                        "en": "A male bird sings to attract a mate.",
                        "vi": "Một con chim trống hót để thu hút bạn tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a husband, wife or other sexual partner",
                    "vi": "chồng, vợ hoặc bạn tình khác"
                },
                "examples": [
                    {
                        "en": "Many matchmaking sites compile lists of potential mates using basic information.",
                        "vi": "Nhiều trang web mai mối biên soạn danh sách bạn tình tiềm năng bằng cách sử dụng thông tin cơ bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to help a worker who has had training in a skill",
                    "vi": "một người có công việc là giúp đỡ một công nhân đã được đào tạo về kỹ năng"
                },
                "examples": [
                    {
                        "en": "a builder’s/plumber’s mate",
                        "vi": "bạn đời của thợ xây / thợ sửa ống nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer in a commercial ship below the rank of captain or master",
                    "vi": "một sĩ quan trên tàu thương mại dưới cấp bậc thuyền trưởng hoặc thuyền trưởng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a position in which one player cannot prevent their king (= the most important piece) being captured and therefore loses the game",
                    "vi": "vị trí trong đó một người chơi không thể ngăn vua của họ (= quân quan trọng nhất) bị bắt và do đó thua trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which somebody has been completely defeated",
                    "vi": "một tình huống mà ai đó đã hoàn toàn bị đánh bại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c63d076ba09a4557bc3e47aba52724b9",
        "word": "mate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/meɪt/",
            "us": "/meɪt/"
        },
        "nearby": [
            {
                "word": "matchwood",
                "pos": "noun"
            },
            {
                "word": "mate",
                "pos": "noun"
            },
            {
                "word": "mate",
                "pos": "verb"
            },
            {
                "word": "mater",
                "pos": "noun"
            },
            {
                "word": "material",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have sex in order to produce young",
                    "vi": "quan hệ tình dục để tạo ra trẻ"
                },
                "examples": [
                    {
                        "en": "Do foxes ever mate with dogs?",
                        "vi": "Cáo có bao giờ giao phối với chó không?"
                    },
                    {
                        "en": "After mating, the female kills the male.",
                        "vi": "Sau khi giao phối, con cái giết con đực."
                    },
                    {
                        "en": "Females that mate with several males are rare.",
                        "vi": "Con cái giao phối với một số con đực là rất hiếm."
                    },
                    {
                        "en": "the sexual signal from the adult female that tells the male she is ready to mate",
                        "vi": "tín hiệu tình dục từ con cái trưởng thành cho con đực biết rằng nó đã sẵn sàng giao phối"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put animals or birds together so that they will have sex and produce young",
                    "vi": "đặt các loài động vật hoặc chim lại với nhau để chúng giao hợp và sinh ra con non"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put your opponent in a position in which they cannot prevent their king (= the most important piece) being captured and therefore lose the game",
                    "vi": "đặt đối thủ của bạn vào một vị trí mà họ không thể ngăn cản vua của họ (= quân quan trọng nhất) bị bắt và do đó thua trò chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to defeat somebody completely",
                    "vi": "để đánh bại ai đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c019ae5878b14a098ffd9f5136ba5e3b",
        "word": "migrate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/maɪˈɡreɪt/",
            "us": "/ˈmaɪɡreɪt/"
        },
        "nearby": [
            {
                "word": "migrant",
                "pos": "noun"
            },
            {
                "word": "migrant",
                "pos": "adjective"
            },
            {
                "word": "migrate",
                "pos": "verb"
            },
            {
                "word": "migration",
                "pos": "noun"
            },
            {
                "word": "migratory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move from one part of the world to another according to the season",
                    "vi": "để di chuyển từ phần này sang phần khác của thế giới theo mùa"
                },
                "examples": [
                    {
                        "en": "Swallows migrate south in winter.",
                        "vi": "Chim én di cư về phía nam vào mùa đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move from one town, country, etc. to go and live and/or work in another",
                    "vi": "di chuyển từ một thị trấn, quốc gia, v.v. để đến sống và / hoặc làm việc ở một nơi khác"
                },
                "examples": [
                    {
                        "en": "Thousands were forced to migrate from rural to urban areas in search of work.",
                        "vi": "Hàng nghìn người buộc phải di cư từ nông thôn ra thành thị để tìm việc làm."
                    },
                    {
                        "en": "Several thousand years ago whole populations migrated to north-west Europe.",
                        "vi": "Vài nghìn năm trước, toàn bộ quần thể đã di cư đến Tây Bắc Châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move from one place to another",
                    "vi": "để di chuyển từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "The infected cells then migrate to other areas of the body.",
                        "vi": "Các tế bào bị nhiễm bệnh sau đó sẽ di chuyển đến các khu vực khác của cơ thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change, or cause somebody to change, from one computer system to another",
                    "vi": "để thay đổi hoặc khiến ai đó thay đổi từ hệ thống máy tính này sang hệ thống máy tính khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move programs or hardware from one computer system to another",
                    "vi": "để di chuyển chương trình hoặc phần cứng từ hệ thống máy tính này sang hệ thống máy tính khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2cf8d7d3850e4ce7a6fd8ed7f83e256b",
        "word": "breed",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/briːd/",
            "us": "/briːd/"
        },
        "nearby": [
            {
                "word": "breech birth",
                "pos": "noun"
            },
            {
                "word": "breeches",
                "pos": "noun"
            },
            {
                "word": "breed",
                "pos": "verb"
            },
            {
                "word": "breed",
                "pos": "noun"
            },
            {
                "word": "breeder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have sex and produce young",
                    "vi": "quan hệ tình dục và sản xuất trẻ"
                },
                "examples": [
                    {
                        "en": "Many animals breed only at certain times of the year.",
                        "vi": "Nhiều loài động vật chỉ sinh sản vào những thời điểm nhất định trong năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep animals or plants in order to produce young ones for a particular purpose",
                    "vi": "giữ động vật hoặc thực vật để tạo ra những con non cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "breed something (for/as something) The rabbits are bred for their long coats.",
                        "vi": "giống một cái gì đó (cho / như một cái gì đó) Những con thỏ được lai tạo để có bộ lông dài của chúng."
                    },
                    {
                        "en": "Greyhounds were originally bred as hunting dogs.",
                        "vi": "Greyhounds ban đầu được nuôi làm chó săn."
                    },
                    {
                        "en": "the first panda to be bred in captivity",
                        "vi": "gấu trúc đầu tiên được nuôi nhốt"
                    },
                    {
                        "en": "breed from something She's a lovely cat. Will you breed from her?",
                        "vi": "giống từ một cái gì đó Cô ấy là một con mèo đáng yêu. Bạn sẽ lai tạo từ cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the cause of something",
                    "vi": "là nguyên nhân của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Nothing breeds success like success.",
                        "vi": "Không có gì tạo ra thành công giống như thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to educate somebody in a particular way as they are growing up",
                    "vi": "để giáo dục ai đó theo một cách cụ thể khi họ đang lớn lên"
                },
                "examples": [
                    {
                        "en": "Fear of failure was bred into him at an early age.",
                        "vi": "Nỗi sợ thất bại đã được nuôi dưỡng trong anh ngay từ khi còn nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "born and having grown up in a particular place with a particular background and education",
                    "vi": "sinh ra và lớn lên ở một nơi cụ thể với nền tảng và nền giáo dục cụ thể"
                },
                "examples": [
                    {
                        "en": "He was born and bred in Boston.",
                        "vi": "Anh sinh ra và lớn lên ở Boston."
                    },
                    {
                        "en": "I'm a Londoner, born and bred.",
                        "vi": "Tôi là người London, sinh ra và lớn lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of babies in a short space of time",
                    "vi": "sinh nhiều con trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "These rodents breed like rabbits.",
                        "vi": "Những loài gặm nhấm này sinh sản giống như thỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "knowing somebody/something very well may cause you to lose respect for them/it",
                    "vi": "biết rất rõ ai đó / điều gì đó có thể khiến bạn mất đi sự tôn trọng đối với họ / điều đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6cc56a0aad654e4194e032e2f196d9ba",
        "word": "hatch",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/hætʃ/",
            "us": "/hætʃ/"
        },
        "nearby": [
            {
                "word": "hatband",
                "pos": "noun"
            },
            {
                "word": "hatbox",
                "pos": "noun"
            },
            {
                "word": "hatch",
                "pos": "verb"
            },
            {
                "word": "hatch",
                "pos": "noun"
            },
            {
                "word": "Hatchards",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come out of an egg",
                    "vi": "ra khỏi một quả trứng"
                },
                "examples": [
                    {
                        "en": "Ten chicks hatched (out) this morning.",
                        "vi": "Mười chú gà con đã nở (ra) sáng nay."
                    },
                    {
                        "en": "the newly hatched chicks",
                        "vi": "gà con mới nở"
                    }
                ]
            },
            {
                "define": {
                    "en": "to break open so that a young bird, fish, insect, etc. can come out",
                    "vi": "mở ra để chim non, cá, côn trùng, v.v. có thể chui ra"
                },
                "examples": [
                    {
                        "en": "The eggs are about to hatch.",
                        "vi": "Những quả trứng sắp nở."
                    },
                    {
                        "en": "How long do the eggs take to hatch?",
                        "vi": "Trứng mất bao lâu để nở?"
                    },
                    {
                        "en": "The butterfly's eggs soon hatch into larvae.",
                        "vi": "Trứng của bướm sớm nở thành ấu trùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a young bird, fish, insect, etc. come out of an egg",
                    "vi": "tạo ra một con chim non, cá, côn trùng, v.v. từ một quả trứng"
                },
                "examples": [
                    {
                        "en": "The female must find a warm place to hatch her eggs.",
                        "vi": "Con cái phải tìm một nơi ấm áp để ấp trứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a plan or an idea, especially in secret",
                    "vi": "để tạo ra một kế hoạch hoặc một ý tưởng, đặc biệt là trong bí mật"
                },
                "examples": [
                    {
                        "en": "Have you been hatching up a deal with her?",
                        "vi": "Bạn đã có một thỏa thuận với cô ấy?"
                    },
                    {
                        "en": "Rebel MPs are hatching a secret plot to oust the prime minister.",
                        "vi": "Các nghị sĩ phiến quân đang ấp ủ một âm mưu bí mật nhằm lật đổ thủ tướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should not be too confident that something will be successful, because something may still go wrong",
                    "vi": "bạn không nên quá tin tưởng rằng điều gì đó sẽ thành công, bởi vì có thể vẫn còn điều gì đó sai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0896997b762b4bb6a58a282bb72ad513",
        "word": "hop",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/hɒp/",
            "us": "/hɑːp/"
        },
        "nearby": [
            {
                "word": "Hooverville",
                "pos": "noun"
            },
            {
                "word": "hooves",
                "pos": "noun"
            },
            {
                "word": "hop",
                "pos": "verb"
            },
            {
                "word": "hop",
                "pos": "noun"
            },
            {
                "word": "hope",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move by jumping on one foot",
                    "vi": "di chuyển bằng cách nhảy bằng một chân"
                },
                "examples": [
                    {
                        "en": "I couldn't put my weight on my ankle and had to hop everywhere.",
                        "vi": "Tôi không thể đặt trọng lượng của mình lên mắt cá chân và phải nhảy khắp nơi."
                    },
                    {
                        "en": "kids hopping over puddles",
                        "vi": "trẻ em nhảy qua vũng nước"
                    },
                    {
                        "en": "He was hopping from foot to foot.",
                        "vi": "Anh ta nhảy từ chân này sang chân khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move by jumping with all or both feet together",
                    "vi": "di chuyển bằng cách nhảy bằng tất cả hoặc cả hai chân cùng nhau"
                },
                "examples": [
                    {
                        "en": "A robin was hopping around on the path.",
                        "vi": "Một con cướp đang nhảy xung quanh con đường."
                    },
                    {
                        "en": "The frog hopped towards him.",
                        "vi": "Con ếch nhảy về phía anh ta."
                    },
                    {
                        "en": "birds hopping around on the grass",
                        "vi": "chim bay lượn trên bãi cỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to go or move somewhere quickly and suddenly",
                    "vi": "để đi hoặc di chuyển đến một nơi nào đó một cách nhanh chóng và đột ngột"
                },
                "examples": [
                    {
                        "en": "Hop in, I'll drive you home.",
                        "vi": "Nhanh lên, tôi sẽ đưa bạn về nhà."
                    },
                    {
                        "en": "She hopped out of the car at the traffic lights.",
                        "vi": "Cô nhảy ra khỏi xe ở đèn giao thông."
                    },
                    {
                        "en": "to hop into/out of bed",
                        "vi": "nhảy vào / ra khỏi giường"
                    },
                    {
                        "en": "I hopped on the next train.",
                        "vi": "Tôi nhảy lên chuyến tàu tiếp theo."
                    },
                    {
                        "en": "We hopped over to Paris for the weekend.",
                        "vi": "Chúng tôi đã đến Paris vào cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get on a plane, bus, etc.",
                    "vi": "để lên máy bay, xe buýt, v.v."
                },
                "examples": [
                    {
                        "en": "I hopped a plane for New York.",
                        "vi": "Tôi đã đáp máy bay đến New York."
                    },
                    {
                        "en": "I dumped my bags at a motel and hopped a cab to the outskirts of town.",
                        "vi": "Tôi vứt túi ở một nhà nghỉ và bắt taxi đến ngoại ô thị trấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change from one activity or subject to another",
                    "vi": "để thay đổi từ hoạt động này hoặc chủ đề khác"
                },
                "examples": [
                    {
                        "en": "I like to hop from channel to channel when I watch TV.",
                        "vi": "Tôi thích nhảy từ kênh này sang kênh khác khi tôi xem TV."
                    },
                    {
                        "en": "She’s always hopping from one project to the next.",
                        "vi": "Cô ấy luôn nhảy từ dự án này sang dự án tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "usually used in orders to tell somebody to go away",
                    "vi": "thường được sử dụng để nói với ai đó biến đi"
                },
                "examples": [
                    {
                        "en": "Go on, hop it!",
                        "vi": "Tiếp tục, nhảy lên!"
                    },
                    {
                        "en": "He hopped it out of the window.",
                        "vi": "Anh ta ném nó ra khỏi cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to hurry and do something quickly",
                    "vi": "được sử dụng để nói với ai đó nhanh lên và làm điều gì đó nhanh chóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0e99e7e9f4574d82836a924291f4638c",
        "word": "hop",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/hɒp/",
            "us": "/hɑːp/"
        },
        "nearby": [
            {
                "word": "hooves",
                "pos": "noun"
            },
            {
                "word": "hop",
                "pos": "verb"
            },
            {
                "word": "hop",
                "pos": "noun"
            },
            {
                "word": "hope",
                "pos": "verb"
            },
            {
                "word": "Bob Hope",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short jump by a person on one foot",
                    "vi": "một người nhảy ngắn bằng một chân"
                },
                "examples": [
                    {
                        "en": "He crossed the hall with a hop, skip and a jump.",
                        "vi": "Anh ta băng qua hành lang bằng một cú nhảy lò cò, bỏ qua và nhảy."
                    },
                    {
                        "en": "She gave a little hop and a skip to keep up with his long strides.",
                        "vi": "Cô nhảy một chút và bỏ qua để theo kịp những bước tiến dài của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short jump by an animal or a bird with all or both feet together",
                    "vi": "một bước nhảy ngắn của một con vật hoặc một con chim bằng tất cả hoặc cả hai chân cùng nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short journey, especially by plane",
                    "vi": "một hành trình ngắn, đặc biệt là bằng máy bay"
                },
                "examples": [
                    {
                        "en": "It's only a short hop to Paris.",
                        "vi": "Chỉ mất một đoạn ngắn để đến Paris."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall climbing plant with green female flowers that are like cones in shape",
                    "vi": "cây leo cao có hoa cái màu xanh lục giống hình nón"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the green female flowers of the hop plant that have been dried, used for making beer",
                    "vi": "hoa cái màu xanh của cây hop đã được phơi khô dùng làm bia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a social event at which people dance in an informal way",
                    "vi": "một sự kiện xã hội mà tại đó mọi người khiêu vũ một cách thân mật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to surprise somebody by doing something when they are not expecting it and not ready for it",
                    "vi": "làm ai đó ngạc nhiên bằng cách làm điều gì đó khi họ không mong đợi và không sẵn sàng cho việc đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "803073faf67f46dd859c3581e5236d85",
        "word": "hover",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɒvə(r)/",
            "us": "/ˈhʌvər/"
        },
        "nearby": [
            {
                "word": "hove",
                "pos": "verb"
            },
            {
                "word": "hovel",
                "pos": "noun"
            },
            {
                "word": "hover",
                "pos": "verb"
            },
            {
                "word": "hoverboard",
                "pos": "noun"
            },
            {
                "word": "hovercraft",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay in the air in one place",
                    "vi": "ở trong không khí ở một nơi"
                },
                "examples": [
                    {
                        "en": "A hawk hovered over the hill.",
                        "vi": "Một con diều hâu bay lượn trên ngọn đồi."
                    },
                    {
                        "en": "A full moon hovered in the sky.",
                        "vi": "Một vầng trăng tròn lơ lửng trên bầu trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wait somewhere, especially near somebody, in a shy or uncertain manner",
                    "vi": "đợi ở một nơi nào đó, đặc biệt là gần ai đó, một cách nhút nhát hoặc không chắc chắn"
                },
                "examples": [
                    {
                        "en": "He hovered nervously in the doorway.",
                        "vi": "Anh lo lắng lơ lửng trên ngưỡng cửa."
                    },
                    {
                        "en": "He hovered over her, waiting for an answer.",
                        "vi": "Anh lướt qua cô, chờ đợi câu trả lời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay close to something, or to stay in an uncertain state",
                    "vi": "ở gần một cái gì đó hoặc ở trong trạng thái không chắc chắn"
                },
                "examples": [
                    {
                        "en": "Temperatures hovered around freezing.",
                        "vi": "Nhiệt độ quanh quẩn ở mức đóng băng."
                    },
                    {
                        "en": "He hovered on the edge of consciousness.",
                        "vi": "Anh lơ lửng trên rìa của ý thức."
                    },
                    {
                        "en": "A smile hovered on her lips.",
                        "vi": "Một nụ cười thoáng qua trên môi cô."
                    },
                    {
                        "en": "She was hovering between life and death.",
                        "vi": "Cô ấy đang lơ lửng giữa sự sống và cái chết."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ace621d045244c294dd35e85fb552e3",
        "word": "migration",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/maɪˈɡreɪʃn/",
            "us": "/maɪˈɡreɪʃn/"
        },
        "nearby": [
            {
                "word": "migrant",
                "pos": "adjective"
            },
            {
                "word": "migrate",
                "pos": "verb"
            },
            {
                "word": "migration",
                "pos": "noun"
            },
            {
                "word": "migratory",
                "pos": "adjective"
            },
            {
                "word": "mikado",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the movement every year of large numbers of birds or animals from one place to another",
                    "vi": "sự di chuyển hàng năm của một số lượng lớn các loài chim hoặc động vật từ nơi này sang nơi khác"
                },
                "examples": [
                    {
                        "en": "the seasonal migration of blue whales",
                        "vi": "cuộc di cư theo mùa của cá voi xanh"
                    },
                    {
                        "en": "the migration routes of birds",
                        "vi": "các con đường di cư của các loài chim"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of people to a new country or area in order to find work or better living conditions",
                    "vi": "sự di chuyển của mọi người đến một quốc gia hoặc khu vực mới để tìm việc làm hoặc điều kiện sống tốt hơn"
                },
                "examples": [
                    {
                        "en": "migration from rural to urban areas",
                        "vi": "di cư từ nông thôn ra thành thị"
                    },
                    {
                        "en": "It was one of the largest mass migrations in US history.",
                        "vi": "Đó là một trong những cuộc di cư hàng loạt lớn nhất trong lịch sử Hoa Kỳ."
                    },
                    {
                        "en": "Net migration— more people moving to the state than leaving—accounts for about two thirds of the population gain.",
                        "vi": "Di cư ròng— nhiều người chuyển đến tiểu bang hơn là rời đi — chiếm khoảng hai phần ba tổng dân số tăng thêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of moving programs, etc. from one computer system to another; the fact of changing from one computer system to another",
                    "vi": "hành động di chuyển các chương trình, v.v. từ hệ thống máy tính này sang hệ thống máy tính khác; thực tế là thay đổi từ hệ thống máy tính này sang hệ thống máy tính khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "519a2a3d794d4ca2bf4447865405335a",
        "word": "nest",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/nest/",
            "us": "/nest/"
        },
        "nearby": [
            {
                "word": "Nessie",
                "pos": ""
            },
            {
                "word": "nest",
                "pos": "noun"
            },
            {
                "word": "nest",
                "pos": "verb"
            },
            {
                "word": "nest box",
                "pos": "noun"
            },
            {
                "word": "nest egg",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make and use a nest",
                    "vi": "để làm và sử dụng tổ"
                },
                "examples": [
                    {
                        "en": "Thousands of seabirds are nesting on the cliffs.",
                        "vi": "Hàng nghìn con chim biển đang làm tổ trên các vách đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put types of information together, or inside each other, so that they form a single unit",
                    "vi": "để đặt các loại thông tin lại với nhau hoặc bên trong nhau, để chúng tạo thành một đơn vị duy nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0efeacf7fae24df98f4fb6054ab5781c",
        "word": "perch",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/pɜːtʃ/",
            "us": "/pɜːrtʃ/"
        },
        "nearby": [
            {
                "word": "perceptron",
                "pos": "noun"
            },
            {
                "word": "perceptual",
                "pos": "adjective"
            },
            {
                "word": "perch",
                "pos": "verb"
            },
            {
                "word": "perch",
                "pos": "noun"
            },
            {
                "word": "perchance",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to land and stay on a branch, etc.",
                    "vi": "hạ cánh và ở trên một nhánh, v.v."
                },
                "examples": [
                    {
                        "en": "A robin was perching on the fence.",
                        "vi": "Một con ngựa vằn đang đậu trên hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit or to make somebody sit on something, especially on the edge of it",
                    "vi": "để ngồi hoặc bắt ai đó ngồi trên một cái gì đó, đặc biệt là ở rìa của nó"
                },
                "examples": [
                    {
                        "en": "perch (on something) We perched on a couple of high stools at the bar.",
                        "vi": "perch (on something) Chúng tôi ngồi trên một vài chiếc ghế đẩu cao ở quầy bar."
                    },
                    {
                        "en": "perch somebody/yourself (on something) She perched herself on the edge of the bed.",
                        "vi": "perch somebody / yourself (on something) Cô ấy đậu mình trên mép giường."
                    },
                    {
                        "en": "My father used to perch me on the front of his bike.",
                        "vi": "Cha tôi thường đậu tôi trên đầu xe đạp của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be placed on the top or the edge of something",
                    "vi": "được đặt trên cùng hoặc cạnh của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. The hotel perched precariously on a steep hillside.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "be perched + adv./prep. The castle is perched high above the valley.",
                        "vi": "được đậu + adv./prep. Lâu đài nằm trên cao trên thung lũng."
                    }
                ]
            }
        ]
    },
    {
        "id": "88f18eae63bf4ee2bef76bb1745efa9a",
        "word": "prey",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/preɪ/",
            "us": "/preɪ/"
        },
        "nearby": [
            {
                "word": "pre-war",
                "pos": "adjective"
            },
            {
                "word": "pre-wash",
                "pos": "verb"
            },
            {
                "word": "prey",
                "pos": "noun"
            },
            {
                "word": "prey",
                "pos": "verb"
            },
            {
                "word": "prey on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an animal, a bird, etc. that is hunted, killed and eaten by another",
                    "vi": "một con vật, một con chim, v.v. bị săn, giết và ăn thịt bởi người khác"
                },
                "examples": [
                    {
                        "en": "The lion will often stalk its prey for hours.",
                        "vi": "Sư tử thường sẽ rình rập con mồi trong nhiều giờ."
                    },
                    {
                        "en": "birds of prey (= birds that kill for food)",
                        "vi": "chim săn mồi (= chim giết để làm thức ăn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is harmed or tricked by somebody, especially for dishonest purposes",
                    "vi": "một người bị ai đó làm hại hoặc lừa, đặc biệt là vì những mục đích không trung thực"
                },
                "examples": [
                    {
                        "en": "Elderly people are easy prey for dishonest salesmen.",
                        "vi": "Người cao tuổi dễ là miếng mồi ngon cho những kẻ bán hàng gian dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be killed and eaten by another animal or bird",
                    "vi": "bị giết và ăn thịt bởi động vật hoặc chim khác"
                },
                "examples": [
                    {
                        "en": "Many small birds and rodents fall prey to the domestic cat.",
                        "vi": "Nhiều loài chim nhỏ và động vật gặm nhấm trở thành con mồi của mèo nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be harmed or affected by something bad",
                    "vi": "bị tổn hại hoặc bị ảnh hưởng bởi một điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "Since the attack, she had fallen prey to irrational fears.",
                        "vi": "Kể từ cuộc tấn công, cô đã trở thành con mồi của những nỗi sợ hãi phi lý."
                    },
                    {
                        "en": "She knew she must not fall prey to his charm.",
                        "vi": "Cô biết mình không được sa vào sự quyến rũ của anh ta."
                    },
                    {
                        "en": "The new government has fallen prey to corruption and fraud.",
                        "vi": "Chính phủ mới đã trở thành con mồi của tham nhũng và gian lận."
                    }
                ]
            }
        ]
    },
    {
        "id": "03675434a475444abbb8c8171e8475b4",
        "word": "quack",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kwæk/",
            "us": "/kwæk/"
        },
        "nearby": [
            {
                "word": "qtr.",
                "pos": "abbreviation"
            },
            {
                "word": "qua",
                "pos": "preposition"
            },
            {
                "word": "quack",
                "pos": "noun"
            },
            {
                "word": "quack",
                "pos": "verb"
            },
            {
                "word": "quackery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the sound that a duck makes",
                    "vi": "tiếng vịt kêu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who dishonestly claims to have medical knowledge or skills",
                    "vi": "một người không trung thực tuyên bố có kiến thức hoặc kỹ năng y tế"
                },
                "examples": [
                    {
                        "en": "quack doctors",
                        "vi": "bác sĩ lang băm"
                    },
                    {
                        "en": "I've got a check-up with the quack (= the doctor) next week.",
                        "vi": "Tôi có một cuộc kiểm tra với lang băm (= bác sĩ) vào tuần tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "6931ed5816274a5cb3c0b4f33152936b",
        "word": "quack",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kwæk/",
            "us": "/kwæk/"
        },
        "nearby": [
            {
                "word": "qua",
                "pos": "preposition"
            },
            {
                "word": "quack",
                "pos": "noun"
            },
            {
                "word": "quack",
                "pos": "verb"
            },
            {
                "word": "quackery",
                "pos": "noun"
            },
            {
                "word": "quad",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a duck quacks, it makes the noise that is typical of ducks",
                    "vi": "khi vịt kêu vo ve, nó tạo ra tiếng ồn đặc trưng của vịt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43022c44edd442bf8b2c4ccde63c5290",
        "word": "soar",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/sɔː(r)/",
            "us": "/sɔːr/"
        },
        "nearby": [
            {
                "word": "soapsuds",
                "pos": "noun"
            },
            {
                "word": "soapy",
                "pos": "adjective"
            },
            {
                "word": "soar",
                "pos": "verb"
            },
            {
                "word": "soaraway",
                "pos": "adjective"
            },
            {
                "word": "sob",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the value, amount or level of something soars, it rises very quickly",
                    "vi": "nếu giá trị, số lượng hoặc mức độ của một thứ gì đó tăng vọt, nó sẽ tăng rất nhanh"
                },
                "examples": [
                    {
                        "en": "soaring costs/prices/temperatures",
                        "vi": "chi phí / giá cả / nhiệt độ tăng vọt"
                    },
                    {
                        "en": "Air pollution will soon soar above safety levels.",
                        "vi": "Ô nhiễm không khí sẽ sớm tăng cao trên mức an toàn."
                    },
                    {
                        "en": "Unemployment has soared to 18 per cent.",
                        "vi": "Tỷ lệ thất nghiệp đã tăng lên 18%."
                    }
                ]
            },
            {
                "define": {
                    "en": "to rise quickly and smoothly up into the air",
                    "vi": "bay lên nhanh chóng và thuận lợi trong không khí"
                },
                "examples": [
                    {
                        "en": "The rocket soared (up) into the air.",
                        "vi": "Tên lửa bay lên không trung."
                    },
                    {
                        "en": "(figurative) Her spirits soared (= she became very happy and excited).",
                        "vi": "(nghĩa bóng) Tinh thần của cô ấy tăng vọt (= cô ấy trở nên rất vui vẻ và phấn khích)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly very high in the air or remain high in the air",
                    "vi": "bay rất cao trong không trung hoặc ở trên cao"
                },
                "examples": [
                    {
                        "en": "an eagle soaring high above the cliffs",
                        "vi": "đại bàng bay lên cao trên vách đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very high or tall",
                    "vi": "rất cao hoặc cao"
                },
                "examples": [
                    {
                        "en": "soaring mountains",
                        "vi": "những ngọn núi cao vút"
                    },
                    {
                        "en": "The building soared above us.",
                        "vi": "Tòa nhà cao vút phía trên chúng tôi."
                    },
                    {
                        "en": "The cliffs soared upward.",
                        "vi": "Những vách đá cao vút lên trên."
                    }
                ]
            },
            {
                "define": {
                    "en": "when music soars, it becomes higher or louder",
                    "vi": "khi âm nhạc bay lên, nó trở nên cao hơn hoặc to hơn"
                },
                "examples": [
                    {
                        "en": "soaring strings",
                        "vi": "dây cao vút"
                    },
                    {
                        "en": "Her voice would soar over the orchestra with little effort.",
                        "vi": "Giọng của cô ấy sẽ bay lên khắp dàn nhạc mà không cần cố gắng nhiều."
                    }
                ]
            }
        ]
    },
    {
        "id": "ad03af410c744d78822d70ec3789e703",
        "word": "brood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bruːd/",
            "us": "/bruːd/"
        },
        "nearby": [
            {
                "word": "brooch",
                "pos": "noun"
            },
            {
                "word": "brood",
                "pos": "verb"
            },
            {
                "word": "brood",
                "pos": "noun"
            },
            {
                "word": "broodiness",
                "pos": "noun"
            },
            {
                "word": "brooding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the young birds or creatures that a mother produces at one time",
                    "vi": "tất cả những con chim non hoặc những sinh vật mà chim mẹ đẻ ra cùng một lúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large family of children",
                    "vi": "một gia đình lớn của trẻ em"
                },
                "examples": [
                    {
                        "en": "She grew up amidst a lively brood of brothers and sisters.",
                        "vi": "Cô lớn lên giữa một bầy anh chị em sôi nổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c66951d56d7a422db77cd677f026c00c",
        "word": "chirp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɜːp/",
            "us": "/tʃɜːrp/"
        },
        "nearby": [
            {
                "word": "chiropractic",
                "pos": "noun"
            },
            {
                "word": "chiropractor",
                "pos": "noun"
            },
            {
                "word": "chirp",
                "pos": "noun"
            },
            {
                "word": "chirp",
                "pos": "verb"
            },
            {
                "word": "chirpily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short high sound made by small birds and some insects",
                    "vi": "một âm thanh cao ngắn do chim nhỏ và một số côn trùng tạo ra"
                },
                "examples": [
                    {
                        "en": "the chirp of birds/crickets",
                        "vi": "tiếng chim kêu / dế mèn"
                    }
                ]
            }
        ]
    },
    {
        "id": "f463ae6edd27446fa4faa8d5fdd5bc0a",
        "word": "cluck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/klʌk/",
            "us": "/klʌk/"
        },
        "nearby": [
            {
                "word": "club together",
                "pos": "phrasal verb"
            },
            {
                "word": "cluck",
                "pos": "verb"
            },
            {
                "word": "cluck",
                "pos": "noun"
            },
            {
                "word": "clucky",
                "pos": "adjective"
            },
            {
                "word": "clue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the short low sounds that a chicken makes",
                    "vi": "những âm thanh ngắn mà một con gà tạo ra"
                },
                "examples": [
                    {
                        "en": "(figurative) a cluck of impatience/annoyance",
                        "vi": "(nghĩa bóng) một sự thiếu kiên nhẫn / khó chịu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d430eee974bd463dbb0c9fccf253562c",
        "word": "clutch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/klʌtʃ/",
            "us": "/klʌtʃ/"
        },
        "nearby": [
            {
                "word": "cluster bomb",
                "pos": "noun"
            },
            {
                "word": "clutch",
                "pos": "verb"
            },
            {
                "word": "clutch",
                "pos": "noun"
            },
            {
                "word": "clutch",
                "pos": "adjective"
            },
            {
                "word": "clutch at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pedal in a car or other vehicle that you press with your foot so that you can change gear",
                    "vi": "bàn đạp trên ô tô hoặc phương tiện khác mà bạn nhấn bằng chân để có thể chuyển số"
                },
                "examples": [
                    {
                        "en": "Put your foot on the clutch.",
                        "vi": "Đặt chân lên ly hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device in a machine that connects and disconnects working parts, especially the engine and the gears",
                    "vi": "một thiết bị trong máy kết nối và ngắt kết nối các bộ phận làm việc, đặc biệt là động cơ và bánh răng"
                },
                "examples": [
                    {
                        "en": "The car needs a new clutch.",
                        "vi": "Xe cần một ly hợp mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people, animals or things",
                    "vi": "một nhóm người, động vật hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "He's won a whole clutch of awards.",
                        "vi": "Anh ấy đã giành được rất nhiều giải thưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "power or control",
                    "vi": "quyền lực hoặc kiểm soát"
                },
                "examples": [
                    {
                        "en": "He managed to escape from their clutches.",
                        "vi": "Anh cố gắng thoát khỏi nanh vuốt của chúng."
                    },
                    {
                        "en": "in your clutches Now that she had him in her clutches, she wasn't going to let go.",
                        "vi": "trong vòng tay của bạn Bây giờ cô ấy đã có anh ấy trong vòng tay của mình, cô ấy sẽ không buông ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tight hold on somebody/something",
                    "vi": "giữ chặt ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She felt the sudden clutch of fear.",
                        "vi": "Cô cảm thấy sợ hãi đột ngột."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of eggs that a bird lays at one time; the young birds that come out of a group of eggs at the same time",
                    "vi": "một nhóm trứng mà một con chim đẻ cùng một lúc; những con chim non cùng lúc ra khỏi một nhóm trứng"
                },
                "examples": [
                    {
                        "en": "The female lays a clutch of about seven eggs, laying one egg each day.",
                        "vi": "Con cái đẻ một lứa khoảng bảy trứng, mỗi ngày đẻ một trứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small, flat bag that women carry in their hands, especially on formal occasions",
                    "vi": "một chiếc túi nhỏ, phẳng mà phụ nữ mang trên tay, đặc biệt là trong những dịp trang trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at a critical moment",
                    "vi": "vào một thời điểm quan trọng"
                },
                "examples": [
                    {
                        "en": "Why are some athletes able to perform in the clutch while others fail?",
                        "vi": "Tại sao một số vận động viên có thể thực hiện ly hợp trong khi những người khác không thành công?"
                    },
                    {
                        "en": "Bryan came through in the clutch when it was needed.",
                        "vi": "Bryan đến trong bộ ly hợp khi nó cần thiết."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f95501dcb93426e991748f385222be7",
        "word": "coo",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kuː/",
            "us": "/kuː/"
        },
        "nearby": [
            {
                "word": "convulsively",
                "pos": "adverb"
            },
            {
                "word": "coo",
                "pos": "noun"
            },
            {
                "word": "coo",
                "pos": "verb"
            },
            {
                "word": "coo",
                "pos": "exclamation"
            },
            {
                "word": "COO",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a dove or a pigeon coos, it makes a soft low sound",
                    "vi": "khi chim bồ câu hoặc chim bồ câu kêu, nó phát ra âm thanh nhỏ nhẹ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something in a soft quiet voice, especially to somebody you love",
                    "vi": "nói điều gì đó bằng một giọng nhẹ nhàng êm ái, đặc biệt là với người bạn yêu thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two people who are in love bill and coo, they kiss and speak in a loving way to each other",
                    "vi": "nếu hai người đang yêu và thủ thỉ, họ hôn và nói một cách yêu thương với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "00a3f593abd8427cacafce441add3d3a",
        "word": "flight",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/flaɪt/",
            "us": "/flaɪt/"
        },
        "nearby": [
            {
                "word": "flier",
                "pos": "noun"
            },
            {
                "word": "flies",
                "pos": "noun"
            },
            {
                "word": "flight",
                "pos": "noun"
            },
            {
                "word": "flight",
                "pos": "verb"
            },
            {
                "word": "flight attendant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a journey made by air, especially in a plane",
                    "vi": "một cuộc hành trình được thực hiện bằng đường hàng không, đặc biệt là trên máy bay"
                },
                "examples": [
                    {
                        "en": "a smooth/comfortable/bumpy flight",
                        "vi": "một chuyến bay suôn sẻ / thoải mái / gập ghềnh"
                    },
                    {
                        "en": "a domestic/an international flight",
                        "vi": "một chuyến bay nội địa / một chuyến bay quốc tế"
                    },
                    {
                        "en": "a transatlantic flight",
                        "vi": "một chuyến bay xuyên Đại Tây Dương"
                    },
                    {
                        "en": "The first prize is a return flight to Delhi.",
                        "vi": "Giải nhất là một chuyến bay khứ hồi đến Delhi."
                    },
                    {
                        "en": "China's first manned space flight",
                        "vi": "Chuyến bay không gian có người lái đầu tiên của Trung Quốc"
                    },
                    {
                        "en": "a hot-air balloon flight",
                        "vi": "một chuyến bay khinh khí cầu"
                    },
                    {
                        "en": "flight (from A) (to B) We met on a flight from London to Paris.",
                        "vi": "chuyến bay (từ A) (đến B) Chúng tôi đã gặp nhau trên chuyến bay từ London đến Paris."
                    },
                    {
                        "en": "It is vital that people get up and walk about if they are on a long-haul flight.",
                        "vi": "Điều quan trọng là mọi người phải đứng dậy và đi lại nếu họ đang trên một chuyến bay đường dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a plane making a particular journey",
                    "vi": "một chiếc máy bay thực hiện một hành trình cụ thể"
                },
                "examples": [
                    {
                        "en": "We're booked on the same flight.",
                        "vi": "Chúng tôi đã đặt trên cùng một chuyến bay."
                    },
                    {
                        "en": "If we leave now, I can catch the earlier flight.",
                        "vi": "Nếu chúng ta đi ngay bây giờ, tôi có thể bắt chuyến bay sớm hơn."
                    },
                    {
                        "en": "After a few phone calls he boarded a flight to Bangkok.",
                        "vi": "Sau một vài cuộc điện thoại, anh ấy đã lên chuyến bay đến Bangkok."
                    },
                    {
                        "en": "Flight BA 4793 is now boarding at Gate 17.",
                        "vi": "Chuyến bay BA 4793 hiện đang cất cánh tại Cổng 17."
                    },
                    {
                        "en": "They've cancelled my flight!",
                        "vi": "Họ đã hủy chuyến bay của tôi!"
                    },
                    {
                        "en": "flight (to A) (from B) At present there is no direct flight to Egypt from Namibia.",
                        "vi": "chuyến bay (đến A) (từ B) Hiện tại không có chuyến bay thẳng đến Ai Cập từ Namibia."
                    },
                    {
                        "en": "flight to A They took a commercial flight to Vicenza, Italy.",
                        "vi": "chuyến bay đến A Họ đáp chuyến bay thương mại đến Vicenza, Ý."
                    },
                    {
                        "en": "flight for A She took a flight for Los Angeles.",
                        "vi": "chuyến bay cho A Cô ấy đã đáp chuyến bay đến Los Angeles."
                    },
                    {
                        "en": "flight out of B I had an early morning flight out of Stockholm.",
                        "vi": "chuyến bay ra khỏi BI có một chuyến bay sáng sớm ra khỏi Stockholm."
                    },
                    {
                        "en": "flight between A and B All flights between New York and Washington have been cancelled due to fog.",
                        "vi": "chuyến bay giữa A và B Tất cả các chuyến bay giữa New York và Washington đã bị hủy do sương mù."
                    },
                    {
                        "en": "mercy/relief flights (= planes taking help to countries where there is a war)",
                        "vi": "chuyến bay thương xót / cứu trợ (= máy bay giúp đỡ các quốc gia có chiến tranh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of flying",
                    "vi": "hành động bay"
                },
                "examples": [
                    {
                        "en": "the age of supersonic flight",
                        "vi": "thời đại của chuyến bay siêu thanh"
                    },
                    {
                        "en": "in flight The bird is easily recognized in flight (= when it is flying) by the black band at the end of its tail.",
                        "vi": "trong chuyến bay Người ta dễ dàng nhận ra con chim đang bay (= khi nó đang bay) bởi dải đen ở cuối đuôi."
                    },
                    {
                        "en": "the stresses the body endures in space flight",
                        "vi": "căng thẳng mà cơ thể phải chịu đựng trong chuyến bay vũ trụ"
                    },
                    {
                        "en": "flight safety",
                        "vi": "hạ cánh an toàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement or direction of an object as it travels through the air",
                    "vi": "chuyển động hoặc hướng của một vật thể khi nó di chuyển trong không khí"
                },
                "examples": [
                    {
                        "en": "the flight of a ball",
                        "vi": "chuyến bay của một quả bóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of steps between two floors or levels",
                    "vi": "một loạt các bước giữa hai tầng hoặc các tầng"
                },
                "examples": [
                    {
                        "en": "She fell down a flight of stairs/steps and hurt her back.",
                        "vi": "Cô ấy bị ngã xuống cầu thang / bậc thang và bị thương ở lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of running away from a dangerous or difficult situation",
                    "vi": "hành động chạy trốn khỏi tình huống nguy hiểm hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "flight (of somebody) (from somebody/something) the flight of refugees from the advancing forces",
                        "vi": "chuyến bay (của ai đó) (từ ai đó / cái gì đó) chuyến bay của những người tị nạn khỏi các lực lượng tiến lên"
                    },
                    {
                        "en": "a flight from harsh reality",
                        "vi": "một chuyến bay khỏi thực tế khắc nghiệt"
                    },
                    {
                        "en": "in flight from something The main character is a journalist in flight from a failed marriage.",
                        "vi": "trong chuyến bay từ một cái gì đó Nhân vật chính là một nhà báo trong chuyến bay từ một cuộc hôn nhân thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "an idea or a statement that shows a lot of imagination but is not practical or sensible",
                    "vi": "một ý tưởng hoặc một tuyên bố thể hiện nhiều trí tưởng tượng nhưng không thực tế hoặc không hợp lý"
                },
                "examples": [
                    {
                        "en": "This idea was one of my wilder flights of fancy.",
                        "vi": "Ý tưởng này là một trong những chuyến bay hoang dã của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of birds or aircraft flying together",
                    "vi": "một nhóm chim hoặc máy bay bay cùng nhau"
                },
                "examples": [
                    {
                        "en": "a flight of geese",
                        "vi": "một chuyến bay của ngỗng"
                    },
                    {
                        "en": "They flew in two flights of three aircraft.",
                        "vi": "Họ đã bay trong hai chuyến bay của ba chiếc máy bay."
                    },
                    {
                        "en": "an aircraft of the Queen’s flight",
                        "vi": "một chiếc máy bay của chuyến bay của Nữ hoàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "among the best of a particular group",
                    "vi": "trong số những người giỏi nhất của một nhóm cụ thể"
                },
                "examples": [
                    {
                        "en": "This is the team’s first season back in the top flight for more than 60 years.",
                        "vi": "Đây là mùa giải đầu tiên của đội trở lại trong chuyến bay đỉnh cao trong hơn 60 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to run away",
                    "vi": "buộc ai đó bỏ chạy"
                },
                "examples": [
                    {
                        "en": "The enemy was quickly put to flight.",
                        "vi": "Kẻ thù nhanh chóng bị hạ gục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run away",
                    "vi": "bỏ chạy"
                },
                "examples": [
                    {
                        "en": "The gang took flight when they heard the police car.",
                        "vi": "Cả nhóm đã bay khi nghe thấy tiếng xe cảnh sát."
                    },
                    {
                        "en": "As soon as they detected the cheetah it took flight.",
                        "vi": "Ngay sau khi họ phát hiện ra con báo, nó đã bay."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2c5d4369b7e4a20a1246b8f044084c2",
        "word": "gaggle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæɡl/",
            "us": "/ˈɡæɡl/"
        },
        "nearby": [
            {
                "word": "gage",
                "pos": "verb"
            },
            {
                "word": "gagging order",
                "pos": "noun"
            },
            {
                "word": "gaggle",
                "pos": "noun"
            },
            {
                "word": "gag order",
                "pos": "noun"
            },
            {
                "word": "gag rule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of noisy people",
                    "vi": "một nhóm người ồn ào"
                },
                "examples": [
                    {
                        "en": "a gaggle of tourists/schoolchildren",
                        "vi": "một trò đùa của khách du lịch / học sinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of geese",
                    "vi": "một nhóm ngỗng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "89dbbd40e9d64302a662c6285c2947c3",
        "word": "hoot",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/huːt/",
            "us": "/huːt/"
        },
        "nearby": [
            {
                "word": "Hooray Henry",
                "pos": "noun"
            },
            {
                "word": "hooroo",
                "pos": "exclamation"
            },
            {
                "word": "hoot",
                "pos": "verb"
            },
            {
                "word": "hoot",
                "pos": "noun"
            },
            {
                "word": "hootenanny",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a loud noise",
                    "vi": "tạo ra một tiếng ồn lớn"
                },
                "examples": [
                    {
                        "en": "He had the audience hooting with laughter.",
                        "vi": "Anh ấy đã khiến khán giả cười sảng khoái."
                    },
                    {
                        "en": "Some people hooted in disgust.",
                        "vi": "Một số người kêu lên một cách bất bình."
                    },
                    {
                        "en": "The crowd hooted and cheered.",
                        "vi": "Đám đông hò reo và cổ vũ."
                    },
                    {
                        "en": "His friends all hooted with laughter.",
                        "vi": "Bạn bè của anh ấy đều cười sảng khoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a car horn hoots or you hoot or hoot the horn, the horn makes a loud noise",
                    "vi": "nếu còi xe kêu hoặc bạn bấm hoặc bấm còi, còi sẽ phát ra tiếng ồn lớn"
                },
                "examples": [
                    {
                        "en": "The car behind me hooted impatiently.",
                        "vi": "Chiếc xe phía sau tôi sốt ruột kêu lên."
                    },
                    {
                        "en": "hoot at somebody/something Why did he hoot at me?",
                        "vi": "hoot vào ai đó / cái gì đó Tại sao anh ta lại hoot vào tôi?"
                    },
                    {
                        "en": "hoot something Passing motorists hooted their horns.",
                        "vi": "hoot cái gì đó Những người đi xe máy bấm còi của họ."
                    },
                    {
                        "en": "The train hooted a warning (= the driver sounded the horn to warn people).",
                        "vi": "Xe lửa hú còi cảnh báo (= người lái xe bóp còi để cảnh báo mọi người)."
                    }
                ]
            },
            {
                "define": {
                    "en": "when an owl hoots, it makes a long calling sound",
                    "vi": "khi một con cú kêu, nó kêu một tiếng dài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5ce4ed5a1834419b8c697eeb151caef",
        "word": "hoot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/huːt/",
            "us": "/huːt/"
        },
        "nearby": [
            {
                "word": "hooroo",
                "pos": "exclamation"
            },
            {
                "word": "hoot",
                "pos": "verb"
            },
            {
                "word": "hoot",
                "pos": "noun"
            },
            {
                "word": "hootenanny",
                "pos": "noun"
            },
            {
                "word": "hooter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short loud laugh or shout",
                    "vi": "một tiếng cười lớn hoặc hét lên ngắn"
                },
                "examples": [
                    {
                        "en": "The suggestion was greeted by hoots of laughter.",
                        "vi": "Đề nghị đã được chào đón bằng rất nhiều tiếng cười."
                    },
                    {
                        "en": "He struggled through his speech while members of the audience interrupted with hoots and jeers.",
                        "vi": "Anh ấy phải vật lộn trong bài phát biểu của mình trong khi các thành viên của khán giả chen ngang với những tiếng hò reo và chế nhạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation or a person that you find very funny",
                    "vi": "một tình huống hoặc một người mà bạn thấy rất buồn cười"
                },
                "examples": [
                    {
                        "en": "You ought to meet her—she's a hoot!",
                        "vi": "Bạn nên gặp cô ấy — cô ấy là một người thích thú!"
                    },
                    {
                        "en": "The film was a real hoot!",
                        "vi": "Bộ phim đã thực sự là một hoot!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the loud sound made by the horn of a vehicle",
                    "vi": "âm thanh lớn của còi xe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the call of an owl",
                    "vi": "tiếng gọi của một con cú"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not to care at all",
                    "vi": "không quan tâm chút nào"
                },
                "examples": [
                    {
                        "en": "I don’t care two hoots about having money, as long as I’m happy.",
                        "vi": "Tôi không quan tâm đến việc có tiền, miễn là tôi hạnh phúc."
                    }
                ]
            }
        ]
    },
    {
        "id": "536ab87cbd0e49909f33334e6c0ca1cd",
        "word": "incubate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪŋkjubeɪt/",
            "us": "/ˈɪŋkjubeɪt/"
        },
        "nearby": [
            {
                "word": "in-crowd",
                "pos": "noun"
            },
            {
                "word": "incrustation",
                "pos": "noun"
            },
            {
                "word": "incubate",
                "pos": "verb"
            },
            {
                "word": "incubation",
                "pos": "noun"
            },
            {
                "word": "incubator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to sit on its eggs in order to keep them warm until they hatch",
                    "vi": "ngồi trên trứng của nó để giữ ấm cho đến khi chúng nở"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep cells, bacteria, etc. at a suitable temperature so that they develop",
                    "vi": "để giữ cho các tế bào, vi khuẩn, v.v. ở nhiệt độ thích hợp để chúng phát triển"
                },
                "examples": [
                    {
                        "en": "The samples were incubated at 80°C for three minutes.",
                        "vi": "Các mẫu được ủ ở 80 ° C trong ba phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a disease developing inside you before symptoms appear",
                    "vi": "có một căn bệnh phát triển bên trong bạn trước khi các triệu chứng xuất hiện"
                },
                "examples": [
                    {
                        "en": "The source of infection may be a person who is incubating an infectious disease.",
                        "vi": "Nguồn lây có thể là người đang ủ bệnh truyền nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop slowly without showing any signs",
                    "vi": "phát triển chậm mà không có bất kỳ dấu hiệu nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0dc553aa35f84ddcb857726f98099abb",
        "word": "peck",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pek/",
            "us": "/pek/"
        },
        "nearby": [
            {
                "word": "peccadillo",
                "pos": "noun"
            },
            {
                "word": "peccary",
                "pos": "noun"
            },
            {
                "word": "peck",
                "pos": "verb"
            },
            {
                "word": "Gregory Peck",
                "pos": ""
            },
            {
                "word": "peck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move the beak forward quickly and hit or bite something",
                    "vi": "để di chuyển mỏ về phía trước một cách nhanh chóng và đánh hoặc cắn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "peck (at something) A robin was pecking at crumbs on the ground.",
                        "vi": "peck (vào một cái gì đó) Một con ngựa đực đang mổ những mảnh vụn trên mặt đất."
                    },
                    {
                        "en": "Hens pecked around in the yard.",
                        "vi": "Gà mái mổ nhau ngoài sân."
                    },
                    {
                        "en": "peck something A bird had pecked a hole in the sack.",
                        "vi": "mổ một cái gì đó Một con chim đã mổ một lỗ trên bao tải."
                    },
                    {
                        "en": "peck something out Vultures had pecked out the dead goat's eyes.",
                        "vi": "mổ cái gì đó ra Kền kền đã mổ mắt con dê chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kiss somebody lightly and quickly",
                    "vi": "hôn ai đó thật nhẹ và thật nhanh"
                },
                "examples": [
                    {
                        "en": "peck somebody on something He pecked her on the cheek as he went out.",
                        "vi": "mổ ai đó trên một cái gì đó. Anh ấy mổ vào má cô ấy khi anh ấy đi ra ngoài."
                    },
                    {
                        "en": "peck something She pecked his cheek.",
                        "vi": "mổ cái gì đó Cô ấy mổ má anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the order of importance in relation to one another among the members of a group",
                    "vi": "thứ tự quan trọng trong mối quan hệ với nhau giữa các thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "New Zealand is at the top of the pecking order of rugby nations.",
                        "vi": "New Zealand là quốc gia đứng đầu bảng xếp hạng các quốc gia chơi bóng bầu dục."
                    },
                    {
                        "en": "to be first in the pecking order",
                        "vi": "đứng đầu trong thứ tự mổ"
                    }
                ]
            }
        ]
    },
    {
        "id": "2bbdeb64204048d9a05d446a1106306b",
        "word": "peck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pek/",
            "us": "/pek/"
        },
        "nearby": [
            {
                "word": "peck",
                "pos": "verb"
            },
            {
                "word": "Gregory Peck",
                "pos": ""
            },
            {
                "word": "peck",
                "pos": "noun"
            },
            {
                "word": "peck at",
                "pos": "phrasal verb"
            },
            {
                "word": "pecker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a quick kiss",
                    "vi": "một nụ hôn nhanh"
                },
                "examples": [
                    {
                        "en": "He gave her a friendly peck on the cheek.",
                        "vi": "Anh dành cho cô một nụ hôn thân thiện vào má."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of pecking somebody/something",
                    "vi": "một hành động mổ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The budgerigar gave a quick peck at the seed.",
                        "vi": "Bọ cánh cứng nhanh chóng mổ lấy hạt giống."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4af30b4afab491f9ad92a16faef3530",
        "word": "squawk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/skwɔːk/",
            "us": "/skwɔːk/"
        },
        "nearby": [
            {
                "word": "squat thrust",
                "pos": "noun"
            },
            {
                "word": "squaw",
                "pos": "noun"
            },
            {
                "word": "squawk",
                "pos": "verb"
            },
            {
                "word": "squawk",
                "pos": "noun"
            },
            {
                "word": "squeak",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a loud sharp sound",
                    "vi": "để tạo ra một âm thanh rõ ràng"
                },
                "examples": [
                    {
                        "en": "The parrot squawked and flew away.",
                        "vi": "Con vẹt kêu lên và bay đi."
                    },
                    {
                        "en": "In the corner of the room a hen was squawking in a wooden cage.",
                        "vi": "Trong góc phòng, một con gà mái đang ngồi chồm hổm trong lồng gỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak or make a noise in a loud, sharp voice because you are angry, surprised, etc.",
                    "vi": "nói hoặc gây ồn ào với giọng to và rõ ràng vì bạn đang tức giận, ngạc nhiên, v.v."
                },
                "examples": [
                    {
                        "en": "‘You did what?!’ she squawked.",
                        "vi": "Bạn đã làm gì?!' cô ấy cáu kỉnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "b8d5df16995c47f09b7574ce3edac9c1",
        "word": "squawk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skwɔːk/",
            "us": "/skwɔːk/"
        },
        "nearby": [
            {
                "word": "squaw",
                "pos": "noun"
            },
            {
                "word": "squawk",
                "pos": "verb"
            },
            {
                "word": "squawk",
                "pos": "noun"
            },
            {
                "word": "squeak",
                "pos": "verb"
            },
            {
                "word": "squeak",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a loud sharp sound made by a bird",
                    "vi": "một tiếng chim kêu to rõ ràng"
                },
                "examples": [
                    {
                        "en": "The bird gave a startled squawk.",
                        "vi": "Con chim giật mình kêu lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "words or sounds made in a loud, sharp voice because you are angry, surprised, etc.",
                    "vi": "từ hoặc âm thanh được tạo ra bằng giọng nói to, rõ ràng vì bạn đang tức giận, ngạc nhiên, v.v."
                },
                "examples": [
                    {
                        "en": "a squawk of protest",
                        "vi": "một cuộc phản đối"
                    }
                ]
            }
        ]
    },
    {
        "id": "a4d6fd407b814e1da5c59837468179e8",
        "word": "tweet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/twiːt/",
            "us": "/twiːt/"
        },
        "nearby": [
            {
                "word": "tweener",
                "pos": "noun"
            },
            {
                "word": "tweeps",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "verb"
            },
            {
                "word": "tweetable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a message sent using the Twitter social media service",
                    "vi": "một tin nhắn được gửi bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "He started posting tweets via his cell phone to keep friends and family updated on his progress.",
                        "vi": "Anh ấy bắt đầu đăng các dòng tweet qua điện thoại di động của mình để cập nhật cho bạn bè và gia đình về sự tiến bộ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the short, high sound made by a small bird",
                    "vi": "âm thanh cao ngắn của một con chim nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e12f4636d7d343b081e449ff45d4ec2c",
        "word": "tweet",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/twiːt/",
            "us": "/twiːt/"
        },
        "nearby": [
            {
                "word": "tweeps",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "noun"
            },
            {
                "word": "tweet",
                "pos": "verb"
            },
            {
                "word": "tweetable",
                "pos": "adjective"
            },
            {
                "word": "tweeter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send a message or picture using the Twitter social media service",
                    "vi": "để gửi tin nhắn hoặc hình ảnh bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "tweet about something She's always tweeting about environmental issues.",
                        "vi": "tweet về điều gì đó Cô ấy luôn tweet về các vấn đề môi trường."
                    },
                    {
                        "en": "tweet something He tweeted a picture of himself with fans at the rally.",
                        "vi": "tweet gì đó Anh ấy đã tweet một bức ảnh của mình với người hâm mộ tại cuộc biểu tình."
                    }
                ]
            },
            {
                "define": {
                    "en": "when birds tweet, they make a series of short, high sounds",
                    "vi": "khi chim tweet, chúng tạo ra một loạt âm thanh ngắn, cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7bcc0fff748f40a38915490030cb289a",
        "word": "twitter",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtwɪtə(r)/",
            "us": "/ˈtwɪtər/"
        },
        "nearby": [
            {
                "word": "twitcher",
                "pos": "noun"
            },
            {
                "word": "twitchy",
                "pos": "adjective"
            },
            {
                "word": "twitter",
                "pos": "verb"
            },
            {
                "word": "twitter",
                "pos": "noun"
            },
            {
                "word": "Twitter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when birds twitter, they make a series of short, high sounds",
                    "vi": "khi chim twitter, chúng tạo ra một loạt âm thanh ngắn, cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk quickly in a high excited voice, especially about something that is not very important",
                    "vi": "nói nhanh bằng một giọng hào hứng, đặc biệt là về một thứ không quan trọng lắm"
                },
                "examples": [
                    {
                        "en": "twitter (on) (about somebody/something) Perry was always twittering on about something or other.",
                        "vi": "twitter (về) (về ai đó / cái gì đó) Perry luôn luôn twittering về cái gì đó hay cái khác."
                    },
                    {
                        "en": "+ speech ‘Oh, you are too kind,’ twittered Mrs Bennet.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to send a message or picture using the Twitter social media service",
                    "vi": "để gửi tin nhắn hoặc hình ảnh bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": [
                    {
                        "en": "Some members of Congress twittered through the President’s big speech.",
                        "vi": "Một số thành viên của Quốc hội đã xôn xao trong bài phát biểu lớn của Tổng thống."
                    }
                ]
            }
        ]
    },
    {
        "id": "add6a57c18ae4354886cc1bf6ad2abb1",
        "word": "twitter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtwɪtə(r)/",
            "us": "/ˈtwɪtər/"
        },
        "nearby": [
            {
                "word": "twitchy",
                "pos": "adjective"
            },
            {
                "word": "twitter",
                "pos": "verb"
            },
            {
                "word": "twitter",
                "pos": "noun"
            },
            {
                "word": "Twitter",
                "pos": "noun"
            },
            {
                "word": "Twitterati",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of short, high sounds that birds make",
                    "vi": "một loạt các âm thanh ngắn, cao mà các loài chim tạo ra"
                },
                "examples": [
                    {
                        "en": "the twitter of starlings",
                        "vi": "twitter của chim sáo đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of nervous excitement",
                    "vi": "trạng thái hồi hộp phấn khích"
                },
                "examples": [
                    {
                        "en": "She had been all of a twitter since she heard the good news that morning.",
                        "vi": "Cô ấy đã trở thành một twitter kể từ khi cô ấy nghe tin tốt lành vào sáng hôm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a message sent using the Twitter social media service",
                    "vi": "một tin nhắn được gửi bằng dịch vụ mạng xã hội Twitter"
                },
                "examples": []
            }
        ]
    }
]