[
    {
        "id": "a2ff368b3fbe412f960dddae5593e123",
        "word": "difficult",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈdɪfɪkəlt/",
            "us": "/ˈdɪfɪkəlt/"
        },
        "nearby": [
            {
                "word": "differentiation",
                "pos": "noun"
            },
            {
                "word": "differently",
                "pos": "adverb"
            },
            {
                "word": "difficult",
                "pos": "adjective"
            },
            {
                "word": "difficulty",
                "pos": "noun"
            },
            {
                "word": "diffidence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not easy; needing effort or skill to do or to understand",
                    "vi": "không dễ; cần nỗ lực hoặc kỹ năng để làm hoặc để hiểu"
                },
                "examples": [
                    {
                        "en": "The competition judges were given a very difficult task.",
                        "vi": "Các giám khảo cuộc thi đã được giao một nhiệm vụ rất khó khăn."
                    },
                    {
                        "en": "a difficult decision/question",
                        "vi": "một quyết định / câu hỏi khó"
                    },
                    {
                        "en": "difficult for somebody Asking for help is extremely difficult for some people.",
                        "vi": "khó khăn đối với một số người Yêu cầu giúp đỡ là điều cực kỳ khó khăn đối với một số người."
                    },
                    {
                        "en": "it is difficult to do something It's really difficult to read your writing.",
                        "vi": "rất khó để làm điều gì đó Thực sự rất khó để đọc bài viết của bạn."
                    },
                    {
                        "en": "something is difficult to do Your writing is really difficult to read.",
                        "vi": "một cái gì đó khó thực hiện Bài viết của bạn thực sự rất khó đọc."
                    },
                    {
                        "en": "It is difficult to imagine a woman in the 1950s behaving like this.",
                        "vi": "Khó có thể tưởng tượng một phụ nữ ở thập niên 1950 lại hành xử như thế này."
                    },
                    {
                        "en": "She finds it very difficult to get up early.",
                        "vi": "Cô ấy cảm thấy rất khó khăn để dậy sớm."
                    },
                    {
                        "en": "it is difficult for somebody to do something It's difficult for them to get here much before seven.",
                        "vi": "rất khó để ai đó làm được điều gì đó Rất khó để họ đến được đây trước bảy giờ."
                    },
                    {
                        "en": "It has become increasingly difficult for young people to buy a house.",
                        "vi": "Việc mua nhà ngày càng trở nên khó khăn đối với những người trẻ tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of problems; causing a lot of trouble",
                    "vi": "đầy rẫy các vấn đề; gây ra rất nhiều rắc rối"
                },
                "examples": [
                    {
                        "en": "I found myself in a difficult situation.",
                        "vi": "Tôi thấy mình đang ở trong một tình huống khó khăn."
                    },
                    {
                        "en": "difficult conditions/circumstances",
                        "vi": "điều kiện / hoàn cảnh khó khăn"
                    },
                    {
                        "en": "I'd had a difficult time and needed a break.",
                        "vi": "Tôi đã có một khoảng thời gian khó khăn và cần được nghỉ ngơi."
                    },
                    {
                        "en": "a difficult year/month",
                        "vi": "một năm / tháng khó khăn"
                    },
                    {
                        "en": "My boss is making life very difficult for me.",
                        "vi": "Sếp của tôi đang làm cho cuộc sống của tôi rất khó khăn."
                    },
                    {
                        "en": "13 is a difficult age.",
                        "vi": "13 tuổi là một độ tuổi khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easy to please; not helpful",
                    "vi": "không dễ hài lòng; không hữu dụng"
                },
                "examples": [
                    {
                        "en": "a difficult child/customer/boss",
                        "vi": "một đứa trẻ / khách hàng / ông chủ khó tính"
                    },
                    {
                        "en": "Don't pay any attention to her—she's just being difficult.",
                        "vi": "Đừng để ý đến cô ấy - cô ấy chỉ đang tỏ ra khó tính."
                    },
                    {
                        "en": "The singer has a difficult reputation.",
                        "vi": "Ca sĩ có tiếng khó tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            }
        ]
    },
    {
        "id": "789e2e4d079649bcbce509a2ac86f9c8",
        "word": "problem",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈprɒbləm/",
            "us": "/ˈprɑːbləm/"
        },
        "nearby": [
            {
                "word": "probiotic",
                "pos": "adjective"
            },
            {
                "word": "probity",
                "pos": "noun"
            },
            {
                "word": "problem",
                "pos": "noun"
            },
            {
                "word": "problem",
                "pos": "adjective"
            },
            {
                "word": "problematic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is difficult to deal with or to understand",
                    "vi": "một điều khó giải quyết hoặc khó hiểu"
                },
                "examples": [
                    {
                        "en": "big/serious/major problems",
                        "vi": "vấn đề lớn / nghiêm trọng / lớn"
                    },
                    {
                        "en": "She has a lot of health problems.",
                        "vi": "Cô ấy gặp rất nhiều vấn đề về sức khỏe."
                    },
                    {
                        "en": "financial/social/technical problems",
                        "vi": "vấn đề tài chính / xã hội / kỹ thuật"
                    },
                    {
                        "en": "Let me know if you have any problems.",
                        "vi": "Hãy cho tôi biết nếu bạn có bất kỳ vấn đề."
                    },
                    {
                        "en": "The government must address the problem of child poverty.",
                        "vi": "Chính phủ phải giải quyết vấn đề trẻ em nghèo."
                    },
                    {
                        "en": "We cannot tackle this problem effectively on our own.",
                        "vi": "Chúng ta không thể tự mình giải quyết vấn đề này một cách hiệu quả."
                    },
                    {
                        "en": "We are dealing with a serious problem here.",
                        "vi": "Chúng tôi đang giải quyết một vấn đề nghiêm trọng ở đây."
                    },
                    {
                        "en": "Money isn't going to solve the problem.",
                        "vi": "Tiền sẽ không giải quyết được vấn đề."
                    },
                    {
                        "en": "(especially North American English) to fix a problem",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để khắc phục sự cố"
                    },
                    {
                        "en": "If he chooses Mary it's bound to cause problems.",
                        "vi": "Nếu anh ta chọn Mary, điều đó chắc chắn sẽ gây ra vấn đề."
                    },
                    {
                        "en": "to pose/create a problem",
                        "vi": "đặt ra / tạo ra một vấn đề"
                    },
                    {
                        "en": "The problem first arose in 2018.",
                        "vi": "Vấn đề lần đầu tiên phát sinh vào năm 2018."
                    },
                    {
                        "en": "problem with something There is a problem with this argument.",
                        "vi": "vấn đề với một cái gì đó Có một vấn đề với đối số này."
                    },
                    {
                        "en": "problem of something the problem of drug abuse",
                        "vi": "vấn đề gì đó vấn đề lạm dụng ma túy"
                    },
                    {
                        "en": "problem of doing something Most students face the problem of funding themselves while they are studying.",
                        "vi": "vấn đề của việc làm gì đó Hầu hết sinh viên phải đối mặt với vấn đề kinh phí của chính họ trong khi họ đang học."
                    },
                    {
                        "en": "problem for somebody Unemployment is a very real problem for graduates now.",
                        "vi": "vấn đề đối với ai đó Thất nghiệp là một vấn đề rất thực tế đối với sinh viên mới tốt nghiệp hiện nay."
                    },
                    {
                        "en": "It’s a nice table! The only problem is (that) it’s too big for our room.",
                        "vi": "Đó là một cái bàn đẹp! Vấn đề duy nhất là (đó) nó quá lớn đối với căn phòng của chúng tôi."
                    },
                    {
                        "en": "Part of the problem is the shape of the room.",
                        "vi": "Một phần của vấn đề là hình dạng của căn phòng."
                    },
                    {
                        "en": "Stop worrying about their marriage—it isn't your problem.",
                        "vi": "Đừng lo lắng về cuộc hôn nhân của họ - đó không phải là vấn đề của bạn."
                    },
                    {
                        "en": "There's no history of heart problems (= disease connected with the heart) in our family.",
                        "vi": "Không có tiền sử bệnh tim (= bệnh liên quan đến tim) trong gia đình chúng tôi."
                    },
                    {
                        "en": "the magazine’s problem page (= containing letters about readers’ problems and advice about how to solve them)",
                        "vi": "trang vấn đề của tạp chí (= chứa các bức thư về các vấn đề của độc giả và lời khuyên về cách giải quyết chúng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a question that can be answered by using logical thought or mathematics",
                    "vi": "một câu hỏi có thể được trả lời bằng cách sử dụng tư duy logic hoặc toán học"
                },
                "examples": [
                    {
                        "en": "mathematical problems",
                        "vi": "vấn đề toán học"
                    },
                    {
                        "en": "to find the answer to the problem",
                        "vi": "để tìm câu trả lời cho vấn đề"
                    },
                    {
                        "en": "The teacher set us 50 problems to do.",
                        "vi": "Giáo viên đặt ra cho chúng tôi 50 bài toán phải làm."
                    },
                    {
                        "en": "I have five problems to do for homework.",
                        "vi": "Tôi có năm vấn đề phải làm cho bài tập về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to disagree with or object to something/somebody",
                    "vi": "không đồng ý với hoặc phản đối điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "I have no problem with you working at home tomorrow.",
                        "vi": "Tôi không có vấn đề gì với bạn làm việc ở nhà vào ngày mai."
                    },
                    {
                        "en": "(informal) We are going to do this my way. Do you have a problem with that? (= showing that you are impatient with the person that you are speaking to)",
                        "vi": "(không chính thức) Chúng tôi sẽ làm điều này theo cách của tôi. Bạn đã có một vấn đề với điều đó? (= cho thấy bạn không kiên nhẫn với người mà bạn đang nói chuyện)"
                    },
                    {
                        "en": "Do you have a problem with her?",
                        "vi": "Bạn có vấn đề với cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not care about somebody else’s difficulties",
                    "vi": "được sử dụng để cho thấy rằng bạn không quan tâm đến khó khăn của người khác"
                },
                "examples": [
                    {
                        "en": "If they can't afford to go, that's not my problem.",
                        "vi": "Nếu họ không đủ khả năng để đi, đó không phải là vấn đề của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are happy to help somebody or that something will be easy to do",
                    "vi": "được sử dụng để thể hiện rằng bạn rất vui khi được giúp đỡ ai đó hoặc điều gì đó sẽ dễ dàng thực hiện"
                },
                "examples": [
                    {
                        "en": "‘Can I pay by credit card?’ ‘Yes, no problem.’",
                        "vi": "Tôi có thể trả bằng thẻ tín dụng?' 'Ừ, không vấn đề gì.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after somebody has thanked you or said they are sorry for something",
                    "vi": "được sử dụng sau khi ai đó đã cảm ơn bạn hoặc nói rằng họ xin lỗi vì điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Thanks for the ride.’ ‘No problem.’",
                        "vi": "Cảm ơn vì cho đi nhờ.' 'Không có gì.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think a person should deal with their own difficulties",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ rằng một người nên đối phó với những khó khăn của chính họ"
                },
                "examples": [
                    {
                        "en": "‘My parents will be furious!’ ‘That’s your problem.’",
                        "vi": "Bố mẹ tôi sẽ rất tức giận!' 'Đó là vấn đề của bạn.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think somebody is being unreasonable",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ rằng ai đó đang vô lý"
                },
                "examples": [
                    {
                        "en": "What's your problem?—I only asked if you could help me for ten minutes.",
                        "vi": "Vấn đề của bạn là gì? —Tôi chỉ hỏi nếu bạn có thể giúp tôi trong vòng mười phút."
                    }
                ]
            }
        ]
    },
    {
        "id": "8824fe95bbb948788b2ec19731f06ce7",
        "word": "trouble",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈtrʌbl/",
            "us": "/ˈtrʌbl/"
        },
        "nearby": [
            {
                "word": "trotter",
                "pos": "noun"
            },
            {
                "word": "troubadour",
                "pos": "noun"
            },
            {
                "word": "trouble",
                "pos": "noun"
            },
            {
                "word": "trouble",
                "pos": "verb"
            },
            {
                "word": "trouble at t' mill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem, worry, difficulty, etc. or a situation causing this",
                    "vi": "một vấn đề, lo lắng, khó khăn, v.v. hoặc một tình huống gây ra điều này"
                },
                "examples": [
                    {
                        "en": "We have trouble getting staff.",
                        "vi": "Chúng tôi gặp khó khăn trong việc tuyển nhân viên."
                    },
                    {
                        "en": "to make/cause/spell trouble for somebody",
                        "vi": "để làm cho / gây ra / rắc rối chính tả cho ai đó"
                    },
                    {
                        "en": "He could make trouble for me if he wanted to.",
                        "vi": "Anh ta có thể gây rắc rối cho tôi nếu anh ta muốn."
                    },
                    {
                        "en": "Sorry, I didn't mean to cause any trouble.",
                        "vi": "Xin lỗi, tôi không cố ý gây rắc rối."
                    },
                    {
                        "en": "Falling shark numbers could spell (= cause) big trouble for ocean ecosystems.",
                        "vi": "Số lượng cá mập giảm có thể đánh vần (= gây ra) rắc rối lớn cho các hệ sinh thái đại dương."
                    },
                    {
                        "en": "trouble with somebody/something The trouble with you is you don't really want to work.",
                        "vi": "rắc rối với ai đó / điều gì đó Rắc rối với bạn là bạn không thực sự muốn làm việc."
                    },
                    {
                        "en": "We've never had much trouble with vandals around here.",
                        "vi": "Chúng tôi chưa bao giờ gặp nhiều rắc rối với những kẻ phá hoại quanh đây."
                    },
                    {
                        "en": "Her trouble is she's incapable of making a decision.",
                        "vi": "Rắc rối của cô ấy là cô ấy không có khả năng đưa ra quyết định."
                    },
                    {
                        "en": "The trouble is (= what is difficult is) there aren't any trains at that time.",
                        "vi": "Vấn đề là (= cái khó là) không có bất kỳ chuyến tàu nào vào thời điểm đó."
                    },
                    {
                        "en": "The only trouble is we won't be here then.",
                        "vi": "Rắc rối duy nhất là lúc đó chúng ta sẽ không ở đây."
                    },
                    {
                        "en": "No, I don't know his number—I have quite enough trouble remembering my own.",
                        "vi": "Không, tôi không biết số của anh ấy — tôi gặp khá nhiều khó khăn khi nhớ số của mình."
                    },
                    {
                        "en": "financial troubles",
                        "vi": "rắc rối tài chính"
                    },
                    {
                        "en": "She was on the phone for an hour telling me her troubles.",
                        "vi": "Cô ấy đã nghe điện thoại cả tiếng đồng hồ để kể cho tôi nghe những rắc rối của cô ấy."
                    },
                    {
                        "en": "Our troubles aren't over yet.",
                        "vi": "Những rắc rối của chúng tôi vẫn chưa kết thúc."
                    },
                    {
                        "en": "Finance was the least of his troubles.",
                        "vi": "Tài chính là ít rắc rối nhất của anh ta."
                    },
                    {
                        "en": "There was trouble brewing (= a problem was developing) among the workforce.",
                        "vi": "Đã xảy ra sự cố khi sản xuất bia (= một vấn đề đang phát triển) trong lực lượng lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you can be criticized or punished",
                    "vi": "một tình huống mà bạn có thể bị chỉ trích hoặc trừng phạt"
                },
                "examples": [
                    {
                        "en": "in trouble If I don't get this finished in time, I'll be in trouble.",
                        "vi": "gặp rắc rối Nếu tôi không hoàn thành việc này kịp thời, tôi sẽ gặp rắc rối."
                    },
                    {
                        "en": "We're in deep/serious trouble now!",
                        "vi": "Chúng tôi đang gặp rắc rối nghiêm trọng / sâu sắc!"
                    },
                    {
                        "en": "When she saw the teacher coming she knew she was in big trouble.",
                        "vi": "Khi cô ấy nhìn thấy giáo viên đến, cô ấy biết rằng cô ấy đang gặp rắc rối lớn."
                    },
                    {
                        "en": "in trouble with somebody He's in trouble with the police.",
                        "vi": "gặp rắc rối với ai đó Anh ấy đang gặp rắc rối với cảnh sát."
                    },
                    {
                        "en": "My brother was always getting me into trouble with my parents.",
                        "vi": "Anh trai tôi luôn khiến tôi gặp rắc rối với bố mẹ tôi."
                    },
                    {
                        "en": "out of trouble Did you manage to stay out of trouble?",
                        "vi": "thoát khỏi khó khăn Bạn có quản lý để tránh khỏi khó khăn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that is difficult or dangerous",
                    "vi": "một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The company ran into trouble early on, when a major order was cancelled.",
                        "vi": "Công ty gặp khó khăn từ rất sớm, khi một đơn đặt hàng lớn bị hủy bỏ."
                    },
                    {
                        "en": "A yachtsman got into trouble off the coast and had to be rescued.",
                        "vi": "Một du thuyền gặp sự cố ở ngoài khơi và phải được giải cứu."
                    },
                    {
                        "en": "She got into serious financial trouble after running up large debts.",
                        "vi": "Cô ấy gặp rắc rối nghiêm trọng về tài chính sau khi gánh những khoản nợ lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an angry or violent situation",
                    "vi": "một tình huống tức giận hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "The police were expecting trouble after the match.",
                        "vi": "Cảnh sát dự kiến sẽ gặp rắc rối sau trận đấu."
                    },
                    {
                        "en": "If you're not in by midnight, there'll be trouble (= I'll be very angry).",
                        "vi": "Nếu bạn không đến trước nửa đêm, sẽ có rắc rối (= Tôi sẽ rất tức giận)."
                    },
                    {
                        "en": "He had to throw out a few drunks who were causing trouble in the bar.",
                        "vi": "Anh ta phải ném ra ngoài một vài kẻ say xỉn đang gây rắc rối trong quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "illness or pain",
                    "vi": "bệnh tật hoặc đau đớn"
                },
                "examples": [
                    {
                        "en": "back trouble",
                        "vi": "rắc rối trở lại"
                    },
                    {
                        "en": "He suffers from heart trouble.",
                        "vi": "Anh ấy bị bệnh tim."
                    },
                    {
                        "en": "I've been having trouble with my knee.",
                        "vi": "Tôi đang gặp vấn đề với đầu gối của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is wrong with a machine, vehicle, etc.",
                    "vi": "có vấn đề gì xảy ra với máy móc, phương tiện, v.v."
                },
                "examples": [
                    {
                        "en": "mechanical trouble",
                        "vi": "sự cố máy móc"
                    },
                    {
                        "en": "My car's been having engine trouble.",
                        "vi": "Xe của tôi gặp trục trặc về động cơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "extra effort or work",
                    "vi": "nỗ lực thêm hoặc làm việc"
                },
                "examples": [
                    {
                        "en": "I don't want to put you to a lot of trouble.",
                        "vi": "Tôi không muốn khiến bạn gặp nhiều rắc rối."
                    },
                    {
                        "en": "I'll get it if you like, that will save you the trouble of going out.",
                        "vi": "Tôi sẽ lấy nếu bạn thích, điều đó sẽ giúp bạn đỡ rắc rối khi ra ngoài."
                    },
                    {
                        "en": "Making your own yogurt is more trouble than it's worth.",
                        "vi": "Tự làm sữa chua sẽ rắc rối hơn nhiều."
                    },
                    {
                        "en": "She went to a lot of trouble to find the book for me.",
                        "vi": "Cô ấy đã gặp rất nhiều khó khăn để tìm được cuốn sách cho tôi."
                    },
                    {
                        "en": "Nothing is ever too much trouble for her (= she's always ready to help).",
                        "vi": "Không có gì là quá nhiều rắc rối đối với cô ấy (= cô ấy luôn sẵn sàng giúp đỡ)."
                    },
                    {
                        "en": "I can call back later—it's no trouble (= I don't mind).",
                        "vi": "Tôi có thể gọi lại sau — không có gì khó khăn cả (= Tôi không phiền)."
                    },
                    {
                        "en": "I hope the children weren't too much trouble.",
                        "vi": "Tôi hy vọng bọn trẻ không gặp quá nhiều khó khăn."
                    },
                    {
                        "en": "It is worth taking the trouble to read the introduction.",
                        "vi": "Nó là giá trị khó khăn để đọc phần giới thiệu."
                    },
                    {
                        "en": "He thanked me for my trouble and left.",
                        "vi": "Anh ấy cảm ơn tôi vì rắc rối của tôi và rời đi."
                    },
                    {
                        "en": "I never meant to cause you any trouble .",
                        "vi": "Tôi không bao giờ có ý định gây rắc rối cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is very likely to result in trouble",
                    "vi": "hành xử theo cách rất có thể dẫn đến rắc rối"
                },
                "examples": [
                    {
                        "en": "He was asking for trouble when he insulted their country.",
                        "vi": "Anh ta đang hỏi rắc rối khi anh ta xúc phạm đất nước của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a woman who is not married pregnant",
                    "vi": "làm cho một phụ nữ chưa kết hôn có thai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause problems or difficulties",
                    "vi": "gây ra vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "My back's been giving me a lot of trouble lately.",
                        "vi": "Gần đây, lưng của tôi gây cho tôi rất nhiều rắc rối."
                    },
                    {
                        "en": "The children didn't give me any trouble at all when we were out.",
                        "vi": "Bọn trẻ không gây khó khăn gì cho tôi khi chúng tôi ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is likely to cause an argument, violence, etc.",
                    "vi": "cư xử theo cách có thể gây ra cãi vã, bạo lực, v.v."
                },
                "examples": [
                    {
                        "en": "Drunken youths hang around outside looking for trouble.",
                        "vi": "Thanh niên say xỉn lượn lờ bên ngoài tìm kiếm rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try hard to do something well",
                    "vi": "cố gắng hết sức để làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "They take a lot of trouble to find the right person for the right job.",
                        "vi": "Họ gặp rất nhiều khó khăn để tìm được đúng người đúng việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something even though it involves effort or difficulty",
                    "vi": "để làm điều gì đó mặc dù nó liên quan đến nỗ lực hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "She didn't even take the trouble to find out how to spell my name.",
                        "vi": "Cô ấy thậm chí còn không chịu khó để tìm ra cách đánh vần tên tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious",
                    "vi": "nếu bạn nói chuyện với ai đó về những vấn đề và lo lắng của bạn, thay vì giữ chúng cho riêng mình, họ có vẻ ít nghiêm trọng hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "065bec74f9a84bfd9d8ffa347b384e83",
        "word": "disadvantage",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌdɪsədˈvɑːntɪdʒ/",
            "us": "/ˌdɪsədˈvæntɪdʒ/"
        },
        "nearby": [
            {
                "word": "disabuse",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "noun"
            },
            {
                "word": "disadvantaged",
                "pos": "adjective"
            },
            {
                "word": "disadvantageous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that causes problems and tends to stop somebody/something from succeeding or making progress",
                    "vi": "điều gì đó gây ra vấn đề và có xu hướng ngăn cản ai đó / điều gì đó thành công hoặc tiến bộ"
                },
                "examples": [
                    {
                        "en": "a serious/severe/significant disadvantage",
                        "vi": "một bất lợi nghiêm trọng / nghiêm trọng / đáng kể"
                    },
                    {
                        "en": "One major disadvantage of the area is the lack of public transport.",
                        "vi": "Một bất lợi lớn của khu vực này là thiếu phương tiện giao thông công cộng."
                    },
                    {
                        "en": "What's the main disadvantage?",
                        "vi": "Nhược điểm chính là gì?"
                    },
                    {
                        "en": "Each plan has its own advantages and disadvantages.",
                        "vi": "Mỗi phương án đều có ưu nhược điểm riêng."
                    },
                    {
                        "en": "disadvantage to something There are disadvantages to the plan.",
                        "vi": "bất lợi cho một cái gì đó Có bất lợi cho kế hoạch."
                    },
                    {
                        "en": "at a disadvantage The fact that he didn't speak a foreign language put him at a distinct disadvantage.",
                        "vi": "gặp bất lợi Việc anh ấy không nói được ngoại ngữ khiến anh ấy gặp bất lợi rõ rệt."
                    },
                    {
                        "en": "I was at a disadvantage compared to the younger members of the team.",
                        "vi": "Tôi gặp bất lợi so với các thành viên trẻ hơn trong đội."
                    },
                    {
                        "en": "Poor product quality can put a company at a competitive disadvantage.",
                        "vi": "Chất lượng sản phẩm kém có thể đặt một công ty vào thế bất lợi trong cạnh tranh."
                    },
                    {
                        "en": "to somebody's disadvantage | to the disadvantage of somebody I hope my lack of experience won't be to my disadvantage.",
                        "vi": "bất lợi cho ai đó | bất lợi cho ai đó Tôi hy vọng sự thiếu kinh nghiệm của tôi sẽ không gây bất lợi cho tôi."
                    },
                    {
                        "en": "TV companies have basically bought football outright, to the complete disadvantage of the fans.",
                        "vi": "Các công ty truyền hình về cơ bản đã mua hoàn toàn bóng đá, trước sự thiệt thòi hoàn toàn của người hâm mộ."
                    },
                    {
                        "en": "The advantages of the scheme far outweighed the disadvantages.",
                        "vi": "Những ưu điểm của chương trình vượt xa những nhược điểm."
                    },
                    {
                        "en": "Many children in the class suffered severe social and economic disadvantage.",
                        "vi": "Nhiều trẻ em trong lớp bị thiệt thòi về kinh tế và xã hội."
                    }
                ]
            }
        ]
    },
    {
        "id": "028a1cf244c143f39a25fcce3c45ea22",
        "word": "make life difficult (for somebody)",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/laɪf/",
            "us": "/laɪf/"
        },
        "nearby": [
            {
                "word": "lie with",
                "pos": "phrasal verb"
            },
            {
                "word": "life-saving",
                "pos": "noun"
            },
            {
                "word": "life",
                "pos": "noun"
            },
            {
                "word": "Life",
                "pos": ""
            },
            {
                "word": "life-affirming",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to breathe, grow, produce young, etc. that people, animals and plants have before they die and that objects do not have",
                    "vi": "khả năng hô hấp, sinh trưởng, sản sinh non, v.v. mà con người, động vật và thực vật có trước khi chết và các vật thể không có"
                },
                "examples": [
                    {
                        "en": "This could mean the difference between life and death.",
                        "vi": "Điều này có thể có nghĩa là sự khác biệt giữa sự sống và cái chết."
                    },
                    {
                        "en": "The body was cold and showed no signs of life.",
                        "vi": "Cơ thể lạnh lẽo và không có dấu hiệu của sự sống."
                    },
                    {
                        "en": "I wish we could bring dinosaurs back to life.",
                        "vi": "Tôi ước chúng ta có thể làm cho khủng long sống lại."
                    },
                    {
                        "en": "In spring the countryside bursts into life.",
                        "vi": "Vào mùa xuân miền quê bừng lên sức sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being alive as a human; an individual person’s existence",
                    "vi": "trạng thái sống như một con người; sự tồn tại của một cá nhân"
                },
                "examples": [
                    {
                        "en": "The floods caused a massive loss of life (= many people were killed).",
                        "vi": "Lũ lụt đã gây ra thiệt hại lớn về nhân mạng (= nhiều người đã thiệt mạng)."
                    },
                    {
                        "en": "All risk to human life should be avoided.",
                        "vi": "Tất cả các rủi ro đối với tính mạng con người nên được tránh."
                    },
                    {
                        "en": "He risked his life to save his daughter from the fire.",
                        "vi": "Anh đã liều mình cứu con gái khỏi đám cháy."
                    },
                    {
                        "en": "The operation saved her life.",
                        "vi": "Ca phẫu thuật đã cứu sống cô."
                    },
                    {
                        "en": "My grandfather lost his life (= was killed) in the war.",
                        "vi": "Ông tôi đã mất mạng (= đã bị giết) trong chiến tranh."
                    },
                    {
                        "en": "The bombing claimed the lives of (= killed) thousands of people.",
                        "vi": "Vụ đánh bom đã cướp đi sinh mạng của (= thiệt mạng) hàng nghìn người."
                    },
                    {
                        "en": "Hundreds of lives were threatened when the building collapsed.",
                        "vi": "Hàng trăm sinh mạng bị đe dọa khi tòa nhà sụp đổ."
                    },
                    {
                        "en": "Attempts have been made on his life (= people have tried to kill him).",
                        "vi": "Đã có những nỗ lực nhằm vào cuộc sống của anh ta (= người ta đã cố gắng giết anh ta)."
                    }
                ]
            },
            {
                "define": {
                    "en": "living things",
                    "vi": "những sinh vật sống"
                },
                "examples": [
                    {
                        "en": "plant/animal/insect life",
                        "vi": "đời sống thực vật / động vật / côn trùng"
                    },
                    {
                        "en": "Plastic is a threat to marine life.",
                        "vi": "Nhựa là một mối đe dọa đối với sinh vật biển."
                    },
                    {
                        "en": "Nuclear war could mean the end of life on earth.",
                        "vi": "Chiến tranh hạt nhân có thể có nghĩa là sự kết thúc của sự sống trên trái đất."
                    },
                    {
                        "en": "Is there intelligent life on other planets?",
                        "vi": "Có sự sống thông minh trên các hành tinh khác không?"
                    },
                    {
                        "en": "There was no sign of life in the abandoned village.",
                        "vi": "Không có dấu hiệu của sự sống trong ngôi làng bỏ hoang."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period between somebody’s birth and their death; a part of this period",
                    "vi": "khoảng thời gian từ khi sinh ra đến khi chết của ai đó; một phần của thời kỳ này"
                },
                "examples": [
                    {
                        "en": "He's lived here all his life.",
                        "vi": "Anh ấy đã sống ở đây cả đời."
                    },
                    {
                        "en": "I've lived in England for most of my life.",
                        "vi": "Tôi đã sống ở Anh gần như cả cuộc đời."
                    },
                    {
                        "en": "somebody's whole/entire life",
                        "vi": "ai đó là toàn bộ / toàn bộ cuộc sống"
                    },
                    {
                        "en": "We have known each other our whole lives.",
                        "vi": "Chúng ta đã quen nhau cả đời."
                    },
                    {
                        "en": "He will spend the rest of his life (= until he dies) in a wheelchair.",
                        "vi": "Anh ấy sẽ dành phần còn lại của cuộc đời mình (= cho đến khi anh ấy chết) trên xe lăn."
                    },
                    {
                        "en": "to have a long/short life",
                        "vi": "để có một cuộc sống dài / ngắn"
                    },
                    {
                        "en": "to devote/dedicate your life to something",
                        "vi": "cống hiến / cống hiến cuộc sống của bạn cho một cái gì đó"
                    },
                    {
                        "en": "in somebody's life She's had some interesting experiences in her life.",
                        "vi": "trong cuộc sống của ai đó Cô ấy đã có một số trải nghiệm thú vị trong đời."
                    },
                    {
                        "en": "I've never in my entire life been so embarrassed.",
                        "vi": "Cả đời tôi chưa bao giờ thấy xấu hổ như vậy."
                    },
                    {
                        "en": "in early/later life",
                        "vi": "trong cuộc sống đầu tiên / sau này"
                    },
                    {
                        "en": "Brenda took up tennis late in life.",
                        "vi": "Brenda đến với quần vợt vào cuối đời."
                    },
                    {
                        "en": "A baby's weight will normally double in the first five months of life.",
                        "vi": "Cân nặng của một em bé thường sẽ tăng gấp đôi trong năm tháng đầu đời."
                    },
                    {
                        "en": "throughout somebody's life Throughout her life she was dogged by loneliness.",
                        "vi": "trong suốt cuộc đời của ai đó Trong suốt cuộc đời của mình, cô ấy đã bị đeo bám bởi sự cô đơn."
                    },
                    {
                        "en": "during somebody's life She had three marriages during her 89-year life.",
                        "vi": "trong suốt cuộc đời của ai đó Cô đã trải qua ba cuộc hôn nhân trong suốt cuộc đời 89 năm của mình."
                    },
                    {
                        "en": "for life There's no such thing as a job for life any longer.",
                        "vi": "cho cuộc sống Không còn gì gọi là công việc cho cuộc sống nữa."
                    },
                    {
                        "en": "She stayed there until the end of her life.",
                        "vi": "Cô ở đó cho đến cuối đời."
                    },
                    {
                        "en": "He was sentenced to life imprisonment.",
                        "vi": "Anh ấy bị kết án tù chung thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of somebody’s life when they are in a particular situation or job",
                    "vi": "một khoảng thời gian của cuộc đời ai đó khi họ ở trong một hoàn cảnh hoặc công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "She has been an accountant all her working life.",
                        "vi": "Cô ấy đã là một kế toán trong suốt cuộc đời làm việc của mình."
                    },
                    {
                        "en": "He spent his entire adult life in France.",
                        "vi": "Ông đã dành toàn bộ cuộc đời trưởng thành của mình ở Pháp."
                    },
                    {
                        "en": "throughout somebody's life They were very happy throughout their married life.",
                        "vi": "trong suốt cuộc đời của ai đó Họ đã rất hạnh phúc trong suốt cuộc sống hôn nhân của họ."
                    },
                    {
                        "en": "during somebody's life During his 13-year life in Britain he has never worked.",
                        "vi": "trong suốt cuộc đời của ai đó Trong suốt 13 năm sống ở Anh, anh ấy chưa bao giờ làm việc."
                    },
                    {
                        "en": "life as something He met a lot of interesting people during his life as a student.",
                        "vi": "cuộc sống như một cái gì đó Anh ấy đã gặp rất nhiều người thú vị trong suốt quãng đời sinh viên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period of time when something exists or functions",
                    "vi": "khoảng thời gian khi thứ gì đó tồn tại hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "In Italy the average life of a government is eleven months.",
                        "vi": "Ở Ý, tuổi thọ trung bình của một chính phủ là 11 tháng."
                    },
                    {
                        "en": "There are a few things you can do to extend the life of your carpet.",
                        "vi": "Có một số điều bạn có thể làm để kéo dài tuổi thọ của thảm."
                    },
                    {
                        "en": "These machines have a limited life (= they do not function well for very long).",
                        "vi": "Những máy này có tuổi thọ hạn chế (= chúng không hoạt động tốt trong thời gian dài)."
                    },
                    {
                        "en": "These smaller, lighter phones tend to have a shorter battery life.",
                        "vi": "Những chiếc điện thoại nhỏ hơn, nhẹ hơn này có xu hướng có thời lượng pin ngắn hơn."
                    },
                    {
                        "en": "life as something The International Stock Exchange started life as a coffee shop.",
                        "vi": "cuộc sống như một cái gì đó Sở giao dịch chứng khoán quốc tế bắt đầu cuộc sống như một quán cà phê."
                    },
                    {
                        "en": "The building will now have a new life as a museum.",
                        "vi": "Tòa nhà bây giờ sẽ có một cuộc sống mới như một viện bảo tàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the experience and activities that are typical of all people’s existences",
                    "vi": "trải nghiệm và hoạt động tiêu biểu cho sự tồn tại của mọi người"
                },
                "examples": [
                    {
                        "en": "the worries of everyday life",
                        "vi": "những lo lắng của cuộc sống hàng ngày"
                    },
                    {
                        "en": "Commuting is a part of daily life for many people.",
                        "vi": "Đi làm là một phần trong cuộc sống hàng ngày của nhiều người."
                    },
                    {
                        "en": "Trees and green spaces enhance our quality of life.",
                        "vi": "Cây cối và không gian xanh giúp nâng cao chất lượng cuộc sống của chúng ta."
                    },
                    {
                        "en": "He is young and has little experience of life.",
                        "vi": "Anh ấy còn trẻ và ít kinh nghiệm sống."
                    },
                    {
                        "en": "Jill wants to travel and see life for herself.",
                        "vi": "Jill muốn đi du lịch và nhìn cuộc sống cho chính mình."
                    },
                    {
                        "en": "We have no time just to enjoy life.",
                        "vi": "Chúng ta không có thời gian chỉ để tận hưởng cuộc sống."
                    },
                    {
                        "en": "Life can be hard.",
                        "vi": "Cuộc sống có thể khó khăn."
                    },
                    {
                        "en": "We bought a dishwasher to make life easier.",
                        "vi": "Chúng tôi đã mua một máy rửa bát để làm cho cuộc sống dễ dàng hơn."
                    },
                    {
                        "en": "Life isn't like in the movies, you know.",
                        "vi": "Cuộc sống không giống như trong phim, bạn biết đấy."
                    },
                    {
                        "en": "in life It's important to have a purpose in life.",
                        "vi": "trong cuộc sống Điều quan trọng là phải có mục đích sống."
                    },
                    {
                        "en": "In real life (= when she met him) he wasn't how she had imagined him at all.",
                        "vi": "Trong cuộc sống thực (= khi cô ấy gặp anh ấy) anh ấy không giống như cô ấy đã tưởng tượng về anh ấy chút nào."
                    },
                    {
                        "en": "life without something Can you imagine life without music?",
                        "vi": "cuộc sống mà không có thứ gì đó Bạn có thể tưởng tượng cuộc sống mà không có âm nhạc không?"
                    },
                    {
                        "en": "You can share life events like getting married or becoming a parent.",
                        "vi": "Bạn có thể chia sẻ các sự kiện trong cuộc sống như kết hôn hoặc trở thành cha mẹ."
                    },
                    {
                        "en": "He just needs a little more life experience.",
                        "vi": "Anh ấy chỉ cần thêm một chút kinh nghiệm sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activities and experiences that are typical of a particular way of living",
                    "vi": "các hoạt động và trải nghiệm điển hình của một cách sống cụ thể"
                },
                "examples": [
                    {
                        "en": "We just want a normal family life.",
                        "vi": "Chúng tôi chỉ muốn một cuộc sống gia đình bình thường."
                    },
                    {
                        "en": "Technology is part of modern life.",
                        "vi": "Công nghệ là một phần của cuộc sống hiện đại."
                    },
                    {
                        "en": "She enjoyed political life.",
                        "vi": "Cô rất thích cuộc sống chính trị."
                    },
                    {
                        "en": "His fame was so sudden that he was unprepared for public life.",
                        "vi": "Sự nổi tiếng của anh quá đột ngột nên anh không hề chuẩn bị trước cho cuộc sống của công chúng."
                    },
                    {
                        "en": "country/city/island life",
                        "vi": "đất nước / thành phố / cuộc sống trên đảo"
                    },
                    {
                        "en": "How do you find life in Japan?",
                        "vi": "Bạn thấy cuộc sống ở Nhật Bản như thế nào?"
                    },
                    {
                        "en": "He eventually got used to life in prison.",
                        "vi": "Cuối cùng anh ta đã quen với cuộc sống trong tù."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s experiences during their life; the activities that form a particular part of a person’s life",
                    "vi": "kinh nghiệm của một người trong suốt cuộc đời của họ; các hoạt động tạo thành một phần cụ thể trong cuộc sống của một người"
                },
                "examples": [
                    {
                        "en": "to have/live/lead a… life",
                        "vi": "để có / sống / sống một… cuộc sống"
                    },
                    {
                        "en": "He has had a good life.",
                        "vi": "Anh ấy đã có một cuộc sống tốt."
                    },
                    {
                        "en": "She lived a quiet life in the countryside.",
                        "vi": "Cô sống một cuộc sống bình lặng ở nông thôn."
                    },
                    {
                        "en": "Many of these children have led very sheltered lives (= they have not had many different experiences).",
                        "vi": "Nhiều đứa trẻ trong số này đã có cuộc sống rất được che chở (= chúng chưa có nhiều trải nghiệm khác nhau)."
                    },
                    {
                        "en": "a hard/an easy life",
                        "vi": "một cuộc sống khó khăn / dễ dàng"
                    },
                    {
                        "en": "Her daily life involved meeting lots of people.",
                        "vi": "Cuộc sống hàng ngày của cô ấy liên quan đến việc gặp gỡ rất nhiều người."
                    },
                    {
                        "en": "My day-to-day life is not very exciting.",
                        "vi": "Cuộc sống hàng ngày của tôi không mấy thú vị."
                    },
                    {
                        "en": "Meeting Penny changed my life.",
                        "vi": "Gặp Penny đã thay đổi cuộc đời tôi."
                    },
                    {
                        "en": "to affect/improve somebody's life",
                        "vi": "để ảnh hưởng / cải thiện cuộc sống của ai đó"
                    },
                    {
                        "en": "They emigrated to start a new life in Canada.",
                        "vi": "Họ di cư để bắt đầu cuộc sống mới ở Canada."
                    },
                    {
                        "en": "He doesn't like to talk about his private life.",
                        "vi": "Anh ấy không thích nói về cuộc sống riêng tư của mình."
                    },
                    {
                        "en": "She has a full social life.",
                        "vi": "Cô ấy có một cuộc sống xã hội đầy đủ."
                    },
                    {
                        "en": "a life of something They lead a life of luxury.",
                        "vi": "một cuộc sống của một cái gì đó Họ sống một cuộc sống sang trọng."
                    },
                    {
                        "en": "in somebody's life I don't want people like that in my life.",
                        "vi": "trong cuộc sống của ai đó, tôi không muốn những người như vậy trong cuộc đời mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being active and exciting",
                    "vi": "chất lượng của sự năng động và thú vị"
                },
                "examples": [
                    {
                        "en": "This is a great holiday resort that is full of life.",
                        "vi": "Đây là một khu nghỉ dưỡng tuyệt vời và tràn đầy sức sống."
                    },
                    {
                        "en": "We need to inject some new life into this project.",
                        "vi": "Chúng ta cần đưa một chút sức sống mới vào dự án này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the punishment of being sent to prison for life or a very long period of time; life imprisonment",
                    "vi": "hình phạt tù chung thân hoặc một thời hạn rất dài; tù chung thân"
                },
                "examples": [
                    {
                        "en": "The judge gave him life.",
                        "vi": "Thẩm phán đã cho anh ta cuộc sống."
                    },
                    {
                        "en": "She is doing life for murder.",
                        "vi": "Cô ấy đang sống vì tội giết người."
                    }
                ]
            },
            {
                "define": {
                    "en": "a living model or a real object or scene that people draw or paint",
                    "vi": "một mô hình sống hoặc một đồ vật hoặc cảnh thực mà mọi người vẽ hoặc vẽ"
                },
                "examples": [
                    {
                        "en": "She had lessons in drawing from life.",
                        "vi": "Cô đã có những bài học rút ra từ cuộc sống."
                    },
                    {
                        "en": "a life class (= one in which art students draw a naked man or woman)",
                        "vi": "lớp học cuộc sống (= lớp học trong đó các sinh viên nghệ thuật vẽ một người đàn ông hoặc phụ nữ khỏa thân)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a story of somebody’s life",
                    "vi": "một câu chuyện về cuộc đời của ai đó"
                },
                "examples": [
                    {
                        "en": "She wrote a life of Mozart.",
                        "vi": "Cô ấy đã viết một cuộc đời của Mozart."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a set number of chances before a player is out of a game",
                    "vi": "một trong số các cơ hội đã đặt trước khi một người chơi rời khỏi trò chơi"
                },
                "examples": [
                    {
                        "en": "He's lost two lives, so he's only got one left.",
                        "vi": "Anh ấy đã mất hai mạng sống, vì vậy anh ấy chỉ còn lại một."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the age you are (especially when you are not young)",
                    "vi": "ở độ tuổi của bạn (đặc biệt là khi bạn không còn trẻ)"
                },
                "examples": [
                    {
                        "en": "Eyesight doesn't get any better at my time of life.",
                        "vi": "Thị lực của tôi không tốt hơn chút nào vào thời điểm còn sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "be the most important person or thing to somebody",
                    "vi": "là người hoặc điều quan trọng nhất đối với ai đó"
                },
                "examples": [
                    {
                        "en": "My children are my life.",
                        "vi": "Các con tôi là cuộc sống của tôi."
                    },
                    {
                        "en": "Writing is his life.",
                        "vi": "Viết lách là cuộc sống của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to improve something by introducing new ideas and making people more interested in it",
                    "vi": "để cải thiện điều gì đó bằng cách giới thiệu những ý tưởng mới và khiến mọi người quan tâm hơn đến nó"
                },
                "examples": [
                    {
                        "en": "The results of their research have breathed new life into the debate.",
                        "vi": "Kết quả nghiên cứu của họ đã thổi một luồng sinh khí mới vào cuộc tranh luận."
                    }
                ]
            },
            {
                "define": {
                    "en": "an essential part of a person’s existence",
                    "vi": "một phần thiết yếu của sự tồn tại của một người"
                },
                "examples": [
                    {
                        "en": "Playing the violin has been the breath of life to her for over 20 years.",
                        "vi": "Chơi violin đã là hơi thở cuộc sống của cô trong hơn 20 năm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody/something more interesting or exciting",
                    "vi": "để làm cho ai đó / điều gì đó thú vị hoặc hấp dẫn hơn"
                },
                "examples": [
                    {
                        "en": "The new teacher really brought French to life for us.",
                        "vi": "Giáo viên mới đã thực sự mang tiếng Pháp vào cuộc sống cho chúng tôi."
                    },
                    {
                        "en": "Flowers can bring a dull room back to life.",
                        "vi": "Hoa có thể mang một căn phòng buồn tẻ trở lại với cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more interesting, exciting or full of activity",
                    "vi": "trở nên thú vị hơn, thú vị hơn hoặc đầy hoạt động"
                },
                "examples": [
                    {
                        "en": "The match finally came to life in the second half.",
                        "vi": "Trận đấu cuối cùng đã trở nên sống động trong hiệp hai."
                    },
                    {
                        "en": "The city only comes to life at night.",
                        "vi": "Thành phố chỉ trở nên sống động vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to act or move as if alive",
                    "vi": "bắt đầu hành động hoặc di chuyển như thể còn sống"
                },
                "examples": [
                    {
                        "en": "In my dream all my toys came to life.",
                        "vi": "Trong giấc mơ của tôi, tất cả đồ chơi của tôi đều trở nên sống động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die. People say ‘depart this life’ to avoid saying ‘die’.",
                    "vi": "chết. Người ta nói 'từ giã cuộc đời này' để tránh nói 'chết đi'."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an unhappy life, full of problems or unfair treatment",
                    "vi": "một cuộc sống bất hạnh, đầy rẫy những vấn đề hoặc bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He led his poor partner a dog's life.",
                        "vi": "Anh ta đã dẫn người bạn đời tội nghiệp của mình một cuộc sống của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend the last part of your life in a particular state or place",
                    "vi": "dành phần cuối cùng của cuộc đời bạn ở một tiểu bang hoặc địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "He ended his days in poverty.",
                        "vi": "Anh ấy đã kết thúc chuỗi ngày của mình trong nghèo khó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that cannot be changed, especially one that is unpleasant",
                    "vi": "một tình huống không thể thay đổi, đặc biệt là một tình huống khó chịu"
                },
                "examples": [
                    {
                        "en": "Illness is just a fact of life.",
                        "vi": "Bệnh tật chỉ là một thực tế của cuộc sống."
                    },
                    {
                        "en": "It’s a fact of life that some people will always be racist.",
                        "vi": "Một thực tế của cuộc sống là một số người sẽ luôn phân biệt chủng tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the details about sex and about how babies are born, especially as told to children",
                    "vi": "thông tin chi tiết về giới tính và cách trẻ được sinh ra, đặc biệt là khi nói với trẻ em"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a great effort to stay alive, especially when you are badly injured or seriously ill",
                    "vi": "nỗ lực rất nhiều để duy trì sự sống, đặc biệt là khi bạn bị thương nặng hoặc bệnh nặng"
                },
                "examples": [
                    {
                        "en": "A young cyclist is fighting for his life after the accident.",
                        "vi": "Một người đi xe đạp trẻ tuổi đang chiến đấu để giành lấy sự sống của mình sau vụ tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "as hard or as fast as possible",
                    "vi": "khó hoặc nhanh nhất có thể"
                },
                "examples": [
                    {
                        "en": "She was holding on to the rope for dear life.",
                        "vi": "Cô ấy đang giữ lấy sợi dây cho sự sống thân yêu."
                    },
                    {
                        "en": "Run for your life!",
                        "vi": "Chạy cho cuộc sống của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "however hard you try",
                    "vi": "dù bạn cố gắng đến đâu"
                },
                "examples": [
                    {
                        "en": "I cannot for the life of me imagine why they want to leave.",
                        "vi": "Cả đời tôi không thể tưởng tượng nổi tại sao họ lại muốn ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to frighten somebody very much",
                    "vi": "làm ai đó sợ hãi rất nhiều"
                },
                "examples": [
                    {
                        "en": "You scared the life out of me coming in so suddenly like that.",
                        "vi": "Bạn sợ hãi cuộc sống nơi tôi đến đột ngột như thế."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of energy",
                    "vi": "có rất nhiều năng lượng"
                },
                "examples": [
                    {
                        "en": "It's nice to see an old man still so full of life.",
                        "vi": "Thật tuyệt khi thấy một ông già vẫn tràn đầy sức sống như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to stop being boring and to do something more interesting",
                    "vi": "được sử dụng để nói với ai đó ngừng nhàm chán và làm điều gì đó thú vị hơn"
                },
                "examples": [
                    {
                        "en": "Do us all a favour… get a life!",
                        "vi": "Làm ơn cho tất cả chúng ta ... có được một mạng sống!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold somebody/something very tightly because you are afraid",
                    "vi": "giữ ai đó / cái gì đó thật chặt vì bạn sợ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very lucky in dangerous situations",
                    "vi": "rất may mắn trong những tình huống nguy hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to enjoy yourself very much",
                    "vi": "để tận hưởng bản thân rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "feeling frightened that you might be killed",
                    "vi": "cảm thấy sợ hãi rằng bạn có thể bị giết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a method of helping somebody who has stopped breathing to breathe again by placing your mouth on theirs and forcing air into their lungs",
                    "vi": "một phương pháp giúp ai đó đã tắt thở có thể thở trở lại bằng cách đặt miệng của bạn lên miệng của họ và đưa không khí vào phổi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show surprise at seeing somebody/something",
                    "vi": "được sử dụng để thể hiện sự ngạc nhiên khi nhìn thấy ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I hadn’t seen her for fifteen years and then there she was, (as) large as life.",
                        "vi": "Tôi đã không gặp cô ấy trong mười lăm năm và sau đó cô ấy ở đó, (lớn như) cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking or behaving in a way that is more interesting or exciting than other people, and so is likely to attract attention",
                    "vi": "nhìn hoặc cư xử theo cách thú vị hoặc hấp dẫn hơn những người khác và do đó có khả năng thu hút sự chú ý"
                },
                "examples": [
                    {
                        "en": "He's a larger than life character.",
                        "vi": "Anh ấy là một nhân vật lớn hơn cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die in order to save somebody/something",
                    "vi": "chết để cứu ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "They were prepared to lay down their lives for their country.",
                        "vi": "Họ đã sẵn sàng hy sinh mạng sống của mình cho đất nước của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to live a happy and comfortable life with no problems or responsibilities",
                    "vi": "để sống một cuộc sống hạnh phúc và thoải mái không có vấn đề hoặc trách nhiệm"
                },
                "examples": [
                    {
                        "en": "The two crooks had been living the life of Riley.",
                        "vi": "Hai kẻ gian đã sống cuộc đời của Riley."
                    },
                    {
                        "en": "He planned to retire early and then lead the life of Riley.",
                        "vi": "Anh ta dự định nghỉ hưu sớm và sau đó sống cuộc đời của Riley."
                    }
                ]
            },
            {
                "define": {
                    "en": "the chance to live or last longer, or with a better quality of life",
                    "vi": "cơ hội để sống hoặc kéo dài hơn hoặc với chất lượng cuộc sống tốt hơn"
                },
                "examples": [
                    {
                        "en": "Since her hip operation she's had a new lease of life.",
                        "vi": "Kể từ khi phẫu thuật hông, cô ấy đã có một hợp đồng mới của cuộc đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the possibility or belief that people continue to exist in some form after they die",
                    "vi": "khả năng hoặc niềm tin rằng con người tiếp tục tồn tại dưới một hình thức nào đó sau khi họ chết"
                },
                "examples": [
                    {
                        "en": "Do you believe in life after death?",
                        "vi": "Bạn có tin vào cuộc sống sau khi chết?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the liveliest and funniest person at a party, etc.",
                    "vi": "người sống động và vui vẻ nhất trong một bữa tiệc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that there is a situation in which it is not thought to be important if people somewhere die or are treated badly",
                    "vi": "Người ta thường nói rằng có một tình huống không được coi là quan trọng nếu người dân ở một nơi nào đó chết hoặc bị đối xử tệ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "seeming to move or function by itself without a person touching or working it",
                    "vi": "dường như tự di chuyển hoặc hoạt động mà không cần một người chạm vào hoặc làm việc đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that it is not worth wasting time doing something that you dislike or that is not important",
                    "vi": "từng nói rằng không đáng để lãng phí thời gian làm điều gì đó mà bạn không thích hoặc điều đó không quan trọng"
                },
                "examples": [
                    {
                        "en": "Life's too short to sit around moping.",
                        "vi": "Cuộc sống quá ngắn ngủi để ngồi xung quanh việc lau nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person somebody loves more than any other",
                    "vi": "người mà ai đó yêu hơn bất kỳ người nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause problems for somebody",
                    "vi": "gây ra vấn đề cho ai đó"
                },
                "examples": [
                    {
                        "en": "She does everything she can to make life difficult for him.",
                        "vi": "Cô ấy làm mọi cách để gây khó khăn cho cuộc sống của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that makes somebody else feel very unhappy",
                    "vi": "cư xử theo cách khiến người khác cảm thấy rất không vui"
                },
                "examples": [
                    {
                        "en": "My old boss used to make my life a misery.",
                        "vi": "Ông chủ cũ của tôi từng khiến cuộc đời tôi khốn đốn."
                    },
                    {
                        "en": "His constant criticism made her life a misery.",
                        "vi": "Những lời chỉ trích liên tục của anh khiến cuộc sống của cô trở nên khốn khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the man or woman that you are having a sexual or romantic relationship with",
                    "vi": "người đàn ông hoặc phụ nữ mà bạn đang có một mối quan hệ tình dục hoặc lãng mạn với"
                },
                "examples": [
                    {
                        "en": "Anna has a new man in her life.",
                        "vi": "Anna có một người đàn ông mới trong cuộc đời của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a situation that is very important or serious",
                    "vi": "được sử dụng để mô tả một tình huống rất quan trọng hoặc nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "You mustn't let anyone know— it's a matter of life and death.",
                        "vi": "Bạn không được để bất kỳ ai biết - đó là vấn đề sống chết."
                    },
                    {
                        "en": "These talks are a matter of life or death for the factory.",
                        "vi": "Những cuộc đàm phán này là vấn đề sống chết của nhà máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be completely unable to do something",
                    "vi": "hoàn toàn không thể làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He can't interview people to save his life.",
                        "vi": "Anh ấy không thể phỏng vấn mọi người để cứu mạng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will definitely not do something",
                    "vi": "từng nói rằng bạn chắc chắn sẽ không làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to risk being killed or injured in order to do something",
                    "vi": "mạo hiểm bị giết hoặc bị thương để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She risked life and limb to save her children from the fire.",
                        "vi": "Cô đã liều mạng và tay chân để cứu các con của mình khỏi đám cháy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film, play or book that gives a very realistic view of ordinary life",
                    "vi": "một bộ phim, vở kịch hoặc một cuốn sách mang đến một cái nhìn rất thực tế về cuộc sống bình thường"
                },
                "examples": [
                    {
                        "en": "This drama provides a slice of life in 1950s Connecticut.",
                        "vi": "Bộ phim này cung cấp một phần của cuộc sống ở Connecticut những năm 1950."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start working or doing something",
                    "vi": "đột nhiên bắt đầu làm việc hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Let's go!’ he said, springing into action.",
                        "vi": "Đi nào!' anh ta nói, bắt đầu hành động."
                    },
                    {
                        "en": "The town springs to life (= becomes busy) during the carnival.",
                        "vi": "Thị trấn bừng lên sức sống (= trở nên bận rộn) trong lễ hội hóa trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a basic food, especially bread",
                    "vi": "một thực phẩm cơ bản, đặc biệt là bánh mì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to kill somebody",
                    "vi": "giết ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to kill yourself",
                    "vi": "tự sát"
                },
                "examples": [
                    {
                        "en": "She took her own life.",
                        "vi": "Cô ấy đã tự cướp đi mạng sống của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to risk being killed",
                    "vi": "có nguy cơ bị giết"
                },
                "examples": [
                    {
                        "en": "You take your life in your hands just crossing the road here.",
                        "vi": "Bạn nắm lấy mạng sống của mình trong tay khi băng qua đường ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are disappointed about something but know that you must accept it",
                    "vi": "được sử dụng khi bạn thất vọng về điều gì đó nhưng biết rằng bạn phải chấp nhận nó"
                },
                "examples": [
                    {
                        "en": "It’s a shame I can’t go on the trip, but that’s life.",
                        "vi": "Thật tiếc khi tôi không thể tham gia chuyến đi, nhưng đó là cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that’s the story of my life about a bad experience you have had, you mean you have had many similar experiences",
                    "vi": "khi bạn nói đó là câu chuyện của cuộc đời tôi về một trải nghiệm tồi tệ mà bạn đã trải qua, bạn có nghĩa là bạn đã có nhiều trải nghiệm tương tự"
                },
                "examples": [
                    {
                        "en": "Another missed opportunity—that’s the story of my life!",
                        "vi": "Một cơ hội bị bỏ lỡ khác — đó là câu chuyện của cuộc đời tôi!"
                    },
                    {
                        "en": "Out of work with no money—that's the story of my life.",
                        "vi": "Không có việc làm mà không có tiền - đó là câu chuyện của cuộc đời tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming real rather than invented",
                    "vi": "có vẻ như thực hơn là được phát minh"
                },
                "examples": [
                    {
                        "en": "I don’t think the characters are very true to life.",
                        "vi": "Tôi không nghĩ rằng các nhân vật rất chân thực với cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a range of different experiences makes life more interesting",
                    "vi": "có một loạt các trải nghiệm khác nhau làm cho cuộc sống thú vị hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person’s job or position in society",
                    "vi": "công việc hoặc vị trí của một người trong xã hội"
                },
                "examples": [
                    {
                        "en": "She has friends from all walks of life.",
                        "vi": "Cô ấy có bạn bè từ mọi tầng lớp trong cuộc sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "the typical pattern of behaviour of a person or group",
                    "vi": "mô hình hành vi điển hình của một người hoặc một nhóm"
                },
                "examples": [
                    {
                        "en": "the American way of life",
                        "vi": "cách sống của người Mỹ"
                    },
                    {
                        "en": "She loved the Spanish way of life and immediately felt at home there.",
                        "vi": "Cô yêu thích lối sống của người Tây Ban Nha và ngay lập tức cảm thấy như ở nhà ở đó."
                    },
                    {
                        "en": "the beliefs and practices of the Hindu way of life",
                        "vi": "niềm tin và thực hành của lối sống Hindu"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a bad situation you must not give up hope because there is always a chance that it will improve",
                    "vi": "trong một tình huống xấu, bạn không được từ bỏ hy vọng vì luôn có cơ hội để nó được cải thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are certain that something will happen",
                    "vi": "được sử dụng để nói rằng bạn chắc chắn rằng một cái gì đó sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "You can bet your life that he'll be late.",
                        "vi": "Bạn có thể đặt cược cuộc đời mình rằng anh ấy sẽ đến muộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "7bff406a21fb49c69d4cf7ffc7995cbe",
        "word": "obstacle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒbstəkl/",
            "us": "/ˈɑːbstəkl/"
        },
        "nearby": [
            {
                "word": "obsolescent",
                "pos": "adjective"
            },
            {
                "word": "obsolete",
                "pos": "adjective"
            },
            {
                "word": "obstacle",
                "pos": "noun"
            },
            {
                "word": "obstacle course",
                "pos": "noun"
            },
            {
                "word": "obstacle race",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation, an event, etc. that makes it difficult for you to do or achieve something",
                    "vi": "một tình huống, một sự kiện, v.v. khiến bạn khó làm hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "So far, we have managed to overcome all the obstacles that have been placed in our path.",
                        "vi": "Cho đến nay, chúng tôi đã cố gắng vượt qua tất cả những trở ngại đã được đặt trên con đường của chúng tôi."
                    },
                    {
                        "en": "obstacle to doing something A lack of qualifications can be a major obstacle to finding a job.",
                        "vi": "trở ngại khi làm việc gì đó Thiếu bằng cấp có thể là một trở ngại lớn cho việc tìm kiếm việc làm."
                    },
                    {
                        "en": "obstacle to somebody doing something The MP claims that there is now no obstacle to him standing at the next general election.",
                        "vi": "trở ngại đối với ai đó làm điều gì đó Nghị sĩ tuyên bố rằng bây giờ không có trở ngại nào đối với ông đứng trong cuộc tổng tuyển cử tiếp theo."
                    },
                    {
                        "en": "obstacle to something The huge distances involved have proved an obstacle to communication between villages.",
                        "vi": "trở ngại đối với một cái gì đó Khoảng cách rất lớn liên quan đã chứng tỏ một trở ngại cho giao tiếp giữa các làng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is in your way and that makes it difficult for you to move forward",
                    "vi": "một đối tượng cản đường bạn và khiến bạn khó tiến về phía trước"
                },
                "examples": [
                    {
                        "en": "The area was full of streams and bogs and other natural obstacles.",
                        "vi": "Khu vực này có rất nhiều suối và vũng lầy và các chướng ngại vật tự nhiên khác."
                    },
                    {
                        "en": "He managed with difficulty to negotiate the obstacles strewn across the floor.",
                        "vi": "Anh ta xoay sở với khó khăn để thương lượng những chướng ngại vật nằm rải rác trên sàn nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fence, etc. for a horse to jump over",
                    "vi": "hàng rào, v.v. để ngựa nhảy qua"
                },
                "examples": [
                    {
                        "en": "This huge open ditch forms the biggest obstacle on the course.",
                        "vi": "Con mương lộ thiên khổng lồ này tạo thành chướng ngại vật lớn nhất trên đường đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "0689a2e79487417983d2608e332d1557",
        "word": "burden",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɜːdn/",
            "us": "/ˈbɜːrdn/"
        },
        "nearby": [
            {
                "word": "burble",
                "pos": "verb"
            },
            {
                "word": "burbs",
                "pos": "noun"
            },
            {
                "word": "burden",
                "pos": "noun"
            },
            {
                "word": "burden",
                "pos": "verb"
            },
            {
                "word": "the burden of proof",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a duty, responsibility, etc. that causes worry, difficulty or hard work",
                    "vi": "nghĩa vụ, trách nhiệm, v.v. gây ra lo lắng, khó khăn hoặc công việc khó khăn"
                },
                "examples": [
                    {
                        "en": "to bear/carry/ease/reduce/share the burden",
                        "vi": "chịu đựng / mang theo / dễ dàng / giảm bớt / chia sẻ gánh nặng"
                    },
                    {
                        "en": "the burden (of something) The main burden of caring for old people falls on the state.",
                        "vi": "gánh nặng (của cái gì đó) Gánh nặng chính của việc chăm sóc người già thuộc về nhà nước."
                    },
                    {
                        "en": "burden on somebody the heavy tax burden on working people",
                        "vi": "gánh nặng cho ai đó gánh nặng thuế nặng nề cho những người làm việc"
                    },
                    {
                        "en": "a burden to somebody I don't want to become a burden to my children when I'm old.",
                        "vi": "gánh nặng cho ai đó Tôi không muốn trở thành gánh nặng cho con cái khi tôi về già."
                    }
                ]
            },
            {
                "define": {
                    "en": "a heavy load that is difficult to carry",
                    "vi": "một tải nặng khó mang theo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "960aee2694d0466598b63ea11cf340df",
        "word": "burden",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɜːdn/",
            "us": "/ˈbɜːrdn/"
        },
        "nearby": [
            {
                "word": "burbs",
                "pos": "noun"
            },
            {
                "word": "burden",
                "pos": "noun"
            },
            {
                "word": "burden",
                "pos": "verb"
            },
            {
                "word": "the burden of proof",
                "pos": "noun"
            },
            {
                "word": "burdensome",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody a duty, responsibility, etc. that causes worry, difficulty or hard work",
                    "vi": "giao cho ai đó một nhiệm vụ, trách nhiệm, v.v. gây ra lo lắng, khó khăn hoặc công việc khó khăn"
                },
                "examples": [
                    {
                        "en": "They have burdened themselves with a high mortgage.",
                        "vi": "Họ đã phải gánh cho mình một khoản thế chấp cao."
                    },
                    {
                        "en": "I don't want to burden you with my worries.",
                        "vi": "Tôi không muốn làm gánh nặng cho bạn với những lo lắng của tôi."
                    },
                    {
                        "en": "to be burdened by high taxation",
                        "vi": "chịu gánh nặng do đánh thuế cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be carrying something heavy",
                    "vi": "mang một cái gì đó nặng"
                },
                "examples": [
                    {
                        "en": "She got off the bus, burdened with two heavy suitcases.",
                        "vi": "Cô xuống xe, tay xách hai chiếc vali nặng trĩu."
                    }
                ]
            }
        ]
    },
    {
        "id": "b66ab19f428e4cfea10cac781d2c4513",
        "word": "disadvantage",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪsədˈvɑːntɪdʒ/",
            "us": "/ˌdɪsədˈvæntɪdʒ/"
        },
        "nearby": [
            {
                "word": "disablement",
                "pos": "noun"
            },
            {
                "word": "disabuse",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "noun"
            },
            {
                "word": "disadvantaged",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause problems and tend to stop somebody/something from succeeding or making progress",
                    "vi": "gây ra vấn đề và có xu hướng ngăn cản ai đó / điều gì đó thành công hoặc tiến bộ"
                },
                "examples": [
                    {
                        "en": "Some pension plans may disadvantage women.",
                        "vi": "Một số kế hoạch lương hưu có thể gây bất lợi cho phụ nữ."
                    },
                    {
                        "en": "Many people will be greatly disadvantaged by the new tax system.",
                        "vi": "Nhiều người sẽ bị thiệt thòi rất nhiều trước hệ thống thuế mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "ccd45194afe64453b186ca9188e917c6",
        "word": "give (somebody) (some, no, any, etc.) trouble",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtrʌbl/",
            "us": "/ˈtrʌbl/"
        },
        "nearby": [
            {
                "word": "trotter",
                "pos": "noun"
            },
            {
                "word": "troubadour",
                "pos": "noun"
            },
            {
                "word": "trouble",
                "pos": "noun"
            },
            {
                "word": "trouble",
                "pos": "verb"
            },
            {
                "word": "trouble at t' mill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem, worry, difficulty, etc. or a situation causing this",
                    "vi": "một vấn đề, lo lắng, khó khăn, v.v. hoặc một tình huống gây ra điều này"
                },
                "examples": [
                    {
                        "en": "We have trouble getting staff.",
                        "vi": "Chúng tôi gặp khó khăn trong việc tuyển nhân viên."
                    },
                    {
                        "en": "to make/cause/spell trouble for somebody",
                        "vi": "để làm cho / gây ra / rắc rối chính tả cho ai đó"
                    },
                    {
                        "en": "He could make trouble for me if he wanted to.",
                        "vi": "Anh ta có thể gây rắc rối cho tôi nếu anh ta muốn."
                    },
                    {
                        "en": "Sorry, I didn't mean to cause any trouble.",
                        "vi": "Xin lỗi, tôi không cố ý gây rắc rối."
                    },
                    {
                        "en": "Falling shark numbers could spell (= cause) big trouble for ocean ecosystems.",
                        "vi": "Số lượng cá mập giảm có thể đánh vần (= gây ra) rắc rối lớn cho các hệ sinh thái đại dương."
                    },
                    {
                        "en": "trouble with somebody/something The trouble with you is you don't really want to work.",
                        "vi": "rắc rối với ai đó / điều gì đó Rắc rối với bạn là bạn không thực sự muốn làm việc."
                    },
                    {
                        "en": "We've never had much trouble with vandals around here.",
                        "vi": "Chúng tôi chưa bao giờ gặp nhiều rắc rối với những kẻ phá hoại quanh đây."
                    },
                    {
                        "en": "Her trouble is she's incapable of making a decision.",
                        "vi": "Rắc rối của cô ấy là cô ấy không có khả năng đưa ra quyết định."
                    },
                    {
                        "en": "The trouble is (= what is difficult is) there aren't any trains at that time.",
                        "vi": "Vấn đề là (= cái khó là) không có bất kỳ chuyến tàu nào vào thời điểm đó."
                    },
                    {
                        "en": "The only trouble is we won't be here then.",
                        "vi": "Rắc rối duy nhất là lúc đó chúng ta sẽ không ở đây."
                    },
                    {
                        "en": "No, I don't know his number—I have quite enough trouble remembering my own.",
                        "vi": "Không, tôi không biết số của anh ấy — tôi gặp khá nhiều khó khăn khi nhớ số của mình."
                    },
                    {
                        "en": "financial troubles",
                        "vi": "rắc rối tài chính"
                    },
                    {
                        "en": "She was on the phone for an hour telling me her troubles.",
                        "vi": "Cô ấy đã nghe điện thoại cả tiếng đồng hồ để kể cho tôi nghe những rắc rối của cô ấy."
                    },
                    {
                        "en": "Our troubles aren't over yet.",
                        "vi": "Những rắc rối của chúng tôi vẫn chưa kết thúc."
                    },
                    {
                        "en": "Finance was the least of his troubles.",
                        "vi": "Tài chính là ít rắc rối nhất của anh ta."
                    },
                    {
                        "en": "There was trouble brewing (= a problem was developing) among the workforce.",
                        "vi": "Đã xảy ra sự cố khi sản xuất bia (= một vấn đề đang phát triển) trong lực lượng lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you can be criticized or punished",
                    "vi": "một tình huống mà bạn có thể bị chỉ trích hoặc trừng phạt"
                },
                "examples": [
                    {
                        "en": "in trouble If I don't get this finished in time, I'll be in trouble.",
                        "vi": "gặp rắc rối Nếu tôi không hoàn thành việc này kịp thời, tôi sẽ gặp rắc rối."
                    },
                    {
                        "en": "We're in deep/serious trouble now!",
                        "vi": "Chúng tôi đang gặp rắc rối nghiêm trọng / sâu sắc!"
                    },
                    {
                        "en": "When she saw the teacher coming she knew she was in big trouble.",
                        "vi": "Khi cô ấy nhìn thấy giáo viên đến, cô ấy biết rằng cô ấy đang gặp rắc rối lớn."
                    },
                    {
                        "en": "in trouble with somebody He's in trouble with the police.",
                        "vi": "gặp rắc rối với ai đó Anh ấy đang gặp rắc rối với cảnh sát."
                    },
                    {
                        "en": "My brother was always getting me into trouble with my parents.",
                        "vi": "Anh trai tôi luôn khiến tôi gặp rắc rối với bố mẹ tôi."
                    },
                    {
                        "en": "out of trouble Did you manage to stay out of trouble?",
                        "vi": "thoát khỏi khó khăn Bạn có quản lý để tránh khỏi khó khăn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that is difficult or dangerous",
                    "vi": "một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The company ran into trouble early on, when a major order was cancelled.",
                        "vi": "Công ty gặp khó khăn từ rất sớm, khi một đơn đặt hàng lớn bị hủy bỏ."
                    },
                    {
                        "en": "A yachtsman got into trouble off the coast and had to be rescued.",
                        "vi": "Một du thuyền gặp sự cố ở ngoài khơi và phải được giải cứu."
                    },
                    {
                        "en": "She got into serious financial trouble after running up large debts.",
                        "vi": "Cô ấy gặp rắc rối nghiêm trọng về tài chính sau khi gánh những khoản nợ lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an angry or violent situation",
                    "vi": "một tình huống tức giận hoặc bạo lực"
                },
                "examples": [
                    {
                        "en": "The police were expecting trouble after the match.",
                        "vi": "Cảnh sát dự kiến sẽ gặp rắc rối sau trận đấu."
                    },
                    {
                        "en": "If you're not in by midnight, there'll be trouble (= I'll be very angry).",
                        "vi": "Nếu bạn không đến trước nửa đêm, sẽ có rắc rối (= Tôi sẽ rất tức giận)."
                    },
                    {
                        "en": "He had to throw out a few drunks who were causing trouble in the bar.",
                        "vi": "Anh ta phải ném ra ngoài một vài kẻ say xỉn đang gây rắc rối trong quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "illness or pain",
                    "vi": "bệnh tật hoặc đau đớn"
                },
                "examples": [
                    {
                        "en": "back trouble",
                        "vi": "rắc rối trở lại"
                    },
                    {
                        "en": "He suffers from heart trouble.",
                        "vi": "Anh ấy bị bệnh tim."
                    },
                    {
                        "en": "I've been having trouble with my knee.",
                        "vi": "Tôi đang gặp vấn đề với đầu gối của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is wrong with a machine, vehicle, etc.",
                    "vi": "có vấn đề gì xảy ra với máy móc, phương tiện, v.v."
                },
                "examples": [
                    {
                        "en": "mechanical trouble",
                        "vi": "sự cố máy móc"
                    },
                    {
                        "en": "My car's been having engine trouble.",
                        "vi": "Xe của tôi gặp trục trặc về động cơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "extra effort or work",
                    "vi": "nỗ lực thêm hoặc làm việc"
                },
                "examples": [
                    {
                        "en": "I don't want to put you to a lot of trouble.",
                        "vi": "Tôi không muốn khiến bạn gặp nhiều rắc rối."
                    },
                    {
                        "en": "I'll get it if you like, that will save you the trouble of going out.",
                        "vi": "Tôi sẽ lấy nếu bạn thích, điều đó sẽ giúp bạn đỡ rắc rối khi ra ngoài."
                    },
                    {
                        "en": "Making your own yogurt is more trouble than it's worth.",
                        "vi": "Tự làm sữa chua sẽ rắc rối hơn nhiều."
                    },
                    {
                        "en": "She went to a lot of trouble to find the book for me.",
                        "vi": "Cô ấy đã gặp rất nhiều khó khăn để tìm được cuốn sách cho tôi."
                    },
                    {
                        "en": "Nothing is ever too much trouble for her (= she's always ready to help).",
                        "vi": "Không có gì là quá nhiều rắc rối đối với cô ấy (= cô ấy luôn sẵn sàng giúp đỡ)."
                    },
                    {
                        "en": "I can call back later—it's no trouble (= I don't mind).",
                        "vi": "Tôi có thể gọi lại sau — không có gì khó khăn cả (= Tôi không phiền)."
                    },
                    {
                        "en": "I hope the children weren't too much trouble.",
                        "vi": "Tôi hy vọng bọn trẻ không gặp quá nhiều khó khăn."
                    },
                    {
                        "en": "It is worth taking the trouble to read the introduction.",
                        "vi": "Nó là giá trị khó khăn để đọc phần giới thiệu."
                    },
                    {
                        "en": "He thanked me for my trouble and left.",
                        "vi": "Anh ấy cảm ơn tôi vì rắc rối của tôi và rời đi."
                    },
                    {
                        "en": "I never meant to cause you any trouble .",
                        "vi": "Tôi không bao giờ có ý định gây rắc rối cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is very likely to result in trouble",
                    "vi": "hành xử theo cách rất có thể dẫn đến rắc rối"
                },
                "examples": [
                    {
                        "en": "He was asking for trouble when he insulted their country.",
                        "vi": "Anh ta đang hỏi rắc rối khi anh ta xúc phạm đất nước của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a woman who is not married pregnant",
                    "vi": "làm cho một phụ nữ chưa kết hôn có thai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause problems or difficulties",
                    "vi": "gây ra vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "My back's been giving me a lot of trouble lately.",
                        "vi": "Gần đây, lưng của tôi gây cho tôi rất nhiều rắc rối."
                    },
                    {
                        "en": "The children didn't give me any trouble at all when we were out.",
                        "vi": "Bọn trẻ không gây khó khăn gì cho tôi khi chúng tôi ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is likely to cause an argument, violence, etc.",
                    "vi": "cư xử theo cách có thể gây ra cãi vã, bạo lực, v.v."
                },
                "examples": [
                    {
                        "en": "Drunken youths hang around outside looking for trouble.",
                        "vi": "Thanh niên say xỉn lượn lờ bên ngoài tìm kiếm rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try hard to do something well",
                    "vi": "cố gắng hết sức để làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "They take a lot of trouble to find the right person for the right job.",
                        "vi": "Họ gặp rất nhiều khó khăn để tìm được đúng người đúng việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something even though it involves effort or difficulty",
                    "vi": "để làm điều gì đó mặc dù nó liên quan đến nỗ lực hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "She didn't even take the trouble to find out how to spell my name.",
                        "vi": "Cô ấy thậm chí còn không chịu khó để tìm ra cách đánh vần tên tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you talk to somebody about your problems and worries, instead of keeping them to yourself, they seem less serious",
                    "vi": "nếu bạn nói chuyện với ai đó về những vấn đề và lo lắng của bạn, thay vì giữ chúng cho riêng mình, họ có vẻ ít nghiêm trọng hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0673911f0ec9443dbcdec62afd16bffb",
        "word": "haunt",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/hɔːnt/",
            "us": "/hɔːnt/"
        },
        "nearby": [
            {
                "word": "haulier",
                "pos": "noun"
            },
            {
                "word": "haunch",
                "pos": "noun"
            },
            {
                "word": "haunt",
                "pos": "verb"
            },
            {
                "word": "haunt",
                "pos": "noun"
            },
            {
                "word": "haunted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the ghost of a dead person haunts a place, people say that they have seen it there",
                    "vi": "nếu hồn ma của một người chết ám ảnh một nơi nào đó, người ta nói rằng họ đã nhìn thấy nó ở đó"
                },
                "examples": [
                    {
                        "en": "A headless rider haunts the country lanes.",
                        "vi": "Một tay đua không đầu ám ảnh các làn đường quê."
                    },
                    {
                        "en": "I’ll come back to haunt you!",
                        "vi": "Tôi sẽ trở lại để ám ảnh bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something unpleasant haunts you, it keeps coming to your mind so that you cannot forget it",
                    "vi": "nếu điều gì đó khó chịu ám ảnh bạn, nó cứ hiện ra trong tâm trí bạn khiến bạn không thể nào quên được"
                },
                "examples": [
                    {
                        "en": "The memory of that day still haunts me.",
                        "vi": "Kí ức về ngày đó vẫn còn ám ảnh tôi."
                    },
                    {
                        "en": "For years she was haunted by guilt.",
                        "vi": "Trong nhiều năm cô bị ám ảnh bởi cảm giác tội lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue to cause problems for somebody for a long time",
                    "vi": "tiếp tục gây ra vấn đề cho ai đó trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "That decision came back to haunt him.",
                        "vi": "Quyết định đó trở lại ám ảnh anh."
                    },
                    {
                        "en": "She has been haunted by her past during her career.",
                        "vi": "Cô đã bị ám ảnh bởi quá khứ của mình trong suốt sự nghiệp của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b11c175f46dc4ef786867249f9fa933d",
        "word": "hurdle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɜːdl/",
            "us": "/ˈhɜːrdl/"
        },
        "nearby": [
            {
                "word": "huntress",
                "pos": "noun"
            },
            {
                "word": "huntsman",
                "pos": "noun"
            },
            {
                "word": "hurdle",
                "pos": "noun"
            },
            {
                "word": "hurdle",
                "pos": "verb"
            },
            {
                "word": "hurdler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "each of a series of vertical frames that a person or horse jumps over in a race",
                    "vi": "mỗi một trong số một loạt các khung dọc mà một người hoặc ngựa nhảy qua trong một cuộc đua"
                },
                "examples": [
                    {
                        "en": "His horse fell at the final hurdle.",
                        "vi": "Con ngựa của anh ta bị ngã ở chướng ngại vật cuối cùng."
                    },
                    {
                        "en": "to clear a hurdle (= jump over it successfully)",
                        "vi": "để vượt qua rào cản (= vượt qua nó thành công)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a race in which runners or horses have to jump over hurdles",
                    "vi": "một cuộc đua trong đó người chạy hoặc ngựa phải nhảy qua các chướng ngại vật"
                },
                "examples": [
                    {
                        "en": "the 300 m hurdles",
                        "vi": "vượt rào 300 m"
                    }
                ]
            },
            {
                "define": {
                    "en": "a problem or difficulty that must be solved or dealt with before you can achieve something",
                    "vi": "một vấn đề hoặc khó khăn phải được giải quyết hoặc xử lý trước khi bạn có thể đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The next hurdle will be getting her parents' agreement.",
                        "vi": "Rào cản tiếp theo sẽ là nhận được sự đồng ý của bố mẹ cô ấy."
                    },
                    {
                        "en": "Well we’ve cleared the first hurdle; let’s see what happens next.",
                        "vi": "Chà, chúng tôi đã vượt qua rào cản đầu tiên; hãy xem điều gì xảy ra tiếp theo."
                    },
                    {
                        "en": "We worked hard for three months on the deal only to see it fall at the final hurdle.",
                        "vi": "Chúng tôi đã làm việc chăm chỉ trong ba tháng cho thỏa thuận chỉ để thấy nó rơi vào rào cản cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e475591af9a14af7905ecd35bb01f327",
        "word": "inconvenience",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnkənˈviːniəns/",
            "us": "/ˌɪnkənˈviːniəns/"
        },
        "nearby": [
            {
                "word": "incontrovertible",
                "pos": "adjective"
            },
            {
                "word": "incontrovertibly",
                "pos": "adverb"
            },
            {
                "word": "inconvenience",
                "pos": "noun"
            },
            {
                "word": "inconvenience",
                "pos": "verb"
            },
            {
                "word": "inconvenient",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trouble or problems, especially in connection with what you need or would like yourself",
                    "vi": "rắc rối hoặc các vấn đề, đặc biệt là liên quan đến những gì bạn cần hoặc bản thân muốn"
                },
                "examples": [
                    {
                        "en": "We apologize for the delay and regret any inconvenience it may have caused.",
                        "vi": "Chúng tôi xin lỗi vì sự chậm trễ và lấy làm tiếc về bất kỳ sự bất tiện nào mà nó có thể đã gây ra."
                    },
                    {
                        "en": "I have already been put to considerable inconvenience.",
                        "vi": "Tôi đã bị đặt vào một sự bất tiện đáng kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that causes problems or difficulties",
                    "vi": "một người hoặc vật gây ra vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "I can put up with minor inconveniences.",
                        "vi": "Tôi có thể đưa ra những bất tiện nhỏ."
                    },
                    {
                        "en": "This isn't a mere inconvenience; it's dangerous.",
                        "vi": "Đây không phải là một sự bất tiện đơn thuần; Nguy hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ade8b27afa74c3fb712a71465103935",
        "word": "inconvenience",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnkənˈviːniəns/",
            "us": "/ˌɪnkənˈviːniəns/"
        },
        "nearby": [
            {
                "word": "incontrovertibly",
                "pos": "adverb"
            },
            {
                "word": "inconvenience",
                "pos": "noun"
            },
            {
                "word": "inconvenience",
                "pos": "verb"
            },
            {
                "word": "inconvenient",
                "pos": "adjective"
            },
            {
                "word": "inconveniently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause trouble or difficulty for somebody",
                    "vi": "gây rắc rối hoặc khó khăn cho ai đó"
                },
                "examples": [
                    {
                        "en": "I hope that we haven't inconvenienced you.",
                        "vi": "Tôi hy vọng rằng chúng tôi đã không làm phiền bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed8304a1a90541949bdbb4fdcde5a6f5",
        "word": "interfere with",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "interfere",
                "pos": "verb"
            },
            {
                "word": "interference",
                "pos": "noun"
            },
            {
                "word": "interfere with",
                "pos": "phrasal verb"
            },
            {
                "word": "interfering",
                "pos": "adjective"
            },
            {
                "word": "interferon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to illegally try to influence somebody who is going to give evidence in court, for example by threatening them or offering them money",
                    "vi": "cố gắng gây ảnh hưởng một cách bất hợp pháp đến ai đó sẽ đưa ra bằng chứng trước tòa, chẳng hạn bằng cách đe dọa họ hoặc cung cấp tiền cho họ"
                },
                "examples": [
                    {
                        "en": "He was found guilty of interfering with witnesses.",
                        "vi": "Anh ta bị kết tội can thiệp vào các nhân chứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to touch a child in a sexual way",
                    "vi": "chạm vào một đứa trẻ theo cách tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent something from succeeding or from being done or happening as planned",
                    "vi": "để ngăn điều gì đó thành công hoặc không được thực hiện hoặc xảy ra theo kế hoạch"
                },
                "examples": [
                    {
                        "en": "She never allows her personal feelings to interfere with her work.",
                        "vi": "Cô ấy không bao giờ cho phép tình cảm cá nhân xen vào công việc của mình."
                    },
                    {
                        "en": "Emotional problems can seriously interfere with a student's work.",
                        "vi": "Các vấn đề về tình cảm có thể gây trở ngại nghiêm trọng đến công việc của học sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to touch, use or change something, especially a piece of equipment, so that it is damaged or no longer works correctly",
                    "vi": "chạm vào, sử dụng hoặc thay đổi thứ gì đó, đặc biệt là một bộ phận của thiết bị, khiến nó bị hư hỏng hoặc không còn hoạt động bình thường"
                },
                "examples": [
                    {
                        "en": "I'd get fired if he found out I'd been interfering with his records.",
                        "vi": "Tôi sẽ bị sa thải nếu anh ta phát hiện ra tôi đã can thiệp vào hồ sơ của anh ta."
                    },
                    {
                        "en": "You mustn't interfere with her work.",
                        "vi": "Bạn không được can thiệp vào công việc của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "ada2b22664b748e6a2126cf5cac706f1",
        "word": "setback",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsetbæk/",
            "us": "/ˈsetbæk/"
        },
        "nearby": [
            {
                "word": "set-aside",
                "pos": "noun"
            },
            {
                "word": "set back",
                "pos": "phrasal verb"
            },
            {
                "word": "setback",
                "pos": "noun"
            },
            {
                "word": "set book",
                "pos": "noun"
            },
            {
                "word": "set down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a difficulty or problem that delays or prevents something, or makes a situation worse",
                    "vi": "một khó khăn hoặc vấn đề làm trì hoãn hoặc ngăn cản điều gì đó hoặc làm cho tình huống trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "The team suffered a major setback when their best player was injured.",
                        "vi": "Đội đã gặp phải một thất bại lớn khi cầu thủ xuất sắc nhất của họ bị chấn thương."
                    },
                    {
                        "en": "The breakdown in talks represents a temporary setback in the peace process.",
                        "vi": "Sự đổ vỡ trong các cuộc đàm phán thể hiện một bước thụt lùi tạm thời trong tiến trình hòa bình."
                    }
                ]
            }
        ]
    },
    {
        "id": "0274e0b7a59443e890549f1a5d877d37",
        "word": "undesirable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌʌndɪˈzaɪərəbl/",
            "us": "/ˌʌndɪˈzaɪərəbl/"
        },
        "nearby": [
            {
                "word": "undeservedly",
                "pos": "adverb"
            },
            {
                "word": "undeserving",
                "pos": "adjective"
            },
            {
                "word": "undesirable",
                "pos": "adjective"
            },
            {
                "word": "undesirable",
                "pos": "noun"
            },
            {
                "word": "undesirably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not wanted or approved of; likely to cause trouble or problems",
                    "vi": "không muốn hoặc không chấp thuận; có khả năng gây ra rắc rối hoặc sự cố"
                },
                "examples": [
                    {
                        "en": "undesirable consequences/effects",
                        "vi": "hậu quả / tác dụng không mong muốn"
                    },
                    {
                        "en": "It would be highly undesirable to increase class sizes further.",
                        "vi": "Sẽ rất không mong muốn nếu tăng quy mô lớp học hơn nữa."
                    },
                    {
                        "en": "prostitution and other undesirable practices",
                        "vi": "mại dâm và các hoạt động không mong muốn khác"
                    },
                    {
                        "en": "These alternatives are economically undesirable.",
                        "vi": "Những lựa chọn thay thế này là không mong muốn về mặt kinh tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6d4dc9a77a54927a59c2a1641101d5f",
        "word": "(throw) a spanner in the works",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspænə(r)/",
            "us": "/ˈspænər/"
        },
        "nearby": [
            {
                "word": "spanking",
                "pos": "adverb"
            },
            {
                "word": "spanking",
                "pos": "adjective"
            },
            {
                "word": "spanner",
                "pos": "noun"
            },
            {
                "word": "spar",
                "pos": "verb"
            },
            {
                "word": "spar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a metal tool with an end with a special shape for holding and turning nuts and bolts (= small metal rings and pins that hold things together)",
                    "vi": "một dụng cụ kim loại có một đầu có hình dạng đặc biệt để giữ và vặn các đai ốc và bu lông (= vòng kim loại nhỏ và chốt giữ các vật lại với nhau)"
                },
                "examples": [
                    {
                        "en": "I’ll need a spanner to change the back wheel.",
                        "vi": "Tôi sẽ cần một cờ lê để thay bánh sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to cause) a delay or problem with something that somebody is planning or doing",
                    "vi": "(gây ra) sự chậm trễ hoặc vấn đề với điều gì đó mà ai đó đang lên kế hoạch hoặc làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bea8e6581f7341119ae9389665cf2826",
        "word": "banana skin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bəˈnɑːnə skɪn/",
            "us": "/bəˈnænə skɪn/"
        },
        "nearby": [
            {
                "word": "banana belt",
                "pos": "noun"
            },
            {
                "word": "banana republic",
                "pos": "noun"
            },
            {
                "word": "banana skin",
                "pos": "noun"
            },
            {
                "word": "banana split",
                "pos": "noun"
            },
            {
                "word": "Banbury",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that could cause somebody to have problems or feel embarrassed, especially somebody in a public position",
                    "vi": "điều gì đó có thể khiến ai đó gặp vấn đề hoặc cảm thấy xấu hổ, đặc biệt là ai đó ở vị trí công cộng"
                },
                "examples": [
                    {
                        "en": "Putting even more tax on fuel could prove to be a banana skin for the government.",
                        "vi": "Việc đánh thuế nhiều hơn đối với nhiên liệu có thể chứng tỏ là một hành động nằm ngoài da chuối đối với chính phủ."
                    },
                    {
                        "en": "The company has acquired an unhappy knack of slipping on banana skins.",
                        "vi": "Công ty đã mắc phải một sở trường không vui là trượt vỏ chuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "64fed37ff3274896adc100fd14970eae",
        "word": "bear hard, heavily, severely, etc. on somebody",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/beə(r)/",
            "us": "/ber/"
        },
        "nearby": [
            {
                "word": "beanstalk",
                "pos": "noun"
            },
            {
                "word": "Bean Town",
                "pos": ""
            },
            {
                "word": "bear",
                "pos": "verb"
            },
            {
                "word": "bear",
                "pos": "noun"
            },
            {
                "word": "bearable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be able to accept and deal with something unpleasant",
                    "vi": "để có thể chấp nhận và đối phó với điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "bear something The pain was almost more than he could bear.",
                        "vi": "chịu đựng điều gì đó Sự đau đớn gần như nhiều hơn khả năng chịu đựng của anh."
                    },
                    {
                        "en": "She bore it all with her usual patience.",
                        "vi": "Cô ấy chịu đựng tất cả bằng sự kiên nhẫn thường ngày của mình."
                    },
                    {
                        "en": "She couldn't bear the thought of losing him.",
                        "vi": "Cô không thể chịu đựng được ý nghĩ mất anh."
                    },
                    {
                        "en": "bear doing something I can't bear having cats in the house.",
                        "vi": "chịu làm điều gì đó Tôi không thể chịu được khi có mèo trong nhà."
                    },
                    {
                        "en": "He can't bear being laughed at.",
                        "vi": "Anh ấy không thể chịu được khi bị cười nhạo."
                    },
                    {
                        "en": "bear to do something He can't bear to be laughed at.",
                        "vi": "chịu làm điều gì đó Anh ấy không thể chịu đựng được khi bị cười nhạo."
                    },
                    {
                        "en": "I can hardly bear to think about it.",
                        "vi": "Tôi khó có thể chịu đựng được khi nghĩ về nó."
                    },
                    {
                        "en": "How can you bear to eat that stuff?",
                        "vi": "Làm sao bạn có thể chịu được khi ăn những thứ đó?"
                    },
                    {
                        "en": "bear somebody doing something I can't bear you doing that.",
                        "vi": "chịu ai đó làm điều gì đó tôi không thể chịu được bạn làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take responsibility for something",
                    "vi": "chịu trách nhiệm về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She bore the responsibility for most of the changes.",
                        "vi": "Cô ấy chịu trách nhiệm cho hầu hết các thay đổi."
                    },
                    {
                        "en": "Do parents have to bear the whole cost of tuition fees?",
                        "vi": "Phụ huynh có phải chịu toàn bộ học phí không?"
                    },
                    {
                        "en": "In the end it's consumers who bear the burden of higher prices.",
                        "vi": "Cuối cùng, chính người tiêu dùng phải chịu gánh nặng về giá cả cao hơn."
                    },
                    {
                        "en": "You shouldn't have to bear the blame for other people's mistakes.",
                        "vi": "Bạn không cần phải chịu trách nhiệm cho những sai lầm của người khác."
                    },
                    {
                        "en": "You must bear at least some responsibility for what has happened.",
                        "vi": "Bạn phải chịu ít nhất một số trách nhiệm cho những gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support the weight of somebody/something",
                    "vi": "để hỗ trợ trọng lượng của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The ice is too thin to bear your weight.",
                        "vi": "Lớp băng quá mỏng không thể chịu được trọng lượng của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show something; to carry something so that it can be seen",
                    "vi": "để hiển thị một cái gì đó; mang một cái gì đó để nó có thể được nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The document bore her signature.",
                        "vi": "Tài liệu có chữ ký của cô ấy."
                    },
                    {
                        "en": "He was badly wounded in the war and still bears the scars.",
                        "vi": "Anh ta bị thương nặng trong chiến tranh và vẫn còn mang những vết sẹo."
                    },
                    {
                        "en": "She bears little resemblance to (= is not much like) her mother.",
                        "vi": "Cô ấy có chút điểm giống (= không giống) mẹ của cô ấy."
                    },
                    {
                        "en": "The title of the essay bore little relation to (= was not much connected with) the contents.",
                        "vi": "Tiêu đề của bài luận không liên quan nhiều đến (= không liên quan nhiều đến) nội dung."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not be suitable for something",
                    "vi": "không phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "bear something Her later work does not bear comparison with her earlier novels (= because it is not nearly as good).",
                        "vi": "chịu đựng điều gì đó Tác phẩm sau này của cô ấy không chịu được so sánh với những cuốn tiểu thuyết trước đó của cô ấy (= vì nó gần như không hay bằng)."
                    },
                    {
                        "en": "The plan won't bear close inspection (= it will be found to be unacceptable when carefully examined).",
                        "vi": "Kế hoạch sẽ không chịu sự kiểm tra chặt chẽ (= nó sẽ được phát hiện là không thể chấp nhận được khi được kiểm tra cẩn thận)."
                    },
                    {
                        "en": "bear doing something The joke doesn't bear repeating (= because it is not funny or may offend people).",
                        "vi": "chịu làm điều gì đó Trò đùa không chịu lặp lại (= vì nó không hài hước hoặc có thể xúc phạm mọi người)."
                    },
                    {
                        "en": "His sufferings don't bear thinking about (= because they are so terrible).",
                        "vi": "Những đau khổ của anh ấy không ai chịu nghĩ đến (= bởi vì chúng quá khủng khiếp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a feeling, especially a negative feeling",
                    "vi": "có cảm giác, đặc biệt là cảm giác tiêu cực"
                },
                "examples": [
                    {
                        "en": "bear something He bears no resentment towards them.",
                        "vi": "chịu đựng điều gì đó Ngài không oán hận họ."
                    },
                    {
                        "en": "He's borne a grudge against me ever since that day.",
                        "vi": "Anh ấy đã có ác cảm với tôi kể từ ngày đó."
                    },
                    {
                        "en": "bear somebody something He's borne me a grudge ever since that day.",
                        "vi": "chịu đựng ai đó điều gì đó. Anh ấy đã mang cho tôi một mối hận thù kể từ ngày đó."
                    },
                    {
                        "en": "She bore him no ill will.",
                        "vi": "Cô không có ác ý với anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular name",
                    "vi": "có một cái tên cụ thể"
                },
                "examples": [
                    {
                        "en": "a family that bore an ancient and honoured name",
                        "vi": "một gia đình mang một cái tên cổ xưa và danh giá"
                    }
                ]
            },
            {
                "define": {
                    "en": "to carry somebody/something, especially while moving",
                    "vi": "để chở ai đó / cái gì đó, đặc biệt là trong khi di chuyển"
                },
                "examples": [
                    {
                        "en": "three kings bearing gifts",
                        "vi": "ba vị vua mang quà tặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, behave or act in a particular way",
                    "vi": "để di chuyển, cư xử hoặc hành động theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "He bears himself (= stands, walks, etc.) proudly, like a soldier.",
                        "vi": "Anh ta tự đứng (= đứng, đi, v.v.) một cách tự hào, như một người lính."
                    },
                    {
                        "en": "She bore herself with dignity throughout the funeral.",
                        "vi": "Cô ấy tự trang nghiêm mình trong suốt tang lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give birth to a child",
                    "vi": "sinh ra một đứa trẻ"
                },
                "examples": [
                    {
                        "en": "bear something She was not able to bear children.",
                        "vi": "chịu một cái gì đó Cô ấy không thể sinh con cái."
                    },
                    {
                        "en": "bear somebody something She had borne him six sons.",
                        "vi": "chịu ai đó một cái gì đó Cô đã sinh cho anh ta sáu người con trai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce flowers or fruit",
                    "vi": "để tạo ra hoa hoặc quả"
                },
                "examples": [
                    {
                        "en": "These trees take a long time to bear fruit.",
                        "vi": "Những cây này mất một thời gian dài để kết trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go or turn in the direction mentioned",
                    "vi": "để đi hoặc rẽ theo hướng đã đề cập"
                },
                "examples": [
                    {
                        "en": "When you get to the fork in the road, bear right.",
                        "vi": "Khi bạn đến ngã ba trên đường, rẽ phải."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a soldier; to fight",
                    "vi": "trở thành một người lính; chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a successful result",
                    "vi": "để có một kết quả thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a cause of difficulty or worry to somebody",
                    "vi": "trở thành nguyên nhân gây ra khó khăn hoặc lo lắng cho ai đó"
                },
                "examples": [
                    {
                        "en": "Taxation bears heavily on us all.",
                        "vi": "Thuế gánh nặng lên tất cả chúng ta."
                    },
                    {
                        "en": "The burden of the tax bore most heavily on the poor.",
                        "vi": "Gánh nặng của thuế đè nặng lên người nghèo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remember somebody/something; to remember or consider that…",
                    "vi": "để nhớ ai đó / cái gì đó; để ghi nhớ hoặc xem xét điều đó…"
                },
                "examples": [
                    {
                        "en": "You don't have to do anything about it now… just bear it in mind.",
                        "vi": "Bạn không cần phải làm bất cứ điều gì về nó bây giờ ... chỉ cần ghi nhớ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to receive the main force of something unpleasant",
                    "vi": "nhận được lực lượng chính của một cái gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "Schools will bear the brunt of cuts in government spending.",
                        "vi": "Các trường học sẽ phải chịu gánh nặng của việc cắt giảm chi tiêu của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide evidence of the truth of something",
                    "vi": "để cung cấp bằng chứng về sự thật của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The crowd of mourners at his funeral bore witness to the great affection in which he was held.",
                        "vi": "Đám đông những người thương tiếc tại tang lễ của ông đã chứng kiến tình cảm lớn lao mà ông đã được tổ chức."
                    },
                    {
                        "en": "The ancient temples bear silent witness to the passing dynasties.",
                        "vi": "Những ngôi chùa cổ kính là chứng tích thầm lặng cho các triều đại đi qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be realized by somebody, especially after a period of time",
                    "vi": "được ai đó nhận ra, đặc biệt là sau một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "It was gradually borne in on us that defeat was inevitable.",
                        "vi": "Chúng tôi dần dần nhận ra rằng thất bại là điều không thể tránh khỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use energy, pressure, influence, etc. to try to achieve something or make somebody do something",
                    "vi": "sử dụng năng lượng, áp lực, ảnh hưởng, v.v. để cố gắng đạt được điều gì đó hoặc khiến ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "We must bring all our energies to bear upon the task.",
                        "vi": "Chúng ta phải đem hết sức lực để gánh vác nhiệm vụ."
                    },
                    {
                        "en": "Pressure was brought to bear on us to finish the work on time.",
                        "vi": "Áp lực đè nặng lên chúng tôi để hoàn thành công việc đúng thời hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept pain or bad luck without complaining",
                    "vi": "chấp nhận đau đớn hoặc xui xẻo mà không phàn nàn"
                },
                "examples": [
                    {
                        "en": "There's nothing we can do about it. We'll just have to grin and bear it.",
                        "vi": "Chúng ta không thể làm gì được. Chúng tôi sẽ chỉ phải cười toe toét và chịu đựng điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a difficult problem that makes you worried or unhappy but that you have to deal with",
                    "vi": "gặp một vấn đề khó khăn khiến bạn lo lắng hoặc không vui nhưng bạn phải giải quyết"
                },
                "examples": [
                    {
                        "en": "We all have our crosses to bear.",
                        "vi": "Tất cả chúng ta đều có những thập giá của mình phải chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "51a72d136f894f068f28f8259d9f1130",
        "word": "bedevil",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪˈdevl/",
            "us": "/bɪˈdevl/"
        },
        "nearby": [
            {
                "word": "be derived from",
                "pos": "phrasal verb"
            },
            {
                "word": "be descended from",
                "pos": "phrasal verb"
            },
            {
                "word": "bedevil",
                "pos": "verb"
            },
            {
                "word": "bedfellow",
                "pos": "noun"
            },
            {
                "word": "Bedfordshire",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause a lot of problems for somebody/something over a long period of time",
                    "vi": "gây ra rất nhiều vấn đề cho ai đó / điều gì đó trong một khoảng thời gian dài"
                },
                "examples": [
                    {
                        "en": "The expedition was bedevilled by bad weather.",
                        "vi": "Cuộc thám hiểm đã bị tàn phá bởi thời tiết xấu."
                    },
                    {
                        "en": "This injury bedevilled him throughout his career.",
                        "vi": "Chấn thương này đã hành hạ anh ấy trong suốt sự nghiệp của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "1d2225f10fc747288d2e0e55523f94dc",
        "word": "bothersome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒðəsəm/",
            "us": "/ˈbɑːðərsəm/"
        },
        "nearby": [
            {
                "word": "bother",
                "pos": "exclamation"
            },
            {
                "word": "botheration",
                "pos": "exclamation"
            },
            {
                "word": "bothersome",
                "pos": "adjective"
            },
            {
                "word": "the Earl of Bothwell",
                "pos": ""
            },
            {
                "word": "bothy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing trouble or difficulty",
                    "vi": "gây rắc rối hoặc khó khăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "84f68ac1829c432ab29958d814c59b05",
        "word": "burdensome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɜːdnsəm/",
            "us": "/ˈbɜːrdnsəm/"
        },
        "nearby": [
            {
                "word": "burden",
                "pos": "verb"
            },
            {
                "word": "the burden of proof",
                "pos": "noun"
            },
            {
                "word": "burdensome",
                "pos": "adjective"
            },
            {
                "word": "burdock",
                "pos": "noun"
            },
            {
                "word": "bureau",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing worry, difficulty or hard work",
                    "vi": "gây ra lo lắng, khó khăn hoặc công việc khó khăn"
                },
                "examples": [
                    {
                        "en": "The new regulations will be burdensome for small businesses.",
                        "vi": "Các quy định mới sẽ là gánh nặng cho các doanh nghiệp nhỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ab6c936c5384501b43457529f89bf25",
        "word": "catch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kætʃ/",
            "us": "/kætʃ/"
        },
        "nearby": [
            {
                "word": "Catch-22",
                "pos": ""
            },
            {
                "word": "catch",
                "pos": "verb"
            },
            {
                "word": "catch",
                "pos": "noun"
            },
            {
                "word": "catch-all",
                "pos": "noun"
            },
            {
                "word": "catch-all",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of catching something, for example a ball",
                    "vi": "một hành động bắt một cái gì đó, ví dụ như một quả bóng"
                },
                "examples": [
                    {
                        "en": "Roger made some brilliant catches at today's game.",
                        "vi": "Roger đã thực hiện một số pha bắt bóng xuất sắc trong trận đấu hôm nay."
                    },
                    {
                        "en": "He dropped several easy catches.",
                        "vi": "Anh ta đã đánh rơi một vài cú bắt dễ dàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the total amount of things that are caught",
                    "vi": "tổng số thứ bị bắt"
                },
                "examples": [
                    {
                        "en": "a huge catch of fish",
                        "vi": "một lượng cá lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device used for fastening something",
                    "vi": "một thiết bị được sử dụng để buộc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Fran slipped the catch on the door, then turned to say goodbye.",
                        "vi": "Fran tuột tay bắt vào cửa, rồi quay lại chào tạm biệt."
                    },
                    {
                        "en": "I can’t open the catch on this bracelet.",
                        "vi": "Tôi không thể mở vòng đeo tay này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hidden difficulty or disadvantage",
                    "vi": "một khó khăn hoặc bất lợi tiềm ẩn"
                },
                "examples": [
                    {
                        "en": "All that money for two hours' work—what's the catch?",
                        "vi": "Tất cả số tiền đó cho hai giờ làm việc — lợi ích là gì?"
                    },
                    {
                        "en": "It sounds too good. There must be a catch.",
                        "vi": "Nghe có vẻ quá hay. Phải có một nắm bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a child’s game in which two people throw a ball to each other",
                    "vi": "trò chơi của một đứa trẻ trong đó hai người ném bóng vào nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person that other people see as a good person to marry, employ, etc.",
                    "vi": "một người mà người khác coi là người tốt để kết hôn, làm thuê, v.v."
                },
                "examples": [
                    {
                        "en": "He’s a good catch.",
                        "vi": "Anh ấy là một người bắt tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation from which there is no escape because you need to do one thing before doing a second, but you need to do the second thing before you can do the first",
                    "vi": "một tình huống khó khăn không có lối thoát vì bạn cần phải làm một việc trước khi làm điều thứ hai, nhưng bạn cần làm điều thứ hai trước khi bạn có thể làm điều đầu tiên"
                },
                "examples": [
                    {
                        "en": "I can't get a job because I haven't got anywhere to live but I can't afford a place to live until I get a job—it's a catch-22 situation.",
                        "vi": "Tôi không thể kiếm được việc làm bởi vì tôi không có nơi nào để sống nhưng tôi không thể mua được một nơi để sống cho đến khi tôi kiếm được việc làm — đó là một tình huống bắt gặp."
                    }
                ]
            }
        ]
    },
    {
        "id": "31f3a6719a2a4a798a5ff8ea707aab86",
        "word": "catch up with",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "catch-up",
                "pos": "noun"
            },
            {
                "word": "catch up on",
                "pos": "phrasal verb"
            },
            {
                "word": "catch up with",
                "pos": "phrasal verb"
            },
            {
                "word": "catchword",
                "pos": "noun"
            },
            {
                "word": "catchy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to finally start to cause problems for somebody after they have managed to avoid this for some time",
                    "vi": "cuối cùng bắt đầu gây ra vấn đề cho ai đó sau khi họ đã tránh được điều này trong một thời gian"
                },
                "examples": [
                    {
                        "en": "She was terrified that one day her past problems would catch up with her.",
                        "vi": "Cô sợ hãi rằng một ngày nào đó những vấn đề trong quá khứ của cô sẽ bắt kịp cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the police or authorities catch up with somebody, they find and punish them after some time",
                    "vi": "nếu cảnh sát hoặc chính quyền bắt được ai đó, họ sẽ tìm và trừng phạt họ sau một thời gian"
                },
                "examples": [
                    {
                        "en": "The law caught up with him years later when he had moved to Spain.",
                        "vi": "Luật pháp bắt kịp anh ta nhiều năm sau đó khi anh ta chuyển đến Tây Ban Nha."
                    }
                ]
            }
        ]
    },
    {
        "id": "0933ef5991514864964c83251f21fc70",
        "word": "dog",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/dɒɡ/",
            "us": "/dɔːɡ/"
        },
        "nearby": [
            {
                "word": "do for",
                "pos": "phrasal verb"
            },
            {
                "word": "dog",
                "pos": "noun"
            },
            {
                "word": "dog",
                "pos": "verb"
            },
            {
                "word": "dog biscuit",
                "pos": "noun"
            },
            {
                "word": "dogbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause you trouble for a long time",
                    "vi": "gây rắc rối cho bạn trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "be dogged by something He had been dogged by ill health all his life.",
                        "vi": "được cầu xin bởi một điều gì đó Ông đã phải cầu xin bởi sức khỏe kém suốt cuộc đời."
                    },
                    {
                        "en": "Her career was dogged by misfortune.",
                        "vi": "Sự nghiệp của cô bị sa sút bởi bất hạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to follow somebody closely",
                    "vi": "theo dõi ai đó chặt chẽ"
                },
                "examples": [
                    {
                        "en": "She had the impression that someone was dogging her steps.",
                        "vi": "Cô có ấn tượng rằng ai đó đang làm chùn bước mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be lazy or make no effort",
                    "vi": "lười biếng hoặc không nỗ lực"
                },
                "examples": [
                    {
                        "en": "He was criticized for dogging it after a poor performance in the game.",
                        "vi": "Anh ấy đã bị chỉ trích vì làm hỏng nó sau một màn trình diễn kém cỏi trong trò chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "37a18943061d4170917a5fca0a45158d",
        "word": "hang-up",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæŋ ʌp/",
            "us": "/ˈhæŋ ʌp/"
        },
        "nearby": [
            {
                "word": "hang together",
                "pos": "phrasal verb"
            },
            {
                "word": "hang up",
                "pos": "phrasal verb"
            },
            {
                "word": "hang-up",
                "pos": "noun"
            },
            {
                "word": "hang up on",
                "pos": "phrasal verb"
            },
            {
                "word": "hank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an emotional problem about something that makes you embarrassed or worried",
                    "vi": "một vấn đề cảm xúc về điều gì đó khiến bạn xấu hổ hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "He's got a real hang-up about his height.",
                        "vi": "Anh ấy thực sự băn khoăn về chiều cao của mình."
                    },
                    {
                        "en": "sexual hang-ups",
                        "vi": "treo lên tình dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a problem that delays something being agreed or achieved",
                    "vi": "một vấn đề làm trì hoãn một cái gì đó được đồng ý hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "The ABM treaty is a key hang-up in negotiations.",
                        "vi": "Hiệp ước ABM là mấu chốt quan trọng trong các cuộc đàm phán."
                    }
                ]
            }
        ]
    },
    {
        "id": "e71f72a91477445cb4fc70e723135b68",
        "word": "hassle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæsl/",
            "us": "/ˈhæsl/"
        },
        "nearby": [
            {
                "word": "hassium",
                "pos": "noun"
            },
            {
                "word": "hassle",
                "pos": "noun"
            },
            {
                "word": "hassle",
                "pos": "verb"
            },
            {
                "word": "hassock",
                "pos": "noun"
            },
            {
                "word": "hast",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to annoy somebody or cause them trouble, especially by asking them to do something many times",
                    "vi": "làm phiền ai đó hoặc gây rắc rối cho họ, đặc biệt là bằng cách yêu cầu họ làm điều gì đó nhiều lần"
                },
                "examples": [
                    {
                        "en": "Don't keep hassling me! I'll do it later.",
                        "vi": "Đừng tiếp tục làm phiền tôi! Tôi sẽ làm điều đó sau."
                    },
                    {
                        "en": "Your brother’s been hassling me for cash.",
                        "vi": "Anh trai của bạn đã làm phiền tôi vì tiền mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "d2cce9bad5514580b70d38df629e9530",
        "word": "hitch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hɪtʃ/",
            "us": "/hɪtʃ/"
        },
        "nearby": [
            {
                "word": "hit back",
                "pos": "phrasal verb"
            },
            {
                "word": "hitch",
                "pos": "verb"
            },
            {
                "word": "hitch",
                "pos": "noun"
            },
            {
                "word": "Alfred Hitchcock",
                "pos": ""
            },
            {
                "word": "hitchhike",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem or difficulty that causes a short delay",
                    "vi": "một vấn đề hoặc khó khăn gây ra sự chậm trễ trong thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "without a hitch The ceremony went off without a hitch.",
                        "vi": "Không gặp bất cứ trở ngại nào. Buổi lễ diễn ra mà không gặp trở ngại nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of knot (= a join made by tying together two pieces or ends of rope, etc.)",
                    "vi": "một kiểu thắt nút (= mối nối được thực hiện bằng cách buộc hai đoạn hoặc đầu dây lại với nhau, v.v.)"
                },
                "examples": [
                    {
                        "en": "a clove hitch",
                        "vi": "một cái đinh hương"
                    }
                ]
            }
        ]
    },
    {
        "id": "edfafac1aaab499093fa97b73e7ddee0",
        "word": "hostile",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒstaɪl/",
            "us": "/ˈhɑːstl/"
        },
        "nearby": [
            {
                "word": "hostelry",
                "pos": "noun"
            },
            {
                "word": "hostess",
                "pos": "noun"
            },
            {
                "word": "hostile",
                "pos": "adjective"
            },
            {
                "word": "hostile witness",
                "pos": "noun"
            },
            {
                "word": "hostility",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "aggressive or unfriendly and ready to argue or fight",
                    "vi": "hung hăng hoặc không thân thiện và sẵn sàng tranh cãi hoặc đánh nhau"
                },
                "examples": [
                    {
                        "en": "The speaker got a hostile reception from the audience.",
                        "vi": "Người nói đã nhận được sự đón nhận nhiệt tình từ khán giả."
                    },
                    {
                        "en": "hostile to/towards somebody/something She was openly hostile towards her parents.",
                        "vi": "thù địch với / đối với ai đó / cái gì đó Cô ấy công khai thù địch với cha mẹ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "strongly rejecting something",
                    "vi": "từ chối mạnh mẽ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The proposals have provoked a hostile response from opposition parties.",
                        "vi": "Các đề xuất đã gây ra phản ứng thù địch từ các đảng đối lập."
                    },
                    {
                        "en": "hostile to something Many of the employees were hostile to the idea of change.",
                        "vi": "thù địch với điều gì đó Nhiều nhân viên không thích ý tưởng về sự thay đổi."
                    },
                    {
                        "en": "Many people were openly hostile to the idea.",
                        "vi": "Nhiều người đã công khai thù địch với ý tưởng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "making it difficult for something to happen or to be achieved",
                    "vi": "làm cho điều gì đó khó xảy ra hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "hostile conditions for plants to grow in",
                        "vi": "điều kiện thù địch cho thực vật phát triển"
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a military enemy",
                    "vi": "thuộc về kẻ thù quân sự"
                },
                "examples": [
                    {
                        "en": "hostile territory",
                        "vi": "lãnh thổ thù địch"
                    }
                ]
            },
            {
                "define": {
                    "en": "not wanted by the company that is to be bought",
                    "vi": "không muốn bởi công ty sẽ được mua"
                },
                "examples": [
                    {
                        "en": "a hostile takeover bid",
                        "vi": "một giá thầu tiếp quản thù địch"
                    }
                ]
            }
        ]
    },
    {
        "id": "a7f972cba7674b4a888bdf8767c94afc",
        "word": "incommode",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnkəˈməʊd/",
            "us": "/ˌɪnkəˈməʊd/"
        },
        "nearby": [
            {
                "word": "incommensurable",
                "pos": "adjective"
            },
            {
                "word": "incommensurate",
                "pos": "adjective"
            },
            {
                "word": "incommode",
                "pos": "verb"
            },
            {
                "word": "incommunicado",
                "pos": "adjective"
            },
            {
                "word": "incomparability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause somebody difficulties or problems",
                    "vi": "gây khó khăn hoặc vấn đề cho ai đó"
                },
                "examples": [
                    {
                        "en": "We are very sorry to have incommoded you.",
                        "vi": "Chúng tôi rất xin lỗi vì đã thay đổi chỗ ở cho bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "245214f73ce64111a3ca07c29b981a37",
        "word": "indaba",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈdɑːbə/",
            "us": "/ɪnˈdɑːbə/"
        },
        "nearby": [
            {
                "word": "incus",
                "pos": "noun"
            },
            {
                "word": "Ind.",
                "pos": "abbreviation"
            },
            {
                "word": "indaba",
                "pos": "noun"
            },
            {
                "word": "indebted",
                "pos": "adjective"
            },
            {
                "word": "indebtedness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large meeting at which politicians, professional people, etc. have discussions about an important subject",
                    "vi": "một cuộc họp lớn trong đó các chính trị gia, những người chuyên nghiệp, v.v. thảo luận về một chủ đề quan trọng"
                },
                "examples": [
                    {
                        "en": "a national indaba on land reform",
                        "vi": "một indaba quốc gia về cải cách ruộng đất"
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficulty or matter that affects you",
                    "vi": "một khó khăn hoặc vấn đề ảnh hưởng đến bạn"
                },
                "examples": [
                    {
                        "en": "I don't care what he does. That's his indaba!",
                        "vi": "Tôi không quan tâm anh ta làm gì. Đó là indaba của anh ấy!"
                    }
                ]
            }
        ]
    },
    {
        "id": "e87e63d9ff4e47c1bf4592f7dd2682be",
        "word": "make a rod for your own back",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/rɒd/",
            "us": "/rɑːd/"
        },
        "nearby": [
            {
                "word": "the Rocky Mountain States",
                "pos": "noun"
            },
            {
                "word": "rococo",
                "pos": "adjective"
            },
            {
                "word": "rod",
                "pos": "noun"
            },
            {
                "word": "Rod",
                "pos": ""
            },
            {
                "word": "Anita Roddick",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long straight piece of wood, metal or glass",
                    "vi": "một mảnh gỗ, kim loại hoặc thủy tinh dài thẳng"
                },
                "examples": [
                    {
                        "en": "The concrete is reinforced with steel rods.",
                        "vi": "Bê tông được gia cố bằng các thanh thép."
                    },
                    {
                        "en": "I finally managed to fix the curtain rods above the windows.",
                        "vi": "Cuối cùng thì tôi cũng đã sửa được các thanh rèm phía trên cửa sổ."
                    },
                    {
                        "en": "After the accident she had an operation to put strengthening rods in her legs.",
                        "vi": "Sau tai nạn, cô ấy đã phải phẫu thuật để đặt các thanh tăng cường vào chân."
                    },
                    {
                        "en": "He heated the end of the iron rod.",
                        "vi": "Anh ta nung nóng đầu thanh sắt."
                    },
                    {
                        "en": "a glass fibre rod 2 or 3 mm in diameter",
                        "vi": "một thanh sợi thủy tinh có đường kính 2 hoặc 3 mm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long wooden or plastic stick with a fishing line and hook attached, used for catching fish",
                    "vi": "một thanh dài bằng gỗ hoặc nhựa có gắn dây câu và móc câu dùng để bắt cá"
                },
                "examples": [
                    {
                        "en": "fishing with rod and line",
                        "vi": "câu cá bằng cần và dây"
                    }
                ]
            },
            {
                "define": {
                    "en": "a stick that is used for hitting people as a punishment",
                    "vi": "một cây gậy được sử dụng để đánh người như một hình phạt"
                },
                "examples": [
                    {
                        "en": "There used to be a saying: ‘Spare the rod and spoil the child.’",
                        "vi": "Người ta từng có câu: '' Cần gì phải bổ, con lại hư ''."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small gun",
                    "vi": "một khẩu súng nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something that will cause problems for you in the future",
                    "vi": "làm điều gì đó sẽ gây ra vấn đề cho bạn trong tương lai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a fact, an argument, etc. that is used in order to blame or punish somebody",
                    "vi": "một thực tế, một lập luận, v.v. được sử dụng để đổ lỗi hoặc trừng phạt ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to control a person or a group of people very severely",
                    "vi": "kiểm soát một người hoặc một nhóm người rất nghiêm khắc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca7d3b5fdb0e4952956f691bd43c87d2",
        "word": "nettlesome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnetlsəm/",
            "us": "/ˈnetlsəm/"
        },
        "nearby": [
            {
                "word": "nettle",
                "pos": "verb"
            },
            {
                "word": "nettlerash",
                "pos": "noun"
            },
            {
                "word": "nettlesome",
                "pos": "adjective"
            },
            {
                "word": "network",
                "pos": "noun"
            },
            {
                "word": "network",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing trouble or difficulty",
                    "vi": "gây rắc rối hoặc khó khăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a93fc74cc74b4d6dbe09e81680550a53",
        "word": "obstacle course",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒbstəkl kɔːs/",
            "us": "/ˈɑːbstəkl kɔːrs/"
        },
        "nearby": [
            {
                "word": "obsolete",
                "pos": "adjective"
            },
            {
                "word": "obstacle",
                "pos": "noun"
            },
            {
                "word": "obstacle course",
                "pos": "noun"
            },
            {
                "word": "obstacle race",
                "pos": "noun"
            },
            {
                "word": "obstetric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of objects that people taking part in a race have to climb over, under, through, etc.",
                    "vi": "hàng loạt đồ vật mà người tham gia cuộc đua phải trèo qua, chui xuống, chui qua, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a series of difficulties that people have to deal with in order to achieve a particular aim",
                    "vi": "một loạt những khó khăn mà mọi người phải đối phó để đạt được một mục tiêu cụ thể"
                },
                "examples": [
                    {
                        "en": "We assume that competent doctors emerge at the end of an obstacle course of traditional examinations based on facts.",
                        "vi": "Chúng tôi giả định rằng các bác sĩ có năng lực xuất hiện ở giai đoạn cuối của một chướng ngại vật của các kỳ thi truyền thống dựa trên thực tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land with many objects that are difficult to climb, jump over or go through, which is used, especially by soldiers, for improving physical skills and strength",
                    "vi": "Khu vực đất có nhiều vật thể khó trèo, nhảy qua, vượt qua được các binh sĩ, đặc biệt là quân nhân sử dụng để nâng cao thể chất và sức mạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "18d32511d6c3464e9d82c85e6ae2bc68",
        "word": "plague",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pleɪɡ/",
            "us": "/pleɪɡ/"
        },
        "nearby": [
            {
                "word": "plagiarize",
                "pos": "verb"
            },
            {
                "word": "plague",
                "pos": "noun"
            },
            {
                "word": "plague",
                "pos": "verb"
            },
            {
                "word": "plaice",
                "pos": "noun"
            },
            {
                "word": "plaid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause pain or trouble to somebody/something over a period of time",
                    "vi": "gây đau đớn hoặc rắc rối cho ai đó / điều gì đó trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "to be plagued by doubt",
                        "vi": "bị cản trở bởi nghi ngờ"
                    },
                    {
                        "en": "Financial problems are plaguing the company.",
                        "vi": "Các vấn đề tài chính đang gây khó khăn cho công ty."
                    },
                    {
                        "en": "The team has been plagued by injury this season.",
                        "vi": "Đội bóng đã bị ảnh hưởng bởi chấn thương trong mùa giải này."
                    },
                    {
                        "en": "Economic problems continued to plague the country.",
                        "vi": "Các vấn đề kinh tế tiếp tục hoành hành đất nước."
                    },
                    {
                        "en": "He has been plagued with leg injuries this season.",
                        "vi": "Anh ấy đã dính chấn thương ở chân trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody or create problems, especially by asking for something, demanding attention, etc.",
                    "vi": "để làm phiền ai đó hoặc tạo ra vấn đề, đặc biệt là bằng cách yêu cầu một cái gì đó, đòi hỏi sự chú ý, v.v."
                },
                "examples": [
                    {
                        "en": "Rock stars have to get used to being plagued by autograph hunters.",
                        "vi": "Các ngôi sao nhạc rock đã phải quen với việc bị những kẻ săn chữ ký làm phiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "f92f85ae46624282887ddbe81d0ed08f",
        "word": "play up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "plaything",
                "pos": "noun"
            },
            {
                "word": "playtime",
                "pos": "noun"
            },
            {
                "word": "play up",
                "pos": "phrasal verb"
            },
            {
                "word": "play upon",
                "pos": "phrasal verb"
            },
            {
                "word": "play with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to behave badly",
                    "vi": "cư xử tệ"
                },
                "examples": [
                    {
                        "en": "The kids have been playing up all day.",
                        "vi": "Những đứa trẻ đã chơi cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody problems or pain",
                    "vi": "gây ra vấn đề hoặc đau đớn cho ai đó"
                },
                "examples": [
                    {
                        "en": "My shoulder is playing me up today.",
                        "vi": "Ngày hôm nay vai của tôi đang đóng vai tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to make something seem more important than it really is",
                    "vi": "cố gắng làm cho điều gì đó có vẻ quan trọng hơn thực tế"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aa6df610a3274e21bac001b2e12d675f",
        "word": "put out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "putonghua",
                "pos": "noun"
            },
            {
                "word": "put onto",
                "pos": "phrasal verb"
            },
            {
                "word": "put out",
                "pos": "phrasal verb"
            },
            {
                "word": "put over",
                "pos": "phrasal verb"
            },
            {
                "word": "putrefaction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to agree to have sex with somebody",
                    "vi": "đồng ý quan hệ tình dục với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause somebody trouble, extra work, etc.",
                    "vi": "gây rắc rối cho ai đó, làm thêm, v.v."
                },
                "examples": [
                    {
                        "en": "I hope our arriving late didn't put them out.",
                        "vi": "Tôi hy vọng việc chúng tôi đến muộn không làm họ bị loại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be upset or offended",
                    "vi": "khó chịu hoặc bị xúc phạm"
                },
                "examples": [
                    {
                        "en": "He looked really put out.",
                        "vi": "Anh ấy trông thực sự xuất sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody unconscious",
                    "vi": "làm cho ai đó bất tỉnh"
                },
                "examples": [
                    {
                        "en": "These pills should put him out for a few hours.",
                        "vi": "Những viên thuốc này sẽ khiến anh ta khỏi trong vài giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take something out of your house and leave it, for example for somebody to collect",
                    "vi": "lấy một thứ gì đó ra khỏi nhà của bạn và để lại, chẳng hạn như để ai đó thu thập"
                },
                "examples": [
                    {
                        "en": "(British English) to put the rubbish out",
                        "vi": "(Anh Anh) để bỏ rác ra ngoài"
                    },
                    {
                        "en": "(North American English) to put the garbage/trash out",
                        "vi": "(Tiếng Anh Bắc Mỹ) để bỏ rác / thùng rác ra ngoài"
                    }
                ]
            },
            {
                "define": {
                    "en": "to place something where it will be noticed and used",
                    "vi": "để đặt thứ gì đó ở nơi nó sẽ được chú ý và sử dụng"
                },
                "examples": [
                    {
                        "en": "Have you put out clean towels for the guests?",
                        "vi": "Bạn đã đưa khăn sạch cho khách chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop something from burning or shining",
                    "vi": "để ngăn một thứ gì đó cháy hoặc sáng"
                },
                "examples": [
                    {
                        "en": "to put out a candle/cigarette/light",
                        "vi": "châm một ngọn nến / điếu thuốc / ánh sáng"
                    },
                    {
                        "en": "Firefighters soon put the fire out.",
                        "vi": "Lực lượng cứu hỏa ngay sau đó đã dập lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce something, especially for sale",
                    "vi": "để sản xuất một cái gì đó, đặc biệt là để bán"
                },
                "examples": [
                    {
                        "en": "The factory puts out 500 new cars a week.",
                        "vi": "Nhà máy sản xuất 500 chiếc xe mới mỗi tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to publish or broadcast something",
                    "vi": "để xuất bản hoặc phát sóng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Police have put out a description of the man they wish to question.",
                        "vi": "Cảnh sát đã đưa ra một mô tả về người đàn ông mà họ muốn thẩm vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a job or task to a worker who is not your employee or to a company that is not part of your own group or organization",
                    "vi": "giao một công việc hoặc nhiệm vụ cho một nhân viên không phải là nhân viên của bạn hoặc cho một công ty không thuộc nhóm hoặc tổ chức của riêng bạn"
                },
                "examples": [
                    {
                        "en": "A lot of the work is put out to freelancers.",
                        "vi": "Rất nhiều công việc được giao cho các dịch giả tự do."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a figure, result, etc. wrong",
                    "vi": "sai một con số, kết quả, v.v."
                },
                "examples": [
                    {
                        "en": "The rise in interest rates put our estimates out by several thousands.",
                        "vi": "Việc tăng lãi suất khiến ước tính của chúng tôi bị chênh lệch hàng nghìn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to push a bone out of its normal position",
                    "vi": "đẩy xương ra khỏi vị trí bình thường của nó"
                },
                "examples": [
                    {
                        "en": "She fell off her horse and put her shoulder out.",
                        "vi": "Cô ngã ngựa và đưa vai ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop or produce new leaves, shoots, etc.",
                    "vi": "để phát triển hoặc tạo ra lá, chồi mới, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to leave a port",
                    "vi": "rời khỏi một cảng"
                },
                "examples": [
                    {
                        "en": "to put out to sea",
                        "vi": "ra khơi"
                    },
                    {
                        "en": "We put out from Liverpool.",
                        "vi": "Chúng tôi đưa ra từ Liverpool."
                    }
                ]
            }
        ]
    },
    {
        "id": "8b4e2ffdf82e40638dd4270d7e4e8483",
        "word": "put to",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "put through",
                "pos": "phrasal verb"
            },
            {
                "word": "putting green",
                "pos": "noun"
            },
            {
                "word": "put to",
                "pos": "phrasal verb"
            },
            {
                "word": "put together",
                "pos": "phrasal verb"
            },
            {
                "word": "put towards",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause somebody trouble, difficulty, etc.",
                    "vi": "gây rắc rối, khó khăn cho ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "I hope we're not putting you to too much trouble.",
                        "vi": "Tôi hy vọng chúng tôi không làm bạn gặp quá nhiều rắc rối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to offer a suggestion to somebody so that they can accept or reject it",
                    "vi": "đưa ra một đề xuất cho ai đó để họ có thể chấp nhận hoặc từ chối nó"
                },
                "examples": [
                    {
                        "en": "Your proposal will be put to the board of directors.",
                        "vi": "Đề xuất của bạn sẽ được đưa lên ban giám đốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a question",
                    "vi": "hỏi ai đó một câu hỏi"
                },
                "examples": [
                    {
                        "en": "The audience is now invited to put questions to the speaker.",
                        "vi": "Khán giả bây giờ được mời đặt câu hỏi cho diễn giả."
                    }
                ]
            }
        ]
    },
    {
        "id": "fc3c7334cee547e5ae8f206c43cd07c5",
        "word": "rub",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌb/",
            "us": "/rʌb/"
        },
        "nearby": [
            {
                "word": "Rt Revd",
                "pos": "abbreviation"
            },
            {
                "word": "rub",
                "pos": "verb"
            },
            {
                "word": "rub",
                "pos": "noun"
            },
            {
                "word": "rub along",
                "pos": "phrasal verb"
            },
            {
                "word": "rubber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of rubbing a surface",
                    "vi": "một hành động cọ xát bề mặt"
                },
                "examples": [
                    {
                        "en": "She gave her knee a quick rub.",
                        "vi": "Cô nhanh chóng xoa đầu gối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a problem or difficulty",
                    "vi": "một vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "The hotel is in the middle of nowhere and there lies the rub. We don't have a car.",
                        "vi": "Khách sạn ở giữa hư không và nằm ở đó. Chúng tôi không có xe hơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "275ee966f0f04d9bacf44c99116bb7fa",
        "word": "snag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/snæɡ/",
            "us": "/snæɡ/"
        },
        "nearby": [
            {
                "word": "snaffle",
                "pos": "verb"
            },
            {
                "word": "snafu",
                "pos": "noun"
            },
            {
                "word": "snag",
                "pos": "noun"
            },
            {
                "word": "snag",
                "pos": "verb"
            },
            {
                "word": "snaggle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem or difficulty, especially one that is small, hidden or unexpected",
                    "vi": "một vấn đề hoặc khó khăn, đặc biệt là một vấn đề nhỏ, ẩn hoặc bất ngờ"
                },
                "examples": [
                    {
                        "en": "There is just one small snag—where is the money coming from?",
                        "vi": "Chỉ có một khó khăn nhỏ - tiền đến từ đâu?"
                    },
                    {
                        "en": "Let me know if you run into any snags.",
                        "vi": "Hãy cho tôi biết nếu bạn gặp bất kỳ khó khăn nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object or a part of an object that is rough or sharp and may cut something",
                    "vi": "một vật thể hoặc một bộ phận của vật thể thô ráp hoặc sắc nhọn và có thể cắt một vật gì đó"
                },
                "examples": [
                    {
                        "en": "Check all surfaces for snags and rough edges.",
                        "vi": "Kiểm tra tất cả các bề mặt để tìm các vết nứt và các cạnh gồ ghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sausage",
                    "vi": "xúc xích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6d1eccb23f34fdf83bbf647a48fc083",
        "word": "technical hitch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌteknɪkl ˈhɪtʃ/",
            "us": "/ˌteknɪkl ˈhɪtʃ/"
        },
        "nearby": [
            {
                "word": "technical drawing",
                "pos": "noun"
            },
            {
                "word": "technical foul",
                "pos": "noun"
            },
            {
                "word": "technical hitch",
                "pos": "noun"
            },
            {
                "word": "technicality",
                "pos": "noun"
            },
            {
                "word": "technical knockout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a temporary problem or difficulty, especially one caused by a machine or a piece of equipment",
                    "vi": "sự cố hoặc khó khăn tạm thời, đặc biệt là sự cố do máy móc hoặc thiết bị gây ra"
                },
                "examples": [
                    {
                        "en": "Because of a technical hitch, we are unable to bring you the advertised programme.",
                        "vi": "Do gặp trục trặc kỹ thuật, chúng tôi không thể cung cấp cho bạn chương trình đã quảng cáo."
                    },
                    {
                        "en": "There was a slight technical hitch that delayed the plane's take-off.",
                        "vi": "Có một sự cố kỹ thuật nhỏ đã làm trì hoãn việc cất cánh của máy bay."
                    }
                ]
            }
        ]
    },
    {
        "id": "580d6ffbbe5b42529396ac675fb2f6a8",
        "word": "thorny",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθɔːni/",
            "us": "/ˈθɔːrni/"
        },
        "nearby": [
            {
                "word": "thorn",
                "pos": "noun"
            },
            {
                "word": "Sybil Thorndike",
                "pos": ""
            },
            {
                "word": "thorny",
                "pos": "adjective"
            },
            {
                "word": "thorough",
                "pos": "adjective"
            },
            {
                "word": "thoroughbred",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing difficulty or disagreement",
                    "vi": "gây khó khăn hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "There are still some thorny questions to be answered.",
                        "vi": "Vẫn còn một số câu hỏi hóc búa cần được giải đáp."
                    },
                    {
                        "en": "They must tackle the thorny issue of free speech.",
                        "vi": "Họ phải giải quyết vấn đề hóc búa về quyền tự do ngôn luận."
                    },
                    {
                        "en": "It's an elegant solution to a thorny problem.",
                        "vi": "Đó là một giải pháp thanh lịch cho một vấn đề hóc búa."
                    }
                ]
            },
            {
                "define": {
                    "en": "having thorns",
                    "vi": "có gai"
                },
                "examples": [
                    {
                        "en": "a thorny bush",
                        "vi": "một bụi gai"
                    }
                ]
            }
        ]
    },
    {
        "id": "895892842e0a4f90ac29a4e2d400c8c2",
        "word": "troublesome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrʌblsəm/",
            "us": "/ˈtrʌblsəm/"
        },
        "nearby": [
            {
                "word": "troubleshooter",
                "pos": "noun"
            },
            {
                "word": "troubleshooting",
                "pos": "noun"
            },
            {
                "word": "troublesome",
                "pos": "adjective"
            },
            {
                "word": "trouble spot",
                "pos": "noun"
            },
            {
                "word": "trough",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing trouble, pain, etc. over a long period of time",
                    "vi": "gây rắc rối, đau đớn, v.v. trong thời gian dài"
                },
                "examples": [
                    {
                        "en": "a troublesome cough/child/problem",
                        "vi": "một cơn ho / đứa trẻ / vấn đề rắc rối"
                    }
                ]
            }
        ]
    }
]