[
    {
        "id": "6a904a14a21246f890de905fd298e767",
        "word": "play",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/pleɪ/",
            "us": "/pleɪ/"
        },
        "nearby": [
            {
                "word": "plausibly",
                "pos": "adverb"
            },
            {
                "word": "play",
                "pos": "verb"
            },
            {
                "word": "play",
                "pos": "noun"
            },
            {
                "word": "playable",
                "pos": "adjective"
            },
            {
                "word": "play about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing performed by actors in a theatre or on television or radio",
                    "vi": "một đoạn văn do các diễn viên biểu diễn trong nhà hát hoặc trên truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "a stage/radio play",
                        "vi": "một vở kịch trên sân khấu / đài phát thanh"
                    },
                    {
                        "en": "She wrote a play for the students to perform.",
                        "vi": "Cô viết một vở kịch cho học sinh biểu diễn."
                    },
                    {
                        "en": "to put on/stage a play",
                        "vi": "để đưa / lên sân khấu một vở kịch"
                    },
                    {
                        "en": "to produce/direct a play",
                        "vi": "để sản xuất / đạo diễn một vở kịch"
                    },
                    {
                        "en": "play by somebody a play by Shakespeare",
                        "vi": "chơi bởi ai đó một vở kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "things that people, especially children, do for pleasure rather than as work",
                    "vi": "những việc mà mọi người, đặc biệt là trẻ em, làm vì niềm vui hơn là vì công việc"
                },
                "examples": [
                    {
                        "en": "the importance of learning through play",
                        "vi": "tầm quan trọng của việc học thông qua chơi"
                    },
                    {
                        "en": "Making time for both work and play is not easy.",
                        "vi": "Dành thời gian cho cả công việc và giải trí không phải là điều dễ dàng."
                    },
                    {
                        "en": "at play the happy sounds of children at play",
                        "vi": "khi chơi những âm thanh vui vẻ của trẻ em khi chơi"
                    },
                    {
                        "en": "The site offers sports facilities, including tennis courts, and a children's play area.",
                        "vi": "Trang web cung cấp các cơ sở thể thao, bao gồm sân tennis và khu vui chơi dành cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "the playing of a game",
                    "vi": "chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "Rain stopped play.",
                        "vi": "Mưa ngừng chơi."
                    },
                    {
                        "en": "There was some excellent play in yesterday's match.",
                        "vi": "Đã có một số màn chơi xuất sắc trong trận đấu ngày hôm qua."
                    },
                    {
                        "en": "The spectators were asked to be quiet during play.",
                        "vi": "Các khán giả được yêu cầu im lặng trong khi chơi."
                    },
                    {
                        "en": "This video game has fast and exciting game play.",
                        "vi": "Trò chơi điện tử này có tốc độ chơi trò chơi nhanh và thú vị."
                    },
                    {
                        "en": "Does online play have a negative effect on gaming?",
                        "vi": "Chơi trực tuyến có ảnh hưởng xấu đến chơi game không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an action or move in a game",
                    "vi": "một hành động hoặc di chuyển trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "He made several nice defensive plays.",
                        "vi": "Anh ấy đã thực hiện một số pha chơi phòng ngự đẹp mắt."
                    },
                    {
                        "en": "They are playing better now, making big plays at key times.",
                        "vi": "Họ đang chơi tốt hơn bây giờ, tạo ra những vở kịch lớn vào những thời điểm quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity or operation of something; the influence of something on something else",
                    "vi": "hoạt động hoặc hoạt động của một cái gì đó; ảnh hưởng của thứ gì đó lên thứ khác"
                },
                "examples": [
                    {
                        "en": "the free play of market forces",
                        "vi": "cuộc chơi tự do của các lực lượng thị trường"
                    },
                    {
                        "en": "in play More powerful forces are in play.",
                        "vi": "đang chơi Các lực lượng mạnh mẽ hơn đang chơi."
                    },
                    {
                        "en": "The financial crisis has brought new factors into play.",
                        "vi": "Cuộc khủng hoảng tài chính đã kéo theo những nhân tố mới vào cuộc."
                    },
                    {
                        "en": "Personal feelings should not come into play when you are making business decisions.",
                        "vi": "Cảm xúc cá nhân không nên phát huy tác dụng khi bạn đưa ra quyết định kinh doanh."
                    },
                    {
                        "en": "at play Other issues such as market power could be at play.",
                        "vi": "Các vấn đề khác như sức mạnh thị trường có thể xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "the possibility of free and easy movement",
                    "vi": "khả năng di chuyển tự do và dễ dàng"
                },
                "examples": [
                    {
                        "en": "We need more play in the rope.",
                        "vi": "Chúng tôi cần chơi nhiều hơn trên dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a light, quick movement that keeps changing",
                    "vi": "một chuyển động nhẹ, nhanh chóng liên tục thay đổi"
                },
                "examples": [
                    {
                        "en": "the play of sunlight on water",
                        "vi": "trò chơi của ánh sáng mặt trời trên mặt nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not healthy to spend all your time working; you need to relax too",
                    "vi": "không có lợi cho sức khỏe nếu bạn dành toàn bộ thời gian để làm việc; bạn cũng cần thư giãn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very easy to do, so not even a child would find it difficult",
                    "vi": "rất dễ thực hiện, vì vậy ngay cả một đứa trẻ cũng không cảm thấy khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make use of something",
                    "vi": "để sử dụng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Chess is a game that calls into play all your powers of concentration.",
                        "vi": "Cờ vua là một trò chơi đòi hỏi bạn phải phát huy hết khả năng tập trung của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time playing with a toy, game, etc.",
                    "vi": "dành thời gian chơi với đồ chơi, trò chơi, v.v."
                },
                "examples": [
                    {
                        "en": "I had a play with the new computer game.",
                        "vi": "Tôi đã chơi với trò chơi máy tính mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "inside/outside the area allowed by the rules of the game",
                    "vi": "trong / ngoài khu vực cho phép của luật chơi"
                },
                "examples": [
                    {
                        "en": "She just managed to keep the ball in play.",
                        "vi": "Cô ấy chỉ quản lý để giữ bóng trong cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to emphasize the importance of a particular fact",
                    "vi": "để nhấn mạnh tầm quan trọng của một sự kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "He made great play of the fact that his uncle was a duke.",
                        "vi": "Anh ấy đã chơi tuyệt vời việc chú của anh ấy là một công tước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to obtain something; to do things that are intended to produce a particular result",
                    "vi": "để cố gắng đạt được một cái gì đó; để làm những việc nhằm tạo ra một kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "She was making a play for the sales manager's job.",
                        "vi": "Cô ấy đang đóng kịch cho công việc của giám đốc bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the humorous use of a word or phrase that can have two different meanings",
                    "vi": "cách sử dụng hài hước của một từ hoặc cụm từ có thể có hai nghĩa khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the stage that has been reached in a process, etc. which has not yet been completed",
                    "vi": "giai đoạn đã đạt được trong một quy trình, v.v. vẫn chưa được hoàn thành"
                },
                "examples": [
                    {
                        "en": "What is the current state of play in the peace talks?",
                        "vi": "Tình trạng hiện tại của cuộc đàm phán hòa bình là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the score in a sports match, especially in cricket",
                    "vi": "điểm số trong một trận đấu thể thao, đặc biệt là môn cricket"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c36a74e06e3f4273b6204eb2ac8df4dc",
        "word": "comedy",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkɒmədi/",
            "us": "/ˈkɑːmədi/"
        },
        "nearby": [
            {
                "word": "come down to",
                "pos": "phrasal verb"
            },
            {
                "word": "come down with",
                "pos": "phrasal verb"
            },
            {
                "word": "comedy",
                "pos": "noun"
            },
            {
                "word": "The Comedy of Errors",
                "pos": ""
            },
            {
                "word": "comedy of manners",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play, film or TV show that is intended to be funny, usually with a happy ending; plays, films and TV shows of this type",
                    "vi": "một vở kịch, bộ phim hoặc chương trình truyền hình nhằm mục đích gây cười, thường có một kết thúc có hậu; kịch, phim và chương trình truyền hình thuộc loại này"
                },
                "examples": [
                    {
                        "en": "a romantic comedy",
                        "vi": "một bộ phim hài lãng mạn"
                    },
                    {
                        "en": "a black comedy (= a play or film that deals with unpleasant or terrible things in a humorous way)",
                        "vi": "một bộ phim hài đen (= một vở kịch hoặc bộ phim đề cập đến những điều khó chịu hoặc khủng khiếp theo cách hài hước)"
                    },
                    {
                        "en": "a slapstick comedy",
                        "vi": "một bộ phim hài hài hước"
                    },
                    {
                        "en": "He moved to Los Angeles to write comedy.",
                        "vi": "Anh chuyển đến Los Angeles để viết hài kịch."
                    },
                    {
                        "en": "comedy about somebody/something a comedy about an eccentric family",
                        "vi": "hài kịch về ai đó / thứ gì đó hài kịch về một gia đình lập dị"
                    },
                    {
                        "en": "She went on to star in a hit comedy series.",
                        "vi": "Cô tiếp tục đóng vai chính trong một loạt phim hài ăn khách."
                    },
                    {
                        "en": "His TV comedy shows ran during the 70s and 80s.",
                        "vi": "Các chương trình hài kịch trên truyền hình của ông đã diễn ra trong suốt những năm 70 và 80."
                    },
                    {
                        "en": "a comedy series/show",
                        "vi": "một loạt phim / chương trình hài"
                    }
                ]
            },
            {
                "define": {
                    "en": "professional entertainment with jokes, short acts, etc. that is intended to be funny",
                    "vi": "giải trí chuyên nghiệp với những câu chuyện cười, hành động ngắn, v.v. nhằm mục đích gây cười"
                },
                "examples": [
                    {
                        "en": "The show combines theatre with the best of stand-up and sketch comedy.",
                        "vi": "Chương trình kết hợp sân khấu với những vở hài kịch độc đáo và hài kịch xuất sắc nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a humorous aspect of something",
                    "vi": "một khía cạnh hài hước của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her imaginative interpretation of the script brought out the comedy inherent in it.",
                        "vi": "Cách giải thích đầy trí tưởng tượng của cô ấy đối với kịch bản đã làm nổi bật chất hài vốn có trong đó."
                    },
                    {
                        "en": "He didn't appreciate the comedy of the situation.",
                        "vi": "Anh ấy không đánh giá cao sự hài hước của tình huống."
                    },
                    {
                        "en": "The visual comedy of this scene is obvious.",
                        "vi": "Hình ảnh hài hước của cảnh này là rõ ràng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d65add3595c4dfb98cfd059b4b0f13e",
        "word": "musical",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈmjuːzɪkl/",
            "us": "/ˈmjuːzɪkl/"
        },
        "nearby": [
            {
                "word": "music",
                "pos": "noun"
            },
            {
                "word": "musical",
                "pos": "adjective"
            },
            {
                "word": "musical",
                "pos": "noun"
            },
            {
                "word": "musical box",
                "pos": "noun"
            },
            {
                "word": "musical bumps",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play or film in which part or all of the story is told using songs and often dancing",
                    "vi": "một vở kịch hoặc một bộ phim trong đó một phần hoặc toàn bộ câu chuyện được kể bằng các bài hát và thường nhảy múa"
                },
                "examples": [
                    {
                        "en": "a Broadway/Hollywood musical",
                        "vi": "một vở nhạc kịch Broadway / Hollywood"
                    },
                    {
                        "en": "the star of the hit West End musical",
                        "vi": "ngôi sao của vở nhạc kịch nổi tiếng West End"
                    },
                    {
                        "en": "a musical based on the biblical story of Job",
                        "vi": "một vở nhạc kịch dựa trên câu chuyện kinh thánh về Job"
                    },
                    {
                        "en": "a cycle of classic Rodgers and Hammerstein musicals",
                        "vi": "một vòng nhạc kịch cổ điển của Rodgers và Hammerstein"
                    }
                ]
            }
        ]
    },
    {
        "id": "3343f30b686940eeb0109e578e1a310a",
        "word": "ballet",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbæleɪ/",
            "us": "/bæˈleɪ/"
        },
        "nearby": [
            {
                "word": "ballcock",
                "pos": "noun"
            },
            {
                "word": "ballerina",
                "pos": "noun"
            },
            {
                "word": "ballet",
                "pos": "noun"
            },
            {
                "word": "balletic",
                "pos": "adjective"
            },
            {
                "word": "balletomane",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a style of dancing that tells a dramatic story with music but no talking or singing",
                    "vi": "một phong cách khiêu vũ kể một câu chuyện kịch tính bằng âm nhạc nhưng không nói hoặc hát"
                },
                "examples": [
                    {
                        "en": "She wants to be a ballet dancer.",
                        "vi": "Cô ấy muốn trở thành một vũ công ba lê."
                    },
                    {
                        "en": "ballet shoes",
                        "vi": "giầy múa ba lê"
                    }
                ]
            },
            {
                "define": {
                    "en": "a story or work of art performed by a group of ballet dancers",
                    "vi": "một câu chuyện hoặc tác phẩm nghệ thuật do một nhóm vũ công ba lê biểu diễn"
                },
                "examples": [
                    {
                        "en": "‘Swan Lake’ is one of the great classical ballets.",
                        "vi": "Hồ thiên nga' là một trong những vở ballet cổ điển tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of dancers who work and perform ballet together",
                    "vi": "một nhóm vũ công làm việc và biểu diễn ba lê cùng nhau"
                },
                "examples": [
                    {
                        "en": "members of the Royal Ballet",
                        "vi": "các thành viên của đoàn Ballet Hoàng gia"
                    }
                ]
            }
        ]
    },
    {
        "id": "9fdff80affe440dca7eb731e82c081bc",
        "word": "dramatic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/drəˈmætɪk/",
            "us": "/drəˈmætɪk/"
        },
        "nearby": [
            {
                "word": "drama",
                "pos": "noun"
            },
            {
                "word": "drama queen",
                "pos": "noun"
            },
            {
                "word": "dramatic",
                "pos": "adjective"
            },
            {
                "word": "dramatically",
                "pos": "adverb"
            },
            {
                "word": "dramatic irony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sudden, very great and often surprising",
                    "vi": "đột ngột, rất tuyệt vời và thường gây ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "a dramatic increase/change/improvement/shift",
                        "vi": "một sự gia tăng / thay đổi / cải tiến / thay đổi đáng kể"
                    },
                    {
                        "en": "There has been a dramatic rise in reported crime.",
                        "vi": "Đã có một sự gia tăng đáng kể tội phạm được báo cáo."
                    },
                    {
                        "en": "a dramatic decline/drop/fall/reducution in value",
                        "vi": "sự sụt giảm nghiêm trọng / giảm / giảm / giảm giá trị"
                    },
                    {
                        "en": "The announcement had a dramatic effect on house prices.",
                        "vi": "Thông báo đã có một tác động đáng kể đến giá nhà."
                    },
                    {
                        "en": "Climate change will have a dramatic impact on the health of the planet.",
                        "vi": "Biến đổi khí hậu sẽ có tác động mạnh mẽ đến sức khỏe của hành tinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "exciting and impressive",
                    "vi": "thú vị và ấn tượng"
                },
                "examples": [
                    {
                        "en": "a dramatic victory",
                        "vi": "một chiến thắng kịch tính"
                    },
                    {
                        "en": "They watched dramatic pictures of the police raid on TV.",
                        "vi": "Họ đã xem những hình ảnh kịch tính về cuộc đột kích của cảnh sát trên TV."
                    },
                    {
                        "en": "This scene lacked the dramatic impact that it should have had.",
                        "vi": "Cảnh này thiếu tác động mạnh mẽ mà nó đáng lẽ phải có."
                    },
                    {
                        "en": "set against the dramatic backcloth of Mont Blanc",
                        "vi": "dựa trên tấm khăn trải sàn ấn tượng của Mont Blanc"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the theatre or plays",
                    "vi": "kết nối với nhà hát hoặc vở kịch"
                },
                "examples": [
                    {
                        "en": "a local dramatic society",
                        "vi": "một xã hội kịch tính ở địa phương"
                    },
                    {
                        "en": "Students will study various plays and dramatic texts.",
                        "vi": "Học sinh sẽ học các vở kịch và văn bản kịch khác nhau."
                    },
                    {
                        "en": "a dramatic monologue",
                        "vi": "một cuộc độc thoại kịch tính"
                    },
                    {
                        "en": "She went on to study dramatic arts at Columbia University.",
                        "vi": "Cô tiếp tục theo học nghệ thuật kịch tại Đại học Columbia."
                    }
                ]
            },
            {
                "define": {
                    "en": "exaggerated in order to create a special effect and attract people’s attention",
                    "vi": "phóng đại nhằm tạo hiệu ứng đặc biệt và thu hút sự chú ý của mọi người"
                },
                "examples": [
                    {
                        "en": "He flung out his arms in a dramatic gesture.",
                        "vi": "Anh ta vung tay ra trong một cử chỉ đầy ấn tượng."
                    },
                    {
                        "en": "Don't be so dramatic!",
                        "vi": "Đừng quá kịch tính!"
                    },
                    {
                        "en": "dramatic about something Must you be so dramatic about everything?",
                        "vi": "kịch tính về điều gì đó Bạn phải rất kịch tính về mọi thứ?"
                    }
                ]
            }
        ]
    },
    {
        "id": "6d008dd21cb34b6dbfd7ca5acdb12f34",
        "word": "tragedy",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrædʒədi/",
            "us": "/ˈtrædʒədi/"
        },
        "nearby": [
            {
                "word": "tragedian",
                "pos": "noun"
            },
            {
                "word": "tragedienne",
                "pos": "noun"
            },
            {
                "word": "tragedy",
                "pos": "noun"
            },
            {
                "word": "tragic",
                "pos": "adjective"
            },
            {
                "word": "tragically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very sad event or situation, especially one that involves death",
                    "vi": "một sự kiện hoặc tình huống rất buồn, đặc biệt là một sự kiện hoặc một tình huống liên quan đến cái chết"
                },
                "examples": [
                    {
                        "en": "It's a tragedy that she died so young.",
                        "vi": "Đó là một bi kịch khi cô ấy chết quá trẻ."
                    },
                    {
                        "en": "Tragedy struck the family when their son was hit by a car and killed.",
                        "vi": "Bi kịch ập đến với gia đình khi con trai họ bị ô tô tông và tử vong."
                    },
                    {
                        "en": "The whole affair ended in tragedy.",
                        "vi": "Cả cuộc tình đều kết thúc trong bi kịch."
                    },
                    {
                        "en": "Investigators are searching the wreckage of the plane to try to find the cause of the tragedy.",
                        "vi": "Các nhà điều tra đang tìm kiếm đống đổ nát của chiếc máy bay để cố gắng tìm ra nguyên nhân của thảm kịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "a serious play with a sad ending, especially one in which the main character dies; plays of this type",
                    "vi": "một vở kịch nghiêm túc với một kết thúc buồn, đặc biệt là một trong đó nhân vật chính chết; vở kịch kiểu này"
                },
                "examples": [
                    {
                        "en": "Shakespeare’s tragedies",
                        "vi": "Những bi kịch của Shakespeare"
                    },
                    {
                        "en": "Greek tragedy",
                        "vi": "Bi kịch Hy Lạp"
                    },
                    {
                        "en": "Revenge tragedies were very popular in Elizabethan England.",
                        "vi": "Những bi kịch báo thù rất phổ biến ở Anh thời Elizabeth."
                    }
                ]
            }
        ]
    },
    {
        "id": "63f80ce065a44603b3ab6bea6f94cf29",
        "word": "Broadway",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbrɔːdweɪ/",
            "us": "/ˈbrɔːdweɪ/"
        },
        "nearby": [
            {
                "word": "broad-spectrum",
                "pos": "adjective"
            },
            {
                "word": "broadsword",
                "pos": "noun"
            },
            {
                "word": "Broadway",
                "pos": "noun"
            },
            {
                "word": "Broadwood",
                "pos": ""
            },
            {
                "word": "Brobdingnag",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a street in New York City where there are many theatres, sometimes used to refer to the US theatre industry in general",
                    "vi": "một con phố ở Thành phố New York nơi có nhiều rạp hát, đôi khi được dùng để chỉ ngành sân khấu Hoa Kỳ nói chung"
                },
                "examples": [
                    {
                        "en": "a Broadway musical",
                        "vi": "một vở nhạc kịch Broadway"
                    },
                    {
                        "en": "The play opened on Broadway in 2013.",
                        "vi": "Vở kịch ra mắt tại Broadway vào năm 2013."
                    }
                ]
            }
        ]
    },
    {
        "id": "f313247cf0484789aed535d01d9fe7db",
        "word": "sketch",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/sketʃ/",
            "us": "/sketʃ/"
        },
        "nearby": [
            {
                "word": "skepticism",
                "pos": "noun"
            },
            {
                "word": "skerry",
                "pos": "noun"
            },
            {
                "word": "sketch",
                "pos": "noun"
            },
            {
                "word": "sketch",
                "pos": "verb"
            },
            {
                "word": "sketchbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a simple picture that is drawn quickly and does not have many details",
                    "vi": "một bức tranh đơn giản được vẽ nhanh và không có nhiều chi tiết"
                },
                "examples": [
                    {
                        "en": "The artist is making sketches for his next painting.",
                        "vi": "Người nghệ sĩ đang vẽ phác thảo cho bức tranh tiếp theo của mình."
                    },
                    {
                        "en": "She drew a sketch map of the area to show us the way.",
                        "vi": "Cô ấy đã vẽ một bản đồ phác thảo của khu vực để chỉ đường cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short funny scene on television, in the theatre, etc.",
                    "vi": "một cảnh hài hước ngắn trên truyền hình, trong rạp hát, v.v."
                },
                "examples": [
                    {
                        "en": "The drama group did a sketch about a couple buying a new car.",
                        "vi": "Nhóm kịch đã vẽ phác thảo về một cặp vợ chồng mua một chiếc ô tô mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short report or story that gives only basic details about something",
                    "vi": "một báo cáo hoặc câu chuyện ngắn chỉ cung cấp các chi tiết cơ bản về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a biographical sketch of the prime minister",
                        "vi": "bản phác thảo tiểu sử của thủ tướng"
                    }
                ]
            }
        ]
    },
    {
        "id": "3a760aac1d3149c883c8e9b9505dd018",
        "word": "benefit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbenɪfɪt/",
            "us": "/ˈbenɪfɪt/"
        },
        "nearby": [
            {
                "word": "beneficially",
                "pos": "adverb"
            },
            {
                "word": "beneficiary",
                "pos": "noun"
            },
            {
                "word": "benefit",
                "pos": "noun"
            },
            {
                "word": "benefit",
                "pos": "verb"
            },
            {
                "word": "Benelux",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an advantage that something gives you; a helpful and useful effect that something has",
                    "vi": "một lợi thế mà một cái gì đó mang lại cho bạn; một tác dụng hữu ích và hữu ích mà một cái gì đó có"
                },
                "examples": [
                    {
                        "en": "Freedom of information brings great benefits.",
                        "vi": "Tự do thông tin mang lại những lợi ích to lớn."
                    },
                    {
                        "en": "health/economic/tax benefits",
                        "vi": "lợi ích sức khỏe / kinh tế / thuế"
                    },
                    {
                        "en": "the benefits of modern medicine",
                        "vi": "lợi ích của y học hiện đại"
                    },
                    {
                        "en": "I've had the benefit of a good education.",
                        "vi": "Tôi đã có được lợi ích của một nền giáo dục tốt."
                    },
                    {
                        "en": "It was good to see her finally reaping the benefits (= enjoying the results) of all her hard work.",
                        "vi": "Thật vui khi thấy cô ấy cuối cùng cũng gặt hái được những thành quả (= tận hưởng thành quả) sau tất cả những gì cô ấy làm việc chăm chỉ."
                    },
                    {
                        "en": "The industry will be one of the first to enjoy the benefits of the recovery.",
                        "vi": "Ngành công nghiệp này sẽ là một trong những ngành đầu tiên được hưởng những lợi ích từ việc phục hồi."
                    },
                    {
                        "en": "The company derived substantial benefit from the deal.",
                        "vi": "Công ty thu được lợi nhuận đáng kể từ thương vụ này."
                    },
                    {
                        "en": "benefit of doing something He couldn't see the benefit of arguing any longer.",
                        "vi": "lợi ích của việc làm điều gì đó Anh ấy không thể thấy lợi ích của việc tranh cãi nữa."
                    },
                    {
                        "en": "be of benefit to somebody/something The new regulations will be of benefit to everyone concerned.",
                        "vi": "có lợi cho ai đó / cái gì đó Các quy định mới sẽ có lợi cho tất cả những người có liên quan."
                    },
                    {
                        "en": "to somebody's benefit It will be to your benefit to arrive early.",
                        "vi": "vì lợi ích của ai đó Sẽ có lợi cho bạn nếu bạn đến sớm."
                    },
                    {
                        "en": "benefit for somebody/something The project will have major benefits for the local community.",
                        "vi": "mang lại lợi ích cho ai đó / điều gì đó Dự án sẽ mang lại lợi ích chính cho cộng đồng địa phương."
                    },
                    {
                        "en": "With the benefit of hindsight (= knowing what we have learnt since), we would do things differently.",
                        "vi": "Với lợi ích của nhận thức muộn màng (= biết những gì chúng ta đã học được từ đó), chúng ta sẽ làm những điều khác biệt."
                    },
                    {
                        "en": "without the benefit of something Nobody should be sent to prison without the benefit of legal advice.",
                        "vi": "không có lợi ích của một cái gì đó Không ai nên bị đưa vào tù mà không có lợi ích của lời khuyên pháp lý."
                    },
                    {
                        "en": "For maximum benefit, take the tablets before meals.",
                        "vi": "Để có lợi ích tối đa, hãy uống thuốc trước bữa ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "money provided by the government to people who need financial help because they are unemployed, ill, etc.",
                    "vi": "tiền do chính phủ cung cấp cho những người cần giúp đỡ tài chính vì họ thất nghiệp, ốm đau, v.v."
                },
                "examples": [
                    {
                        "en": "You may be eligible to receive benefits.",
                        "vi": "Bạn có thể đủ điều kiện để nhận trợ cấp."
                    },
                    {
                        "en": "The number of people claiming unemployment benefit fell last month.",
                        "vi": "Số người yêu cầu trợ cấp thất nghiệp đã giảm trong tháng trước."
                    },
                    {
                        "en": "on benefits The aim is to help people who are on benefits (= receiving benefits) to find jobs.",
                        "vi": "về lợi ích Mục đích là giúp những người đang hưởng trợ cấp (= nhận trợ cấp) tìm được việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an advantage that you get from a company in addition to the money that you earn",
                    "vi": "một lợi thế mà bạn nhận được từ một công ty ngoài số tiền bạn kiếm được"
                },
                "examples": [
                    {
                        "en": "Private health insurance is offered as part of the employees' benefits package.",
                        "vi": "Bảo hiểm y tế tư nhân được cung cấp như một phần của gói phúc lợi dành cho nhân viên."
                    },
                    {
                        "en": "These benefits will now be extended to agency workers.",
                        "vi": "Giờ đây, những phúc lợi này sẽ được mở rộng cho nhân viên đại lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "money from an insurance company",
                    "vi": "tiền từ một công ty bảo hiểm"
                },
                "examples": [
                    {
                        "en": "The insurance plan will provide substantial cash benefits to your family in case of your death.",
                        "vi": "Chương trình bảo hiểm sẽ cung cấp các quyền lợi tiền mặt đáng kể cho gia đình bạn trong trường hợp bạn qua đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event such as a performance, a dinner, etc., organized in order to raise money for a particular person or charity",
                    "vi": "một sự kiện chẳng hạn như một buổi biểu diễn, một bữa tối, v.v., được tổ chức để quyên tiền cho một người cụ thể hoặc tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "a benefit match/concert",
                        "vi": "một trận đấu lợi ích / buổi hòa nhạc"
                    },
                    {
                        "en": "The proceeds from the benefit will go directly to the refugee camps.",
                        "vi": "Số tiền thu được từ phúc lợi sẽ được chuyển thẳng đến các trại tị nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "especially in order to help or be useful to somebody",
                    "vi": "đặc biệt là để giúp đỡ hoặc hữu ích cho ai đó"
                },
                "examples": [
                    {
                        "en": "I have typed out some lecture notes for the benefit of those people who were absent last week.",
                        "vi": "Tôi đã đánh máy một số ghi chú bài giảng vì lợi ích của những người vắng mặt tuần trước."
                    },
                    {
                        "en": "Don't go to any trouble for my benefit!",
                        "vi": "Đừng đi đến bất kỳ rắc rối vì lợi ích của tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept that somebody has told the truth or behaved well because you cannot prove that they have not",
                    "vi": "chấp nhận rằng ai đó đã nói sự thật hoặc cư xử tốt bởi vì bạn không thể chứng minh rằng họ không"
                },
                "examples": [
                    {
                        "en": "She may have been lying, but I felt I had to give her the benefit of the doubt.",
                        "vi": "Cô ấy có thể đã nói dối, nhưng tôi cảm thấy tôi phải cho cô ấy lợi ích của sự nghi ngờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "09964a06fe9c48c18c62a8ee7eab3f62",
        "word": "comedy of manners",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒmədi əv ˈmænəz/",
            "us": "/ˌkɑːmədi əv ˈmænərz/"
        },
        "nearby": [
            {
                "word": "comedy",
                "pos": "noun"
            },
            {
                "word": "The Comedy of Errors",
                "pos": ""
            },
            {
                "word": "comedy of manners",
                "pos": "noun"
            },
            {
                "word": "come for",
                "pos": "phrasal verb"
            },
            {
                "word": "come forward",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a funny play, film or book that shows the silly behaviour of a particular group of people",
                    "vi": "một vở kịch, bộ phim hoặc cuốn sách hài hước thể hiện hành vi ngớ ngẩn của một nhóm người cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1adc97210cfa45268cbfe1c7b22735e9",
        "word": "farce",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɑːs/",
            "us": "/fɑːrs/"
        },
        "nearby": [
            {
                "word": "Faraday cage",
                "pos": "noun"
            },
            {
                "word": "faraway",
                "pos": "adjective"
            },
            {
                "word": "farce",
                "pos": "noun"
            },
            {
                "word": "farcical",
                "pos": "adjective"
            },
            {
                "word": "fare",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a funny play for the theatre based on silly and unlikely situations and events; this type of writing or performance",
                    "vi": "một vở kịch vui cho nhà hát dựa trên những tình huống và sự kiện ngớ ngẩn và khó có thể xảy ra; loại văn bản hoặc hiệu suất này"
                },
                "examples": [
                    {
                        "en": "a bedroom farce (= a funny play about sex)",
                        "vi": "một trò hề trong phòng ngủ (= một vở kịch hài hước về tình dục)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation or an event that is so unfair or badly organized that it becomes silly",
                    "vi": "một tình huống hoặc một sự kiện không công bằng hoặc được tổ chức tồi đến mức nó trở nên ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "The trial was a complete farce.",
                        "vi": "Thử nghiệm hoàn toàn là một trò hề."
                    }
                ]
            }
        ]
    },
    {
        "id": "a1629a948a9c4b538fe950ff7e103d94",
        "word": "fringe theatre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfrɪndʒ ˈθɪətə(r)/",
            "us": "/ˌfrɪndʒ ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "fringed",
                "pos": "adjective"
            },
            {
                "word": "fringe medicine",
                "pos": "noun"
            },
            {
                "word": "fringe theatre",
                "pos": "noun"
            },
            {
                "word": "Elisabeth Frink",
                "pos": ""
            },
            {
                "word": "frippery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "plays, often by new writers, that are unusual and question the way people think; a theatre where such plays are performed",
                    "vi": "các vở kịch, thường là của các nhà văn mới, không bình thường và đặt câu hỏi về cách nghĩ của mọi người; một nhà hát nơi những vở kịch như vậy được trình diễn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d77b899a3d47412988af1bfa4d9f022c",
        "word": "kabuki",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈbuːki/",
            "us": "/kəˈbuːki/"
        },
        "nearby": [
            {
                "word": "kabbalistic",
                "pos": "adjective"
            },
            {
                "word": "kabob",
                "pos": "noun"
            },
            {
                "word": "kabuki",
                "pos": "noun"
            },
            {
                "word": "ka-ching",
                "pos": "exclamation"
            },
            {
                "word": "kaffeeklatsch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "traditional Japanese theatre, in which songs, dance and mime are performed by men",
                    "vi": "nhà hát truyền thống của Nhật Bản, trong đó các bài hát, điệu nhảy và kịch câm do nam giới biểu diễn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "162511bca8c64ea4b3fd82235c8488f6",
        "word": "masque",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɑːsk/",
            "us": "/mæsk/"
        },
        "nearby": [
            {
                "word": "Mason jar",
                "pos": "noun"
            },
            {
                "word": "masonry",
                "pos": "noun"
            },
            {
                "word": "masque",
                "pos": "noun"
            },
            {
                "word": "masquerade",
                "pos": "noun"
            },
            {
                "word": "masquerade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play written in verse, often with music and dancing, popular in England in the 16th and 17th centuries",
                    "vi": "một vở kịch viết theo thể thơ, thường có âm nhạc và khiêu vũ, phổ biến ở Anh vào thế kỷ 16 và 17"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "229f3de8f70841408b1df446529c848a",
        "word": "melodrama",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmelədrɑːmə/",
            "us": "/ˈmelədrɑːmə/"
        },
        "nearby": [
            {
                "word": "melodiously",
                "pos": "adverb"
            },
            {
                "word": "melodist",
                "pos": "noun"
            },
            {
                "word": "melodrama",
                "pos": "noun"
            },
            {
                "word": "melodramatic",
                "pos": "adjective"
            },
            {
                "word": "melodramatically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a story, play or novel that is full of exciting events and in which the characters and emotions seem too exaggerated to be real",
                    "vi": "một câu chuyện, vở kịch hoặc cuốn tiểu thuyết chứa đầy các sự kiện thú vị và trong đó các nhân vật và cảm xúc dường như quá cường điệu để có thể có thật"
                },
                "examples": [
                    {
                        "en": "a gripping Victorian melodrama",
                        "vi": "một bộ phim melodrama hấp dẫn thời Victoria"
                    },
                    {
                        "en": "Instead of tragedy, we got melodrama.",
                        "vi": "Thay vì bi kịch, chúng ta có phim kinh dị."
                    }
                ]
            },
            {
                "define": {
                    "en": "events, behaviour, etc. that are exaggerated or extreme",
                    "vi": "sự kiện, hành vi, v.v. cường điệu hoặc cực đoan"
                },
                "examples": [
                    {
                        "en": "Her love of melodrama meant that any small problem became a crisis.",
                        "vi": "Cô yêu thích thể loại phim kinh dị có nghĩa là bất kỳ vấn đề nhỏ nào cũng trở thành một cuộc khủng hoảng."
                    }
                ]
            }
        ]
    },
    {
        "id": "99dd03b443f849fd889db575f5c0f856",
        "word": "mime",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/maɪm/",
            "us": "/maɪm/"
        },
        "nearby": [
            {
                "word": "Milton Keynes",
                "pos": ""
            },
            {
                "word": "Milwaukee",
                "pos": ""
            },
            {
                "word": "mime",
                "pos": "noun"
            },
            {
                "word": "mime",
                "pos": "verb"
            },
            {
                "word": "mimesis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the theatre) the use of movements of your hands or body and the expressions on your face to tell a story or to act something without speaking; a performance using this method of acting",
                    "vi": "(đặc biệt là trong rạp hát) việc sử dụng các cử động của tay hoặc cơ thể và các biểu cảm trên khuôn mặt của bạn để kể một câu chuyện hoặc để diễn một điều gì đó mà không cần nói; một buổi biểu diễn sử dụng phương pháp diễn xuất này"
                },
                "examples": [
                    {
                        "en": "The performance consisted of dance, music and mime.",
                        "vi": "Màn biểu diễn bao gồm khiêu vũ, âm nhạc và kịch câm."
                    },
                    {
                        "en": "a mime artist",
                        "vi": "một nghệ sĩ kịch câm"
                    },
                    {
                        "en": "She performed a brief mime.",
                        "vi": "Cô ấy đã biểu diễn một màn kịch câm ngắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "41bfe7bbddc94e51b905bc4a8dbfed8a",
        "word": "morality play",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈræləti pleɪ/",
            "us": "/məˈræləti pleɪ/"
        },
        "nearby": [
            {
                "word": "moralistic",
                "pos": "adjective"
            },
            {
                "word": "morality",
                "pos": "noun"
            },
            {
                "word": "morality play",
                "pos": "noun"
            },
            {
                "word": "moralize",
                "pos": "verb"
            },
            {
                "word": "morally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of play that was popular in the 15th and 16th centuries and was intended to teach a moral lesson, using characters to represent good and bad qualities",
                    "vi": "một loại vở kịch phổ biến vào thế kỷ 15 và 16 nhằm mục đích dạy một bài học đạo đức, sử dụng các nhân vật để đại diện cho những phẩm chất tốt và xấu."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b8fdceadd5e6455986618a22f51677a1",
        "word": "music hall",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmjuːzɪk hɔːl/",
            "us": "/ˈmjuːzɪk hɔːl/"
        },
        "nearby": [
            {
                "word": "musical saw",
                "pos": "noun"
            },
            {
                "word": "music box",
                "pos": "noun"
            },
            {
                "word": "music hall",
                "pos": "noun"
            },
            {
                "word": "musician",
                "pos": "noun"
            },
            {
                "word": "musicianship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of entertainment popular in the late 19th and early 20th centuries, including singing, dancing and comedy",
                    "vi": "một loại hình giải trí phổ biến vào cuối thế kỷ 19 và đầu thế kỷ 20, bao gồm ca hát, khiêu vũ và hài kịch"
                },
                "examples": [
                    {
                        "en": "an old music hall song",
                        "vi": "một bài hát hội trường âm nhạc cũ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a theatre used for popular entertainment in the late 19th and early 20th centuries",
                    "vi": "một nhà hát được sử dụng để giải trí phổ biến vào cuối thế kỷ 19 và đầu thế kỷ 20"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e33de9e3a8ea48e4941f918abfa4a1a4",
        "word": "mystery play",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪstri pleɪ/",
            "us": "/ˈmɪstəri pleɪ/"
        },
        "nearby": [
            {
                "word": "mysteriousness",
                "pos": "noun"
            },
            {
                "word": "mystery",
                "pos": "noun"
            },
            {
                "word": "mystery play",
                "pos": "noun"
            },
            {
                "word": "mystery shopper",
                "pos": "noun"
            },
            {
                "word": "mystery shopping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of play that was popular in the 13th and 14th centuries and was based on events in the Bible or the lives of the Christian saints",
                    "vi": "một loại vở kịch phổ biến vào thế kỷ 13 và 14 dựa trên các sự kiện trong Kinh thánh hoặc cuộc đời của các vị thánh trong đạo Thiên chúa."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9c554297090a491d983f85a0a50e9792",
        "word": "nativity play",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nəˈtɪvəti pleɪ/",
            "us": "/nəˈtɪvəti pleɪ/"
        },
        "nearby": [
            {
                "word": "native speaker",
                "pos": "noun"
            },
            {
                "word": "nativity",
                "pos": "noun"
            },
            {
                "word": "nativity play",
                "pos": "noun"
            },
            {
                "word": "NATO",
                "pos": "abbreviation"
            },
            {
                "word": "NATS",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play about the birth of Jesus Christ, usually performed by children at Christmas",
                    "vi": "một vở kịch về sự ra đời của Chúa Giêsu Kitô, thường được biểu diễn bởi trẻ em vào lễ Giáng sinh"
                },
                "examples": [
                    {
                        "en": "The children always perform a nativity play every Christmas.",
                        "vi": "Những đứa trẻ luôn biểu diễn vở kịch Chúa giáng sinh vào mỗi dịp Giáng sinh."
                    }
                ]
            }
        ]
    },
    {
        "id": "11bb213924d84a49ba77427b057a0188",
        "word": "off-Broadway",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒf ˈbrɔːdweɪ/",
            "us": "/ˌɔːf ˈbrɔːdweɪ/"
        },
        "nearby": [
            {
                "word": "Offa's Dyke",
                "pos": ""
            },
            {
                "word": "offbeat",
                "pos": "adjective"
            },
            {
                "word": "off-Broadway",
                "pos": "adjective"
            },
            {
                "word": "off-centre",
                "pos": "adverb, adjective"
            },
            {
                "word": "off colour",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not on Broadway, New York’s main theatre district",
                    "vi": "không ở Broadway, khu nhà hát chính của New York"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "unusual in some way and often by a new writer",
                    "vi": "bất thường theo một cách nào đó và thường là bởi một nhà văn mới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d9378107a3540aca2e875da1b651c9b",
        "word": "pantomime",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpæntəmaɪm/",
            "us": "/ˈpæntəmaɪm/"
        },
        "nearby": [
            {
                "word": "panto",
                "pos": "noun"
            },
            {
                "word": "pantograph",
                "pos": "noun"
            },
            {
                "word": "pantomime",
                "pos": "noun"
            },
            {
                "word": "pantomime dame",
                "pos": "noun"
            },
            {
                "word": "pantomime horse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) a type of play with music, dancing and jokes, that is based on a fairy tale and is usually performed at Christmas",
                    "vi": "(ở Anh) một loại hình vui chơi với âm nhạc, khiêu vũ và truyện cười, dựa trên một câu chuyện cổ tích và thường được biểu diễn vào lễ Giáng sinh"
                },
                "examples": [
                    {
                        "en": "We took the children to a pantomime.",
                        "vi": "Chúng tôi đưa bọn trẻ đi xem kịch câm."
                    },
                    {
                        "en": "He has also appeared in pantomime.",
                        "vi": "Anh ấy cũng đã xuất hiện trong kịch câm."
                    },
                    {
                        "en": "the pantomime season",
                        "vi": "mùa kịch câm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of movement and the expression of your face to communicate something or to tell a story",
                    "vi": "việc sử dụng chuyển động và nét mặt của bạn để truyền đạt điều gì đó hoặc để kể một câu chuyện"
                },
                "examples": [
                    {
                        "en": "a magical tale told through pantomime and song",
                        "vi": "một câu chuyện ma thuật được kể qua kịch câm và bài hát"
                    },
                    {
                        "en": "When I finally arrived, he made a pantomime of checking his watch and shaking it in disbelief.",
                        "vi": "Cuối cùng khi tôi đến nơi, anh ấy đã làm một màn kịch câm khi kiểm tra đồng hồ và lắc nó một cách hoài nghi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a silly and confused situation",
                    "vi": "một tình huống ngớ ngẩn và bối rối"
                },
                "examples": [
                    {
                        "en": "The company’s board meetings had become a pantomime and no decisions were ever made.",
                        "vi": "Các cuộc họp hội đồng quản trị của công ty đã trở thành một màn kịch câm và không có quyết định nào được đưa ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "933252a0daad4e8dbb3b84a1857a6e31",
        "word": "period piece",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪəriəd piːs/",
            "us": "/ˈpɪriəd piːs/"
        },
        "nearby": [
            {
                "word": "periodontal",
                "pos": "adjective"
            },
            {
                "word": "periodontitis",
                "pos": "noun"
            },
            {
                "word": "period piece",
                "pos": "noun"
            },
            {
                "word": "peripatetic",
                "pos": "adjective"
            },
            {
                "word": "peripheral",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play, film, etc. that is set in a particular period of history",
                    "vi": "một vở kịch, bộ phim, v.v. được đặt trong một giai đoạn lịch sử cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an object, piece of furniture, etc. that was made during a particular period of history and is typical of that period",
                    "vi": "một đồ vật, đồ nội thất, v.v. được làm trong một thời kỳ lịch sử cụ thể và là điển hình của thời kỳ đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2405814643514cf09ec3e1283849d0d7",
        "word": "potboiler",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒtbɔɪlə(r)/",
            "us": "/ˈpɑːtbɔɪlər/"
        },
        "nearby": [
            {
                "word": "pot belly",
                "pos": "noun"
            },
            {
                "word": "potbelly stove",
                "pos": "noun"
            },
            {
                "word": "potboiler",
                "pos": "noun"
            },
            {
                "word": "pot-bound",
                "pos": "adjective"
            },
            {
                "word": "pot cheese",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book, a play, etc. that is produced only to earn money quickly",
                    "vi": "một cuốn sách, một vở kịch, v.v. được sản xuất chỉ để kiếm tiền nhanh chóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "478096031a814295aad134bd19a2da7a",
        "word": "revue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈvjuː/",
            "us": "/rɪˈvjuː/"
        },
        "nearby": [
            {
                "word": "revolving",
                "pos": "adjective"
            },
            {
                "word": "revolving door",
                "pos": "noun"
            },
            {
                "word": "revue",
                "pos": "noun"
            },
            {
                "word": "revulsion",
                "pos": "noun"
            },
            {
                "word": "reward",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a show in a theatre, with songs, dances, jokes, short plays, etc., often about recent events",
                    "vi": "một chương trình trong nhà hát, với các bài hát, điệu múa, truyện cười, kịch ngắn, v.v., thường là về các sự kiện gần đây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e6d8c836f71b403dbd00e3ac852eb626",
        "word": "smash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/smæʃ/",
            "us": "/smæʃ/"
        },
        "nearby": [
            {
                "word": "smarty-pants",
                "pos": "noun"
            },
            {
                "word": "smash",
                "pos": "verb"
            },
            {
                "word": "smash",
                "pos": "noun"
            },
            {
                "word": "smash-and-grab",
                "pos": "adjective"
            },
            {
                "word": "smash down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of breaking something noisily into pieces; the sound this makes",
                    "vi": "một hành động phá vỡ một cái gì đó ồn ào thành nhiều mảnh; âm thanh này tạo ra"
                },
                "examples": [
                    {
                        "en": "The cup hit the floor with a smash.",
                        "vi": "Chiếc cốc đập mạnh xuống sàn."
                    },
                    {
                        "en": "He heard the smash of breaking glass.",
                        "vi": "Anh nghe thấy tiếng kính vỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an accident in which a vehicle hits another vehicle",
                    "vi": "một vụ tai nạn trong đó một chiếc xe đâm vào một chiếc xe khác"
                },
                "examples": [
                    {
                        "en": "a car smash",
                        "vi": "một vụ đập xe"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of hitting the ball downwards and very hard",
                    "vi": "một cách đánh bóng xuống dưới và rất khó"
                },
                "examples": [
                    {
                        "en": "He can hit a powerful overhead smash.",
                        "vi": "Anh ta có thể đánh một cú đập mạnh mẽ từ trên cao."
                    },
                    {
                        "en": "He misses a smash to hand Thiem a 5–0 lead.",
                        "vi": "Anh ấy bỏ lỡ một cú smash để dẫn Thiem dẫn 5–0."
                    }
                ]
            },
            {
                "define": {
                    "en": "a song, film or play that is very popular",
                    "vi": "một bài hát, bộ phim hoặc vở kịch rất phổ biến"
                },
                "examples": [
                    {
                        "en": "her latest chart smash",
                        "vi": "bảng xếp hạng mới nhất của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "32bb1ec57a94436f925e948e939da92d",
        "word": "tragicomedy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtrædʒiˈkɒmədi/",
            "us": "/ˌtrædʒiˈkɑːmədi/"
        },
        "nearby": [
            {
                "word": "tragically",
                "pos": "adverb"
            },
            {
                "word": "tragic irony",
                "pos": "noun"
            },
            {
                "word": "tragicomedy",
                "pos": "noun"
            },
            {
                "word": "tragicomic",
                "pos": "adjective"
            },
            {
                "word": "trail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play that is both funny and sad; plays of this type",
                    "vi": "một vở kịch vừa vui vừa buồn; vở kịch kiểu này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or a situation that is both funny and sad",
                    "vi": "một sự kiện hoặc một tình huống vừa vui vừa buồn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3e75415a00ca4a4995d9faab646609c8",
        "word": "two-hander",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtuː ˈhændə(r)/",
            "us": "/ˌtuː ˈhændər/"
        },
        "nearby": [
            {
                "word": "The Two Gentlemen of Verona",
                "pos": ""
            },
            {
                "word": "two-handed",
                "pos": "adjective"
            },
            {
                "word": "two-hander",
                "pos": "noun"
            },
            {
                "word": "Cy Twombly",
                "pos": ""
            },
            {
                "word": "two-minute silence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play that is written for only two actors",
                    "vi": "một vở kịch chỉ được viết cho hai diễn viên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "17aeffb3cb5046e782bf981ca95bd1bc",
        "word": "variety",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vəˈraɪəti/",
            "us": "/vəˈraɪəti/"
        },
        "nearby": [
            {
                "word": "varied",
                "pos": "adjective"
            },
            {
                "word": "variegated",
                "pos": "adjective"
            },
            {
                "word": "variety",
                "pos": "noun"
            },
            {
                "word": "Variety",
                "pos": ""
            },
            {
                "word": "the Variety Club",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "several different sorts of the same thing",
                    "vi": "một số loại khác nhau của cùng một thứ"
                },
                "examples": [
                    {
                        "en": "There is a wide variety of patterns to choose from.",
                        "vi": "Có rất nhiều mẫu để lựa chọn."
                    },
                    {
                        "en": "He resigned for a variety of reasons.",
                        "vi": "Ông đã từ chức vì nhiều lý do."
                    },
                    {
                        "en": "This tool can be used in a variety of ways.",
                        "vi": "Công cụ này có thể được sử dụng theo nhiều cách khác nhau."
                    },
                    {
                        "en": "The text consists of extracts from a variety of sources.",
                        "vi": "Văn bản bao gồm các phần trích từ nhiều nguồn khác nhau."
                    },
                    {
                        "en": "articles and essays on a variety of topics",
                        "vi": "các bài báo và bài luận về nhiều chủ đề khác nhau"
                    },
                    {
                        "en": "I don't eat meat, only fish, but there's a good variety available here.",
                        "vi": "Tôi không ăn thịt, chỉ ăn cá, nhưng có rất nhiều loại thực phẩm ở đây."
                    },
                    {
                        "en": "The day-long excursion is one of a variety on offer for tourists.",
                        "vi": "Các chuyến du ngoạn kéo dài cả ngày là một trong những chuyến du ngoạn đa dạng dành cho khách du lịch."
                    },
                    {
                        "en": "I was impressed by the variety of dishes on offer.",
                        "vi": "Tôi rất ấn tượng bởi sự đa dạng của các món ăn được cung cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of not being the same or not doing the same thing all the time",
                    "vi": "chất lượng của việc không giống nhau hoặc không làm cùng một việc mọi lúc"
                },
                "examples": [
                    {
                        "en": "It's the variety that makes my job so enjoyable.",
                        "vi": "Chính sự đa dạng đã làm cho công việc của tôi trở nên thú vị."
                    },
                    {
                        "en": "We all need variety in our diet.",
                        "vi": "Tất cả chúng ta đều cần sự đa dạng trong chế độ ăn uống của mình."
                    },
                    {
                        "en": "We want more variety in our work.",
                        "vi": "Chúng tôi muốn có nhiều sự đa dạng hơn trong công việc của mình."
                    },
                    {
                        "en": "a constant craving for variety and adventure",
                        "vi": "khao khát liên tục đối với sự đa dạng và phiêu lưu"
                    },
                    {
                        "en": "The festival demonstrates the variety of the UK music scene.",
                        "vi": "Lễ hội thể hiện sự đa dạng của nền âm nhạc Vương quốc Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of a thing, for example a plant or language, that is different from the others in the same general group",
                    "vi": "một loại sự vật, ví dụ như thực vật hoặc ngôn ngữ, khác với những thứ khác trong cùng một nhóm chung"
                },
                "examples": [
                    {
                        "en": "Apples come in a great many varieties.",
                        "vi": "Táo có rất nhiều loại."
                    },
                    {
                        "en": "variety of something different varieties of English",
                        "vi": "nhiều thứ khác nhau của tiếng Anh"
                    },
                    {
                        "en": "This is a very rare variety of orchid.",
                        "vi": "Đây là một loại phong lan rất hiếm."
                    },
                    {
                        "en": "A typical estate in the region will grow at least three grape varieties.",
                        "vi": "Một điền trang điển hình trong vùng sẽ trồng ít nhất ba giống nho."
                    },
                    {
                        "en": "My cooking is of the ‘quick and simple’ variety.",
                        "vi": "Cách nấu ăn của tôi thuộc loại 'nhanh chóng và đơn giản'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a form of theatre or television entertainment that consists of a series of short performances, such as singing, dancing and funny acts",
                    "vi": "một hình thức giải trí sân khấu hoặc truyền hình bao gồm một loạt các buổi biểu diễn ngắn, chẳng hạn như ca hát, nhảy múa và các tiết mục hài hước"
                },
                "examples": [
                    {
                        "en": "a variety show/theatre",
                        "vi": "một chương trình tạp kỹ / nhà hát"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a range of different experiences makes life more interesting",
                    "vi": "có một loạt các trải nghiệm khác nhau làm cho cuộc sống thú vị hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f730d1086857486791ecc2b2c08cc3ac",
        "word": "vaudeville",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvɔːdəvɪl/",
            "us": "/ˈvɔːdəvɪl/"
        },
        "nearby": [
            {
                "word": "the Vatican",
                "pos": "noun"
            },
            {
                "word": "(the) Vatican City",
                "pos": "noun"
            },
            {
                "word": "vaudeville",
                "pos": "noun"
            },
            {
                "word": "vaudeville theater",
                "pos": "noun"
            },
            {
                "word": "Sarah Vaughan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a form of theatre or television entertainment that consists of a series of short performances, such as singing, dancing and funny acts",
                    "vi": "một hình thức giải trí sân khấu hoặc truyền hình bao gồm một loạt các buổi biểu diễn ngắn, chẳng hạn như ca hát, nhảy múa và các tiết mục hài hước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type of entertainment popular in the late nineteenth and early twentieth centuries, including singing, dancing and comedy",
                    "vi": "một loại hình giải trí phổ biến vào cuối thế kỷ 19 và đầu thế kỷ 20, bao gồm ca hát, khiêu vũ và hài kịch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d59dfffdc6f54f6a8bb242a79425d6b8",
        "word": "whodunnit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhuːˈdʌnɪt/",
            "us": "/ˌhuːˈdʌnɪt/"
        },
        "nearby": [
            {
                "word": "whoa",
                "pos": "exclamation"
            },
            {
                "word": "who'd",
                "pos": "short form"
            },
            {
                "word": "whodunnit",
                "pos": "noun"
            },
            {
                "word": "whoever",
                "pos": "pronoun"
            },
            {
                "word": "Who Killed Cock Robin?",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a story, play, etc. about a murder in which you do not know who did the murder until the end",
                    "vi": "một câu chuyện, vở kịch, v.v. về một vụ giết người mà bạn không biết ai đã giết người cho đến cuối cùng"
                },
                "examples": []
            }
        ]
    }
]