[
    {
        "id": "f793eafb9a474b859f43203a74432f59",
        "word": "fun",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/fʌn/",
            "us": "/fʌn/"
        },
        "nearby": [
            {
                "word": "fumigate",
                "pos": "verb"
            },
            {
                "word": "fumigation",
                "pos": "noun"
            },
            {
                "word": "fun",
                "pos": "noun"
            },
            {
                "word": "fun",
                "pos": "adjective"
            },
            {
                "word": "funboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of enjoying yourself; activities that you enjoy",
                    "vi": "cảm giác tận hưởng chính mình; hoạt động mà bạn thích"
                },
                "examples": [
                    {
                        "en": "We had a lot of fun at Sarah's party.",
                        "vi": "Chúng tôi đã có rất nhiều niềm vui trong bữa tiệc của Sarah."
                    },
                    {
                        "en": "Sailing is good fun.",
                        "vi": "Đi thuyền là niềm vui tốt."
                    },
                    {
                        "en": "It was great fun! You should have come too.",
                        "vi": "Đó là niềm vui lớn! Bạn cũng nên đến."
                    },
                    {
                        "en": "That was the most fun I have had in years.",
                        "vi": "Đó là niềm vui nhất mà tôi có được trong nhiều năm."
                    },
                    {
                        "en": "Have fun! (= Enjoy yourself)",
                        "vi": "Chúc vui vẻ! (= Hãy tận hưởng bản thân)"
                    },
                    {
                        "en": "‘What fun!’ she said with a laugh.",
                        "vi": "Vui gì!' cô ấy nói với một tiếng cười."
                    },
                    {
                        "en": "We won't let a bit of rain spoil our fun.",
                        "vi": "Chúng tôi sẽ không để một chút mưa làm hỏng cuộc vui của chúng tôi."
                    },
                    {
                        "en": "for fun I decided to learn Spanish, just for fun.",
                        "vi": "để giải trí, tôi quyết định học tiếng Tây Ban Nha, chỉ để giải trí."
                    },
                    {
                        "en": "I didn't do all that work just for the fun of it.",
                        "vi": "Tôi đã không làm tất cả những công việc đó chỉ vì niềm vui của nó."
                    },
                    {
                        "en": "it is fun doing something It's not much fun going to a party on your own.",
                        "vi": "thật là vui khi làm một điều gì đó Không có gì vui bằng việc tự mình đi dự tiệc."
                    },
                    {
                        "en": "It's no fun getting up at 4  a.m. on a cold, rainy morning.",
                        "vi": "Không có gì vui khi thức dậy lúc 4 giờ sáng vào một buổi sáng mưa lạnh."
                    },
                    {
                        "en": "Walking three miles in the pouring rain is not my idea of fun.",
                        "vi": "Đi bộ ba dặm trong cơn mưa tầm tã không phải là ý tưởng vui của tôi."
                    },
                    {
                        "en": "The whole family can join in the fun at Water World.",
                        "vi": "Cả gia đình có thể tham gia vui chơi tại Water World."
                    },
                    {
                        "en": "‘What do you say to a weekend in New York?’ ‘Sounds like fun.’",
                        "vi": "Bạn nói gì với một ngày cuối tuần ở New York?' 'Nghe có vẻ vui.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "behaviour or activities that are not serious but are meant to be enjoyed",
                    "vi": "hành vi hoặc hoạt động không nghiêm túc nhưng có nghĩa là để được hưởng"
                },
                "examples": [
                    {
                        "en": "She's very lively and full of fun.",
                        "vi": "Cô ấy rất sôi nổi và vui vẻ."
                    },
                    {
                        "en": "We didn't mean to hurt him. It was just a bit of fun.",
                        "vi": "Chúng tôi không cố ý làm tổn thương anh ấy. Nó chỉ là một chút vui vẻ."
                    },
                    {
                        "en": "You have to have a sense of fun to be a good teacher.",
                        "vi": "Bạn phải có một cảm giác vui vẻ để trở thành một giáo viên tốt."
                    },
                    {
                        "en": "in fun It wasn't serious—it was all done in fun.",
                        "vi": "trong niềm vui Nó không nghiêm trọng - tất cả đã được thực hiện trong niềm vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become somebody that other people laugh at",
                    "vi": "trở thành / trở thành người mà người khác cười nhạo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "activities that are not serious and that other people may think are bad",
                    "vi": "các hoạt động không nghiêm túc và người khác có thể nghĩ là xấu"
                },
                "examples": [
                    {
                        "en": "Teaching isn't all fun and games, you know.",
                        "vi": "Bạn biết đấy, dạy học không phải là trò vui và trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh at somebody/something or make other people laugh at them, usually in an unkind way",
                    "vi": "cười với ai đó / cái gì đó hoặc khiến người khác cười vào họ, thường là theo cách không tử tế"
                },
                "examples": [
                    {
                        "en": "It's cruel to make fun of people who stammer.",
                        "vi": "Thật tàn nhẫn khi chế giễu những người nói lắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say unkind things about somebody/something in order to make other people laugh at them",
                    "vi": "nói những điều không đẹp về ai đó / điều gì đó để khiến người khác cười vào họ"
                },
                "examples": [
                    {
                        "en": "Her novels poke fun at the upper class.",
                        "vi": "Tiểu thuyết của cô chọc cười giới thượng lưu."
                    },
                    {
                        "en": "She’s always poking fun at herself.",
                        "vi": "Cô ấy luôn tự giễu cợt bản thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "098cdc892cf44744b7d8fc482fa2eb1d",
        "word": "game",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡeɪm/",
            "us": "/ɡeɪm/"
        },
        "nearby": [
            {
                "word": "the Gambling Commission",
                "pos": ""
            },
            {
                "word": "gambol",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "noun"
            },
            {
                "word": "game",
                "pos": "verb"
            },
            {
                "word": "game",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an activity that you do to have fun, often one that has rules and that you can win or lose; the equipment for a game",
                    "vi": "một hoạt động mà bạn làm để giải trí, thường là một hoạt động có quy tắc và bạn có thể thắng hoặc thua; thiết bị cho một trò chơi"
                },
                "examples": [
                    {
                        "en": "The kids were playing a game with their balloons.",
                        "vi": "Những đứa trẻ đang chơi một trò chơi với những quả bóng bay của chúng."
                    },
                    {
                        "en": "The children invented a new game.",
                        "vi": "Những đứa trẻ đã phát minh ra một trò chơi mới."
                    },
                    {
                        "en": "a video/computer game",
                        "vi": "một trò chơi điện tử / máy tính"
                    },
                    {
                        "en": "I play online games with my friends.",
                        "vi": "Tôi chơi trò chơi trực tuyến với bạn bè của tôi."
                    },
                    {
                        "en": "a game of chance/skill",
                        "vi": "một trò chơi may rủi / kỹ năng"
                    },
                    {
                        "en": "Buy your games and software from us.",
                        "vi": "Mua trò chơi và phần mềm của bạn từ chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sport with rules in which people or teams compete against each other",
                    "vi": "một môn thể thao với các quy tắc trong đó mọi người hoặc các đội thi đấu với nhau"
                },
                "examples": [
                    {
                        "en": "ball games, such as football or tennis",
                        "vi": "trò chơi bóng, chẳng hạn như bóng đá hoặc quần vợt"
                    },
                    {
                        "en": "How I hated team games at school!",
                        "vi": "Tôi ghét các trò chơi đồng đội ở trường như thế nào!"
                    },
                    {
                        "en": "the game of something the game of golf/cricket/basketball",
                        "vi": "trò chơi của một cái gì đó trò chơi gôn / cricket / bóng rổ"
                    },
                    {
                        "en": "Broadcasters have injected vast amounts of money into the game of football.",
                        "vi": "Các đài truyền hình đã bơm một lượng lớn tiền vào trò chơi bóng đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion of playing a game",
                    "vi": "một dịp để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "to win/lose a game",
                        "vi": "thắng / thua một trò chơi"
                    },
                    {
                        "en": "They lost their first home game of the season.",
                        "vi": "Họ đã thua trận sân nhà đầu tiên trong mùa giải."
                    },
                    {
                        "en": "a baseball/basketball game",
                        "vi": "một trận bóng chày / bóng rổ"
                    },
                    {
                        "en": "(especially North American English) a football game",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) một trò chơi bóng đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody plays a game",
                    "vi": "cách mà ai đó chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "Maguire raised his game to collect the £40 000 first prize.",
                        "vi": "Maguire đã gây quỹ cho trò chơi của mình để thu về giải nhất trị giá £ 40 000."
                    },
                    {
                        "en": "Stretching exercises can help you avoid injury and improve your game.",
                        "vi": "Các bài tập kéo căng có thể giúp bạn tránh chấn thương và cải thiện trò chơi của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large organized sports event",
                    "vi": "một sự kiện thể thao được tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "She's hoping to participate in the next Olympic Games.",
                        "vi": "Cô ấy hy vọng sẽ tham gia Thế vận hội Olympic tiếp theo."
                    },
                    {
                        "en": "To stage the Games (= the Olympic Games or a similar event) is an honour.",
                        "vi": "Được tổ chức Thế vận hội (= Thế vận hội Olympic hoặc một sự kiện tương tự) là một vinh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "sport as a lesson or an activity at school",
                    "vi": "thể thao như một bài học hoặc một hoạt động ở trường"
                },
                "examples": [
                    {
                        "en": "I always hated games at school.",
                        "vi": "Tôi luôn ghét những trò chơi ở trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of some games, such as tennis, which forms a unit in scoring",
                    "vi": "một phần của một số trò chơi, chẳng hạn như quần vợt, tạo thành một đơn vị tính điểm"
                },
                "examples": [
                    {
                        "en": "two games all (= both players have won two games)",
                        "vi": "tất cả hai trò chơi (= cả hai người chơi đã thắng hai trò chơi)"
                    },
                    {
                        "en": "Zverev won the opening game of the third set.",
                        "vi": "Zverev đã giành chiến thắng trong game mở màn của set thứ ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of activity or business",
                    "vi": "một loại hoạt động hoặc kinh doanh"
                },
                "examples": [
                    {
                        "en": "How long have you been in this game?",
                        "vi": "Bạn đã chơi trò chơi này bao lâu rồi?"
                    },
                    {
                        "en": "the game of politics",
                        "vi": "trò chơi của chính trị"
                    },
                    {
                        "en": "I'm new to this game myself.",
                        "vi": "Bản thân tôi là người mới tham gia trò chơi này."
                    },
                    {
                        "en": "Getting dirty was all part of the game to the kids.",
                        "vi": "Làm bẩn là một phần của trò chơi đối với bọn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret and clever plan; a trick",
                    "vi": "một kế hoạch bí mật và thông minh; một thủ thuật"
                },
                "examples": [
                    {
                        "en": "So that's his game (= now I know what he has been planning).",
                        "vi": "Vì vậy, đó là trò chơi của anh ấy (= bây giờ tôi biết anh ấy đã lên kế hoạch gì)."
                    }
                ]
            },
            {
                "define": {
                    "en": "wild animals or birds that people hunt for sport or food",
                    "vi": "động vật hoang dã hoặc các loài chim mà mọi người săn lùng để thể thao hoặc làm thực phẩm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at an advantage/disadvantage because you have done more/less preparation or know more/less than other people, especially those you are competing against",
                    "vi": "có lợi / bất lợi vì bạn đã chuẩn bị nhiều hơn / ít hơn hoặc biết nhiều hơn / ít hơn những người khác, đặc biệt là những người bạn đang cạnh tranh"
                },
                "examples": [
                    {
                        "en": "We'll be able to extract insights out of the data that will enable us to stay ahead of the game.",
                        "vi": "Chúng tôi sẽ có thể trích xuất thông tin chi tiết từ dữ liệu giúp chúng tôi dẫn đầu trò chơi."
                    },
                    {
                        "en": "Politicians are behind the game in understanding how fast the world is changing.",
                        "vi": "Các chính trị gia đứng sau trò chơi trong việc hiểu thế giới đang thay đổi nhanh như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat or do better than somebody in an activity which they have chosen or in which they think they are strong",
                    "vi": "để đánh bại hoặc làm tốt hơn ai đó trong một hoạt động mà họ đã chọn hoặc trong đó họ nghĩ rằng họ mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not be considered to be serious",
                    "vi": "không được coi là nghiêm túc"
                },
                "examples": [
                    {
                        "en": "For her the whole project was just a game.",
                        "vi": "Đối với cô ấy, toàn bộ dự án chỉ là một trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be working as a prostitute",
                    "vi": "làm gái mại dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to no longer have a chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "không còn cơ hội thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to still/once again have a good chance of winning a game or succeeding in an activity that you are taking part in",
                    "vi": "vẫn / một lần nữa có cơ hội tốt để thắng một trò chơi hoặc thành công trong một hoạt động mà bạn đang tham gia"
                },
                "examples": [
                    {
                        "en": "The team was still in the game, just one goal down.",
                        "vi": "Đội vẫn đang thi đấu, chỉ ghi được một bàn thua."
                    },
                    {
                        "en": "(figurative) He’s been fighting to get the struggling company back in the game.",
                        "vi": "(nghĩa bóng) Anh ấy đang chiến đấu để đưa công ty đang gặp khó khăn trở lại trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "activities that are not serious and that other people may think are bad",
                    "vi": "các hoạt động không nghiêm túc và người khác có thể nghĩ là xấu"
                },
                "examples": [
                    {
                        "en": "Teaching isn't all fun and games, you know.",
                        "vi": "Bạn biết đấy, dạy học không phải là trò vui và trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "said to somebody who has done something wrong, when they are caught and the crime or trick has been discovered",
                    "vi": "nói với ai đó đã làm điều gì đó sai trái, khi họ bị bắt và tội ác hoặc thủ đoạn đã bị phát hiện"
                },
                "examples": [
                    {
                        "en": "Maggie knew that he had recognized her and the game was up.",
                        "vi": "Maggie biết rằng anh đã nhận ra cô và trò chơi đã kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after something has happened that makes it clear that a contest is not yet decided and anyone could still win",
                    "vi": "được sử dụng sau khi một điều gì đó đã xảy ra để làm rõ rằng một cuộc thi vẫn chưa được quyết định và bất kỳ ai vẫn có thể giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "We were losing 2–0 with ten minutes to go, and then we scored. It was game on!",
                        "vi": "Chúng tôi đã để thua 2–0 khi còn mười phút nữa, và sau đó chúng tôi ghi bàn. Đó là trò chơi trên!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is no longer possible for somebody/something to succeed, survive or continue",
                    "vi": "được sử dụng để nói rằng không còn có thể cho ai đó / cái gì đó thành công, tồn tại hoặc tiếp tục"
                },
                "examples": [
                    {
                        "en": "Given her recent slump in form, it might be game over already this season.",
                        "vi": "Với phong độ sa sút gần đây của cô ấy, có thể trận đấu đã kết thúc trong mùa giải này."
                    },
                    {
                        "en": "This technology could mean game over for gasoline-powered vehicles.",
                        "vi": "Công nghệ này có nghĩa là trò chơi kết thúc đối với các loại xe chạy bằng xăng."
                    },
                    {
                        "en": "The slightest mistake and it's game over for him.",
                        "vi": "Sai lầm nhỏ nhất và trò chơi đã kết thúc đối với anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a secret, especially by accident; to show something that should be kept hidden",
                    "vi": "để kể một bí mật, đặc biệt là tình cờ; để hiển thị một cái gì đó nên được giấu kín"
                },
                "examples": [
                    {
                        "en": "Don't let him talk to anybody or he'll give the game away.",
                        "vi": "Đừng để anh ta nói chuyện với bất kỳ ai, nếu không anh ta sẽ bỏ cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity that is unlikely to be successful or make a profit",
                    "vi": "một hoạt động không chắc sẽ thành công hoặc tạo ra lợi nhuận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most important aspect of an activity; the most important quality needed for an activity",
                    "vi": "khía cạnh quan trọng nhất của một hoạt động; chất lượng quan trọng nhất cần thiết cho một hoạt động"
                },
                "examples": [
                    {
                        "en": "Hard work is the name of the game if you want to succeed in business.",
                        "vi": "Làm việc chăm chỉ là tên của trò chơi nếu bạn muốn thành công trong kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the advantages to be gained from doing something are not great enough, considering the effort or cost involved",
                    "vi": "lợi thế đạt được từ việc làm gì đó là không đủ lớn, nếu xét đến nỗ lực hoặc chi phí liên quan"
                },
                "examples": [
                    {
                        "en": "If the price goes up again, he may decide that the game’s not worth the candle.",
                        "vi": "Nếu giá tăng trở lại, anh ta có thể quyết định rằng trò chơi không có giá trị như ngọn nến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of considering an activity, etc. that considers only the number of people doing something, things achieved, etc., not with who or what they are",
                    "vi": "một cách xem xét một hoạt động, v.v. chỉ xem xét số lượng người đang làm điều gì đó, những thứ đã đạt được, v.v., chứ không xem xét họ là ai hoặc cái gì"
                },
                "examples": [
                    {
                        "en": "MPs were playing the numbers game as the crucial vote drew closer.",
                        "vi": "Các nghị sĩ đã chơi trò chơi số khi cuộc bỏ phiếu quan trọng đến gần hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "performing badly/well, especially when compared with how well you usually perform",
                    "vi": "hoạt động kém / tốt, đặc biệt là khi so sánh với mức độ bạn thường thực hiện"
                },
                "examples": [
                    {
                        "en": "He was off his game and missed two early penalties.",
                        "vi": "Anh ấy đã nghỉ thi đấu và bỏ lỡ hai quả phạt đền sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important thing of a particular type, or the only thing that is available",
                    "vi": "điều quan trọng nhất của một loại cụ thể hoặc thứ duy nhất có sẵn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a cruel game with somebody in your power by changing your behaviour very often, so that they become nervous and do not know what to expect",
                    "vi": "chơi một trò chơi tàn ác với ai đó trong quyền lực của bạn bằng cách thay đổi hành vi của bạn rất thường xuyên, để họ trở nên lo lắng và không biết điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "He thought the police were playing some elaborate game of cat and mouse and waiting to trap him.",
                        "vi": "Anh ta nghĩ rằng cảnh sát đang chơi trò mèo vờn chuột phức tạp nào đó và chờ đợi để bẫy anh ta."
                    },
                    {
                        "en": "Young car thieves enjoy playing cat and mouse with the police.",
                        "vi": "Những tên trộm xe hơi thích thú chơi trò mèo vờn chuột với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that helps somebody else’s plans, especially by accident, when you did not intend to help them",
                    "vi": "để làm điều gì đó giúp ích cho kế hoạch của người khác, đặc biệt là do tình cờ, khi bạn không có ý định giúp họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a fair and honest way",
                    "vi": "cư xử một cách công bằng và trung thực"
                },
                "examples": [
                    {
                        "en": "You can’t do that—it’s not playing the game!",
                        "vi": "Bạn không thể làm điều đó — đó không phải là chơi trò chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "not to treat a situation seriously, especially in order to cheat somebody",
                    "vi": "không đối xử nghiêm túc với một tình huống, đặc biệt là để lừa dối ai đó"
                },
                "examples": [
                    {
                        "en": "Don't play silly games with me; I know you did it.",
                        "vi": "Đừng chơi những trò chơi ngớ ngẩn với tôi; Tôi biết bạn đã làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the standards of behaviour that most people accept or that actually operate in a particular area of life or business",
                    "vi": "các tiêu chuẩn hành vi mà hầu hết mọi người chấp nhận hoặc thực sự hoạt động trong một lĩnh vực cụ thể của cuộc sống hoặc kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk in a way that sounds convincing, but may not be sincere",
                    "vi": "nói theo cách nghe có vẻ thuyết phục, nhưng có thể không chân thành"
                },
                "examples": [
                    {
                        "en": "The senior managers talk a good game about customer relations, but really they don't care about the customer.",
                        "vi": "Các nhà quản lý cấp cao nói một trò chơi hay về quan hệ khách hàng, nhưng thực sự họ không quan tâm đến khách hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who has played a trick on you that you can do the same thing to them",
                    "vi": "từng nói với ai đó đã chơi lừa bạn rằng bạn có thể làm điều tương tự với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to improve the level at which you can compete, especially in a sport",
                    "vi": "để nâng cao trình độ mà bạn có thể thi đấu, đặc biệt là trong một môn thể thao"
                },
                "examples": [
                    {
                        "en": "She's really upped her game since she joined the tennis club.",
                        "vi": "Cô ấy đã thực sự nâng cao trò chơi của mình kể từ khi cô ấy tham gia câu lạc bộ quần vợt."
                    },
                    {
                        "en": "With these two snazzy new restaurants opening up, the other eating places in the area are going to have to up their game.",
                        "vi": "Với việc hai nhà hàng mới kinh doanh sôi động này mở cửa, các địa điểm ăn uống khác trong khu vực sẽ phải bắt đầu cuộc chơi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why somebody is behaving as they are",
                    "vi": "được sử dụng để hỏi tại sao ai đó lại cư xử như họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9927dc6c9fd24663a87043a937b5cbf5",
        "word": "lose",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/luːz/",
            "us": "/luːz/"
        },
        "nearby": [
            {
                "word": "the Los Angeles Police Department",
                "pos": ""
            },
            {
                "word": "the Los Angeles Times",
                "pos": ""
            },
            {
                "word": "lose",
                "pos": "verb"
            },
            {
                "word": "lose out",
                "pos": "phrasal verb"
            },
            {
                "word": "lose out to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be unable to find something/somebody",
                    "vi": "không thể tìm thấy thứ gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "I've lost my keys.",
                        "vi": "Tôi bị mất chìa khóa."
                    },
                    {
                        "en": "The tickets seem to have got lost.",
                        "vi": "Vé dường như đã bị mất."
                    },
                    {
                        "en": "She lost her husband in the crowd.",
                        "vi": "Cô mất chồng giữa đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something/somebody taken away from you, especially as a result of an accident, dying, etc.",
                    "vi": "để có một cái gì đó / ai đó lấy đi bạn, đặc biệt là do tai nạn, chết, v.v."
                },
                "examples": [
                    {
                        "en": "She lost a leg in a car crash.",
                        "vi": "Cô ấy bị mất một chân trong một vụ tai nạn ô tô."
                    },
                    {
                        "en": "Some families lost everything (= all they owned) in the flood.",
                        "vi": "Một số gia đình đã mất tất cả (= tất cả những gì họ sở hữu) trong trận lụt."
                    },
                    {
                        "en": "She lost her baby (= had a miscarriage) three months into the pregnancy.",
                        "vi": "Cô ấy đã mất đứa con của mình (= bị sẩy thai) khi mang thai ba tháng."
                    },
                    {
                        "en": "They lost both their sons (= they were killed) in the war.",
                        "vi": "Họ đã mất cả hai con trai của họ (= họ đã bị giết) trong chiến tranh."
                    },
                    {
                        "en": "The ship was lost at sea (= it sank).",
                        "vi": "Con tàu bị mất trên biển (= nó bị chìm)."
                    },
                    {
                        "en": "Many people lost their lives (= were killed).",
                        "vi": "Nhiều người đã mất mạng (= bị giết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have to give up something; to fail to keep something/somebody",
                    "vi": "phải từ bỏ một cái gì đó; không giữ được thứ gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "He's lost his job.",
                        "vi": "Anh ấy đã mất việc."
                    },
                    {
                        "en": "You will lose your deposit if you cancel the order.",
                        "vi": "Bạn sẽ mất tiền đặt cọc nếu hủy đơn hàng."
                    },
                    {
                        "en": "Sit down or you'll lose your seat.",
                        "vi": "Ngồi xuống nếu không bạn sẽ mất ghế."
                    },
                    {
                        "en": "The government has lost control of the city.",
                        "vi": "Chính phủ đã mất quyền kiểm soát thành phố."
                    },
                    {
                        "en": "We cannot afford to lose any more senior members of staff.",
                        "vi": "Chúng tôi không thể để mất thêm bất kỳ thành viên cấp cao nào của đội ngũ nhân viên."
                    },
                    {
                        "en": "The average business loses 20 per cent of its customers every year.",
                        "vi": "Doanh nghiệp trung bình mất 20% khách hàng mỗi năm."
                    },
                    {
                        "en": "You risk losing your house if you do not keep up the payments.",
                        "vi": "Bạn có nguy cơ mất nhà nếu bạn không thanh toán kịp."
                    },
                    {
                        "en": "lose something to somebody/something The company has lost a lot of business to its competitors.",
                        "vi": "mất một cái gì đó cho ai đó / cái gì đó Công ty đã mất rất nhiều công việc kinh doanh vào tay các đối thủ cạnh tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to no longer have something, or have less of something than you had before, especially as a result of getting older",
                    "vi": "không còn có thứ gì đó, hoặc có ít thứ hơn bạn đã có trước đây, đặc biệt là do già đi"
                },
                "examples": [
                    {
                        "en": "to lose your hair/teeth",
                        "vi": "rụng tóc / răng"
                    },
                    {
                        "en": "to lose your sight/eyesight/hearing/memory",
                        "vi": "mất thị lực / thị lực / thính giác / trí nhớ của bạn"
                    },
                    {
                        "en": "There's new hope for people trying to lose weight.",
                        "vi": "Có hy vọng mới cho những người đang cố gắng giảm cân."
                    },
                    {
                        "en": "I've lost ten pounds since I started this diet.",
                        "vi": "Tôi đã giảm được 10 cân kể từ khi bắt đầu chế độ ăn kiêng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have less and less of a quality or ability, especially until you no longer have any of it",
                    "vi": "ngày càng có ít phẩm chất hoặc khả năng hơn, đặc biệt là cho đến khi bạn không còn"
                },
                "examples": [
                    {
                        "en": "She seemed to have lost interest in food.",
                        "vi": "Cô ấy dường như không còn hứng thú với đồ ăn."
                    },
                    {
                        "en": "to lose faith/confidence",
                        "vi": "mất niềm tin / sự tự tin"
                    },
                    {
                        "en": "He lost his nerve at the last minute.",
                        "vi": "Anh ta mất thần kinh vào phút cuối."
                    },
                    {
                        "en": "At that moment he lost his balance and fell.",
                        "vi": "Đúng lúc đó anh ấy mất thăng bằng và ngã xuống."
                    },
                    {
                        "en": "The train was losing speed.",
                        "vi": "Con tàu đang giảm tốc độ."
                    },
                    {
                        "en": "He never lost the ability to make people laugh.",
                        "vi": "Anh ấy không bao giờ đánh mất khả năng làm cho mọi người cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be defeated; to fail to win a competition, a court case, an argument, etc.; to cause somebody to be defeated",
                    "vi": "bị đánh bại; không thắng trong một cuộc cạnh tranh, một vụ kiện, một cuộc tranh cãi, v.v ...; khiến ai đó bị đánh bại"
                },
                "examples": [
                    {
                        "en": "lose something So far they haven't lost a game.",
                        "vi": "mất một cái gì đó Cho đến nay họ vẫn chưa thua trận nào."
                    },
                    {
                        "en": "to lose a race/an election/a battle/a war",
                        "vi": "để thua một cuộc đua / một cuộc bầu cử / một trận chiến / một cuộc chiến"
                    },
                    {
                        "en": "lose to somebody We lost to a stronger team.",
                        "vi": "thua ai đó Chúng tôi thua một đội mạnh hơn."
                    },
                    {
                        "en": "lose by something He lost by less than 100 votes.",
                        "vi": "thua một cái gì đó Anh ấy thua ít hơn 100 phiếu bầu."
                    },
                    {
                        "en": "lose something by something We lost the game by three points.",
                        "vi": "mất một cái gì đó bởi một cái gì đó Chúng tôi đã thua trò chơi với ba điểm."
                    },
                    {
                        "en": "lose on something (to somebody) They lost on penalties to (= because they scored fewer penalties than) Spain.",
                        "vi": "thua một cái gì đó (trước ai đó) Họ thua trên chấm phạt đền trước (= vì họ ghi ít quả phạt đền hơn) Tây Ban Nha."
                    },
                    {
                        "en": "lose somebody something Many believe the incident lost them the election.",
                        "vi": "mất ai đó một cái gì đó Nhiều người tin rằng sự cố đã làm họ mất cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to keep something you want or need, especially money; to cause somebody to fail to keep something",
                    "vi": "không giữ được thứ bạn muốn hoặc cần, đặc biệt là tiền; khiến ai đó không giữ được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "lose something The business is losing money.",
                        "vi": "mất một cái gì đó Công việc kinh doanh đang thua lỗ."
                    },
                    {
                        "en": "Poetry always loses something in translation.",
                        "vi": "Thơ luôn mất đi một cái gì đó trong bản dịch."
                    },
                    {
                        "en": "lose something by doing something You have nothing to lose by telling the truth.",
                        "vi": "mất một cái gì đó bằng cách làm một cái gì đó Bạn không có gì để mất bằng cách nói sự thật."
                    },
                    {
                        "en": "What do we lose by working with them?",
                        "vi": "Chúng ta mất gì khi làm việc với họ?"
                    },
                    {
                        "en": "lose on something We lost on that deal.",
                        "vi": "mất một cái gì đó Chúng tôi đã mất trong thỏa thuận đó."
                    },
                    {
                        "en": "The company stands to lose financially if this deal falls through.",
                        "vi": "Công ty sẽ thua lỗ về mặt tài chính nếu thương vụ này thất bại."
                    },
                    {
                        "en": "lose somebody something His carelessness lost him the job.",
                        "vi": "Mất ai đó thứ gì đó Sự bất cẩn của anh ấy đã làm anh ấy mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail to get, hear or understand something",
                    "vi": "không hiểu, nghe hoặc hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "His words were lost (= could not be heard) in the applause.",
                        "vi": "Lời nói của anh ta đã mất đi (= không thể nghe được) trong tiếng vỗ tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be no longer understood by somebody",
                    "vi": "không còn được ai đó hiểu"
                },
                "examples": [
                    {
                        "en": "I'm afraid you've lost me there.",
                        "vi": "Tôi sợ rằng bạn đã mất tôi ở đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to escape from somebody/something",
                    "vi": "thoát khỏi ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "We managed to lose our pursuers in the darkness.",
                        "vi": "Chúng tôi đã quản lý để mất những kẻ truy đuổi của chúng tôi trong bóng tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to waste time or an opportunity",
                    "vi": "lãng phí thời gian hoặc một cơ hội"
                },
                "examples": [
                    {
                        "en": "We lost twenty minutes changing a tyre.",
                        "vi": "Chúng tôi mất hai mươi phút để thay lốp."
                    },
                    {
                        "en": "Hurry—there's no time to lose!",
                        "vi": "Nhanh lên — không có thời gian để mất!"
                    },
                    {
                        "en": "He lost no time in setting out for London.",
                        "vi": "Anh ta không mất thời gian để lên đường đến London."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a watch or clock loses or loses time, it goes too slowly or becomes a particular amount of time behind the correct time",
                    "vi": "nếu đồng hồ đeo tay hoặc đồng hồ bị mất hoặc mất thời gian, nó sẽ đi quá chậm hoặc trở thành một khoảng thời gian cụ thể chậm hơn so với thời gian chính xác"
                },
                "examples": [
                    {
                        "en": "This clock loses two minutes a day.",
                        "vi": "Đồng hồ này mất hai phút một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to stop yourself from crying, laughing, etc.; to become crazy",
                    "vi": "không thể ngăn mình khóc, không cười, v.v ...; trở nên điên rồ"
                },
                "examples": [
                    {
                        "en": "Then she just lost it and started screaming.",
                        "vi": "Sau đó, cô ấy chỉ mất nó và bắt đầu la hét."
                    }
                ]
            }
        ]
    },
    {
        "id": "1e37ba91f92a404aa62fdf77030d92c0",
        "word": "play",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/pleɪ/",
            "us": "/pleɪ/"
        },
        "nearby": [
            {
                "word": "plausible",
                "pos": "adjective"
            },
            {
                "word": "plausibly",
                "pos": "adverb"
            },
            {
                "word": "play",
                "pos": "verb"
            },
            {
                "word": "play",
                "pos": "noun"
            },
            {
                "word": "playable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to do things for pleasure, as children do; to enjoy yourself, rather than work",
                    "vi": "làm những việc vì niềm vui, như những đứa trẻ vẫn làm; để tận hưởng bản thân, thay vì làm việc"
                },
                "examples": [
                    {
                        "en": "You'll have to play inside today.",
                        "vi": "Bạn sẽ phải chơi bên trong hôm nay."
                    },
                    {
                        "en": "There's a time to work and a time to play.",
                        "vi": "Có thời gian để làm việc và thời gian để vui chơi."
                    },
                    {
                        "en": "play with somebody/something A group of kids were playing with a ball in the street.",
                        "vi": "chơi với ai đó / cái gì đó Một nhóm trẻ em đang chơi với một quả bóng trên đường phố."
                    },
                    {
                        "en": "I haven't got anybody to play with!",
                        "vi": "Tôi không có ai để chơi cùng!"
                    },
                    {
                        "en": "play something Let's play a different game.",
                        "vi": "chơi thứ gì đó Hãy chơi một trò chơi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to be or do something for fun",
                    "vi": "giả vờ hoặc làm điều gì đó để giải trí"
                },
                "examples": [
                    {
                        "en": "play something Let's play pirates.",
                        "vi": "chơi gì đó Hãy chơi cướp biển."
                    },
                    {
                        "en": "play at something Let's play at pirates!",
                        "vi": "chơi tại một cái gì đó Hãy chơi với cướp biển!"
                    },
                    {
                        "en": "play at doing something They were playing at being cowboys.",
                        "vi": "chơi khi làm một cái gì đó Họ đã chơi khi trở thành cao bồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in a game; to compete against somebody in a game",
                    "vi": "được tham gia vào một trò chơi; để cạnh tranh với ai đó trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "play something to play football/cards",
                        "vi": "chơi thứ gì đó để chơi bóng đá / bài"
                    },
                    {
                        "en": "play something with/against somebody I usually play chess with my brother.",
                        "vi": "chơi thứ gì đó với / chống lại ai đó Tôi thường chơi cờ với anh trai mình."
                    },
                    {
                        "en": "play somebody France are playing Wales tomorrow.",
                        "vi": "chơi ai đó Pháp sẽ đấu với xứ Wales vào ngày mai."
                    },
                    {
                        "en": "play somebody at something Have you played her at squash yet?",
                        "vi": "chơi ai đó ở trò chơi nào đó Bạn đã chơi cô ấy ở trò chơi bóng quần chưa?"
                    },
                    {
                        "en": "play for somebody He plays for Cleveland.",
                        "vi": "chơi cho ai đó Anh ấy chơi cho Cleveland."
                    },
                    {
                        "en": "play against somebody France are playing against Wales on Saturday.",
                        "vi": "đấu với ai đó Pháp sẽ đấu với xứ Wales vào thứ Bảy."
                    },
                    {
                        "en": "play with somebody I like football, but I don't have anyone to play with.",
                        "vi": "chơi với ai đó mà tôi thích bóng đá, nhưng tôi không có ai để chơi cùng."
                    },
                    {
                        "en": "+ adv./prep. Evans played very well.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a particular position in a sports team",
                    "vi": "đảm nhận một vị trí cụ thể trong một đội thể thao"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. Who's playing on the wing?",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ noun I've never played right back before.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to include somebody in a sports team",
                    "vi": "đưa ai đó vào đội thể thao"
                },
                "examples": [
                    {
                        "en": "I think we should play Matt on the wing.",
                        "vi": "Tôi nghĩ chúng tôi nên chơi Matt ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make contact with the ball and hit or kick it in the way mentioned",
                    "vi": "tiếp xúc với bóng và đánh hoặc đá theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "She played the ball and ran forward.",
                        "vi": "Cô chơi bóng và chạy về phía trước."
                    },
                    {
                        "en": "He played a backhand volley.",
                        "vi": "Anh ấy đã chơi một cú vô lê trái tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move a piece in chess, etc.",
                    "vi": "để di chuyển một quân cờ trong cờ vua, v.v."
                },
                "examples": [
                    {
                        "en": "She played her bishop.",
                        "vi": "Cô ấy đã đóng vai giám mục của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a card face upwards on the table, showing its value",
                    "vi": "đặt một quân bài ngửa lên trên bàn, thể hiện giá trị của nó"
                },
                "examples": [
                    {
                        "en": "to play your ace/a trump",
                        "vi": "chơi át chủ bài / một con át chủ bài của bạn"
                    },
                    {
                        "en": "He played out of turn!",
                        "vi": "Anh ấy đã chơi hết lượt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform music on a musical instrument",
                    "vi": "biểu diễn âm nhạc trên một nhạc cụ"
                },
                "examples": [
                    {
                        "en": "play (something) She played Mozart's Piano Concerto No. 20.",
                        "vi": "chơi (cái gì đó) Cô ấy đã chơi bản hòa tấu piano số 20 của Mozart."
                    },
                    {
                        "en": "The music is well played and beautifully recorded.",
                        "vi": "Âm nhạc được chơi tốt và thu âm đẹp."
                    },
                    {
                        "en": "In the distance a band was playing.",
                        "vi": "Ở đằng xa, một ban nhạc đang chơi."
                    },
                    {
                        "en": "play on something He sat in the corner, playing softly on his guitar.",
                        "vi": "chơi trên một cái gì đó Anh ngồi trong góc, chơi nhẹ nhàng trên cây đàn của anh."
                    },
                    {
                        "en": "play something on something He played a tune on his harmonica.",
                        "vi": "chơi một cái gì đó trên một cái gì đó Anh ấy chơi một giai điệu trên chiếc kèn harmonica của mình."
                    },
                    {
                        "en": "play something to somebody Play that new piece to us.",
                        "vi": "chơi một cái gì đó cho ai đó Chơi bài mới đó cho chúng tôi."
                    },
                    {
                        "en": "play somebody something Play us that new piece.",
                        "vi": "chơi ai đó một cái gì đó Chơi cho chúng tôi tác phẩm mới đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the skill of performing on a musical instrument",
                    "vi": "có kỹ năng biểu diễn trên một nhạc cụ"
                },
                "examples": [
                    {
                        "en": "Do you play a musical instrument?",
                        "vi": "Bạn có chơi nhạc cụ gì không?"
                    },
                    {
                        "en": "to play the piano/violin/flute",
                        "vi": "chơi piano / violin / sáo"
                    },
                    {
                        "en": "I'm learning to play sax.",
                        "vi": "Tôi đang học chơi sax."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use an MP3 player, a CD player, etc. to make it possible to hear a song, an album, a CD, etc.",
                    "vi": "sử dụng máy nghe nhạc MP3, máy nghe nhạc CD, v.v. để có thể nghe một bài hát, album, CD, v.v."
                },
                "examples": [
                    {
                        "en": "I played some music to drown out the noise.",
                        "vi": "Tôi bật một số bản nhạc để át đi tiếng ồn."
                    },
                    {
                        "en": "They're always playing that song on the radio.",
                        "vi": "Họ luôn phát bài hát đó trên radio."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of a song, an album, etc.) to be heard",
                    "vi": "(của một bài hát, một album, v.v.) sẽ được nghe"
                },
                "examples": [
                    {
                        "en": "My favourite song was playing on the radio.",
                        "vi": "Bài hát yêu thích của tôi đã được phát trên radio."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start working; to make a video or DVD start working",
                    "vi": "để bắt đầu làm việc; để làm cho một video hoặc DVD bắt đầu hoạt động"
                },
                "examples": [
                    {
                        "en": "These videos won't play on my computer.",
                        "vi": "Những video này sẽ không phát trên máy tính của tôi."
                    },
                    {
                        "en": "play something Click below to play videos.",
                        "vi": "chơi thứ gì đó Nhấp vào bên dưới để phát video."
                    },
                    {
                        "en": "Nothing happens when I try to play a DVD.",
                        "vi": "Không có gì xảy ra khi tôi cố gắng phát một đĩa DVD."
                    },
                    {
                        "en": "A short video was played to the court showing the inside of the house.",
                        "vi": "Một đoạn video ngắn đã được phát tới tòa án cho thấy bên trong ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in a play, film, etc.; to act the role of somebody",
                    "vi": "đóng một vở kịch, một bộ phim, v.v.; đóng vai trò của ai đó"
                },
                "examples": [
                    {
                        "en": "play something to play a role/part",
                        "vi": "chơi một cái gì đó để đóng một vai trò / một phần"
                    },
                    {
                        "en": "The part of Elizabeth was played by Cate Blanchett.",
                        "vi": "Phần Elizabeth do Cate Blanchett thủ vai."
                    },
                    {
                        "en": "He had always wanted to play Othello.",
                        "vi": "Anh ấy luôn muốn chơi Othello."
                    },
                    {
                        "en": "He was chosen to play the role of Judas.",
                        "vi": "Anh được chọn để đóng vai Judas."
                    },
                    {
                        "en": "She usually plays historical characters.",
                        "vi": "Cô thường đóng vai các nhân vật lịch sử."
                    },
                    {
                        "en": "play opposite somebody She played opposite Brad Pitt (= she and Brad Pitt played the two leading roles).",
                        "vi": "chơi đối diện với ai đó Cô ấy đã đóng vai đối diện với Brad Pitt (= cô ấy và Brad Pitt đóng hai vai chính)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to be something that you are not",
                    "vi": "giả vờ là một cái gì đó mà bạn không phải là"
                },
                "examples": [
                    {
                        "en": "The children were dressed as soldiers, but they were just playing.",
                        "vi": "Bọn trẻ ăn mặc như những người lính, nhưng chúng chỉ đang chơi đùa."
                    },
                    {
                        "en": "+ adj. I decided it was safer to play dead.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ noun She enjoys playing the wronged wife.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave as though you are a particular type of person",
                    "vi": "cư xử như thể bạn là một kiểu người cụ thể"
                },
                "examples": [
                    {
                        "en": "This is no time to play the hero.",
                        "vi": "Đây không phải là lúc để đóng vai anh hùng."
                    },
                    {
                        "en": "She always did enjoy playing the victim.",
                        "vi": "Cô ấy luôn thích đóng vai nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be performed",
                    "vi": "phải được thực hiện"
                },
                "examples": [
                    {
                        "en": "A production of ‘Carmen’ was playing to packed houses.",
                        "vi": "Một sản phẩm của 'Carmen' đã được phát cho những ngôi nhà đóng gói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a performance in a particular place",
                    "vi": "để trình diễn ở một địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "The band are playing 11 cities around the country.",
                        "vi": "Ban nhạc đang chơi ở 11 thành phố trên khắp đất nước."
                    },
                    {
                        "en": "I've played some fantastic venues.",
                        "vi": "Tôi đã chơi một số địa điểm tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect or influence on something",
                    "vi": "có ảnh hưởng hoặc ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social media played an important part in the last election.",
                        "vi": "Mạng xã hội đóng một vai trò quan trọng trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "Farming plays a crucial role in maintaining the landscape.",
                        "vi": "Trồng trọt đóng một vai trò quan trọng trong việc duy trì cảnh quan."
                    },
                    {
                        "en": "High environmental temperatures may also play a role.",
                        "vi": "Nhiệt độ môi trường cao cũng có thể đóng một vai trò nào đó."
                    },
                    {
                        "en": "Businesses can play their part by contributing some of their profits.",
                        "vi": "Các doanh nghiệp có thể đóng góp một phần lợi nhuận của mình."
                    },
                    {
                        "en": "All countries have a part to play in protecting the environment.",
                        "vi": "Tất cả các quốc gia đều có vai trò trong việc bảo vệ môi trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to trick somebody for fun",
                    "vi": "lừa ai đó cho vui"
                },
                "examples": [
                    {
                        "en": "Children ran around the village playing tricks.",
                        "vi": "Trẻ con chạy quanh làng chơi trò lố."
                    },
                    {
                        "en": "I played a trick on him just to see his reaction.",
                        "vi": "Tôi đã chơi một trò lừa với anh ta chỉ để xem phản ứng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with a situation in the way mentioned",
                    "vi": "để đối phó với một tình huống theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "He played the situation carefully for maximum advantage.",
                        "vi": "Anh ấy đã chơi các tình huống một cách cẩn thận để có lợi thế tối đa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something without being serious about it or putting much effort into it",
                    "vi": "để làm điều gì đó mà không nghiêm túc về nó hoặc đặt nhiều nỗ lực vào nó"
                },
                "examples": [
                    {
                        "en": "play at something He was just playing at it before—now he's serious.",
                        "vi": "chơi ở thứ gì đó Anh ấy chỉ chơi ở đó trước đây — giờ anh ấy đang nghiêm túc."
                    },
                    {
                        "en": "play at doing something They were playing at being villains, like in the movies.",
                        "vi": "chơi để làm một cái gì đó Họ đã chơi để trở thành nhân vật phản diện, giống như trong các bộ phim."
                    },
                    {
                        "en": "play something (with something) Officials are playing politics with farm programs.",
                        "vi": "chơi cái gì đó (với cái gì đó) Các quan chức đang chơi trò chính trị với các chương trình nông trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing to work with other people in a helpful way, especially so that somebody can get what they want",
                    "vi": "sẵn sàng làm việc với những người khác theo cách hữu ích, đặc biệt là để ai đó có thể đạt được những gì họ muốn"
                },
                "examples": [
                    {
                        "en": "He needs another loan, but the bank won't play.",
                        "vi": "Anh ta cần một khoản vay khác, nhưng ngân hàng sẽ không chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or appear quickly and lightly, often changing direction or shape",
                    "vi": "di chuyển hoặc xuất hiện một cách nhanh chóng và nhẹ nhàng, thường thay đổi hướng hoặc hình dạng"
                },
                "examples": [
                    {
                        "en": "Sunlight played on the surface of the lake.",
                        "vi": "Ánh nắng vờn trên mặt hồ."
                    },
                    {
                        "en": "A small smile played on her lips.",
                        "vi": "Một nụ cười nhỏ nở trên môi cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a fountain plays, it produces a steady stream of water",
                    "vi": "khi một đài phun nước phát, nó tạo ra một dòng nước ổn định"
                },
                "examples": [
                    {
                        "en": "Two huge fountains were playing outside the entrance.",
                        "vi": "Hai đài phun nước khổng lồ đang phát bên ngoài lối vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have plenty of money, time, etc. for doing something",
                    "vi": "có nhiều tiền, thời gian, v.v. để làm một việc gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to masturbate",
                    "vi": "thủ dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask in an angry way about what somebody is doing",
                    "vi": "từng hỏi một cách giận dữ về những gì ai đó đang làm"
                },
                "examples": [
                    {
                        "en": "What do you think you are playing at?",
                        "vi": "Bạn nghĩ bạn đang chơi gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "39562f720b9f4fa1905033741e12b6d7",
        "word": "player",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpleɪə(r)/",
            "us": "/ˈpleɪər/"
        },
        "nearby": [
            {
                "word": "play down",
                "pos": "phrasal verb"
            },
            {
                "word": "played out",
                "pos": "adjective"
            },
            {
                "word": "player",
                "pos": "noun"
            },
            {
                "word": "player piano",
                "pos": "noun"
            },
            {
                "word": "playful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who takes part in a game or sport",
                    "vi": "một người tham gia một trò chơi hoặc môn thể thao"
                },
                "examples": [
                    {
                        "en": "a football/tennis/chess player",
                        "vi": "một người chơi bóng đá / quần vợt / cờ vua"
                    },
                    {
                        "en": "top/star players",
                        "vi": "cầu thủ hàng đầu / ngôi sao"
                    },
                    {
                        "en": "a game for four players",
                        "vi": "một trò chơi cho bốn người chơi"
                    },
                    {
                        "en": "We've lost two key players through injury.",
                        "vi": "Chúng tôi đã mất hai cầu thủ quan trọng do chấn thương."
                    },
                    {
                        "en": "Celtic have signed four new players.",
                        "vi": "Celtic đã ký hợp đồng với bốn cầu thủ mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company or person involved in a particular area of business or politics",
                    "vi": "một công ty hoặc một người liên quan đến một lĩnh vực kinh doanh hoặc chính trị cụ thể"
                },
                "examples": [
                    {
                        "en": "The company has emerged as a major player in the London property market.",
                        "vi": "Công ty đã nổi lên như một người chơi lớn trong thị trường bất động sản London."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine for producing the sound or pictures that have been recorded on CDs, etc.",
                    "vi": "máy tạo âm thanh hoặc hình ảnh đã được ghi trên đĩa CD, v.v."
                },
                "examples": [
                    {
                        "en": "a DVD/CD player",
                        "vi": "đầu đĩa DVD / CD"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who plays a musical instrument",
                    "vi": "một người chơi nhạc cụ"
                },
                "examples": [
                    {
                        "en": "a trumpet/bass player",
                        "vi": "một người chơi kèn / bass"
                    }
                ]
            },
            {
                "define": {
                    "en": "an actor",
                    "vi": "một diễn viên"
                },
                "examples": [
                    {
                        "en": "Phoenix Players present ‘Romeo and Juliet’.",
                        "vi": "Người chơi Phoenix trình bày 'Romeo và Juliet'."
                    }
                ]
            }
        ]
    },
    {
        "id": "806587af9f12418db911471b3d18fb6a",
        "word": "rule",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ruːl/",
            "us": "/ruːl/"
        },
        "nearby": [
            {
                "word": "ruinously",
                "pos": "adverb"
            },
            {
                "word": "Rule, Britannia!",
                "pos": ""
            },
            {
                "word": "rule",
                "pos": "noun"
            },
            {
                "word": "rule",
                "pos": "verb"
            },
            {
                "word": "rule book",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a statement of what may, must or must not be done in a particular situation or when playing a game",
                    "vi": "một tuyên bố về những gì có thể, phải hoặc không được thực hiện trong một tình huống cụ thể hoặc khi chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "She laid down strict rules for her tenants, including prompt payment of rent.",
                        "vi": "Cô đặt ra các quy tắc nghiêm ngặt cho những người thuê nhà của mình, bao gồm cả việc thanh toán tiền thuê nhanh chóng."
                    },
                    {
                        "en": "the rules of golf/tennis/football",
                        "vi": "luật chơi gôn / quần vợt / bóng đá"
                    },
                    {
                        "en": "to follow/obey a rule",
                        "vi": "tuân theo / tuân theo một quy tắc"
                    },
                    {
                        "en": "to break/violate a rule",
                        "vi": "phá vỡ / vi phạm một quy tắc"
                    },
                    {
                        "en": "to enforce/apply a rule",
                        "vi": "để thực thi / áp dụng một quy tắc"
                    },
                    {
                        "en": "You can't just change the rules to suit yourself.",
                        "vi": "Bạn không thể chỉ thay đổi các quy tắc để phù hợp với bản thân."
                    },
                    {
                        "en": "against the rules It's against all the rules and regulations.",
                        "vi": "chống lại các quy tắc Nó chống lại tất cả các quy tắc và quy định."
                    },
                    {
                        "en": "under… rules These products are banned under international rules.",
                        "vi": "theo… quy tắc Các sản phẩm này bị cấm theo các quy tắc quốc tế."
                    },
                    {
                        "en": "This explains the rules under which the library operates.",
                        "vi": "Điều này giải thích các quy tắc mà thư viện hoạt động."
                    },
                    {
                        "en": "the unwritten rules of adult society (= that everyone understands)",
                        "vi": "các quy tắc bất thành văn của xã hội người lớn (= mà mọi người đều hiểu)"
                    },
                    {
                        "en": "the rules of procedure/conduct (= saying how something must be done)",
                        "vi": "các quy tắc của thủ tục / hành vi (= nói một cái gì đó phải được thực hiện như thế nào)"
                    },
                    {
                        "en": "New rules governing pensions come into effect next year.",
                        "vi": "Các quy định mới về lương hưu sẽ có hiệu lực vào năm tới."
                    },
                    {
                        "en": "Normal competition rules apply.",
                        "vi": "Các quy tắc cạnh tranh bình thường được áp dụng."
                    },
                    {
                        "en": "according to the rules (of something) According to the rules of the game, you have to miss a turn.",
                        "vi": "Theo các quy tắc (của cái gì đó) Theo các quy tắc của trò chơi, bạn phải bỏ lỡ một lượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of what is possible according to a particular system, for example the grammar of a language",
                    "vi": "một tuyên bố về những gì có thể xảy ra theo một hệ thống cụ thể, ví dụ như ngữ pháp của một ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "the basic rules of grammar",
                        "vi": "các quy tắc cơ bản của ngữ pháp"
                    },
                    {
                        "en": "rule for doing something What is the rule for forming plurals?",
                        "vi": "Quy tắc để làm một cái gì đó Quy tắc để tạo thành số nhiều là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of what you are advised to do in a particular situation",
                    "vi": "một tuyên bố về những gì bạn được khuyên nên làm trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "The first rule is to make eye contact with your interviewer.",
                        "vi": "Quy tắc đầu tiên là giao tiếp bằng mắt với người phỏng vấn của bạn."
                    },
                    {
                        "en": "Follow these few simple rules and you won't go far wrong.",
                        "vi": "Hãy làm theo một số quy tắc đơn giản sau và bạn sẽ không mắc sai lầm."
                    },
                    {
                        "en": "rule for doing something There are no hard and fast rules for planning healthy meals.",
                        "vi": "Quy tắc để làm một việc gì đó Không có quy tắc cứng và nhanh nào để lên kế hoạch cho các bữa ăn lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a habit; the normal state of things; what is true in most cases",
                    "vi": "một thói quen; trạng thái bình thường của sự vật; điều gì là đúng trong hầu hết các trường hợp"
                },
                "examples": [
                    {
                        "en": "He makes it a rule never to borrow money.",
                        "vi": "Anh ấy đưa ra quy tắc không bao giờ được vay tiền."
                    },
                    {
                        "en": "Cold winters here are the exception rather than the rule (= are rare).",
                        "vi": "Mùa đông lạnh giá ở đây là ngoại lệ chứ không phải là quy luật (= rất hiếm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the government of a country or control of a group of people by a particular person, group or system",
                    "vi": "chính phủ của một quốc gia hoặc sự kiểm soát của một nhóm người bởi một người, một nhóm hoặc một hệ thống cụ thể"
                },
                "examples": [
                    {
                        "en": "military/civilian/democratic rule",
                        "vi": "quy tắc quân sự / dân sự / dân chủ"
                    },
                    {
                        "en": "The 1972 Act imposed direct rule from Westminster.",
                        "vi": "Đạo luật năm 1972 áp đặt quyền cai trị trực tiếp từ Westminster."
                    },
                    {
                        "en": "under… rule The country was still under colonial rule.",
                        "vi": "dưới sự… cai trị Đất nước vẫn còn bị thuộc địa."
                    },
                    {
                        "en": "majority rule (= government by the political party that most people have voted for)",
                        "vi": "quy tắc đa số (= chính phủ của đảng chính trị mà hầu hết mọi người đã bỏ phiếu)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a measuring instrument with a straight edge",
                    "vi": "một dụng cụ đo có cạnh thẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "usually but not always",
                    "vi": "thường nhưng không phải luôn luôn"
                },
                "examples": [
                    {
                        "en": "I go to bed early as a rule.",
                        "vi": "Tôi đi ngủ sớm như một quy luật."
                    },
                    {
                        "en": "As a general rule, vegetable oils are better for you than animal fats.",
                        "vi": "Theo nguyên tắc chung, dầu thực vật tốt cho bạn hơn mỡ động vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the rules to suit a particular person or situation",
                    "vi": "để thay đổi các quy tắc cho phù hợp với một người hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Couldn't they just bend the rules and let us in without a ticket?",
                        "vi": "Không lẽ họ chỉ bẻ cong các quy tắc và cho chúng tôi vào mà không có vé sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "people say that something is the exception that proves the rule when they are stating something that seems to be different from the normal situation, but they mean that the normal situation remains true in general",
                    "vi": "mọi người nói rằng một cái gì đó là ngoại lệ chứng tỏ quy tắc khi họ nói một cái gì đó có vẻ khác với tình huống bình thường, nhưng chúng có nghĩa là tình huống bình thường nói chung vẫn đúng."
                },
                "examples": [
                    {
                        "en": "Most electronics companies have not done well this year, but ours is the exception that proves the rule.",
                        "vi": "Hầu hết các công ty điện tử đều không đạt kết quả tốt trong năm nay, nhưng của chúng tôi là ngoại lệ chứng minh quy luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody plays by their own rules or makes other people play by their rules, they set the conditions for doing business or having a relationship",
                    "vi": "nếu ai đó chơi theo luật của riêng họ hoặc bắt người khác chơi theo luật của họ, họ đặt ra các điều kiện để kinh doanh hoặc có mối quan hệ"
                },
                "examples": [
                    {
                        "en": "If he wanted a loan he would have to play by the bank's rules.",
                        "vi": "Nếu anh ta muốn có một khoản vay, anh ta sẽ phải chơi theo luật của ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal fairly and honestly with people",
                    "vi": "đối xử công bằng và trung thực với mọi người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a practical method of doing or measuring something, usually based on past experience rather than on exact measurement",
                    "vi": "một phương pháp thực tế để thực hiện hoặc đo lường điều gì đó, thường dựa trên kinh nghiệm trong quá khứ hơn là dựa trên phép đo chính xác"
                },
                "examples": [
                    {
                        "en": "As a rule of thumb, you should cook a chicken for 20 minutes for each pound of weight.",
                        "vi": "Theo nguyên tắc chung, bạn nên nấu một con gà trong 20 phút cho mỗi pound trọng lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the standards of behaviour that most people accept or that actually operate in a particular area of life or business",
                    "vi": "các tiêu chuẩn hành vi mà hầu hết mọi người chấp nhận hoặc thực sự hoạt động trong một lĩnh vực cụ thể của cuộc sống hoặc kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to follow the rules of your job in a very strict way in order to cause delay, as a form of protest against your employer or your working conditions",
                    "vi": "tuân theo các quy tắc công việc của bạn một cách rất nghiêm ngặt để gây ra sự chậm trễ, như một hình thức phản đối chủ lao động hoặc điều kiện làm việc của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5c7d4f0a593141019ab8bfb3318de93f",
        "word": "team",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/tiːm/",
            "us": "/tiːm/"
        },
        "nearby": [
            {
                "word": "tea leaf",
                "pos": "noun"
            },
            {
                "word": "tealight",
                "pos": "noun"
            },
            {
                "word": "team",
                "pos": "noun"
            },
            {
                "word": "team",
                "pos": "verb"
            },
            {
                "word": "team building",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who play a particular game or sport against another group of people",
                    "vi": "một nhóm người chơi một trò chơi hoặc môn thể thao cụ thể với một nhóm người khác"
                },
                "examples": [
                    {
                        "en": "a football/basketball/soccer team",
                        "vi": "một đội bóng đá / bóng rổ / bóng đá"
                    },
                    {
                        "en": "They play volleyball for the national team.",
                        "vi": "Họ chơi bóng chuyền cho đội tuyển quốc gia."
                    },
                    {
                        "en": "We played against a team from the neighbouring school.",
                        "vi": "Chúng tôi đã đấu với một đội từ trường lân cận."
                    },
                    {
                        "en": "(British English) Whose team are you in?",
                        "vi": "(Anh Anh) Bạn đang ở trong đội của ai?"
                    },
                    {
                        "en": "(North American English) Whose team are you on?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn thuộc đội của ai?"
                    },
                    {
                        "en": "The team is/are not playing very well this season.",
                        "vi": "Đội đang / đang chơi không tốt trong mùa giải này."
                    },
                    {
                        "en": "a team event (= one played by groups of people rather than individual players)",
                        "vi": "sự kiện đồng đội (= sự kiện được chơi bởi nhiều nhóm người chứ không phải người chơi cá nhân)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who work together at a particular job",
                    "vi": "một nhóm người làm việc cùng nhau trong một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "a team member/leader",
                        "vi": "một thành viên / trưởng nhóm"
                    },
                    {
                        "en": "a member of the senior management team",
                        "vi": "một thành viên của nhóm quản lý cấp cao"
                    },
                    {
                        "en": "She leads a research team of twenty scientists.",
                        "vi": "Cô dẫn đầu một nhóm nghiên cứu gồm 20 nhà khoa học."
                    },
                    {
                        "en": "He joined the legal team five years ago.",
                        "vi": "Anh ấy đã gia nhập đội pháp lý cách đây 5 năm."
                    },
                    {
                        "en": "team of somebody A team of experts has/have been called in to investigate.",
                        "vi": "nhóm của ai đó Một nhóm chuyên gia đã / đã được gọi đến để điều tra."
                    },
                    {
                        "en": "He works with a team of researchers.",
                        "vi": "Anh ấy làm việc với một nhóm các nhà nghiên cứu."
                    },
                    {
                        "en": "She was part of the design team working on the project.",
                        "vi": "Cô ấy là một phần của nhóm thiết kế làm việc trong dự án."
                    },
                    {
                        "en": "as a team We're learning to work together as a team.",
                        "vi": "như một nhóm Chúng tôi đang học cách làm việc cùng nhau như một nhóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "two or more animals that are used together to pull a cart, etc.",
                    "vi": "hai hoặc nhiều động vật được sử dụng cùng nhau để kéo xe, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give up something that is important to you or to do something that is unpleasant in order to benefit your friends or colleagues",
                    "vi": "từ bỏ điều gì đó quan trọng đối với bạn hoặc làm điều gì đó khó chịu để mang lại lợi ích cho bạn bè hoặc đồng nghiệp của bạn"
                },
                "examples": [
                    {
                        "en": "Sometimes you have to take one for the team.",
                        "vi": "Đôi khi bạn phải lấy một cái cho cả đội."
                    },
                    {
                        "en": "I know it sounds unfair, but we need you to take one for the team.",
                        "vi": "Tôi biết điều đó nghe có vẻ không công bằng, nhưng chúng tôi cần bạn lấy một quả cho đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "63b27c1ee53a47dabdd4e15142d50f0b",
        "word": "win",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/wɪn/",
            "us": "/wɪn/"
        },
        "nearby": [
            {
                "word": "wimp out",
                "pos": "phrasal verb"
            },
            {
                "word": "Lord Peter Wimsey",
                "pos": ""
            },
            {
                "word": "win",
                "pos": "verb"
            },
            {
                "word": "win",
                "pos": "noun"
            },
            {
                "word": "win around",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be the most successful in a competition, race, battle, etc.",
                    "vi": "để thành công nhất trong một cuộc thi, cuộc đua, trận chiến, v.v."
                },
                "examples": [
                    {
                        "en": "Which team won?",
                        "vi": "Đội nào chiến thắng?"
                    },
                    {
                        "en": "win something to win an election",
                        "vi": "giành được một cái gì đó để giành chiến thắng trong một cuộc bầu cử"
                    },
                    {
                        "en": "to win a game/race/war/battle",
                        "vi": "để giành chiến thắng trong một trò chơi / cuộc đua / chiến tranh / trận chiến"
                    },
                    {
                        "en": "She loves to win an argument.",
                        "vi": "Cô ấy thích chiến thắng trong một cuộc tranh cãi."
                    },
                    {
                        "en": "win at something to win at cards/chess",
                        "vi": "chiến thắng ở một thứ gì đó để giành chiến thắng ở bài / cờ vua"
                    },
                    {
                        "en": "win (by something) (against somebody/something) France won by six goals to two against Denmark.",
                        "vi": "thắng (bằng cách nào đó) (chống lại ai đó / cái gì đó) Pháp đã thắng với cách biệt sáu bàn đến hai bàn trước Đan Mạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get something as the result of a competition, race, election, etc.",
                    "vi": "để có được thứ gì đó do kết quả của một cuộc cạnh tranh, chạy đua, bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "win something Britain won five gold medals.",
                        "vi": "giành được một cái gì đó Anh đã giành được năm huy chương vàng."
                    },
                    {
                        "en": "He won £3 000 in the lottery.",
                        "vi": "Anh ta đã trúng số £ 3 000 trong cuộc xổ số."
                    },
                    {
                        "en": "How many states did the Republicans win?",
                        "vi": "Đảng Cộng hòa đã giành được bao nhiêu bang?"
                    },
                    {
                        "en": "Everyone who takes part wins a small prize.",
                        "vi": "Tất cả những người tham gia sẽ giành được một giải thưởng nhỏ."
                    },
                    {
                        "en": "to win an award/a title",
                        "vi": "để giành được một giải thưởng / một danh hiệu"
                    },
                    {
                        "en": "win something from somebody The Conservatives won the seat from Labour in the last election.",
                        "vi": "giành được thứ gì đó từ ai đó Đảng Bảo thủ đã giành được ghế từ Lao động trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "win yourself/somebody something You've won yourself a trip to New York.",
                        "vi": "giành được cho mình / ai đó điều gì đó Bạn đã giành được cho mình một chuyến đi đến New York."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve or get something that you want, especially by your own efforts",
                    "vi": "để đạt được hoặc đạt được điều gì đó mà bạn muốn, đặc biệt là bằng nỗ lực của chính bạn"
                },
                "examples": [
                    {
                        "en": "They are trying to win support for their proposals.",
                        "vi": "Họ đang cố gắng giành được sự ủng hộ cho các đề xuất của họ."
                    },
                    {
                        "en": "The company has won a contract to supply books and materials to schools.",
                        "vi": "Công ty đã giành được hợp đồng cung cấp sách và tài liệu cho các trường học."
                    },
                    {
                        "en": "She won the admiration of many people in her battle against cancer.",
                        "vi": "Cô đã giành được sự ngưỡng mộ của nhiều người trong cuộc chiến chống lại căn bệnh ung thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful against somebody/something",
                    "vi": "để thành công chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Despite strong opposition, the ruling party carried the day.",
                        "vi": "Bất chấp sự phản đối mạnh mẽ, đảng cầm quyền đã tiến hành ngày này."
                    },
                    {
                        "en": "Teamwork and persistence can still win the day.",
                        "vi": "Tinh thần đồng đội và sự bền bỉ vẫn có thể giành được chiến thắng trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win something very easily",
                    "vi": "để giành được một cái gì đó rất dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "whether you succeed or fail",
                    "vi": "cho dù bạn thành công hay thất bại"
                },
                "examples": [
                    {
                        "en": "Win or lose, we'll know we've done our best.",
                        "vi": "Dù thắng hay thua, chúng tôi sẽ biết mình đã cố gắng hết sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become famous or successful",
                    "vi": "trở nên nổi tiếng hoặc thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express sympathy for somebody who has been disappointed about something",
                    "vi": "được sử dụng để bày tỏ sự cảm thông cho ai đó đã thất vọng về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that there is no acceptable way of dealing with a particular situation",
                    "vi": "được sử dụng để nói rằng không có cách nào có thể chấp nhận được để đối phó với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "I can’t win. If I agree with her, she says I have no mind of my own; if I don’t, she says I’m being difficult.",
                        "vi": "Tôi không thể thắng. Nếu tôi đồng ý với cô ấy, cô ấy nói rằng tôi không có tâm trí của riêng mình; nếu tôi không làm vậy, cô ấy nói rằng tôi đang gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree to what somebody wants after you have failed to persuade them to do or let you do something else",
                    "vi": "đã từng đồng ý với những gì ai đó muốn sau khi bạn không thuyết phục được họ làm hoặc để bạn làm việc khác"
                },
                "examples": [
                    {
                        "en": "OK, you win. I'll admit I was wrong.",
                        "vi": "Được rồi bạn thắng. Tôi sẽ thừa nhận là tôi đã sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "ef950aeee0f34f399ca2f060f96e1955",
        "word": "score",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/skɔː(r)/",
            "us": "/skɔːr/"
        },
        "nearby": [
            {
                "word": "scorching",
                "pos": "adjective"
            },
            {
                "word": "scorch mark",
                "pos": "noun"
            },
            {
                "word": "score",
                "pos": "verb"
            },
            {
                "word": "score",
                "pos": "noun"
            },
            {
                "word": "scoreboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to win points, goals, etc. in a game or competition",
                    "vi": "để giành điểm, mục tiêu, v.v. trong trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "Fraser scored again in the second half.",
                        "vi": "Fraser lại ghi bàn trong hiệp hai."
                    },
                    {
                        "en": "score something to score a goal/try/touchdown/victory/point/run",
                        "vi": "ghi một cái gì đó để ghi một bàn thắng / cố gắng / chạm xuống / chiến thắng / điểm / chạy"
                    },
                    {
                        "en": "Brazil failed to score a win, leaving their further progress in the competition in doubt.",
                        "vi": "Brazil không thể ghi được một chiến thắng, khiến họ bị nghi ngờ về sự tiến bộ hơn nữa trong cuộc thi."
                    },
                    {
                        "en": "the only man to score a hat-trick in a World Cup final",
                        "vi": "người duy nhất lập hat-trick trong trận chung kết World Cup"
                    },
                    {
                        "en": "On his debut at Old Trafford he scored 154 against Australia.",
                        "vi": "Trong trận ra mắt tại Old Trafford, anh đã ghi được 154 bàn vào lưới Australia."
                    },
                    {
                        "en": "He scored 20 points in 36 minutes.",
                        "vi": "Anh ấy ghi được 20 điểm trong 36 phút."
                    },
                    {
                        "en": "He scored 30 goals in 20 games.",
                        "vi": "Anh ấy ghi 30 bàn sau 20 trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep a record of the points, goals, etc. won in a game or competition",
                    "vi": "để ghi lại số điểm, bàn thắng, v.v. đã giành được trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "Who's going to score?",
                        "vi": "Ai sẽ ghi bàn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to gain marks in a test or an exam",
                    "vi": "để đạt được điểm trong một bài kiểm tra hoặc một kỳ thi"
                },
                "examples": [
                    {
                        "en": "score something She scored 98 per cent in the French test.",
                        "vi": "đạt điểm nào đó Cô ấy đã đạt 98% trong bài kiểm tra tiếng Pháp."
                    },
                    {
                        "en": "+ adv./prep. Girls usually score highly in language exams.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Women consistently scored higher than men in this test.",
                        "vi": "Phụ nữ luôn đạt điểm cao hơn nam giới trong bài kiểm tra này."
                    },
                    {
                        "en": "Some studies show that low-income Latino adolescents tend to score low on self-esteem.",
                        "vi": "Một số nghiên cứu cho thấy thanh thiếu niên gốc Latinh có thu nhập thấp có xu hướng đánh giá thấp về lòng tự trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give something/somebody a particular number of points",
                    "vi": "để cung cấp cho một cái gì đó / ai đó một số điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "The tests are scored by psychologists.",
                        "vi": "Các bài kiểm tra được chấm bởi các nhà tâm lý học."
                    },
                    {
                        "en": "Score each criterion on a scale of 1 to 5.",
                        "vi": "Cho điểm từng tiêu chí theo thang điểm từ 1 đến 5."
                    },
                    {
                        "en": "a scoring system",
                        "vi": "một hệ thống tính điểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be worth a particular number of points",
                    "vi": "có giá trị bằng một số điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "Each correct answer will score two points.",
                        "vi": "Mỗi câu trả lời đúng sẽ được hai điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed; to have an advantage",
                    "vi": "để thành công; có lợi thế"
                },
                "examples": [
                    {
                        "en": "score (something) The army continued to score successes in the south.",
                        "vi": "ghi điểm (cái gì đó) Quân đội tiếp tục ghi bàn thành công ở phía nam."
                    },
                    {
                        "en": "Lewis scored a win with a hugely funny sketch about a car salesman.",
                        "vi": "Lewis đã giành chiến thắng với một bức ký họa cực kỳ hài hước về một nhân viên bán xe hơi."
                    },
                    {
                        "en": "She's scored again with her latest blockbuster.",
                        "vi": "Cô ấy lại ghi điểm với bộ phim bom tấn mới nhất của mình."
                    },
                    {
                        "en": "score over something Bicycles score over other forms of transport in towns.",
                        "vi": "đạt điểm nào đó Xe đạp đạt điểm hơn các hình thức giao thông khác trong thị trấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange a piece of music for one or more musical instruments or for voices",
                    "vi": "để sắp xếp một bản nhạc cho một hoặc nhiều nhạc cụ hoặc cho giọng nói"
                },
                "examples": [
                    {
                        "en": "be scored for something The piece is scored for violin, viola and cello.",
                        "vi": "được tính điểm cho một cái gì đó Bản nhạc được chấm điểm cho violin, viola và cello."
                    },
                    {
                        "en": "score something The director invited him to score the movie (= write the music for it).",
                        "vi": "ghi điểm gì đó Đạo diễn mời anh ta chấm điểm phim (= viết nhạc cho phim)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a cut or mark on a surface",
                    "vi": "để cắt hoặc đánh dấu trên bề mặt"
                },
                "examples": [
                    {
                        "en": "Score the card first with a knife.",
                        "vi": "Điểm thẻ đầu tiên bằng một con dao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have sex with a new partner",
                    "vi": "quan hệ tình dục với một đối tác mới"
                },
                "examples": [
                    {
                        "en": "Did you score last night?",
                        "vi": "Bạn đã ghi bàn vào đêm qua?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to buy or get illegal drugs",
                    "vi": "mua hoặc nhận ma túy bất hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show that you are better than somebody, especially by making clever remarks, for example in an argument",
                    "vi": "để chứng tỏ rằng bạn giỏi hơn ai đó, đặc biệt là bằng cách đưa ra những nhận xét thông minh, chẳng hạn như trong một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "He was always trying to score points off his teachers.",
                        "vi": "Anh ấy luôn cố gắng ghi điểm với các thầy cô của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "02acf2e40a1543d4a5cf45ef77c3f7c3",
        "word": "score",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/skɔː(r)/",
            "us": "/skɔːr/"
        },
        "nearby": [
            {
                "word": "scorch mark",
                "pos": "noun"
            },
            {
                "word": "score",
                "pos": "verb"
            },
            {
                "word": "score",
                "pos": "noun"
            },
            {
                "word": "scoreboard",
                "pos": "noun"
            },
            {
                "word": "scorecard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number of points, goals, etc. scored by each player or team in a game or competition",
                    "vi": "số điểm, số bàn thắng, v.v. được ghi bởi mỗi cầu thủ hoặc đội trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "a high/low score",
                        "vi": "điểm cao / thấp"
                    },
                    {
                        "en": "What's the score now?",
                        "vi": "Điểm số bây giờ là bao nhiêu?"
                    },
                    {
                        "en": "The final score was 4–3.",
                        "vi": "Tỷ số cuối cùng là 4–3."
                    },
                    {
                        "en": "I’ll keep (the) score.",
                        "vi": "Tôi sẽ giữ (điểm)."
                    },
                    {
                        "en": "A penalty in the last minute of the game levelled the score 2–2.",
                        "vi": "Một quả phạt đền ở phút cuối cùng của trận đấu đã san bằng tỷ số 2–2."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of points somebody gets for correct answers in a test",
                    "vi": "số điểm ai đó nhận được cho các câu trả lời đúng trong một bài kiểm tra"
                },
                "examples": [
                    {
                        "en": "test scores",
                        "vi": "điểm kiểm tra"
                    },
                    {
                        "en": "an IQ score of 120",
                        "vi": "điểm IQ là 120"
                    },
                    {
                        "en": "a perfect score",
                        "vi": "một điểm hoàn hảo"
                    },
                    {
                        "en": "to get a high/low score",
                        "vi": "để đạt điểm cao / thấp"
                    },
                    {
                        "en": "This year, Jimmy's maths scores are slipping.",
                        "vi": "Năm nay, điểm môn toán của Jimmy đang tụt dốc."
                    },
                    {
                        "en": "The mean scores are as shown in Table 1.",
                        "vi": "Điểm trung bình được thể hiện trong Bảng 1."
                    },
                    {
                        "en": "Other factors did not significantly impact children's scores on these tests.",
                        "vi": "Các yếu tố khác không ảnh hưởng đáng kể đến điểm số của trẻ em trong các bài kiểm tra này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or printed version of a piece of music showing what each instrument is to play or what each voice is to sing",
                    "vi": "bản viết hoặc bản in của một bản nhạc cho biết mỗi loại nhạc cụ sẽ chơi hoặc giọng hát của mỗi người"
                },
                "examples": [
                    {
                        "en": "an orchestral score",
                        "vi": "một điểm số của dàn nhạc"
                    },
                    {
                        "en": "the score of Verdi’s ‘Requiem’",
                        "vi": "điểm số của Verdi's 'Requiem'"
                    }
                ]
            },
            {
                "define": {
                    "en": "the music written for a film or play",
                    "vi": "âm nhạc được viết cho một bộ phim hoặc vở kịch"
                },
                "examples": [
                    {
                        "en": "an award for best original score",
                        "vi": "một giải thưởng cho điểm gốc tốt nhất"
                    },
                    {
                        "en": "The musical score is magnificent and the performances are outstanding.",
                        "vi": "Điểm âm nhạc là tuyệt vời và các màn trình diễn xuất sắc."
                    },
                    {
                        "en": "The score for the movie was composed by John Williams.",
                        "vi": "Phần nhạc cho phim do John Williams sáng tác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set or group of 20 or approximately 20",
                    "vi": "một tập hợp hoặc một nhóm 20 hoặc khoảng 20"
                },
                "examples": [
                    {
                        "en": "Several cabs and a score of cars were parked outside.",
                        "vi": "Một số xe taxi và một số ô tô đã đậu bên ngoài."
                    },
                    {
                        "en": "by the score Doyle's success brought imitators by the score (= very many imitators).",
                        "vi": "bởi điểm số Thành công của Doyle mang lại cho những kẻ bắt chước bằng điểm số (= rất nhiều người bắt chước)."
                    },
                    {
                        "en": "the biblical age of three score years and ten (= 70)",
                        "vi": "độ tuổi trong Kinh thánh là ba điểm năm và mười (= 70)"
                    }
                ]
            },
            {
                "define": {
                    "en": "very many",
                    "vi": "rất nhiều"
                },
                "examples": [
                    {
                        "en": "There were scores of boxes and crates, all waiting to be checked and loaded.",
                        "vi": "Có rất nhiều hộp và thùng, tất cả đang chờ được kiểm tra và tải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a cut in a surface, made with a sharp tool",
                    "vi": "một vết cắt trên bề mặt, được thực hiện bằng một công cụ sắc bén"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the real facts about the present situation",
                    "vi": "sự thật thực tế về tình hình hiện tại"
                },
                "examples": [
                    {
                        "en": "What's the score?",
                        "vi": "Điểm số thế nào?"
                    },
                    {
                        "en": "You don't have to lie to me. I know the score.",
                        "vi": "Bạn không cần phải nói dối tôi. Tôi biết số điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to harm or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm hại hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "about that/this matter",
                    "vi": "về điều đó / vấn đề này"
                },
                "examples": [
                    {
                        "en": "You don't have to worry on that score.",
                        "vi": "Bạn không phải lo lắng về điểm số đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurt or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm tổn thương hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": [
                    {
                        "en": "‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’",
                        "vi": "Ai sẽ làm một điều như vậy?' 'Có lẽ ai đó có số điểm cũ để giải quyết.'"
                    },
                    {
                        "en": "An embittered Charlotte is determined to settle accounts with Elizabeth.",
                        "vi": "Charlotte chán nản quyết tâm thanh toán các khoản với Elizabeth."
                    }
                ]
            }
        ]
    },
    {
        "id": "f29279dabf4947aeada33aaa9d0fe6df",
        "word": "winner",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈwɪnə(r)/",
            "us": "/ˈwɪnər/"
        },
        "nearby": [
            {
                "word": "winkle-picker",
                "pos": "noun"
            },
            {
                "word": "Winnebago",
                "pos": "noun"
            },
            {
                "word": "winner",
                "pos": "noun"
            },
            {
                "word": "Winnie",
                "pos": ""
            },
            {
                "word": "Winnie-the-Pooh",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, a team, an animal, etc. that wins something",
                    "vi": "một người, một đội, một con vật, v.v. giành được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The lucky winner gets an all-expenses-paid trip to Sydney.",
                        "vi": "Người chiến thắng may mắn nhận được một chuyến đi đến Sydney được thanh toán toàn bộ chi phí."
                    },
                    {
                        "en": "an award winner",
                        "vi": "một người chiến thắng giải thưởng"
                    },
                    {
                        "en": "a medal/prize winner",
                        "vi": "một người chiến thắng huy chương / giải thưởng"
                    },
                    {
                        "en": "a raffle/jackpot winner",
                        "vi": "một người chiến thắng xổ số / giải độc đắc"
                    },
                    {
                        "en": "the winner of a prize/an award",
                        "vi": "người chiến thắng một giải thưởng / một giải thưởng"
                    },
                    {
                        "en": "The winners of the competition will be announced next month.",
                        "vi": "Những người chiến thắng của cuộc thi sẽ được công bố vào tháng sau."
                    },
                    {
                        "en": "There are no winners in a divorce (= everyone suffers).",
                        "vi": "Không có người chiến thắng trong một cuộc ly hôn (= tất cả mọi người đều đau khổ)."
                    },
                    {
                        "en": "They were decisively beaten by the eventual winners, Spain.",
                        "vi": "Họ đã bị đánh bại một cách dứt khoát trước người chiến thắng cuối cùng, Tây Ban Nha."
                    },
                    {
                        "en": "A panel of celebrity judges will pick the winners.",
                        "vi": "Một hội đồng giám khảo của những người nổi tiếng sẽ chọn ra những người chiến thắng."
                    },
                    {
                        "en": "Several factors make the difference between winners and losers.",
                        "vi": "Một số yếu tố tạo nên sự khác biệt giữa người chiến thắng và kẻ thất bại."
                    },
                    {
                        "en": "the 2018 World Cup winners",
                        "vi": "những người vô địch World Cup 2018"
                    },
                    {
                        "en": "Johnson rode his 48th winner of the year.",
                        "vi": "Johnson đã giành chiến thắng thứ 48 trong năm."
                    },
                    {
                        "en": "Labour was the clear winner in Scotland.",
                        "vi": "Lao động là người chiến thắng rõ ràng ở Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or person that is successful or likely to be successful",
                    "vi": "một điều hoặc một người thành công hoặc có khả năng thành công"
                },
                "examples": [
                    {
                        "en": "I think your idea is a winner.",
                        "vi": "Tôi nghĩ rằng ý tưởng của bạn là một người chiến thắng."
                    },
                    {
                        "en": "onto a winner The design is very good. We could be onto a winner (= we may do or produce something successful).",
                        "vi": "thiết kế rất tốt. We could be on a winner (= chúng tôi có thể làm hoặc tạo ra một cái gì đó thành công)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a goal or point that causes a team or a person to win a game",
                    "vi": "một mục tiêu hoặc điểm khiến một đội hoặc một người giành chiến thắng trong trò chơi"
                },
                "examples": [
                    {
                        "en": "Morgan scored the winner after 20 minutes.",
                        "vi": "Morgan ghi bàn quyết định sau 20 phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a horse, etc. that you think is most likely to win a race",
                    "vi": "để chọn một con ngựa, v.v. mà bạn cho rằng có nhiều khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "He's very good at picking winners.",
                        "vi": "Anh ấy rất giỏi trong việc chọn người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a very good choice",
                    "vi": "để đưa ra một lựa chọn rất tốt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4fb936312441431ba9745f1a3560d08b",
        "word": "cheat",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃiːt/",
            "us": "/tʃiːt/"
        },
        "nearby": [
            {
                "word": "cheapo",
                "pos": "adjective"
            },
            {
                "word": "cheapskate",
                "pos": "noun"
            },
            {
                "word": "cheat",
                "pos": "verb"
            },
            {
                "word": "cheat",
                "pos": "noun"
            },
            {
                "word": "cheater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to trick somebody or make them believe something that is not true",
                    "vi": "lừa ai đó hoặc khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "cheat somebody/something She is accused of attempting to cheat the taxman.",
                        "vi": "lừa ai đó / cái gì đó Cô ấy bị buộc tội cố gắng lừa người đánh thuế."
                    },
                    {
                        "en": "We will crack down on people who try to cheat the system.",
                        "vi": "Chúng tôi sẽ truy quét những người cố gắng gian lận hệ thống."
                    },
                    {
                        "en": "Many people feel cheated by the election process.",
                        "vi": "Nhiều người cảm thấy bị lừa bởi quá trình bầu cử."
                    },
                    {
                        "en": "cheat somebody out of something He cheated investors out of billions of dollars.",
                        "vi": "lừa ai đó ra khỏi cái gì đó Anh ta đã lừa các nhà đầu tư hàng tỷ đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in a dishonest way in order to gain an advantage, especially in a game, a competition, an exam, etc.",
                    "vi": "hành động không trung thực để đạt được lợi thế, đặc biệt là trong một trò chơi, một cuộc thi, một kỳ thi, v.v."
                },
                "examples": [
                    {
                        "en": "He cheats at cards.",
                        "vi": "Anh ta gian lận trong bài."
                    },
                    {
                        "en": "(British English) Have you ever cheated in an exam?",
                        "vi": "(Anh Anh) Bạn đã bao giờ gian lận trong kỳ thi chưa?"
                    },
                    {
                        "en": "(North American English) Have you ever cheated on an exam?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn đã bao giờ gian lận trong kỳ thi chưa?"
                    },
                    {
                        "en": "You're not allowed to look at the answers—that's cheating.",
                        "vi": "Bạn không được phép xem các câu trả lời — đó là gian lận."
                    },
                    {
                        "en": "Anyone caught cheating will be automatically disqualified from the examination.",
                        "vi": "Bất kỳ ai bị phát hiện gian lận sẽ tự động bị loại khỏi cuộc kiểm tra."
                    },
                    {
                        "en": "Why would anyone want to lie or cheat?",
                        "vi": "Tại sao mọi người lại muốn nói dối hoặc lừa dối?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a secret sexual relationship with somebody else",
                    "vi": "có một mối quan hệ tình dục bí mật với người khác"
                },
                "examples": [
                    {
                        "en": "He’s cheating on his wife.",
                        "vi": "Anh ta đang lừa dối vợ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to survive in a situation where you could have died",
                    "vi": "để tồn tại trong một tình huống mà bạn có thể đã chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "195cf761f68848eb81b7927df2c99e33",
        "word": "cheat",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃiːt/",
            "us": "/tʃiːt/"
        },
        "nearby": [
            {
                "word": "cheapskate",
                "pos": "noun"
            },
            {
                "word": "cheat",
                "pos": "verb"
            },
            {
                "word": "cheat",
                "pos": "noun"
            },
            {
                "word": "cheater",
                "pos": "noun"
            },
            {
                "word": "cheat of",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who cheats, especially in a game",
                    "vi": "một người gian lận, đặc biệt là trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "You little cheat!",
                        "vi": "Đồ ăn gian nhỏ!"
                    },
                    {
                        "en": "Are you accusing me of being a cheat?",
                        "vi": "Bạn đang buộc tội tôi là một kẻ lừa đảo?"
                    },
                    {
                        "en": "a plan to crack down on tax cheats",
                        "vi": "kế hoạch trấn áp gian lận thuế"
                    },
                    {
                        "en": "benefit/welfare cheats",
                        "vi": "gian lận phúc lợi / phúc lợi"
                    },
                    {
                        "en": "attempts to eliminate drug cheats from the sport",
                        "vi": "cố gắng loại bỏ gian lận ma túy khỏi môn thể thao"
                    },
                    {
                        "en": "I've been a liar and a cheat.",
                        "vi": "Tôi đã từng là một kẻ dối trá và lừa bịp."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that seems unfair or dishonest, for example a way of doing something with less effort than it usually needs",
                    "vi": "điều gì đó có vẻ không công bằng hoặc không trung thực, ví dụ như một cách làm điều gì đó với ít nỗ lực hơn mức thường cần"
                },
                "examples": [
                    {
                        "en": "It's really a cheat, but you can use ready-made pastry if you want.",
                        "vi": "Nó thực sự là một trò gian lận, nhưng bạn có thể sử dụng bánh ngọt làm sẵn nếu bạn muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a program you can use to move immediately to the next stage of a computer game without needing to play the game",
                    "vi": "một chương trình bạn có thể sử dụng để chuyển ngay sang giai đoạn tiếp theo của trò chơi máy tính mà không cần chơi trò chơi đó"
                },
                "examples": [
                    {
                        "en": "There's a cheat you can use to get to the next level.",
                        "vi": "Có một trò gian lận bạn có thể sử dụng để lên cấp độ tiếp theo."
                    }
                ]
            }
        ]
    },
    {
        "id": "4488e2f5a09144978cc7970057795fc5",
        "word": "loser",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈluːzə(r)/",
            "us": "/ˈluːzər/"
        },
        "nearby": [
            {
                "word": "lose out",
                "pos": "phrasal verb"
            },
            {
                "word": "lose out to",
                "pos": "phrasal verb"
            },
            {
                "word": "loser",
                "pos": "noun"
            },
            {
                "word": "lose yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "loss",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is defeated in a competition",
                    "vi": "một người bị đánh bại trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "winners and losers",
                        "vi": "ngươi thăng va kẻ thua"
                    },
                    {
                        "en": "He’s a good/bad loser (= he accepts defeat well/badly).",
                        "vi": "Anh ấy là một kẻ thua cuộc tốt / xấu (= anh ấy chấp nhận thất bại tốt / xấu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is regularly unsuccessful, especially when you have a low opinion of them",
                    "vi": "một người thường xuyên không thành công, đặc biệt là khi bạn có đánh giá thấp về họ"
                },
                "examples": [
                    {
                        "en": "She's one of life's losers.",
                        "vi": "Cô ấy là một trong những kẻ thất bại trong cuộc sống."
                    },
                    {
                        "en": "He's a born loser.",
                        "vi": "Anh ấy là một kẻ thất bại bẩm sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who suffers because of a particular action, decision, etc.",
                    "vi": "một người đau khổ vì một hành động, quyết định cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "The real losers in all of this are the students.",
                        "vi": "Những người thực sự thất bại trong tất cả những điều này là học sinh."
                    },
                    {
                        "en": "If the teachers go on strike, the children are the ultimate losers.",
                        "vi": "Nếu giáo viên đình công, trẻ em là người thua cuộc cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "366630930e1648ff9712a523ebe3d501",
        "word": "play",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pleɪ/",
            "us": "/pleɪ/"
        },
        "nearby": [
            {
                "word": "plausibly",
                "pos": "adverb"
            },
            {
                "word": "play",
                "pos": "verb"
            },
            {
                "word": "play",
                "pos": "noun"
            },
            {
                "word": "playable",
                "pos": "adjective"
            },
            {
                "word": "play about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of writing performed by actors in a theatre or on television or radio",
                    "vi": "một đoạn văn do các diễn viên biểu diễn trong nhà hát hoặc trên truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "a stage/radio play",
                        "vi": "một vở kịch trên sân khấu / đài phát thanh"
                    },
                    {
                        "en": "She wrote a play for the students to perform.",
                        "vi": "Cô viết một vở kịch cho học sinh biểu diễn."
                    },
                    {
                        "en": "to put on/stage a play",
                        "vi": "để đưa / lên sân khấu một vở kịch"
                    },
                    {
                        "en": "to produce/direct a play",
                        "vi": "để sản xuất / đạo diễn một vở kịch"
                    },
                    {
                        "en": "play by somebody a play by Shakespeare",
                        "vi": "chơi bởi ai đó một vở kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "things that people, especially children, do for pleasure rather than as work",
                    "vi": "những việc mà mọi người, đặc biệt là trẻ em, làm vì niềm vui hơn là vì công việc"
                },
                "examples": [
                    {
                        "en": "the importance of learning through play",
                        "vi": "tầm quan trọng của việc học thông qua chơi"
                    },
                    {
                        "en": "Making time for both work and play is not easy.",
                        "vi": "Dành thời gian cho cả công việc và giải trí không phải là điều dễ dàng."
                    },
                    {
                        "en": "at play the happy sounds of children at play",
                        "vi": "khi chơi những âm thanh vui vẻ của trẻ em khi chơi"
                    },
                    {
                        "en": "The site offers sports facilities, including tennis courts, and a children's play area.",
                        "vi": "Trang web cung cấp các cơ sở thể thao, bao gồm sân tennis và khu vui chơi dành cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "the playing of a game",
                    "vi": "chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "Rain stopped play.",
                        "vi": "Mưa ngừng chơi."
                    },
                    {
                        "en": "There was some excellent play in yesterday's match.",
                        "vi": "Đã có một số màn chơi xuất sắc trong trận đấu ngày hôm qua."
                    },
                    {
                        "en": "The spectators were asked to be quiet during play.",
                        "vi": "Các khán giả được yêu cầu im lặng trong khi chơi."
                    },
                    {
                        "en": "This video game has fast and exciting game play.",
                        "vi": "Trò chơi điện tử này có tốc độ chơi trò chơi nhanh và thú vị."
                    },
                    {
                        "en": "Does online play have a negative effect on gaming?",
                        "vi": "Chơi trực tuyến có ảnh hưởng xấu đến chơi game không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an action or move in a game",
                    "vi": "một hành động hoặc di chuyển trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "He made several nice defensive plays.",
                        "vi": "Anh ấy đã thực hiện một số pha chơi phòng ngự đẹp mắt."
                    },
                    {
                        "en": "They are playing better now, making big plays at key times.",
                        "vi": "Họ đang chơi tốt hơn bây giờ, tạo ra những vở kịch lớn vào những thời điểm quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity or operation of something; the influence of something on something else",
                    "vi": "hoạt động hoặc hoạt động của một cái gì đó; ảnh hưởng của thứ gì đó lên thứ khác"
                },
                "examples": [
                    {
                        "en": "the free play of market forces",
                        "vi": "cuộc chơi tự do của các lực lượng thị trường"
                    },
                    {
                        "en": "in play More powerful forces are in play.",
                        "vi": "đang chơi Các lực lượng mạnh mẽ hơn đang chơi."
                    },
                    {
                        "en": "The financial crisis has brought new factors into play.",
                        "vi": "Cuộc khủng hoảng tài chính đã kéo theo những nhân tố mới vào cuộc."
                    },
                    {
                        "en": "Personal feelings should not come into play when you are making business decisions.",
                        "vi": "Cảm xúc cá nhân không nên phát huy tác dụng khi bạn đưa ra quyết định kinh doanh."
                    },
                    {
                        "en": "at play Other issues such as market power could be at play.",
                        "vi": "Các vấn đề khác như sức mạnh thị trường có thể xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "the possibility of free and easy movement",
                    "vi": "khả năng di chuyển tự do và dễ dàng"
                },
                "examples": [
                    {
                        "en": "We need more play in the rope.",
                        "vi": "Chúng tôi cần chơi nhiều hơn trên dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a light, quick movement that keeps changing",
                    "vi": "một chuyển động nhẹ, nhanh chóng liên tục thay đổi"
                },
                "examples": [
                    {
                        "en": "the play of sunlight on water",
                        "vi": "trò chơi của ánh sáng mặt trời trên mặt nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not healthy to spend all your time working; you need to relax too",
                    "vi": "không có lợi cho sức khỏe nếu bạn dành toàn bộ thời gian để làm việc; bạn cũng cần thư giãn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very easy to do, so not even a child would find it difficult",
                    "vi": "rất dễ thực hiện, vì vậy ngay cả một đứa trẻ cũng không cảm thấy khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make use of something",
                    "vi": "để sử dụng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Chess is a game that calls into play all your powers of concentration.",
                        "vi": "Cờ vua là một trò chơi đòi hỏi bạn phải phát huy hết khả năng tập trung của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time playing with a toy, game, etc.",
                    "vi": "dành thời gian chơi với đồ chơi, trò chơi, v.v."
                },
                "examples": [
                    {
                        "en": "I had a play with the new computer game.",
                        "vi": "Tôi đã chơi với trò chơi máy tính mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "inside/outside the area allowed by the rules of the game",
                    "vi": "trong / ngoài khu vực cho phép của luật chơi"
                },
                "examples": [
                    {
                        "en": "She just managed to keep the ball in play.",
                        "vi": "Cô ấy chỉ quản lý để giữ bóng trong cuộc chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to emphasize the importance of a particular fact",
                    "vi": "để nhấn mạnh tầm quan trọng của một sự kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "He made great play of the fact that his uncle was a duke.",
                        "vi": "Anh ấy đã chơi tuyệt vời việc chú của anh ấy là một công tước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to obtain something; to do things that are intended to produce a particular result",
                    "vi": "để cố gắng đạt được một cái gì đó; để làm những việc nhằm tạo ra một kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "She was making a play for the sales manager's job.",
                        "vi": "Cô ấy đang đóng kịch cho công việc của giám đốc bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the humorous use of a word or phrase that can have two different meanings",
                    "vi": "cách sử dụng hài hước của một từ hoặc cụm từ có thể có hai nghĩa khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the stage that has been reached in a process, etc. which has not yet been completed",
                    "vi": "giai đoạn đã đạt được trong một quy trình, v.v. vẫn chưa được hoàn thành"
                },
                "examples": [
                    {
                        "en": "What is the current state of play in the peace talks?",
                        "vi": "Tình trạng hiện tại của cuộc đàm phán hòa bình là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the score in a sports match, especially in cricket",
                    "vi": "điểm số trong một trận đấu thể thao, đặc biệt là môn cricket"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0885256a0ab34bd9962b872765d11128",
        "word": "winning",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwɪnɪŋ/",
            "us": "/ˈwɪnɪŋ/"
        },
        "nearby": [
            {
                "word": "Winnie",
                "pos": ""
            },
            {
                "word": "Winnie-the-Pooh",
                "pos": ""
            },
            {
                "word": "winning",
                "pos": "adjective"
            },
            {
                "word": "winningest",
                "pos": "adjective"
            },
            {
                "word": "winningly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that wins or has won something, for example a race or competition",
                    "vi": "chiến thắng hoặc đã giành được một cái gì đó, ví dụ như một cuộc đua hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "the winning horse",
                        "vi": "con ngựa chiến thắng"
                    },
                    {
                        "en": "He scored the winning goal in the final.",
                        "vi": "Anh ấy đã ghi bàn thắng quyết định trong trận chung kết."
                    }
                ]
            },
            {
                "define": {
                    "en": "attractive in a way that makes other people like you",
                    "vi": "hấp dẫn theo cách khiến người khác thích bạn"
                },
                "examples": [
                    {
                        "en": "‘I'm sorry I'm so late,’ she said, flashing us a winning smile.",
                        "vi": "Tôi xin lỗi vì tôi đến muộn, cô ấy nói, nở một nụ cười chiến thắng với chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of victories or successes",
                    "vi": "một loạt các chiến thắng hoặc thành công"
                },
                "examples": [
                    {
                        "en": "He'll look to continue his winning ways with a victory in Mexico on 16 February.",
                        "vi": "Anh ấy sẽ tiếp tục con đường chiến thắng của mình với chiến thắng ở Mexico vào ngày 16 tháng 2."
                    }
                ]
            }
        ]
    },
    {
        "id": "a7e99182b8924527b28e700fa956bc55",
        "word": "leisure centre",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈleʒə sentə(r)/",
            "us": "/ˈliːʒər sentər/"
        },
        "nearby": [
            {
                "word": "Vivien Leigh",
                "pos": ""
            },
            {
                "word": "leisure",
                "pos": "noun"
            },
            {
                "word": "leisure centre",
                "pos": "noun"
            },
            {
                "word": "leisured",
                "pos": "adjective"
            },
            {
                "word": "leisurely",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public building where people can go to do sports and other activities in their free time",
                    "vi": "một tòa nhà công cộng, nơi mọi người có thể đến chơi thể thao và các hoạt động khác vào thời gian rảnh của họ"
                },
                "examples": [
                    {
                        "en": "There are plans for the development of a new leisure centre on the site.",
                        "vi": "Có kế hoạch phát triển một trung tâm giải trí mới trên trang web."
                    }
                ]
            }
        ]
    },
    {
        "id": "77755b1c168247c5b549d577c2439096",
        "word": "opponent",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈpəʊnənt/",
            "us": "/əˈpəʊnənt/"
        },
        "nearby": [
            {
                "word": "opossum",
                "pos": "noun"
            },
            {
                "word": "J Robert Oppenheimer",
                "pos": ""
            },
            {
                "word": "opponent",
                "pos": "noun"
            },
            {
                "word": "opportune",
                "pos": "adjective"
            },
            {
                "word": "opportunely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person that you are playing or fighting against in a game, competition, argument, etc.",
                    "vi": "một người mà bạn đang chơi hoặc chống lại trong một trò chơi, cuộc thi, cuộc tranh cãi, v.v."
                },
                "examples": [
                    {
                        "en": "a political opponent",
                        "vi": "một đối thủ chính trị"
                    },
                    {
                        "en": "a worthy/formidable/fierce/tough/staunch opponent",
                        "vi": "một đối thủ xứng đáng / đáng gờm / khốc liệt / khó khăn / trung thành"
                    },
                    {
                        "en": "The team's opponents are unbeaten so far this season.",
                        "vi": "Các đối thủ của đội đang bất bại cho đến nay trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is against something and tries to change or stop it",
                    "vi": "một người chống lại điều gì đó và cố gắng thay đổi hoặc ngăn chặn nó"
                },
                "examples": [
                    {
                        "en": "opponent of something opponents of abortion",
                        "vi": "đối thủ của một cái gì đó phản đối phá thai"
                    },
                    {
                        "en": "opponents of the regime",
                        "vi": "đối thủ của chế độ"
                    },
                    {
                        "en": "the most outspoken opponents of the war",
                        "vi": "những đối thủ thẳng thắn nhất của cuộc chiến"
                    },
                    {
                        "en": "Opponents argue that the scheme would be prohibitively expensive.",
                        "vi": "Những người phản đối cho rằng kế hoạch này sẽ rất tốn kém."
                    },
                    {
                        "en": "There were violent clashes between supporters and opponents of the government.",
                        "vi": "Đã có những cuộc đụng độ bạo lực giữa những người ủng hộ và phản đối chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "d605253b62b94fad8cb000b35ebe7382",
        "word": "scoreboard",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈskɔːbɔːd/",
            "us": "/ˈskɔːrbɔːrd/"
        },
        "nearby": [
            {
                "word": "score",
                "pos": "verb"
            },
            {
                "word": "score",
                "pos": "noun"
            },
            {
                "word": "scoreboard",
                "pos": "noun"
            },
            {
                "word": "scorecard",
                "pos": "noun"
            },
            {
                "word": "score draw",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board on which the score in a game or competition is shown",
                    "vi": "một bảng lớn trên đó hiển thị điểm số trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "The score was displayed on a giant electronic scoreboard.",
                        "vi": "Điểm số được hiển thị trên một bảng điểm điện tử khổng lồ."
                    },
                    {
                        "en": "The scoreboard showed 18 runs for 3 wickets.",
                        "vi": "Bảng điểm cho thấy 18 lần chạy 3 điểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "70fdd1f1d7d142dc9e629b59a705036c",
        "word": "out",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/aʊt/",
            "us": "/aʊt/"
        },
        "nearby": [
            {
                "word": "oust",
                "pos": "verb"
            },
            {
                "word": "ouster",
                "pos": "noun"
            },
            {
                "word": "out",
                "pos": "adverb, preposition"
            },
            {
                "word": "out",
                "pos": "noun"
            },
            {
                "word": "out",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "away from the inside of a place or thing",
                    "vi": "cách xa bên trong của một địa điểm hoặc vật gì đó"
                },
                "examples": [
                    {
                        "en": "She ran out into the corridor.",
                        "vi": "Cô chạy ra ngoài hành lang."
                    },
                    {
                        "en": "She shook the bag and some coins fell out.",
                        "vi": "Cô lắc chiếc túi và một số đồng xu rơi ra."
                    },
                    {
                        "en": "out of something I got out of bed.",
                        "vi": "ra khỏi cái gì đó tôi ra khỏi giường."
                    },
                    {
                        "en": "He opened the box and out jumped a frog.",
                        "vi": "Anh ta mở hộp và nhảy ra ngoài một con ếch."
                    },
                    {
                        "en": "Out you go! (= used to order somebody to leave a room)",
                        "vi": "Ra ngoài bạn đi! (= dùng để ra lệnh cho ai đó rời khỏi phòng)"
                    },
                    {
                        "en": "(informal) He ran out the door.",
                        "vi": "(thân mật) Anh ấy đã chạy ra khỏi cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "away from or not at home or their place of work",
                    "vi": "xa hoặc không ở nhà hoặc nơi làm việc của họ"
                },
                "examples": [
                    {
                        "en": "I called Liz but she was out.",
                        "vi": "Tôi đã gọi cho Liz nhưng cô ấy đã ra ngoài."
                    },
                    {
                        "en": "Let's go out this evening (= for example to a restaurant or club).",
                        "vi": "Tối nay hãy đi chơi (= ví dụ như đi nhà hàng hoặc câu lạc bộ)."
                    },
                    {
                        "en": "We haven't had a night out for weeks.",
                        "vi": "Chúng tôi đã không có một đêm đi chơi trong nhiều tuần."
                    },
                    {
                        "en": "out of something Mr Green is out of town this week.",
                        "vi": "ra khỏi cái gì đó Mr Green đã vắng mặt trong thị trấn trong tuần này."
                    },
                    {
                        "en": "I got an out of office reply to my email.",
                        "vi": "Tôi đã nhận được thư trả lời vắng mặt cho email của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "outside; not in a building",
                    "vi": "ngoài; không phải trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "It's cold out.",
                        "vi": "Trời lạnh."
                    },
                    {
                        "en": "There were children playing out in the street.",
                        "vi": "Có những đứa trẻ đang chơi ngoài đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that something/somebody is removed from a place, job, etc.",
                    "vi": "được sử dụng để chỉ ra rằng một cái gì đó / ai đó bị xóa khỏi một địa điểm, công việc, v.v."
                },
                "examples": [
                    {
                        "en": "This detergent is good for getting stains out.",
                        "vi": "Chất tẩy rửa này rất tốt để loại bỏ vết bẩn."
                    },
                    {
                        "en": "We want this government out.",
                        "vi": "Chúng tôi muốn chính phủ này ra khỏi."
                    },
                    {
                        "en": "out of something He got thrown out of the restaurant.",
                        "vi": "ra khỏi cái gì đó Anh ấy đã bị ném ra khỏi nhà hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "away from the edge of a place",
                    "vi": "cách xa rìa của một nơi"
                },
                "examples": [
                    {
                        "en": "The boy dashed out into the road.",
                        "vi": "Cậu bé phóng ra đường."
                    },
                    {
                        "en": "out of something Don't lean out of the window.",
                        "vi": "ra khỏi cái gì đó Đừng dựa ra ngoài cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show where something comes from",
                    "vi": "được sử dụng để chỉ nơi một cái gì đó đến từ"
                },
                "examples": [
                    {
                        "en": "He drank his beer out of the bottle.",
                        "vi": "Anh ta uống hết bia của mình trong chai."
                    },
                    {
                        "en": "a romance straight out of a fairy tale",
                        "vi": "một câu chuyện lãng mạn như một câu chuyện cổ tích"
                    },
                    {
                        "en": "I paid for the damage out of my savings.",
                        "vi": "Tôi đã trả cho thiệt hại từ tiền tiết kiệm của mình."
                    },
                    {
                        "en": "We'll get the truth out of her.",
                        "vi": "Chúng tôi sẽ đưa ra sự thật từ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show what something is made from",
                    "vi": "được sử dụng để hiển thị một cái gì đó được làm từ"
                },
                "examples": [
                    {
                        "en": "a statue made out of bronze",
                        "vi": "một bức tượng làm bằng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that somebody/something does not have any of something",
                    "vi": "được sử dụng để chỉ ra rằng ai đó / cái gì đó không có bất kỳ thứ gì"
                },
                "examples": [
                    {
                        "en": "We're out of milk.",
                        "vi": "Chúng tôi hết sữa."
                    },
                    {
                        "en": "He's been out of work for six months.",
                        "vi": "Anh ấy đã không làm việc được sáu tháng."
                    },
                    {
                        "en": "You're out of luck—she left ten minutes ago.",
                        "vi": "Bạn không gặp may - cô ấy đã rời đi mười phút trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that somebody/something is not or no longer in a particular state or condition",
                    "vi": "được sử dụng để chỉ ra rằng ai đó / cái gì đó không hoặc không còn ở trạng thái hoặc điều kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "Try and stay out of trouble.",
                        "vi": "Cố gắng và tránh xa rắc rối."
                    },
                    {
                        "en": "I watched the car until it was out of sight.",
                        "vi": "Tôi quan sát chiếc xe cho đến khi khuất bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that somebody is no longer involved in something",
                    "vi": "được sử dụng để cho thấy rằng ai đó không còn tham gia vào một cái gì đó nữa"
                },
                "examples": [
                    {
                        "en": "It was an awful job and I'm glad to be out of it.",
                        "vi": "Đó là một công việc tồi tệ và tôi rất vui khi được thoát khỏi nó."
                    },
                    {
                        "en": "He gets out of the army in a few weeks.",
                        "vi": "Anh ta sẽ xuất ngũ trong vài tuần nữa."
                    },
                    {
                        "en": "They'll be out (= of prison) on bail in no time.",
                        "vi": "Họ sẽ được tại ngoại trong thời gian ngắn."
                    },
                    {
                        "en": "Brown goes on to the semi-finals but Lee is out.",
                        "vi": "Brown đi tiếp vào bán kết nhưng Lee đã bị loại."
                    }
                ]
            },
            {
                "define": {
                    "en": "from a particular number or set",
                    "vi": "từ một số hoặc tập hợp cụ thể"
                },
                "examples": [
                    {
                        "en": "You scored six out of ten.",
                        "vi": "Bạn đã ghi được sáu trên mười."
                    },
                    {
                        "en": "Two out of three people think the President should resign.",
                        "vi": "Cứ ba người thì có hai người cho rằng Tổng thống nên từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "clearly and loudly so that people can hear",
                    "vi": "rõ ràng và to để mọi người có thể nghe thấy"
                },
                "examples": [
                    {
                        "en": "to call/cry/shout out",
                        "vi": "gọi / khóc / hét lên"
                    },
                    {
                        "en": "Read it out loud.",
                        "vi": "Đọc nó thành tiếng."
                    },
                    {
                        "en": "Nobody spoke out in his defence.",
                        "vi": "Không ai lên tiếng bênh vực anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long or a particular distance away from a place or from land",
                    "vi": "một khoảng cách dài hoặc một khoảng cách cụ thể từ một địa điểm hoặc từ đất liền"
                },
                "examples": [
                    {
                        "en": "She's working out in Australia.",
                        "vi": "Cô ấy đang làm việc ở Úc."
                    },
                    {
                        "en": "He lives right out in the country.",
                        "vi": "Anh ấy sống ngay ở trong nước."
                    },
                    {
                        "en": "The boats are all out at sea.",
                        "vi": "Các thuyền đều ra khơi."
                    },
                    {
                        "en": "The ship sank ten miles out of Stockholm.",
                        "vi": "Con tàu bị chìm cách Stockholm mười dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "available to everyone; known to everyone",
                    "vi": "có sẵn cho tất cả mọi người; được mọi người biết đến"
                },
                "examples": [
                    {
                        "en": "When does her new book come out?",
                        "vi": "Khi nào cuốn sách mới của cô ấy ra mắt?"
                    },
                    {
                        "en": "Word always gets out (= people find out about things) no matter how careful you are.",
                        "vi": "Word luôn luôn lọt ra ngoài (= mọi người tìm hiểu về mọi thứ) cho dù bạn có cẩn thận đến đâu."
                    },
                    {
                        "en": "Out with it! (= say what you know)",
                        "vi": "Hãy nói ra đi! (= nói những gì bạn biết)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show the reason why something is done",
                    "vi": "được sử dụng để chỉ ra lý do tại sao một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "I asked out of curiosity.",
                        "vi": "Tôi hỏi vì tò mò."
                    },
                    {
                        "en": "She did it out of spite.",
                        "vi": "Cô ấy đã làm điều đó bất chấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "not in the library; borrowed by somebody else",
                    "vi": "không có trong thư viện; mượn bởi người khác"
                },
                "examples": [
                    {
                        "en": "The book you wanted is out on loan.",
                        "vi": "Cuốn sách bạn muốn được cho mượn."
                    }
                ]
            },
            {
                "define": {
                    "en": "at or towards its lowest point on land",
                    "vi": "tại hoặc về phía điểm thấp nhất của nó trên đất liền"
                },
                "examples": [
                    {
                        "en": "I like walking on the wet sand when the tide is out.",
                        "vi": "Tôi thích đi bộ trên cát ướt khi thủy triều rút."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the sun, moon or stars are or come out, they can be seen from the earth and are not hidden by clouds",
                    "vi": "nếu mặt trời, mặt trăng hoặc các ngôi sao xuất hiện hoặc đi ra, chúng có thể được nhìn thấy từ trái đất và không bị che bởi những đám mây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "fully open",
                    "vi": "mở cửa hoàn toàn"
                },
                "examples": [
                    {
                        "en": "There should be some snowdrops out by now.",
                        "vi": "Bây giờ sẽ có một số giọt tuyết rơi ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a team or team member is out, it is no longer their turn with the bat",
                    "vi": "nếu một đội hoặc thành viên trong nhóm bị loại, đó không còn là lượt của họ với con dơi"
                },
                "examples": [
                    {
                        "en": "The West Indies were all out for 364 (= after scoring 364 runs in cricket).",
                        "vi": "West Indies đã ra sân với 364 (= sau khi ghi được 364 lần chạy cricket)."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a player is out, they can no longer take part in the game",
                    "vi": "nếu một người chơi đã vắng mặt, họ không thể tham gia trò chơi được nữa"
                },
                "examples": [
                    {
                        "en": "If you have no more cards, you are out. The winner is the one with the most cards.",
                        "vi": "Nếu bạn không còn thẻ nữa, bạn đã hết. Người chiến thắng là người có nhiều thẻ nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the ball is out, it landed outside the line",
                    "vi": "nếu bóng ra ngoài, nó đã hạ cánh bên ngoài đường biên"
                },
                "examples": [
                    {
                        "en": "The umpire said the ball was out.",
                        "vi": "Trọng tài cho biết bóng đã ra ngoài."
                    },
                    {
                        "en": "The ball landed out.",
                        "vi": "Quả bóng tiếp đất ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "not correct or exact; wrong",
                    "vi": "không đúng hoặc không chính xác; Sai lầm"
                },
                "examples": [
                    {
                        "en": "I was slightly out in my calculations.",
                        "vi": "Tôi đã hơi lạc lõng trong tính toán của mình."
                    },
                    {
                        "en": "Your guess was a long way out (= completely wrong).",
                        "vi": "Phỏng đoán của bạn là một chặng đường dài (= hoàn toàn sai)."
                    },
                    {
                        "en": "The estimate was out by more than $100.",
                        "vi": "Ước tính đã hơn 100 đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "not possible or not allowed",
                    "vi": "không thể hoặc không được phép"
                },
                "examples": [
                    {
                        "en": "Swimming is out until the weather gets warmer.",
                        "vi": "Du khách có thể đi bơi cho đến khi thời tiết ấm hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not fashionable",
                    "vi": "không hợp thời trang"
                },
                "examples": [
                    {
                        "en": "Black is out this year.",
                        "vi": "Màu đen là ra trong năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "not or no longer burning or lit",
                    "vi": "không hoặc không còn cháy hoặc sáng"
                },
                "examples": [
                    {
                        "en": "Suddenly all the lights went out.",
                        "vi": "Đột nhiên tất cả các đèn tắt."
                    },
                    {
                        "en": "The fire had burnt itself out.",
                        "vi": "Ngọn lửa đã tự cháy."
                    }
                ]
            },
            {
                "define": {
                    "en": "at an end",
                    "vi": "ở cuối"
                },
                "examples": [
                    {
                        "en": "It was summer and school was out.",
                        "vi": "Đó là mùa hè và trường học đã được nghỉ."
                    },
                    {
                        "en": "She was to regret her words before the day was out.",
                        "vi": "Cô phải hối hận vì những lời nói của mình trước khi ngày tàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "unconscious",
                    "vi": "bất tỉnh"
                },
                "examples": [
                    {
                        "en": "He was out for more than an hour and came round in the hospital.",
                        "vi": "Anh ấy đã ra ngoài hơn một giờ và đến bệnh viện."
                    },
                    {
                        "en": "She was knocked out cold.",
                        "vi": "Cô ấy đã bị đánh gục vì lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "on strike",
                    "vi": "đình công"
                },
                "examples": [
                    {
                        "en": "The dockers stayed out for several months.",
                        "vi": "Những người đóng tàu đã ở lại trong vài tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to the end; completely",
                    "vi": "đến cuối cùng; hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Hear me out before you say anything.",
                        "vi": "Hãy nghe tôi nói trước khi bạn nói bất cứ điều gì."
                    },
                    {
                        "en": "We left them to fight it out (= settle a disagreement by fighting or arguing).",
                        "vi": "Chúng tôi để họ chống lại nó (= giải quyết bất đồng bằng cách đánh nhau hoặc tranh cãi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be trying to get or do something",
                    "vi": "cố gắng đạt được hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'm not out for revenge.",
                        "vi": "Tôi không ra ngoài để trả thù."
                    },
                    {
                        "en": "She's out for what she can get (= trying to get something for herself).",
                        "vi": "She's out for what she can get (= cố gắng kiếm được thứ gì đó cho bản thân)."
                    },
                    {
                        "en": "The company is out to capture the Canadian market.",
                        "vi": "Công ty đang nỗ lực để đánh chiếm thị trường Canada."
                    }
                ]
            },
            {
                "define": {
                    "en": "going regularly to a place",
                    "vi": "thường xuyên đến một nơi"
                },
                "examples": [
                    {
                        "en": "He was in and out of jail for most of his life.",
                        "vi": "Anh ta đã ở trong và ngoài tù trong phần lớn cuộc đời của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to go outside again after an illness",
                    "vi": "có thể đi ngoài trở lại sau khi bị bệnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "travelling around a place",
                    "vi": "đi du lịch khắp nơi"
                },
                "examples": [
                    {
                        "en": "We've been out and about talking to people all over the country.",
                        "vi": "Chúng tôi đã ra ngoài và nói chuyện với mọi người trên khắp đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "going or leaving",
                    "vi": "đi hay về"
                },
                "examples": [
                    {
                        "en": "As soon as I get my money I'm out of here!",
                        "vi": "Ngay sau khi tôi nhận được tiền của mình, tôi sẽ ra khỏi đây!"
                    }
                ]
            },
            {
                "define": {
                    "en": "sad because you are not included in something",
                    "vi": "buồn vì bạn không được bao gồm trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We've only just moved here so we feel a little out of it.",
                        "vi": "Chúng tôi chỉ mới chuyển đến đây nên chúng tôi cảm thấy hơi khác thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "not aware of what is happening, usually because of drinking too much alcohol, or taking drugs",
                    "vi": "không nhận thức được những gì đang xảy ra, thường là do uống quá nhiều rượu hoặc dùng ma túy"
                },
                "examples": [
                    {
                        "en": "He looks completely out of it.",
                        "vi": "Anh ấy trông hoàn toàn thoát khỏi nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "180746fef9f34d3c87b9ca694266eaf9",
        "word": "square",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/skweə(r)/",
            "us": "/skwer/"
        },
        "nearby": [
            {
                "word": "squander",
                "pos": "verb"
            },
            {
                "word": "Squanto",
                "pos": ""
            },
            {
                "word": "square",
                "pos": "adjective"
            },
            {
                "word": "square",
                "pos": "noun"
            },
            {
                "word": "square",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having four straight equal sides and four angles of 90°",
                    "vi": "có bốn cạnh thẳng bằng nhau và bốn góc 90 °"
                },
                "examples": [
                    {
                        "en": "a square room",
                        "vi": "một căn phòng vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "forming an angle of 90° exactly or approximately",
                    "vi": "tạo thành một góc 90 ° chính xác hoặc gần đúng"
                },
                "examples": [
                    {
                        "en": "The book had rounded, not square, corners.",
                        "vi": "Cuốn sách được làm tròn, không vuông, các góc."
                    },
                    {
                        "en": "square shoulders",
                        "vi": "vai vuông"
                    },
                    {
                        "en": "He had a firm, square jaw.",
                        "vi": "Anh ta có một cái hàm vuông vức, rắn chắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a number to give a measurement of area",
                    "vi": "được sử dụng sau một số để đo diện tích"
                },
                "examples": [
                    {
                        "en": "an area of 36 square metres/feet/miles/kilometres/inches",
                        "vi": "diện tích 36 mét vuông / feet / dặm / km / inch"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a unit of measurement to say that something measures the same amount on each of four sides",
                    "vi": "được sử dụng sau một đơn vị đo lường để nói rằng một cái gì đó đo cùng một lượng ở mỗi cạnh trong số bốn cạnh"
                },
                "examples": [
                    {
                        "en": "a carpet four metres square",
                        "vi": "một tấm thảm bốn mét vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that is broad or that looks solid in shape",
                    "vi": "được sử dụng để mô tả một cái gì đó rộng hoặc có hình dạng rắn chắc"
                },
                "examples": [
                    {
                        "en": "a man of square build",
                        "vi": "người xây dựng hình vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "level with something or parallel to something",
                    "vi": "mức độ với một cái gì đó hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tables arranged square with the wall",
                        "vi": "bàn sắp xếp hình vuông với tường"
                    }
                ]
            },
            {
                "define": {
                    "en": "if two people are square, neither of them owes money to the other",
                    "vi": "nếu hai người là hình vuông, không ai trong số họ nợ người kia"
                },
                "examples": [
                    {
                        "en": "Here's the £10 I owe you—now we're square.",
                        "vi": "Đây là £ 10 tôi nợ bạn — bây giờ chúng ta đã vuông tròn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two teams are square, they have the same number of points",
                    "vi": "Nếu hai đội là hình vuông, họ có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "The teams were all square at half-time.",
                        "vi": "Tất cả các đội đều có hình vuông trong hiệp một."
                    }
                ]
            },
            {
                "define": {
                    "en": "fair or honest, especially in business matters",
                    "vi": "công bằng hoặc trung thực, đặc biệt là trong các vấn đề kinh doanh"
                },
                "examples": [
                    {
                        "en": "a square deal",
                        "vi": "một thỏa thuận vuông"
                    },
                    {
                        "en": "Are you being square with me?",
                        "vi": "Bạn có đang vuông với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "in agreement with something",
                    "vi": "đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "That isn't quite square with what you said yesterday.",
                        "vi": "Điều đó không hoàn toàn phù hợp với những gì bạn đã nói ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "considered to be boring, for example because they are old-fashioned or work too hard at school",
                    "vi": "được coi là nhàm chán, chẳng hạn như vì họ cổ hủ hoặc làm việc quá sức ở trường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a good meal that satisfies your hunger",
                    "vi": "một bữa ăn ngon giúp bạn thỏa mãn cơn đói"
                },
                "examples": [
                    {
                        "en": "He looks as though he hasn't had a square meal for weeks.",
                        "vi": "Anh ấy trông như thể anh ấy đã không được ăn một bữa no trong nhiều tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who does not feel happy or comfortable in a particular situation, or who is not suitable for it",
                    "vi": "một người không cảm thấy hạnh phúc hoặc thoải mái trong một tình huống cụ thể, hoặc người không phù hợp với nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1b81d63ca51f4406b994e4de440259de",
        "word": "tie",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪ/",
            "us": "/taɪ/"
        },
        "nearby": [
            {
                "word": "tidy away",
                "pos": "phrasal verb"
            },
            {
                "word": "tidy up",
                "pos": "phrasal verb"
            },
            {
                "word": "tie",
                "pos": "verb"
            },
            {
                "word": "tie",
                "pos": "noun"
            },
            {
                "word": "tiebreak",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to attach or hold two or more things together using string, rope, etc.; to fasten somebody/something with string, rope, etc.",
                    "vi": "để gắn hoặc giữ hai hoặc nhiều thứ với nhau bằng cách sử dụng dây, dây thừng, v.v.; để buộc chặt ai đó / cái gì đó bằng dây, dây thừng, v.v."
                },
                "examples": [
                    {
                        "en": "tie something + adv./prep. She tied the newspapers in a bundle.",
                        "vi": "buộc cái gì đó + adv./prep. Cô buộc những tờ báo trong một bó."
                    },
                    {
                        "en": "He had to tie her hands together.",
                        "vi": "Anh phải trói hai tay cô lại."
                    },
                    {
                        "en": "They tied him to a chair with cable.",
                        "vi": "Họ trói anh ta vào ghế bằng dây cáp."
                    },
                    {
                        "en": "I tie back my hair when I'm cooking.",
                        "vi": "Tôi buộc lại tóc khi đang nấu ăn."
                    },
                    {
                        "en": "The box was tied with plastic string.",
                        "vi": "Hộp được buộc bằng dây nhựa."
                    },
                    {
                        "en": "His hands were tied behind his back.",
                        "vi": "Hai tay bị trói sau lưng."
                    },
                    {
                        "en": "tie something Shall I tie the package or tape it?",
                        "vi": "buộc một cái gì đó Tôi sẽ buộc gói hoặc băng lại nó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to fasten something to or around something else",
                    "vi": "để buộc chặt một cái gì đó vào hoặc xung quanh một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "She tied a label on to the suitcase.",
                        "vi": "Cô ấy gắn một cái nhãn vào vali."
                    },
                    {
                        "en": "Anything which might be blown over was tied down or moved inside.",
                        "vi": "Bất cứ thứ gì có thể bị thổi bay qua đều được buộc chặt hoặc di chuyển vào bên trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a knot in a piece of string, rope, etc.",
                    "vi": "để tạo một nút trong một đoạn dây, dây thừng, v.v."
                },
                "examples": [
                    {
                        "en": "to tie a ribbon",
                        "vi": "buộc một dải ruy băng"
                    },
                    {
                        "en": "Can you help me tie my tie?",
                        "vi": "Bạn có thể giúp tôi thắt cà vạt được không?"
                    },
                    {
                        "en": "Tie the cords neatly.",
                        "vi": "Buộc dây gọn gàng."
                    },
                    {
                        "en": "Can you tie a bow tie?",
                        "vi": "Bạn có thể thắt nơ được không?"
                    },
                    {
                        "en": "He tied his shoes (= the laces on his shoes) with a double knot.",
                        "vi": "Anh ấy buộc đôi giày của mình (= dây buộc trên giày) bằng một nút thắt đôi."
                    },
                    {
                        "en": "tie something up Tie up your shoelaces!",
                        "vi": "buộc một cái gì đó lên Buộc dây giày của bạn lại!"
                    },
                    {
                        "en": "tie something in something I tied a knot in the rope.",
                        "vi": "buộc một cái gì đó trong một cái gì đó tôi buộc một nút trong dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be closed or fastened with a knot, etc.",
                    "vi": "được đóng hoặc buộc bằng nút, v.v."
                },
                "examples": [
                    {
                        "en": "The skirt ties at the waist.",
                        "vi": "Phần tà váy buộc ngang eo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to connect or link somebody/something closely with somebody/something else",
                    "vi": "để kết nối hoặc liên kết chặt chẽ ai đó / cái gì đó với ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "be tied (to something/somebody) Pay increases are tied to inflation.",
                        "vi": "bị ràng buộc (với một cái gì đó / ai đó) Tăng lương gắn liền với lạm phát."
                    },
                    {
                        "en": "Their company's future is closely tied to our own.",
                        "vi": "Tương lai của công ty họ gắn chặt với tương lai của chính chúng ta."
                    },
                    {
                        "en": "The house is tied to the job, so we'll have to move when I retire.",
                        "vi": "Ngôi nhà gắn liền với công việc, vì vậy chúng tôi sẽ phải chuyển đi khi tôi nghỉ hưu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit somebody's freedom to act and make them unable to do everything they want to",
                    "vi": "để hạn chế quyền tự do hành động của ai đó và khiến họ không thể làm mọi thứ họ muốn"
                },
                "examples": [
                    {
                        "en": "be tied (by something) to be tied by a contract",
                        "vi": "bị ràng buộc (bởi một cái gì đó) để bị ràng buộc bởi một hợp đồng"
                    },
                    {
                        "en": "be tied to something I want to work but I'm tied to the house with the baby.",
                        "vi": "bị ràng buộc với một cái gì đó tôi muốn làm việc nhưng tôi bị ràng buộc với ngôi nhà với đứa bé."
                    },
                    {
                        "en": "Carers can be completely tied to their homes.",
                        "vi": "Người chăm sóc hoàn toàn có thể bị ràng buộc với nhà của họ."
                    },
                    {
                        "en": "be tied to doing something I don't want to be tied to coming home at a particular time.",
                        "vi": "bị ràng buộc làm một việc gì đó mà tôi không muốn bị ràng buộc về nhà vào một thời điểm cụ thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the same number of points",
                    "vi": "để có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "tie (with somebody) England tied 2–2 with Germany in the first round.",
                        "vi": "hòa (với ai đó) Anh hòa 2–2 với Đức ở vòng đầu tiên."
                    },
                    {
                        "en": "tie for something They tied for second place.",
                        "vi": "buộc cho một cái gì đó Họ buộc cho vị trí thứ hai."
                    },
                    {
                        "en": "tie something The scores are tied at 3–3.",
                        "vi": "hòa thứ gì đó Tỷ số được hòa 3–3."
                    },
                    {
                        "en": "Last night's vote was tied.",
                        "vi": "Cuộc bỏ phiếu của đêm qua đã bị ràng buộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join notes with a tie",
                    "vi": "tham gia ghi chú với một cà vạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(too much under) the influence and control of somebody",
                    "vi": "(quá nhiều dưới) ảnh hưởng và kiểm soát của ai đó"
                },
                "examples": [
                    {
                        "en": "The British prime minister is too apt to cling to Washington's apron strings.",
                        "vi": "Thủ tướng Anh quá thích đeo tạp dề của Washington."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tie somebody’s hands and feet together so that they cannot move or escape",
                    "vi": "trói tay và chân của ai đó lại với nhau để họ không thể di chuyển hoặc trốn thoát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent somebody from doing what they want by creating rules, limits, etc.",
                    "vi": "để ngăn ai đó làm những gì họ muốn bằng cách tạo ra các quy tắc, giới hạn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to do what you want to do because of rules, promises, etc.",
                    "vi": "không thể làm những gì bạn muốn làm vì các quy tắc, lời hứa, v.v."
                },
                "examples": [
                    {
                        "en": "I really wish I could help but my hands are tied.",
                        "vi": "Tôi thực sự ước tôi có thể giúp đỡ nhưng tay tôi bị trói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or make somebody very confused",
                    "vi": "trở thành hoặc làm cho ai đó rất bối rối"
                },
                "examples": [
                    {
                        "en": "I got myself tied up in knots when I tried to explain the legal system to them.",
                        "vi": "Tôi đã tự trói mình trong những nút thắt khi cố gắng giải thích hệ thống pháp luật cho họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get married",
                    "vi": "kết hôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get very drunk",
                    "vi": "say"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f5a4aa7fdcf4a6393540aa77df45974",
        "word": "tie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪ/",
            "us": "/taɪ/"
        },
        "nearby": [
            {
                "word": "tidy up",
                "pos": "phrasal verb"
            },
            {
                "word": "tie",
                "pos": "verb"
            },
            {
                "word": "tie",
                "pos": "noun"
            },
            {
                "word": "tiebreak",
                "pos": "noun"
            },
            {
                "word": "tiebreaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, narrow piece of cloth worn around the neck, especially by men, with a knot in front",
                    "vi": "một mảnh vải dài và hẹp đeo quanh cổ, đặc biệt là của nam giới, với một nút ở phía trước"
                },
                "examples": [
                    {
                        "en": "He was dressed impeccably in a suit and tie.",
                        "vi": "Anh ta ăn mặc hoàn hảo trong bộ vest và thắt cà vạt."
                    },
                    {
                        "en": "They prefer their employees to wear a shirt and tie.",
                        "vi": "Họ thích nhân viên của mình mặc áo sơ mi và thắt cà vạt."
                    },
                    {
                        "en": "a striped silk tie",
                        "vi": "cà vạt lụa sọc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of string or wire used for fastening or tying something",
                    "vi": "một đoạn dây hoặc dây được sử dụng để buộc hoặc buộc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "ties for closing plastic bags",
                        "vi": "dây buộc để đóng túi nhựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong connection between people or organizations",
                    "vi": "một kết nối mạnh mẽ giữa mọi người hoặc tổ chức"
                },
                "examples": [
                    {
                        "en": "family ties",
                        "vi": "quan hệ gia đình"
                    },
                    {
                        "en": "diplomatic/economic/bilateral ties",
                        "vi": "quan hệ ngoại giao / kinh tế / song phương"
                    },
                    {
                        "en": "emotional ties",
                        "vi": "quan hệ tình cảm"
                    },
                    {
                        "en": "the ties of friendship",
                        "vi": "mối quan hệ của tình bạn"
                    },
                    {
                        "en": "tie with somebody/something The firm has close ties with an American corporation.",
                        "vi": "tie with somebody / something Công ty có quan hệ chặt chẽ với một tập đoàn của Mỹ."
                    },
                    {
                        "en": "Although he was raised as a Roman Catholic, he has cut his ties with the Church.",
                        "vi": "Mặc dù lớn lên như một người Công giáo La Mã, nhưng ông đã cắt đứt quan hệ của mình với Giáo hội."
                    },
                    {
                        "en": "tie between somebody/something There is a strong tie between her and her daughters.",
                        "vi": "ràng buộc giữa ai đó / cái gì đó Có một sự ràng buộc chặt chẽ giữa cô ấy và các con gái của cô ấy."
                    },
                    {
                        "en": "Ties between the two countries remain very strong.",
                        "vi": "Mối quan hệ giữa hai nước vẫn rất bền chặt."
                    },
                    {
                        "en": "tie to somebody/something giant corporations with close ties to the administration",
                        "vi": "ràng buộc với ai đó / cái gì đó các tập đoàn khổng lồ có quan hệ chặt chẽ với chính quyền"
                    },
                    {
                        "en": "Both sides agreed to strengthen political ties.",
                        "vi": "Cả hai bên nhất trí tăng cường quan hệ chính trị."
                    },
                    {
                        "en": "They severed ties after a dispute.",
                        "vi": "Họ cắt đứt quan hệ sau một cuộc tranh cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that limits somebody’s freedom of action",
                    "vi": "một thứ hạn chế quyền tự do hành động của ai đó"
                },
                "examples": [
                    {
                        "en": "He was still a young man and he did not want any ties.",
                        "vi": "Anh vẫn còn trẻ và anh không muốn có bất kỳ ràng buộc nào."
                    },
                    {
                        "en": "They have broken the ties that bound them.",
                        "vi": "Họ đã phá vỡ những sợi dây ràng buộc họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in a game or competition when two or more players have the same score",
                    "vi": "một tình huống trong trò chơi hoặc cuộc thi khi hai hoặc nhiều người chơi có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "The match ended in a tie.",
                        "vi": "Trận đấu kết thúc với tỷ số hòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sports match, especially a football (soccer) match, that is part of a larger competition",
                    "vi": "một trận đấu thể thao, đặc biệt là một trận bóng đá (bóng đá), là một phần của một cuộc thi lớn hơn"
                },
                "examples": [
                    {
                        "en": "the first leg of the tie between Leeds and Roma",
                        "vi": "trận lượt đi giữa Leeds và Roma"
                    },
                    {
                        "en": "They have a second round tie away to Ipswich Town.",
                        "vi": "Họ có trận hòa thứ hai trên sân khách trước Ipswich Town."
                    }
                ]
            },
            {
                "define": {
                    "en": "a curved line written over two notes of the same pitch (= how high or low a note is) to show that they are to be played or sung as one note",
                    "vi": "một đường cong được viết trên hai nốt nhạc có cùng cao độ (= mức độ cao hoặc thấp của một nốt nhạc) để thể hiện rằng chúng sẽ được chơi hoặc hát như một nốt nhạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the heavy pieces of wood or concrete on which the rails (= metal bars) on a railway track are laid",
                    "vi": "một trong những miếng gỗ hoặc bê tông nặng trên đó đặt đường ray (= thanh kim loại) trên đường ray"
                },
                "examples": []
            }
        ]
    }
]