[
    {
        "id": "f971403652624e47bf17cbb92a55cf2e",
        "word": "horror",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhɒrə(r)/",
            "us": "/ˈhɔːrər/"
        },
        "nearby": [
            {
                "word": "horrifying",
                "pos": "adjective"
            },
            {
                "word": "horrifyingly",
                "pos": "adverb"
            },
            {
                "word": "horror",
                "pos": "noun"
            },
            {
                "word": "horror story",
                "pos": "noun"
            },
            {
                "word": "horror-struck",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great shock or fear",
                    "vi": "một cảm giác rất sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "The thought of being left alone filled her with horror.",
                        "vi": "Ý nghĩ bị bỏ lại một mình khiến cô kinh hãi."
                    },
                    {
                        "en": "in horror People watched in horror as the plane crashed to the ground.",
                        "vi": "trong nỗi kinh hoàng Mọi người kinh hoàng nhìn chiếc máy bay lao xuống đất."
                    },
                    {
                        "en": "with horror She realized with horror that somebody had broken into her house.",
                        "vi": "với nỗi kinh hoàng Cô kinh hoàng nhận ra rằng ai đó đã đột nhập vào nhà cô."
                    },
                    {
                        "en": "to somebody's horror To his horror, he realized that he couldn't escape (= it upset him very much).",
                        "vi": "trước sự kinh hoàng của ai đó Trước nỗi kinh hoàng của anh ta, anh ta nhận ra rằng anh ta không thể trốn thoát (= điều đó khiến anh ta rất buồn)."
                    },
                    {
                        "en": "horror at something He expressed his horror at the idea that he was in some way to blame.",
                        "vi": "kinh hãi trước điều gì đó."
                    },
                    {
                        "en": "She recoiled in horror at the sight of an enormous spider.",
                        "vi": "Cô giật mình kinh hãi khi nhìn thấy một con nhện khổng lồ."
                    },
                    {
                        "en": "horror at doing something She revealed her horror at discovering the truth about her husband.",
                        "vi": "kinh hoàng khi làm điều gì đó Cô tiết lộ nỗi kinh hoàng của mình khi phát hiện ra sự thật về chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very unpleasant or frightening experience",
                    "vi": "một trải nghiệm rất khó chịu hoặc đáng sợ"
                },
                "examples": [
                    {
                        "en": "an account of the horrors inflicted on the detainees",
                        "vi": "tường thuật về sự kinh hoàng gây ra cho những người bị giam giữ"
                    },
                    {
                        "en": "The UN has been slow to condemn the horrors being perpetrated by the regime.",
                        "vi": "LHQ đã chậm chạp trong việc lên án những điều khủng khiếp mà chế độ này gây ra."
                    },
                    {
                        "en": "the horrors of something the horrors of war",
                        "vi": "sự khủng khiếp của một cái gì đó sự khủng khiếp của chiến tranh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the very unpleasant nature of something, especially when it shocks or frightens you",
                    "vi": "bản chất rất khó chịu của điều gì đó, đặc biệt là khi nó gây sốc hoặc làm bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "The full horror of the accident was beginning to become clear.",
                        "vi": "Toàn bộ sự kinh hoàng của vụ tai nạn bắt đầu trở nên rõ ràng."
                    },
                    {
                        "en": "In his dreams he relives the horror of the attack.",
                        "vi": "Trong những giấc mơ của mình, anh ta sống lại nỗi kinh hoàng của cuộc tấn công."
                    },
                    {
                        "en": "Our report will reveal the true horror of conditions in the camps.",
                        "vi": "Báo cáo của chúng tôi sẽ tiết lộ sự kinh hoàng thực sự của điều kiện trong các trại."
                    },
                    {
                        "en": "The horror of the situation overwhelmed him completely.",
                        "vi": "Tình huống kinh hoàng khiến anh hoàn toàn choáng ngợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong feeling of fear or of hating something",
                    "vi": "cảm giác sợ hãi mạnh mẽ hoặc ghét điều gì đó"
                },
                "examples": [
                    {
                        "en": "horror of something a horror of deep water",
                        "vi": "nỗi kinh hoàng của một cái gì đó một nỗi kinh hoàng của vùng nước sâu"
                    },
                    {
                        "en": "horror of doing something Most people have a horror of speaking in public.",
                        "vi": "kinh hãi khi làm điều gì đó Hầu hết mọi người đều sợ hãi khi nói trước đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of book, film, etc. that is designed to frighten people",
                    "vi": "một loại sách, phim, v.v. được thiết kế để làm mọi người sợ hãi"
                },
                "examples": [
                    {
                        "en": "In this section you'll find horror and science fiction.",
                        "vi": "Trong phần này, bạn sẽ tìm thấy kinh dị và khoa học viễn tưởng."
                    },
                    {
                        "en": "fans of classic horror",
                        "vi": "người hâm mộ kinh dị cổ điển"
                    },
                    {
                        "en": "a horror film/movie/story",
                        "vi": "một bộ phim / bộ phim / câu chuyện kinh dị"
                    },
                    {
                        "en": "the horror genre",
                        "vi": "thể loại kinh dị"
                    }
                ]
            },
            {
                "define": {
                    "en": "a child who behaves badly",
                    "vi": "một đứa trẻ cư xử tệ"
                },
                "examples": [
                    {
                        "en": "Her son is a little horror.",
                        "vi": "Con trai cô hơi kinh dị."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize how bad a situation is",
                    "vi": "được sử dụng để nhấn mạnh tình huống tồi tệ như thế nào"
                },
                "examples": [
                    {
                        "en": "I stood up to speak and—horror of horrors—realized I had left my notes behind.",
                        "vi": "Tôi đứng lên để phát biểu và - kinh hoàng hãi hùng - nhận ra rằng tôi đã bỏ quên những ghi chép của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you pretend to be shocked by something that is not really very serious or surprising",
                    "vi": "được sử dụng khi bạn giả vờ bị sốc trước một điều gì đó không thực sự nghiêm trọng hoặc đáng ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The article reports on a celebrity who—shock horror—has gained weight!",
                        "vi": "Bài báo tường thuật về một người nổi tiếng - gây sốc kinh hoàng - đã tăng cân!"
                    }
                ]
            }
        ]
    },
    {
        "id": "6500db00d19643d09d8745a4def96c19",
        "word": "disgusting",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪsˈɡʌstɪŋ/",
            "us": "/dɪsˈɡʌstɪŋ/"
        },
        "nearby": [
            {
                "word": "disgusted",
                "pos": "adjective"
            },
            {
                "word": "disgustedly",
                "pos": "adverb"
            },
            {
                "word": "disgusting",
                "pos": "adjective"
            },
            {
                "word": "disgustingly",
                "pos": "adverb"
            },
            {
                "word": "dish",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely unpleasant",
                    "vi": "cực kì khó chịu"
                },
                "examples": [
                    {
                        "en": "The kitchen was in a disgusting state when she left.",
                        "vi": "Nhà bếp ở trong tình trạng kinh tởm khi cô ấy rời đi."
                    },
                    {
                        "en": "What a disgusting smell!",
                        "vi": "Thật là một mùi kinh tởm!"
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel shocked, upset or angry",
                    "vi": "khiến bạn cảm thấy sốc, khó chịu hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "I think it's disgusting that they're closing the local hospital.",
                        "vi": "Tôi nghĩ thật kinh tởm khi họ đóng cửa bệnh viện địa phương."
                    },
                    {
                        "en": "His language is disgusting (= he uses a lot of offensive words).",
                        "vi": "Ngôn ngữ của anh ấy thật kinh tởm (= anh ấy sử dụng rất nhiều từ ngữ xúc phạm)."
                    }
                ]
            }
        ]
    },
    {
        "id": "7bccc868d1b54b7fbfe75aa5e9b4e6f9",
        "word": "horrify",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɒrɪfaɪ/",
            "us": "/ˈhɔːrɪfaɪ/"
        },
        "nearby": [
            {
                "word": "horrifically",
                "pos": "adverb"
            },
            {
                "word": "horrified",
                "pos": "adjective"
            },
            {
                "word": "horrify",
                "pos": "verb"
            },
            {
                "word": "horrifying",
                "pos": "adjective"
            },
            {
                "word": "horrifyingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel extremely shocked or frightened",
                    "vi": "làm cho ai đó cảm thấy cực kỳ sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "horrify somebody The whole country was horrified by the killings.",
                        "vi": "kinh hoàng ai đó Cả nước kinh hoàng vì những vụ giết người."
                    },
                    {
                        "en": "it horrifies somebody to do something It horrified her to think that he had killed someone.",
                        "vi": "nó làm ai đó kinh hoàng khi làm điều gì đó. Cô ấy kinh hoàng khi nghĩ rằng anh ta đã giết ai đó."
                    },
                    {
                        "en": "it horrifies somebody that… It horrified her that he had actually killed someone.",
                        "vi": "điều đó làm ai đó kinh hoàng rằng… Cô ấy kinh hoàng rằng anh ta đã thực sự giết một ai đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea27e66651c54544a05c8d4973a284cc",
        "word": "appalled",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈpɔːld/",
            "us": "/əˈpɔːld/"
        },
        "nearby": [
            {
                "word": "Appalachia",
                "pos": ""
            },
            {
                "word": "the Appalachian Mountains",
                "pos": ""
            },
            {
                "word": "appalled",
                "pos": "adjective"
            },
            {
                "word": "appalling",
                "pos": "adjective"
            },
            {
                "word": "appallingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing horror at something unpleasant or wrong",
                    "vi": "cảm thấy hoặc thể hiện sự kinh hoàng trước điều gì đó khó chịu hoặc sai trái"
                },
                "examples": [
                    {
                        "en": "an appalled expression/silence",
                        "vi": "một biểu hiện kinh hoàng / im lặng"
                    },
                    {
                        "en": "We watched appalled as the child ran in front of the car.",
                        "vi": "Chúng tôi kinh hoàng nhìn đứa trẻ chạy trước đầu xe."
                    },
                    {
                        "en": "appalled at something They were appalled at the waste of recyclable material.",
                        "vi": "kinh hoàng trước một cái gì đó Họ kinh hoàng trước sự lãng phí của vật liệu có thể tái chế."
                    }
                ]
            }
        ]
    },
    {
        "id": "111b5ce759fd4f02877b46ecfc4057e1",
        "word": "contempt",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈtempt/",
            "us": "/kənˈtempt/"
        },
        "nearby": [
            {
                "word": "contemporary",
                "pos": "adjective"
            },
            {
                "word": "contemporary",
                "pos": "noun"
            },
            {
                "word": "contempt",
                "pos": "noun"
            },
            {
                "word": "contemptible",
                "pos": "adjective"
            },
            {
                "word": "contempt of court",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling that somebody/something is without value and deserves no respect at all",
                    "vi": "cảm giác rằng ai đó / cái gì đó không có giá trị và không đáng được tôn trọng"
                },
                "examples": [
                    {
                        "en": "with contempt She looked at him with contempt.",
                        "vi": "với vẻ khinh thường Cô nhìn anh với vẻ khinh thường."
                    },
                    {
                        "en": "I shall treat that suggestion with the contempt it deserves.",
                        "vi": "Tôi sẽ coi đề nghị đó với sự khinh bỉ mà nó đáng có."
                    },
                    {
                        "en": "beneath contempt His treatment of his children is beneath contempt (= so bad that it is not even worth feeling contempt for).",
                        "vi": "bên dưới sự khinh miệt Đối xử của anh ấy với các con của mình là sự khinh miệt (= tệ đến mức nó thậm chí không đáng để cảm thấy bị khinh thường)."
                    },
                    {
                        "en": "in contempt Politicians seem to be generally held in contempt by ordinary people.",
                        "vi": "khinh thường Các chính trị gia dường như thường bị những người bình thường coi thường."
                    },
                    {
                        "en": "contempt for somebody/something They had shown a contempt for the values she thought important.",
                        "vi": "khinh miệt ai đó / điều gì đó Họ đã tỏ ra khinh thường những giá trị mà cô ấy cho là quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lack of worry or fear about rules, danger, etc.",
                    "vi": "thiếu lo lắng hoặc sợ hãi về các quy tắc, nguy hiểm, v.v."
                },
                "examples": [
                    {
                        "en": "The firefighters showed a contempt for their own safety.",
                        "vi": "Những người lính cứu hỏa tỏ ra khinh thường sự an toàn của chính họ."
                    },
                    {
                        "en": "His remarks betray a staggering contempt for the truth (= are completely false).",
                        "vi": "Những nhận xét của anh ta phản bội một sự khinh bỉ đáng kinh ngạc đối với sự thật (= hoàn toàn sai sự thật)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the crime of refusing to obey an order made by a court; not showing respect for a court or judge",
                    "vi": "tội từ chối tuân theo lệnh của tòa án; không thể hiện sự tôn trọng đối với tòa án hoặc thẩm phán"
                },
                "examples": [
                    {
                        "en": "He could be jailed for two years for contempt.",
                        "vi": "Anh ta có thể bị bỏ tù hai năm vì tội khinh thường."
                    },
                    {
                        "en": "in contempt She was held in contempt for refusing to testify.",
                        "vi": "trong sự khinh bỉ Cô ấy bị khinh thường vì đã từ chối làm chứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "knowing somebody/something very well may cause you to lose respect for them/it",
                    "vi": "biết rất rõ ai đó / điều gì đó có thể khiến bạn mất đi sự tôn trọng đối với họ / điều đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "22a62194ee5c44a6b06911bd4843c2fa",
        "word": "contemptuous",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈtemptʃuəs/",
            "us": "/kənˈtemptʃuəs/"
        },
        "nearby": [
            {
                "word": "contemptible",
                "pos": "adjective"
            },
            {
                "word": "contempt of court",
                "pos": "noun"
            },
            {
                "word": "contemptuous",
                "pos": "adjective"
            },
            {
                "word": "contemptuously",
                "pos": "adverb"
            },
            {
                "word": "contend",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing that you have no respect for somebody/something",
                    "vi": "cảm thấy hoặc thể hiện rằng bạn không tôn trọng ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She gave him a contemptuous look.",
                        "vi": "Cô nhìn anh đầy khinh thường."
                    },
                    {
                        "en": "The company has shown a contemptuous disregard for Henry’s complaints.",
                        "vi": "Công ty đã tỏ ra khinh thường những lời phàn nàn của Henry."
                    },
                    {
                        "en": "Her voice sounded almost contemptuous.",
                        "vi": "Giọng cô ấy có vẻ gần như khinh thường."
                    },
                    {
                        "en": "contemptuous of somebody/something He was contemptuous of everything I did.",
                        "vi": "khinh thường ai đó / điều gì đó Anh ấy khinh thường tất cả những gì tôi đã làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "201bd70fd20040049bd340da00b4e48e",
        "word": "disgust",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪsˈɡʌst/",
            "us": "/dɪsˈɡʌst/"
        },
        "nearby": [
            {
                "word": "disguise",
                "pos": "verb"
            },
            {
                "word": "disguise",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "verb"
            },
            {
                "word": "Disgusted, Tunbridge Wells",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of dislike for somebody/something that you feel is unacceptable, or for something that looks, smells, etc. unpleasant",
                    "vi": "cảm giác không thích mạnh mẽ đối với ai đó / điều gì đó mà bạn cảm thấy không thể chấp nhận được hoặc đối với thứ gì đó có vẻ ngoài, có mùi, v.v. khó chịu"
                },
                "examples": [
                    {
                        "en": "The idea fills me with disgust.",
                        "vi": "Ý tưởng làm tôi kinh tởm."
                    },
                    {
                        "en": "disgust for somebody I can only feel disgust for these criminals.",
                        "vi": "ghê tởm đối với ai đó Tôi chỉ có thể cảm thấy ghê tởm đối với những tên tội phạm này."
                    },
                    {
                        "en": "disgust at/with something She expressed her disgust at the programme in a tweet.",
                        "vi": "ghê tởm với / với điều gì đó Cô ấy bày tỏ sự ghê tởm của mình với chương trình trong một dòng tweet."
                    },
                    {
                        "en": "in disgust He walked away in disgust",
                        "vi": "trong sự kinh tởm Anh ta bỏ đi trong sự kinh tởm"
                    },
                    {
                        "en": "She wrinkled her nose in disgust at the smell.",
                        "vi": "Cô ấy nhăn mũi ghê tởm trước cái mùi đó."
                    },
                    {
                        "en": "with disgust He regarded the cubes of fat with disgust.",
                        "vi": "với sự ghê tởm Anh ta nhìn những khối chất béo một cách ghê tởm."
                    },
                    {
                        "en": "to somebody's disgust Much to my disgust, they refused to help.",
                        "vi": "đối với sự ghê tởm của ai đó Rất nhiều đối với sự ghê tởm của tôi, họ đã từ chối giúp đỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "22453bdbc57345e69aaa5ac4758f1e07",
        "word": "disgusted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪsˈɡʌstɪd/",
            "us": "/dɪsˈɡʌstɪd/"
        },
        "nearby": [
            {
                "word": "disgust",
                "pos": "verb"
            },
            {
                "word": "Disgusted, Tunbridge Wells",
                "pos": ""
            },
            {
                "word": "disgusted",
                "pos": "adjective"
            },
            {
                "word": "disgustedly",
                "pos": "adverb"
            },
            {
                "word": "disgusting",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing disgust",
                    "vi": "cảm thấy hoặc thể hiện sự ghê tởm"
                },
                "examples": [
                    {
                        "en": "disgusted (at/by somebody/something) I was disgusted at/by the sight.",
                        "vi": "ghê tởm (tại / bởi ai đó / cái gì đó) Tôi đã kinh tởm tại / bởi cảnh tượng."
                    },
                    {
                        "en": "disgusted (with somebody/something/yourself) I was disgusted with myself for eating so much.",
                        "vi": "ghê tởm (với ai đó / cái gì đó / chính bạn) Tôi đã kinh tởm bản thân mình vì đã ăn quá nhiều."
                    },
                    {
                        "en": "disgusted (to see, hear, etc…) He was disgusted to see such awful living conditions.",
                        "vi": "ghê tởm (nhìn thấy, nghe thấy, v.v.…) Anh ta ghê tởm khi thấy những điều kiện sống tồi tệ như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a1606df23a944cfba93c5b075ac1d43",
        "word": "horrified",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɒrɪfaɪd/",
            "us": "/ˈhɔːrɪfaɪd/"
        },
        "nearby": [
            {
                "word": "horrific",
                "pos": "adjective"
            },
            {
                "word": "horrifically",
                "pos": "adverb"
            },
            {
                "word": "horrified",
                "pos": "adjective"
            },
            {
                "word": "horrify",
                "pos": "verb"
            },
            {
                "word": "horrifying",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely shocked or frightened",
                    "vi": "cực kỳ sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "He was horrified when he discovered the conditions in which they lived.",
                        "vi": "Anh kinh hoàng khi phát hiện ra điều kiện sống của họ."
                    },
                    {
                        "en": "She gazed at him in horrified disbelief.",
                        "vi": "Cô kinh hoàng nhìn anh với vẻ hoài nghi."
                    }
                ]
            }
        ]
    },
    {
        "id": "07c29a0e96bb461cbf4054638f4f1a06",
        "word": "horrifying",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɒrɪfaɪɪŋ/",
            "us": "/ˈhɔːrɪfaɪɪŋ/"
        },
        "nearby": [
            {
                "word": "horrified",
                "pos": "adjective"
            },
            {
                "word": "horrify",
                "pos": "verb"
            },
            {
                "word": "horrifying",
                "pos": "adjective"
            },
            {
                "word": "horrifyingly",
                "pos": "adverb"
            },
            {
                "word": "horror",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel extremely shocked or frightened",
                    "vi": "khiến bạn cảm thấy vô cùng sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "a horrifying sight/experience/story",
                        "vi": "một cảnh tượng / trải nghiệm / câu chuyện kinh hoàng"
                    },
                    {
                        "en": "It's horrifying to see such poverty.",
                        "vi": "Thật kinh hoàng khi chứng kiến cảnh nghèo đói như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "56eae3e242de42ae805a1bff7242f4dd",
        "word": "abominable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbɒmɪnəbl/",
            "us": "/əˈbɑːmɪnəbl/"
        },
        "nearby": [
            {
                "word": "abolitionist",
                "pos": "noun"
            },
            {
                "word": "A-bomb",
                "pos": "noun"
            },
            {
                "word": "abominable",
                "pos": "adjective"
            },
            {
                "word": "Abominable Snowman",
                "pos": "noun"
            },
            {
                "word": "abominably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely unpleasant and causing horror",
                    "vi": "cực kỳ khó chịu và gây kinh dị"
                },
                "examples": [
                    {
                        "en": "The judge described the attack as an abominable crime.",
                        "vi": "Thẩm phán mô tả vụ tấn công là một tội ác ghê tởm."
                    },
                    {
                        "en": "We were served the most abominable coffee.",
                        "vi": "Chúng tôi đã được phục vụ cà phê ghê tởm nhất."
                    },
                    {
                        "en": "I think you are utterly selfish and your behaviour has been abominable.",
                        "vi": "Tôi nghĩ bạn hoàn toàn ích kỷ và hành vi của bạn thật đáng ghê tởm."
                    }
                ]
            }
        ]
    },
    {
        "id": "bdacebf316d14f3bb98417dc3574ef6a",
        "word": "abominate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbɒmɪneɪt/",
            "us": "/əˈbɑːmɪneɪt/"
        },
        "nearby": [
            {
                "word": "Abominable Snowman",
                "pos": "noun"
            },
            {
                "word": "abominably",
                "pos": "adverb"
            },
            {
                "word": "abominate",
                "pos": "verb"
            },
            {
                "word": "abomination",
                "pos": "noun"
            },
            {
                "word": "aboriginal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel deep hate or horror for something/somebody",
                    "vi": "cảm thấy căm ghét hoặc kinh hãi sâu sắc đối với một cái gì đó / ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c8fa22735c844138b77e66c2f2c3268",
        "word": "churn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɜːn/",
            "us": "/tʃɜːrn/"
        },
        "nearby": [
            {
                "word": "churlishly",
                "pos": "adverb"
            },
            {
                "word": "churlishness",
                "pos": "noun"
            },
            {
                "word": "churn",
                "pos": "verb"
            },
            {
                "word": "churn",
                "pos": "noun"
            },
            {
                "word": "churn out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if water, mud, etc. churns, or if something churns it (up), it moves or is moved around violently",
                    "vi": "nếu nước, bùn, v.v. khuấy động hoặc nếu có thứ gì đó khuấy động nó (lên), nó sẽ di chuyển hoặc di chuyển xung quanh một cách dữ dội"
                },
                "examples": [
                    {
                        "en": "churn (up) The water churned beneath the huge ship.",
                        "vi": "churn (lên) Nước khuấy bên dưới con tàu khổng lồ."
                    },
                    {
                        "en": "churn something (up) Vast crowds had churned the field into a sea of mud.",
                        "vi": "khuấy một cái gì đó (lên) Đám đông đông đảo đã biến cánh đồng thành một biển bùn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your stomach churns or if something churns your stomach, you feel a strong, unpleasant feeling of worry or fear",
                    "vi": "nếu dạ dày của bạn khuấy động hoặc nếu có thứ gì đó khuấy động dạ dày của bạn, bạn cảm thấy một cảm giác lo lắng hoặc sợ hãi mạnh mẽ, khó chịu"
                },
                "examples": [
                    {
                        "en": "My stomach churned as the names were read out.",
                        "vi": "Bụng tôi quặn lên khi những cái tên được đọc lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel upset or emotionally confused",
                    "vi": "để làm cho ai đó cảm thấy khó chịu hoặc cảm xúc bối rối"
                },
                "examples": [
                    {
                        "en": "It churns me up inside to think what might have happened.",
                        "vi": "Nó khuấy động tôi trong lòng để nghĩ về những gì có thể đã xảy ra."
                    },
                    {
                        "en": "Conflicting emotions churned inside him.",
                        "vi": "Những cảm xúc mâu thuẫn bùng lên trong anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn and mix milk in a special container in order to make butter",
                    "vi": "đảo và trộn sữa trong một hộp đựng đặc biệt để làm bơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6aa7d939c7ce4c288e48519bb41013cc",
        "word": "disgust",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪsˈɡʌst/",
            "us": "/dɪsˈɡʌst/"
        },
        "nearby": [
            {
                "word": "disguise",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "verb"
            },
            {
                "word": "Disgusted, Tunbridge Wells",
                "pos": ""
            },
            {
                "word": "disgusted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something disgusts you, it makes you feel shocked and almost sick because it is so unpleasant",
                    "vi": "Nếu điều gì đó khiến bạn chán ghét, nó sẽ khiến bạn cảm thấy sốc và gần như phát ốm vì nó quá khó chịu"
                },
                "examples": [
                    {
                        "en": "The level of violence in the film really disgusted me.",
                        "vi": "Mức độ bạo lực trong phim khiến tôi thực sự kinh tởm."
                    },
                    {
                        "en": "The feel of it, all cold and slimy, disgusted him.",
                        "vi": "Cảm giác lạnh lẽo và nhầy nhụa, khiến anh kinh tởm."
                    }
                ]
            }
        ]
    },
    {
        "id": "a4da331c5a5a4b64aba6d9e9f53b4cc3",
        "word": "gross-out",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrəʊs aʊt/",
            "us": "/ˈɡrəʊs aʊt/"
        },
        "nearby": [
            {
                "word": "grossness",
                "pos": "noun"
            },
            {
                "word": "gross out",
                "pos": "phrasal verb"
            },
            {
                "word": "gross-out",
                "pos": "noun"
            },
            {
                "word": "gross-out",
                "pos": "adjective"
            },
            {
                "word": "Grosvenor Square",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something horrible",
                    "vi": "một cái gì đó khủng khiếp"
                },
                "examples": [
                    {
                        "en": "They eat flies? What a gross-out!",
                        "vi": "Họ ăn ruồi? Thật là một tổng kết!"
                    }
                ]
            }
        ]
    },
    {
        "id": "33e9fd0a95e54e6d9d92266800e4bbcb",
        "word": "gross-out",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrəʊs aʊt/",
            "us": "/ˈɡrəʊs aʊt/"
        },
        "nearby": [
            {
                "word": "gross out",
                "pos": "phrasal verb"
            },
            {
                "word": "gross-out",
                "pos": "noun"
            },
            {
                "word": "gross-out",
                "pos": "adjective"
            },
            {
                "word": "Grosvenor Square",
                "pos": ""
            },
            {
                "word": "grot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "horrible",
                    "vi": "tệ hại"
                },
                "examples": [
                    {
                        "en": "gross-out movie scenes",
                        "vi": "cảnh phim kinh khủng"
                    }
                ]
            }
        ]
    },
    {
        "id": "636bfd997bc34a66984548ca67ec4132",
        "word": "horror-struck",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒrə strʌk/",
            "us": "/ˈhɔːrər strʌk/"
        },
        "nearby": [
            {
                "word": "horror",
                "pos": "noun"
            },
            {
                "word": "horror story",
                "pos": "noun"
            },
            {
                "word": "horror-struck",
                "pos": "adjective"
            },
            {
                "word": "hors de combat",
                "pos": "adjective"
            },
            {
                "word": "hors d'oeuvre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "suddenly feeling very shocked or frightened",
                    "vi": "đột nhiên cảm thấy rất sốc hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "He stared, horror-struck at the sight.",
                        "vi": "Anh nhìn chằm chằm, kinh hoàng trước cảnh tượng đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "e2a22f977a3e44688a7d0a3d6c9e67f7",
        "word": "loathsome",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈləʊðsəm/",
            "us": "/ˈləʊðsəm/"
        },
        "nearby": [
            {
                "word": "loathe",
                "pos": "verb"
            },
            {
                "word": "loathing",
                "pos": "noun"
            },
            {
                "word": "loathsome",
                "pos": "adjective"
            },
            {
                "word": "loaves",
                "pos": "noun"
            },
            {
                "word": "lob",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely unpleasant; disgusting",
                    "vi": "cực kì khó chịu; kinh tởm"
                },
                "examples": [
                    {
                        "en": "The police described it as one of the most loathsome crimes of recent years.",
                        "vi": "Cảnh sát mô tả đây là một trong những tội ác ghê tởm nhất trong những năm gần đây."
                    },
                    {
                        "en": "Police described the murderer as ‘a foul and loathsome beast’.",
                        "vi": "Cảnh sát mô tả kẻ sát nhân là 'một con thú xấu xa và đáng ghét'."
                    },
                    {
                        "en": "This was a loathsome crime against innocent people.",
                        "vi": "Đây là một tội ác ghê tởm đối với những người vô tội."
                    }
                ]
            }
        ]
    },
    {
        "id": "815c70bc992f4f74b307f98c29a61df2",
        "word": "make your flesh creep",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/fleʃ/",
            "us": "/fleʃ/"
        },
        "nearby": [
            {
                "word": "Flemish",
                "pos": "noun"
            },
            {
                "word": "Flemish",
                "pos": "adjective"
            },
            {
                "word": "flesh",
                "pos": "noun"
            },
            {
                "word": "flesh",
                "pos": "verb"
            },
            {
                "word": "fleshly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the soft substance between the skin and bones of animal or human bodies",
                    "vi": "chất mềm giữa da và xương của cơ thể động vật hoặc con người"
                },
                "examples": [
                    {
                        "en": "The trap had cut deeply into the rabbit's flesh.",
                        "vi": "Cái bẫy đã cắt sâu vào thịt con thỏ."
                    },
                    {
                        "en": "Tigers are flesh-eating animals.",
                        "vi": "Hổ là loài động vật ăn thịt."
                    },
                    {
                        "en": "the smell of rotting flesh",
                        "vi": "mùi của thịt thối rữa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the skin of the human body",
                    "vi": "da của cơ thể con người"
                },
                "examples": [
                    {
                        "en": "His fingers closed around the soft flesh of her arm.",
                        "vi": "Ngón tay anh khép lại phần da thịt mềm mại trên cánh tay cô."
                    },
                    {
                        "en": "flesh-coloured (= a light brownish pink colour)",
                        "vi": "màu thịt (= màu hồng nâu nhạt)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the soft part of fruit and vegetables, especially when it is eaten",
                    "vi": "phần mềm của trái cây và rau quả, đặc biệt là khi nó được ăn"
                },
                "examples": [
                    {
                        "en": "the sweet flesh of a mango",
                        "vi": "thịt ngọt của xoài"
                    },
                    {
                        "en": "Cut the melon in half and scoop out the flesh.",
                        "vi": "Cắt đôi quả dưa và nạo lấy phần thịt quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "the human body when considering its physical and sexual needs, rather than the mind or soul",
                    "vi": "cơ thể con người khi xem xét nhu cầu thể chất và tình dục của nó, thay vì tâm trí hoặc linh hồn"
                },
                "examples": [
                    {
                        "en": "the pleasures/sins of the flesh",
                        "vi": "thú vui / tội lỗi của xác thịt"
                    },
                    {
                        "en": "His moral sermons always denounced the lusts of the flesh.",
                        "vi": "Những bài giảng đạo đức của ông luôn tố cáo những ham muốn của xác thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to die",
                    "vi": "chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you see somebody in the flesh, you are in the same place as them and actually see them rather than just seeing a picture of them",
                    "vi": "nếu bạn nhìn thấy ai đó bằng xương bằng thịt, bạn đang ở cùng một nơi với họ và thực sự nhìn thấy họ hơn là chỉ nhìn thấy một bức ảnh của họ"
                },
                "examples": [
                    {
                        "en": "Thousands of fans gathered to see the band in the flesh.",
                        "vi": "Hàng nghìn người hâm mộ đã tụ tập để được nhìn thấy ban nhạc bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel afraid or full of horror",
                    "vi": "làm cho bạn cảm thấy sợ hãi hoặc kinh hoàng"
                },
                "examples": [
                    {
                        "en": "Just the sight of him makes my flesh creep.",
                        "vi": "Chỉ nhìn thấy anh ấy thôi cũng khiến da thịt tôi rùng mình."
                    },
                    {
                        "en": "The story made his flesh creep.",
                        "vi": "Câu chuyện khiến da thịt anh rợn người."
                    }
                ]
            },
            {
                "define": {
                    "en": "the full amount that somebody owes you, even if this will cause them trouble or difficulty",
                    "vi": "toàn bộ số tiền mà ai đó nợ bạn, ngay cả khi điều này sẽ khiến họ gặp rắc rối hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "You’re determined to have your pound of flesh, aren’t you?",
                        "vi": "Bạn quyết tâm có được một cân thịt của mình, phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say hello to people by shaking hands",
                    "vi": "chào mọi người bằng cách bắt tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to develop a basic idea, etc. by giving more details to make it more complete",
                    "vi": "để phát triển một ý tưởng cơ bản, v.v. bằng cách cung cấp thêm chi tiết để làm cho nó hoàn thiện hơn"
                },
                "examples": [
                    {
                        "en": "The strength of the book is that it puts flesh on the bare bones of this argument.",
                        "vi": "Điểm mạnh của cuốn sách là nó đặt da thịt vào phần xương trần của lập luận này."
                    }
                ]
            },
            {
                "define": {
                    "en": "you intend to do good things but you are too lazy, weak or busy to actually do them",
                    "vi": "bạn có ý định làm những điều tốt nhưng bạn quá lười biếng, yếu đuối hoặc bận rộn để thực sự làm chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that repeatedly annoys somebody or stops them from doing something",
                    "vi": "một người hoặc một việc liên tục làm phiền ai đó hoặc ngăn họ làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2aa0ca9ea4d84d95acd08631d5e46e99",
        "word": "make your skin crawl",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/skɪn/",
            "us": "/skɪn/"
        },
        "nearby": [
            {
                "word": "skimp",
                "pos": "verb"
            },
            {
                "word": "skimpy",
                "pos": "adjective"
            },
            {
                "word": "skin",
                "pos": "noun"
            },
            {
                "word": "skin",
                "pos": "verb"
            },
            {
                "word": "skincare",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the layer of tissue that covers the body",
                    "vi": "lớp mô bao phủ cơ thể"
                },
                "examples": [
                    {
                        "en": "to have dark/pale skin",
                        "vi": "có làn da tối / nhợt nhạt"
                    },
                    {
                        "en": "skin cancer",
                        "vi": "ung thư da"
                    },
                    {
                        "en": "She said she was treated unfairly because of the colour of her skin.",
                        "vi": "Cô cho biết mình bị đối xử không công bằng vì màu da của mình."
                    },
                    {
                        "en": "skin colour/tone",
                        "vi": "màu da / tông màu"
                    },
                    {
                        "en": "to have brown/fair/olive skin",
                        "vi": "để có làn da nâu / trắng / ô liu"
                    },
                    {
                        "en": "to have dry/oily skin",
                        "vi": "có làn da khô / nhờn"
                    },
                    {
                        "en": "cosmetics for sensitive skins",
                        "vi": "mỹ phẩm cho da nhạy cảm"
                    },
                    {
                        "en": "The snake sheds its skin once a year.",
                        "vi": "Rắn lột da mỗi năm một lần."
                    },
                    {
                        "en": "They were both soaked to the skin and shivering from cold.",
                        "vi": "Cả hai đều ướt sũng da và rùng mình vì lạnh."
                    },
                    {
                        "en": "He could feel the sun on his skin.",
                        "vi": "Anh có thể cảm nhận được ánh nắng trên da mình."
                    },
                    {
                        "en": "the wrinkled skin of his face",
                        "vi": "da mặt nhăn nheo"
                    },
                    {
                        "en": "dead skin cells",
                        "vi": "tế bào da chết"
                    },
                    {
                        "en": "to have a skin test",
                        "vi": "kiểm tra da"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of skin mentioned",
                    "vi": "có loại da được đề cập"
                },
                "examples": [
                    {
                        "en": "dark-skinned",
                        "vi": "da ngăm đen"
                    },
                    {
                        "en": "fair-skinned",
                        "vi": "da trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the skin of a dead animal with or without its fur, used for making leather, etc.",
                    "vi": "da của động vật chết có hoặc không có lông, dùng để làm da, v.v."
                },
                "examples": [
                    {
                        "en": "The skins are removed and laid out to dry.",
                        "vi": "Da được lấy ra và đặt ra để khô."
                    },
                    {
                        "en": "animal skins",
                        "vi": "da động vật"
                    },
                    {
                        "en": "a tiger-skin rug",
                        "vi": "một tấm thảm da hổ"
                    },
                    {
                        "en": "skin of something They would wear the skins of animals they had killed.",
                        "vi": "da của một thứ gì đó Họ sẽ mặc da của những con vật mà họ đã giết."
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer layer of some fruits and vegetables",
                    "vi": "lớp ngoài của một số loại trái cây và rau quả"
                },
                "examples": [
                    {
                        "en": "Remove the skins by soaking the tomatoes in hot water.",
                        "vi": "Bỏ vỏ bằng cách ngâm cà chua trong nước nóng."
                    },
                    {
                        "en": "a chemical found in the skin of grapes",
                        "vi": "một chất hóa học được tìm thấy trong vỏ của quả nho"
                    }
                ]
            },
            {
                "define": {
                    "en": "the thin outer layer of a sausage",
                    "vi": "lớp ngoài mỏng của xúc xích"
                },
                "examples": [
                    {
                        "en": "Prick the skins before grilling.",
                        "vi": "Cạo da trước khi nướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the thin layer that forms on the surface of some liquids, especially when they become cold after being heated",
                    "vi": "lớp mỏng hình thành trên bề mặt của một số chất lỏng, đặc biệt là khi chúng trở nên lạnh đi sau khi được làm nóng"
                },
                "examples": [
                    {
                        "en": "A skin had formed on the top of the milk.",
                        "vi": "Một lớp da đã hình thành trên mặt sữa."
                    },
                    {
                        "en": "She skimmed the skin off the cocoa.",
                        "vi": "Cô ấy tách vỏ khỏi ca cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer that covers the outside of something",
                    "vi": "một lớp bao phủ bên ngoài của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the outer skin of the earth",
                        "vi": "vỏ ngoài của trái đất"
                    },
                    {
                        "en": "the metal skin of the aircraft",
                        "vi": "vỏ kim loại của máy bay"
                    }
                ]
            },
            {
                "define": {
                    "en": "a special cover for any small electronic device that you can carry with you",
                    "vi": "một vỏ bọc đặc biệt cho bất kỳ thiết bị điện tử nhỏ nào mà bạn có thể mang theo bên mình"
                },
                "examples": [
                    {
                        "en": "Do phone skins protect your phone?",
                        "vi": "Vỏ điện thoại có bảo vệ điện thoại của bạn không?"
                    },
                    {
                        "en": "You can create your own custom skin for your iPod.",
                        "vi": "Bạn có thể tạo giao diện tùy chỉnh của riêng mình cho iPod của mình."
                    },
                    {
                        "en": "The skin has a clear protective layer.",
                        "vi": "Da có một lớp bảo vệ rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the interface of a computer program (= the way a computer program presents information on screen), that the user can change as they wish",
                    "vi": "giao diện của chương trình máy tính (= cách chương trình máy tính trình bày thông tin trên màn hình) mà người dùng có thể thay đổi theo ý muốn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you do something by the skin of your teeth, you only just manage to do it",
                    "vi": "nếu bạn làm một điều gì đó bằng đầu trong răng của bạn, bạn chỉ có thể làm điều đó"
                },
                "examples": [
                    {
                        "en": "He escaped defeat by the skin of his teeth.",
                        "vi": "Anh ta đã thoát khỏi thất bại bằng cách sở hữu hàm răng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "Don't let him get under your skin.",
                        "vi": "Đừng để anh ấy có được dưới da của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely attracted to somebody",
                    "vi": "cực kỳ bị thu hút bởi ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody is not upset or annoyed about something because it does not affect them in a bad way",
                    "vi": "được sử dụng để nói rằng ai đó không buồn hoặc khó chịu về điều gì đó bởi vì nó không ảnh hưởng đến họ theo cách xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to move violently because of a sudden shock",
                    "vi": "di chuyển dữ dội vì một cú sốc đột ngột"
                },
                "examples": [
                    {
                        "en": "She nearly jumped out of her skin when she saw me.",
                        "vi": "Cô ấy gần như nổi hết da gà khi nhìn thấy tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel afraid or full of horror",
                    "vi": "làm cho bạn cảm thấy sợ hãi hoặc kinh hoàng"
                },
                "examples": [
                    {
                        "en": "Just the sight of him makes my skin crawl.",
                        "vi": "Chỉ nhìn thấy anh ấy thôi cũng khiến tôi nổi da gà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to avoid death, punishment, etc., especially by leaving others in an extremely difficult situation",
                    "vi": "để cố gắng tránh cái chết, sự trừng phạt, v.v., đặc biệt là bằng cách bỏ rơi người khác trong một tình huống cực kỳ khó khăn"
                },
                "examples": [
                    {
                        "en": "To save his own skin, he lied and blamed the accident on his friend.",
                        "vi": "Để cứu lấy làn da của chính mình, anh đã nói dối và đổ lỗi tai nạn cho bạn mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely thin in a way that is not attractive or healthy",
                    "vi": "cực kỳ gầy theo cách không hấp dẫn hoặc không tốt cho sức khỏe"
                },
                "examples": [
                    {
                        "en": "The dog lost more and more weight, and was soon little more than skin and bone.",
                        "vi": "Con chó ngày càng sụt cân, chẳng mấy chốc chỉ còn da bọc xương."
                    },
                    {
                        "en": "He's all skin and bone after his illness.",
                        "vi": "Anh ấy chỉ còn da bọc xương sau trận ốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to accept criticism, offensive remarks, etc. without becoming upset",
                    "vi": "khả năng chấp nhận những lời chỉ trích, nhận xét xúc phạm, v.v. mà không trở nên khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the lack of ability to accept criticism, offensive remarks, etc. without becoming upset",
                    "vi": "thiếu khả năng chấp nhận những lời chỉ trích, nhận xét xúc phạm, v.v. mà không trở nên khó chịu"
                },
                "examples": [
                    {
                        "en": "You shouldn’t be in politics if you have such a thin skin.",
                        "vi": "Bạn không nên tham gia chính trị nếu bạn có một làn da mỏng như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "a1c75da65f184c41bd91ad126abfeb0a",
        "word": "repel",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpel/",
            "us": "/rɪˈpel/"
        },
        "nearby": [
            {
                "word": "repeater",
                "pos": "noun"
            },
            {
                "word": "repeating decimal",
                "pos": "noun"
            },
            {
                "word": "repel",
                "pos": "verb"
            },
            {
                "word": "repellent",
                "pos": "adjective"
            },
            {
                "word": "repellent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to successfully fight somebody who is attacking you, your country, etc. and drive them away",
                    "vi": "để chống lại thành công ai đó đang tấn công bạn, đất nước của bạn, v.v. và xua đuổi họ"
                },
                "examples": [
                    {
                        "en": "to repel an attack/invasion/invader",
                        "vi": "để đẩy lùi một cuộc tấn công / xâm lược / kẻ xâm lược"
                    },
                    {
                        "en": "Troops repelled an attempt to infiltrate the south of the island.",
                        "vi": "Quân đội đã đẩy lùi một nỗ lực xâm nhập vào phía nam của hòn đảo."
                    },
                    {
                        "en": "(figurative) The reptile's prickly skin repels nearly all of its predators.",
                        "vi": "(nghĩa bóng) Lớp da đầy gai của loài bò sát này có tác dụng xua đuổi gần như tất cả những kẻ săn mồi của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drive, push or keep something away",
                    "vi": "để lái xe, đẩy hoặc giữ một cái gì đó đi"
                },
                "examples": [
                    {
                        "en": "a cream that repels insects",
                        "vi": "một loại kem xua đuổi côn trùng"
                    },
                    {
                        "en": "The fabric has been treated to repel water.",
                        "vi": "Vải đã được xử lý để chống thấm nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel horror or disgust",
                    "vi": "để làm cho ai đó cảm thấy kinh dị hoặc ghê tởm"
                },
                "examples": [
                    {
                        "en": "I was repelled by the smell.",
                        "vi": "Tôi đã bị đẩy lùi bởi mùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if one thing repels another, or if two things repel each other, an electrical or magnetic force pushes them apart",
                    "vi": "nếu một vật đẩy nhau, hoặc nếu hai vật đẩy nhau, thì lực điện hoặc lực từ sẽ đẩy chúng ra xa nhau"
                },
                "examples": [
                    {
                        "en": "Like poles repel each other.",
                        "vi": "Giống như các cực đẩy nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa1b46e8a5874cd3b8bc441fb2133d53",
        "word": "repugnance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpʌɡnəns/",
            "us": "/rɪˈpʌɡnəns/"
        },
        "nearby": [
            {
                "word": "repudiation",
                "pos": "noun"
            },
            {
                "word": "repudiatory",
                "pos": "adjective"
            },
            {
                "word": "repugnance",
                "pos": "noun"
            },
            {
                "word": "repugnant",
                "pos": "adjective"
            },
            {
                "word": "repulse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very strong feeling of dislike for something",
                    "vi": "một cảm giác rất mạnh mẽ của không thích một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was trying to overcome her physical repugnance for him.",
                        "vi": "Cô đang cố gắng vượt qua nỗi ám ảnh về thể xác của mình dành cho anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e4cfbb4a4d242b3a373751aea7e385d",
        "word": "repugnant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpʌɡnənt/",
            "us": "/rɪˈpʌɡnənt/"
        },
        "nearby": [
            {
                "word": "repudiatory",
                "pos": "adjective"
            },
            {
                "word": "repugnance",
                "pos": "noun"
            },
            {
                "word": "repugnant",
                "pos": "adjective"
            },
            {
                "word": "repulse",
                "pos": "verb"
            },
            {
                "word": "repulsion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel strong dislike",
                    "vi": "khiến bạn cảm thấy không thích"
                },
                "examples": [
                    {
                        "en": "We found his suggestion absolutely repugnant.",
                        "vi": "Chúng tôi thấy đề nghị của anh ấy hoàn toàn đáng chê trách."
                    },
                    {
                        "en": "repugnant to somebody The idea of eating meat was repugnant to her.",
                        "vi": "sự ghê tởm đối với ai đó Ý tưởng về việc ăn thịt là sự ghê tởm đối với cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "5a598e8382ac4437aa31a99294e7423c",
        "word": "repulse",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpʌls/",
            "us": "/rɪˈpʌls/"
        },
        "nearby": [
            {
                "word": "repugnance",
                "pos": "noun"
            },
            {
                "word": "repugnant",
                "pos": "adjective"
            },
            {
                "word": "repulse",
                "pos": "verb"
            },
            {
                "word": "repulsion",
                "pos": "noun"
            },
            {
                "word": "repulsive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel strong dislike",
                    "vi": "làm cho ai đó cảm thấy không thích"
                },
                "examples": [
                    {
                        "en": "I was repulsed by the horrible smell.",
                        "vi": "Tôi đã bị đẩy lùi bởi mùi kinh khủng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight somebody who is attacking you and drive them away",
                    "vi": "để chống lại ai đó đang tấn công bạn và xua đuổi họ"
                },
                "examples": [
                    {
                        "en": "to repulse an attack/invasion/offensive",
                        "vi": "để đẩy lùi một cuộc tấn công / xâm lược / tấn công"
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to accept somebody’s help, attempts to be friendly, etc.",
                    "vi": "từ chối nhận sự giúp đỡ của ai đó, cố gắng tỏ ra thân thiện, v.v."
                },
                "examples": [
                    {
                        "en": "Each time I tried to help I was repulsed.",
                        "vi": "Mỗi lần tôi cố gắng giúp tôi đều bị đẩy lùi."
                    },
                    {
                        "en": "She repulsed his advances.",
                        "vi": "Cô đẩy lùi những bước tiến của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "60ece048b763443c9440c616c15fe9cd",
        "word": "revolt",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈvəʊlt/",
            "us": "/rɪˈvəʊlt/"
        },
        "nearby": [
            {
                "word": "revoke",
                "pos": "verb"
            },
            {
                "word": "revolt",
                "pos": "noun"
            },
            {
                "word": "revolt",
                "pos": "verb"
            },
            {
                "word": "revolting",
                "pos": "adjective"
            },
            {
                "word": "revoltingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take violent action against the people in power",
                    "vi": "có hành động bạo lực chống lại những người nắm quyền"
                },
                "examples": [
                    {
                        "en": "The peasants threatened to revolt.",
                        "vi": "Nông dân bị đe dọa khởi nghĩa."
                    },
                    {
                        "en": "revolt against somebody/something Finally the people revolted against the military dictatorship.",
                        "vi": "cuộc nổi dậy chống lại ai đó / cái gì đó Cuối cùng người dân cũng nổi dậy chống lại chế độ độc tài quân sự."
                    },
                    {
                        "en": "The peasants revolted against high taxes and the losses of the war.",
                        "vi": "Nông dân nổi dậy chống lại thuế cao và những mất mát của chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is the opposite of what somebody expects of you, especially in protest",
                    "vi": "cư xử theo cách trái ngược với những gì ai đó mong đợi ở bạn, đặc biệt là phản đối"
                },
                "examples": [
                    {
                        "en": "Teenagers often revolt against parental discipline.",
                        "vi": "Thanh thiếu niên thường nổi dậy chống lại kỷ luật của cha mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel horror",
                    "vi": "làm cho bạn cảm thấy kinh dị"
                },
                "examples": [
                    {
                        "en": "All the violence in the movie revolted me.",
                        "vi": "Tất cả những cảnh bạo lực trong phim đều khiến tôi nổi loạn."
                    },
                    {
                        "en": "The way he ate his food revolted me.",
                        "vi": "Cách anh ấy ăn thức ăn của anh ấy đã phản đối tôi."
                    },
                    {
                        "en": "She was revolted by the smell of stale beer and vomit in the room.",
                        "vi": "Cô ấy nổi loạn bởi mùi bia hôi thối và nôn mửa trong phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "77372824c284457a9e39262957d670de",
        "word": "revulsion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈvʌlʃn/",
            "us": "/rɪˈvʌlʃn/"
        },
        "nearby": [
            {
                "word": "revolving door",
                "pos": "noun"
            },
            {
                "word": "revue",
                "pos": "noun"
            },
            {
                "word": "revulsion",
                "pos": "noun"
            },
            {
                "word": "reward",
                "pos": "noun"
            },
            {
                "word": "reward",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of horror",
                    "vi": "một cảm giác kinh hoàng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Most people viewed the bombings with revulsion.",
                        "vi": "Hầu hết mọi người xem các vụ đánh bom với sự phẫn nộ."
                    },
                    {
                        "en": "revulsion at something She felt a deep sense of revulsion at the violence.",
                        "vi": "sợ hãi trước một cái gì đó Cô cảm thấy ghê tởm sâu sắc trước bạo lực."
                    },
                    {
                        "en": "revulsion against something I started to feel a revulsion against their decadent lifestyle.",
                        "vi": "sự ghê tởm đối với một thứ gì đó Tôi bắt đầu cảm thấy ghê tởm đối với lối sống suy đồi của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e3928380ac6c40059b094f6c8fe031a3",
        "word": "self-loathing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself ˈləʊðɪŋ/",
            "us": "/ˌself ˈləʊðɪŋ/"
        },
        "nearby": [
            {
                "word": "selflessly",
                "pos": "adverb"
            },
            {
                "word": "selflessness",
                "pos": "noun"
            },
            {
                "word": "self-loathing",
                "pos": "noun"
            },
            {
                "word": "self-love",
                "pos": "noun"
            },
            {
                "word": "self-made",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of hating yourself",
                    "vi": "một cảm giác ghét bản thân mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His difficult childhood left him with a deep sense of self-loathing.",
                        "vi": "Tuổi thơ khó khăn đã để lại cho anh một cảm giác ghê tởm bản thân sâu sắc."
                    }
                ]
            }
        ]
    },
    {
        "id": "722d7759614c44828671c6d4e2398f5b",
        "word": "sickness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪknəs/",
            "us": "/ˈsɪknəs/"
        },
        "nearby": [
            {
                "word": "sickly",
                "pos": "adjective"
            },
            {
                "word": "sick-making",
                "pos": "adjective"
            },
            {
                "word": "sickness",
                "pos": "noun"
            },
            {
                "word": "sickness benefit",
                "pos": "noun"
            },
            {
                "word": "sicko",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "illness; bad health",
                    "vi": "Cơn bệnh; sức khỏe yếu"
                },
                "examples": [
                    {
                        "en": "She's been off work because of sickness.",
                        "vi": "Cô ấy đã nghỉ làm vì bị ốm."
                    },
                    {
                        "en": "insurance against sickness and unemployment",
                        "vi": "bảo hiểm ốm đau và thất nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of illness or disease",
                    "vi": "một loại bệnh tật hoặc bệnh tật cụ thể"
                },
                "examples": [
                    {
                        "en": "travel/radiation sickness",
                        "vi": "du lịch / bệnh bức xạ"
                    },
                    {
                        "en": "a sickness common in the tropics",
                        "vi": "một căn bệnh phổ biến ở vùng nhiệt đới"
                    },
                    {
                        "en": "This activity may induce motion sickness.",
                        "vi": "Hoạt động này có thể gây say tàu xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling that you are likely to vomit (= bring food back up from the stomach to the mouth); the fact of vomiting",
                    "vi": "cảm giác rằng bạn có khả năng bị nôn (= đưa thức ăn trở lại từ dạ dày lên miệng); thực tế là nôn mửa"
                },
                "examples": [
                    {
                        "en": "symptoms include sickness and diarrhoea",
                        "vi": "các triệu chứng bao gồm ốm và tiêu chảy"
                    },
                    {
                        "en": "The sickness passed off after a while.",
                        "vi": "Một thời gian sau cơn bệnh cũng qua đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of being very sad, disappointed or full of horror",
                    "vi": "cảm giác rất buồn, thất vọng hoặc đầy kinh hoàng"
                },
                "examples": [
                    {
                        "en": "He felt a sickness rise in him at the thought of leaving.",
                        "vi": "Anh cảm thấy một cơn bệnh bùng lên khi nghĩ đến việc phải ra đi."
                    }
                ]
            }
        ]
    }
]