[
    {
        "id": "13daac80336a49c2afd736257163d364",
        "word": "incisive",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈsaɪsɪv/",
            "us": "/ɪnˈsaɪsɪv/"
        },
        "nearby": [
            {
                "word": "incise",
                "pos": "verb"
            },
            {
                "word": "incision",
                "pos": "noun"
            },
            {
                "word": "incisive",
                "pos": "adjective"
            },
            {
                "word": "incisively",
                "pos": "adverb"
            },
            {
                "word": "incisiveness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing clear thought and good understanding of what is important, and the ability to express this",
                    "vi": "thể hiện suy nghĩ rõ ràng và hiểu rõ điều gì là quan trọng và khả năng diễn đạt điều này"
                },
                "examples": [
                    {
                        "en": "incisive comments/criticism/analysis",
                        "vi": "nhận xét / phê bình / phân tích sâu sắc"
                    },
                    {
                        "en": "He had a clear, incisive mind.",
                        "vi": "Anh ta có một đầu óc minh mẫn, nhạy bén."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing somebody’s ability to take decisions and act with force",
                    "vi": "cho thấy khả năng của ai đó để đưa ra quyết định và hành động bằng vũ lực"
                },
                "examples": [
                    {
                        "en": "an incisive performance",
                        "vi": "một màn trình diễn sâu sắc"
                    }
                ]
            }
        ]
    },
    {
        "id": "6dbeffe54cb345a4be1e90fe7a726537",
        "word": "in somebody’s favour",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfeɪvə(r)/",
            "us": "/ˈfeɪvər/"
        },
        "nearby": [
            {
                "word": "favela",
                "pos": "noun"
            },
            {
                "word": "favicon",
                "pos": "noun"
            },
            {
                "word": "favour",
                "pos": "noun"
            },
            {
                "word": "favour",
                "pos": "verb"
            },
            {
                "word": "favourability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that you do to help somebody",
                    "vi": "một điều mà bạn làm để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "Could you do me a favour and pick up Sam from school today?",
                        "vi": "Bạn có thể giúp tôi một việc và đón Sam từ trường hôm nay được không?"
                    },
                    {
                        "en": "Can I ask a favour?",
                        "vi": "Tôi có thể yêu cầu một đặc ân?"
                    },
                    {
                        "en": "I would never ask for any favours from her.",
                        "vi": "Tôi sẽ không bao giờ yêu cầu bất kỳ sự ưu ái nào từ cô ấy."
                    },
                    {
                        "en": "I'll ask Steve to take it. He owes me a favour.",
                        "vi": "Tôi sẽ yêu cầu Steve lấy nó. Anh ấy nợ tôi một ân huệ."
                    },
                    {
                        "en": "Thanks for helping me out. I'll return the favour (= help you because you have helped me) some time.",
                        "vi": "Cảm ơn vì đã giúp tôi ra ngoài. Tôi sẽ trả ơn (= giúp bạn vì bạn đã giúp tôi) một lúc nào đó."
                    },
                    {
                        "en": "as a favour (to somebody) I'm going as a favour to Ann, not because I want to.",
                        "vi": "như một ân huệ (cho ai đó) Tôi sẽ ưu ái Ann, không phải vì tôi muốn."
                    },
                    {
                        "en": "Do yourself a favour (= help yourself) and wear a helmet on the bike.",
                        "vi": "Hãy tự giúp mình (= tự giúp mình) và đội mũ bảo hiểm trên xe đạp."
                    }
                ]
            },
            {
                "define": {
                    "en": "approval or support for somebody/something",
                    "vi": "sự chấp thuận hoặc hỗ trợ cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Artists sought the favour of wealthy patrons.",
                        "vi": "Các nghệ sĩ tìm kiếm sự ưu ái của những người bảo trợ giàu có."
                    },
                    {
                        "en": "favour with somebody The suggestion to close the road has found favour with (= been supported by) local people.",
                        "vi": "ủng hộ ai đó Đề xuất đóng đường đã được (= được) người dân địa phương ủng hộ."
                    },
                    {
                        "en": "to gain/win/lose favour with somebody",
                        "vi": "giành được / thắng / mất ưu ái với ai đó"
                    },
                    {
                        "en": "The programme has lost favour with viewers recently.",
                        "vi": "Chương trình mất dần thiện cảm với người xem trong thời gian gần đây."
                    },
                    {
                        "en": "favour among somebody The policy is gaining favour among voters.",
                        "vi": "sự ủng hộ của ai đó Chính sách đang được các cử tri ủng hộ."
                    },
                    {
                        "en": "in favour (with somebody) She's not in favour with (= supported or liked by) the media just now.",
                        "vi": "ủng hộ (với ai đó) Cô ấy không ủng hộ (= được ủng hộ hoặc thích bởi) phương tiện truyền thông vừa rồi."
                    },
                    {
                        "en": "It seems Tim is back in favour with the boss (= the boss likes him again).",
                        "vi": "Có vẻ như Tim quay lại với ông chủ (= ông chủ lại thích anh ta)."
                    },
                    {
                        "en": "out of favour (with somebody) Reality TV has begun to fall out of favour with viewers.",
                        "vi": "không được ưa chuộng (với ai đó) Truyền hình thực tế đã bắt đầu không được người xem ưa chuộng."
                    },
                    {
                        "en": "an athlete who fell from favour after a drugs scandal",
                        "vi": "một vận động viên bị thất sủng sau vụ bê bối ma túy"
                    },
                    {
                        "en": "(formal) The government looks with favour upon (= approves of) the report's recommendations.",
                        "vi": "(chính thức) Chính phủ ủng hộ (= chấp thuận) các khuyến nghị của báo cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "treatment that is generous to one person or group in a way that seems unfair to others",
                    "vi": "đối xử rộng lượng với một người hoặc một nhóm theo cách có vẻ không công bằng với những người khác"
                },
                "examples": [
                    {
                        "en": "As an examiner, she showed no favour to any candidate.",
                        "vi": "Với tư cách là giám khảo, cô tỏ ra không hề ưu ái bất kỳ thí sinh nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small gift given to children at a party",
                    "vi": "một món quà nhỏ cho trẻ em trong một bữa tiệc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "agreement to have sex with somebody",
                    "vi": "đồng ý quan hệ tình dục với ai đó"
                },
                "examples": [
                    {
                        "en": "demands for sexual favours",
                        "vi": "nhu cầu ủng hộ tình dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "you are likely to succeed because the conditions are good and you have an advantage",
                    "vi": "bạn có khả năng thành công vì điều kiện tốt và bạn có lợi thế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to get somebody to like or support you by praising or helping them a lot",
                    "vi": "để cố gắng khiến ai đó thích hoặc ủng hộ bạn bằng cách khen ngợi hoặc giúp đỡ họ thật nhiều"
                },
                "examples": [
                    {
                        "en": "He’s always trying to curry favour with the boss.",
                        "vi": "Anh ấy luôn cố gắng lấy lòng ông chủ."
                    },
                    {
                        "en": "He tried to curry favour with the teachers.",
                        "vi": "Anh cố gắng lấy lòng các giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in reply to a question that you think is silly",
                    "vi": "được sử dụng để trả lời một câu hỏi mà bạn nghĩ là ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "‘Do you think they'll win?’ ‘Do me a favour! They haven't got a single decent player.’",
                        "vi": "Bạn có nghĩ họ sẽ thắng không?' 'Giúp tôi một việc! Họ không có một cầu thủ tử tế nào. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is not helpful to somebody or that gives a bad impression of them",
                    "vi": "làm điều gì đó không hữu ích cho ai đó hoặc gây ấn tượng xấu về họ"
                },
                "examples": [
                    {
                        "en": "You're not doing yourself any favours, working for nothing.",
                        "vi": "Bạn đang không làm cho mình bất kỳ ưu ái nào, không làm việc gì cả."
                    },
                    {
                        "en": "The orchestra did Beethoven no favours.",
                        "vi": "Dàn nhạc không ủng hộ Beethoven."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you are in favour of somebody/something, you support and agree with them/it",
                    "vi": "nếu bạn ủng hộ ai đó / điều gì đó, bạn ủng hộ và đồng ý với họ / điều đó"
                },
                "examples": [
                    {
                        "en": "He argued in favour of a strike.",
                        "vi": "Anh ta lập luận ủng hộ một cuộc đình công."
                    },
                    {
                        "en": "There were 247 votes in favour (of the motion) and 152 against.",
                        "vi": "Có 247 phiếu ủng hộ (chuyển động) và 152 phiếu chống."
                    },
                    {
                        "en": "I'm all in favour of (= completely support) equal pay for equal work.",
                        "vi": "Tất cả tôi đều ủng hộ (= hoàn toàn ủng hộ) trả công như nhau cho công việc như nhau."
                    },
                    {
                        "en": "Most of the ‘don't knows’ in the opinion polls came down in favour of (= eventually chose to support) the Democrats.",
                        "vi": "Hầu hết những người 'không biết' trong các cuộc thăm dò dư luận đều ủng hộ (= cuối cùng đã chọn ủng hộ) đảng Dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in exchange for another thing (because the other thing is better or you want it more)",
                    "vi": "đổi lấy một thứ khác (vì thứ kia tốt hơn hoặc bạn muốn nó nhiều hơn)"
                },
                "examples": [
                    {
                        "en": "He abandoned teaching in favour of a career as a musician.",
                        "vi": "Ông từ bỏ việc giảng dạy để chuyển sang sự nghiệp của một nhạc sĩ."
                    },
                    {
                        "en": "Early in his musical career he abandoned blues in favour of jazz.",
                        "vi": "Đầu sự nghiệp âm nhạc của mình, ông đã từ bỏ nhạc blues để chuyển sang chơi nhạc jazz."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is in somebody’s favour, it gives them an advantage or helps them",
                    "vi": "nếu điều gì đó có lợi cho ai đó, nó mang lại lợi thế cho họ hoặc giúp họ"
                },
                "examples": [
                    {
                        "en": "The exchange rate is in our favour at the moment.",
                        "vi": "Tỷ giá hối đoái đang có lợi cho chúng tôi vào lúc này."
                    },
                    {
                        "en": "She was willing to bend the rules in Mary's favour.",
                        "vi": "Cô sẵn sàng bẻ cong các quy tắc có lợi cho Mary."
                    },
                    {
                        "en": "The golf tournament went in the Americans' favour.",
                        "vi": "Giải đấu gôn đã có lợi cho người Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decision or judgement that is in somebody’s favour benefits that person or says that they were right",
                    "vi": "một quyết định hoặc phán quyết có lợi cho ai đó có lợi cho người đó hoặc nói rằng họ đã đúng"
                },
                "examples": [
                    {
                        "en": "The court decided in Ms Smith’s favour and she received compensation for unfair dismissal.",
                        "vi": "Tòa án đã quyết định có lợi cho bà Smith và bà được bồi thường cho việc sa thải không công bằng."
                    },
                    {
                        "en": "The High Court found in favour of the plaintiffs.",
                        "vi": "Tòa án Tối cao ủng hộ các nguyên đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a fair way",
                    "vi": "một cách công bằng"
                },
                "examples": [
                    {
                        "en": "They undertook to make their judgement without fear or favour.",
                        "vi": "Họ tiến hành đưa ra phán quyết của họ mà không sợ hãi hoặc thuận lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "769e6ede3b93478283da6f99c7ba0798",
        "word": "it’s as broad as it’s long",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/brɔːd/",
            "us": "/brɔːd/"
        },
        "nearby": [
            {
                "word": "bro",
                "pos": "noun"
            },
            {
                "word": "broach",
                "pos": "verb"
            },
            {
                "word": "broad",
                "pos": "adjective"
            },
            {
                "word": "broad",
                "pos": "noun"
            },
            {
                "word": "B-road",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wide",
                    "vi": "rộng"
                },
                "examples": [
                    {
                        "en": "a broad street/avenue/river",
                        "vi": "một con phố rộng / đại lộ / sông"
                    },
                    {
                        "en": "He's got broad shoulders.",
                        "vi": "Anh ấy có bờ vai rộng."
                    },
                    {
                        "en": "He is tall, broad and muscular.",
                        "vi": "Anh ấy cao, rộng và vạm vỡ."
                    },
                    {
                        "en": "a broad smile/grin (= one in which your mouth is stretched very wide because you are very pleased)",
                        "vi": "nụ cười / nụ cười toe toét (= một nụ cười trong đó miệng của bạn đang kéo dài rất rộng vì bạn rất hài lòng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a measurement of distance to show how wide something is",
                    "vi": "được sử dụng sau khi đo khoảng cách để cho biết độ rộng của vật gì đó"
                },
                "examples": [
                    {
                        "en": "two metres broad and one metre high",
                        "vi": "rộng hai mét và cao một mét"
                    },
                    {
                        "en": "The wardrobe stands at one metre broad and two metres high.",
                        "vi": "Tủ quần áo rộng một mét và cao hai mét."
                    }
                ]
            },
            {
                "define": {
                    "en": "including a great variety of people or things",
                    "vi": "bao gồm rất nhiều người hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "a broad range of products",
                        "vi": "nhiều loại sản phẩm"
                    },
                    {
                        "en": "The course caters for a broad spectrum of interests.",
                        "vi": "Khóa học phục vụ cho nhiều sở thích."
                    },
                    {
                        "en": "There is broad support for the government's policies.",
                        "vi": "Có sự ủng hộ rộng rãi đối với các chính sách của chính phủ."
                    },
                    {
                        "en": "She took a broad view of the duties of being a teacher (= she believed her duties included a wide range of things).",
                        "vi": "Cô ấy có một cái nhìn rộng rãi về nhiệm vụ của một giáo viên (= cô ấy tin rằng nhiệm vụ của mình bao gồm rất nhiều thứ)."
                    },
                    {
                        "en": "a broad and balanced curriculum",
                        "vi": "một chương trình giảng dạy rộng rãi và cân bằng"
                    },
                    {
                        "en": "We must ensure the project is of advantage to the broader community and does not just benefit a few individuals.",
                        "vi": "Chúng ta phải đảm bảo dự án mang lại lợi ích cho cộng đồng rộng lớn hơn và không chỉ mang lại lợi ích cho một vài cá nhân."
                    },
                    {
                        "en": "The promotion helped the company reach a much broader audience.",
                        "vi": "Chương trình khuyến mãi đã giúp công ty tiếp cận được nhiều đối tượng hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "general; not detailed",
                    "vi": "chung; không chi tiết"
                },
                "examples": [
                    {
                        "en": "the broad outline of a proposal",
                        "vi": "phác thảo rộng của một đề xuất"
                    },
                    {
                        "en": "The negotiators were in broad agreement on the main issues.",
                        "vi": "Các nhà đàm phán đã thống nhất rộng rãi về các vấn đề chính."
                    },
                    {
                        "en": "She's a feminist, in the broadest sense of the word.",
                        "vi": "Cô ấy là một nhà nữ quyền, theo nghĩa rộng nhất của từ này."
                    },
                    {
                        "en": "In broad terms, the paper argues that each country should develop its own policy.",
                        "vi": "Theo nghĩa rộng, bài báo cho rằng mỗi quốc gia nên xây dựng chính sách của riêng mình."
                    },
                    {
                        "en": "Computer viruses fall into three broad categories.",
                        "vi": "Virus máy tính được chia thành ba loại lớn."
                    },
                    {
                        "en": "It is useful to examine this issue in a broader historical context.",
                        "vi": "Sẽ rất hữu ích nếu xem xét vấn đề này trong một bối cảnh lịch sử rộng lớn hơn."
                    },
                    {
                        "en": "The charges should be dismissed because the law is too broad and vague.",
                        "vi": "Các cáo buộc nên được bác bỏ vì luật quá rộng và mơ hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "covering a wide area",
                    "vi": "bao gồm một khu vực rộng"
                },
                "examples": [
                    {
                        "en": "a broad expanse of water",
                        "vi": "một vùng nước rộng lớn"
                    },
                    {
                        "en": "the broad plains of the American West",
                        "vi": "vùng đồng bằng rộng lớn của miền Tây Hoa Kỳ"
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody has a broad accent (= a way of pronouncing the words of a language), you can hear very easily which area they come from",
                    "vi": "nếu ai đó có giọng rộng (= một cách phát âm các từ của một ngôn ngữ), bạn có thể nghe rất dễ dàng họ đến từ khu vực nào"
                },
                "examples": [
                    {
                        "en": "a broad Yorkshire accent",
                        "vi": "giọng Yorkshire rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody gives a broad hint, they make it very clear what they are thinking or what they want",
                    "vi": "nếu ai đó đưa ra một gợi ý rộng rãi, họ sẽ nói rất rõ ràng họ đang nghĩ gì hoặc họ muốn gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "dealing with sex in a way that makes people laugh",
                    "vi": "đối phó với tình dục theo cách khiến mọi người cười"
                },
                "examples": [
                    {
                        "en": "The movie mixes broad humor with romance.",
                        "vi": "Bộ phim kết hợp hài hước rộng rãi với lãng mạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization that accepts a wide range of opinions",
                    "vi": "một tổ chức chấp nhận nhiều ý kiến khác nhau"
                },
                "examples": [
                    {
                        "en": "The party aims to be a broad church with members from all sections of society.",
                        "vi": "Mục tiêu của đảng là trở thành một giáo hội rộng lớn với các thành viên từ mọi thành phần trong xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in) the clear light of day, when it is easy to see",
                    "vi": "(trong) ánh sáng ban ngày rõ ràng, khi dễ dàng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The robbery occurred in broad daylight, in a crowded street.",
                        "vi": "Vụ cướp xảy ra giữa thanh thiên bạch nhật, giữa một con phố đông đúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "it makes no real difference which of two possible choices you make",
                    "vi": "nó không tạo ra sự khác biệt thực sự nào trong hai lựa chọn khả thi mà bạn đưa ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to describe something in a general way, ignoring the details",
                    "vi": "để mô tả một cái gì đó một cách chung chung, bỏ qua các chi tiết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "30b64fe2682a4148a467401f6336456f",
        "word": "it’s six of one and half a dozen of the other",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/sɪks/",
            "us": "/sɪks/"
        },
        "nearby": [
            {
                "word": "Sitwell",
                "pos": ""
            },
            {
                "word": "sit yourself down",
                "pos": "phrasal verb"
            },
            {
                "word": "six",
                "pos": "number"
            },
            {
                "word": "the Six Counties",
                "pos": "noun"
            },
            {
                "word": "sixer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "6",
                    "vi": "6"
                },
                "examples": [
                    {
                        "en": "There are six cookies left.",
                        "vi": "Còn lại sáu cái bánh quy."
                    },
                    {
                        "en": "six of Sweden’s top financial experts",
                        "vi": "sáu chuyên gia tài chính hàng đầu của Thụy Điển"
                    },
                    {
                        "en": "Ten people were invited but only six turned up.",
                        "vi": "Mười người được mời nhưng chỉ có sáu người xuất hiện."
                    },
                    {
                        "en": "Can you lend me six dollars?",
                        "vi": "Bạn có thể cho tôi vay sáu đô la không?"
                    },
                    {
                        "en": "a six-month contract",
                        "vi": "một hợp đồng sáu tháng"
                    },
                    {
                        "en": "Look at page six.",
                        "vi": "Nhìn vào trang sáu."
                    },
                    {
                        "en": "Six and four is ten.",
                        "vi": "Sáu và bốn là mười."
                    },
                    {
                        "en": "Three sixes are eighteen.",
                        "vi": "Ba sáu là mười tám."
                    },
                    {
                        "en": "I can't read your writing—is this meant to be a six?",
                        "vi": "Tôi không thể đọc bài viết của bạn — điều này có nghĩa là một số sáu?"
                    },
                    {
                        "en": "The bulbs are planted in fours or sixes (= groups of four or six).",
                        "vi": "Củ được trồng thành bốn hoặc sáu (= nhóm bốn hoặc sáu)."
                    },
                    {
                        "en": "We moved to America when I was six (= six years old).",
                        "vi": "Chúng tôi chuyển đến Mỹ khi tôi sáu tuổi (= sáu tuổi)."
                    },
                    {
                        "en": "Shall we meet at six (= at six o'clock), then?",
                        "vi": "Vậy thì chúng ta sẽ gặp nhau lúc sáu giờ (= lúc sáu giờ) chứ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a hit that scores six runs (= points)",
                    "vi": "một cú đánh ghi được sáu lần chạy (= điểm)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a confused state; not well organized",
                    "vi": "trong trạng thái bối rối; không được tổ chức tốt"
                },
                "examples": [
                    {
                        "en": "I haven't had time to clear up, so I'm all at sixes and sevens.",
                        "vi": "Tôi không có thời gian để giải tỏa, vì vậy tôi đang ở độ tuổi sáu và bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead and buried in the ground",
                    "vi": "chết và chôn trong đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to affect somebody very deeply",
                    "vi": "ảnh hưởng đến ai đó rất sâu sắc"
                },
                "examples": [
                    {
                        "en": "The business over the lawsuit had really knocked her for six.",
                        "vi": "Công việc kinh doanh về vụ kiện đã thực sự khiến cô ấy mất sáu tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is not much real difference between two possible choices",
                    "vi": "được sử dụng để nói rằng không có nhiều sự khác biệt thực sự giữa hai sự lựa chọn có thể có"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9cf01ee5ecdc4086b2a8fd2e9791a6bf",
        "word": "joint resolution",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒɔɪnt rezəˈluːʃn/",
            "us": "/ˌdʒɔɪnt rezəˈluːʃn/"
        },
        "nearby": [
            {
                "word": "joint family",
                "pos": "noun"
            },
            {
                "word": "jointly",
                "pos": "adverb"
            },
            {
                "word": "joint resolution",
                "pos": "noun"
            },
            {
                "word": "joint-stock company",
                "pos": "noun"
            },
            {
                "word": "joint venture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) a decision that has been approved by the Senate and the House of Representatives",
                    "vi": "(ở Mỹ) một quyết định đã được Thượng viện và Hạ viện thông qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4230239cb0e940e7806bec62a75c432c",
        "word": "judgement call",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʌdʒmənt kɔːl/",
            "us": "/ˈdʒʌdʒmənt kɔːl/"
        },
        "nearby": [
            {
                "word": "judgement",
                "pos": "noun"
            },
            {
                "word": "judgemental",
                "pos": "adjective"
            },
            {
                "word": "judgement call",
                "pos": "noun"
            },
            {
                "word": "Judgement Day",
                "pos": "noun"
            },
            {
                "word": "Judgement of Solomon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a decision you have to make where there is no clear rule about what the right thing to do is, so that you have to use your own judgement",
                    "vi": "một quyết định bạn phải đưa ra khi không có quy định rõ ràng về việc đúng phải làm là gì, vì vậy bạn phải sử dụng phán đoán của riêng mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f823cd79539145feaedac4a4ad3e79f3",
        "word": "judicial review",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒuˌdɪʃl rɪˈvjuː/",
            "us": "/dʒuˌdɪʃl rɪˈvjuː/"
        },
        "nearby": [
            {
                "word": "judicially",
                "pos": "adverb"
            },
            {
                "word": "judicial restraint",
                "pos": "noun"
            },
            {
                "word": "judicial review",
                "pos": "noun"
            },
            {
                "word": "judiciary",
                "pos": "noun"
            },
            {
                "word": "judicious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the power of the Supreme Court to decide if something is allowed by the Constitution",
                    "vi": "(ở Mỹ) quyền của Tòa án tối cao trong việc quyết định xem điều gì đó có được Hiến pháp cho phép hay không"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) a procedure in which a court examines an action or decision of a public body and decides whether it was right",
                    "vi": "(ở Anh) một thủ tục trong đó tòa án xem xét một hành động hoặc quyết định của cơ quan công quyền và quyết định xem nó có đúng hay không"
                },
                "examples": [
                    {
                        "en": "There is to be a judicial review of the visa changes.",
                        "vi": "Cần phải có một cuộc xem xét tư pháp về những thay đổi của thị thực."
                    },
                    {
                        "en": "The case is subject to judicial review.",
                        "vi": "Vụ án sẽ được xem xét lại."
                    }
                ]
            }
        ]
    },
    {
        "id": "c51acc5f5eb54173b5db4732fc9984a3",
        "word": "jurisdictional",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒʊərɪsˈdɪkʃənl/",
            "us": "/ˌdʒʊrɪsˈdɪkʃənl/"
        },
        "nearby": [
            {
                "word": "juridical",
                "pos": "adjective"
            },
            {
                "word": "jurisdiction",
                "pos": "noun"
            },
            {
                "word": "jurisdictional",
                "pos": "adjective"
            },
            {
                "word": "jurisprudence",
                "pos": "noun"
            },
            {
                "word": "jurist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the authority that an official organization has to make legal decisions about somebody/something",
                    "vi": "được kết nối với thẩm quyền mà một tổ chức chính thức có để đưa ra các quyết định pháp lý về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a serious jurisdictional error",
                        "vi": "một lỗi pháp lý nghiêm trọng"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with an area or areas in which a particular system of laws has authority",
                    "vi": "được kết nối với một khu vực hoặc các khu vực mà một hệ thống luật cụ thể có thẩm quyền"
                },
                "examples": [
                    {
                        "en": "jurisdictional boundaries",
                        "vi": "ranh giới pháp lý"
                    }
                ]
            }
        ]
    },
    {
        "id": "24f2b52785e94932874d3fbd6af5737a",
        "word": "keep/leave your options open",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒpʃn/",
            "us": "/ˈɑːpʃn/"
        },
        "nearby": [
            {
                "word": "opt in",
                "pos": "phrasal verb"
            },
            {
                "word": "opting out",
                "pos": "noun"
            },
            {
                "word": "option",
                "pos": "noun"
            },
            {
                "word": "option",
                "pos": "verb"
            },
            {
                "word": "optional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you can choose to have or do; the freedom to choose what you do",
                    "vi": "một cái gì đó mà bạn có thể chọn để có hoặc làm; tự do lựa chọn những gì bạn làm"
                },
                "examples": [
                    {
                        "en": "As I see it, we have two options…",
                        "vi": "Theo tôi thấy, chúng tôi có hai lựa chọn…"
                    },
                    {
                        "en": "There are various options open to you.",
                        "vi": "Có nhiều tùy chọn khác nhau mở ra cho bạn."
                    },
                    {
                        "en": "to explore/consider/look at all your options",
                        "vi": "để khám phá / xem xét / xem xét tất cả các tùy chọn của bạn"
                    },
                    {
                        "en": "We are currently studying all the options available.",
                        "vi": "Chúng tôi hiện đang nghiên cứu tất cả các tùy chọn có sẵn."
                    },
                    {
                        "en": "Going to college was not an option for me.",
                        "vi": "Vào đại học không phải là một lựa chọn đối với tôi."
                    },
                    {
                        "en": "Selling the house was our only option.",
                        "vi": "Bán nhà là lựa chọn duy nhất của chúng tôi."
                    },
                    {
                        "en": "Waiting a year may be your best option.",
                        "vi": "Chờ đợi một năm có thể là lựa chọn tốt nhất của bạn."
                    },
                    {
                        "en": "We felt this was the most viable option.",
                        "vi": "Chúng tôi cảm thấy đây là lựa chọn khả thi nhất."
                    },
                    {
                        "en": "I had no option but to (= I had to) ask him to leave.",
                        "vi": "Tôi không có lựa chọn nào khác ngoài (= Tôi buộc phải) yêu cầu anh ấy rời đi."
                    },
                    {
                        "en": "option of doing something Students have the option of studying abroad in their second year.",
                        "vi": "lựa chọn làm việc gì đó Sinh viên có quyền lựa chọn đi du học vào năm thứ hai."
                    },
                    {
                        "en": "option of something He was given one month’s imprisonment without the option of a fine.",
                        "vi": "tùy chọn của một cái gì đó Anh ta bị phạt tù một tháng mà không có tùy chọn phạt tiền."
                    },
                    {
                        "en": "option to do something A savings plan that gives you the option to vary your monthly payments.",
                        "vi": "tùy chọn để làm điều gì đó Một kế hoạch tiết kiệm cung cấp cho bạn tùy chọn để thay đổi các khoản thanh toán hàng tháng của bạn."
                    },
                    {
                        "en": "This particular model comes with a wide range of options (= things you can choose to have when buying something but which you will have to pay extra for).",
                        "vi": "Mô hình cụ thể này có nhiều tùy chọn (= những thứ bạn có thể chọn khi mua thứ gì đó nhưng bạn sẽ phải trả thêm tiền)."
                    },
                    {
                        "en": "In most cases, I would go for the cheaper option.",
                        "vi": "Trong hầu hết các trường hợp, tôi sẽ chọn lựa chọn rẻ hơn."
                    },
                    {
                        "en": "Farming is not an attractive career option for many young people.",
                        "vi": "Nghề nông không phải là một lựa chọn nghề nghiệp hấp dẫn đối với nhiều bạn trẻ."
                    },
                    {
                        "en": "The poor villagers are left with no option but to risk their lives.",
                        "vi": "Những người dân làng nghèo không còn lựa chọn nào khác ngoài việc liều mạng."
                    },
                    {
                        "en": "Your doctor will discuss treatment options with you.",
                        "vi": "Bác sĩ của bạn sẽ thảo luận về các lựa chọn điều trị với bạn."
                    },
                    {
                        "en": "Failure is not an option.",
                        "vi": "Thất bại không phải là một lựa chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject that a student can choose to study, but that they do not have to do",
                    "vi": "một môn học mà học sinh có thể chọn để học, nhưng họ không phải làm"
                },
                "examples": [
                    {
                        "en": "The course offers options in design and computing.",
                        "vi": "Khóa học cung cấp các tùy chọn trong thiết kế và máy tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to buy or sell something at some time in the future",
                    "vi": "quyền mua hoặc bán thứ gì đó vào một thời điểm nào đó trong tương lai"
                },
                "examples": [
                    {
                        "en": "share options (= the right to buy shares in a company)",
                        "vi": "quyền chọn cổ phần (= quyền mua cổ phần trong công ty)"
                    },
                    {
                        "en": "option on something We have an option on the house.",
                        "vi": "tùy chọn về một cái gì đó Chúng tôi có một tùy chọn trên ngôi nhà."
                    },
                    {
                        "en": "He has promised me first option on his car (= the opportunity to buy it before anyone else).",
                        "vi": "Anh ấy đã hứa với tôi lựa chọn đầu tiên trên chiếc xe của anh ấy (= cơ hội mua nó trước bất kỳ ai khác)."
                    },
                    {
                        "en": "option to do something The property is for rent with an option to buy at any time.",
                        "vi": "tùy chọn để làm điều gì đó Tài sản được cho thuê với tùy chọn mua bất kỳ lúc nào."
                    },
                    {
                        "en": "They exercised an option on their lease to buy the building.",
                        "vi": "Họ đã thực hiện một lựa chọn trong hợp đồng thuê của họ để mua tòa nhà."
                    },
                    {
                        "en": "She took up an option in her contract to buy three million shares.",
                        "vi": "Cô đã đưa ra một lựa chọn trong hợp đồng của mình là mua ba triệu cổ phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the choices you can make when using a computer program",
                    "vi": "một trong những lựa chọn bạn có thể thực hiện khi sử dụng chương trình máy tính"
                },
                "examples": [
                    {
                        "en": "Choose the ‘Cut’ option from the Edit menu.",
                        "vi": "Chọn tùy chọn 'Cắt' từ menu Chỉnh sửa."
                    },
                    {
                        "en": "Look at the on-screen menu and select the ‘File’ option.",
                        "vi": "Nhìn vào menu trên màn hình và chọn tùy chọn 'Tệp'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid making a decision now so that you still have a choice in the future",
                    "vi": "để tránh đưa ra quyết định ngay bây giờ để bạn vẫn có sự lựa chọn trong tương lai"
                },
                "examples": [
                    {
                        "en": "At the moment I'm keeping my options open and applying for as many different jobs as possible.",
                        "vi": "Hiện tại, tôi đang để ngỏ các lựa chọn của mình và nộp đơn cho nhiều công việc khác nhau nhất có thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "a choice that is thought to be easier because it involves less effort, difficulty, etc.",
                    "vi": "một sự lựa chọn được cho là dễ dàng hơn vì nó ít tốn công sức, khó khăn, v.v."
                },
                "examples": [
                    {
                        "en": "They are anxious that the new course should not be seen as a soft option.",
                        "vi": "Họ lo lắng rằng khóa học mới không nên được coi là một lựa chọn mềm."
                    },
                    {
                        "en": "He decided to take the easy option and give them what they wanted.",
                        "vi": "Anh quyết định lựa chọn dễ dàng và cung cấp cho họ những gì họ muốn."
                    },
                    {
                        "en": "She could have taken the easy option and left.",
                        "vi": "Cô ấy có thể đã lựa chọn dễ dàng và rời đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "ca35ed177f834a72a2d7d8506215e78d",
        "word": "the lesser of two evils",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlesə(r)/",
            "us": "/ˈlesər/"
        },
        "nearby": [
            {
                "word": "lessen",
                "pos": "verb"
            },
            {
                "word": "lessening",
                "pos": "noun"
            },
            {
                "word": "lesser",
                "pos": "adjective"
            },
            {
                "word": "lesser",
                "pos": "adverb"
            },
            {
                "word": "Doris Lessing",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not as great in size, amount or importance as something/somebody else",
                    "vi": "không lớn về kích thước, số lượng hoặc tầm quan trọng như thứ gì đó / người khác"
                },
                "examples": [
                    {
                        "en": "people of lesser importance",
                        "vi": "những người ít quan trọng hơn"
                    },
                    {
                        "en": "They were all involved to a greater or lesser degree (= some were more involved than others).",
                        "vi": "Tất cả họ đều tham gia ở mức độ lớn hơn hoặc thấp hơn (= một số tham gia nhiều hơn những người khác)."
                    },
                    {
                        "en": "The law was designed to protect wives, and, to a lesser extent, children.",
                        "vi": "Luật được thiết kế để bảo vệ những người vợ, và ở mức độ thấp hơn, những đứa trẻ."
                    },
                    {
                        "en": "He was encouraged to plead guilty to the lesser offence.",
                        "vi": "Anh ta được khuyến khích nhận tội với tội nhẹ hơn."
                    },
                    {
                        "en": "(humorous) He doesn’t even acknowledge us lesser mortals (= people who are not as important or powerful).",
                        "vi": "(hài hước) Anh ta thậm chí còn không thừa nhận chúng ta là những người phàm thấp hơn (= những người không quan trọng hoặc mạnh mẽ)."
                    },
                    {
                        "en": "A lesser woman would have given up.",
                        "vi": "Một người phụ nữ thấp hơn hẳn đã từ bỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of some types of animals, birds and plants that are smaller than similar kinds",
                    "vi": "được sử dụng trong tên của một số loại động vật, chim và thực vật nhỏ hơn các loại tương tự"
                },
                "examples": [
                    {
                        "en": "a lesser black-backed gull",
                        "vi": "một con mòng biển lưng đen ít hơn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the less unpleasant of two unpleasant choices",
                    "vi": "bớt khó chịu hơn trong hai lựa chọn khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f3305e1a1934f19b573d11c68b89cd5",
        "word": "list box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪst bɒks/",
            "us": "/ˈlɪst bɑːks/"
        },
        "nearby": [
            {
                "word": "list",
                "pos": "noun"
            },
            {
                "word": "list",
                "pos": "verb"
            },
            {
                "word": "list box",
                "pos": "noun"
            },
            {
                "word": "listed building",
                "pos": "noun"
            },
            {
                "word": "listen",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list of choices in a box on a computer screen",
                    "vi": "danh sách các lựa chọn trong một hộp trên màn hình máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "96891e52c1c3405f9e21e557b382eb2d",
        "word": "majority verdict",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˌdʒɒrəti ˈvɜːdɪkt/",
            "us": "/məˌdʒɔːrəti ˈvɜːrdɪkt/"
        },
        "nearby": [
            {
                "word": "majority leader",
                "pos": "noun"
            },
            {
                "word": "majority rule",
                "pos": "noun"
            },
            {
                "word": "majority verdict",
                "pos": "noun"
            },
            {
                "word": "majority whip",
                "pos": "noun"
            },
            {
                "word": "major league",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a decision made by a jury in a court case that most members, but not all, agree with",
                    "vi": "một quyết định được đưa ra bởi bồi thẩm đoàn trong một vụ án mà hầu hết các thành viên, nhưng không phải tất cả, đều đồng ý với"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3b5284a5700c46b4b6e95772369a82b7",
        "word": "make allowance(s) for something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈlaʊəns/",
            "us": "/əˈlaʊəns/"
        },
        "nearby": [
            {
                "word": "allow",
                "pos": "verb"
            },
            {
                "word": "allowable",
                "pos": "adjective"
            },
            {
                "word": "allowance",
                "pos": "noun"
            },
            {
                "word": "allow for",
                "pos": "phrasal verb"
            },
            {
                "word": "allow of",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that is given to somebody regularly or for a particular purpose",
                    "vi": "một số tiền được đưa cho ai đó thường xuyên hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "an allowance of $20 a day",
                        "vi": "trợ cấp $ 20 một ngày"
                    },
                    {
                        "en": "a clothing/living/travel allowance",
                        "vi": "trợ cấp quần áo / sinh hoạt / đi lại"
                    },
                    {
                        "en": "Do you get an allowance for clothing?",
                        "vi": "Bạn có nhận được một khoản phụ cấp cho quần áo?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of something that is allowed in a particular situation",
                    "vi": "số lượng thứ được phép trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "a baggage allowance of 20 kilos",
                        "vi": "hành lý ký gửi 20 kg"
                    },
                    {
                        "en": "Roman soldiers received a salt allowance, called salarium, the origin of the word salary.",
                        "vi": "Những người lính La Mã nhận được một khoản trợ cấp muối, được gọi là salarium, nguồn gốc của từ lương."
                    },
                    {
                        "en": "The recommended daily allowance of vitamin C is 60–90 milligrams.",
                        "vi": "Lượng vitamin C được khuyến nghị hàng ngày là 60–90 miligam."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of money that parents give their children, usually every week or every month",
                    "vi": "một số tiền nhỏ mà cha mẹ cho con cái, thường là hàng tuần hoặc hàng tháng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an amount of money that can be earned or received before you start paying tax",
                    "vi": "một số tiền có thể kiếm được hoặc nhận được trước khi bạn bắt đầu nộp thuế"
                },
                "examples": [
                    {
                        "en": "personal tax allowances",
                        "vi": "trợ cấp thuế cá nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider something, for example when you are making a decision or planning something",
                    "vi": "để xem xét điều gì đó, chẳng hạn như khi bạn đang đưa ra quyết định hoặc lập kế hoạch"
                },
                "examples": [
                    {
                        "en": "The budget made allowance for inflation.",
                        "vi": "Ngân sách đã dự phòng cho lạm phát."
                    },
                    {
                        "en": "The plan makes no allowance for people working at different rates.",
                        "vi": "Kế hoạch không phụ cấp cho những người làm việc ở các mức lương khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to behave in a way that you would not usually accept, because of a problem or because there is a special reason",
                    "vi": "để cho phép ai đó cư xử theo cách mà bạn thường không chấp nhận, vì một vấn đề hoặc vì có một lý do đặc biệt"
                },
                "examples": [
                    {
                        "en": "You have to make allowances for him because he’s tired.",
                        "vi": "Bạn phải phụ cấp cho anh ấy vì anh ấy mệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a818b1d46be4d919470067a19b7856c",
        "word": "miscarriage of justice",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪskærɪdʒ əv ˈdʒʌstɪs/",
            "us": "/ˌmɪskærɪdʒ əv ˈdʒʌstɪs/"
        },
        "nearby": [
            {
                "word": "miscalculation",
                "pos": "noun"
            },
            {
                "word": "miscarriage",
                "pos": "noun"
            },
            {
                "word": "miscarriage of justice",
                "pos": "noun"
            },
            {
                "word": "miscarry",
                "pos": "verb"
            },
            {
                "word": "miscast",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which a court makes a wrong decision, especially when somebody is punished when they are innocent",
                    "vi": "một tình huống trong đó tòa án đưa ra quyết định sai lầm, đặc biệt là khi ai đó bị trừng phạt khi họ vô tội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bc741f48ae4849d3a11be5ea6e6af1de",
        "word": "nail down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "nail brush",
                "pos": "noun"
            },
            {
                "word": "nail clippers",
                "pos": "noun"
            },
            {
                "word": "nail down",
                "pos": "phrasal verb"
            },
            {
                "word": "nailed on",
                "pos": "adjective"
            },
            {
                "word": "nail file",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to fasten something in place with a nail or nails",
                    "vi": "để buộc chặt một cái gì đó tại chỗ bằng móng tay hoặc móng tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reach an agreement or a decision, usually after a lot of discussion",
                    "vi": "để đạt được một thỏa thuận hoặc một quyết định, thường là sau nhiều cuộc thảo luận"
                },
                "examples": [
                    {
                        "en": "All the parties seem anxious to nail down a ceasefire.",
                        "vi": "Tất cả các bên dường như lo lắng về việc ngừng bắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to give you a definite promise or tell you exactly what they intend to do",
                    "vi": "buộc ai đó phải đưa ra cho bạn một lời hứa chắc chắn hoặc cho bạn biết chính xác những gì họ định làm"
                },
                "examples": [
                    {
                        "en": "She says she'll come, but I can't nail her down to a specific time.",
                        "vi": "Cô ấy nói rằng cô ấy sẽ đến, nhưng tôi không thể ấn định thời gian cụ thể cho cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "85b306a6bf9447d4958647370a9e3597",
        "word": "narrow down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "narrowboat",
                "pos": "noun"
            },
            {
                "word": "narrowcast",
                "pos": "verb"
            },
            {
                "word": "narrow down",
                "pos": "phrasal verb"
            },
            {
                "word": "narrow gauge",
                "pos": "noun"
            },
            {
                "word": "narrowly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to reduce the number of possibilities or choices",
                    "vi": "để giảm số lượng khả năng hoặc lựa chọn"
                },
                "examples": [
                    {
                        "en": "We narrowed the choices down to five categories.",
                        "vi": "Chúng tôi đã thu hẹp các lựa chọn xuống còn năm danh mục."
                    },
                    {
                        "en": "the following list may help narrow down the cause of the problem.",
                        "vi": "danh sách sau đây có thể giúp thu hẹp nguyên nhân của sự cố."
                    },
                    {
                        "en": "We have narrowed down the list to four candidates.",
                        "vi": "Chúng tôi đã thu hẹp danh sách xuống còn bốn ứng cử viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "1d6d8b9f38e0485db5acd2085d4a7273",
        "word": "negotiable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/nɪˈɡəʊʃiəbl/",
            "us": "/nɪˈɡəʊʃiəbl/"
        },
        "nearby": [
            {
                "word": "negligently",
                "pos": "adverb"
            },
            {
                "word": "negligible",
                "pos": "adjective"
            },
            {
                "word": "negotiable",
                "pos": "adjective"
            },
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you can discuss or change before you make an agreement or a decision",
                    "vi": "mà bạn có thể thảo luận hoặc thay đổi trước khi đưa ra thỏa thuận hoặc quyết định"
                },
                "examples": [
                    {
                        "en": "The terms of employment are negotiable.",
                        "vi": "Các điều khoản lao động có thể thương lượng."
                    },
                    {
                        "en": "The price was not negotiable.",
                        "vi": "Giá không thể thương lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you can exchange for money or give to another person in exchange for money",
                    "vi": "mà bạn có thể đổi lấy tiền hoặc đưa cho người khác để đổi lấy tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c29fd10b7221468b8ca1d3690d413c8a",
        "word": "no-brainer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnəʊ ˈbreɪnə(r)/",
            "us": "/ˌnəʊ ˈbreɪnər/"
        },
        "nearby": [
            {
                "word": "nobody",
                "pos": "pronoun"
            },
            {
                "word": "nobody",
                "pos": "noun"
            },
            {
                "word": "no-brainer",
                "pos": "noun"
            },
            {
                "word": "no-claims bonus",
                "pos": "noun"
            },
            {
                "word": "nocturnal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a decision or a problem that you do not need to think about much because it is obvious what you should do",
                    "vi": "một quyết định hoặc một vấn đề mà bạn không cần phải suy nghĩ nhiều vì rõ ràng bạn nên làm gì"
                },
                "examples": [
                    {
                        "en": "The question of who to support in this election should be a no-brainer.",
                        "vi": "Câu hỏi ủng hộ ai trong cuộc bầu cử này là điều không cần bàn cãi."
                    },
                    {
                        "en": "I said yes straight away. It was a no-brainer for me.",
                        "vi": "Tôi nói đồng ý ngay lập tức. Đó là một điều không có trí tuệ đối với tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e9aece303214fcc82b01466d0bdf8f6",
        "word": "not budge/give/move an inch",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪntʃ/",
            "us": "/ɪntʃ/"
        },
        "nearby": [
            {
                "word": "incestuous",
                "pos": "adjective"
            },
            {
                "word": "incestuously",
                "pos": "adverb"
            },
            {
                "word": "inch",
                "pos": "noun"
            },
            {
                "word": "inch",
                "pos": "verb"
            },
            {
                "word": "incharge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a unit for measuring length or height, equal to 2.54 centimetres. There are 12 inches in a foot.",
                    "vi": "một đơn vị đo chiều dài hoặc chiều cao, bằng 2,54 cm. Có 12 inch trong một foot."
                },
                "examples": [
                    {
                        "en": "She's a few inches taller than me.",
                        "vi": "Cô ấy cao hơn tôi vài inch."
                    },
                    {
                        "en": "a laptop with a 15-inch screen",
                        "vi": "một máy tính xách tay với màn hình 15 inch"
                    },
                    {
                        "en": "Each image measures 46 x 28 inches.",
                        "vi": "Mỗi hình ảnh có kích thước 46 x 28 inch."
                    },
                    {
                        "en": "a fat envelope about half an inch thick",
                        "vi": "một phong bì béo dày khoảng nửa inch"
                    },
                    {
                        "en": "The snow is about one and a half inches deep.",
                        "vi": "Tuyết sâu khoảng 1,5 inch."
                    },
                    {
                        "en": "1.14 inches of rain fell last night.",
                        "vi": "Tối qua, lượng mưa 1,14 inch đã giảm."
                    },
                    {
                        "en": "Every square inch of available land has been built on.",
                        "vi": "Mỗi inch vuông đất sẵn có đã được xây dựng trên đó."
                    },
                    {
                        "en": "a metal tube about three inches in diameter",
                        "vi": "một ống kim loại có đường kính khoảng ba inch"
                    },
                    {
                        "en": "They feed on leaves and may grow to two inches in length.",
                        "vi": "Chúng ăn lá và có thể dài tới 2 inch."
                    },
                    {
                        "en": "Since I started jogging I've lost three and a half inches from my waistline.",
                        "vi": "Kể từ khi tôi bắt đầu chạy bộ, tôi đã giảm được ba inch rưỡi so với vòng eo của mình."
                    },
                    {
                        "en": "inch from something Babies focus best on objects ten inches from their eyes.",
                        "vi": "inch từ một vật nào đó Trẻ sơ sinh tập trung tốt nhất vào những vật cách mắt chúng mười inch."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount or distance",
                    "vi": "một số lượng nhỏ hoặc khoảng cách"
                },
                "examples": [
                    {
                        "en": "by an inch He escaped death by an inch.",
                        "vi": "bởi một inch Ông đã thoát chết trong một inch."
                    },
                    {
                        "en": "by inches The car missed us by inches.",
                        "vi": "từng inch Chiếc xe đã bỏ lỡ chúng ta từng inch."
                    },
                    {
                        "en": "within an inch of (doing) something She was within an inch of being killed.",
                        "vi": "trong vòng một inch khi (làm) điều gì đó Cô ấy đã ở trong một inch sau khi bị giết."
                    },
                    {
                        "en": "They beat him (to) within an inch of his life (= very severely).",
                        "vi": "Họ đánh anh ta (đến) trong vòng một inch của cuộc đời anh ta (= rất nặng)."
                    },
                    {
                        "en": "inches (away) from something Her face was only inches from mine.",
                        "vi": "inch (cách xa) thứ gì đó Khuôn mặt của cô ấy chỉ cách tôi vài inch."
                    },
                    {
                        "en": "inches (away) from doing something He was just inches away from scoring.",
                        "vi": "inch (cách xa) để làm điều gì đó Anh ấy chỉ còn cách ghi bàn vài inch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole of something",
                    "vi": "toàn bộ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The doctor examined every inch of his body.",
                        "vi": "Bác sĩ kiểm tra từng li từng tí trên cơ thể anh."
                    },
                    {
                        "en": "(figurative) If they try to fire me I'll fight them every inch of the way.",
                        "vi": "(nghĩa bóng) Nếu họ cố sa thải tôi, tôi sẽ chiến đấu với họ từng li từng tí."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "In his first game the young player already looked every inch a winner.",
                        "vi": "Trong trò chơi đầu tiên của mình, cầu thủ trẻ đã xem mỗi inch là người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that if you allow some people a small amount of freedom or power they will see you as weak and try to take a lot more",
                    "vi": "thường nói rằng nếu bạn cho phép một số người ít tự do hoặc quyền lực, họ sẽ thấy bạn yếu đuối và cố gắng lấy nhiều hơn nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very slowly and with great care or difficulty",
                    "vi": "rất chậm và hết sức cẩn thận hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "She crawled forward inch by inch.",
                        "vi": "Cô ấy trườn về phía trước từng inch một."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to change your position, decision, etc. even a little",
                    "vi": "từ chối thay đổi vị trí, quyết định của bạn, v.v. dù chỉ một chút"
                },
                "examples": [
                    {
                        "en": "We tried to negotiate a lower price but they wouldn't budge an inch.",
                        "vi": "Chúng tôi đã cố gắng thương lượng một mức giá thấp hơn nhưng họ sẽ không nhúc nhích một inch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not trust somebody at all",
                    "vi": "hoàn toàn không tin tưởng ai đó"
                },
                "examples": [
                    {
                        "en": "He says he just wants to help you but I wouldn’t trust him an inch if I were you.",
                        "vi": "Anh ấy nói anh ấy chỉ muốn giúp bạn nhưng tôi sẽ không tin anh ấy một chút nếu tôi là bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c3dc21878054ed4bfc63bf2fff2997a",
        "word": "on the horns of a dilemma",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɔːn/",
            "us": "/hɔːrn/"
        },
        "nearby": [
            {
                "word": "hormone",
                "pos": "noun"
            },
            {
                "word": "hormone replacement therapy",
                "pos": "noun"
            },
            {
                "word": "horn",
                "pos": "noun"
            },
            {
                "word": "horn",
                "pos": "verb"
            },
            {
                "word": "hornbeam",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hard pointed part that grows, usually in pairs, on the heads of some animals, such as sheep and cows. Horns are often curved.",
                    "vi": "một phần cứng nhọn mọc trên đầu của một số động vật, chẳng hạn như cừu và bò, thường mọc thành từng cặp. Sừng thường cong."
                },
                "examples": [
                    {
                        "en": "a large bull with curved horns",
                        "vi": "một con bò đực lớn có sừng cong"
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard substance of which animal horns are made",
                    "vi": "chất cứng mà sừng động vật được tạo ra"
                },
                "examples": [
                    {
                        "en": "ornaments made of rhino horn",
                        "vi": "đồ trang trí bằng sừng tê giác"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device in a vehicle for making a loud sound as a warning or signal",
                    "vi": "một thiết bị trên xe để tạo ra âm thanh lớn như một cảnh báo hoặc tín hiệu"
                },
                "examples": [
                    {
                        "en": "to honk your car horn",
                        "vi": "bấm còi xe của bạn"
                    },
                    {
                        "en": "(British English) to sound/toot your horn",
                        "vi": "(Tiếng Anh Anh) để phát ra âm thanh / thổi còi của bạn"
                    },
                    {
                        "en": "Behind him, a horn blared.",
                        "vi": "Sau lưng anh ta, một chiếc sừng vang lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a simple musical instrument that consists of a curved metal tube that you blow into",
                    "vi": "một nhạc cụ đơn giản bao gồm một ống kim loại cong mà bạn thổi vào"
                },
                "examples": [
                    {
                        "en": "a hunting horn",
                        "vi": "một cái sừng săn bắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a brass musical instrument that consists of a long tube curled around in a circle with a wide opening at the end",
                    "vi": "một nhạc cụ bằng đồng bao gồm một ống dài cuộn tròn quanh một vòng tròn với một lỗ mở rộng ở cuối"
                },
                "examples": [
                    {
                        "en": "a horn concerto",
                        "vi": "một bản concerto sừng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to praise your own abilities and achievements",
                    "vi": "khen ngợi khả năng và thành tích của chính bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start being more careful in your behaviour, especially by spending less money than before",
                    "vi": "để bắt đầu cẩn thận hơn trong hành vi của bạn, đặc biệt là bằng cách tiêu ít tiền hơn trước đây"
                },
                "examples": [
                    {
                        "en": "Small businesses have had to pull their horns in during the recession.",
                        "vi": "Các doanh nghiệp nhỏ đã phải kéo sừng của họ trong thời kỳ suy thoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get involved in an argument with somebody",
                    "vi": "tham gia vào một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "The company has locked horns with the unions over proposed pay cuts.",
                        "vi": "Công ty đã khóa sừng với các công đoàn về đề xuất cắt giảm lương."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation in which you have to make a choice between things that are equally unpleasant",
                    "vi": "trong một tình huống mà bạn phải lựa chọn giữa những điều khó chịu như nhau"
                },
                "examples": [
                    {
                        "en": "The medical profession’s eagerness for scientific advance had impaled it on the horns of a dilemma, forcing an unnatural choice between science and morality.",
                        "vi": "Sự háo hức của ngành y đối với tiến bộ khoa học đã đặt nó vào tình thế tiến thoái lưỡng nan, buộc phải lựa chọn không tự nhiên giữa khoa học và đạo đức."
                    },
                    {
                        "en": "The dire economic situation had placed the prime minister on the horns of a dilemma.",
                        "vi": "Tình hình kinh tế tồi tệ đã đặt thủ tướng vào tình thế khó xử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to face a difficult or dangerous situation directly and with courage",
                    "vi": "đối mặt với một tình huống khó khăn hoặc nguy hiểm một cách trực tiếp và can đảm"
                },
                "examples": [
                    {
                        "en": "Nora decided to take the bull by the horns and organize things for herself.",
                        "vi": "Nora quyết định lấy sừng con bò và sắp xếp mọi thứ cho chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "86b42c08b72c43c3966dbd2f23f309d7",
        "word": "open verdict",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊpən ˈvɜːdɪkt/",
            "us": "/ˌəʊpən ˈvɜːrdɪkt/"
        },
        "nearby": [
            {
                "word": "the Open University",
                "pos": ""
            },
            {
                "word": "open up",
                "pos": "phrasal verb"
            },
            {
                "word": "open verdict",
                "pos": "noun"
            },
            {
                "word": "opera",
                "pos": "noun"
            },
            {
                "word": "operable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official decision in a British court stating that the exact cause of a person’s death is not known",
                    "vi": "một quyết định chính thức của một tòa án Anh nói rằng nguyên nhân chính xác của cái chết của một người không được biết"
                },
                "examples": [
                    {
                        "en": "After the inquest, the coroner recorded an open verdict.",
                        "vi": "Sau khi thẩm vấn, nhân viên điều tra đã ghi một bản án mở."
                    }
                ]
            }
        ]
    },
    {
        "id": "1eafce76605b4857bcf8daa64ae5dfbd",
        "word": "override",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvəˈraɪd/",
            "us": "/ˌəʊvərˈraɪd/"
        },
        "nearby": [
            {
                "word": "overreact",
                "pos": "verb"
            },
            {
                "word": "overreaction",
                "pos": "noun"
            },
            {
                "word": "override",
                "pos": "verb"
            },
            {
                "word": "overriding",
                "pos": "adjective"
            },
            {
                "word": "overripe",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to use your authority to reject somebody’s decision, order, etc.",
                    "vi": "sử dụng quyền hạn của bạn để từ chối quyết định, lệnh của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "The chairman overrode the committee's objections and signed the agreement.",
                        "vi": "Chủ tịch phủ nhận sự phản đối của ủy ban và ký vào thỏa thuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be more important than something",
                    "vi": "quan trọng hơn cái gì đó"
                },
                "examples": [
                    {
                        "en": "Considerations of safety override all other concerns.",
                        "vi": "Các cân nhắc về an toàn đè lên tất cả các mối quan tâm khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to interrupt the action of a device that usually works by itself in order to control it yourself",
                    "vi": "để làm gián đoạn hoạt động của một thiết bị thường tự hoạt động để tự điều khiển nó"
                },
                "examples": [
                    {
                        "en": "A special code is needed to override the time lock.",
                        "vi": "Một mã đặc biệt là cần thiết để ghi đè khóa thời gian."
                    }
                ]
            }
        ]
    },
    {
        "id": "2917c2e628084047a80391c10e584d7e",
        "word": "overrule",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvəˈruːl/",
            "us": "/ˌəʊvərˈruːl/"
        },
        "nearby": [
            {
                "word": "overriding",
                "pos": "adjective"
            },
            {
                "word": "overripe",
                "pos": "adjective"
            },
            {
                "word": "overrule",
                "pos": "verb"
            },
            {
                "word": "overrun",
                "pos": "noun"
            },
            {
                "word": "overrun",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change a decision or reject an idea from a position of greater power",
                    "vi": "để thay đổi một quyết định hoặc bác bỏ một ý tưởng từ một vị trí có quyền lực lớn hơn"
                },
                "examples": [
                    {
                        "en": "to overrule a decision/an objection",
                        "vi": "vượt qua một quyết định / một phản đối"
                    },
                    {
                        "en": "The verdict was overruled by the Supreme Court.",
                        "vi": "Bản án đã bị Tòa án Tối cao bác bỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ca28a3c1ff0b450abaf5b03fb7a4f2cf",
        "word": "pick a winner",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪk/",
            "us": "/pɪk/"
        },
        "nearby": [
            {
                "word": "piccaninny",
                "pos": "noun"
            },
            {
                "word": "piccolo",
                "pos": "noun"
            },
            {
                "word": "pick",
                "pos": "verb"
            },
            {
                "word": "pick",
                "pos": "noun"
            },
            {
                "word": "pick-and-mix",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody/something from a group of people or things",
                    "vi": "để chọn ai đó / điều gì đó từ một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "pick somebody/something Pick a number from one to twenty.",
                        "vi": "chọn ai đó / cái gì đó Chọn một số từ một đến hai mươi."
                    },
                    {
                        "en": "They are picking the final team this weekend.",
                        "vi": "Họ sẽ chọn đội cuối cùng vào cuối tuần này."
                    },
                    {
                        "en": "It's time to pick a side (= decide who you support).",
                        "vi": "Đã đến lúc chọn một bên (= quyết định xem bạn ủng hộ ai)."
                    },
                    {
                        "en": "He picked his words carefully.",
                        "vi": "Anh cẩn thận lựa lời."
                    },
                    {
                        "en": "At the beach we picked a spot to sit down.",
                        "vi": "Tại bãi biển, chúng tôi chọn một chỗ để ngồi xuống."
                    },
                    {
                        "en": "pick somebody/something to do something He has been picked to play in this week's game.",
                        "vi": "pick somebody / something to do something Anh ấy đã được chọn để chơi trong trò chơi tuần này."
                    },
                    {
                        "en": "pick somebody/something for something Have you been picked for the team?",
                        "vi": "pick somebody / something for something Bạn đã được chọn vào đội chưa?"
                    },
                    {
                        "en": "pick somebody/something as something It was picked as the best film in the competition.",
                        "vi": "pick somebody / something as something Phim được chọn là phim hay nhất trong cuộc thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take flowers, fruit, etc. from the plant or the tree where they are growing",
                    "vi": "lấy hoa, quả, v.v. từ cây hoặc cây nơi chúng đang phát triển"
                },
                "examples": [
                    {
                        "en": "to pick grapes/strawberries/cotton",
                        "vi": "hái nho / dâu tây / bông"
                    },
                    {
                        "en": "flowers freshly picked from the garden",
                        "vi": "hoa mới hái từ vườn"
                    },
                    {
                        "en": "The common was a great place to go blackberry picking.",
                        "vi": "Điểm chung là một nơi tuyệt vời để đi hái dâu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pull or remove something or small pieces of something from something else, especially with your fingers",
                    "vi": "để kéo hoặc loại bỏ một thứ gì đó hoặc những mảnh nhỏ của thứ gì đó từ thứ khác, đặc biệt là bằng các ngón tay của bạn"
                },
                "examples": [
                    {
                        "en": "pick something + adv./prep. She picked bits of fluff from his sweater.",
                        "vi": "chọn cái gì đó + adv./prep. Cô nhặt những sợi lông tơ từ chiếc áo len của anh."
                    },
                    {
                        "en": "He picked the nuts off the top of the cake.",
                        "vi": "Anh ta nhặt những quả hạch ở trên cùng của chiếc bánh."
                    },
                    {
                        "en": "Names were picked at random out of a hat.",
                        "vi": "Những cái tên được chọn ngẫu nhiên từ một chiếc mũ."
                    },
                    {
                        "en": "pick something to pick your nose (= put your finger inside your nose to remove dried mucus)",
                        "vi": "lấy thứ gì đó để ngoáy mũi (= đưa ngón tay vào trong mũi để loại bỏ chất nhầy khô)"
                    },
                    {
                        "en": "to pick your teeth (= use a small sharp piece of wood or plastice to remove pieces of food from your teeth)",
                        "vi": "ngoáy răng (= dùng một mảnh gỗ nhỏ sắc nhọn hoặc miếng nhựa để loại bỏ các mảnh thức ăn trên răng của bạn)"
                    },
                    {
                        "en": "pick something + adj. The dogs picked the bones clean (= ate all the meat from the bones).",
                        "vi": "chọn cái gì đó + adj. Những con chó nhặt sạch xương (= ăn hết thịt từ xương)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a musical instrument, especially a guitar, by pulling the strings with your fingers",
                    "vi": "để chơi một nhạc cụ, đặc biệt là guitar, bằng cách dùng ngón tay kéo dây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody about something and want to discuss it with them",
                    "vi": "tức giận với ai đó về điều gì đó và muốn thảo luận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose only those things that you like or want very much",
                    "vi": "chỉ chọn những thứ mà bạn thích hoặc rất muốn"
                },
                "examples": [
                    {
                        "en": "You have to take any job you can get—you can't pick and choose.",
                        "vi": "Bạn phải nhận bất kỳ công việc nào mà bạn có thể nhận được — bạn không thể chọn và chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about something because they know more about the subject than you do",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về điều gì đó bởi vì họ biết nhiều hơn về chủ đề này hơn bạn"
                },
                "examples": [
                    {
                        "en": "I need to pick your brains: what can you tell me about credit unions?",
                        "vi": "Tôi cần phải chọn bộ não của bạn: bạn có thể cho tôi biết điều gì về các công đoàn tín dụng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deliberately start a fight or an argument with somebody",
                    "vi": "cố tình bắt đầu một cuộc chiến hoặc một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "He had drunk too much and was ready to pick a fight with anyone who crossed his path.",
                        "vi": "Anh ta đã uống quá nhiều và sẵn sàng gây gổ với bất cứ ai băng qua đường của mình."
                    },
                    {
                        "en": "She tried to pick a quarrel with me.",
                        "vi": "Cô ấy cố cãi nhau với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the weak points in something such as a plan, suggestion, etc.",
                    "vi": "để tìm ra những điểm yếu trong một cái gì đó chẳng hạn như một kế hoạch, gợi ý, v.v."
                },
                "examples": [
                    {
                        "en": "It was easy to pick holes in his arguments.",
                        "vi": "Thật dễ dàng để tìm ra lỗ hổng trong các lập luận của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somebody’s pocket without them noticing",
                    "vi": "ăn trộm thứ gì đó từ túi của ai đó mà họ không nhận ra"
                },
                "examples": [
                    {
                        "en": "The back pocket on a pair of jeans is the easiest one to pick.",
                        "vi": "Túi sau của quần jean là túi dễ chọn nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Their case was torn to shreds by the defence lawyer.",
                        "vi": "Vụ án của họ đã bị luật sư bào chữa xé thành từng mảnh nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay for something",
                    "vi": "để trả tiền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company picked up the tab for his hotel room.",
                        "vi": "Công ty đã chọn tab cho phòng khách sạn của anh ấy."
                    },
                    {
                        "en": "The government will continue to pick up college fees for some students.",
                        "vi": "Chính phủ sẽ tiếp tục thu học phí đại học đối với một số sinh viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return or to help somebody return to a normal situation, particularly after a shock or a disaster",
                    "vi": "để trở lại hoặc để giúp ai đó trở lại tình trạng bình thường, đặc biệt là sau một cú sốc hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "You cannot live your children's lives for them; you can only be there to pick up the pieces when things go wrong.",
                        "vi": "Bạn không thể sống cuộc sống của con cái bạn cho chúng; bạn chỉ có thể ở đó để nhặt từng mảnh khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go faster",
                    "vi": "đi nhanh hơn"
                },
                "examples": [
                    {
                        "en": "The train began to pick up speed.",
                        "vi": "Tàu bắt đầu tăng tốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to an earlier situation or way of life after a period doing something else",
                    "vi": "trở lại hoàn cảnh hoặc lối sống trước đó sau một thời gian làm việc khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to walk carefully, choosing the safest, driest, etc. place to put your feet",
                    "vi": "bước đi cẩn thận, chọn nơi an toàn nhất, khô ráo nhất, v.v. để đặt chân"
                },
                "examples": [
                    {
                        "en": "She picked her way delicately over the rough ground.",
                        "vi": "Cô ấy chọn đường một cách tế nhị trên mặt đất gồ ghề."
                    },
                    {
                        "en": "We picked our way carefully over the jagged rocks.",
                        "vi": "Chúng tôi chọn đường cẩn thận qua những tảng đá lởm chởm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a horse, etc. that you think is most likely to win a race",
                    "vi": "để chọn một con ngựa, v.v. mà bạn cho rằng có nhiều khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "He's very good at picking winners.",
                        "vi": "Anh ấy rất giỏi trong việc chọn người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a very good choice",
                    "vi": "để đưa ra một lựa chọn rất tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "offering somebody an ideal opportunity to gain an advantage",
                    "vi": "cung cấp cho ai đó một cơ hội lý tưởng để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "This is an opportunity ripe for the picking.",
                        "vi": "Đây là thời cơ chín muồi để hái."
                    },
                    {
                        "en": "The Raiders' defense is ripe for the picking.",
                        "vi": "Hàng phòng thủ của Raiders đã chín muồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c9e1a7257c664dd8b6d1b0f56f3a58a7",
        "word": "pick and choose",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪk/",
            "us": "/pɪk/"
        },
        "nearby": [
            {
                "word": "piccaninny",
                "pos": "noun"
            },
            {
                "word": "piccolo",
                "pos": "noun"
            },
            {
                "word": "pick",
                "pos": "verb"
            },
            {
                "word": "pick",
                "pos": "noun"
            },
            {
                "word": "pick-and-mix",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody/something from a group of people or things",
                    "vi": "để chọn ai đó / điều gì đó từ một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "pick somebody/something Pick a number from one to twenty.",
                        "vi": "chọn ai đó / cái gì đó Chọn một số từ một đến hai mươi."
                    },
                    {
                        "en": "They are picking the final team this weekend.",
                        "vi": "Họ sẽ chọn đội cuối cùng vào cuối tuần này."
                    },
                    {
                        "en": "It's time to pick a side (= decide who you support).",
                        "vi": "Đã đến lúc chọn một bên (= quyết định xem bạn ủng hộ ai)."
                    },
                    {
                        "en": "He picked his words carefully.",
                        "vi": "Anh cẩn thận lựa lời."
                    },
                    {
                        "en": "At the beach we picked a spot to sit down.",
                        "vi": "Tại bãi biển, chúng tôi chọn một chỗ để ngồi xuống."
                    },
                    {
                        "en": "pick somebody/something to do something He has been picked to play in this week's game.",
                        "vi": "pick somebody / something to do something Anh ấy đã được chọn để chơi trong trò chơi tuần này."
                    },
                    {
                        "en": "pick somebody/something for something Have you been picked for the team?",
                        "vi": "pick somebody / something for something Bạn đã được chọn vào đội chưa?"
                    },
                    {
                        "en": "pick somebody/something as something It was picked as the best film in the competition.",
                        "vi": "pick somebody / something as something Phim được chọn là phim hay nhất trong cuộc thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take flowers, fruit, etc. from the plant or the tree where they are growing",
                    "vi": "lấy hoa, quả, v.v. từ cây hoặc cây nơi chúng đang phát triển"
                },
                "examples": [
                    {
                        "en": "to pick grapes/strawberries/cotton",
                        "vi": "hái nho / dâu tây / bông"
                    },
                    {
                        "en": "flowers freshly picked from the garden",
                        "vi": "hoa mới hái từ vườn"
                    },
                    {
                        "en": "The common was a great place to go blackberry picking.",
                        "vi": "Điểm chung là một nơi tuyệt vời để đi hái dâu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pull or remove something or small pieces of something from something else, especially with your fingers",
                    "vi": "để kéo hoặc loại bỏ một thứ gì đó hoặc những mảnh nhỏ của thứ gì đó từ thứ khác, đặc biệt là bằng các ngón tay của bạn"
                },
                "examples": [
                    {
                        "en": "pick something + adv./prep. She picked bits of fluff from his sweater.",
                        "vi": "chọn cái gì đó + adv./prep. Cô nhặt những sợi lông tơ từ chiếc áo len của anh."
                    },
                    {
                        "en": "He picked the nuts off the top of the cake.",
                        "vi": "Anh ta nhặt những quả hạch ở trên cùng của chiếc bánh."
                    },
                    {
                        "en": "Names were picked at random out of a hat.",
                        "vi": "Những cái tên được chọn ngẫu nhiên từ một chiếc mũ."
                    },
                    {
                        "en": "pick something to pick your nose (= put your finger inside your nose to remove dried mucus)",
                        "vi": "lấy thứ gì đó để ngoáy mũi (= đưa ngón tay vào trong mũi để loại bỏ chất nhầy khô)"
                    },
                    {
                        "en": "to pick your teeth (= use a small sharp piece of wood or plastice to remove pieces of food from your teeth)",
                        "vi": "ngoáy răng (= dùng một mảnh gỗ nhỏ sắc nhọn hoặc miếng nhựa để loại bỏ các mảnh thức ăn trên răng của bạn)"
                    },
                    {
                        "en": "pick something + adj. The dogs picked the bones clean (= ate all the meat from the bones).",
                        "vi": "chọn cái gì đó + adj. Những con chó nhặt sạch xương (= ăn hết thịt từ xương)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a musical instrument, especially a guitar, by pulling the strings with your fingers",
                    "vi": "để chơi một nhạc cụ, đặc biệt là guitar, bằng cách dùng ngón tay kéo dây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody about something and want to discuss it with them",
                    "vi": "tức giận với ai đó về điều gì đó và muốn thảo luận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose only those things that you like or want very much",
                    "vi": "chỉ chọn những thứ mà bạn thích hoặc rất muốn"
                },
                "examples": [
                    {
                        "en": "You have to take any job you can get—you can't pick and choose.",
                        "vi": "Bạn phải nhận bất kỳ công việc nào mà bạn có thể nhận được — bạn không thể chọn và chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about something because they know more about the subject than you do",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về điều gì đó bởi vì họ biết nhiều hơn về chủ đề này hơn bạn"
                },
                "examples": [
                    {
                        "en": "I need to pick your brains: what can you tell me about credit unions?",
                        "vi": "Tôi cần phải chọn bộ não của bạn: bạn có thể cho tôi biết điều gì về các công đoàn tín dụng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deliberately start a fight or an argument with somebody",
                    "vi": "cố tình bắt đầu một cuộc chiến hoặc một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "He had drunk too much and was ready to pick a fight with anyone who crossed his path.",
                        "vi": "Anh ta đã uống quá nhiều và sẵn sàng gây gổ với bất cứ ai băng qua đường của mình."
                    },
                    {
                        "en": "She tried to pick a quarrel with me.",
                        "vi": "Cô ấy cố cãi nhau với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the weak points in something such as a plan, suggestion, etc.",
                    "vi": "để tìm ra những điểm yếu trong một cái gì đó chẳng hạn như một kế hoạch, gợi ý, v.v."
                },
                "examples": [
                    {
                        "en": "It was easy to pick holes in his arguments.",
                        "vi": "Thật dễ dàng để tìm ra lỗ hổng trong các lập luận của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somebody’s pocket without them noticing",
                    "vi": "ăn trộm thứ gì đó từ túi của ai đó mà họ không nhận ra"
                },
                "examples": [
                    {
                        "en": "The back pocket on a pair of jeans is the easiest one to pick.",
                        "vi": "Túi sau của quần jean là túi dễ chọn nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Their case was torn to shreds by the defence lawyer.",
                        "vi": "Vụ án của họ đã bị luật sư bào chữa xé thành từng mảnh nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay for something",
                    "vi": "để trả tiền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company picked up the tab for his hotel room.",
                        "vi": "Công ty đã chọn tab cho phòng khách sạn của anh ấy."
                    },
                    {
                        "en": "The government will continue to pick up college fees for some students.",
                        "vi": "Chính phủ sẽ tiếp tục thu học phí đại học đối với một số sinh viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return or to help somebody return to a normal situation, particularly after a shock or a disaster",
                    "vi": "để trở lại hoặc để giúp ai đó trở lại tình trạng bình thường, đặc biệt là sau một cú sốc hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "You cannot live your children's lives for them; you can only be there to pick up the pieces when things go wrong.",
                        "vi": "Bạn không thể sống cuộc sống của con cái bạn cho chúng; bạn chỉ có thể ở đó để nhặt từng mảnh khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go faster",
                    "vi": "đi nhanh hơn"
                },
                "examples": [
                    {
                        "en": "The train began to pick up speed.",
                        "vi": "Tàu bắt đầu tăng tốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to an earlier situation or way of life after a period doing something else",
                    "vi": "trở lại hoàn cảnh hoặc lối sống trước đó sau một thời gian làm việc khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to walk carefully, choosing the safest, driest, etc. place to put your feet",
                    "vi": "bước đi cẩn thận, chọn nơi an toàn nhất, khô ráo nhất, v.v. để đặt chân"
                },
                "examples": [
                    {
                        "en": "She picked her way delicately over the rough ground.",
                        "vi": "Cô ấy chọn đường một cách tế nhị trên mặt đất gồ ghề."
                    },
                    {
                        "en": "We picked our way carefully over the jagged rocks.",
                        "vi": "Chúng tôi chọn đường cẩn thận qua những tảng đá lởm chởm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a horse, etc. that you think is most likely to win a race",
                    "vi": "để chọn một con ngựa, v.v. mà bạn cho rằng có nhiều khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "He's very good at picking winners.",
                        "vi": "Anh ấy rất giỏi trong việc chọn người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a very good choice",
                    "vi": "để đưa ra một lựa chọn rất tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "offering somebody an ideal opportunity to gain an advantage",
                    "vi": "cung cấp cho ai đó một cơ hội lý tưởng để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "This is an opportunity ripe for the picking.",
                        "vi": "Đây là thời cơ chín muồi để hái."
                    },
                    {
                        "en": "The Raiders' defense is ripe for the picking.",
                        "vi": "Hàng phòng thủ của Raiders đã chín muồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d9c02388bf54adb90da2d6c04635022",
        "word": "quorate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɔːreɪt/",
            "us": "/ˈkwɔːreɪt/"
        },
        "nearby": [
            {
                "word": "quoll",
                "pos": "noun"
            },
            {
                "word": "Quonset hut",
                "pos": "noun"
            },
            {
                "word": "quorate",
                "pos": "adjective"
            },
            {
                "word": "Quorn",
                "pos": "noun"
            },
            {
                "word": "the Quorn",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a meeting that is quorate has enough people present for them to make official decisions by voting",
                    "vi": "một cuộc họp có đủ người có mặt để họ đưa ra quyết định chính thức bằng cách bỏ phiếu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "71b5d82b4367460d853835288e098926",
        "word": "quorum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɔːrəm/",
            "us": "/ˈkwɔːrəm/"
        },
        "nearby": [
            {
                "word": "Quorn",
                "pos": "noun"
            },
            {
                "word": "the Quorn",
                "pos": ""
            },
            {
                "word": "quorum",
                "pos": "noun"
            },
            {
                "word": "quota",
                "pos": "noun"
            },
            {
                "word": "quotable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the smallest number of people who must be at a meeting before it can begin or decisions can be made",
                    "vi": "số lượng người ít nhất phải có mặt tại cuộc họp trước khi cuộc họp bắt đầu hoặc có thể đưa ra quyết định"
                },
                "examples": [
                    {
                        "en": "If a quorum is not present, the meeting must be adjourned.",
                        "vi": "Nếu không đủ túc số, cuộc họp phải được hoãn lại."
                    },
                    {
                        "en": "I’m afraid we don’t have a quorum.",
                        "vi": "Tôi e rằng chúng ta không có đủ túc số."
                    },
                    {
                        "en": "The number of representatives attending was too small to constitute a quorum.",
                        "vi": "Số lượng đại diện tham dự quá ít để tạo thành một nhóm túc số."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8687a7517e346ea90df80f608b0bcc5",
        "word": "railroad",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪlrəʊd/",
            "us": "/ˈreɪlrəʊd/"
        },
        "nearby": [
            {
                "word": "rail off",
                "pos": "phrasal verb"
            },
            {
                "word": "railroad",
                "pos": "noun"
            },
            {
                "word": "railroad",
                "pos": "verb"
            },
            {
                "word": "railroad crossing",
                "pos": "noun"
            },
            {
                "word": "railroader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to force somebody to do something before they have had enough time to decide whether or not they want to do it",
                    "vi": "buộc ai đó làm điều gì đó trước khi họ có đủ thời gian để quyết định xem họ có muốn làm điều đó hay không"
                },
                "examples": [
                    {
                        "en": "be railroaded into doing something I will not be railroaded into signing something I don't agree with.",
                        "vi": "say mê làm điều gì đó Tôi sẽ không say mê ký một điều gì đó mà tôi không đồng ý."
                    },
                    {
                        "en": "be railroaded into something We were railroaded into a poor deal.",
                        "vi": "được đường sắt vào một cái gì đó Chúng tôi đã được đường sắt vào một thỏa thuận kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a group of people accept a decision, law, etc. quickly by putting pressure on them",
                    "vi": "để khiến một nhóm người nhanh chóng chấp nhận một quyết định, luật, v.v. bằng cách gây áp lực lên họ"
                },
                "examples": [
                    {
                        "en": "be railroaded through something The bill was railroaded through the House.",
                        "vi": "được đường sắt thông qua một cái gì đó Dự luật đã được đường sắt thông qua Nhà."
                    },
                    {
                        "en": "be railroaded through The changes were railroaded through.",
                        "vi": "được đường sắt thông qua Những thay đổi đã được đường sắt thông qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide that somebody is guilty of a crime, without giving them a fair trial",
                    "vi": "để quyết định rằng ai đó phạm tội mà không đưa ra xét xử công bằng cho họ"
                },
                "examples": [
                    {
                        "en": "be railroaded He knows he's being railroaded.",
                        "vi": "được đường sắt Anh ấy biết anh ấy đang được đường sắt."
                    }
                ]
            }
        ]
    },
    {
        "id": "9eae6df1a2b844a0a7d3c73194a43462",
        "word": "reconsideration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːkənˌsɪdəˈreɪʃn/",
            "us": "/ˌriːkənˌsɪdəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "reconquer",
                "pos": "verb"
            },
            {
                "word": "reconsider",
                "pos": "verb"
            },
            {
                "word": "reconsideration",
                "pos": "noun"
            },
            {
                "word": "reconstitute",
                "pos": "verb"
            },
            {
                "word": "reconstitution",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of thinking about something again, especially because you might want to change a previous decision or opinion",
                    "vi": "hành động hoặc quá trình suy nghĩ lại về điều gì đó, đặc biệt là vì bạn có thể muốn thay đổi quyết định hoặc quan điểm trước đó"
                },
                "examples": [
                    {
                        "en": "They called for a reconsideration of the issue.",
                        "vi": "Họ kêu gọi xem xét lại vấn đề."
                    }
                ]
            }
        ]
    },
    {
        "id": "4afc414502e440f58670ce3d09407570",
        "word": "remit to",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "remit",
                "pos": "verb"
            },
            {
                "word": "remittance",
                "pos": "noun"
            },
            {
                "word": "remit to",
                "pos": "phrasal verb"
            },
            {
                "word": "remix",
                "pos": "noun"
            },
            {
                "word": "remix",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send a matter to an authority so that a decision can be made",
                    "vi": "gửi một vấn đề đến một cơ quan có thẩm quyền để có thể đưa ra quyết định"
                },
                "examples": [
                    {
                        "en": "The case was remitted to the Court of Appeal.",
                        "vi": "Vụ án đã được chuyển lên Tòa án cấp phúc thẩm."
                    }
                ]
            }
        ]
    },
    {
        "id": "b50eaa73657345c19b669b547365aa09",
        "word": "resolve",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈzɒlv/",
            "us": "/rɪˈzɑːlv/"
        },
        "nearby": [
            {
                "word": "resoluteness",
                "pos": "noun"
            },
            {
                "word": "resolution",
                "pos": "noun"
            },
            {
                "word": "resolve",
                "pos": "verb"
            },
            {
                "word": "resolve",
                "pos": "noun"
            },
            {
                "word": "resolved",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find an acceptable solution to a problem or difficulty",
                    "vi": "để tìm một giải pháp có thể chấp nhận được cho một vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "resolve something to resolve an issue/a dispute/a conflict/a crisis",
                        "vi": "giải quyết một cái gì đó để giải quyết một vấn đề / một tranh chấp / một cuộc xung đột / một cuộc khủng hoảng"
                    },
                    {
                        "en": "Attempts are being made to resolve the problem of security in schools.",
                        "vi": "Các nỗ lực đang được thực hiện để giải quyết vấn đề an ninh trong trường học."
                    },
                    {
                        "en": "Both sides met in order to try to resolve their differences.",
                        "vi": "Cả hai bên đã gặp nhau để cố gắng giải quyết những khác biệt của họ."
                    },
                    {
                        "en": "We hope to resolve the matter as soon as possible.",
                        "vi": "Chúng tôi hy vọng sẽ giải quyết vấn đề càng sớm càng tốt."
                    },
                    {
                        "en": "Everything is being done to resolve the situation.",
                        "vi": "Mọi thứ đang được thực hiện để giải quyết tình hình."
                    },
                    {
                        "en": "The dispute has not been fully resolved.",
                        "vi": "Tranh chấp vẫn chưa được giải quyết triệt để."
                    },
                    {
                        "en": "resolve itself Be patient and the situation may resolve itself.",
                        "vi": "tự giải quyết Hãy kiên nhẫn và tình huống có thể tự giải quyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a definite decision to do something",
                    "vi": "để đưa ra quyết định chắc chắn để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "resolve to do something He resolved not to tell her the truth.",
                        "vi": "quyết tâm làm điều gì đó Anh quyết tâm không nói cho cô biết sự thật."
                    },
                    {
                        "en": "He resolved to do something to help the children he had met.",
                        "vi": "Anh quyết tâm làm điều gì đó để giúp đỡ những đứa trẻ mà anh đã gặp."
                    },
                    {
                        "en": "resolve (that)… She resolved that she would never see him again.",
                        "vi": "quyết tâm (điều đó)… Cô ấy quyết định rằng cô ấy sẽ không bao giờ gặp lại anh ấy nữa."
                    },
                    {
                        "en": "resolve on doing something We had resolved on making an early start.",
                        "vi": "quyết tâm làm điều gì đó Chúng tôi đã giải quyết khi bắt đầu sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reach a decision by means of a formal vote",
                    "vi": "đi đến quyết định bằng một cuộc bỏ phiếu chính thức"
                },
                "examples": [
                    {
                        "en": "it is resolved that… It was resolved that the matter be referred to a higher authority.",
                        "vi": "nó đã được giải quyết rằng ... Nó đã được giải quyết rằng vấn đề được chuyển đến một cơ quan có thẩm quyền cao hơn."
                    },
                    {
                        "en": "resolve that… They resolved that the matter be referred to a higher authority.",
                        "vi": "giải quyết điều đó… Họ đã giải quyết rằng vấn đề phải được chuyển đến cơ quan có thẩm quyền cao hơn."
                    },
                    {
                        "en": "The committee unanimously resolved that the party chairman should step down.",
                        "vi": "Ủy ban nhất trí giải quyết rằng chủ tịch đảng phải từ chức."
                    },
                    {
                        "en": "resolve to do something The Supreme Council resolved to resume control over the national press.",
                        "vi": "quyết tâm làm điều gì đó Hội đồng tối cao quyết tâm nối lại quyền kiểm soát đối với báo chí quốc gia."
                    },
                    {
                        "en": "resolve on something The board of directors has called a meeting to resolve on the merger.",
                        "vi": "giải quyết vấn đề nào đó Ban giám đốc đã triệu tập một cuộc họp để giải quyết về việc sáp nhập."
                    }
                ]
            }
        ]
    },
    {
        "id": "3b2392cc09ca46dfa0078d52888831a0",
        "word": "retreat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈtriːt/",
            "us": "/rɪˈtriːt/"
        },
        "nearby": [
            {
                "word": "retread",
                "pos": "noun"
            },
            {
                "word": "retread",
                "pos": "verb"
            },
            {
                "word": "retreat",
                "pos": "noun"
            },
            {
                "word": "retreat",
                "pos": "verb"
            },
            {
                "word": "retrench",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a movement away from a place or an enemy because of danger or defeat",
                    "vi": "một chuyển động ra khỏi một địa điểm hoặc kẻ thù vì nguy hiểm hoặc thất bại"
                },
                "examples": [
                    {
                        "en": "Napoleon’s retreat from Moscow",
                        "vi": "Napoléon rút lui khỏi Moscow"
                    },
                    {
                        "en": "The army was in full retreat (= retreating very quickly).",
                        "vi": "Quân đội đã hoàn toàn rút lui (= rút lui rất nhanh)."
                    },
                    {
                        "en": "to sound the retreat (= to give a loud signal for an army to move away)",
                        "vi": "để phát ra âm thanh rút lui (= để phát ra tín hiệu lớn cho một đội quân di chuyển đi)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of trying to escape from a particular situation to one that you think is safer or more pleasant",
                    "vi": "một hành động cố gắng thoát khỏi một tình huống cụ thể đến một tình huống mà bạn nghĩ là an toàn hơn hoặc dễ chịu hơn"
                },
                "examples": [
                    {
                        "en": "Is watching television a retreat from reality?",
                        "vi": "Xem truyền hình có phải là một cách rút lui khỏi thực tế?"
                    },
                    {
                        "en": "her retreat into a fantasy world of her own",
                        "vi": "cô ấy rút lui vào một thế giới tưởng tượng của riêng cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of changing a decision because of criticism or because a situation has become too difficult",
                    "vi": "một hành động thay đổi quyết định vì bị chỉ trích hoặc vì một tình huống trở nên quá khó khăn"
                },
                "examples": [
                    {
                        "en": "The Senator made an embarrassing retreat from his earlier position.",
                        "vi": "Thượng nghị sĩ đã rút lui một cách đáng xấu hổ khỏi vị trí trước đó của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quiet, private place that you go to in order to get away from your usual life",
                    "vi": "một nơi yên tĩnh, riêng tư mà bạn đến để thoát khỏi cuộc sống thường ngày"
                },
                "examples": [
                    {
                        "en": "a country retreat",
                        "vi": "một cuộc rút lui ở đồng quê"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time when somebody stops their usual activities and goes to a quiet place for prayer and thought; an organized event when people can do this",
                    "vi": "khoảng thời gian khi ai đó dừng các hoạt động thường ngày của họ và đến một nơi yên tĩnh để cầu nguyện và suy nghĩ; một sự kiện được tổ chức khi mọi người có thể làm điều này"
                },
                "examples": [
                    {
                        "en": "He went into retreat and tried to resolve the conflicts within himself.",
                        "vi": "Anh ta nhập thất và cố gắng giải quyết những mâu thuẫn trong chính mình."
                    },
                    {
                        "en": "He went on a Buddhist retreat.",
                        "vi": "Anh ta đi tu theo đạo Phật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go away or back quickly, especially to avoid something unpleasant",
                    "vi": "để đi hoặc quay lại nhanh chóng, đặc biệt là để tránh điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "I decided to beat a hasty retreat.",
                        "vi": "Tôi quyết định đánh bại một cuộc rút lui vội vàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "77018387e4864b3792e73ba5f87c832f",
        "word": "return",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈtɜːn/",
            "us": "/rɪˈtɜːrn/"
        },
        "nearby": [
            {
                "word": "retry",
                "pos": "verb"
            },
            {
                "word": "retsina",
                "pos": "noun"
            },
            {
                "word": "return",
                "pos": "verb"
            },
            {
                "word": "return",
                "pos": "noun"
            },
            {
                "word": "returnable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come or go back from one place to another",
                    "vi": "đến hoặc quay lại từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "I waited a long time for him to return.",
                        "vi": "Tôi đã đợi anh ấy về rất lâu rồi."
                    },
                    {
                        "en": "returning emigrants/exiles/refugees (= who are coming home after being away)",
                        "vi": "người di cư trở về / người lưu vong / người tị nạn (= người sẽ trở về nhà sau khi đi vắng)"
                    },
                    {
                        "en": "return to… She's returning to Australia tomorrow after six months in Europe.",
                        "vi": "trở lại… Cô ấy sẽ trở lại Úc vào ngày mai sau sáu tháng ở Châu Âu."
                    },
                    {
                        "en": "He had recently returned to this country after living in Spain.",
                        "vi": "Anh ấy gần đây đã trở lại đất nước này sau khi sống ở Tây Ban Nha."
                    },
                    {
                        "en": "I had to return to the store to look for my purse.",
                        "vi": "Tôi phải quay lại cửa hàng để tìm ví của mình."
                    },
                    {
                        "en": "return from… I returned from work to find the house empty.",
                        "vi": "trở về từ… Tôi đi làm về thấy căn nhà trống rỗng."
                    },
                    {
                        "en": "People were returning home for the weekend.",
                        "vi": "Mọi người trở về nhà vào cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring, give, put or send something back to somebody/something",
                    "vi": "mang, cho, đặt hoặc gửi lại một cái gì đó cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "return somebody/something to somebody/something We had to return the hairdryer to the store because it was faulty.",
                        "vi": "trả lại ai đó / cái gì đó cho ai đó / cái gì đó Chúng tôi đã phải trả lại máy sấy tóc cho cửa hàng vì nó bị lỗi."
                    },
                    {
                        "en": "I must return some books to the library.",
                        "vi": "Tôi phải trả lại một số sách cho thư viện."
                    },
                    {
                        "en": "The court ordered him to return the children to their mother.",
                        "vi": "Tòa án yêu cầu anh ta trả lại những đứa trẻ cho mẹ của chúng."
                    },
                    {
                        "en": "Completed questionnaires should be returned to this address.",
                        "vi": "Các bảng câu hỏi đã hoàn thành sẽ được gửi lại địa chỉ này."
                    },
                    {
                        "en": "return something He refused to return our money.",
                        "vi": "trả lại một cái gì đó Anh ta từ chối trả lại tiền của chúng tôi."
                    },
                    {
                        "en": "return somebody/something + adj. I returned the letter unopened.",
                        "vi": "trả lại ai đó / cái gì đó + adj. Tôi trả lại bức thư chưa mở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come back again",
                    "vi": "quay lại lần nữa"
                },
                "examples": [
                    {
                        "en": "The following day the pain returned.",
                        "vi": "Ngày hôm sau cơn đau trở lại."
                    },
                    {
                        "en": "There's a chance the cancer will return.",
                        "vi": "Có khả năng ung thư sẽ quay trở lại."
                    },
                    {
                        "en": "Confidence returned and prices started to rise.",
                        "vi": "Sự tự tin trở lại và giá bắt đầu tăng."
                    },
                    {
                        "en": "The bad weather has returned with a vengeance.",
                        "vi": "Thời tiết xấu đã trở lại với một sự báo thù."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start discussing a subject you were discussing earlier, or doing an activity you were doing earlier",
                    "vi": "để bắt đầu thảo luận về một chủ đề bạn đã thảo luận trước đó hoặc thực hiện một hoạt động bạn đã làm trước đó"
                },
                "examples": [
                    {
                        "en": "He returns to this topic later in the report.",
                        "vi": "Anh ấy trở lại chủ đề này sau trong báo cáo."
                    },
                    {
                        "en": "She looked up briefly then returned to her sewing.",
                        "vi": "Cô nhìn lên một lúc sau đó quay trở lại công việc may vá của mình."
                    },
                    {
                        "en": "The doctor may allow her to return to work next week.",
                        "vi": "Bác sĩ có thể cho phép cô ấy trở lại làm việc vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go back to a previous state",
                    "vi": "để quay lại trạng thái trước đó"
                },
                "examples": [
                    {
                        "en": "Train services have returned to normal after the strike.",
                        "vi": "Dịch vụ tàu hỏa đã trở lại bình thường sau cuộc đình công."
                    },
                    {
                        "en": "The land has returned to its natural state.",
                        "vi": "Đất đã trở lại trạng thái tự nhiên."
                    },
                    {
                        "en": "Many find returning to civilian life difficult.",
                        "vi": "Nhiều người cảm thấy khó khăn khi trở lại cuộc sống thường dân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do or give something to somebody because they have done or given the same to you first; to have the same feeling about somebody that they have about you",
                    "vi": "để làm hoặc đưa một cái gì đó cho ai đó bởi vì họ đã làm hoặc đưa điều tương tự cho bạn trước tiên; có cùng cảm giác về ai đó mà họ có về bạn"
                },
                "examples": [
                    {
                        "en": "to return a smile/gaze/greeting",
                        "vi": "để đáp lại một nụ cười / ánh mắt / lời chào"
                    },
                    {
                        "en": "If you assist people when they ask for help, it is more likely they will return the favour.",
                        "vi": "Nếu bạn giúp đỡ mọi người khi họ yêu cầu giúp đỡ, thì nhiều khả năng họ sẽ trả ơn."
                    },
                    {
                        "en": "She phoned him several times but he was too busy to return her call.",
                        "vi": "Cô đã gọi điện cho anh nhiều lần nhưng anh quá bận nên không thể gọi lại cho cô."
                    },
                    {
                        "en": "It's time we returned their invitation (= invite them to something as they invited us first).",
                        "vi": "Đã đến lúc chúng tôi gửi lại lời mời của họ (= mời họ tham gia một cái gì đó như họ đã mời chúng tôi trước)."
                    },
                    {
                        "en": "‘You were both wonderful!’ ‘So were you!’ we said, returning the compliment.",
                        "vi": "Cả hai bạn đều tuyệt vời!' 'Bạn cũng vậy!' chúng tôi nói, đáp lại lời khen."
                    },
                    {
                        "en": "to return a kiss (= to kiss somebody with the same enthusiasm with which they kiss you)",
                        "vi": "để đáp lại một nụ hôn (= hôn ai đó với cùng sự nhiệt tình mà họ hôn bạn)"
                    },
                    {
                        "en": "He did not return her love.",
                        "vi": "Anh không đáp lại tình yêu của cô."
                    },
                    {
                        "en": "to return fire (= to shoot at somebody who is shooting at you)",
                        "vi": "để bắn trả (= bắn vào ai đó đang bắn vào bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit the ball back to your opponent during a game",
                    "vi": "đánh bóng trở lại đối thủ của bạn trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "to return a service/shot",
                        "vi": "để trả lại một dịch vụ / cảnh quay"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a decision about something in court",
                    "vi": "đưa ra quyết định về điều gì đó trước tòa"
                },
                "examples": [
                    {
                        "en": "The jury returned a verdict of not guilty.",
                        "vi": "Bồi thẩm đoàn tuyên bố không có tội."
                    },
                    {
                        "en": "The inquest returned a verdict of accidental death.",
                        "vi": "Cuộc điều tra trả lại một phán quyết về cái chết do tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to elect somebody to a political position",
                    "vi": "bầu ai đó vào một vị trí chính trị"
                },
                "examples": [
                    {
                        "en": "be returned (as something) She was returned as MP for Edgbaston in the last election.",
                        "vi": "được trả lại (như một cái gì đó) Cô ấy đã được trở lại làm nghị sĩ cho Edgbaston trong cuộc bầu cử cuối cùng."
                    },
                    {
                        "en": "be returned (to something) He was returned to Parliament with an increased majority.",
                        "vi": "được trả lại (cho một cái gì đó) Ông đã được trở lại Nghị viện với đa số gia tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or produce a particular amount of money as a profit or loss",
                    "vi": "để cung cấp hoặc sản xuất một số tiền cụ thể như một khoản lãi hoặc lỗ"
                },
                "examples": [
                    {
                        "en": "to return a high rate of interest",
                        "vi": "để trả lại một tỷ lệ lãi suất cao"
                    },
                    {
                        "en": "Last year the company returned a loss of £157 million.",
                        "vi": "Năm ngoái, công ty đã trả lại khoản lỗ 157 triệu bảng Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "84835c6ab9fd4940bc5f69ae23deb365",
        "word": "rowback",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrəʊbæk/",
            "us": "/ˈrəʊbæk/"
        },
        "nearby": [
            {
                "word": "Rowan and Martin's Laugh-In",
                "pos": ""
            },
            {
                "word": "row back",
                "pos": "phrasal verb"
            },
            {
                "word": "rowback",
                "pos": "noun"
            },
            {
                "word": "rowboat",
                "pos": "noun"
            },
            {
                "word": "rowdily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of changing an earlier decision or opinion completely so that it is the opposite of what it was before",
                    "vi": "hành động thay đổi hoàn toàn một quyết định hoặc quan điểm trước đó để nó trái ngược với những gì trước đó"
                },
                "examples": [
                    {
                        "en": "The government was forced into more rowbacks on budget cuts.",
                        "vi": "Chính phủ buộc phải gặp nhiều trở ngại hơn trong việc cắt giảm ngân sách."
                    }
                ]
            }
        ]
    },
    {
        "id": "add7cf659f1e4b11a059332f7d801c6d",
        "word": "rubber-stamp",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrʌbə ˈstæmp/",
            "us": "/ˌrʌbər ˈstæmp/"
        },
        "nearby": [
            {
                "word": "rubber plant",
                "pos": "noun"
            },
            {
                "word": "rubber stamp",
                "pos": "noun"
            },
            {
                "word": "rubber-stamp",
                "pos": "verb"
            },
            {
                "word": "rubbery",
                "pos": "adjective"
            },
            {
                "word": "rubbing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give official approval to a law, plan, decision, etc., especially without considering it carefully",
                    "vi": "phê duyệt chính thức một luật, kế hoạch, quyết định, v.v., đặc biệt là khi chưa xem xét kỹ"
                },
                "examples": [
                    {
                        "en": "The council just rubber-stamps decisions made by a higher authority.",
                        "vi": "Hội đồng chỉ đóng dấu cao su quyết định của cấp trên."
                    }
                ]
            }
        ]
    },
    {
        "id": "1c441e0471044310b427cccbcf18038c",
        "word": "rubber stamp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrʌbə ˈstæmp/",
            "us": "/ˌrʌbər ˈstæmp/"
        },
        "nearby": [
            {
                "word": "rubbernecker",
                "pos": "noun"
            },
            {
                "word": "rubber plant",
                "pos": "noun"
            },
            {
                "word": "rubber stamp",
                "pos": "noun"
            },
            {
                "word": "rubber-stamp",
                "pos": "verb"
            },
            {
                "word": "rubbery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small tool that you hold in your hand and use for printing the date, the name of an organization, etc. on a document",
                    "vi": "một công cụ nhỏ mà bạn cầm trên tay và sử dụng để in ngày tháng, tên tổ chức, v.v. trên tài liệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or group that gives approval to the actions or decisions of others without considering them",
                    "vi": "một người hoặc một nhóm đưa ra sự chấp thuận cho các hành động hoặc quyết định của người khác mà không xem xét chúng"
                },
                "examples": [
                    {
                        "en": "Parliament is seen as a rubber stamp for decisions made elsewhere.",
                        "vi": "Nghị viện được coi như một con dấu cao su cho các quyết định được đưa ra ở những nơi khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d74b68804d44b08a52830e8af676c62",
        "word": "the Rubicon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈruːbɪkən/",
            "us": "/ðə ˈruːbɪkɑːn/"
        },
        "nearby": [
            {
                "word": "rubella",
                "pos": "noun"
            },
            {
                "word": "Rubenesque",
                "pos": "adjective"
            },
            {
                "word": "the Rubicon",
                "pos": "noun"
            },
            {
                "word": "rubicund",
                "pos": "adjective"
            },
            {
                "word": "rubidium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the point at which a decision has been taken which can no longer be changed",
                    "vi": "thời điểm mà một quyết định đã được thực hiện mà không thể thay đổi được nữa"
                },
                "examples": [
                    {
                        "en": "Today we cross the Rubicon. There is no going back.",
                        "vi": "Hôm nay chúng ta vượt qua Rubicon. Không có đường nào để trở lại đâu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6910b9b512584cda8635d976432bf502",
        "word": "settle on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "settlement",
                "pos": "noun"
            },
            {
                "word": "settlement house",
                "pos": "noun"
            },
            {
                "word": "settle on",
                "pos": "phrasal verb"
            },
            {
                "word": "settler",
                "pos": "noun"
            },
            {
                "word": "settle to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose or make a decision about something after thinking about it",
                    "vi": "để lựa chọn hoặc đưa ra quyết định về điều gì đó sau khi suy nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "Have you settled on a name for the baby yet?",
                        "vi": "Bạn đã quyết định đặt tên cho em bé chưa?"
                    },
                    {
                        "en": "After much deliberation, he finally settled on a fur rug.",
                        "vi": "Sau nhiều cân nhắc, cuối cùng anh ấy đã ổn định trên một tấm thảm lông thú."
                    }
                ]
            },
            {
                "define": {
                    "en": "to formally arrange to give money or property to somebody, especially in a will",
                    "vi": "chính thức sắp xếp để đưa tiền hoặc tài sản cho ai đó, đặc biệt là trong một di chúc"
                },
                "examples": [
                    {
                        "en": "He settled part of his estate on his son.",
                        "vi": "Ông đã giải quyết một phần tài sản của mình cho con trai mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "7fbe41d49f214b6bac2b092d7ba5834d",
        "word": "sleep on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "sleep mode",
                "pos": "noun"
            },
            {
                "word": "sleep off",
                "pos": "phrasal verb"
            },
            {
                "word": "sleep on",
                "pos": "phrasal verb"
            },
            {
                "word": "sleep over",
                "pos": "phrasal verb"
            },
            {
                "word": "sleepover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to delay making a decision about something until the next day, so that you have time to think about it",
                    "vi": "trì hoãn việc đưa ra quyết định về điều gì đó cho đến ngày hôm sau, để bạn có thời gian suy nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "Could I sleep on it and let you know tomorrow?",
                        "vi": "Tôi có thể ngủ trên đó và cho bạn biết ngày mai?"
                    }
                ]
            }
        ]
    },
    {
        "id": "7ae84efe3c094278aef48f0d076c58ce",
        "word": "straight",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/streɪt/",
            "us": "/streɪt/"
        },
        "nearby": [
            {
                "word": "straggly",
                "pos": "adjective"
            },
            {
                "word": "straight",
                "pos": "adverb"
            },
            {
                "word": "straight",
                "pos": "adjective"
            },
            {
                "word": "straight",
                "pos": "noun"
            },
            {
                "word": "straight angle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a bend or curve; going in one direction only",
                    "vi": "không có một khúc quanh hoặc đường cong; chỉ đi theo một hướng"
                },
                "examples": [
                    {
                        "en": "a straight road",
                        "vi": "một con đường thẳng"
                    },
                    {
                        "en": "long, straight hair (= not curly)",
                        "vi": "tóc dài, thẳng (= không xoăn)"
                    },
                    {
                        "en": "a boat sailing in a straight line",
                        "vi": "một con thuyền chèo thuyền trên một đường thẳng"
                    },
                    {
                        "en": "straight-backed chairs",
                        "vi": "ghế tựa thẳng"
                    },
                    {
                        "en": "Keep the car straight when you're backing out.",
                        "vi": "Giữ xe thẳng khi bạn đang lùi xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "positioned in the correct way; level, vertical or parallel to something",
                    "vi": "được định vị theo cách chính xác; cấp độ, thẳng đứng hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Is my tie straight?",
                        "vi": "Cà vạt của tôi có thẳng không?"
                    },
                    {
                        "en": "He stepped back to make sure that the picture was straight.",
                        "vi": "Anh lùi lại để đảm bảo rằng bức tranh được thẳng hàng."
                    },
                    {
                        "en": "Her teeth were white and perfectly straight.",
                        "vi": "Hàm răng của cô trắng và đều tăm tắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "not fitting close to the body and not curving away from the body",
                    "vi": "không ôm sát cơ thể và không cong ra khỏi cơ thể"
                },
                "examples": [
                    {
                        "en": "a straight skirt",
                        "vi": "váy liền"
                    }
                ]
            },
            {
                "define": {
                    "en": "going directly to the correct place",
                    "vi": "đi thẳng đến địa điểm chính xác"
                },
                "examples": [
                    {
                        "en": "a straight punch to the face",
                        "vi": "một cú đấm thẳng vào mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "clean and neat, with everything in the correct place",
                    "vi": "sạch sẽ và gọn gàng, với mọi thứ ở đúng vị trí"
                },
                "examples": [
                    {
                        "en": "It took hours to get the house straight.",
                        "vi": "Phải mất hàng giờ đồng hồ mới đưa được ngôi nhà vào thẳng."
                    },
                    {
                        "en": "I'm trying to get the house straight before the weekend.",
                        "vi": "Tôi đang cố gắng nhận nhà ngay trước cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "honest and direct",
                    "vi": "trung thực và trực tiếp"
                },
                "examples": [
                    {
                        "en": "I expect a straight answer to a straight question.",
                        "vi": "Tôi mong đợi một câu trả lời thẳng thắn cho một câu hỏi thẳng."
                    },
                    {
                        "en": "straight with somebody I don't think you're being straight with me.",
                        "vi": "thẳng thắn với ai đó Tôi không nghĩ rằng bạn đang thẳng thắn với tôi."
                    },
                    {
                        "en": "It's time for some straight talking.",
                        "vi": "Đã đến lúc nói chuyện thẳng thắn."
                    },
                    {
                        "en": "You can trust Ben—he’s (as) straight as a die (= completely honest).",
                        "vi": "Bạn có thể tin tưởng Ben — anh ấy (như) thẳng như một con chết (= hoàn toàn trung thực)."
                    }
                ]
            },
            {
                "define": {
                    "en": "simple; involving only two clear choices",
                    "vi": "giản dị; chỉ liên quan đến hai lựa chọn rõ ràng"
                },
                "examples": [
                    {
                        "en": "It was a straight choice between taking the job and staying out of work.",
                        "vi": "Đó là một sự lựa chọn thẳng thắn giữa việc làm và nghỉ việc."
                    },
                    {
                        "en": "(British English) The election was a straight fight between the two main parties.",
                        "vi": "(Tiếng Anh Anh) Cuộc bầu cử là một cuộc chiến thẳng thắn giữa hai đảng chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "not connected with comedy or musical theatre, but with serious theatre",
                    "vi": "không kết nối với hài kịch hoặc sân khấu âm nhạc, nhưng với rạp hát nghiêm túc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one after another in a series that is not interrupted",
                    "vi": "cái này đến cái khác trong một chuỗi không bị gián đoạn"
                },
                "examples": [
                    {
                        "en": "The team has had five straight wins.",
                        "vi": "Đội đã có năm trận thắng liên tiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "not mixed with water or anything else",
                    "vi": "không trộn với nước hoặc bất cứ thứ gì khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you can use straight to describe a person who is normal and ordinary, but who you consider boring",
                    "vi": "bạn có thể sử dụng thẳng để mô tả một người bình thường và bình thường, nhưng người bạn cho là nhàm chán"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "heterosexual",
                    "vi": "dị tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a situation clear; to make sure that you or somebody else understands the situation",
                    "vi": "để làm cho một tình huống rõ ràng; để đảm bảo rằng bạn hoặc ai đó khác hiểu được tình hình"
                },
                "examples": [
                    {
                        "en": "Let's get this straight—you really had no idea where he was?",
                        "vi": "Hãy nói thẳng điều này - bạn thực sự không biết anh ta ở đâu?"
                    },
                    {
                        "en": "Let's get this absolutely straight.",
                        "vi": "Hãy làm cho điều này hoàn toàn thẳng thắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give people the correct information about something in order to make it clear that what they previously believed was in fact wrong",
                    "vi": "cung cấp cho mọi người thông tin chính xác về điều gì đó để làm rõ rằng những gì họ tin tưởng trước đây trên thực tế là sai"
                },
                "examples": [
                    {
                        "en": "To put the record straight, I do not support that idea and never have done.",
                        "vi": "Nói thẳng ra, tôi không ủng hộ ý kiến đó và chưa bao giờ thực hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to correct somebody’s mistake; to make sure that somebody knows the correct facts when they have had the wrong idea or impression",
                    "vi": "để sửa chữa sai lầm của ai đó; để đảm bảo rằng ai đó biết sự thật chính xác khi họ có ý tưởng hoặc ấn tượng sai"
                },
                "examples": [
                    {
                        "en": "She soon set me straight about what had happened.",
                        "vi": "Cô ấy sớm nói thẳng với tôi về những gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a very straight back and looking serious and formal",
                    "vi": "với một cái lưng rất thẳng và trông nghiêm túc và trang trọng"
                },
                "examples": [
                    {
                        "en": "Her back was ramrod straight.",
                        "vi": "Lưng cô thẳng tắp."
                    },
                    {
                        "en": "He stood there straight as a ramrod.",
                        "vi": "Anh ta đứng thẳng ở đó như một con cừu đực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the honest and morally acceptable way of living",
                    "vi": "cách sống trung thực và được chấp nhận về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "His friends try to keep him on the straight and narrow.",
                        "vi": "Bạn bè của anh ấy cố gắng giữ anh ấy trên đường thẳng và hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to get) the best grades in all your classes",
                    "vi": "(để có được) điểm tốt nhất trong tất cả các lớp học của bạn"
                },
                "examples": [
                    {
                        "en": "a straight A student",
                        "vi": "một học sinh thẳng thắn"
                    }
                ]
            }
        ]
    },
    {
        "id": "109b7c54fd3c47b9909d95fcdf686a4b",
        "word": "take something under advisement",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ədˈvaɪzmənt/",
            "us": "/ədˈvaɪzmənt/"
        },
        "nearby": [
            {
                "word": "advise",
                "pos": "verb"
            },
            {
                "word": "advisedly",
                "pos": "adverb"
            },
            {
                "word": "advisement",
                "pos": "noun"
            },
            {
                "word": "adviser",
                "pos": "noun"
            },
            {
                "word": "advisory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "advice",
                    "vi": "lời khuyên"
                },
                "examples": [
                    {
                        "en": "the University Advisement Center",
                        "vi": "Trung tâm Tư vấn Đại học"
                    }
                ]
            },
            {
                "define": {
                    "en": "to think carefully about something before making a decision about it",
                    "vi": "suy nghĩ cẩn thận về điều gì đó trước khi đưa ra quyết định về nó"
                },
                "examples": [
                    {
                        "en": "The judge has taken the matter under advisement.",
                        "vi": "Thẩm phán đã đưa vấn đề theo lời khuyên."
                    }
                ]
            }
        ]
    },
    {
        "id": "e5d30202e3984254851195f5eafa049f",
        "word": "that’s that",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ðæt/",
            "us": "/ðæt/"
        },
        "nearby": [
            {
                "word": "thanx",
                "pos": "exclamation"
            },
            {
                "word": "that",
                "pos": "determiner"
            },
            {
                "word": "that",
                "pos": "pronoun"
            },
            {
                "word": "that",
                "pos": "conjunction"
            },
            {
                "word": "that",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used for referring to a person or thing that is not near the speaker, or not as near to the speaker as another",
                    "vi": "được sử dụng để đề cập đến một người hoặc vật không ở gần người nói hoặc không ở gần người nói với người khác"
                },
                "examples": [
                    {
                        "en": "Who's that?",
                        "vi": "Ai đó?"
                    },
                    {
                        "en": "That's Peter over there.",
                        "vi": "Đó là Peter ở đằng kia."
                    },
                    {
                        "en": "(British English) Hello. Is that Jo? (= when speaking on the phone) In North American English say Is this Jo?",
                        "vi": "(Anh Anh) Xin chào. Có phải Jo đó không? (= khi nói trên điện thoại) Trong tiếng Anh Bắc Mỹ, nói Is this Jo?"
                    },
                    {
                        "en": "That's a nice dress.",
                        "vi": "Đó là một chiếc váy đẹp."
                    },
                    {
                        "en": "Those look riper than these.",
                        "vi": "Những cái đó trông riper hơn những cái này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for referring to somebody/something that has already been mentioned, or is already known about",
                    "vi": "được sử dụng để đề cập đến ai đó / điều gì đó đã được đề cập hoặc đã biết về"
                },
                "examples": [
                    {
                        "en": "What can I do about that?",
                        "vi": "Tôi có thể làm gì về điều đó?"
                    },
                    {
                        "en": "Do you remember when we went to Norway? That was a good trip.",
                        "vi": "Bạn có nhớ khi chúng tôi đến Na Uy không? Đó là một chuyến đi tốt."
                    },
                    {
                        "en": "That's exactly what I think.",
                        "vi": "Đó chính xác là những gì tôi nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for referring to people or things of a particular type",
                    "vi": "được sử dụng để đề cập đến những người hoặc những thứ thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "Those present were in favour of change.",
                        "vi": "Những người có mặt ủng hộ sự thay đổi."
                    },
                    {
                        "en": "There are those who say (= some people say) she should not have got the job.",
                        "vi": "Có những người nói (= một số người nói) lẽ ra cô ấy không nên có công việc."
                    },
                    {
                        "en": "Salaries are higher here than those in my country.",
                        "vi": "Mức lương ở đây cao hơn so với ở nước tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a relative pronoun to introduce a part of a sentence which refers to the person, thing or time you have been talking about",
                    "vi": "được sử dụng như một đại từ tương đối để giới thiệu một phần của câu đề cập đến người, sự vật hoặc thời gian bạn đã nói về"
                },
                "examples": [
                    {
                        "en": "Where's the letter that came yesterday?",
                        "vi": "Lá thư hôm qua đâu rồi?"
                    },
                    {
                        "en": "Who was it that won the US Open?",
                        "vi": "Ai đã vô địch US Open?"
                    },
                    {
                        "en": "The watch (that) you gave me keeps perfect time.",
                        "vi": "Chiếc đồng hồ mà bạn đã cho tôi giữ thời gian hoàn hảo."
                    },
                    {
                        "en": "The people (that) I spoke to were very helpful.",
                        "vi": "Những người (mà) tôi đã nói chuyện rất hữu ích."
                    },
                    {
                        "en": "It’s the best novel (that) I’ve ever read.",
                        "vi": "Đó là cuốn tiểu thuyết hay nhất mà tôi từng đọc."
                    },
                    {
                        "en": "We moved here the year (that) my mother died.",
                        "vi": "Chúng tôi chuyển đến đây vào năm (năm đó) mẹ tôi mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "and everything else connected with an activity, a situation, etc.",
                    "vi": "và mọi thứ khác được kết nối với một hoạt động, một tình huống, v.v."
                },
                "examples": [
                    {
                        "en": "Did you bring the contract and (all) that?",
                        "vi": "Bạn có mang theo hợp đồng và (tất cả) cái đó không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what something means or to give more information",
                    "vi": "được sử dụng để nói điều gì đó có nghĩa là gì hoặc để cung cấp thêm thông tin"
                },
                "examples": [
                    {
                        "en": "He's a local government administrator, that is to say a civil servant.",
                        "vi": "Anh ta là một nhà quản lý chính quyền địa phương, có nghĩa là một công chức."
                    },
                    {
                        "en": "You'll find her very helpful—if she's not too busy, that is.",
                        "vi": "Bạn sẽ thấy cô ấy rất hữu ích — nếu cô ấy không quá bận, đó là điều."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is right, or is doing something right",
                    "vi": "được sử dụng để nói rằng ai đó đúng, hoặc đang làm điều gì đó đúng"
                },
                "examples": [
                    {
                        "en": "No, the other one… that’s it.",
                        "vi": "Không, cái còn lại… chính là nó."
                    },
                    {
                        "en": "That's it, carry on!",
                        "vi": "Vậy là xong, tiếp tục!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is finished, or that no more can be done",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã hoàn thành, hoặc không thể làm được nữa"
                },
                "examples": [
                    {
                        "en": "That's it, the fire's out now.",
                        "vi": "Vậy đó, lửa đã tắt."
                    },
                    {
                        "en": "That's it for now, but if I get any news I'll let you know.",
                        "vi": "Bây giờ là vậy, nhưng nếu tôi nhận được bất kỳ tin tức nào, tôi sẽ cho bạn biết."
                    },
                    {
                        "en": "A week to go, and that's it!",
                        "vi": "Còn một tuần nữa, vậy là xong!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will not accept something any longer",
                    "vi": "được sử dụng để nói rằng bạn sẽ không chấp nhận một cái gì đó nữa"
                },
                "examples": [
                    {
                        "en": "That's it, I've had enough!",
                        "vi": "Vậy đó, tôi đã có đủ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about the reason for something",
                    "vi": "được sử dụng để nói về lý do của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "So that's it—the fuse had gone.",
                        "vi": "Vậy là xong - cầu chì đã tắt."
                    },
                    {
                        "en": "You don't love me any more, is that it?",
                        "vi": "Em không còn yêu anh nữa phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that your decision cannot be changed",
                    "vi": "được sử dụng để nói rằng quyết định của bạn không thể thay đổi"
                },
                "examples": [
                    {
                        "en": "Well I'm not going, and that's that.",
                        "vi": "Tôi sẽ không đi, và đó là điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "42947cd8a8a94db6abced6c00dd41295",
        "word": "toss-up",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒs ʌp/",
            "us": "/ˈtɔːs ʌp/"
        },
        "nearby": [
            {
                "word": "toss off",
                "pos": "phrasal verb"
            },
            {
                "word": "tosspot",
                "pos": "noun"
            },
            {
                "word": "toss-up",
                "pos": "noun"
            },
            {
                "word": "tot",
                "pos": "noun"
            },
            {
                "word": "tot",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which either of two choices, results, etc. is equally possible",
                    "vi": "một tình huống trong đó một trong hai lựa chọn, kết quả, v.v. đều có thể xảy ra như nhau"
                },
                "examples": [
                    {
                        "en": "‘Have you decided on the colour yet?’ ‘It's a toss-up between the blue and the green.’",
                        "vi": "Bạn đã quyết định về màu sắc chưa?' 'Đó là sự tung ra giữa màu xanh lam và màu xanh lá cây.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "ce1d6d9046ee48bfa1392512563587b9",
        "word": "toughie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʌfi/",
            "us": "/ˈtʌfi/"
        },
        "nearby": [
            {
                "word": "tough",
                "pos": "verb"
            },
            {
                "word": "toughen",
                "pos": "verb"
            },
            {
                "word": "toughie",
                "pos": "noun"
            },
            {
                "word": "tough love",
                "pos": "noun"
            },
            {
                "word": "toughly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is determined and not easily frightened",
                    "vi": "một người quyết tâm và không dễ sợ hãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very difficult choice or question",
                    "vi": "một lựa chọn hoặc một câu hỏi rất khó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb47cb469b2c486a9508fc48310f15f9",
        "word": "unanimous",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/juˈnænɪməs/",
            "us": "/juˈnænɪməs/"
        },
        "nearby": [
            {
                "word": "un-American",
                "pos": "adjective"
            },
            {
                "word": "unanimity",
                "pos": "noun"
            },
            {
                "word": "unanimous",
                "pos": "adjective"
            },
            {
                "word": "unanimously",
                "pos": "adverb"
            },
            {
                "word": "unannounced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a decision or an opinion is unanimous, it is agreed or shared by everyone in a group",
                    "vi": "nếu một quyết định hoặc một ý kiến được nhất trí, thì nó sẽ được mọi người trong nhóm đồng ý hoặc chia sẻ"
                },
                "examples": [
                    {
                        "en": "a unanimous vote",
                        "vi": "một cuộc bỏ phiếu nhất trí"
                    },
                    {
                        "en": "unanimous support",
                        "vi": "đồng lòng ủng hộ"
                    },
                    {
                        "en": "The decision was not unanimous.",
                        "vi": "Quyết định không được nhất trí."
                    },
                    {
                        "en": "Unanimous agreement must be reached for this plan to go ahead.",
                        "vi": "Phải đạt được sự nhất trí cao để kế hoạch này được tiến hành."
                    },
                    {
                        "en": "The jury reached a unanimous verdict of ‘not guilty’.",
                        "vi": "Bồi thẩm đoàn đã đạt được một phán quyết nhất trí là 'không có tội'."
                    },
                    {
                        "en": "She was the unanimous choice of the selection committee.",
                        "vi": "Cô là sự lựa chọn nhất trí của hội đồng tuyển chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a group of people are unanimous, they all agree about something",
                    "vi": "nếu một nhóm người nhất trí, họ đều đồng ý về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Local people are unanimous in their opposition to the proposed new road.",
                        "vi": "Người dân địa phương nhất trí phản đối đề xuất làm đường mới."
                    },
                    {
                        "en": "The committee were unanimous in rejecting the proposal.",
                        "vi": "Ủy ban đã nhất trí từ chối đề xuất."
                    }
                ]
            }
        ]
    },
    {
        "id": "257614326a794e659f5c3245c2b89467",
        "word": "veto",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈviːtəʊ/",
            "us": "/ˈviːtəʊ/"
        },
        "nearby": [
            {
                "word": "veterinary surgeon",
                "pos": "noun"
            },
            {
                "word": "vetkoek",
                "pos": "noun"
            },
            {
                "word": "veto",
                "pos": "noun"
            },
            {
                "word": "veto",
                "pos": "verb"
            },
            {
                "word": "vetting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the right to refuse to allow something to be done, especially the right to stop a law from being passed or a decision from being taken",
                    "vi": "quyền từ chối cho phép một việc gì đó được thực hiện, đặc biệt là quyền ngăn chặn việc thông qua luật hoặc một quyết định được thực hiện"
                },
                "examples": [
                    {
                        "en": "The British government used its veto to block the proposal.",
                        "vi": "Chính phủ Anh đã sử dụng quyền phủ quyết của mình để ngăn chặn đề xuất này."
                    },
                    {
                        "en": "to have the power/right of veto",
                        "vi": "có quyền / quyền phủ quyết"
                    },
                    {
                        "en": "the use of the presidential veto",
                        "vi": "việc sử dụng quyền phủ quyết của tổng thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when somebody refuses to allow something to be done",
                    "vi": "một dịp khi ai đó từ chối cho phép một điều gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "For months there was a veto on employing new staff.",
                        "vi": "Trong nhiều tháng, đã có sự phủ quyết về việc tuyển dụng nhân viên mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce00b4673f40432aa8e453d929bf245c",
        "word": "volition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vəˈlɪʃn/",
            "us": "/vəʊˈlɪʃn/"
        },
        "nearby": [
            {
                "word": "volcanology",
                "pos": "noun"
            },
            {
                "word": "vole",
                "pos": "noun"
            },
            {
                "word": "volition",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the power to choose something freely or to make your own decisions",
                    "vi": "sức mạnh để lựa chọn một cái gì đó một cách tự do hoặc để đưa ra quyết định của riêng bạn"
                },
                "examples": [
                    {
                        "en": "They left entirely of their own volition (= because they wanted to).",
                        "vi": "Họ rời bỏ hoàn toàn ý chí của riêng mình (= bởi vì họ muốn)."
                    }
                ]
            }
        ]
    },
    {
        "id": "4f46d49ef2654a4392b9739d6afa501b",
        "word": "waver",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈweɪvə(r)/",
            "us": "/ˈweɪvər/"
        },
        "nearby": [
            {
                "word": "wave machine",
                "pos": "noun"
            },
            {
                "word": "wave off",
                "pos": "phrasal verb"
            },
            {
                "word": "waver",
                "pos": "verb"
            },
            {
                "word": "waverer",
                "pos": "noun"
            },
            {
                "word": "Waverley",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be or become weak or unsteady",
                    "vi": "trở nên yếu ớt hoặc không vững"
                },
                "examples": [
                    {
                        "en": "His voice wavered with emotion.",
                        "vi": "Giọng anh phảng phất sự xúc động."
                    },
                    {
                        "en": "Her smile wavered and she began to cry.",
                        "vi": "Nụ cười của cô ấy dao động và cô ấy bắt đầu khóc."
                    },
                    {
                        "en": "Her determination never wavered.",
                        "vi": "Quyết tâm của cô ấy không bao giờ dao động."
                    },
                    {
                        "en": "She never wavered in her determination to succeed.",
                        "vi": "Cô ấy không bao giờ dao động trong quyết tâm thành công của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hesitate and be unable to make a decision or choice",
                    "vi": "do dự và không thể đưa ra quyết định hoặc lựa chọn"
                },
                "examples": [
                    {
                        "en": "She's wavering between buying a house in the city or moving away.",
                        "vi": "Cô ấy đang phân vân giữa việc mua một căn nhà trong thành phố hay chuyển đi nơi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move in an unsteady way",
                    "vi": "di chuyển một cách không ổn định"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eabe3e4629284e2697ab5bc7250cfe15",
        "word": "waverer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈweɪvərə(r)/",
            "us": "/ˈweɪvərər/"
        },
        "nearby": [
            {
                "word": "wave off",
                "pos": "phrasal verb"
            },
            {
                "word": "waver",
                "pos": "verb"
            },
            {
                "word": "waverer",
                "pos": "noun"
            },
            {
                "word": "Waverley",
                "pos": ""
            },
            {
                "word": "the Waverley novels",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is unable to make a decision or choice",
                    "vi": "một người không thể đưa ra quyết định hoặc lựa chọn"
                },
                "examples": [
                    {
                        "en": "The strength of his argument convinced the waverers.",
                        "vi": "Sức mạnh của lập luận của ông đã thuyết phục những người dậy sóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "05190103903c43168448ae981f27a69a",
        "word": "weigh",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/weɪ/",
            "us": "/weɪ/"
        },
        "nearby": [
            {
                "word": "Wee Willie Winkie",
                "pos": ""
            },
            {
                "word": "the weft",
                "pos": "noun"
            },
            {
                "word": "weigh",
                "pos": "verb"
            },
            {
                "word": "weighbridge",
                "pos": "noun"
            },
            {
                "word": "weigh down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have a particular weight",
                    "vi": "để có một trọng lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "How much do you weigh (= how heavy are you)?",
                        "vi": "Bạn nặng bao nhiêu (= bạn nặng bao nhiêu)?"
                    },
                    {
                        "en": "She weighs 60 kilos.",
                        "vi": "Cô ấy nặng 60 kg."
                    },
                    {
                        "en": "A healthy baby usually weighs 6 lbs or more.",
                        "vi": "Một em bé khỏe mạnh thường nặng từ 6 lbs trở lên."
                    },
                    {
                        "en": "The average male tiger weighs around 200 kg.",
                        "vi": "Hổ đực trung bình nặng khoảng 200 kg."
                    },
                    {
                        "en": "The diamond weighs 4.50 carats.",
                        "vi": "Viên kim cương nặng 4,50 carat."
                    },
                    {
                        "en": "(informal) These cases weigh a ton (= are very heavy).",
                        "vi": "(không chính thức) Những trường hợp này nặng một tấn (= rất nặng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to measure how heavy somebody/something is, usually by using scales",
                    "vi": "để đo độ nặng của ai đó / vật gì đó, thường bằng cách sử dụng cân"
                },
                "examples": [
                    {
                        "en": "He weighed himself on the bathroom scales.",
                        "vi": "Anh tự cân mình trên chiếc cân trong phòng tắm."
                    },
                    {
                        "en": "Chicks were weighed and measured daily.",
                        "vi": "Gà con được cân và đo hàng ngày."
                    },
                    {
                        "en": "She weighed the stone in her hand (= estimated how heavy it was by holding it).",
                        "vi": "Cô ấy cân viên đá trong tay (= ước tính xem nó nặng bao nhiêu khi cầm nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider something carefully before making a decision",
                    "vi": "cân nhắc kỹ lưỡng điều gì đó trước khi đưa ra quyết định"
                },
                "examples": [
                    {
                        "en": "weigh something (up) You must weigh up the pros and cons (= consider the advantages and disadvantages of something).",
                        "vi": "cân nhắc cái gì đó (up) Bạn phải cân nhắc ưu và khuyết điểm (= cân nhắc ưu và nhược điểm của thứ gì đó)."
                    },
                    {
                        "en": "She weighed up all the evidence.",
                        "vi": "Cô đã cân tất cả các bằng chứng."
                    },
                    {
                        "en": "You'll need to weigh up all your options.",
                        "vi": "Bạn sẽ cần cân nhắc tất cả các lựa chọn của mình."
                    },
                    {
                        "en": "The jury weighed up the evidence carefully.",
                        "vi": "Bồi thẩm đoàn đã cân nhắc các bằng chứng một cách cẩn thận."
                    },
                    {
                        "en": "weigh (up) something against something I weighed the benefits of the plan against the risks involved.",
                        "vi": "cân nhắc (lên) một cái gì đó so với một cái gì đó Tôi đã cân nhắc giữa lợi ích của kế hoạch so với rủi ro liên quan."
                    },
                    {
                        "en": "We weighed the cost of advertising against the likely gains from increased business.",
                        "vi": "Chúng tôi đã cân nhắc giữa chi phí quảng cáo với lợi nhuận có thể thu được từ việc tăng cường kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an influence on somebody’s opinion or the result of something",
                    "vi": "có ảnh hưởng đến ý kiến của ai đó hoặc kết quả của điều gì đó"
                },
                "examples": [
                    {
                        "en": "His past record weighs heavily against him.",
                        "vi": "Thành tích trong quá khứ của anh ấy đè nặng lên anh ấy."
                    },
                    {
                        "en": "The evidence weighs in her favour.",
                        "vi": "Bằng chứng có lợi cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lift an anchor out of the water and into a boat before sailing away",
                    "vi": "nhấc một chiếc neo lên khỏi mặt nước và lên thuyền trước khi ra khơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose your words carefully so that you say exactly what you mean",
                    "vi": "lựa chọn từ ngữ của bạn một cách cẩn thận để bạn nói chính xác ý của bạn"
                },
                "examples": [
                    {
                        "en": "He spoke slowly, weighing his words.",
                        "vi": "Anh nói chậm rãi, có trọng lượng trong lời nói."
                    }
                ]
            }
        ]
    },
    {
        "id": "f04fac80492d4932a4ece9aef5eadc19",
        "word": "when push comes to shove",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pʊʃ/",
            "us": "/pʊʃ/"
        },
        "nearby": [
            {
                "word": "Edward Pusey",
                "pos": ""
            },
            {
                "word": "push",
                "pos": "verb"
            },
            {
                "word": "push",
                "pos": "noun"
            },
            {
                "word": "push about",
                "pos": "phrasal verb"
            },
            {
                "word": "push ahead",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of pushing something/somebody",
                    "vi": "một hành động đẩy một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She gave him a gentle push.",
                        "vi": "Cô nhẹ nhàng đẩy anh."
                    },
                    {
                        "en": "The car won't start. Can you give it a push?",
                        "vi": "Xe sẽ không nổ máy. Bạn có thể cho nó một cú hích?"
                    },
                    {
                        "en": "(figurative) At the push of a button (= very easily) he could get a whole list of names.",
                        "vi": "(nghĩa bóng) Chỉ với một nút nhấn (= rất dễ dàng) anh ta có thể có được toàn bộ danh sách tên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large and determined military attack",
                    "vi": "một cuộc tấn công quân sự lớn và kiên quyết"
                },
                "examples": [
                    {
                        "en": "a final push against the enemy",
                        "vi": "một cú hích cuối cùng chống lại kẻ thù"
                    },
                    {
                        "en": "(figurative) The firm has begun a major push into the European market.",
                        "vi": "(nghĩa bóng) Công ty đã bắt đầu một cuộc đẩy mạnh vào thị trường châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a determined effort to achieve something",
                    "vi": "một nỗ lực quyết tâm để đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The push for reform started in 2007.",
                        "vi": "Việc thúc đẩy cải cách bắt đầu vào năm 2007."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of encouraging somebody to do something",
                    "vi": "một hành động khuyến khích ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He wants to open his own business, but needs a push in the right direction to get him started.",
                        "vi": "Anh ấy muốn mở doanh nghiệp của riêng mình, nhưng cần một sự thúc đẩy đúng hướng để anh ấy bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is possible, but only with difficulty",
                    "vi": "được sử dụng để nói rằng một cái gì đó có thể, nhưng chỉ với khó khăn"
                },
                "examples": [
                    {
                        "en": "We can provide accommodation for six people at a push.",
                        "vi": "Chúng tôi có thể cung cấp chỗ ở cho sáu người tại một thời điểm thúc đẩy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dismiss somebody/to be dismissed from your job",
                    "vi": "sa thải ai đó / bị sa thải khỏi công việc của bạn"
                },
                "examples": [
                    {
                        "en": "They gave him the push after only six weeks.",
                        "vi": "Họ đã thúc đẩy anh ta chỉ sau sáu tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a romantic relationship with somebody; to be told that a romantic relationship with somebody is over",
                    "vi": "để kết thúc một mối quan hệ lãng mạn với ai đó; được nói rằng một mối quan hệ lãng mạn với ai đó đã kết thúc"
                },
                "examples": [
                    {
                        "en": "He was devastated when his girlfriend gave him the push.",
                        "vi": "Anh ấy đã bị tàn phá khi bạn gái của anh ấy đẩy anh ấy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "when there is no other choice; when everything else has failed",
                    "vi": "khi không có sự lựa chọn nào khác; khi mọi thứ khác đã thất bại"
                },
                "examples": []
            }
        ]
    }
]