[
    {
        "id": "2d561d3dca4d43a18de2a47c01adff9a",
        "word": "difference",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈdɪfrəns/",
            "us": "/ˈdɪfrəns/"
        },
        "nearby": [
            {
                "word": "Dieu et mon droit",
                "pos": ""
            },
            {
                "word": "differ",
                "pos": "verb"
            },
            {
                "word": "difference",
                "pos": "noun"
            },
            {
                "word": "different",
                "pos": "adjective"
            },
            {
                "word": "differential",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the way in which two people or things are not like each other; the way in which somebody/something has changed",
                    "vi": "cách mà hai người hoặc mọi thứ không giống nhau; cách mà ai đó / điều gì đó đã thay đổi"
                },
                "examples": [
                    {
                        "en": "Americans and Brits speak the same language, but there are big cultural differences.",
                        "vi": "Người Mỹ và người Anh nói cùng một ngôn ngữ, nhưng có sự khác biệt lớn về văn hóa."
                    },
                    {
                        "en": "difference between A and B There are no significant differences between the education systems of the two countries.",
                        "vi": "Sự khác biệt giữa A và B Không có sự khác biệt đáng kể giữa hệ thống giáo dục của hai quốc gia."
                    },
                    {
                        "en": "He was studying the similarities and differences between humans and animals.",
                        "vi": "Ông đang nghiên cứu những điểm giống và khác nhau giữa con người và động vật."
                    },
                    {
                        "en": "I can never tell the difference (= distinguish) between the twins.",
                        "vi": "Tôi không bao giờ có thể phân biệt được (= phân biệt) giữa các cặp song sinh."
                    },
                    {
                        "en": "difference in something There's no difference in the results.",
                        "vi": "sự khác biệt về điều gì đó Không có sự khác biệt về kết quả."
                    },
                    {
                        "en": "There is a fundamental difference in approach to conservation in Japan.",
                        "vi": "Có một sự khác biệt cơ bản trong cách tiếp cận bảo tồn ở Nhật Bản."
                    },
                    {
                        "en": "She noticed a marked difference in the children on her second visit.",
                        "vi": "Cô nhận thấy sự khác biệt rõ rệt ở bọn trẻ trong lần khám thứ hai."
                    },
                    {
                        "en": "Her work questions notions of gender difference.",
                        "vi": "Công việc của cô đặt câu hỏi về quan niệm khác biệt giới tính."
                    },
                    {
                        "en": "What a difference! You look great with your hair like that.",
                        "vi": "Thật la khac biệt! Trông bạn thật tuyệt với mái tóc như vậy."
                    },
                    {
                        "en": "difference among something Differences among beetle species may prove to be a key factor.",
                        "vi": "sự khác biệt giữa một cái gì đó Sự khác biệt giữa các loài bọ cánh cứng có thể được chứng minh là một yếu tố chính."
                    },
                    {
                        "en": "despite differences Despite their differences, the two are great friends.",
                        "vi": "Bất chấp sự khác biệt Bất chấp sự khác biệt của họ, cả hai là những người bạn tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount that something is greater or smaller than something else",
                    "vi": "số tiền mà thứ gì đó lớn hơn hoặc nhỏ hơn thứ khác"
                },
                "examples": [
                    {
                        "en": "difference in something We measured the difference in temperature.",
                        "vi": "sự khác biệt về một cái gì đó Chúng tôi đã đo sự khác biệt về nhiệt độ."
                    },
                    {
                        "en": "difference between A and B The difference between the two numbers gives you the profit.",
                        "vi": "Sự khác biệt giữa A và B Sự khác biệt giữa hai con số mang lại cho bạn lợi nhuận."
                    },
                    {
                        "en": "There's an age difference of six years between the boys (= one is six years older than the other).",
                        "vi": "Có sự chênh lệch tuổi giữa các chàng trai là sáu tuổi (= một người lớn hơn người kia sáu tuổi)."
                    },
                    {
                        "en": "difference in something between A and B There is not much difference in price between the two brands.",
                        "vi": "Sự khác biệt về điều gì đó giữa A và B Không có nhiều sự khác biệt về giá giữa hai thương hiệu."
                    },
                    {
                        "en": "I'll lend you £500 and you'll have to find the difference (= the rest of the money that you need).",
                        "vi": "Tôi sẽ cho bạn vay £ 500 và bạn sẽ phải tìm khoản chênh lệch (= phần còn lại của số tiền mà bạn cần)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disagreement between people",
                    "vi": "bất đồng giữa mọi người"
                },
                "examples": [
                    {
                        "en": "We have our differences, but she's still my sister.",
                        "vi": "Chúng tôi có những khác biệt, nhưng cô ấy vẫn là em gái của tôi."
                    },
                    {
                        "en": "Why don't you settle your differences and be friends again?",
                        "vi": "Tại sao bạn không giải quyết sự khác biệt của bạn và làm bạn một lần nữa?"
                    },
                    {
                        "en": "There was a difference of opinion over who had won.",
                        "vi": "Có sự khác biệt về quan điểm về việc ai đã giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop not being friendly and become friends again",
                    "vi": "ngừng không thân thiện và trở thành bạn bè một lần nữa"
                },
                "examples": [
                    {
                        "en": "After not speaking to each other for years, the two brothers decided to bury the hatchet.",
                        "vi": "Sau nhiều năm không nói với nhau lời nào, hai anh em quyết định chôn cất cái hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point that somebody wants to suggest is a difference when in fact it is not different at all",
                    "vi": "một điểm mà ai đó muốn đề xuất là một sự khác biệt trong khi thực tế nó không khác một chút nào"
                },
                "examples": [
                    {
                        "en": "His government did not brand them terrorists, but rather ‘an entity that supports terrorism’. That may prove to be a distinction without a difference.",
                        "vi": "Chính phủ của ông không coi họ là những kẻ khủng bố, mà là 'một thực thể hỗ trợ chủ nghĩa khủng bố'. Điều đó có thể chứng minh là một sự khác biệt mà không có sự khác biệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an important effect on somebody/something; to make somebody feel better",
                    "vi": "có ảnh hưởng quan trọng đến ai đó / cái gì đó; để làm cho ai đó cảm thấy tốt hơn"
                },
                "examples": [
                    {
                        "en": "A few kind words at the right time make all the difference.",
                        "vi": "Một vài lời nói tử tế vào đúng thời điểm sẽ tạo nên sự khác biệt."
                    },
                    {
                        "en": "Just five minutes' exercise a day could make all the difference.",
                        "vi": "Chỉ cần tập thể dục năm phút mỗi ngày có thể tạo ra tất cả sự khác biệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect/no effect on somebody/something",
                    "vi": "có ảnh hưởng / không ảnh hưởng đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The rain didn't make much difference to the game.",
                        "vi": "Trận mưa không tạo ra nhiều khác biệt cho trận đấu."
                    },
                    {
                        "en": "Your age shouldn't make any difference to whether you get the job or not.",
                        "vi": "Tuổi của bạn không tạo ra bất kỳ sự khác biệt nào đối với việc bạn có nhận được việc làm hay không."
                    },
                    {
                        "en": "Changing schools made a big difference to my life.",
                        "vi": "Thay đổi trường học đã tạo ra một sự khác biệt lớn đối với cuộc sống của tôi."
                    },
                    {
                        "en": "What difference will it make if he knows or not?",
                        "vi": "Nó sẽ tạo ra sự khác biệt gì nếu anh ta biết hay không?"
                    },
                    {
                        "en": "I don't think it makes a lot of difference what colour it is (= it is not important).",
                        "vi": "Tôi không nghĩ nó tạo ra nhiều sự khác biệt về màu sắc của nó (= nó không quan trọng)."
                    },
                    {
                        "en": "‘Shall we go on Friday or Saturday?’ ‘It makes no difference (to me).’",
                        "vi": "Chúng ta sẽ đi vào thứ sáu hay thứ bảy?' 'Nó không có gì khác biệt (đối với tôi).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think the differences between two things are not important",
                    "vi": "từng nói rằng bạn nghĩ sự khác biệt giữa hai thứ không quan trọng"
                },
                "examples": [
                    {
                        "en": "‘That's not a xylophone, it's a glockenspiel.’ ‘Same difference.’",
                        "vi": "Đó không phải là một xylophone, mà là một cây đàn hội. 'Cùng một sự khác biệt.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to forget about your disagreements",
                    "vi": "đồng ý để quên đi những bất đồng của bạn"
                },
                "examples": [
                    {
                        "en": "We need to sink our differences and present a united opposition to the plan.",
                        "vi": "Chúng ta cần xóa bỏ sự khác biệt của mình và thống nhất phản đối kế hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "(when discussing a price, etc.) to agree on an amount that is at an equal distance between the two amounts that have been suggested",
                    "vi": "(khi thảo luận về giá cả, v.v.) để đồng ý về một số tiền có khoảng cách bằng nhau giữa hai số tiền đã được đề xuất"
                },
                "examples": [
                    {
                        "en": "I offered €200 but he wanted €300. In the end, we split the difference and I paid him €250.",
                        "vi": "Tôi đề nghị € 200 nhưng anh ấy muốn € 300. Cuối cùng, chúng tôi chia đôi số tiền chênh lệch và tôi đã trả cho anh ấy 250 €."
                    },
                    {
                        "en": "(figurative) I wanted to leave early and Ian wanted to leave late, so we split the difference and left at noon.",
                        "vi": "(nghĩa bóng) Tôi muốn về sớm và Ian muốn về muộn, vì vậy chúng tôi chia nhau số tiền chênh lệch và rời đi vào buổi trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that something is interesting or unusual",
                    "vi": "được sử dụng để cho thấy rằng một cái gì đó là thú vị hoặc bất thường"
                },
                "examples": [
                    {
                        "en": "The traditional backpack with a difference—it's waterproof.",
                        "vi": "Ba lô truyền thống có một điểm khác biệt — nó không thấm nước."
                    },
                    {
                        "en": "If you want a holiday with a difference, come to Iceland.",
                        "vi": "Nếu bạn muốn có một kỳ nghỉ với sự khác biệt, hãy đến với Iceland."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize how much difference there is between two things",
                    "vi": "được sử dụng để nhấn mạnh có bao nhiêu sự khác biệt giữa hai điều"
                },
                "examples": [
                    {
                        "en": "There's a world of difference between liking someone and loving them.",
                        "vi": "Có một thế giới khác biệt giữa thích ai đó và yêu họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "fb10a37f23714c4b996159c0f5ee4ff0",
        "word": "different",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈdɪfrənt/",
            "us": "/ˈdɪfrənt/"
        },
        "nearby": [
            {
                "word": "differ",
                "pos": "verb"
            },
            {
                "word": "difference",
                "pos": "noun"
            },
            {
                "word": "different",
                "pos": "adjective"
            },
            {
                "word": "differential",
                "pos": "noun"
            },
            {
                "word": "differential",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not the same as somebody/something; not like somebody/something else",
                    "vi": "không giống với ai đó / cái gì đó; không giống ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "different from somebody/something American English is significantly different from British English.",
                        "vi": "khác với ai đó / cái gì đó Tiếng Anh Mỹ khác đáng kể với tiếng Anh Anh."
                    },
                    {
                        "en": "different to somebody/something (especially British English) It's slightly different to what I'm used to.",
                        "vi": "khác với ai đó / cái gì đó (đặc biệt là tiếng Anh Anh) Nó hơi khác so với những gì tôi đã từng làm."
                    },
                    {
                        "en": "different than somebody/something (especially North American English) He's different than the rest.",
                        "vi": "khác với ai đó / cái gì đó (đặc biệt là tiếng Anh Bắc Mỹ) Anh ấy khác với những người còn lại."
                    },
                    {
                        "en": "It's completely different now than it was a year ago.",
                        "vi": "Bây giờ nó hoàn toàn khác so với một năm trước."
                    },
                    {
                        "en": "People often give very different accounts of the same event.",
                        "vi": "Mọi người thường đưa ra các tài khoản rất khác nhau về cùng một sự kiện."
                    },
                    {
                        "en": "My son's terribly untidy; my daughter's no different.",
                        "vi": "Con trai tôi bừa bộn kinh khủng; con gái tôi không khác gì."
                    },
                    {
                        "en": "The room looks different without the furniture.",
                        "vi": "Căn phòng trông khác nếu không có đồ nội thất."
                    },
                    {
                        "en": "Now he spoke in a different and kinder voice.",
                        "vi": "Bây giờ anh ấy nói với một giọng khác và tử tế hơn."
                    },
                    {
                        "en": "Let's try a different approach.",
                        "vi": "Hãy thử một cách tiếp cận khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "separate and individual",
                    "vi": "riêng biệt và riêng lẻ"
                },
                "examples": [
                    {
                        "en": "Each chapter deals with a different type of business.",
                        "vi": "Mỗi chương đề cập đến một loại hình kinh doanh khác nhau."
                    },
                    {
                        "en": "She offered us five different kinds of cake.",
                        "vi": "Cô ấy mời chúng tôi năm loại bánh khác nhau."
                    },
                    {
                        "en": "We're helping society in many different ways.",
                        "vi": "Chúng tôi đang giúp đỡ xã hội theo nhiều cách khác nhau."
                    },
                    {
                        "en": "The programme was about customs in different parts of the country.",
                        "vi": "Chương trình nói về phong tục ở các vùng khác nhau của đất nước."
                    },
                    {
                        "en": "They are sold in many different colours.",
                        "vi": "Chúng được bán với nhiều màu sắc khác nhau."
                    },
                    {
                        "en": "I looked it up in three different dictionaries.",
                        "vi": "Tôi đã tra cứu nó trong ba từ điển khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "unusual; not like other people or things",
                    "vi": "không bình thường; không giống như những người khác hoặc những thứ khác"
                },
                "examples": [
                    {
                        "en": "‘Did you enjoy the play?’ ‘Well, it was certainly different!’",
                        "vi": "Bạn có thích vở kịch không?' 'Chà, chắc chắn là khác!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very different",
                    "vi": "trở nên rất khác biệt"
                },
                "examples": [
                    {
                        "en": "I know which area they live in, but whether I can find their house is a different matter.",
                        "vi": "Tôi biết họ sống ở khu vực nào, nhưng liệu tôi có thể tìm thấy nhà của họ hay không lại là chuyện khác."
                    },
                    {
                        "en": "That's a whole different matter.",
                        "vi": "Đó là một vấn đề hoàn toàn khác."
                    },
                    {
                        "en": "I don't mind lizards, but snakes are a different matter.",
                        "vi": "Tôi không bận tâm đến thằn lằn, nhưng rắn là một vấn đề khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a completely different situation or person from the one previously mentioned",
                    "vi": "một tình huống hoặc một người hoàn toàn khác với tình huống đã đề cập trước đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have information or evidence that the opposite is true",
                    "vi": "để có thông tin hoặc bằng chứng rằng điều ngược lại là đúng"
                },
                "examples": [
                    {
                        "en": "He says he doesn't care about what the critics write, but I know different.",
                        "vi": "Anh ấy nói anh ấy không quan tâm đến những gì các nhà phê bình viết, nhưng tôi biết thì khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a different way from other people; to have different attitudes or ideas",
                    "vi": "cư xử theo một cách khác với những người khác; có thái độ hoặc ý tưởng khác nhau"
                },
                "examples": [
                    {
                        "en": "She was a gifted and original artist who marched to a different drummer.",
                        "vi": "Cô ấy là một nghệ sĩ tài năng và ban đầu, người đã chuyển sang một tay trống khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have different aims that cannot be achieved together without causing problems",
                    "vi": "có những mục tiêu khác nhau mà không thể đạt được cùng nhau mà không gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "There are different considerations, often pulling in different directions.",
                        "vi": "Có những cân nhắc khác nhau, thường kéo theo các hướng khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change the way that a situation appears",
                    "vi": "để thay đổi cách một tình huống xuất hiện"
                },
                "examples": [
                    {
                        "en": "What you have told us puts a different complexion on the situation.",
                        "vi": "Những gì bạn đã nói với chúng tôi đặt một nước da khác vào tình hình."
                    },
                    {
                        "en": "The joke took on a rather serious complexion when the police became involved.",
                        "vi": "Trò đùa diễn ra khá nghiêm trọng khi cảnh sát vào cuộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change your opinion about somebody/something or your attitude towards somebody/something",
                    "vi": "để thay đổi quan điểm của bạn về ai đó / điều gì đó hoặc thái độ của bạn đối với ai đó / điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give some information that is different from what you expect or have been told",
                    "vi": "để cung cấp một số thông tin khác với những gì bạn mong đợi hoặc đã được cho biết"
                },
                "examples": [
                    {
                        "en": "These drugs are widely believed to be effective medications. The data, however, tell a different story.",
                        "vi": "Những loại thuốc này được nhiều người tin rằng là những loại thuốc chữa bệnh hiệu quả. Tuy nhiên, dữ liệu lại kể một câu chuyện khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "59e12c2d9ef748f9a8ce8af15b5a58bb",
        "word": "differ",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɪfə(r)/",
            "us": "/ˈdɪfər/"
        },
        "nearby": [
            {
                "word": "Marlene Dietrich",
                "pos": ""
            },
            {
                "word": "Dieu et mon droit",
                "pos": ""
            },
            {
                "word": "differ",
                "pos": "verb"
            },
            {
                "word": "difference",
                "pos": "noun"
            },
            {
                "word": "different",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be different from somebody/something",
                    "vi": "khác với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "They hold differing views.",
                        "vi": "Họ có những quan điểm khác nhau."
                    },
                    {
                        "en": "A differs from B French differs from English in this respect.",
                        "vi": "A khác với B tiếng Pháp khác với tiếng Anh về mặt này."
                    },
                    {
                        "en": "A and B differ (from each other) French and English differ in this respect.",
                        "vi": "A và B khác nhau (với nhau) Tiếng Pháp và tiếng Anh khác nhau về mặt này."
                    },
                    {
                        "en": "differ between A and B Ideas on childcare may differ considerably between the parents.",
                        "vi": "khác nhau giữa A và B Ý tưởng về chăm sóc trẻ có thể khác nhau đáng kể giữa các bậc cha mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to disagree with somebody",
                    "vi": "không đồng ý với ai đó"
                },
                "examples": [
                    {
                        "en": "differ (with somebody) (about/on/over something) I have to differ with you on that.",
                        "vi": "khác nhau (với ai đó) (về / trên / về điều gì đó) Tôi phải khác biệt với bạn về điều đó."
                    },
                    {
                        "en": "differ (as to something) Medical opinion differs as to how to treat the disease.",
                        "vi": "khác nhau (về điều gì đó) Ý kiến y tế khác nhau về cách điều trị bệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two people agree to differ/disagree, they accept that they have different opinions about something, but they decide not to discuss it any longer",
                    "vi": "Nếu hai người đồng ý về sự khác biệt / không đồng ý, họ chấp nhận rằng họ có ý kiến khác nhau về điều gì đó, nhưng họ quyết định không thảo luận về vấn đề đó nữa"
                },
                "examples": [
                    {
                        "en": "We must just agree to differ on this.",
                        "vi": "Chúng ta phải đồng ý khác nhau về điều này."
                    },
                    {
                        "en": "In the end we agreed to disagree.",
                        "vi": "Cuối cùng chúng tôi nhất trí không đồng ý."
                    },
                    {
                        "en": "I think you're wrong. Let's just agree to differ.",
                        "vi": "Tôi nghĩ bạn đã nhầm. Hãy đồng ý với sự khác biệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say politely that you do not agree with something that has just been said",
                    "vi": "được sử dụng để nói một cách lịch sự rằng bạn không đồng ý với điều gì đó vừa được nói"
                },
                "examples": [
                    {
                        "en": "‘At least she is good at her job.’ ‘Oh, I beg to differ.’",
                        "vi": "Ít nhất thì cô ấy cũng làm tốt công việc của mình.' 'Ồ, tôi cầu xin sự khác biệt.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "87cc497c26054a3eb8912620009d5bc4",
        "word": "contradiction",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒntrəˈdɪkʃn/",
            "us": "/ˌkɑːntrəˈdɪkʃn/"
        },
        "nearby": [
            {
                "word": "contractually",
                "pos": "adverb"
            },
            {
                "word": "contradict",
                "pos": "verb"
            },
            {
                "word": "contradiction",
                "pos": "noun"
            },
            {
                "word": "contradictory",
                "pos": "adjective"
            },
            {
                "word": "contradistinction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lack of agreement between facts, opinions, actions, etc.",
                    "vi": "sự thiếu thống nhất giữa các sự kiện, ý kiến, hành động, v.v."
                },
                "examples": [
                    {
                        "en": "contradiction (between A and B) There is a contradiction between the two sets of figures.",
                        "vi": "mâu thuẫn (giữa A và B) Có sự mâu thuẫn giữa hai tập hợp các hình."
                    },
                    {
                        "en": "How can we resolve this apparent contradiction?",
                        "vi": "Làm thế nào chúng ta có thể giải quyết mâu thuẫn rõ ràng này?"
                    },
                    {
                        "en": "in contradiction to something His public speeches are in direct contradiction to his personal lifestyle.",
                        "vi": "mâu thuẫn với điều gì đó Các bài phát biểu trước công chúng của anh ấy mâu thuẫn trực tiếp với lối sống cá nhân của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of saying that something that somebody else has said is wrong or not true; an example of this",
                    "vi": "hành động nói rằng điều gì đó mà người khác đã nói là sai hoặc không đúng; một ví dụ về điều này"
                },
                "examples": [
                    {
                        "en": "I think I can say, without fear of contradiction, that…",
                        "vi": "Tôi nghĩ rằng tôi có thể nói, mà không sợ mâu thuẫn, rằng…"
                    },
                    {
                        "en": "contradiction of something Now you say you both left at ten—that's a contradiction of your last statement.",
                        "vi": "mâu thuẫn của điều gì đó Bây giờ bạn nói rằng cả hai đều rời đi lúc mười giờ - đó là mâu thuẫn với tuyên bố cuối cùng của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement containing two words that contradict each other’s meaning",
                    "vi": "một câu nói có hai từ trái ngược nhau về ý nghĩa"
                },
                "examples": [
                    {
                        "en": "A ‘nomad settlement’ is a contradiction in terms.",
                        "vi": "Một 'khu định cư du mục' là một sự mâu thuẫn về các điều khoản."
                    },
                    {
                        "en": "The idea is almost a contradiction in terms.",
                        "vi": "Ý tưởng gần như là một mâu thuẫn về mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "354e6a68de7846d0a840c9b9216564d9",
        "word": "contradictory",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɒntrəˈdɪktəri/",
            "us": "/ˌkɑːntrəˈdɪktəri/"
        },
        "nearby": [
            {
                "word": "contradict",
                "pos": "verb"
            },
            {
                "word": "contradiction",
                "pos": "noun"
            },
            {
                "word": "contradictory",
                "pos": "adjective"
            },
            {
                "word": "contradistinction",
                "pos": "noun"
            },
            {
                "word": "contrafactive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing or showing a lack of agreement between statements, facts, opinions or actions",
                    "vi": "chứa đựng hoặc thể hiện sự thiếu thống nhất giữa các tuyên bố, sự kiện, ý kiến hoặc hành động"
                },
                "examples": [
                    {
                        "en": "We are faced with two apparently contradictory statements.",
                        "vi": "Chúng tôi đang đối mặt với hai tuyên bố rõ ràng là trái ngược nhau."
                    },
                    {
                        "en": "The advice I received was often contradictory.",
                        "vi": "Những lời khuyên tôi nhận được thường trái ngược nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "6a4910a1e4494e829516102dd83f764d",
        "word": "go against",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "goad on",
                "pos": "phrasal verb"
            },
            {
                "word": "go after",
                "pos": "phrasal verb"
            },
            {
                "word": "go against",
                "pos": "phrasal verb"
            },
            {
                "word": "go ahead",
                "pos": "phrasal verb"
            },
            {
                "word": "go-ahead",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to not be in somebody’s favour or not to their advantage",
                    "vi": "không có lợi cho ai đó hoặc không có lợi cho họ"
                },
                "examples": [
                    {
                        "en": "The jury's verdict went against him.",
                        "vi": "Phán quyết của bồi thẩm đoàn đã chống lại anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to resist or oppose somebody/something",
                    "vi": "chống lại hoặc chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He would not go against his parents' wishes.",
                        "vi": "Anh sẽ không đi ngược lại mong muốn của cha mẹ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be opposed to something; to not fit or agree with something",
                    "vi": "để được đối lập với một cái gì đó; không phù hợp hoặc đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Paying for hospital treatment goes against her principles.",
                        "vi": "Trả tiền điều trị tại bệnh viện đi ngược lại nguyên tắc của cô ấy."
                    },
                    {
                        "en": "His thinking goes against all logic.",
                        "vi": "Suy nghĩ của anh ta đi ngược lại mọi logic."
                    }
                ]
            }
        ]
    },
    {
        "id": "7692aad986ed41e0bbf72ca4b44d395c",
        "word": "at variance (with somebody/something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈveəriəns/",
            "us": "/ˈveriəns/"
        },
        "nearby": [
            {
                "word": "variable",
                "pos": "adjective"
            },
            {
                "word": "variably",
                "pos": "adverb"
            },
            {
                "word": "variance",
                "pos": "noun"
            },
            {
                "word": "variant",
                "pos": "noun"
            },
            {
                "word": "variant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount by which something changes or is different from something else",
                    "vi": "số lượng mà thứ gì đó thay đổi hoặc khác với thứ khác"
                },
                "examples": [
                    {
                        "en": "variance in temperature",
                        "vi": "phương sai nhiệt độ"
                    },
                    {
                        "en": "a note with subtle variances of pitch",
                        "vi": "một nốt nhạc với sự khác biệt nhỏ của cao độ"
                    }
                ]
            },
            {
                "define": {
                    "en": "disagreeing with or opposing somebody/something",
                    "vi": "không đồng ý với hoặc phản đối ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "These conclusions are totally at variance with the evidence.",
                        "vi": "Những kết luận này hoàn toàn khác với bằng chứng."
                    },
                    {
                        "en": "He uttered a string of oaths, so oddly at variance with his usual smooth and civilized manner.",
                        "vi": "Anh ta thốt ra một chuỗi lời thề, khác xa với phong thái lịch sự và văn minh thường thấy của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e40e9a62db14f279798ebe01eb53ca0",
        "word": "inconsistency",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnkənˈsɪstənsi/",
            "us": "/ˌɪnkənˈsɪstənsi/"
        },
        "nearby": [
            {
                "word": "inconsiderate",
                "pos": "adjective"
            },
            {
                "word": "inconsiderately",
                "pos": "adverb"
            },
            {
                "word": "inconsistency",
                "pos": "noun"
            },
            {
                "word": "inconsistent",
                "pos": "adjective"
            },
            {
                "word": "inconsistently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if there is inconsistency between two statements, etc, they cannot both be true because they give the facts in a different way",
                    "vi": "nếu có sự mâu thuẫn giữa hai tuyên bố, v.v., cả hai đều không thể đúng vì chúng đưa ra các sự kiện theo một cách khác"
                },
                "examples": [
                    {
                        "en": "inconsistency between A and B There is some inconsistency between the witnesses' evidence and their earlier statements.",
                        "vi": "sự mâu thuẫn giữa A và B Có một số mâu thuẫn giữa bằng chứng của nhân chứng và lời khai trước đó của họ."
                    },
                    {
                        "en": "inconsistency with something There are some inconsistencies with Baldwin's account.",
                        "vi": "không nhất quán với điều gì đó Có một số điểm không nhất quán với tài khoản của Baldwin."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of not matching a set of standards, ideas, etc.",
                    "vi": "thực tế là không phù hợp với một bộ tiêu chuẩn, ý tưởng, v.v."
                },
                "examples": [
                    {
                        "en": "I noticed a few minor inconsistencies in her argument.",
                        "vi": "Tôi nhận thấy một vài mâu thuẫn nhỏ trong lập luận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of tending to change too often and not stay the same",
                    "vi": "thực tế là có xu hướng thay đổi quá thường xuyên và không giữ nguyên"
                },
                "examples": [
                    {
                        "en": "Farmed salmon avoids the inconsistency of ocean fish.",
                        "vi": "Cá hồi nuôi tránh được sự bất nhất của cá đại dương."
                    }
                ]
            }
        ]
    },
    {
        "id": "323b17f8c7c440dea0df3408fb3724db",
        "word": "inconsistent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnkənˈsɪstənt/",
            "us": "/ˌɪnkənˈsɪstənt/"
        },
        "nearby": [
            {
                "word": "inconsiderately",
                "pos": "adverb"
            },
            {
                "word": "inconsistency",
                "pos": "noun"
            },
            {
                "word": "inconsistent",
                "pos": "adjective"
            },
            {
                "word": "inconsistently",
                "pos": "adverb"
            },
            {
                "word": "inconsolable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if two statements, etc. are inconsistent, or one is inconsistent with the other, they cannot both be true because they give the facts in a different way",
                    "vi": "nếu hai tuyên bố, v.v. không nhất quán hoặc một câu không nhất quán với câu kia, thì cả hai đều không thể đúng vì chúng đưa ra các sự kiện theo một cách khác"
                },
                "examples": [
                    {
                        "en": "The report is inconsistent with the financial statements.",
                        "vi": "Báo cáo không phù hợp với báo cáo tài chính."
                    },
                    {
                        "en": "The witnesses' statements were inconsistent.",
                        "vi": "Lời khai của các nhân chứng không nhất quán."
                    }
                ]
            },
            {
                "define": {
                    "en": "not matching a set of standards, ideas, etc.",
                    "vi": "không phù hợp với một tập hợp các tiêu chuẩn, ý tưởng, v.v."
                },
                "examples": [
                    {
                        "en": "Her behaviour was clearly inconsistent with her beliefs.",
                        "vi": "Hành vi của cô ấy rõ ràng là không phù hợp với niềm tin của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "tending to change too often; not staying the same",
                    "vi": "có xu hướng thay đổi quá thường xuyên; không giống nhau"
                },
                "examples": [
                    {
                        "en": "inconsistent results",
                        "vi": "kết quả không nhất quán"
                    },
                    {
                        "en": "Children find it difficult if a parent is inconsistent.",
                        "vi": "Trẻ em cảm thấy khó khăn nếu cha mẹ không nhất quán."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a386e9d8d9d464eab10b2cae9613262",
        "word": "inconsistently",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnkənˈsɪstəntli/",
            "us": "/ˌɪnkənˈsɪstəntli/"
        },
        "nearby": [
            {
                "word": "inconsistency",
                "pos": "noun"
            },
            {
                "word": "inconsistent",
                "pos": "adjective"
            },
            {
                "word": "inconsistently",
                "pos": "adverb"
            },
            {
                "word": "inconsolable",
                "pos": "adjective"
            },
            {
                "word": "inconsolably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that does not match a set of standards, ideas, etc.",
                    "vi": "theo cách không phù hợp với một bộ tiêu chuẩn, ý tưởng, v.v."
                },
                "examples": [
                    {
                        "en": "They have acted inconsistently with their obligations.",
                        "vi": "Họ đã hành động trái với nghĩa vụ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that changes too often and does not stay the same",
                    "vi": "theo cách thay đổi quá thường xuyên và không giữ nguyên"
                },
                "examples": [
                    {
                        "en": "In the real world, people behave inconsistently and contradict themselves.",
                        "vi": "Trong thế giới thực, mọi người cư xử không nhất quán và mâu thuẫn với chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "060cbb8445494a87b56b47598c7cc96c",
        "word": "out of keeping (with something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkiːpɪŋ/",
            "us": "/ˈkiːpɪŋ/"
        },
        "nearby": [
            {
                "word": "keep from",
                "pos": "phrasal verb"
            },
            {
                "word": "keep in",
                "pos": "phrasal verb"
            },
            {
                "word": "keeping",
                "pos": "noun"
            },
            {
                "word": "keep in with",
                "pos": "phrasal verb"
            },
            {
                "word": "keep off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "being taken care of by somebody",
                    "vi": "được ai đó chăm sóc"
                },
                "examples": [
                    {
                        "en": "(figurative) Her secrets were safe in his keeping.",
                        "vi": "(nghĩa bóng) Những bí mật của cô đã được anh giữ an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "appropriate or expected in a particular situation; in agreement with something",
                    "vi": "thích hợp hoặc được mong đợi trong một tình huống cụ thể; đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The latest results are in keeping with our earlier findings.",
                        "vi": "Các kết quả mới nhất phù hợp với những phát hiện trước đó của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "not appropriate or expected in a particular situation; not in agreement with something",
                    "vi": "không thích hợp hoặc không được mong đợi trong một tình huống cụ thể; không đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The painting is out of keeping with the rest of the room.",
                        "vi": "Bức tranh không phù hợp với phần còn lại của căn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f0d3442039942a38ca382376c8a4c78",
        "word": "out of kilter",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɪltə(r)/",
            "us": "/ˈkɪltər/"
        },
        "nearby": [
            {
                "word": "kilt",
                "pos": "noun"
            },
            {
                "word": "kilted",
                "pos": "adjective"
            },
            {
                "word": "kilter",
                "pos": "noun"
            },
            {
                "word": "Francis Kilvert",
                "pos": ""
            },
            {
                "word": "Kim",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not agreeing with or the same as something else",
                    "vi": "không đồng ý với hoặc giống với điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "His views are out of kilter with world opinion.",
                        "vi": "Quan điểm của anh ấy không phù hợp với dư luận thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer continuing or working in the normal way",
                    "vi": "không còn tiếp tục hoặc làm việc theo cách bình thường"
                },
                "examples": [
                    {
                        "en": "Long flights throw my sleeping pattern out of kilter for days.",
                        "vi": "Những chuyến bay dài khiến thói quen ngủ của tôi mất đi hàng kilomet trong nhiều ngày."
                    }
                ]
            }
        ]
    },
    {
        "id": "fbf03367db5a41f8ae1297b52fdb254b",
        "word": "out of whack",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wæk/",
            "us": "/wæk/"
        },
        "nearby": [
            {
                "word": "Mr W H",
                "pos": ""
            },
            {
                "word": "whack",
                "pos": "verb"
            },
            {
                "word": "whack",
                "pos": "noun"
            },
            {
                "word": "whacked",
                "pos": "adjective"
            },
            {
                "word": "whacking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of hitting somebody/something hard; the sound made by this",
                    "vi": "hành động đánh ai đó / cái gì đó thật mạnh; âm thanh được tạo ra bởi cái này"
                },
                "examples": [
                    {
                        "en": "He gave the ball a good whack.",
                        "vi": "Anh ấy đã đánh bóng tốt."
                    },
                    {
                        "en": "I heard the whack of the bullet hitting the wood.",
                        "vi": "Tôi nghe thấy tiếng viên đạn đập vào gỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a share of something; an amount of something",
                    "vi": "một chia sẻ của một cái gì đó; một số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Don't leave all the work to her. Everyone should do their fair whack.",
                        "vi": "Đừng để tất cả công việc cho cô ấy. Mọi người nên làm những gì công bằng của họ."
                    },
                    {
                        "en": "You have to pay the full whack. There are no reductions.",
                        "vi": "Bạn phải trả toàn bộ. Không có mức giảm nào."
                    },
                    {
                        "en": "He charges top whack (= the highest amount possible).",
                        "vi": "Anh ta tính phí cao nhất (= số tiền cao nhất có thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer correct or working properly",
                    "vi": "không còn đúng hoặc hoạt động bình thường"
                },
                "examples": [
                    {
                        "en": "The system is clearly out of whack.",
                        "vi": "Hệ thống rõ ràng là không ổn."
                    },
                    {
                        "en": "All the traveling had thrown my body out of whack.",
                        "vi": "Tất cả những chuyến du lịch đã ném cơ thể tôi ra ngoài."
                    },
                    {
                        "en": "The spending priorities were out of whack.",
                        "vi": "Các ưu tiên chi tiêu đã không còn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "not agreeing with or the same as something else",
                    "vi": "không đồng ý với hoặc giống với điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "Expectations and reality got out of whack.",
                        "vi": "Kỳ vọng và thực tế đã vượt ra khỏi tầm ngắm."
                    }
                ]
            }
        ]
    }
]