[
    {
        "id": "a3f0802a30e744d1866f94e47ccd4a54",
        "word": "dress",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/dres/",
            "us": "/dres/"
        },
        "nearby": [
            {
                "word": "drench",
                "pos": "verb"
            },
            {
                "word": "dress",
                "pos": "noun"
            },
            {
                "word": "dress",
                "pos": "verb"
            },
            {
                "word": "dressage",
                "pos": "noun"
            },
            {
                "word": "dress circle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put clothes on yourself/somebody",
                    "vi": "mặc quần áo cho chính bạn / ai đó"
                },
                "examples": [
                    {
                        "en": "I dressed quickly.",
                        "vi": "Tôi mặc quần áo nhanh chóng."
                    },
                    {
                        "en": "Get up and get dressed!",
                        "vi": "Hãy đứng dậy và mặc quần áo!"
                    },
                    {
                        "en": "dress in something He had dressed in a black T-shirt and jeans.",
                        "vi": "mặc một cái gì đó Anh ấy đã mặc một chiếc áo phông đen và quần jean."
                    },
                    {
                        "en": "dress somebody/yourself in something She dressed the children in their best clothes.",
                        "vi": "dress somebody / yourself in something Cô ấy mặc cho bọn trẻ những bộ quần áo đẹp nhất của chúng."
                    },
                    {
                        "en": "dress yourself You're old enough to dress yourself now.",
                        "vi": "tự mặc quần áo Bây giờ bạn đã đủ lớn để tự mặc quần áo."
                    },
                    {
                        "en": "dress somebody/something The children spend hours dressing and undressing their dolls.",
                        "vi": "dress somebody / something Những đứa trẻ dành hàng giờ để mặc quần áo và cởi quần áo cho búp bê của chúng."
                    },
                    {
                        "en": "Her mother always dressed them identically.",
                        "vi": "Mẹ cô luôn mặc quần áo giống hệt nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wear a particular type or style of clothes",
                    "vi": "mặc một loại hoặc kiểu quần áo cụ thể"
                },
                "examples": [
                    {
                        "en": "to dress smartly/casually",
                        "vi": "ăn mặc lịch sự / tùy tiện"
                    },
                    {
                        "en": "All staff are expected to dress appropriately.",
                        "vi": "Tất cả nhân viên phải ăn mặc phù hợp."
                    },
                    {
                        "en": "dress for something You should dress for cold weather today.",
                        "vi": "ăn mặc cho cái gì Bạn nên ăn mặc cho thời tiết lạnh hôm nay."
                    },
                    {
                        "en": "dress in something She always dressed entirely in black.",
                        "vi": "mặc một cái gì đó Cô ấy luôn mặc hoàn toàn bằng màu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on formal clothes",
                    "vi": "mặc quần áo trang trọng"
                },
                "examples": [
                    {
                        "en": "Do they expect us to dress for dinner?",
                        "vi": "Họ có mong đợi chúng ta mặc đồ cho bữa tối không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide clothes for somebody famous",
                    "vi": "cung cấp quần áo cho ai đó nổi tiếng"
                },
                "examples": [
                    {
                        "en": "He dresses many of Hollywood's most famous young stars.",
                        "vi": "Anh diện trang phục cho nhiều ngôi sao trẻ nổi tiếng nhất Hollywood."
                    },
                    {
                        "en": "She dresses celebrities for awards ceremonies.",
                        "vi": "Cô mặc trang phục cho những người nổi tiếng trong các lễ trao giải."
                    }
                ]
            },
            {
                "define": {
                    "en": "to clean, treat and cover a wound",
                    "vi": "để làm sạch, điều trị và băng bó vết thương"
                },
                "examples": [
                    {
                        "en": "The nurse will dress that cut for you.",
                        "vi": "Y tá sẽ mặc đồ cắt cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare food for cooking or eating",
                    "vi": "chuẩn bị thực phẩm để nấu ăn hoặc ăn"
                },
                "examples": [
                    {
                        "en": "to dress a salad (= put oil or vinegar, etc. on it)",
                        "vi": "để trộn salad (= cho dầu hoặc giấm, v.v. lên trên đó)"
                    },
                    {
                        "en": "to dress a chicken (= take out the parts you cannot eat)",
                        "vi": "để mặc một con gà (= loại bỏ những phần bạn không thể ăn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to decorate or arrange something",
                    "vi": "để trang trí hoặc sắp xếp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to dress a shop window (= arrange a display of clothes or goods in it)",
                        "vi": "để trang trí cửa sổ cửa hàng (= sắp xếp trưng bày quần áo hoặc hàng hóa trong đó)"
                    },
                    {
                        "en": "She had her hair dressed by a stylist.",
                        "vi": "Cô được một nhà tạo mẫu làm tóc cho cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare a material such as stone, wood, leather, etc. for use",
                    "vi": "để chuẩn bị một vật liệu như đá, gỗ, da, v.v. để sử dụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have an appearance or wear clothes suitable for a particular job, role or position",
                    "vi": "có ngoại hình hoặc mặc quần áo phù hợp với công việc, vai trò hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "He acts and dresses the part of a gentleman.",
                        "vi": "Anh ấy hành động và ăn mặc như một quý ông."
                    },
                    {
                        "en": "He was a pirate in the school play and certainly looked the part.",
                        "vi": "Anh ta là một tên cướp biển trong vở kịch của trường và chắc chắn là một phần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a woman who is trying to look younger than she really is, especially by wearing clothes that are designed for young people",
                    "vi": "được sử dụng để mô tả một người phụ nữ đang cố gắng trông trẻ hơn so với tuổi thật của cô ấy, đặc biệt là bằng cách mặc quần áo được thiết kế cho những người trẻ tuổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c239727a60fa4f4d8e0b7e6079c49fd2",
        "word": "wear",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/weə(r)/",
            "us": "/wer/"
        },
        "nearby": [
            {
                "word": "weapon of mass destruction",
                "pos": "noun"
            },
            {
                "word": "weaponry",
                "pos": "noun"
            },
            {
                "word": "wear",
                "pos": "verb"
            },
            {
                "word": "wear",
                "pos": "noun"
            },
            {
                "word": "wearable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have something on your body as a piece of clothing, a decoration, etc.",
                    "vi": "để có một thứ gì đó trên cơ thể bạn như một bộ quần áo, một vật trang trí, v.v."
                },
                "examples": [
                    {
                        "en": "He was wearing a new suit.",
                        "vi": "Anh ấy đang mặc một bộ đồ mới."
                    },
                    {
                        "en": "to wear clothes/clothing",
                        "vi": "mặc quần áo / quần áo"
                    },
                    {
                        "en": "to wear a shirt/hat/uniform",
                        "vi": "mặc áo / mũ / đồng phục"
                    },
                    {
                        "en": "to wear shoes/glasses",
                        "vi": "đi giày / kính"
                    },
                    {
                        "en": "Do I have to wear a tie?",
                        "vi": "Tôi có phải đeo cà vạt không?"
                    },
                    {
                        "en": "Was she wearing a seat belt?",
                        "vi": "Cô ấy có thắt dây an toàn không?"
                    },
                    {
                        "en": "She never wears make-up.",
                        "vi": "Cô ấy không bao giờ trang điểm."
                    },
                    {
                        "en": "All delegates must wear a badge.",
                        "vi": "Tất cả các đại biểu phải đeo huy hiệu."
                    },
                    {
                        "en": "She always wears black (= black clothes).",
                        "vi": "Cô ấy luôn mặc đồ đen (= quần áo đen)."
                    },
                    {
                        "en": "I've got nothing to wear.",
                        "vi": "Tôi không có gì để mặc."
                    },
                    {
                        "en": "One woman decided to wear flowers in her hair.",
                        "vi": "Một phụ nữ quyết định cài hoa lên tóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have your hair in a particular style; to have a beard or moustache",
                    "vi": "để tóc của bạn theo một phong cách cụ thể; để râu hoặc ria mép"
                },
                "examples": [
                    {
                        "en": "wear something + adj. She wears her hair long.",
                        "vi": "mặc gì đó + adj. Cô ấy để tóc dài."
                    },
                    {
                        "en": "Hannah preferred to wear her hair short.",
                        "vi": "Hannah thích để tóc ngắn."
                    },
                    {
                        "en": "wear something to wear a beard",
                        "vi": "mặc gì đó để râu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular expression on your face",
                    "vi": "để có một biểu cảm cụ thể trên khuôn mặt của bạn"
                },
                "examples": [
                    {
                        "en": "He wore a puzzled look on his face.",
                        "vi": "Anh ta mang một vẻ mặt khó hiểu."
                    },
                    {
                        "en": "His face wore a puzzled look.",
                        "vi": "Mặt anh ta lộ vẻ khó hiểu."
                    },
                    {
                        "en": "Both men wore confident smiles.",
                        "vi": "Cả hai người đàn ông đều nở nụ cười tự tin."
                    },
                    {
                        "en": "She turned to us, wearing a blank expression.",
                        "vi": "Cô ấy quay sang chúng tôi, với vẻ mặt trống rỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become, or make something become thinner, smoother or weaker through continuous use or rubbing",
                    "vi": "trở nên hoặc làm cho thứ gì đó trở nên mỏng hơn, mịn hơn hoặc yếu hơn thông qua việc sử dụng hoặc cọ xát liên tục"
                },
                "examples": [
                    {
                        "en": "The carpets are starting to wear.",
                        "vi": "Những tấm thảm đang bắt đầu mòn."
                    },
                    {
                        "en": "A racing car's rear end gets very loose as the tyres wear.",
                        "vi": "Phần đuôi xe của một chiếc xe đua trở nên rất lỏng lẻo khi lốp xe bị mòn."
                    },
                    {
                        "en": "wear + adj. The sheets have worn thin.",
                        "vi": "mặc + adj. Các tấm đã bị mòn mỏng."
                    },
                    {
                        "en": "wear something + adj. The stones have been worn smooth by the constant flow of water.",
                        "vi": "mặc gì đó + adj. Những viên đá đã bị mài mòn mịn bởi dòng nước chảy không ngừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a hole, path, etc. in something by continuous use or rubbing",
                    "vi": "để tạo một lỗ, đường dẫn, v.v. trong một cái gì đó bằng cách sử dụng hoặc chà xát liên tục"
                },
                "examples": [
                    {
                        "en": "I've worn holes in all my socks.",
                        "vi": "Tôi đã bị thủng tất trong tất của mình."
                    },
                    {
                        "en": "The water had worn a channel in the rock.",
                        "vi": "Nước đã làm mòn kênh trong đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay in good condition after being used for a long time",
                    "vi": "để ở trong tình trạng tốt sau khi sử dụng trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "That carpet is wearing well, isn't it?",
                        "vi": "Thảm đó mặc đẹp, phải không?"
                    },
                    {
                        "en": "(figurative, humorous) You're wearing well—only a few grey hairs!",
                        "vi": "(nghĩa bóng, hài hước) Bạn mặc đẹp - chỉ có vài sợi tóc bạc thôi!"
                    },
                    {
                        "en": "Those curtains have worn very well.",
                        "vi": "Những tấm rèm đó đã sờn rất tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept or allow something, especially something that you do not approve of",
                    "vi": "chấp nhận hoặc cho phép điều gì đó, đặc biệt là điều gì đó mà bạn không chấp thuận"
                },
                "examples": [
                    {
                        "en": "It's an interesting proposal, but the rich countries are never going to wear it.",
                        "vi": "Đó là một đề xuất thú vị, nhưng các nước giàu sẽ không bao giờ áp dụng nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you feel that a remark applies to you, you should accept it and take it as a warning or criticism",
                    "vi": "nếu bạn cảm thấy rằng một nhận xét áp dụng cho bạn, bạn nên chấp nhận nó và coi nó như một lời cảnh báo hoặc chỉ trích"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to allow your feelings to be seen by other people",
                    "vi": "để cho phép người khác nhìn thấy cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "He’s not one to wear his heart on his sleeve.",
                        "vi": "Anh ấy không phải là người để mặc trái tim của mình trên tay áo của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to become weaker or less acceptable",
                    "vi": "bắt đầu trở nên yếu hơn hoặc ít có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "These excuses are wearing a little thin (= because we've heard them so many times before).",
                        "vi": "Những lời bào chữa này hơi mỏng (= bởi vì chúng tôi đã nghe chúng rất nhiều lần trước đây)."
                    },
                    {
                        "en": "My patience is beginning to wear very thin.",
                        "vi": "Sự kiên nhẫn của tôi bắt đầu hao mòn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person in a marriage or other relationship who makes most of the decisions",
                    "vi": "trở thành người trong hôn nhân hoặc các mối quan hệ khác, người đưa ra hầu hết các quyết định"
                },
                "examples": [
                    {
                        "en": "It’s obvious who wears the trousers in that family!",
                        "vi": "Rõ ràng là ai mặc quần tây trong gia đình đó!"
                    }
                ]
            }
        ]
    },
    {
        "id": "97c50db497754f8f905b45389c1c369b",
        "word": "put on",
        "pos": "phrasal verb",
        "level": "a2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "put into",
                "pos": "phrasal verb"
            },
            {
                "word": "put off",
                "pos": "phrasal verb"
            },
            {
                "word": "put on",
                "pos": "phrasal verb"
            },
            {
                "word": "put-on",
                "pos": "noun"
            },
            {
                "word": "putonghua",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody the phone so that they can talk to the person at the other end",
                    "vi": "đưa điện thoại cho ai đó để họ có thể nói chuyện với người ở đầu dây bên kia"
                },
                "examples": [
                    {
                        "en": "Hi, Dad—can you put Nicky on?",
                        "vi": "Xin chào, bố - bố có thể cho Nicky mặc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to make somebody believe something that is not true, usually as a joke",
                    "vi": "để cố gắng làm cho ai đó tin vào điều gì đó không đúng, thường là một trò đùa"
                },
                "examples": [
                    {
                        "en": "Oh, come on, you know I was only putting you on.",
                        "vi": "Oh, thôi nào, bạn biết tôi chỉ đặt bạn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dress yourself in something",
                    "vi": "mặc cho mình một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Hurry up! Put your coat on!",
                        "vi": "Nhanh lên! Mặc áo khoác vào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to apply something to your skin, face, etc.",
                    "vi": "để thoa thứ gì đó lên da, mặt, v.v."
                },
                "examples": [
                    {
                        "en": "She's just putting on her make-up.",
                        "vi": "Cô ấy chỉ đang trang điểm thôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to switch on a piece of equipment",
                    "vi": "để bật một thiết bị"
                },
                "examples": [
                    {
                        "en": "I'll put the kettle on for tea.",
                        "vi": "Tôi sẽ đặt ấm để pha trà."
                    },
                    {
                        "en": "She put on the brakes suddenly.",
                        "vi": "Cô phanh gấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to play recorded music or a video",
                    "vi": "để bắt đầu phát nhạc đã ghi hoặc video"
                },
                "examples": [
                    {
                        "en": "Do you mind if I put some music on?",
                        "vi": "Bạn có phiền nếu tôi bật nhạc lên không?"
                    },
                    {
                        "en": "The DJ put on a techno dance number.",
                        "vi": "DJ đã bật một bản nhạc kỹ thuật số."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start cooking food, especially on top of a cooker",
                    "vi": "để bắt đầu nấu thức ăn, đặc biệt là trên miệng nồi"
                },
                "examples": [
                    {
                        "en": "I just need to put the potatoes on.",
                        "vi": "Tôi chỉ cần đặt khoai tây vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become heavier, especially by the amount mentioned",
                    "vi": "trở nên nặng hơn, đặc biệt là theo số lượng đã đề cập"
                },
                "examples": [
                    {
                        "en": "She looks like she's put on weight.",
                        "vi": "Cô ấy trông giống như cô ấy đang tăng cân."
                    },
                    {
                        "en": "He must have put on several kilos.",
                        "vi": "Chắc anh ấy đã lên vài ký rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide something specially",
                    "vi": "để cung cấp một cái gì đó đặc biệt"
                },
                "examples": [
                    {
                        "en": "The city is putting on extra buses during the summer.",
                        "vi": "Thành phố đang tăng cường thêm xe buýt trong mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce or present a play, a show, etc.",
                    "vi": "để sản xuất hoặc trình bày một vở kịch, một chương trình, v.v."
                },
                "examples": [
                    {
                        "en": "The local drama club is putting on ‘Macbeth’.",
                        "vi": "Câu lạc bộ kịch địa phương đang đưa vào vở kịch 'Macbeth'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to have a particular feeling, quality, way of speaking, etc.",
                    "vi": "giả vờ có một cảm giác, phẩm chất, cách nói cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "He put on an American accent.",
                        "vi": "Anh ta nói giọng Mỹ."
                    },
                    {
                        "en": "I don't think she was hurt. She was just putting it on.",
                        "vi": "Tôi không nghĩ cô ấy bị thương. Cô ấy chỉ đang mặc nó vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add an amount of money or a tax to the cost of something",
                    "vi": "để thêm một số tiền hoặc một khoản thuế vào chi phí của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The government has put ten pence on the price of twenty cigarettes.",
                        "vi": "Chính phủ đã đặt mười pence vào giá của hai mươi điếu thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bet money on something",
                    "vi": "đặt cược tiền vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I've never put money on a horse.",
                        "vi": "Tôi chưa bao giờ đặt tiền lên ngựa."
                    },
                    {
                        "en": "I put £5 on him to win.",
                        "vi": "Tôi đặt 5 bảng cho anh ấy để giành chiến thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "8954c38d3a6c44d1a47e91fb2ccb2f16",
        "word": "remove",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/rɪˈmuːv/",
            "us": "/rɪˈmuːv/"
        },
        "nearby": [
            {
                "word": "removalist",
                "pos": "noun"
            },
            {
                "word": "removal van",
                "pos": "noun"
            },
            {
                "word": "remove",
                "pos": "verb"
            },
            {
                "word": "remove",
                "pos": "noun"
            },
            {
                "word": "remover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take somebody/something away from a place",
                    "vi": "để đưa ai đó / thứ gì đó đi khỏi một nơi"
                },
                "examples": [
                    {
                        "en": "remove somebody/something Illegally parked vehicles will be removed.",
                        "vi": "loại bỏ ai đó / cái gì đó Các phương tiện đậu trái phép sẽ bị loại bỏ."
                    },
                    {
                        "en": "remove somebody/something from somebody/something He removed his hand from her shoulder.",
                        "vi": "loại bỏ ai đó / cái gì đó khỏi ai đó / cái gì đó Anh ấy bỏ tay ra khỏi vai cô ấy."
                    },
                    {
                        "en": "Three children were removed from the school for persistent bad behaviour.",
                        "vi": "Ba đứa trẻ đã bị đuổi khỏi trường vì những hành vi xấu liên tục."
                    },
                    {
                        "en": "Remove the pan from the heat and continue to stir the sauce.",
                        "vi": "Lấy chảo ra khỏi bếp và tiếp tục khuấy nước sốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take off clothing, etc. from the body",
                    "vi": "cởi bỏ quần áo, v.v. khỏi cơ thể"
                },
                "examples": [
                    {
                        "en": "She removed her glasses and rubbed her eyes.",
                        "vi": "Cô bỏ kính ra và dụi mắt."
                    },
                    {
                        "en": "Passengers no longer have to remove their shoes during security checks.",
                        "vi": "Hành khách không còn phải cởi giày khi kiểm tra an ninh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of something unpleasant, dirty, etc.; to make something disappear",
                    "vi": "để loại bỏ một cái gì đó khó chịu, bẩn thỉu, vv; để làm cho một cái gì đó biến mất"
                },
                "examples": [
                    {
                        "en": "remove something She has had the tumour removed.",
                        "vi": "loại bỏ một cái gì đó Cô ấy đã được cắt bỏ khối u."
                    },
                    {
                        "en": "She had surgery to remove the two tumours.",
                        "vi": "Cô được phẫu thuật cắt bỏ hai khối u."
                    },
                    {
                        "en": "to remove problems/obstacles/objections",
                        "vi": "để loại bỏ các vấn đề / trở ngại / phản đối"
                    },
                    {
                        "en": "Considerable progress has been made in removing barriers to trade within the EU.",
                        "vi": "Đã đạt được những tiến bộ đáng kể trong việc dỡ bỏ các rào cản đối với thương mại trong EU."
                    },
                    {
                        "en": "The news removed any doubts about the company's future.",
                        "vi": "Tin tức đã xóa bỏ mọi nghi ngờ về tương lai của công ty."
                    },
                    {
                        "en": "This comment has been removed by a moderator.",
                        "vi": "Nhận xét này đã bị xóa bởi một người kiểm duyệt."
                    },
                    {
                        "en": "remove something from somebody/something The police instructed the author to remove the offending material from the website.",
                        "vi": "remove something from somebody / something Cảnh sát đã hướng dẫn tác giả xóa tài liệu vi phạm khỏi trang web."
                    },
                    {
                        "en": "She asked for her name to be removed from the list of candidates.",
                        "vi": "Cô yêu cầu gạch tên mình khỏi danh sách ứng cử viên."
                    },
                    {
                        "en": "It was impossible to remove the stain from the tablecloth.",
                        "vi": "Không thể nào tẩy sạch vết bẩn trên khăn trải bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dismiss somebody from their position or job",
                    "vi": "cách chức ai đó khỏi vị trí hoặc công việc của họ"
                },
                "examples": [
                    {
                        "en": "The elections removed the government from power.",
                        "vi": "Các cuộc bầu cử đã loại bỏ chính phủ khỏi quyền lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very different from something; to not be connected with something",
                    "vi": "rất khác với một cái gì đó; để không được kết nối với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Many of these books are far removed from the reality of the children's lives.",
                        "vi": "Nhiều cuốn sách trong số này xa rời thực tế cuộc sống của trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a different generation",
                    "vi": "thuộc một thế hệ khác"
                },
                "examples": [
                    {
                        "en": "He's my cousin's son so he's my first cousin once removed.",
                        "vi": "Anh ấy là con trai của anh họ tôi nên anh ấy là anh họ đầu tiên của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "832d8b53243147da831c0dfecfe1e41a",
        "word": "have on",
        "pos": "phrasal verb",
        "level": "b1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "the have-nots",
                "pos": "noun"
            },
            {
                "word": "haven't",
                "pos": "short form"
            },
            {
                "word": "have on",
                "pos": "phrasal verb"
            },
            {
                "word": "have out",
                "pos": "phrasal verb"
            },
            {
                "word": "haversack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to make somebody believe something that is not true, usually as a joke",
                    "vi": "để cố gắng làm cho ai đó tin vào điều gì đó không đúng, thường là một trò đùa"
                },
                "examples": [
                    {
                        "en": "You didn't really, did you? You're not having me on, are you?",
                        "vi": "Bạn đã không thực sự, phải không? Bạn không có tôi trên, phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be wearing something",
                    "vi": "được mặc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She had a red jacket on.",
                        "vi": "Cô ấy đã mặc một chiếc áo khoác màu đỏ."
                    },
                    {
                        "en": "He had nothing (= no clothes) on.",
                        "vi": "Anh ta không có gì (= không có quần áo) trên người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a piece of equipment working",
                    "vi": "để lại một phần thiết bị hoạt động"
                },
                "examples": [
                    {
                        "en": "She has her TV on all day.",
                        "vi": "Cô ấy có TV của mình cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have arranged to do something",
                    "vi": "đã sắp xếp để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I can't see you this week—I've got a lot on.",
                        "vi": "Tôi không thể gặp bạn trong tuần này — tôi đã có rất nhiều việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know something bad about somebody, especially something that connects them with a crime",
                    "vi": "để biết điều gì đó không tốt về ai đó, đặc biệt là điều gì đó kết nối họ với tội ác"
                },
                "examples": [
                    {
                        "en": "I'm not worried—they've got nothing on me.",
                        "vi": "Tôi không lo lắng — họ không liên quan gì đến tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e1cbef125484f439068938cf1b92e1c",
        "word": "undress",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈdres/",
            "us": "/ʌnˈdres/"
        },
        "nearby": [
            {
                "word": "undoubtedly",
                "pos": "adverb"
            },
            {
                "word": "undreamed-of",
                "pos": "adjective"
            },
            {
                "word": "undress",
                "pos": "verb"
            },
            {
                "word": "undress",
                "pos": "noun"
            },
            {
                "word": "undressed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take off your clothes; to remove somebody else’s clothes",
                    "vi": "cởi quần áo của bạn; cởi bỏ quần áo của người khác"
                },
                "examples": [
                    {
                        "en": "She undressed and got into bed.",
                        "vi": "Cô ấy cởi quần áo và lên giường."
                    },
                    {
                        "en": "undress somebody to undress a child",
                        "vi": "cởi quần áo ai đó cởi quần áo một đứa trẻ"
                    },
                    {
                        "en": "He got undressed in a small cubicle next to the pool.",
                        "vi": "Anh ta cởi quần áo trong một căn phòng nhỏ cạnh hồ bơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "2b964846fa9f4817a324c7e92e97bb25",
        "word": "unfasten",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈfɑːsn/",
            "us": "/ʌnˈfæsn/"
        },
        "nearby": [
            {
                "word": "unfashionable",
                "pos": "adjective"
            },
            {
                "word": "unfashionably",
                "pos": "adverb"
            },
            {
                "word": "unfasten",
                "pos": "verb"
            },
            {
                "word": "unfathomable",
                "pos": "adjective"
            },
            {
                "word": "unfavourable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to open something that is fastened",
                    "vi": "để mở một cái gì đó được buộc chặt"
                },
                "examples": [
                    {
                        "en": "to unfasten a belt/button, etc.",
                        "vi": "để tháo đai / nút, v.v."
                    },
                    {
                        "en": "Passengers are permitted to unfasten their seat belts.",
                        "vi": "Hành khách được phép thắt dây an toàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "094df594e6744bce807b53a35f6957cd",
        "word": "be dressed up",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bedpost",
                "pos": "noun"
            },
            {
                "word": "bedraggled",
                "pos": "adjective"
            },
            {
                "word": "be dressed up",
                "pos": "phrasal verb"
            },
            {
                "word": "bed rest",
                "pos": "noun"
            },
            {
                "word": "bedridden",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put on special clothes, especially to pretend to be somebody/something different",
                    "vi": "mặc quần áo đặc biệt, đặc biệt là giả làm ai đó / cái gì đó khác biệt"
                },
                "examples": [
                    {
                        "en": "Kids love dressing up.",
                        "vi": "Trẻ em thích mặc quần áo."
                    },
                    {
                        "en": "The boys were all dressed up as pirates.",
                        "vi": "Các chàng trai đều hóa trang thành những tên cướp biển."
                    },
                    {
                        "en": "(British English) dressing-up clothes",
                        "vi": "(Anh Anh) quần áo thay quần áo"
                    },
                    {
                        "en": "(North American English) dress-up clothes",
                        "vi": "(Tiếng Anh Bắc Mỹ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "5d4409c23722423a87d9174b944b6cad",
        "word": "dress up",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "dress shirt",
                "pos": "noun"
            },
            {
                "word": "dress uniform",
                "pos": "noun"
            },
            {
                "word": "dress up",
                "pos": "phrasal verb"
            },
            {
                "word": "dressy",
                "pos": "adjective"
            },
            {
                "word": "drew",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to wear clothes that are more formal than those you usually wear",
                    "vi": "mặc quần áo trang trọng hơn những bộ quần áo bạn thường mặc"
                },
                "examples": [
                    {
                        "en": "There's no need to dress up—come as you are.",
                        "vi": "Không cần phải ăn mặc - mặc như bạn đang có."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on special clothes, especially to pretend to be somebody/something different",
                    "vi": "mặc quần áo đặc biệt, đặc biệt là giả làm ai đó / cái gì đó khác biệt"
                },
                "examples": [
                    {
                        "en": "Kids love dressing up.",
                        "vi": "Trẻ em thích mặc quần áo."
                    },
                    {
                        "en": "The boys were all dressed up as pirates.",
                        "vi": "Các chàng trai đều hóa trang thành những tên cướp biển."
                    },
                    {
                        "en": "(British English) dressing-up clothes",
                        "vi": "(Anh Anh) quần áo thay quần áo"
                    },
                    {
                        "en": "(North American English) dress-up clothes",
                        "vi": "(Tiếng Anh Bắc Mỹ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to present something in a way that makes it seem better or different",
                    "vi": "để trình bày một cái gì đó theo cách làm cho nó có vẻ tốt hơn hoặc khác biệt"
                },
                "examples": [
                    {
                        "en": "However much you try to dress it up, office work is not glamorous.",
                        "vi": "Tuy nhiên, bạn cố gắng ăn mặc nó nhiều, văn phòng làm việc không phải là quyến rũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "058c1e21347d4bd289f88d41ffc0b424",
        "word": "wear out",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "wear off",
                "pos": "phrasal verb"
            },
            {
                "word": "wear on",
                "pos": "phrasal verb"
            },
            {
                "word": "wear out",
                "pos": "phrasal verb"
            },
            {
                "word": "weary",
                "pos": "adjective"
            },
            {
                "word": "weary",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become, or make something become, thin or no longer able to be used, usually because it has been used too much",
                    "vi": "trở thành, hoặc làm cho thứ gì đó trở nên mỏng đi hoặc không còn sử dụng được nữa, thường là do nó đã được sử dụng quá nhiều"
                },
                "examples": [
                    {
                        "en": "He wore out two pairs of shoes last year.",
                        "vi": "Anh ấy đã đi hai đôi giày vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself/somebody feel very tired",
                    "vi": "làm cho bản thân / ai đó cảm thấy rất mệt mỏi"
                },
                "examples": [
                    {
                        "en": "The kids have totally worn me out.",
                        "vi": "Những đứa trẻ đã hoàn toàn làm tôi kiệt sức."
                    },
                    {
                        "en": "You'll wear yourself out if you carry on working so hard.",
                        "vi": "Bạn sẽ kiệt sức nếu bạn tiếp tục làm việc chăm chỉ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6310a80b27f444c98c55352fbf02bdb5",
        "word": "strip",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/strɪp/",
            "us": "/strɪp/"
        },
        "nearby": [
            {
                "word": "stringy",
                "pos": "adjective"
            },
            {
                "word": "strip",
                "pos": "noun"
            },
            {
                "word": "strip",
                "pos": "verb"
            },
            {
                "word": "the Strip",
                "pos": ""
            },
            {
                "word": "strip cartoon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take off all or most of your clothes or another person’s clothes",
                    "vi": "cởi bỏ tất cả hoặc hầu hết quần áo của bạn hoặc quần áo của người khác"
                },
                "examples": [
                    {
                        "en": "I stripped and washed myself all over.",
                        "vi": "Tôi tự lột quần áo và tắm rửa sạch sẽ."
                    },
                    {
                        "en": "They ordered us to strip and lie down on the grass.",
                        "vi": "Họ ra lệnh cho chúng tôi cởi đồ và nằm xuống bãi cỏ."
                    },
                    {
                        "en": "strip down to something She stripped down to her underwear.",
                        "vi": "lột xuống cái gì đó Cô ấy lột xuống đồ lót của mình."
                    },
                    {
                        "en": "strip (something) off We stripped off and ran down to the water.",
                        "vi": "lột (cái gì đó) ra Chúng tôi cởi bỏ và chạy xuống nước."
                    },
                    {
                        "en": "She stripped off her clothes and got into bed.",
                        "vi": "Cô lột sạch quần áo và lên giường."
                    },
                    {
                        "en": "strip somebody (to something) He stood there stripped to the waist (= he had no clothes on the upper part of his body).",
                        "vi": "lột quần áo ai đó (đến cái gì đó) Anh ta đứng đó lột quần áo đến thắt lưng (= anh ta không có quần áo ở phần trên của cơ thể của mình)."
                    },
                    {
                        "en": "strip somebody + adj. He was stripped naked and left in a cell.",
                        "vi": "tước bỏ ai đó + adj. Anh ta bị lột trần và bị bỏ lại trong phòng giam."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take off your clothes as a form of entertainment; to perform a striptease",
                    "vi": "cởi quần áo như một hình thức giải trí; biểu diễn thoát y"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove a layer from something, especially so that it is completely exposed",
                    "vi": "để loại bỏ một lớp khỏi thứ gì đó, đặc biệt là để nó hoàn toàn lộ ra ngoài"
                },
                "examples": [
                    {
                        "en": "strip something (off) Strip off all the existing paint.",
                        "vi": "dải một cái gì đó (tắt) Dải bỏ tất cả các sơn hiện có."
                    },
                    {
                        "en": "After the guests had gone, I stripped all the beds (= removed all the sheets in order to wash them).",
                        "vi": "Sau khi khách đi hết, tôi lột hết ga giường (= cởi bỏ tất cả ga trải giường để giặt)."
                    },
                    {
                        "en": "strip A off/from B Deer had stripped all the bark off the tree.",
                        "vi": "tước A / khỏi B Hươu đã lột hết vỏ cây."
                    },
                    {
                        "en": "strip B of A Deer had stripped the tree of its bark.",
                        "vi": "dải B của A Deer đã tước vỏ cây của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove all the things from a place and leave it empty",
                    "vi": "để loại bỏ tất cả những thứ khỏi một nơi và để trống"
                },
                "examples": [
                    {
                        "en": "strip something (out) We had to strip out all the old wiring and start again.",
                        "vi": "dải một cái gì đó (ra) Chúng tôi phải loại bỏ tất cả các dây cũ và bắt đầu lại."
                    },
                    {
                        "en": "strip something away First, you need to strip away all the old plaster.",
                        "vi": "tước một thứ gì đó đi Đầu tiên, bạn cần tước bỏ tất cả các lớp thạch cao cũ."
                    },
                    {
                        "en": "(figurative) The movie aims to strip away the lies surrounding Kennedy's life.",
                        "vi": "(nghĩa bóng) Bộ phim nhằm lật tẩy những dối trá xung quanh cuộc đời Kennedy."
                    },
                    {
                        "en": "strip something + adj. Thieves had stripped the house bare.",
                        "vi": "tước cái gì đó + adj. Những tên trộm đã lột trần ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to separate a machine, etc. into parts so that they can be cleaned or repaired",
                    "vi": "tách máy, v.v. thành các bộ phận để chúng có thể được làm sạch hoặc sửa chữa"
                },
                "examples": [
                    {
                        "en": "He strips and cleans his rifle every morning.",
                        "vi": "Anh ta tháo và làm sạch khẩu súng mỗi sáng."
                    },
                    {
                        "en": "They taught us how to strip down a car engine and put it back together again.",
                        "vi": "Họ dạy chúng tôi cách tháo động cơ ô tô và lắp chúng lại với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take away property or honours from somebody, as a punishment",
                    "vi": "lấy đi tài sản hoặc danh dự của ai đó, như một hình phạt"
                },
                "examples": [
                    {
                        "en": "He was disgraced and stripped of his title.",
                        "vi": "Ông bị thất sủng và bị tước bỏ danh hiệu."
                    },
                    {
                        "en": "The president had been completely stripped of power.",
                        "vi": "Tổng thống đã hoàn toàn bị tước bỏ quyền lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "e785a3cddc6b4a3887c16699d4cc5009",
        "word": "take",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/teɪk/",
            "us": "/teɪk/"
        },
        "nearby": [
            {
                "word": "Tajikistan",
                "pos": "noun"
            },
            {
                "word": "tajine",
                "pos": "noun"
            },
            {
                "word": "take",
                "pos": "verb"
            },
            {
                "word": "take",
                "pos": "noun"
            },
            {
                "word": "take aback",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to carry or move something from one place to another",
                    "vi": "mang hoặc di chuyển một cái gì đó từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "take something Remember to take your coat when you leave.",
                        "vi": "lấy một cái gì đó Hãy nhớ lấy áo khoác của bạn khi bạn rời đi."
                    },
                    {
                        "en": "take something with you I forgot to take my bag with me when I got off the bus.",
                        "vi": "mang theo thứ gì đó Tôi đã quên mang theo túi của tôi khi tôi xuống xe buýt."
                    },
                    {
                        "en": "take somebody something Shall I take my host family a gift?",
                        "vi": "lấy ai đó một cái gì đó Tôi có nên mang một món quà cho gia đình chủ nhà của tôi không?"
                    },
                    {
                        "en": "take something to somebody/something Can you take my suit to the dry-cleaner's?",
                        "vi": "đưa cái gì đó cho ai đó / cái gì đó Bạn có thể mang bộ đồ của tôi đến tiệm giặt khô được không?"
                    },
                    {
                        "en": "You need to take your laptop to the technician.",
                        "vi": "Bạn cần mang laptop của mình đến gặp kỹ thuật viên."
                    },
                    {
                        "en": "take something for somebody/something Don't forget to take a present for Catherine's new baby.",
                        "vi": "lấy một cái gì đó cho ai đó / cái gì đó Đừng quên lấy một món quà cho đứa con mới chào đời của Catherine."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go with somebody from one place to another, especially to guide or lead them",
                    "vi": "đi với ai đó từ nơi này đến nơi khác, đặc biệt là để hướng dẫn hoặc dẫn dắt họ"
                },
                "examples": [
                    {
                        "en": "take somebody It's too far to walk—I'll take you by car.",
                        "vi": "đưa ai đó Đi bộ quá xa - Tôi sẽ đưa bạn bằng ô tô."
                    },
                    {
                        "en": "take somebody to something A boy took us to our room.",
                        "vi": "đưa ai đó đến một cái gì đó Một cậu bé đưa chúng tôi vào phòng của chúng tôi."
                    },
                    {
                        "en": "take somebody doing something I'm taking the kids swimming later.",
                        "vi": "đưa ai đó đang làm gì đó tôi sẽ đưa bọn trẻ đi bơi sau đó."
                    },
                    {
                        "en": "take somebody to do something The boys were taken to see their grandparents most weekends.",
                        "vi": "đưa ai đó đi làm gì đó Các cậu bé được đưa đi gặp ông bà vào hầu hết các ngày cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody/something go from one level, situation, etc. to another",
                    "vi": "để khiến ai đó / điều gì đó đi từ cấp độ, tình huống, v.v. này sang cấp độ khác"
                },
                "examples": [
                    {
                        "en": "Her energy and talent took her to the top of her profession.",
                        "vi": "Nghị lực và tài năng của cô ấy đã đưa cô ấy đến đỉnh cao của nghề nghiệp."
                    },
                    {
                        "en": "The new loan takes the total debt to $100 000.",
                        "vi": "Khoản vay mới có tổng số nợ là 100 000 đô la."
                    },
                    {
                        "en": "I'd like to take my argument a stage further.",
                        "vi": "Tôi muốn đưa lập luận của mình lên một giai đoạn nữa."
                    },
                    {
                        "en": "He believes he has the skills to take the club forward.",
                        "vi": "Anh ấy tin rằng mình có đủ kỹ năng để đưa câu lạc bộ phát triển."
                    },
                    {
                        "en": "We'll take the matter forward at our next meeting (= discuss it further).",
                        "vi": "Chúng tôi sẽ giải quyết vấn đề này trong cuộc họp tiếp theo (= thảo luận thêm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to need or require a particular amount of time",
                    "vi": "cần hoặc yêu cầu một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "take something The process took about a year.",
                        "vi": "lấy một cái gì đó Quá trình này mất khoảng một năm."
                    },
                    {
                        "en": "The journey to the airport takes about half an hour.",
                        "vi": "Hành trình đến sân bay mất khoảng nửa giờ."
                    },
                    {
                        "en": "take something to do something It takes about half an hour to get to the airport.",
                        "vi": "mất khoảng nửa giờ để đến sân bay."
                    },
                    {
                        "en": "That cut is taking a long time to heal.",
                        "vi": "Vết cắt đó mất nhiều thời gian để chữa lành."
                    },
                    {
                        "en": "The official seemed to take hours to examine my passport.",
                        "vi": "Viên chức dường như mất hàng giờ để kiểm tra hộ chiếu của tôi."
                    },
                    {
                        "en": "take somebody something That should only take you ten minutes.",
                        "vi": "lấy ai đó thứ gì đó Bạn chỉ mất mười phút."
                    },
                    {
                        "en": "take somebody something to do something It took her three hours to repair her bike.",
                        "vi": "Đưa ai đó làm việc gì đó Cô ấy đã mất ba giờ để sửa chiếc xe đạp của mình."
                    },
                    {
                        "en": "It'll take her time to recover from the illness.",
                        "vi": "Cô ấy sẽ mất thời gian để khỏi bệnh."
                    },
                    {
                        "en": "take something for somebody to do something It'll take time (= take a long time) for her to recover from the illness.",
                        "vi": "lấy một cái gì đó cho ai đó làm một cái gì đó Sẽ mất thời gian (= mất nhiều thời gian) để cô ấy khỏi bệnh."
                    },
                    {
                        "en": "+ adv. I need a shower—I won't take long.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to photograph somebody/something",
                    "vi": "để chụp ảnh ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "take something to take a picture/photo/shot of somebody/something",
                        "vi": "chụp một cái gì đó để chụp một bức ảnh / bức ảnh / chụp ai đó / cái gì đó"
                    },
                    {
                        "en": "to have your picture/photo taken",
                        "vi": "để chụp ảnh / ảnh của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a form of transport, a road, a path, etc. to go to a place",
                    "vi": "để sử dụng một hình thức vận tải, một con đường, một con đường, v.v. để đi đến một địa điểm"
                },
                "examples": [
                    {
                        "en": "to take the bus/train",
                        "vi": "đi xe buýt / xe lửa"
                    },
                    {
                        "en": "to take a cab/plane",
                        "vi": "đi taxi / máy bay"
                    },
                    {
                        "en": "Take the second road on the right.",
                        "vi": "Đi theo con đường thứ hai bên phải."
                    },
                    {
                        "en": "It's more interesting to take the coast road.",
                        "vi": "Đi đường ven biển thú vị hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put your hands or arms around somebody/something and hold them/it; to reach for somebody/something and hold them/it",
                    "vi": "để đặt tay hoặc cánh tay của bạn xung quanh ai đó / cái gì đó và giữ họ / nó; để tiếp cận ai đó / cái gì đó và giữ họ / nó"
                },
                "examples": [
                    {
                        "en": "I passed him the rope and he took it.",
                        "vi": "Tôi đưa cho anh ta sợi dây và anh ta đã lấy nó."
                    },
                    {
                        "en": "Free newspapers: please take one.",
                        "vi": "Báo miễn phí: vui lòng lấy một tờ."
                    },
                    {
                        "en": "Can you take (= hold) the baby for a moment?",
                        "vi": "Bạn có thể bế (= ẵm) đứa bé trong chốc lát được không?"
                    },
                    {
                        "en": "He took her hand/took her by the hand (= held her hand, for example to lead her somewhere).",
                        "vi": "Anh ấy nắm tay cô ấy / nắm lấy tay cô ấy (= nắm tay cô ấy, chẳng hạn để dẫn cô ấy đi đâu đó)."
                    },
                    {
                        "en": "She took the child in her arms and kissed him.",
                        "vi": "Cô ôm đứa trẻ vào lòng và hôn nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something/somebody from a place or a person",
                    "vi": "để loại bỏ một cái gì đó / ai đó khỏi một nơi hoặc một người"
                },
                "examples": [
                    {
                        "en": "Will you take your books off the table?",
                        "vi": "Bạn sẽ lấy sách ra khỏi bàn chứ?"
                    },
                    {
                        "en": "The sign must be taken down.",
                        "vi": "Dấu hiệu phải được gỡ xuống."
                    },
                    {
                        "en": "He took some keys out of his pocket.",
                        "vi": "Anh lấy một số chìa khóa trong túi."
                    },
                    {
                        "en": "My name had been taken off the list.",
                        "vi": "Tên tôi đã được đưa ra khỏi danh sách."
                    },
                    {
                        "en": "She was playing with a knife, so I took it away from her.",
                        "vi": "Cô ấy đang chơi với một con dao, vì vậy tôi đã lấy nó khỏi cô ấy."
                    },
                    {
                        "en": "(informal) She was playing with a knife, so I took it off her.",
                        "vi": "(thân mật) Cô ấy đang nghịch dao, vì vậy tôi đã tháo nó ra."
                    },
                    {
                        "en": "(figurative) The new sports centre will take the pressure off the old one.",
                        "vi": "(nghĩa bóng) Trung tâm thể thao mới sẽ giảm bớt áp lực cho trung tâm cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something without permission or by mistake",
                    "vi": "xóa một cái gì đó mà không có sự cho phép hoặc do nhầm lẫn"
                },
                "examples": [
                    {
                        "en": "Someone has taken my scarf.",
                        "vi": "Ai đó đã lấy chiếc khăn của tôi."
                    },
                    {
                        "en": "Did the burglars take anything valuable?",
                        "vi": "Kẻ trộm có lấy đi thứ gì có giá trị không?"
                    },
                    {
                        "en": "All she had taken was her passport and driving licence.",
                        "vi": "Tất cả những gì cô ấy đã lấy là hộ chiếu và giấy phép lái xe."
                    },
                    {
                        "en": "(figurative) The storms took the lives of 50 people.",
                        "vi": "(nghĩa bóng) Những cơn bão đã cướp đi sinh mạng của 50 người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get something from a particular source",
                    "vi": "để lấy thứ gì đó từ một nguồn cụ thể"
                },
                "examples": [
                    {
                        "en": "take something from something The scientists are taking water samples from the river.",
                        "vi": "lấy cái gì đó từ cái gì đó Các nhà khoa học đang lấy mẫu nước từ sông."
                    },
                    {
                        "en": "The machine takes its name from its inventor.",
                        "vi": "Máy lấy tên từ người phát minh ra nó."
                    },
                    {
                        "en": "take something out of something Part of her article is taken straight (= copied) out of my book.",
                        "vi": "lấy cái gì đó ra khỏi cái gì đó Một phần trong bài báo của cô ấy được đưa thẳng (= sao chép) ra khỏi cuốn sách của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit down in or use a chair, etc.",
                    "vi": "ngồi xuống hoặc sử dụng ghế, v.v."
                },
                "examples": [
                    {
                        "en": "Are these seats taken?",
                        "vi": "Những chiếc ghế này đã được sử dụng chưa?"
                    },
                    {
                        "en": "Come in; take a seat.",
                        "vi": "Mời vào; ngồi xuống đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat, drink, etc. something",
                    "vi": "để ăn, uống, v.v. gì đó"
                },
                "examples": [
                    {
                        "en": "Do you take sugar in your coffee?",
                        "vi": "Bạn có cho đường vào cà phê của bạn không?"
                    },
                    {
                        "en": "The doctor has given me some medicine to take for my cough.",
                        "vi": "Bác sĩ có cho tôi một số loại thuốc để tôi uống."
                    },
                    {
                        "en": "He started taking drugs (= illegal drugs) at college.",
                        "vi": "Anh ấy bắt đầu dùng ma túy (= ma túy bất hợp pháp) ở trường đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find out and record something; to write something down",
                    "vi": "để tìm ra và ghi lại một cái gì đó; viết một cái gì đó ra"
                },
                "examples": [
                    {
                        "en": "The police officer took my name and address.",
                        "vi": "Nhân viên cảnh sát đã lấy tên và địa chỉ của tôi."
                    },
                    {
                        "en": "Did you take notes in the class?",
                        "vi": "Bạn có ghi chép trong lớp không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do an exam or a test",
                    "vi": "để làm một bài kiểm tra hoặc một bài kiểm tra"
                },
                "examples": [
                    {
                        "en": "When did you take your driving test?",
                        "vi": "Bạn đã làm bài kiểm tra lái xe của bạn khi nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to study a subject at school, college, etc.",
                    "vi": "để học một môn học ở trường, đại học, v.v."
                },
                "examples": [
                    {
                        "en": "She is planning to take a course in web design.",
                        "vi": "Cô ấy đang dự định tham gia một khóa học về thiết kế web."
                    },
                    {
                        "en": "Last year I started taking yoga classes.",
                        "vi": "Năm ngoái, tôi bắt đầu tham gia các lớp học yoga."
                    },
                    {
                        "en": "How many subjects are you taking this year?",
                        "vi": "Bạn dự thi bao nhiêu môn trong năm nay?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a particular course of action in order to deal with or achieve something",
                    "vi": "sử dụng một quá trình hành động cụ thể để đối phó hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "take something We need to take a different approach to the problem.",
                        "vi": "lấy một cái gì đó Chúng ta cần có một cách tiếp cận vấn đề khác."
                    },
                    {
                        "en": "The government is taking action to combat drug abuse.",
                        "vi": "Chính phủ đang hành động để chống lại nạn lạm dụng ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with nouns to say that somebody is doing something, performing an action, etc.",
                    "vi": "được sử dụng với danh từ để nói rằng ai đó đang làm điều gì đó, thực hiện một hành động, v.v."
                },
                "examples": [
                    {
                        "en": "to take a look",
                        "vi": "để có một cái nhìn"
                    },
                    {
                        "en": "to take a break",
                        "vi": "nghỉ tý đê"
                    },
                    {
                        "en": "to take a shot at somebody/something",
                        "vi": "chụp ai đó / cái gì đó"
                    },
                    {
                        "en": "to take a step/walk/stroll",
                        "vi": "đi một bước / đi bộ / đi dạo"
                    },
                    {
                        "en": "to take a bath/shower/wash",
                        "vi": "đi tắm / tắm / rửa"
                    },
                    {
                        "en": "to take a bite/drink/sip",
                        "vi": "cắn một miếng / uống / nhâm nhi"
                    },
                    {
                        "en": "to take a deep breath",
                        "vi": "Hít một hơi thật sâu"
                    },
                    {
                        "en": "(British English) We will take a decision on the matter next week.",
                        "vi": "(Anh Anh) Chúng tôi sẽ đưa ra quyết định về vấn đề này vào tuần tới."
                    },
                    {
                        "en": "She's taken a nasty fall and has her leg in plaster.",
                        "vi": "Cô ấy bị ngã khó chịu và bị bó bột ở chân."
                    },
                    {
                        "en": "Experts have urged ministers to take the necessary steps to resolve the issue.",
                        "vi": "Các chuyên gia đã thúc giục các bộ trưởng thực hiện các bước cần thiết để giải quyết vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "to test or measure something",
                    "vi": "để kiểm tra hoặc đo lường một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to take somebody’s temperature",
                        "vi": "để đo nhiệt độ của ai đó"
                    },
                    {
                        "en": "I need to have my blood pressure taken.",
                        "vi": "Tôi cần đo huyết áp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to capture a place or person; to get control of something",
                    "vi": "để chụp một địa điểm hoặc con người; để kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "take something The rebels succeeded in taking the town.",
                        "vi": "lấy một cái gì đó Những người nổi dậy đã thành công trong việc chiếm thị trấn."
                    },
                    {
                        "en": "The state has taken control of the company.",
                        "vi": "Nhà nước đã nắm quyền kiểm soát công ty."
                    },
                    {
                        "en": "take something from somebody The militants took the city from government forces.",
                        "vi": "lấy một cái gì đó từ ai đó Các chiến binh đã chiếm thành phố từ các lực lượng chính phủ."
                    },
                    {
                        "en": "take somebody + noun The rebels took him prisoner.",
                        "vi": "take somebody + noun Những người nổi dậy bắt anh ta làm tù binh."
                    },
                    {
                        "en": "He was taken prisoner by the rebels.",
                        "vi": "Anh bị quân nổi dậy bắt làm tù binh."
                    },
                    {
                        "en": "The bank robbers took several employees hostage.",
                        "vi": "Những tên cướp ngân hàng đã bắt một số nhân viên làm con tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose, buy or rent something",
                    "vi": "để chọn, mua hoặc thuê thứ gì đó"
                },
                "examples": [
                    {
                        "en": "I'll take the grey jacket.",
                        "vi": "Tôi sẽ lấy chiếc áo khoác màu xám."
                    },
                    {
                        "en": "We took a room at the hotel for two nights.",
                        "vi": "Chúng tôi đã nhận một phòng tại khách sạn trong hai đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to buy a newspaper or magazine regularly",
                    "vi": "mua một tờ báo hoặc tạp chí thường xuyên"
                },
                "examples": [
                    {
                        "en": "We take the ‘Express’.",
                        "vi": "Chúng tôi đi 'Express'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept or receive something",
                    "vi": "chấp nhận hoặc nhận một cái gì đó"
                },
                "examples": [
                    {
                        "en": "If they offer me the job, I'll take it.",
                        "vi": "Nếu họ đề nghị công việc cho tôi, tôi sẽ nhận."
                    },
                    {
                        "en": "She was accused of taking bribes.",
                        "vi": "Cô bị buộc tội nhận hối lộ."
                    },
                    {
                        "en": "I'll take the call in my office.",
                        "vi": "Tôi sẽ nhận cuộc gọi trong văn phòng của tôi."
                    },
                    {
                        "en": "I take full responsibility for my actions.",
                        "vi": "Tôi xin hoàn toàn chịu trách nhiệm về hành động của mình."
                    },
                    {
                        "en": "Why should I take the blame for somebody else's mistakes?",
                        "vi": "Tại sao tôi phải đổ lỗi cho sai lầm của người khác?"
                    },
                    {
                        "en": "If you choose deceit, then you must take the consequences of your actions.",
                        "vi": "Nếu bạn chọn sự gian dối, thì bạn phải nhận hậu quả do hành động của mình gây ra."
                    },
                    {
                        "en": "If you take my advice you'll have nothing more to do with him.",
                        "vi": "Nếu bạn nghe theo lời khuyên của tôi, bạn sẽ không còn gì để làm với anh ta nữa."
                    },
                    {
                        "en": "Will you take $10 for the book (= will you sell it for $10)?",
                        "vi": "Bạn sẽ lấy $ 10 cho cuốn sách (= bạn sẽ bán nó với giá $ 10)?"
                    },
                    {
                        "en": "The store took (= sold goods worth) $100 000 last week.",
                        "vi": "Cửa hàng đã lấy (= số hàng đã bán trị giá) 100.000 đô la vào tuần trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in response to an opportunity",
                    "vi": "hành động để đáp lại một cơ hội"
                },
                "examples": [
                    {
                        "en": "When the bus stopped for fuel, we took the opportunity to get something to eat.",
                        "vi": "Khi xe buýt dừng lại để đổ xăng, chúng tôi tranh thủ đi kiếm thứ gì đó để ăn."
                    },
                    {
                        "en": "England failed to take their chances and had to settle for a draw.",
                        "vi": "Đội tuyển Anh đã không tận dụng được cơ hội của mình và đành phải chấp nhận một kết quả hòa."
                    },
                    {
                        "en": "He isn't afraid to take risks.",
                        "vi": "Anh ấy không ngại chấp nhận rủi ro."
                    },
                    {
                        "en": "Take the initiative and fill your life with exciting experiences.",
                        "vi": "Hãy chủ động và lấp đầy cuộc sống của bạn bằng những trải nghiệm thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept somebody as a customer, patient, etc.",
                    "vi": "chấp nhận ai đó là khách hàng, bệnh nhân, v.v."
                },
                "examples": [
                    {
                        "en": "The school doesn't take boys (= only has girls).",
                        "vi": "Trường không nhận nam sinh (= chỉ có nữ sinh)."
                    },
                    {
                        "en": "The dentist can't take any new patients.",
                        "vi": "Nha sĩ không thể nhận bất kỳ bệnh nhân mới nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to experience or be affected by something",
                    "vi": "trải nghiệm hoặc bị ảnh hưởng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "The school took the full force of the explosion.",
                        "vi": "Trường chịu toàn lực nổ."
                    },
                    {
                        "en": "Can the ropes take the strain (= not break)?",
                        "vi": "Liệu dây có thể chịu căng (= không đứt) không?"
                    },
                    {
                        "en": "The team took a terrible beating.",
                        "vi": "Đội đã đánh một trận kinh hoàng."
                    },
                    {
                        "en": "I'm afraid your husband has taken a turn for the worse.",
                        "vi": "Tôi e rằng chồng bạn đã trở nên tồi tệ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to bear something",
                    "vi": "để có thể chịu đựng điều gì đó"
                },
                "examples": [
                    {
                        "en": "She can't take criticism.",
                        "vi": "Cô ấy không thể nhận những lời chỉ trích."
                    },
                    {
                        "en": "I don't think I can take much more of this heat.",
                        "vi": "Tôi không nghĩ rằng tôi có thể chịu đựng thêm nhiều nhiệt độ như thế này."
                    },
                    {
                        "en": "I find his attitude a little hard to take.",
                        "vi": "Tôi thấy thái độ của anh ấy hơi khó chấp nhận."
                    },
                    {
                        "en": "It was clear that she wasn't going to take any nonsense.",
                        "vi": "Rõ ràng là cô ấy sẽ không làm điều gì vô nghĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react to something/somebody in a particular way",
                    "vi": "phản ứng với một cái gì đó / ai đó theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "He took the criticism surprisingly well.",
                        "vi": "Anh ấy đã chấp nhận những lời chỉ trích một cách đáng ngạc nhiên."
                    },
                    {
                        "en": "These threats are not to be taken lightly.",
                        "vi": "Không thể coi nhẹ những mối đe dọa này."
                    },
                    {
                        "en": "I wish you'd take me seriously.",
                        "vi": "Tôi ước bạn sẽ xem xét tôi nghiêm túc."
                    },
                    {
                        "en": "I was being sarcastic but you took my comment literally.",
                        "vi": "Tôi đang bị mỉa mai nhưng bạn đã nhận xét của tôi theo đúng nghĩa đen."
                    },
                    {
                        "en": "She took it in the spirit in which it was intended.",
                        "vi": "Cô ấy đã lấy nó trong tinh thần mà nó đã được dự định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to understand or consider something in a particular way",
                    "vi": "để hiểu hoặc xem xét điều gì đó theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "take something How am I supposed to take that remark?",
                        "vi": "lấy một cái gì đó Làm thế nào tôi có thể nhận xét đó?"
                    },
                    {
                        "en": "Taken overall, the project was a success.",
                        "vi": "Nhìn chung, dự án đã thành công."
                    },
                    {
                        "en": "take something as something She took what he said as a compliment.",
                        "vi": "lấy một cái gì đó như một cái gì đó Cô coi những gì anh ta nói như một lời khen ngợi."
                    },
                    {
                        "en": "take something to do something What did you take his comments to mean?",
                        "vi": "lấy một cái gì đó để làm một cái gì đó Bạn đã nhận xét của mình có nghĩa là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider somebody/something to be somebody/something, especially when you are wrong",
                    "vi": "coi ai đó / cái gì đó là ai đó / cái gì đó, đặc biệt là khi bạn sai"
                },
                "examples": [
                    {
                        "en": "take somebody/something for somebody/something Even the experts took the painting for a genuine Van Gogh.",
                        "vi": "lấy ai đó / cái gì đó cho ai đó / cái gì đó Thậm chí các chuyên gia đã lấy bức tranh cho một Van Gogh chính hiệu."
                    },
                    {
                        "en": "Of course I didn't do it! What do you take me for (= what sort of person do you think I am)?",
                        "vi": "Tất nhiên là tôi đã không làm điều đó! Bạn đưa tôi đi làm gì (= bạn nghĩ tôi là người như thế nào)?"
                    },
                    {
                        "en": "take somebody/something to be somebody/something I took the man with him to be his father.",
                        "vi": "lấy ai đó / cái gì đó để trở thành ai đó / cái gì đó tôi đã đưa người đàn ông với anh ta để làm cha của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular feeling, opinion or attitude",
                    "vi": "để có một cảm giác, quan điểm hoặc thái độ cụ thể"
                },
                "examples": [
                    {
                        "en": "My parents always took an interest in my hobbies.",
                        "vi": "Bố mẹ tôi luôn quan tâm đến sở thích của tôi."
                    },
                    {
                        "en": "Don't take offence (= be offended) at what I said.",
                        "vi": "Đừng xúc phạm (= bị xúc phạm) về những gì tôi đã nói."
                    },
                    {
                        "en": "I took a dislike to him.",
                        "vi": "Tôi không thích anh ta."
                    },
                    {
                        "en": "He takes the view that children are responsible for their own actions.",
                        "vi": "Ông có quan điểm rằng trẻ em phải chịu trách nhiệm về hành động của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reduce one number by the value of another",
                    "vi": "để giảm một số bằng giá trị của một số khác"
                },
                "examples": [
                    {
                        "en": "take A (away) (from B) Take 5 from 12 and you're left with 7.",
                        "vi": "lấy A (đi) (từ B) Lấy 5 từ 12 và bạn còn lại 7."
                    },
                    {
                        "en": "B take away A (informal) 80 take away 5 is 75.",
                        "vi": "take away A (không chính thức) 80 take away 5 là 75."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce somebody/something as an example",
                    "vi": "được sử dụng để giới thiệu ai đó / cái gì đó như một ví dụ"
                },
                "examples": [
                    {
                        "en": "Lots of couples have problems in the first year of marriage. Take Ann and Paul.",
                        "vi": "Rất nhiều cặp đôi gặp trục trặc trong năm đầu tiên của hôn nhân. Đưa Ann và Paul."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have or start to have a particular form, position or state",
                    "vi": "để có hoặc bắt đầu có một hình thức, vị trí hoặc trạng thái cụ thể"
                },
                "examples": [
                    {
                        "en": "Our next class will take the form of a debate.",
                        "vi": "Lớp học tiếp theo của chúng ta sẽ có hình thức tranh luận."
                    },
                    {
                        "en": "The new president takes office in January.",
                        "vi": "Tổng thống mới nhậm chức vào tháng Giêng."
                    },
                    {
                        "en": "The home side had a chance to take the lead.",
                        "vi": "Đội chủ nhà đã có cơ hội vươn lên dẫn trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to need or require something in order to happen or be done",
                    "vi": "cần hoặc yêu cầu một cái gì đó để xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "take somebody/something to do something It only takes one careless driver to cause an accident.",
                        "vi": "Đưa ai đó / điều gì đó làm điều gì đó Chỉ cần một người lái xe bất cẩn có thể gây ra tai nạn."
                    },
                    {
                        "en": "It doesn't take much to make her angry.",
                        "vi": "Không cần nhiều để làm cho cô ấy tức giận."
                    },
                    {
                        "en": "take something (informal) He didn't take much persuading (= he was easily persuaded).",
                        "vi": "lấy một cái gì đó (không chính thức) Anh ta không thuyết phục nhiều (= anh ta dễ bị thuyết phục)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use something in order to work",
                    "vi": "sử dụng một cái gì đó để làm việc"
                },
                "examples": [
                    {
                        "en": "The buses have been adapted to take biofuel.",
                        "vi": "Các xe buýt đã được điều chỉnh để sử dụng nhiên liệu sinh học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wear a particular size in shoes or clothes",
                    "vi": "để mang một kích cỡ cụ thể trong giày hoặc quần áo"
                },
                "examples": [
                    {
                        "en": "What size shoes do you take?",
                        "vi": "Bạn đi giày cỡ nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have enough space for something/somebody; to be able to hold or contain a particular quantity",
                    "vi": "để có đủ không gian cho một cái gì đó / ai đó; để có thể chứa hoặc chứa một số lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "The bus can take 60 passengers.",
                        "vi": "Xe buýt có thể chở 60 hành khách."
                    },
                    {
                        "en": "The tank takes 50 litres.",
                        "vi": "Bể chứa 50 lít."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the teacher or leader in a class or a religious service",
                    "vi": "trở thành giáo viên hoặc người lãnh đạo trong một lớp học hoặc một dịch vụ tôn giáo"
                },
                "examples": [
                    {
                        "en": "take somebody (for something) The head teacher usually takes us for French.",
                        "vi": "take somebody (for something) Giáo viên chủ nhiệm thường đưa chúng tôi đi học tiếng Pháp."
                    },
                    {
                        "en": "take something Mr Perkins took the morning service.",
                        "vi": "lấy thứ gì đó Ông Perkins đã phục vụ buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go over or around something",
                    "vi": "để đi qua hoặc xung quanh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The horse took the first fence well.",
                        "vi": "Con ngựa đã vượt qua hàng rào đầu tiên một cách tốt đẹp."
                    },
                    {
                        "en": "He takes bends much too fast.",
                        "vi": "Anh ta uốn cong quá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kick or throw the ball from a fixed or agreed position",
                    "vi": "đá hoặc ném bóng từ một vị trí cố định hoặc theo thỏa thuận"
                },
                "examples": [
                    {
                        "en": "to take a penalty/free kick/corner",
                        "vi": "thực hiện một quả phạt đền / quả đá phạt / quả phạt góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a particular method to find out people’s opinions",
                    "vi": "sử dụng một phương pháp cụ thể để tìm hiểu ý kiến của mọi người"
                },
                "examples": [
                    {
                        "en": "to take a vote/poll/survey",
                        "vi": "để tham gia một cuộc bỏ phiếu / thăm dò ý kiến / khảo sát"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful; to work",
                    "vi": "để đạt thanh công; làm việc"
                },
                "examples": [
                    {
                        "en": "The skin graft failed to take.",
                        "vi": "Việc ghép da không thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have or require something when used in a sentence or other structure",
                    "vi": "để có hoặc yêu cầu một cái gì đó khi được sử dụng trong một câu hoặc cấu trúc khác"
                },
                "examples": [
                    {
                        "en": "The verb ‘rely’ takes the preposition ‘on’.",
                        "vi": "Động từ 'dựa' có giới từ 'on'."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not care if somebody accepts or rejects your offer",
                    "vi": "được sử dụng để nói rằng bạn không quan tâm nếu ai đó chấp nhận hay từ chối đề nghị của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody does not have a strong opinion about something",
                    "vi": "được sử dụng để nói rằng ai đó không có quan điểm mạnh mẽ về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Dancing? I can take it or leave it.",
                        "vi": "Khiêu vũ? Tôi có thể chấp nhận hoặc từ bỏ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the qualities, ability, etc. needed to be successful",
                    "vi": "để có những phẩm chất, khả năng, v.v. cần thiết để thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you cannot trust somebody to behave well in public",
                    "vi": "từng nói rằng bạn không thể tin tưởng ai đó cư xử tốt ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "You haven’t spilled your coffee again! I can’t take you anywhere!",
                        "vi": "Bạn đã không làm đổ cà phê của bạn một lần nữa! Tôi không thể đưa bạn đi bất cứ đâu!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept something/somebody without wishing it/them to be different or without thinking about it/them very much in advance",
                    "vi": "chấp nhận một cái gì đó / ai đó mà không muốn nó / họ khác đi hoặc không nghĩ về nó / họ rất nhiều"
                },
                "examples": [
                    {
                        "en": "She takes life as it comes.",
                        "vi": "Cô ấy có cuộc sống như nó đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suppose; to assume",
                    "vi": "cho rằng; giả định"
                },
                "examples": [
                    {
                        "en": "I take it you won't be coming to the party?",
                        "vi": "Tôi hiểu bạn sẽ không đến bữa tiệc?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that what you are going to say is the truth",
                    "vi": "được sử dụng để nhấn mạnh rằng những gì bạn sẽ nói là sự thật"
                },
                "examples": [
                    {
                        "en": "Take it from me—he'll be a millionaire before he's 30.",
                        "vi": "Hãy nắm lấy điều đó từ tôi — anh ấy sẽ trở thành triệu phú trước khi anh ấy 30 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody physically or mentally tired",
                    "vi": "làm cho ai đó mệt mỏi về thể chất hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "Looking after small children really takes it out of you.",
                        "vi": "Chăm sóc trẻ nhỏ thực sự mang nó ra khỏi bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to do something without asking permission or advice",
                    "vi": "quyết định làm điều gì đó mà không cần xin phép hoặc lời khuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to need a lot of effort or time; to be very difficult to do",
                    "vi": "cần nhiều nỗ lực hoặc thời gian; rất khó để làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used as an exclamation when you are hitting somebody or attacking them in some other way",
                    "vi": "được sử dụng như một câu cảm thán khi bạn đang đánh ai đó hoặc tấn công họ theo một cách nào đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d7c9cd10a854bfd9a6d9c0ff862a5c2",
        "word": "clothe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kləʊð/",
            "us": "/kləʊð/"
        },
        "nearby": [
            {
                "word": "cloth",
                "pos": "noun"
            },
            {
                "word": "cloth cap",
                "pos": "noun"
            },
            {
                "word": "clothe",
                "pos": "verb"
            },
            {
                "word": "cloth-eared",
                "pos": "adjective"
            },
            {
                "word": "clothed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dress somebody/yourself",
                    "vi": "để mặc cho ai đó / chính bạn"
                },
                "examples": [
                    {
                        "en": "They clothe their children in the latest fashions.",
                        "vi": "Họ cho con cái mình mặc những bộ đồ thời trang mới nhất."
                    },
                    {
                        "en": "(figurative) Climbing plants clothed the courtyard walls.",
                        "vi": "(nghĩa bóng) Cây leo phủ kín các bức tường sân trong."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide clothes for somebody to wear",
                    "vi": "cung cấp quần áo cho ai đó mặc"
                },
                "examples": [
                    {
                        "en": "the costs of feeding and clothing a family",
                        "vi": "chi phí cho thức ăn và quần áo của một gia đình"
                    }
                ]
            }
        ]
    },
    {
        "id": "3e4dcc0df2244db8bf8c3d1d4aa070f4",
        "word": "layer up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "layer",
                "pos": "verb"
            },
            {
                "word": "layer cake",
                "pos": "noun"
            },
            {
                "word": "layer up",
                "pos": "phrasal verb"
            },
            {
                "word": "layette",
                "pos": "noun"
            },
            {
                "word": "lay in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to wear multiple items of clothing, one over the other, in order to keep warm",
                    "vi": "mặc nhiều loại quần áo khác nhau để giữ ấm"
                },
                "examples": [
                    {
                        "en": "He'd have to layer up with winter wear before going outside.",
                        "vi": "Anh ấy sẽ phải mặc đồ mùa đông trước khi ra ngoài."
                    }
                ]
            }
        ]
    }
]