[
    {
        "id": "57bd4db84a424452bcc166af7e9375ff",
        "word": "prefer",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/prɪˈfɜː(r)/",
            "us": "/prɪˈfɜːr/"
        },
        "nearby": [
            {
                "word": "prefect",
                "pos": "noun"
            },
            {
                "word": "prefecture",
                "pos": "noun"
            },
            {
                "word": "prefer",
                "pos": "verb"
            },
            {
                "word": "preferable",
                "pos": "adjective"
            },
            {
                "word": "preferably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to like one thing or person better than another; to choose one thing rather than something else because you like it better",
                    "vi": "thích một thứ hoặc một người tốt hơn một thứ khác; chọn một thứ hơn là một thứ khác vì bạn thích nó hơn"
                },
                "examples": [
                    {
                        "en": "prefer something ‘Coffee or tea?’ ‘I'd prefer tea, thanks.’",
                        "vi": "thích thứ gì đó 'Cà phê hay trà?' \"Tôi thích uống trà hơn, cảm ơn.\""
                    },
                    {
                        "en": "I would prefer it if you didn't tell anyone.",
                        "vi": "Tôi sẽ thích nó hơn nếu bạn không nói với ai."
                    },
                    {
                        "en": "A local firm is to be preferred.",
                        "vi": "Ưu tiên một công ty địa phương."
                    },
                    {
                        "en": "A short-term fixed rate is the preferred option.",
                        "vi": "Một tỷ lệ cố định ngắn hạn là lựa chọn ưu tiên."
                    },
                    {
                        "en": "prefer something to something I much prefer jazz to rock music.",
                        "vi": "thích thứ gì đó hơn thứ gì đó Tôi thích nhạc jazz hơn nhạc rock."
                    },
                    {
                        "en": "I prefer quality to quantity.",
                        "vi": "Tôi thích chất lượng hơn số lượng."
                    },
                    {
                        "en": "prefer something over something A few people still prefer landlines over mobiles.",
                        "vi": "thích thứ gì đó hơn thứ gì đó Một số người vẫn thích điện thoại cố định hơn điện thoại di động."
                    },
                    {
                        "en": "Relevant experience is preferred over formal education.",
                        "vi": "Kinh nghiệm có liên quan được ưu tiên hơn so với giáo dục chính thức."
                    },
                    {
                        "en": "prefer something + adj. I prefer my coffee black.",
                        "vi": "thích cái gì đó + adj. Tôi thích cà phê đen của tôi hơn."
                    },
                    {
                        "en": "prefer to do something I much prefer to travel by train.",
                        "vi": "thích làm điều gì đó mà tôi thích đi tàu hơn."
                    },
                    {
                        "en": "The donor prefers to remain anonymous.",
                        "vi": "Nhà tài trợ muốn giấu tên."
                    },
                    {
                        "en": "I prefer not to think about it.",
                        "vi": "Tôi không muốn nghĩ về nó."
                    },
                    {
                        "en": "She won't discuss her plans in detail, preferring instead to wait until after the election.",
                        "vi": "Cô ấy sẽ không thảo luận chi tiết về kế hoạch của mình, thay vào đó cô ấy muốn đợi cho đến sau cuộc bầu cử."
                    },
                    {
                        "en": "prefer somebody/something to do something Would you prefer me to stay?",
                        "vi": "thích ai đó / điều gì đó làm điều gì đó Bạn có muốn tôi ở lại không?"
                    },
                    {
                        "en": "prefer doing something I prefer playing in defence.",
                        "vi": "thích làm điều gì đó tôi thích chơi ở hàng thủ hơn."
                    },
                    {
                        "en": "prefer that… (formal) I would prefer that you did not mention my name.",
                        "vi": "thích điều đó hơn… (trang trọng) Tôi muốn rằng bạn không đề cập đến tên của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accuse somebody formally of a crime so that there can be a trial in court",
                    "vi": "buộc tội ai đó một cách chính thức để có thể có một phiên tòa xét xử"
                },
                "examples": [
                    {
                        "en": "Police have brought a charge of dangerous driving against the man.",
                        "vi": "Cảnh sát đã buộc tội người đàn ông lái xe nguy hiểm."
                    },
                    {
                        "en": "Many victims of crime are reluctant to press charges against their attackers.",
                        "vi": "Nhiều nạn nhân của tội phạm miễn cưỡng buộc tội những kẻ tấn công họ."
                    },
                    {
                        "en": "She laid charges against the firm for not complying with the regulations.",
                        "vi": "Cô đã buộc tội công ty vì không tuân thủ các quy định."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9763fd1e5a340e082a6a5a92e4b3e31",
        "word": "would",
        "pos": "modal verb",
        "level": "a1",
        "phonetic": {
            "uk": "/wʊd/",
            "us": "/wʊd/"
        },
        "nearby": [
            {
                "word": "wot",
                "pos": ""
            },
            {
                "word": "wotcha",
                "pos": "exclamation"
            },
            {
                "word": "would",
                "pos": "modal verb"
            },
            {
                "word": "would-be",
                "pos": "adjective"
            },
            {
                "word": "wound1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used in polite offers or invitations",
                    "vi": "được sử dụng trong lời mời hoặc lời mời lịch sự"
                },
                "examples": [
                    {
                        "en": "Would you like a sandwich?",
                        "vi": "Bạn muốn ăn sandwich không?"
                    },
                    {
                        "en": "Would you have dinner with me on Friday?",
                        "vi": "Bạn có thể ăn tối với tôi vào thứ sáu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what you like, love, hate, etc.",
                    "vi": "được sử dụng để nói những gì bạn thích, yêu, ghét, v.v."
                },
                "examples": [
                    {
                        "en": "would like, love, hate, prefer, etc. something I'd love a coffee.",
                        "vi": "muốn, yêu, ghét, thích, v.v. một cái gì đó tôi thích một ly cà phê."
                    },
                    {
                        "en": "would like, etc. to do something I'd be only too glad to help.",
                        "vi": "muốn, v.v. để làm điều gì đó, tôi chỉ rất vui khi được giúp đỡ."
                    },
                    {
                        "en": "would like, etc. somebody to do something I'd hate you to think I was criticizing you.",
                        "vi": "muốn, v.v. ai đó làm điều gì đó Tôi ghét bạn nghĩ rằng tôi đang chỉ trích bạn."
                    },
                    {
                        "en": "would rather do something I'd rather come with you.",
                        "vi": "thà làm điều gì đó tôi thà đi cùng bạn."
                    },
                    {
                        "en": "would rather somebody did something I'd rather you came with us.",
                        "vi": "thà ai đó đã làm điều gì đó tôi thà rằng bạn đi cùng chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as the past form of will when reporting what somebody has said or thought",
                    "vi": "được sử dụng như một dạng ý chí trong quá khứ khi báo cáo những gì ai đó đã nói hoặc nghĩ"
                },
                "examples": [
                    {
                        "en": "He said he would be here at eight o'clock (= His words were: ‘I will be there at eight o'clock.’).",
                        "vi": "Anh ấy nói anh ấy sẽ ở đây lúc tám giờ (= Lời anh ấy nói là: 'Tôi sẽ ở đó lúc tám giờ.')."
                    },
                    {
                        "en": "She asked if I would help.",
                        "vi": "Cô ấy hỏi tôi có giúp không."
                    },
                    {
                        "en": "They told me that they probably wouldn't come.",
                        "vi": "Họ nói với tôi rằng họ có thể sẽ không đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about the result of an event that you imagine",
                    "vi": "được sử dụng để nói về kết quả của một sự kiện mà bạn tưởng tượng"
                },
                "examples": [
                    {
                        "en": "She'd look better with shorter hair.",
                        "vi": "Cô ấy sẽ trông đẹp hơn với mái tóc ngắn hơn."
                    },
                    {
                        "en": "If you went to see him, he would be delighted.",
                        "vi": "Nếu bạn đến gặp anh ấy, anh ấy sẽ rất vui."
                    },
                    {
                        "en": "Hurry up! It would be a shame to miss the beginning of the play.",
                        "vi": "Nhanh lên! Sẽ thật tiếc nếu bỏ lỡ phần đầu của vở kịch."
                    },
                    {
                        "en": "She'd be a fool to accept it (= if she accepted).",
                        "vi": "Cô ấy sẽ là một kẻ ngốc khi chấp nhận nó (= nếu cô ấy chấp nhận)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for describing a possible action or event that did not in fact happen, because something else did not happen first",
                    "vi": "được sử dụng để mô tả một hành động hoặc sự kiện có thể xảy ra mà trên thực tế không xảy ra, bởi vì điều gì đó khác đã không xảy ra trước"
                },
                "examples": [
                    {
                        "en": "If I had seen the advertisement in time, I would have applied for the job.",
                        "vi": "Nếu tôi nhìn thấy quảng cáo kịp thời, tôi đã nộp đơn xin việc."
                    },
                    {
                        "en": "They would never have met if she hadn't gone to Emma's party.",
                        "vi": "Họ sẽ không bao giờ gặp nhau nếu cô không đến bữa tiệc của Emma."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying why somebody does something",
                    "vi": "được sử dụng để nói tại sao ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "so that somebody/something would do something She burned the letters so that her husband would never read them.",
                        "vi": "để ai đó / điều gì đó sẽ làm điều gì đó Cô ấy đốt những bức thư để chồng cô ấy sẽ không bao giờ đọc chúng."
                    },
                    {
                        "en": "in order that somebody/something would do something He worked hard in order that he would pass all his exams.",
                        "vi": "để ai đó / điều gì đó sẽ làm điều gì đó Anh ấy đã làm việc chăm chỉ để anh ấy sẽ vượt qua tất cả các kỳ thi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying what you want to happen",
                    "vi": "được sử dụng để nói những gì bạn muốn xảy ra"
                },
                "examples": [
                    {
                        "en": "I wish that you'd be quiet for a minute.",
                        "vi": "Tôi ước rằng bạn yên lặng trong một phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that somebody/something was not willing or refused to do something",
                    "vi": "được sử dụng để cho thấy rằng ai đó / điều gì đó không sẵn lòng hoặc từ chối làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She wouldn't change it, even though she knew it was wrong.",
                        "vi": "Cô ấy sẽ không thay đổi nó, mặc dù cô ấy biết điều đó là sai."
                    },
                    {
                        "en": "My car wouldn't start this morning.",
                        "vi": "Xe của tôi sẽ không khởi động sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody politely to do something",
                    "vi": "được sử dụng để yêu cầu ai đó lịch sự làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Would you mind leaving us alone for a few minutes?",
                        "vi": "Bạn có phiền để chúng tôi một mình trong vài phút không?"
                    },
                    {
                        "en": "Would you open the door for me, please?",
                        "vi": "Làm ơn mở cửa cho tôi được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give opinions that you are not certain about",
                    "vi": "được sử dụng để đưa ra ý kiến mà bạn không chắc chắn về"
                },
                "examples": [
                    {
                        "en": "I would imagine the job will take about two days.",
                        "vi": "Tôi tưởng tượng công việc sẽ mất khoảng hai ngày."
                    },
                    {
                        "en": "I'd say he was about fifty.",
                        "vi": "Tôi muốn nói rằng anh ấy khoảng năm mươi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give advice",
                    "vi": "đã từng đưa ra lời khuyên"
                },
                "examples": [
                    {
                        "en": "I wouldn't have any more to drink, if I were you.",
                        "vi": "Tôi sẽ không uống thêm chút nào nữa, nếu tôi là bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about things that often happened in the past",
                    "vi": "được sử dụng để nói về những điều thường xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "When my parents were away, my grandmother would take care of me.",
                        "vi": "Khi bố mẹ đi vắng, bà nội sẽ chăm sóc tôi."
                    },
                    {
                        "en": "He'd always be the first to offer to help.",
                        "vi": "Anh ấy luôn là người đầu tiên đề nghị giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about behaviour that you think is typical",
                    "vi": "được sử dụng để nói về hành vi mà bạn nghĩ là điển hình"
                },
                "examples": [
                    {
                        "en": "‘She said it was your fault.’ ‘Well, she would say that, wouldn't she? She's never liked me.’",
                        "vi": "Cô ấy nói đó là lỗi của bạn.' 'Chà, cô ấy sẽ nói như vậy, phải không? Cô ấy chưa bao giờ thích tôi. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express a strong wish",
                    "vi": "được sử dụng để bày tỏ một mong muốn mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Would that he had lived to see it.",
                        "vi": "Liệu rằng anh đã sống để nhìn thấy nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "b277cf3df931416d9d9145a2a792931c",
        "word": "favour",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfeɪvə(r)/",
            "us": "/ˈfeɪvər/"
        },
        "nearby": [
            {
                "word": "favicon",
                "pos": "noun"
            },
            {
                "word": "favour",
                "pos": "noun"
            },
            {
                "word": "favour",
                "pos": "verb"
            },
            {
                "word": "favourability",
                "pos": "noun"
            },
            {
                "word": "favourable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prefer one system, plan, way of doing something, etc. to another",
                    "vi": "thích một hệ thống, kế hoạch, cách thực hiện điều gì đó, v.v. hơn"
                },
                "examples": [
                    {
                        "en": "favour something Many countries favour a presidential system of government.",
                        "vi": "ủng hộ điều gì Nhiều quốc gia ủng hộ chế độ chính phủ tổng thống."
                    },
                    {
                        "en": "It’s a resort favoured by families with young children.",
                        "vi": "Đây là khu nghỉ dưỡng được các gia đình có trẻ nhỏ ưa chuộng."
                    },
                    {
                        "en": "Another solution, which I strongly favour, is lower taxes for everyone.",
                        "vi": "Một giải pháp khác mà tôi rất ủng hộ là giảm thuế cho tất cả mọi người."
                    },
                    {
                        "en": "With make-up I favour a minimalist approach.",
                        "vi": "Với trang điểm, tôi thiên về cách tiếp cận tối giản."
                    },
                    {
                        "en": "favour something over something She favours hugs over handshakes.",
                        "vi": "ủng hộ một cái gì đó hơn một cái gì đó Cô ấy ủng hộ những cái ôm hơn là những cái bắt tay."
                    },
                    {
                        "en": "favour doing something Most patients favour seeing the same GP for all their health needs.",
                        "vi": "ủng hộ làm điều gì đó Hầu hết bệnh nhân thích gặp cùng một bác sĩ gia đình cho tất cả các nhu cầu sức khỏe của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat one person, group or organization better than you treat others, especially in an unfair way",
                    "vi": "đối xử với một người, nhóm hoặc tổ chức tốt hơn bạn đối xử với những người khác, đặc biệt là theo cách không công bằng"
                },
                "examples": [
                    {
                        "en": "favour somebody/something The treaty seems to favour the US.",
                        "vi": "ủng hộ ai đó / cái gì đó Hiệp ước dường như có lợi cho Hoa Kỳ."
                    },
                    {
                        "en": "My parents always favoured my older brother.",
                        "vi": "Bố mẹ tôi luôn ưu ái anh trai tôi."
                    },
                    {
                        "en": "He favoured some individuals at the expense of others.",
                        "vi": "Anh ta ủng hộ một số cá nhân bằng cách làm giảm giá trị của những người khác."
                    },
                    {
                        "en": "favour somebody/something over somebody/something News coverage should not favour one party over another.",
                        "vi": "ủng hộ ai đó / cái gì đó hơn ai đó / cái gì đó Tin tức không nên ủng hộ bên này hơn bên kia."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide suitable conditions for a particular person, group, etc.",
                    "vi": "để cung cấp các điều kiện thích hợp cho một người, một nhóm cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "The warm climate favours many types of tropical plants.",
                        "vi": "Khí hậu ấm áp tạo điều kiện cho nhiều loại cây nhiệt đới phát triển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look like one of your parents or older relations",
                    "vi": "trông giống như một trong những người có quan hệ cha mẹ hoặc lớn tuổi của bạn"
                },
                "examples": [
                    {
                        "en": "She definitely favours her father.",
                        "vi": "Cô ấy chắc chắn ủng hộ cha mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be expected to achieve something, especially in a competition",
                    "vi": "được mong đợi để đạt được điều gì đó, đặc biệt là trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "He is favoured to win a third Olympic gold medal.",
                        "vi": "Anh được ưu ái giành huy chương vàng Olympic thứ ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e8c6f76656c42d8abff166c5ea62acd",
        "word": "preference",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈprefrəns/",
            "us": "/ˈprefrəns/"
        },
        "nearby": [
            {
                "word": "preferable",
                "pos": "adjective"
            },
            {
                "word": "preferably",
                "pos": "adverb"
            },
            {
                "word": "preference",
                "pos": "noun"
            },
            {
                "word": "preferential",
                "pos": "adjective"
            },
            {
                "word": "preferentially",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a greater interest in or desire for somebody/something than somebody/something else",
                    "vi": "mối quan tâm hoặc mong muốn lớn hơn đối với ai đó / điều gì đó hơn ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "It's a matter of personal preference.",
                        "vi": "Đó là một vấn đề của sở thích cá nhân."
                    },
                    {
                        "en": "I can't say that I have any particular preference.",
                        "vi": "Tôi không thể nói rằng tôi có bất kỳ sở thích cụ thể nào."
                    },
                    {
                        "en": "preference for somebody/something Many people expressed a strong preference for the original plan.",
                        "vi": "ưa thích ai đó / cái gì đó Nhiều người bày tỏ sự ưa thích mạnh mẽ đối với kế hoạch ban đầu."
                    },
                    {
                        "en": "Let's make a list of possible speakers, in order of preference.",
                        "vi": "Hãy lập danh sách các diễn giả có thể có, theo thứ tự ưu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is liked better or best",
                    "vi": "một thứ được yêu thích hơn hoặc tốt nhất"
                },
                "examples": [
                    {
                        "en": "a study of consumer preferences",
                        "vi": "một nghiên cứu về sở thích của người tiêu dùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody/something in a way that gives them an advantage over other people or things",
                    "vi": "đối xử với ai đó / điều gì đó theo cách mang lại lợi thế cho họ so với những người hoặc vật khác"
                },
                "examples": [
                    {
                        "en": "Preference will be given to graduates of this university.",
                        "vi": "Ưu tiên cho sinh viên tốt nghiệp trường đại học này."
                    }
                ]
            },
            {
                "define": {
                    "en": "rather than somebody/something",
                    "vi": "chứ không phải ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was chosen in preference to her sister.",
                        "vi": "Cô ấy được chọn vì em gái của cô ấy."
                    },
                    {
                        "en": "They bought French planes in preference to British ones.",
                        "vi": "Họ mua máy bay của Pháp thay vì máy bay của Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "3eef837d78fb422794599cae30ab51ba",
        "word": "would rather… (than)",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrɑːðə(r)/",
            "us": "/ˈræðər/"
        },
        "nearby": [
            {
                "word": "the rates",
                "pos": "noun"
            },
            {
                "word": "rath",
                "pos": "noun"
            },
            {
                "word": "rather",
                "pos": "adverb"
            },
            {
                "word": "rather",
                "pos": "exclamation"
            },
            {
                "word": "ratification",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to mean ‘fairly’ or ‘to some degree’, often when you are disappointed, surprised or expressing slight criticism",
                    "vi": "được sử dụng để có nghĩa là \"khá\" hoặc \"ở một mức độ nào đó\", thường là khi bạn thất vọng, ngạc nhiên hoặc thể hiện sự chỉ trích nhẹ"
                },
                "examples": [
                    {
                        "en": "rather odd/strange/unusual",
                        "vi": "khá kỳ quặc / kỳ lạ / bất thường"
                    },
                    {
                        "en": "a rather large sum of money",
                        "vi": "một khoản tiền khá lớn"
                    },
                    {
                        "en": "A rather small number of people turned up.",
                        "vi": "Một số lượng khá nhỏ người đã đến tham gia."
                    },
                    {
                        "en": "They took a rather different approach.",
                        "vi": "Họ đã có một cách tiếp cận khá khác."
                    },
                    {
                        "en": "I thought it was a rather good idea.",
                        "vi": "Tôi nghĩ đó là một ý kiến khá hay."
                    },
                    {
                        "en": "The instructions were rather complicated.",
                        "vi": "Các hướng dẫn khá phức tạp."
                    },
                    {
                        "en": "She fell and hurt her leg rather badly.",
                        "vi": "Cô bị ngã và bị thương ở chân khá nặng."
                    },
                    {
                        "en": "I didn't fail the exam; in fact I did rather well!",
                        "vi": "Tôi đã không thi trượt; trong thực tế, tôi đã làm khá tốt!"
                    },
                    {
                        "en": "It was a rather difficult question.",
                        "vi": "Đó là một câu hỏi khá khó."
                    },
                    {
                        "en": "It was rather a difficult question.",
                        "vi": "Đó là một câu hỏi khó."
                    },
                    {
                        "en": "He looks rather like his father.",
                        "vi": "Anh ấy trông khá giống bố của mình."
                    },
                    {
                        "en": "The patient has responded to the treatment rather better than expected.",
                        "vi": "Bệnh nhân đã đáp ứng điều trị tốt hơn mong đợi."
                    },
                    {
                        "en": "He was conscious that he was talking rather too much.",
                        "vi": "Anh ý thức được rằng mình đã nói khá nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a verb to make a statement sound less strong",
                    "vi": "được sử dụng với một động từ để làm cho một tuyên bố nghe có vẻ ít mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "I've always rather liked Charlie.",
                        "vi": "Tôi luôn thích Charlie."
                    },
                    {
                        "en": "I rather suspect we're making a mistake.",
                        "vi": "Tôi nghi ngờ chúng ta đang mắc sai lầm."
                    },
                    {
                        "en": "We were rather hoping you'd be able to do it by Friday.",
                        "vi": "Chúng tôi đã hy vọng bạn có thể làm điều đó vào thứ Sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to correct something you have said, or to give more accurate information",
                    "vi": "được sử dụng để sửa điều gì đó bạn đã nói hoặc để cung cấp thông tin chính xác hơn"
                },
                "examples": [
                    {
                        "en": "She worked as a secretary, or rather, a personal assistant.",
                        "vi": "Cô ấy làm thư ký, hay nói đúng hơn là trợ lý riêng."
                    },
                    {
                        "en": "In the end he had to walk—or rather run—to the office.",
                        "vi": "Cuối cùng thì anh ta phải đi bộ — hay đúng hơn là chạy — đến văn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an idea that is different or opposite to the idea that you have stated previously",
                    "vi": "được sử dụng để giới thiệu một ý tưởng khác hoặc đối lập với ý tưởng mà bạn đã nêu trước đây"
                },
                "examples": [
                    {
                        "en": "The walls were not white, but rather a sort of dirty grey.",
                        "vi": "Các bức tường không phải là màu trắng, mà là một loại màu xám bẩn."
                    },
                    {
                        "en": "The problem is not in the whole system, but rather in one small part.",
                        "vi": "Vấn đề không nằm ở toàn bộ hệ thống, mà là ở một phần nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "instead of somebody/something",
                    "vi": "thay vì ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I think I'll have a cold drink rather than coffee.",
                        "vi": "Tôi nghĩ tôi sẽ uống một ly lạnh hơn là uống cà phê."
                    },
                    {
                        "en": "Why didn't you ask for help, rather than trying to do it on your own?",
                        "vi": "Tại sao bạn không yêu cầu sự giúp đỡ, thay vì cố gắng làm điều đó một mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that you would not like to do something that another person is going to do",
                    "vi": "được sử dụng để nói rằng bạn không muốn làm điều gì đó mà người khác sẽ làm"
                },
                "examples": [
                    {
                        "en": "‘I'm going climbing tomorrow.’ ‘Rather you than me!’",
                        "vi": "Ngày mai tôi sẽ leo núi.' 'Có lẽ bạn tốt hơn tôi!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "would prefer to",
                    "vi": "Thích"
                },
                "examples": [
                    {
                        "en": "She'd rather die than give a speech.",
                        "vi": "Cô ấy thà chết chứ không muốn diễn thuyết."
                    },
                    {
                        "en": "‘Do you want to come with us?’ ‘No, I'd rather not.’",
                        "vi": "Bạn có muốn đi cùng với chúng tôi không?' 'Không, tôi không muốn.'"
                    },
                    {
                        "en": "Would you rather walk or take the bus?",
                        "vi": "Bạn muốn đi bộ hay đi xe buýt?"
                    },
                    {
                        "en": "‘Do you mind if I smoke?’ ‘Well, I'd rather you didn't.’",
                        "vi": "Bạn có phiền nếu tôi hút thuốc?' 'Chà, tôi thà là bạn không làm.'"
                    },
                    {
                        "en": "Personally, I'd rather see the money and resources going into education.",
                        "vi": "Cá nhân tôi, tôi muốn thấy tiền và tài nguyên đi vào giáo dục."
                    },
                    {
                        "en": "I'd rather have a simple product that actually works than something fancy that's just not reliable.",
                        "vi": "Tôi thà có một sản phẩm đơn giản nhưng thực sự hoạt động hơn là một thứ gì đó lạ mắt mà không đáng tin cậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "665778241f5e4a35815402823fbd3b9f",
        "word": "inclined",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈklaɪnd/",
            "us": "/ɪnˈklaɪnd/"
        },
        "nearby": [
            {
                "word": "incline",
                "pos": "verb"
            },
            {
                "word": "incline",
                "pos": "noun"
            },
            {
                "word": "inclined",
                "pos": "adjective"
            },
            {
                "word": "include",
                "pos": "verb"
            },
            {
                "word": "included",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wanting to do something",
                    "vi": "muốn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She was inclined to trust him.",
                        "vi": "Cô có khuynh hướng tin tưởng anh."
                    },
                    {
                        "en": "He writes only when he feels inclined to.",
                        "vi": "Anh ấy chỉ viết khi anh ấy cảm thấy có khuynh hướng."
                    },
                    {
                        "en": "There'll be time for a swim if you feel so inclined.",
                        "vi": "Sẽ có thời gian để bơi nếu bạn cảm thấy thích thú."
                    }
                ]
            },
            {
                "define": {
                    "en": "tending to do something; likely to do something",
                    "vi": "có xu hướng làm điều gì đó; có khả năng làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's inclined to be lazy.",
                        "vi": "Anh ấy có khuynh hướng lười biếng."
                    },
                    {
                        "en": "They'll be more inclined to listen if you don't shout.",
                        "vi": "Họ sẽ có xu hướng lắng nghe hơn nếu bạn không hét lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are expressing an opinion but do not want to express it very strongly",
                    "vi": "được sử dụng khi bạn đang bày tỏ một ý kiến nhưng không muốn thể hiện nó một cách mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "I'm inclined to agree with you.",
                        "vi": "Tôi có khuynh hướng đồng ý với bạn."
                    },
                    {
                        "en": "I'm half inclined to believe him.",
                        "vi": "Tôi nửa tin nửa ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a natural ability for something; preferring to do something",
                    "vi": "có khả năng thiên bẩm về một thứ gì đó; thích làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "musically/academically inclined children",
                        "vi": "trẻ em thiên về âm nhạc / học thuật"
                    }
                ]
            },
            {
                "define": {
                    "en": "sloping; at an angle",
                    "vi": "nghiêng; ở một góc độ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8091513cbf034a858d93c1cab6d39945",
        "word": "preferable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprefrəbl/",
            "us": "/ˈprefrəbl/"
        },
        "nearby": [
            {
                "word": "prefecture",
                "pos": "noun"
            },
            {
                "word": "prefer",
                "pos": "verb"
            },
            {
                "word": "preferable",
                "pos": "adjective"
            },
            {
                "word": "preferably",
                "pos": "adverb"
            },
            {
                "word": "preference",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "more attractive or more suitable; to be preferred to something",
                    "vi": "hấp dẫn hơn hoặc phù hợp hơn; được ưa thích hơn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "preferable (to something) Anything was preferable to the tense atmosphere at home.",
                        "vi": "thích hơn (đối với một cái gì đó) Bất cứ điều gì được thích hơn cho bầu không khí căng thẳng ở nhà."
                    },
                    {
                        "en": "preferable (to doing something) He finds country life infinitely preferable to living in the city.",
                        "vi": "thích hơn (để làm điều gì đó) Anh ấy thấy cuộc sống nông thôn thích hơn vô cùng so với sống ở thành phố."
                    },
                    {
                        "en": "preferable (to do something) It would be preferable to employ two people, not one.",
                        "vi": "thích hợp hơn (làm điều gì đó) Sẽ tốt hơn nếu sử dụng hai người, không phải một."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed07d7ba2b424119bd2fc093887793f9",
        "word": "preferably",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprefrəbli/",
            "us": "/ˈprefrəbli/"
        },
        "nearby": [
            {
                "word": "prefer",
                "pos": "verb"
            },
            {
                "word": "preferable",
                "pos": "adjective"
            },
            {
                "word": "preferably",
                "pos": "adverb"
            },
            {
                "word": "preference",
                "pos": "noun"
            },
            {
                "word": "preferential",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is more attractive or more suitable; in a way that is preferred to other ways",
                    "vi": "theo cách hấp dẫn hơn hoặc phù hợp hơn; theo cách được ưu tiên hơn những cách khác"
                },
                "examples": [
                    {
                        "en": "We're looking for a new house, preferably one near the school.",
                        "vi": "Chúng tôi đang tìm một ngôi nhà mới, tốt nhất là một ngôi nhà gần trường học."
                    }
                ]
            }
        ]
    },
    {
        "id": "b3d0e17faec040849a9e5294ff47fedf",
        "word": "favoured",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfeɪvəd/",
            "us": "/ˈfeɪvərd/"
        },
        "nearby": [
            {
                "word": "favourable",
                "pos": "adjective"
            },
            {
                "word": "favourably",
                "pos": "adverb"
            },
            {
                "word": "favoured",
                "pos": "adjective"
            },
            {
                "word": "favourite",
                "pos": "verb"
            },
            {
                "word": "favourite",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "treated in a special way or receiving special help or advantages in a way that may seem unfair",
                    "vi": "được đối xử theo cách đặc biệt hoặc nhận được sự trợ giúp hoặc lợi thế đặc biệt theo cách có vẻ không công bằng"
                },
                "examples": [
                    {
                        "en": "a member of the President’s favoured circle of advisers",
                        "vi": "một thành viên trong nhóm cố vấn được yêu thích của Tổng thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "preferred by most people",
                    "vi": "được hầu hết mọi người ưa thích"
                },
                "examples": [
                    {
                        "en": "the favoured candidate",
                        "vi": "ứng cử viên được ưu ái"
                    }
                ]
            },
            {
                "define": {
                    "en": "particularly pleasant and worth having",
                    "vi": "đặc biệt dễ chịu và đáng có"
                },
                "examples": [
                    {
                        "en": "Their house is in a very favoured position near the park.",
                        "vi": "Ngôi nhà của họ ở một vị trí rất đắc địa, gần công viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "2aa5d2c7dd4f47dc82926b3806f0f596",
        "word": "give me something/somebody (any day/time)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɪv/",
            "us": "/ɡɪv/"
        },
        "nearby": [
            {
                "word": "git",
                "pos": "noun"
            },
            {
                "word": "githeri",
                "pos": "noun"
            },
            {
                "word": "give",
                "pos": "verb"
            },
            {
                "word": "give",
                "pos": "noun"
            },
            {
                "word": "give away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hand something to somebody so that they can look at it, use it or keep it for a time",
                    "vi": "giao một cái gì đó cho ai đó để họ có thể nhìn vào nó, sử dụng nó hoặc giữ nó trong một thời gian"
                },
                "examples": [
                    {
                        "en": "give something to somebody Give the letter to your mother when you've read it.",
                        "vi": "tặng một cái gì đó cho ai đó Đưa bức thư cho mẹ của bạn khi bạn đã đọc nó."
                    },
                    {
                        "en": "She gave her ticket to the woman at the check-in desk.",
                        "vi": "Cô đưa vé của mình cho người phụ nữ ở quầy làm thủ tục."
                    },
                    {
                        "en": "give somebody something Give your mother the letter.",
                        "vi": "cho ai đó một cái gì đó Đưa cho mẹ của bạn lá thư."
                    },
                    {
                        "en": "They were all given a box to carry.",
                        "vi": "Tất cả họ đều được phát một chiếc hộp để mang theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hand something to somebody as a present; to allow somebody to have something as a present",
                    "vi": "để trao một cái gì đó cho ai đó như một món quà; để cho phép ai đó có một cái gì đó như một món quà"
                },
                "examples": [
                    {
                        "en": "give somebody something What are you giving your father for his birthday?",
                        "vi": "tặng ai đó cái gì Bạn đang tặng gì cho bố của bạn vào ngày sinh nhật của ông ấy?"
                    },
                    {
                        "en": "She was given a huge bunch of flowers.",
                        "vi": "Cô ấy được tặng một bó hoa rất lớn."
                    },
                    {
                        "en": "Did you give the waiter a tip?",
                        "vi": "Bạn đã cho người phục vụ một tiền boa chưa?"
                    },
                    {
                        "en": "give something to somebody She gave a couple of pounds to the beggar.",
                        "vi": "đưa một cái gì đó cho ai đó Cô ấy đã đưa cho người ăn mày một vài pound."
                    },
                    {
                        "en": "give (something) We all agreed not to give presents this year.",
                        "vi": "tặng (cái gì đó) Tất cả chúng tôi đều đồng ý không tặng quà trong năm nay."
                    },
                    {
                        "en": "They say it's better to give than to receive.",
                        "vi": "Họ nói rằng tốt hơn là cho đi hơn là nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide somebody with something",
                    "vi": "cung cấp cho ai đó một cái gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something They were all thirsty so I gave them a drink.",
                        "vi": "cho ai đó thứ gì đó Họ đều khát nên tôi cho họ uống."
                    },
                    {
                        "en": "Give me your name and address.",
                        "vi": "Cho tôi tên và địa chỉ của bạn."
                    },
                    {
                        "en": "We've been given a 2 per cent pay increase.",
                        "vi": "Chúng tôi đã được tăng lương 2%."
                    },
                    {
                        "en": "I was hoping you would give me a job.",
                        "vi": "Tôi đã hy vọng bạn sẽ cho tôi một công việc."
                    },
                    {
                        "en": "He was given a new heart in a five-hour operation.",
                        "vi": "Anh ấy đã được trao một trái tim mới trong một ca phẫu thuật kéo dài 5 giờ đồng hồ."
                    },
                    {
                        "en": "Give me some time to decide.",
                        "vi": "Hãy cho tôi một thời gian để quyết định."
                    },
                    {
                        "en": "We should at least give him the opportunity to explain why he did this.",
                        "vi": "Ít nhất chúng ta nên cho anh ta cơ hội để giải thích lý do tại sao anh ta làm điều này."
                    },
                    {
                        "en": "This should give you some idea of the extent of the problem.",
                        "vi": "Điều này sẽ cung cấp cho bạn một số ý tưởng về mức độ của vấn đề."
                    },
                    {
                        "en": "Can you give us some sense of exactly what is at stake here?",
                        "vi": "Bạn có thể cho chúng tôi biết chính xác những gì đang bị đe dọa ở đây không?"
                    },
                    {
                        "en": "We'll give you all the help we can.",
                        "vi": "Chúng tôi sẽ cung cấp cho bạn tất cả sự giúp đỡ mà chúng tôi có thể."
                    },
                    {
                        "en": "She wants a job that gives her more responsibility.",
                        "vi": "Cô ấy muốn một công việc mang lại cho cô ấy nhiều trách nhiệm hơn."
                    },
                    {
                        "en": "Can I give you a ride to the station?",
                        "vi": "Tôi có thể cho bạn một chuyến xe đến nhà ga?"
                    },
                    {
                        "en": "I'll give you (= allow you to have) ten minutes to prepare your answer.",
                        "vi": "Tôi sẽ cho bạn (= cho phép bạn có) mười phút để chuẩn bị câu trả lời của bạn."
                    },
                    {
                        "en": "Don't give me any of that backchat (= don't be rude).",
                        "vi": "Đừng đưa cho tôi bất kỳ backchat đó (= đừng thô lỗ)."
                    },
                    {
                        "en": "give something to somebody He gives Italian lessons to his colleagues.",
                        "vi": "trao một cái gì đó cho ai đó Anh ấy đưa ra những bài học tiếng Ý cho đồng nghiệp của mình."
                    },
                    {
                        "en": "The reforms should give a better chance to the less able children.",
                        "vi": "Các cải cách nên tạo cơ hội tốt hơn cho những trẻ em kém khả năng hơn."
                    },
                    {
                        "en": "give something She gave some helpful advice.",
                        "vi": "đưa ra điều gì đó Cô ấy đã đưa ra một số lời khuyên hữu ích."
                    },
                    {
                        "en": "She gives the impression of being very busy.",
                        "vi": "Cô ấy tạo ấn tượng là rất bận rộn."
                    },
                    {
                        "en": "I was asked to give evidence at the trial.",
                        "vi": "Tôi được yêu cầu đưa ra bằng chứng tại phiên tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money to a charity, etc., to help people",
                    "vi": "để trả tiền cho một tổ chức từ thiện, v.v., để giúp đỡ mọi người"
                },
                "examples": [
                    {
                        "en": "We need your help—please give generously.",
                        "vi": "Chúng tôi cần sự giúp đỡ của bạn — vui lòng rộng lượng."
                    },
                    {
                        "en": "give to something They both gave regularly to charity.",
                        "vi": "cho một cái gì đó Cả hai đều thường xuyên cho từ thiện."
                    },
                    {
                        "en": "give something I gave a small donation.",
                        "vi": "cho một cái gì đó tôi đã cho một khoản đóng góp nhỏ."
                    },
                    {
                        "en": "give something to something A lot of people give money to good causes.",
                        "vi": "cho một cái gì đó cho một cái gì đó Rất nhiều người cho tiền vì những mục đích tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay in order to have or do something",
                    "vi": "trả tiền để có hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something I'll give you £100 and not a penny more!",
                        "vi": "cho ai đó thứ gì đó, tôi sẽ cho bạn £ 100 và không thêm một xu nào!"
                    },
                    {
                        "en": "give somebody something for something How much will you give me for the car?",
                        "vi": "cho ai đó cái gì đó cho cái gì Bạn sẽ cho tôi bao nhiêu tiền cho chiếc xe?"
                    },
                    {
                        "en": "give something I'd give anything to see him again.",
                        "vi": "cho một cái gì đó Tôi sẽ cho bất cứ điều gì để gặp lại anh ta."
                    },
                    {
                        "en": "give something for something I gave £50 for the lot.",
                        "vi": "cho một cái gì đó cho một cái gì đó Tôi đã trả £ 50 cho rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a noun to describe a particular action, giving the same meaning as the related verb",
                    "vi": "Được sử dụng với một danh từ để mô tả một hành động cụ thể, mang lại ý nghĩa tương tự như động từ liên quan"
                },
                "examples": [
                    {
                        "en": "give something She gave a shrug of her shoulders (= shrugged).",
                        "vi": "đưa ra một cái gì đó Cô ấy đã cho một cái nhún vai của cô ấy (= nhún vai)."
                    },
                    {
                        "en": "He turned to us and gave a big smile (= smiled broadly).",
                        "vi": "Anh ấy quay sang chúng tôi và nở một nụ cười thật tươi (= cười thật tươi)."
                    },
                    {
                        "en": "She looked up from her work and gave a yawn (= yawned).",
                        "vi": "Cô ấy ngước lên khỏi chỗ làm của mình và ngáp một cái (= ngáp dài)."
                    },
                    {
                        "en": "He gave a loud cry (= cried out loudly) and fell to the floor.",
                        "vi": "Anh ta hét lên một tiếng (= khóc không thành tiếng) và ngã xuống sàn."
                    },
                    {
                        "en": "Her work has given pleasure to (= pleased) millions of readers.",
                        "vi": "Tác phẩm của cô ấy đã mang lại niềm vui cho (= làm hài lòng) hàng triệu độc giả."
                    },
                    {
                        "en": "give somebody something He gave her a kiss (= kissed her).",
                        "vi": "cho ai đó thứ gì đó. Anh ấy đã cho cô ấy một nụ hôn (= đã hôn cô ấy)."
                    },
                    {
                        "en": "I have to admit that the news gave us a shock (= shocked us).",
                        "vi": "Tôi phải thừa nhận rằng tin tức đã gây cho chúng tôi một cú sốc (= khiến chúng tôi bị sốc)."
                    },
                    {
                        "en": "He gave me a suspicious look (= looked at me suspiciously).",
                        "vi": "Anh ta đưa cho tôi một cái nhìn nghi ngờ (= nhìn tôi nghi ngờ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a particular feeling in somebody",
                    "vi": "để tạo ra một cảm giác cụ thể ở ai đó"
                },
                "examples": [
                    {
                        "en": "All that driving has given me a headache.",
                        "vi": "Tất cả những gì lái xe đã làm cho tôi đau đầu."
                    },
                    {
                        "en": "Go for a walk. It'll give you an appetite.",
                        "vi": "Đi dạo. Nó sẽ mang lại cho bạn cảm giác ngon miệng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a phone call to somebody",
                    "vi": "gọi điện thoại cho ai đó"
                },
                "examples": [
                    {
                        "en": "Give me a call tomorrow.",
                        "vi": "Hãy gọi cho tôi vào ngày mai."
                    },
                    {
                        "en": "(British English) I'll give you a ring.",
                        "vi": "(Anh Anh) Tôi sẽ đưa cho bạn một chiếc nhẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to judge somebody/something to be of a particular standard",
                    "vi": "đánh giá ai đó / cái gì đó theo một tiêu chuẩn cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth She had given the assignment an A.",
                        "vi": "đưa cho ai đó / cái gì đó sth Cô ấy đã cho bài tập là A."
                    },
                    {
                        "en": "I give it ten out of ten for originality.",
                        "vi": "Tôi cho nó mười trên mười cho sự độc đáo."
                    },
                    {
                        "en": "give something He virtually never gives a grade of less than C.",
                        "vi": "đưa ra thứ gì đó Anh ấy hầu như không bao giờ cho điểm dưới C."
                    },
                    {
                        "en": "give something to somebody/something I gave top marks to her essay.",
                        "vi": "tặng một cái gì đó cho ai đó / cái gì đó mà tôi đã cho điểm cao nhất cho bài luận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass an illness onto somebody and make them ill",
                    "vi": "truyền bệnh cho ai đó và làm cho họ bị ốm"
                },
                "examples": [
                    {
                        "en": "give somebody something You've given me your cold.",
                        "vi": "cho ai đó một cái gì đó Bạn đã cho tôi cảm lạnh của bạn."
                    },
                    {
                        "en": "give something to somebody She'd given the bug to all her colleagues.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã đưa lỗi cho tất cả các đồng nghiệp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody suffer a particular punishment",
                    "vi": "để khiến ai đó phải chịu một hình phạt cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody something The judge gave him a nine-month suspended sentence.",
                        "vi": "cho ai đó thứ gì đó. Thẩm phán cho anh ta 9 tháng tù treo."
                    },
                    {
                        "en": "give something to somebody We discussed what punishment should be given to the boys.",
                        "vi": "đưa một cái gì đó cho ai đó Chúng tôi đã thảo luận về hình phạt nào nên được đưa ra cho các cậu bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you give a party, you organize it and invite people",
                    "vi": "nếu bạn tổ chức một bữa tiệc, bạn tổ chức nó và mời mọi người"
                },
                "examples": [
                    {
                        "en": "We're giving a party to celebrate our silver wedding.",
                        "vi": "Chúng tôi đang tổ chức một bữa tiệc để kỷ niệm đám cưới bạc của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform something in public",
                    "vi": "để biểu diễn một cái gì đó trước công chúng"
                },
                "examples": [
                    {
                        "en": "give something He gave a rousing performance of the Bob Marley song.",
                        "vi": "đưa ra thứ gì đó Anh ấy đã trình diễn bài hát của Bob Marley một cách sôi động."
                    },
                    {
                        "en": "She gave a reading from her latest volume of poetry.",
                        "vi": "Cô ấy đã đọc tập thơ mới nhất của mình."
                    },
                    {
                        "en": "The President will be giving a press conference this afternoon.",
                        "vi": "Tổng thống sẽ có một cuộc họp báo vào chiều nay."
                    },
                    {
                        "en": "give something to somebody She gave a fine speech to the waiting crowd.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã có một bài phát biểu hay trước đám đông đang chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use time, energy, etc. for somebody/something",
                    "vi": "để sử dụng thời gian, năng lượng, v.v. cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth I gave the matter a lot of thought.",
                        "vi": "cho ai đó / cái gì đó tôi đã suy nghĩ rất nhiều vấn đề."
                    },
                    {
                        "en": "give something to somebody/something I gave a lot of thought to the matter.",
                        "vi": "đưa cái gì đó cho ai đó / cái gì đó mà tôi đã suy nghĩ rất nhiều về vấn đề."
                    },
                    {
                        "en": "The government has given top priority to reforming the tax system.",
                        "vi": "Chính phủ đã dành ưu tiên hàng đầu cho việc cải cách hệ thống thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to predict that something will last a particular length of time",
                    "vi": "để dự đoán rằng điều gì đó sẽ tồn tại trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "That marriage won't last. I'll give them two years at the outside.",
                        "vi": "Cuộc hôn nhân đó sẽ không kéo dài. Tôi sẽ cho họ hai năm ở bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that a player or the ball is in a particular position or that a goal has been scored",
                    "vi": "để nói rằng một cầu thủ hoặc quả bóng đang ở một vị trí cụ thể hoặc một bàn thắng đã được ghi"
                },
                "examples": [
                    {
                        "en": "give somebody/something + adj. The umpire gave the ball out.",
                        "vi": "cho ai đó / cái gì đó + adj. Trọng tài chính đưa bóng ra ngoài."
                    },
                    {
                        "en": "give something The ref gave the goal.",
                        "vi": "đưa ra một cái gì đó Người giới thiệu đã đưa ra mục tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bend or stretch under pressure",
                    "vi": "uốn cong hoặc kéo dài dưới áp lực"
                },
                "examples": [
                    {
                        "en": "The branch began to give under his weight.",
                        "vi": "Cành bắt đầu cho dưới sức nặng của anh ta."
                    },
                    {
                        "en": "(figurative) We can't go on like this—something's got to give.",
                        "vi": "(nghĩa bóng) Chúng ta không thể tiếp tục như thế này - phải cho đi một cái gì đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to change your mind or give up some of your demands",
                    "vi": "đồng ý thay đổi ý định hoặc từ bỏ một số yêu cầu của bạn"
                },
                "examples": [
                    {
                        "en": "You're going to have to give a little.",
                        "vi": "Bạn sẽ phải cho một ít."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you do not accept what they say",
                    "vi": "từng nói với ai đó rằng bạn không chấp nhận những gì họ nói"
                },
                "examples": [
                    {
                        "en": "‘I didn't have time to do it.’ ‘Oh, don't give me that!’",
                        "vi": "Tôi không có thời gian để làm việc đó.' 'Ồ, đừng đưa tôi cái đó!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing, in a relationship, to accept what somebody else wants and to give up some of what you want",
                    "vi": "sẵn sàng, trong một mối quan hệ, chấp nhận những gì người khác muốn và từ bỏ một số điều bạn muốn"
                },
                "examples": [
                    {
                        "en": "You're going to have to learn to give and take.",
                        "vi": "Bạn sẽ phải học cách cho và nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react with equal force when somebody attacks or criticizes you",
                    "vi": "phản ứng với lực lượng ngang nhau khi ai đó tấn công hoặc chỉ trích bạn"
                },
                "examples": [
                    {
                        "en": "She can give as good as she gets.",
                        "vi": "Cô ấy có thể cho càng nhiều càng tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show your approval of somebody by clapping your hands",
                    "vi": "để thể hiện sự tán thành của bạn đối với ai đó bằng cách vỗ tay của bạn"
                },
                "examples": [
                    {
                        "en": "Give it up for Ed Sheeran!",
                        "vi": "Hãy từ bỏ nó cho Ed Sheeran!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you prefer a particular thing or person to the one that has just been mentioned",
                    "vi": "được sử dụng để nói rằng bạn thích một điều hoặc một người cụ thể hơn một điều vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "We don't go out much. Give me a quiet night in front of the TV any day!",
                        "vi": "Chúng tôi không đi chơi nhiều. Cho tôi một đêm yên tĩnh trước TV bất cứ ngày nào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is correct give or take a particular amount, it is approximately correct",
                    "vi": "nếu một cái gì đó là chính xác cho hoặc lấy một số lượng cụ thể, nó là gần đúng"
                },
                "examples": [
                    {
                        "en": "It'll take about three weeks, give or take a day or so.",
                        "vi": "Sẽ mất khoảng ba tuần, cho hoặc lâu hơn một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody believe/understand something",
                    "vi": "để làm cho ai đó tin / hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was given to understand that she had resigned.",
                        "vi": "Tôi được cho để hiểu rằng cô ấy đã từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to severely punish or criticize somebody for doing something wrong",
                    "vi": "trừng phạt nghiêm khắc hoặc chỉ trích ai đó đã làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "My son was rude to my friends so I gave him what for.",
                        "vi": "Con trai tôi vô lễ với bạn bè của tôi vì vậy tôi đã cho nó để làm gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask people to drink a toast to somebody",
                    "vi": "từng yêu cầu mọi người uống bánh mì nướng với ai đó"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, I give you Geoff Ogilby!",
                        "vi": "Thưa quý vị, tôi tặng quý vị Geoff Ogilby!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are admitting that something is true",
                    "vi": "được sử dụng khi bạn thừa nhận rằng điều gì đó là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what is happening?; what is the news?",
                    "vi": "chuyện gì đang xảy ra vậy ?; tin tức là gì?"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34094666005a45f4838e5a4981b2f4ba",
        "word": "go for",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "go-faster stripes",
                "pos": "noun"
            },
            {
                "word": "gofer",
                "pos": "noun"
            },
            {
                "word": "go for",
                "pos": "phrasal verb"
            },
            {
                "word": "go forward",
                "pos": "phrasal verb"
            },
            {
                "word": "go-getter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to attack somebody",
                    "vi": "tấn công ai đó"
                },
                "examples": [
                    {
                        "en": "She went for him with a knife.",
                        "vi": "Cô ấy đã dùng một con dao cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to apply to somebody/something",
                    "vi": "để áp dụng cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "What I said about Peter goes for you, too.",
                        "vi": "Những gì tôi nói về Peter cũng dành cho bạn."
                    },
                    {
                        "en": "They have a high level of unemployment—but the same goes for many other countries.",
                        "vi": "Họ có tỷ lệ thất nghiệp cao - nhưng điều tương tự cũng xảy ra đối với nhiều quốc gia khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a place and bring somebody/something back",
                    "vi": "đi đến một nơi và mang ai đó / cái gì đó trở lại"
                },
                "examples": [
                    {
                        "en": "She's gone for some milk.",
                        "vi": "Cô ấy đi cho một ít sữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be attracted by somebody/something; to like or prefer somebody/something",
                    "vi": "bị thu hút bởi ai đó / cái gì đó; thích hoặc thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She goes for tall slim men.",
                        "vi": "Cô ấy thích những người đàn ông cao gầy."
                    },
                    {
                        "en": "I don't really go for modern art.",
                        "vi": "Tôi không thực sự đi theo nghệ thuật hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose something",
                    "vi": "để chọn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I think I'll go for the fruit salad.",
                        "vi": "Tôi nghĩ tôi sẽ đi ăn salad trái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to apply for a job",
                    "vi": "đăng kí việc làm, xin việc"
                },
                "examples": [
                    {
                        "en": "I'm going for a job in sales.",
                        "vi": "Tôi đang đi làm công việc bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a lot of effort into something, so that you get or achieve something",
                    "vi": "nỗ lực rất nhiều vào điều gì đó để bạn đạt được hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "Go for it, John! You know you can beat him.",
                        "vi": "Cố gắng lên, John! Bạn biết bạn có thể đánh bại anh ta."
                    },
                    {
                        "en": "It sounds a great idea. Go for it!",
                        "vi": "Nghe có vẻ là một ý tưởng tuyệt vời. Cứ liều thử đi!"
                    }
                ]
            }
        ]
    },
    {
        "id": "2a550ed7ecc94f199f5838138740fc7e",
        "word": "I, etc. would sooner do something (than something else)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/suːn/",
            "us": "/suːn/"
        },
        "nearby": [
            {
                "word": "Susan Sontag",
                "pos": ""
            },
            {
                "word": "sook",
                "pos": "noun"
            },
            {
                "word": "soon",
                "pos": "adverb"
            },
            {
                "word": "soot",
                "pos": "noun"
            },
            {
                "word": "soothe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a short time from now; a short time after something else has happened",
                    "vi": "trong một thời gian ngắn kể từ bây giờ; một thời gian ngắn sau khi chuyện khác đã xảy ra"
                },
                "examples": [
                    {
                        "en": "She sold the house soon after her husband died.",
                        "vi": "Cô đã bán nhà ngay sau khi chồng mất."
                    },
                    {
                        "en": "Soon afterwards, he joined a youth theatre group.",
                        "vi": "Ngay sau đó, anh tham gia một nhóm kịch dành cho giới trẻ."
                    },
                    {
                        "en": "I'd love to meet up again sometime soon.",
                        "vi": "Tôi rất muốn gặp lại vào một lúc nào đó sớm."
                    },
                    {
                        "en": "I soon realized the mistake.",
                        "vi": "Tôi sớm nhận ra sai lầm."
                    },
                    {
                        "en": "See you soon!",
                        "vi": "Hẹn sớm gặp lại!"
                    },
                    {
                        "en": "More success soon followed.",
                        "vi": "Nhiều thành công ngay sau đó."
                    },
                    {
                        "en": "We’ll be home soon./We’ll soon be home.",
                        "vi": "We will be home soon./Chúng tôi sẽ sớm về nhà."
                    },
                    {
                        "en": "I'll be back soon.",
                        "vi": "Tôi sẽ trở lại sớm."
                    },
                    {
                        "en": "It soon became clear that the programme was a failure.",
                        "vi": "Rõ ràng là chương trình đã thất bại."
                    },
                    {
                        "en": "He promises to visit again soon.",
                        "vi": "Anh ấy hứa sẽ sớm đến thăm lại."
                    },
                    {
                        "en": "Coming soon to a cinema/theater near you: 'War of the Wizards II'.",
                        "vi": "Sắp ra rạp / rạp chiếu phim gần bạn: 'War of the Wizards II'."
                    },
                    {
                        "en": "He moved in with a friend and soon found work.",
                        "vi": "Anh ấy dọn đến ở với một người bạn và sớm tìm được việc làm."
                    },
                    {
                        "en": "The two men soon discovered they had much in common.",
                        "vi": "Hai người đàn ông sớm phát hiện ra họ có nhiều điểm chung."
                    },
                    {
                        "en": "The trial is expected to start soon.",
                        "vi": "Phiên tòa dự kiến sẽ sớm bắt đầu."
                    },
                    {
                        "en": "Soon thereafter (= soon after that), she returned to Tanzania.",
                        "vi": "Ngay sau đó (= ngay sau đó), cô trở lại Tanzania."
                    }
                ]
            },
            {
                "define": {
                    "en": "early; quickly",
                    "vi": "sớm; Mau"
                },
                "examples": [
                    {
                        "en": "How soon can you get here?",
                        "vi": "Làm thế nào sớm bạn có thể đến đây?"
                    },
                    {
                        "en": "We'll deliver the goods as soon as we can.",
                        "vi": "Chúng tôi sẽ giao hàng trong thời gian sớm nhất có thể."
                    },
                    {
                        "en": "Please send it as soon as possible.",
                        "vi": "Xin vui lòng gửi nó càng sớm càng tốt."
                    },
                    {
                        "en": "Do you really have to go so soon?",
                        "vi": "Bạn thực sự phải đi sớm như vậy?"
                    },
                    {
                        "en": "It's too soon to say what caused this.",
                        "vi": "Còn quá sớm để nói điều gì đã gây ra điều này."
                    },
                    {
                        "en": "Next Monday is the soonest we can deliver.",
                        "vi": "Thứ Hai tới là ngày chúng tôi có thể giao hàng sớm nhất."
                    },
                    {
                        "en": "The sooner we set off, the sooner we will arrive.",
                        "vi": "Chúng tôi khởi hành càng sớm, chúng tôi sẽ đến càng sớm."
                    },
                    {
                        "en": "All too soon the party was over.",
                        "vi": "Tất cả quá sớm bữa tiệc đã kết thúc."
                    },
                    {
                        "en": "They arrived home sooner than expected.",
                        "vi": "Họ về đến nhà sớm hơn dự kiến."
                    },
                    {
                        "en": "The note said, ‘Call Bill soonest’ (= as soon as possible).",
                        "vi": "Ghi chú cho biết, 'Hãy gọi cho Bill sớm nhất' (= càng sớm càng tốt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in negative sentences and questions to refer to the near future",
                    "vi": "được sử dụng trong câu phủ định và câu hỏi để chỉ tương lai gần"
                },
                "examples": [
                    {
                        "en": "Will she be back anytime soon?",
                        "vi": "Cô ấy sẽ trở lại sớm chứ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would equally well like to do something as do something else that has been suggested",
                    "vi": "từng nói rằng bạn cũng muốn làm điều gì đó như làm điều gì đó khác đã được đề xuất"
                },
                "examples": [
                    {
                        "en": "I'd just as soon stay at home as go out tonight.",
                        "vi": "Tôi sẽ sớm ở nhà và đi chơi tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prefer to do something (than do something else)",
                    "vi": "thích làm điều gì đó hơn (hơn là làm điều gì đó khác)"
                },
                "examples": [
                    {
                        "en": "She'd sooner share a house with other students than live at home with her parents.",
                        "vi": "Cô ấy sớm ở chung nhà với các sinh viên khác hơn là sống ở nhà với bố mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bad situation will pass or be forgotten most quickly if nothing more is said about it",
                    "vi": "một tình huống tồi tệ sẽ trôi qua hoặc bị lãng quên nhanh nhất nếu không có gì thêm về nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something was, or will be, done immediately",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã, hoặc sẽ được thực hiện ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something happens immediately after something else",
                    "vi": "được sử dụng để nói rằng một cái gì đó xảy ra ngay lập tức sau một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "No sooner had she said it than she burst into tears.",
                        "vi": "Chưa kịp nói ra thì cô ấy đã bật khóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "very soon; as soon as possible",
                    "vi": "rất sớm; sớm nhất có thể"
                },
                "examples": [
                    {
                        "en": "‘When shall I tell him?’ ‘The sooner the better.’",
                        "vi": "Khi nào tôi sẽ nói với anh ấy?' 'Càng sớm càng tốt.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "at some time in the future, even if you are not sure exactly when",
                    "vi": "vào một thời điểm nào đó trong tương lai, ngay cả khi bạn không chắc chắn chính xác khi nào"
                },
                "examples": [
                    {
                        "en": "Sooner or later you will have to make a decision.",
                        "vi": "Sớm muộn gì bạn cũng sẽ phải đưa ra quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "after a short time rather than after a long time",
                    "vi": "sau một thời gian ngắn hơn là sau một thời gian dài"
                },
                "examples": [
                    {
                        "en": "We urged them to sort out the problem sooner rather than later.",
                        "vi": "Chúng tôi kêu gọi họ giải quyết vấn đề sớm hơn là muộn hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc73e7e07d69461b9e33d86e28c38e67",
        "word": "leaning",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈliːnɪŋ/",
            "us": "/ˈliːnɪŋ/"
        },
        "nearby": [
            {
                "word": "lean",
                "pos": "adjective"
            },
            {
                "word": "lean",
                "pos": "noun"
            },
            {
                "word": "leaning",
                "pos": "noun"
            },
            {
                "word": "leanness",
                "pos": "noun"
            },
            {
                "word": "lean on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling that makes you tend to prefer something or to believe in particular ideas, opinions, etc.",
                    "vi": "cảm giác khiến bạn có xu hướng thích điều gì đó hơn hoặc tin vào những ý tưởng, quan điểm cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "My leanings have always been towards comedy rather than tragedy.",
                        "vi": "Tôi luôn nghiêng về hài kịch hơn là bi kịch."
                    },
                    {
                        "en": "a person with socialist leanings",
                        "vi": "một người có khuynh hướng xã hội chủ nghĩa"
                    }
                ]
            }
        ]
    },
    {
        "id": "79b1a9366b4c48a4a92772174f761fe4",
        "word": "lean to",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "leanness",
                "pos": "noun"
            },
            {
                "word": "lean on",
                "pos": "phrasal verb"
            },
            {
                "word": "lean to",
                "pos": "phrasal verb"
            },
            {
                "word": "lean-to",
                "pos": "noun"
            },
            {
                "word": "lean toward",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tend to prefer something, especially a particular opinion or interest",
                    "vi": "có xu hướng thích thứ gì đó, đặc biệt là một quan điểm hoặc sở thích cụ thể"
                },
                "examples": [
                    {
                        "en": "The UK leant towards the US proposal.",
                        "vi": "Vương quốc Anh nghiêng về đề xuất của Hoa Kỳ."
                    }
                ]
            }
        ]
    },
    {
        "id": "21f63e463c694394b4977b9d1c601360",
        "word": "lean toward",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "lean to",
                "pos": "phrasal verb"
            },
            {
                "word": "lean-to",
                "pos": "noun"
            },
            {
                "word": "lean toward",
                "pos": "phrasal verb"
            },
            {
                "word": "lean towards",
                "pos": "phrasal verb"
            },
            {
                "word": "leap",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tend to prefer something, especially a particular opinion or interest",
                    "vi": "có xu hướng thích thứ gì đó, đặc biệt là một quan điểm hoặc sở thích cụ thể"
                },
                "examples": [
                    {
                        "en": "The UK leant towards the US proposal.",
                        "vi": "Vương quốc Anh nghiêng về đề xuất của Hoa Kỳ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cc91a7daca7f4a5599d05742dd73a1da",
        "word": "lean towards",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "lean-to",
                "pos": "noun"
            },
            {
                "word": "lean toward",
                "pos": "phrasal verb"
            },
            {
                "word": "lean towards",
                "pos": "phrasal verb"
            },
            {
                "word": "leap",
                "pos": "verb"
            },
            {
                "word": "leap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tend to prefer something, especially a particular opinion or interest",
                    "vi": "có xu hướng thích thứ gì đó, đặc biệt là một quan điểm hoặc sở thích cụ thể"
                },
                "examples": [
                    {
                        "en": "The UK leant towards the US proposal.",
                        "vi": "Vương quốc Anh nghiêng về đề xuất của Hoa Kỳ."
                    }
                ]
            }
        ]
    }
]