[
    {
        "id": "8460e0546c7f43b384aec2513d355c59",
        "word": "homework",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈhəʊmwɜːk/",
            "us": "/ˈhəʊmwɜːrk/"
        },
        "nearby": [
            {
                "word": "homeward",
                "pos": "adjective"
            },
            {
                "word": "homeware",
                "pos": "noun"
            },
            {
                "word": "homework",
                "pos": "noun"
            },
            {
                "word": "homeworker",
                "pos": "noun"
            },
            {
                "word": "homeworking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work that is given by teachers for students to do at home",
                    "vi": "công việc giáo viên đưa ra để học sinh làm ở nhà"
                },
                "examples": [
                    {
                        "en": "I always do my homework on the bus.",
                        "vi": "Tôi luôn làm bài tập về nhà trên xe buýt."
                    },
                    {
                        "en": "physics/geography/French, etc. homework",
                        "vi": "bài tập về nhà vật lý / địa lý / tiếng Pháp, v.v."
                    },
                    {
                        "en": "I still haven't done my geography homework.",
                        "vi": "Tôi vẫn chưa làm bài tập địa lý của mình."
                    },
                    {
                        "en": "How much homework do you get?",
                        "vi": "Bạn nhận được bao nhiêu bài tập về nhà?"
                    },
                    {
                        "en": "for homework I have to write up the notes for homework.",
                        "vi": "cho bài tập về nhà, tôi phải viết các ghi chú cho bài tập về nhà."
                    },
                    {
                        "en": "(especially North American English) I have to finish this homework assignment.",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) Tôi phải hoàn thành bài tập về nhà này."
                    }
                ]
            },
            {
                "define": {
                    "en": "work that somebody does to prepare for something",
                    "vi": "công việc mà ai đó làm để chuẩn bị cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "You could tell that he had really done his homework (= found out all he needed to know).",
                        "vi": "Bạn có thể nói rằng anh ấy đã thực sự làm xong bài tập về nhà của mình (= tìm hiểu tất cả những gì anh ấy cần biết)."
                    }
                ]
            }
        ]
    },
    {
        "id": "b33ab4c0937b4ae8bdcef8bb259cca0f",
        "word": "lesson",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈlesn/",
            "us": "/ˈlesn/"
        },
        "nearby": [
            {
                "word": "-lessly",
                "pos": "suffix"
            },
            {
                "word": "-lessness",
                "pos": "suffix"
            },
            {
                "word": "lesson",
                "pos": "noun"
            },
            {
                "word": "lessor",
                "pos": "noun"
            },
            {
                "word": "lest",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time in which somebody is taught something",
                    "vi": "một khoảng thời gian mà ai đó được dạy điều gì đó"
                },
                "examples": [
                    {
                        "en": "She gives piano lessons.",
                        "vi": "Cô ấy dạy đàn piano."
                    },
                    {
                        "en": "I’m having driving lessons.",
                        "vi": "Tôi đang học lái xe."
                    },
                    {
                        "en": "lesson in something He took lessons in Thai cookery.",
                        "vi": "Bài học về điều gì đó Anh ấy đã học nấu ăn ở Thái."
                    },
                    {
                        "en": "lesson on something a history lesson on the Roman Empire",
                        "vi": "bài học về điều gì đó một bài học lịch sử về Đế chế La Mã"
                    },
                    {
                        "en": "lesson with somebody Beethoven's lessons with Haydn continued until 1794.",
                        "vi": "bài học với ai đó Các bài học của Beethoven với Haydn tiếp tục cho đến năm 1794."
                    },
                    {
                        "en": "lesson from somebody His parents paid for lessons from local dance teachers.",
                        "vi": "bài học từ ai đó Cha mẹ anh ấy đã trả tiền cho các bài học từ các giáo viên dạy khiêu vũ địa phương."
                    },
                    {
                        "en": "lesson for somebody Lessons for beginners can be arranged.",
                        "vi": "bài học cho ai đó Có thể sắp xếp bài học cho người mới bắt đầu."
                    },
                    {
                        "en": "(especially British English) Our first lesson on Tuesdays is French.",
                        "vi": "(đặc biệt là tiếng Anh Anh) Bài học đầu tiên của chúng tôi vào các ngày Thứ Ba là tiếng Pháp."
                    },
                    {
                        "en": "(especially British English) What did we do last lesson?",
                        "vi": "(đặc biệt là tiếng Anh Anh) Bài trước chúng ta đã làm gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is intended to be learned",
                    "vi": "một cái gì đó được dự định để học"
                },
                "examples": [
                    {
                        "en": "The coursebook is divided into 30 lessons.",
                        "vi": "Giáo trình được chia thành 30 bài học."
                    },
                    {
                        "en": "lesson on something Other countries can teach us a lesson or two on industrial policy.",
                        "vi": "bài học về điều gì đó Các nước khác có thể dạy chúng ta một hoặc hai bài học về chính sách công nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "an experience, especially an unpleasant one, that somebody can learn from so that it does not happen again in the future",
                    "vi": "một trải nghiệm, đặc biệt là một trải nghiệm khó chịu, mà ai đó có thể học hỏi để nó không tái diễn trong tương lai"
                },
                "examples": [
                    {
                        "en": "The accident taught me a lesson I'll never forget.",
                        "vi": "Tai nạn đã dạy cho tôi một bài học mà tôi sẽ không bao giờ quên."
                    },
                    {
                        "en": "There are lessons to be learned from this mistake.",
                        "vi": "Có những bài học được rút ra từ sai lầm này."
                    },
                    {
                        "en": "The narrative presents the hero with a series of life lessons.",
                        "vi": "Câu chuyện giới thiệu cho người anh hùng một loạt bài học cuộc sống."
                    },
                    {
                        "en": "It is dangerous to ignore the lessons of history.",
                        "vi": "Thật nguy hiểm nếu bỏ qua những bài học của lịch sử."
                    },
                    {
                        "en": "lesson to somebody Let that be a lesson to you (= so that you do not make the same mistake again).",
                        "vi": "bài học cho ai đó Hãy để đó là một bài học cho bạn (= để bạn không mắc lại sai lầm tương tự)."
                    },
                    {
                        "en": "Their openness was a terrific lesson to me.",
                        "vi": "Sự cởi mở của họ là một bài học tuyệt vời đối với tôi."
                    },
                    {
                        "en": "lesson on/about something The film offers an important lesson on the value of friendship.",
                        "vi": "Bài học về / về điều gì Bộ phim đưa ra một bài học quan trọng về giá trị của tình bạn."
                    },
                    {
                        "en": "lesson on/about doing something That's one of the lessons about being in a relationship that I hope not to forget.",
                        "vi": "Bài học về / về việc làm điều gì đó Đó là một trong những bài học về việc ở trong một mối quan hệ mà tôi hy vọng sẽ không quên."
                    },
                    {
                        "en": "lesson in something He said that the election results were a lesson in humility for the party.",
                        "vi": "Bài học về điều gì đó Ông nói rằng kết quả bầu cử là một bài học về sự khiêm tốn đối với đảng."
                    },
                    {
                        "en": "lesson in doing something This experience has provided many valuable lessons in caring for the marine habitat.",
                        "vi": "Bài học kinh nghiệm này đã cung cấp nhiều bài học quý giá trong việc chăm sóc môi trường sống ở biển."
                    },
                    {
                        "en": "lesson for somebody The lesson for the leaders of Western governments is clear.",
                        "vi": "Bài học cho ai đó Bài học cho các nhà lãnh đạo của các chính phủ phương Tây là rất rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a passage from the Bible that is read to people during a church service in the Church of England",
                    "vi": "một đoạn trong Kinh thánh được đọc cho mọi người trong buổi lễ ở Nhà thờ Anh"
                },
                "examples": [
                    {
                        "en": "The first lesson is taken from St John’s Gospel.",
                        "vi": "Bài học đầu tiên được trích từ Tin Mừng Thánh John."
                    }
                ]
            },
            {
                "define": {
                    "en": "to learn what to do or not to do in the future because you have had a bad experience in the past",
                    "vi": "để tìm hiểu những gì nên làm hoặc không nên làm trong tương lai bởi vì bạn đã có một trải nghiệm tồi tệ trong quá khứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "53e7dc13cfbf4eb5b3b8d06cc1bdc8a6",
        "word": "project",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈprɒdʒekt/",
            "us": "/ˈprɑːdʒekt/"
        },
        "nearby": [
            {
                "word": "prohibitive",
                "pos": "adjective"
            },
            {
                "word": "prohibitively",
                "pos": "adverb"
            },
            {
                "word": "project",
                "pos": "noun"
            },
            {
                "word": "project",
                "pos": "verb"
            },
            {
                "word": "Project HOPE",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of work involving careful study of a subject over a period of time, done by school or college students",
                    "vi": "một công việc liên quan đến việc nghiên cứu cẩn thận một chủ đề trong một khoảng thời gian, được thực hiện bởi các sinh viên trường hoặc đại học"
                },
                "examples": [
                    {
                        "en": "a history project",
                        "vi": "một dự án lịch sử"
                    },
                    {
                        "en": "project on something My class is doing a project on medieval towns.",
                        "vi": "dự án về thứ gì đó Lớp tôi đang thực hiện một dự án về các thị trấn thời Trung cổ."
                    },
                    {
                        "en": "The final term will be devoted to project work.",
                        "vi": "Kỳ cuối cùng sẽ được dành cho công việc của dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "a planned piece of work that is designed to find information about something, to produce something new, or to improve something",
                    "vi": "một phần công việc đã lên kế hoạch được thiết kế để tìm kiếm thông tin về điều gì đó, sản xuất thứ gì đó mới hoặc để cải thiện điều gì đó"
                },
                "examples": [
                    {
                        "en": "We worked on various projects together.",
                        "vi": "Chúng tôi đã cùng nhau thực hiện nhiều dự án khác nhau."
                    },
                    {
                        "en": "About 300 schools are involved in the project.",
                        "vi": "Khoảng 300 trường học tham gia vào dự án."
                    },
                    {
                        "en": "to fund/finance a project",
                        "vi": "tài trợ / tài trợ cho một dự án"
                    },
                    {
                        "en": "to start/launch/initiate a project",
                        "vi": "để bắt đầu / khởi chạy / bắt đầu một dự án"
                    },
                    {
                        "en": "to undertake/complete a project",
                        "vi": "để thực hiện / hoàn thành một dự án"
                    },
                    {
                        "en": "a building/construction project",
                        "vi": "một tòa nhà / dự án xây dựng"
                    },
                    {
                        "en": "project to do something They've set up a research project to investigate the harmful effects of air pollution.",
                        "vi": "dự án làm điều gì đó Họ đã thiết lập một dự án nghiên cứu để điều tra tác hại của ô nhiễm không khí."
                    },
                    {
                        "en": "Work has begun on a project to build a new hospital.",
                        "vi": "Dự án xây dựng một bệnh viện mới đã bắt đầu được tiến hành."
                    },
                    {
                        "en": "project on something They are taking part in a project on the genetics of eating disorders.",
                        "vi": "dự án về một cái gì đó Họ đang tham gia vào một dự án về di truyền của chứng rối loạn ăn uống."
                    },
                    {
                        "en": "a project manager/team",
                        "vi": "một quản lý dự án / nhóm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of aims, ideas or activities that somebody is interested in or wants to bring to people’s attention",
                    "vi": "một tập hợp các mục đích, ý tưởng hoặc hoạt động mà ai đó quan tâm hoặc muốn thu hút sự chú ý của mọi người"
                },
                "examples": [
                    {
                        "en": "The party attempted to assemble its aims into a focused political project.",
                        "vi": "Đảng đã cố gắng tập hợp các mục tiêu của mình thành một dự án chính trị tập trung."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of houses or apartments built for poor families, usually with government money",
                    "vi": "một nhóm nhà hoặc căn hộ được xây dựng cho các gia đình nghèo, thường bằng tiền của chính phủ"
                },
                "examples": [
                    {
                        "en": "Going into the projects alone can be dangerous.",
                        "vi": "Đi vào các dự án một mình có thể nguy hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "4be1145780344894aafa71b273dd8ffb",
        "word": "school",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/skuːl/",
            "us": "/skuːl/"
        },
        "nearby": [
            {
                "word": "scholastic",
                "pos": "adjective"
            },
            {
                "word": "scholasticism",
                "pos": "noun"
            },
            {
                "word": "school",
                "pos": "noun"
            },
            {
                "word": "school",
                "pos": "verb"
            },
            {
                "word": "school age",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where children go to be educated",
                    "vi": "một nơi mà trẻ em đến để được giáo dục"
                },
                "examples": [
                    {
                        "en": "My brother and I went to the same school.",
                        "vi": "Tôi và anh trai học cùng trường."
                    },
                    {
                        "en": "(formal) Which school do they attend?",
                        "vi": "(chính thức) Họ học trường nào?"
                    },
                    {
                        "en": "I'm going to the school today to talk to Kim's teacher.",
                        "vi": "Hôm nay tôi sẽ đến trường để nói chuyện với giáo viên của Kim."
                    },
                    {
                        "en": "We need more money for roads, hospitals and schools.",
                        "vi": "Chúng tôi cần nhiều tiền hơn cho đường xá, bệnh viện và trường học."
                    },
                    {
                        "en": "The charity runs projects at local schools and youth organizations.",
                        "vi": "Tổ chức từ thiện thực hiện các dự án tại các trường học địa phương và các tổ chức thanh niên."
                    },
                    {
                        "en": "a girls'/boys' school",
                        "vi": "một trường nữ sinh / nam sinh"
                    },
                    {
                        "en": "school for somebody a school for autistic children",
                        "vi": "trường học cho ai đó trường học cho trẻ tự kỷ"
                    },
                    {
                        "en": "school buildings",
                        "vi": "trường học"
                    },
                    {
                        "en": "The kids get the school bus every morning.",
                        "vi": "Những đứa trẻ nhận được xe buýt của trường mỗi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of learning in a school; the time during your life when you go to a school",
                    "vi": "quá trình học tập trong một trường học; thời gian trong cuộc sống của bạn khi bạn đi học"
                },
                "examples": [
                    {
                        "en": "(British English) to start/leave school",
                        "vi": "(Tiếng Anh Anh) để bắt đầu / rời trường"
                    },
                    {
                        "en": "(North American English) to start/quit school",
                        "vi": "(Tiếng Anh Bắc Mỹ) để bắt đầu / nghỉ học"
                    },
                    {
                        "en": "Where did you go to school?",
                        "vi": "Bạn đã đi học ở đâu?"
                    },
                    {
                        "en": "(British English) at school All my kids are still at school.",
                        "vi": "(Tiếng Anh Anh) ở trường Tất cả những đứa trẻ của tôi vẫn đang ở trường."
                    },
                    {
                        "en": "Can you remember you first day at school?",
                        "vi": "Bạn có thể nhớ bạn ngày đầu tiên đến trường?"
                    },
                    {
                        "en": "(North American English) in school All my kids are still in school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) ở trường Tất cả các con tôi vẫn đang đi học."
                    },
                    {
                        "en": "(North American English) to teach school (= teach in a school)",
                        "vi": "(Tiếng Anh Bắc Mỹ) để dạy học (= dạy trong trường học)"
                    },
                    {
                        "en": "The transition from school to work can be difficult.",
                        "vi": "Quá trình chuyển đổi từ trường học sang nơi làm việc có thể khó khăn."
                    },
                    {
                        "en": "The school year was nearly over.",
                        "vi": "Năm học đã gần kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time during the day when children are working in a school",
                    "vi": "thời gian trong ngày khi trẻ em đi làm ở trường"
                },
                "examples": [
                    {
                        "en": "School begins at 9.",
                        "vi": "Trường học bắt đầu lúc 9 giờ."
                    },
                    {
                        "en": "after school Shall I meet you after school today?",
                        "vi": "Sau giờ học, tôi có thể gặp bạn sau giờ học hôm nay không?"
                    },
                    {
                        "en": "at/in school The kids are at/in school until 3.30.",
                        "vi": "at / in school Những đứa trẻ ở / ở trường cho đến 3 giờ 30."
                    },
                    {
                        "en": "off school I'm off school this week.",
                        "vi": "nghỉ học Tôi nghỉ học tuần này."
                    },
                    {
                        "en": "(especially British English) His mum kept him off school for two weeks when he was ill.",
                        "vi": "(đặc biệt là tiếng Anh Anh) Mẹ của anh ấy đã cho anh ấy nghỉ học trong hai tuần khi anh ấy bị ốm."
                    },
                    {
                        "en": "out of school (North American English) His mom kept him out of school for two weeks when he was sick.",
                        "vi": "nghỉ học (tiếng Anh Bắc Mỹ) Mẹ anh ấy đã cấm anh ấy nghỉ học trong hai tuần khi anh ấy bị ốm."
                    },
                    {
                        "en": "My parents let me stay home from school yesterday.",
                        "vi": "Hôm qua bố mẹ cho tôi nghỉ học ở nhà."
                    },
                    {
                        "en": "after-school activities",
                        "vi": "các hoạt động sau giờ học"
                    },
                    {
                        "en": "The next day was Monday, a school day.",
                        "vi": "Ngày hôm sau là thứ Hai, một ngày học."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the children or students and the teachers in a school",
                    "vi": "tất cả trẻ em hoặc học sinh và giáo viên trong một trường học"
                },
                "examples": [
                    {
                        "en": "I had to stand up in front of the whole school.",
                        "vi": "Tôi đã phải đứng lên trước toàn trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people go to learn a particular subject or skill",
                    "vi": "một nơi mà mọi người đến để học một chủ đề hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "a drama/language/riding school",
                        "vi": "một bộ phim truyền hình / ngôn ngữ / trường dạy cưỡi ngựa"
                    },
                    {
                        "en": "He runs a karate school in San Jose, California.",
                        "vi": "Anh ấy điều hành một trường dạy karate ở San Jose, California."
                    },
                    {
                        "en": "She wants to go to art school.",
                        "vi": "Cô ấy muốn đi học trường nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a college or university; the time that you spend there",
                    "vi": "một trường cao đẳng hoặc đại học; thời gian mà bạn dành ở đó"
                },
                "examples": [
                    {
                        "en": "famous schools like Yale and Harvard",
                        "vi": "các trường nổi tiếng như Yale và Harvard"
                    },
                    {
                        "en": "Where did you go to school?",
                        "vi": "Bạn đã đi học ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a department of a college or university that teaches a particular subject",
                    "vi": "một khoa của trường cao đẳng hoặc đại học dạy một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "the business/law/medical school",
                        "vi": "trường kinh doanh / luật / y khoa"
                    },
                    {
                        "en": "school of something the School of Dentistry",
                        "vi": "trường của cái gì đó Trường nha khoa"
                    },
                    {
                        "en": "He was determined to get into medical school.",
                        "vi": "Anh quyết tâm thi vào trường y."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of writers, artists, etc. whose style of work or opinions have been influenced by the same person or ideas",
                    "vi": "một nhóm các nhà văn, nghệ sĩ, v.v. có phong cách làm việc hoặc quan điểm đã bị ảnh hưởng bởi cùng một người hoặc ý tưởng"
                },
                "examples": [
                    {
                        "en": "the Dutch school of painting",
                        "vi": "trường phái hội họa Hà Lan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of fish or other sea animals, swimming together",
                    "vi": "một số lượng lớn cá hoặc động vật biển khác, bơi cùng nhau"
                },
                "examples": [
                    {
                        "en": "a school of dolphins",
                        "vi": "trường dạy cá heo"
                    }
                ]
            },
            {
                "define": {
                    "en": "an old-fashioned person who likes to do things as they were done in the past",
                    "vi": "một người cổ hủ thích làm những việc như họ đã từng làm trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of thinking that a number of people share",
                    "vi": "một cách suy nghĩ mà một số người chia sẻ"
                },
                "examples": [
                    {
                        "en": "There are two schools of thought about how this illness should be treated.",
                        "vi": "Có hai luồng suy nghĩ về cách điều trị căn bệnh này."
                    },
                    {
                        "en": "He belongs to the school of thought that says that competition can be very stimulating for children.",
                        "vi": "Ông thuộc trường phái tư tưởng cho rằng cạnh tranh có thể rất kích thích trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "very fashionable",
                    "vi": "rất thời trang"
                },
                "examples": [
                    {
                        "en": "The assistants look like they're too cool for school.",
                        "vi": "Các trợ lý trông giống như họ quá tuyệt khi đi học."
                    }
                ]
            }
        ]
    },
    {
        "id": "2201a30e16e74922b032839547987ea2",
        "word": "year",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/jɪə(r)/",
            "us": "/jɪr/"
        },
        "nearby": [
            {
                "word": "yea",
                "pos": "adverb, noun"
            },
            {
                "word": "yeah",
                "pos": "exclamation"
            },
            {
                "word": "year",
                "pos": "noun"
            },
            {
                "word": "yearbook",
                "pos": "noun"
            },
            {
                "word": "year end",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the period from 1 January to 31 December, that is 365 or 366 days, divided into 12 months",
                    "vi": "khoảng thời gian từ ngày 1 tháng 1 đến ngày 31 tháng 12, tức là 365 hoặc 366 ngày, được chia thành 12 tháng"
                },
                "examples": [
                    {
                        "en": "Elections take place every year.",
                        "vi": "Các cuộc bầu cử diễn ra hàng năm."
                    },
                    {
                        "en": "I lost my job earlier this year.",
                        "vi": "Tôi đã mất việc vào đầu năm nay."
                    },
                    {
                        "en": "next/last year",
                        "vi": "năm sau / năm ngoái"
                    },
                    {
                        "en": "She died the following year.",
                        "vi": "Cô ấy chết vào năm sau đó."
                    },
                    {
                        "en": "Three million tourists visit Yellowstone every year.",
                        "vi": "Ba triệu khách du lịch đến thăm Yellowstone mỗi năm."
                    },
                    {
                        "en": "in the year… She was born in the year 1865.",
                        "vi": "vào năm… Cô sinh năm 1865."
                    },
                    {
                        "en": "in… years The crowd was much smaller than in previous years.",
                        "vi": "trong… năm Số lượng đám đông nhỏ hơn nhiều so với những năm trước."
                    },
                    {
                        "en": "In the past few years, she has become one of our top-selling authors.",
                        "vi": "Trong vài năm qua, cô ấy đã trở thành một trong những tác giả bán chạy nhất của chúng tôi."
                    },
                    {
                        "en": "The museum is open all year round (= during the whole year).",
                        "vi": "Bảo tàng mở cửa quanh năm (= trong cả năm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of twelve months, measured from any particular time",
                    "vi": "khoảng thời gian mười hai tháng, được đo từ bất kỳ thời điểm cụ thể nào"
                },
                "examples": [
                    {
                        "en": "It's exactly a year since I started working here.",
                        "vi": "Đã đúng một năm kể từ khi tôi bắt đầu làm việc ở đây."
                    },
                    {
                        "en": "She gave up teaching three years ago.",
                        "vi": "Cô đã từ bỏ công việc giảng dạy cách đây 3 năm."
                    },
                    {
                        "en": "They got married two years later.",
                        "vi": "Họ kết hôn hai năm sau đó."
                    },
                    {
                        "en": "The autobiography could only be published 100 years after his death.",
                        "vi": "Cuốn tự truyện chỉ có thể được xuất bản 100 năm sau khi ông qua đời."
                    },
                    {
                        "en": "I hope to retire in two years' time.",
                        "vi": "Tôi hy vọng sẽ nghỉ hưu sau hai năm nữa."
                    },
                    {
                        "en": "Where do you think you will be five years from now?",
                        "vi": "Bạn nghĩ mình sẽ ở đâu trong 5 năm tới?"
                    },
                    {
                        "en": "Seeds can live in the soil for many years.",
                        "vi": "Hạt có thể sống trong đất nhiều năm."
                    },
                    {
                        "en": "in the… year (of something) in the first year of their marriage",
                        "vi": "trong… năm (của một cái gì đó) trong năm đầu tiên của cuộc hôn nhân của họ"
                    },
                    {
                        "en": "in… years Production has declined in recent years.",
                        "vi": "trong… năm Sản lượng đã giảm trong những năm gần đây."
                    },
                    {
                        "en": "His early years were spent in San Francisco.",
                        "vi": "Những năm đầu của ông đã dành cho San Francisco."
                    },
                    {
                        "en": "We have high hopes for the coming year (= the next twelve months).",
                        "vi": "Chúng tôi đặt nhiều hy vọng vào năm tới (= mười hai tháng tới)."
                    },
                    {
                        "en": "the pre-war/war/post-war years (= the period before/during/after the war)",
                        "vi": "những năm trước chiến tranh / chiến tranh / sau chiến tranh (= khoảng thời gian trước / trong / sau chiến tranh)"
                    },
                    {
                        "en": "I have happy memories of my years in Poland (= the time I spent there).",
                        "vi": "Tôi có những kỷ niệm vui vẻ trong những năm tháng ở Ba Lan (= thời gian tôi ở đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "age; time of life",
                    "vi": "tuổi; thời gian của cuộc sống"
                },
                "examples": [
                    {
                        "en": "He was 14 years old when it happened.",
                        "vi": "Anh ấy 14 tuổi khi nó xảy ra."
                    },
                    {
                        "en": "She looks young for her years.",
                        "vi": "Trông cô ấy trẻ ra nhiều năm."
                    },
                    {
                        "en": "They were both only 20 years of age.",
                        "vi": "Cả hai đều chỉ mới 20 tuổi."
                    },
                    {
                        "en": "a twenty-year-old man",
                        "vi": "một người đàn ông hai mươi tuổi"
                    },
                    {
                        "en": "He died in his sixtieth year.",
                        "vi": "Ông mất năm sáu mươi tuổi."
                    },
                    {
                        "en": "She's getting on in years (= is no longer young).",
                        "vi": "Cô ấy đã già đi trong nhiều năm (= không còn trẻ nữa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of twelve months connected with a particular activity",
                    "vi": "khoảng thời gian mười hai tháng liên quan đến một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "the tax/fiscal year",
                        "vi": "thuế / năm tài chính"
                    },
                    {
                        "en": "the school year",
                        "vi": "năm học"
                    }
                ]
            },
            {
                "define": {
                    "en": "a level that you stay in for one year; a student at a particular level",
                    "vi": "cấp độ mà bạn ở trong một năm; một học sinh ở một cấp độ cụ thể"
                },
                "examples": [
                    {
                        "en": "in year… We started German in year seven.",
                        "vi": "vào năm… Chúng tôi bắt đầu học tiếng Đức vào năm thứ bảy."
                    },
                    {
                        "en": "in somebody's year She was in my year at school.",
                        "vi": "in somebody's year Cô ấy đã vào năm học của tôi."
                    },
                    {
                        "en": "The project is the work of a group of year-seven pupils.",
                        "vi": "Dự án là công việc của một nhóm học sinh lớp bảy."
                    },
                    {
                        "en": "The first years do French.",
                        "vi": "Những năm đầu tiên học tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long time",
                    "vi": "một thời gian dài"
                },
                "examples": [
                    {
                        "en": "It's years since we last met.",
                        "vi": "Đã nhiều năm kể từ lần cuối chúng ta gặp nhau."
                    },
                    {
                        "en": "for years They haven't seen each other for years and years.",
                        "vi": "trong nhiều năm Họ đã không gặp nhau trong nhiều năm và nhiều năm."
                    },
                    {
                        "en": "in years That's the best movie I've seen in years.",
                        "vi": "trong nhiều năm Đó là bộ phim hay nhất mà tôi đã xem trong nhiều năm."
                    },
                    {
                        "en": "It's the first time we've met in years.",
                        "vi": "Đây là lần đầu tiên chúng ta gặp nhau trong nhiều năm."
                    },
                    {
                        "en": "over the years We've had a lot of fun over the years.",
                        "vi": "trong những năm qua Chúng tôi đã có rất nhiều niềm vui trong những năm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "at some time in the future",
                    "vi": "vào một thời điểm nào đó trong tương lai"
                },
                "examples": [
                    {
                        "en": "There are certain to be more job losses further down the road.",
                        "vi": "Chắc chắn sẽ có nhiều mất việc hơn nữa."
                    },
                    {
                        "en": "Will this movie still be funny a few years down the road?",
                        "vi": "Liệu bộ phim này có còn hài hước trong vài năm nữa không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the last years of somebody’s life",
                    "vi": "những năm cuối cùng của cuộc đời ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very long time",
                    "vi": "một thời gian rất dài"
                },
                "examples": [
                    {
                        "en": "We've known each other for donkey's years.",
                        "vi": "Chúng tôi đã biết nhau trong những năm lừa dối."
                    },
                    {
                        "en": "I met him once, but that was donkey’s years ago.",
                        "vi": "Tôi đã gặp anh ta một lần, nhưng đó là con lừa nhiều năm trước."
                    },
                    {
                        "en": "This technology has been around for donkey's.",
                        "vi": "Công nghệ này đã được sử dụng cho lừa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that people decide is the best in a particular field in a particular year",
                    "vi": "một người hoặc điều mà mọi người quyết định là tốt nhất trong một lĩnh vực cụ thể trong một năm cụ thể"
                },
                "examples": [
                    {
                        "en": "He was chosen as TV personality of the year.",
                        "vi": "Anh được chọn là nhân vật truyền hình của năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you will/would never do something",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn sẽ / sẽ không bao giờ làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'd never have thought of that in a million years.",
                        "vi": "Tôi chưa bao giờ nghĩ đến điều đó trong một triệu năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in polite expressions to describe somebody as ‘very old’",
                    "vi": "được sử dụng trong các biểu thức lịch sự để mô tả ai đó là 'rất già'"
                },
                "examples": [
                    {
                        "en": "He was a man of advanced years.",
                        "vi": "Anh ấy là một người đàn ông của những năm cao cấp."
                    },
                    {
                        "en": "(humorous) Even at my advanced age I still know how to enjoy myself!",
                        "vi": "(hài hước) Ngay cả khi tuổi đã cao, tôi vẫn biết cách tận hưởng bản thân mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel or look older",
                    "vi": "để làm cho ai đó cảm thấy hoặc trông già hơn"
                },
                "examples": [
                    {
                        "en": "The illness put years on him.",
                        "vi": "Bệnh tật đã đeo đẳng ông nhiều năm."
                    },
                    {
                        "en": "His wife's death has put years on him.",
                        "vi": "Cái chết của vợ anh đã đè nặng anh nhiều năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the desire for new sexual experience that is thought to be felt after seven years of marriage",
                    "vi": "mong muốn trải nghiệm tình dục mới được cho là sẽ cảm nhận được sau bảy năm kết hôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "since a very long time ago",
                    "vi": "từ rất lâu rồi"
                },
                "examples": [
                    {
                        "en": "I've been going there every summer since the year dot.",
                        "vi": "Tôi đã đến đó mỗi mùa hè kể từ dấu chấm trong năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel or look younger",
                    "vi": "để làm cho ai đó cảm thấy hoặc trông trẻ hơn"
                },
                "examples": [
                    {
                        "en": "That haircut takes years off her.",
                        "vi": "Việc cắt tóc đó khiến cô ấy mất nhiều năm."
                    },
                    {
                        "en": "Careful make-up and styling can take years off you.",
                        "vi": "Việc trang điểm và tạo kiểu cẩn thận có thể khiến bạn mất nhiều năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time when a new century/year starts",
                    "vi": "thời điểm mà một thế kỷ / năm mới bắt đầu"
                },
                "examples": [
                    {
                        "en": "It was built at the turn of the century.",
                        "vi": "Nó được xây dựng vào thời điểm chuyển giao thế kỷ."
                    },
                    {
                        "en": "The team are unbeaten since the turn of the year.",
                        "vi": "Đội bất bại kể từ đầu năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "every year for many years",
                    "vi": "hàng năm trong nhiều năm"
                },
                "examples": [
                    {
                        "en": "People return year after year.",
                        "vi": "Mọi người trở lại năm này qua năm khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "as the years pass; each year",
                    "vi": "năm tháng trôi qua; mỗi năm"
                },
                "examples": [
                    {
                        "en": "Year by year their affection for each other grew stronger.",
                        "vi": "Theo năm tháng, tình cảm của họ dành cho nhau ngày càng bền chặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "every year",
                    "vi": "mỗi năm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "any particular year after the birth of Christ",
                    "vi": "bất kỳ năm cụ thể nào sau khi Chúa giáng sinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "each year, compared with the last year",
                    "vi": "mỗi năm, so với năm trước"
                },
                "examples": [
                    {
                        "en": "Spending has increased year on year.",
                        "vi": "Chi tiêu đã tăng lên hàng năm."
                    },
                    {
                        "en": "a year-on-year increase in spending",
                        "vi": "tăng chi tiêu hàng năm"
                    }
                ]
            }
        ]
    },
    {
        "id": "ab63511d55044a2793fc8c3794dec613",
        "word": "assistant",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/əˈsɪstənt/",
            "us": "/əˈsɪstənt/"
        },
        "nearby": [
            {
                "word": "assistance",
                "pos": "noun"
            },
            {
                "word": "assistance dog",
                "pos": "noun"
            },
            {
                "word": "assistant",
                "pos": "noun"
            },
            {
                "word": "assistant",
                "pos": "adjective"
            },
            {
                "word": "assistant professor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who helps or supports somebody, usually in their job",
                    "vi": "một người giúp đỡ hoặc hỗ trợ ai đó, thường là trong công việc của họ"
                },
                "examples": [
                    {
                        "en": "My assistant will now demonstrate the machine in action.",
                        "vi": "Trợ lý của tôi bây giờ sẽ chứng minh máy đang hoạt động."
                    },
                    {
                        "en": "a senior research assistant",
                        "vi": "một trợ lý nghiên cứu cao cấp"
                    },
                    {
                        "en": "She works as a care assistant in an old people's home.",
                        "vi": "Cô làm công việc chăm sóc tại nhà của một người già."
                    },
                    {
                        "en": "I work part-time as a classroom assistant in my local primary school.",
                        "vi": "Tôi làm việc bán thời gian như một trợ lý lớp học ở trường tiểu học địa phương của tôi."
                    },
                    {
                        "en": "He was working as a special assistant to the president.",
                        "vi": "Anh ấy đang làm trợ lý đặc biệt cho tổng thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to serve customers in a shop",
                    "vi": "một người có công việc là phục vụ khách hàng trong cửa hàng"
                },
                "examples": [
                    {
                        "en": "an assistant in a department store",
                        "vi": "một trợ lý trong một cửa hàng bách hóa"
                    },
                    {
                        "en": "Maybe one of our assistants can help you make your choice?",
                        "vi": "Có thể một trong những trợ lý của chúng tôi có thể giúp bạn đưa ra lựa chọn của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a student at university or college who spends time in a foreign country teaching his or her own language in a school",
                    "vi": "một sinh viên đại học hoặc cao đẳng dành thời gian ở nước ngoài để dạy ngôn ngữ của mình trong trường học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0539346a552c4c5ba4e82db9c1617c01",
        "word": "holiday",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhɒlədeɪ/",
            "us": "/ˈhɑːlədeɪ/"
        },
        "nearby": [
            {
                "word": "hole up",
                "pos": "phrasal verb"
            },
            {
                "word": "holey",
                "pos": "adjective"
            },
            {
                "word": "holiday",
                "pos": "noun"
            },
            {
                "word": "Billie Holiday",
                "pos": ""
            },
            {
                "word": "holiday",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time when you are not at work or school",
                    "vi": "một khoảng thời gian khi bạn không đi làm hoặc đi học"
                },
                "examples": [
                    {
                        "en": "the school/summer/Christmas holidays",
                        "vi": "trường học / kỳ nghỉ hè / Giáng sinh"
                    },
                    {
                        "en": "She spent her holiday decorating the flat.",
                        "vi": "Cô ấy đã dành kỳ nghỉ của mình để trang trí căn hộ."
                    },
                    {
                        "en": "on holiday I'm afraid Mr Walsh is away on holiday this week.",
                        "vi": "vào kỳ nghỉ, tôi sợ rằng ông Walsh sẽ đi nghỉ trong tuần này."
                    },
                    {
                        "en": "The package includes 20 days' paid holiday a year.",
                        "vi": "Gói này bao gồm 20 ngày nghỉ có lương một năm."
                    },
                    {
                        "en": "holiday pay",
                        "vi": "lương nghỉ lễ"
                    },
                    {
                        "en": "a holiday job (= done by students during the school holidays)",
                        "vi": "một công việc kỳ nghỉ (= do sinh viên làm trong kỳ nghỉ học)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time spent travelling or resting away from home",
                    "vi": "một khoảng thời gian đi du lịch hoặc nghỉ ngơi xa nhà"
                },
                "examples": [
                    {
                        "en": "a camping/skiing/walking holiday",
                        "vi": "một kỳ nghỉ cắm trại / trượt tuyết / đi bộ"
                    },
                    {
                        "en": "an adventure holiday",
                        "vi": "một kỳ nghỉ phiêu lưu"
                    },
                    {
                        "en": "a foreign/an overseas holiday",
                        "vi": "một kỳ nghỉ ở nước ngoài / ở nước ngoài"
                    },
                    {
                        "en": "a family holiday",
                        "vi": "một kỳ nghỉ gia đình"
                    },
                    {
                        "en": "a two-week holiday in the sun",
                        "vi": "một kỳ nghỉ hai tuần trong ánh nắng mặt trời"
                    },
                    {
                        "en": "to have/take a holiday",
                        "vi": "có / đi nghỉ"
                    },
                    {
                        "en": "on holiday They met while on holiday in Greece.",
                        "vi": "vào kỳ nghỉ Họ gặp nhau khi đi nghỉ ở Hy Lạp."
                    },
                    {
                        "en": "We went on holiday together last summer.",
                        "vi": "Chúng tôi đã đi nghỉ cùng nhau vào mùa hè năm ngoái."
                    },
                    {
                        "en": "for your holiday(s) Where are you going for your holidays this year?",
                        "vi": "cho (các) kỳ nghỉ của bạn Bạn sẽ đi đâu trong kỳ nghỉ năm nay?"
                    },
                    {
                        "en": "a holiday cottage/home",
                        "vi": "một ngôi nhà / ngôi nhà nghỉ mát"
                    },
                    {
                        "en": "a holiday destination/resort",
                        "vi": "một điểm đến kỳ nghỉ / khu nghỉ mát"
                    }
                ]
            },
            {
                "define": {
                    "en": "a day when most people do not go to work or school, especially because of a religious or national celebration",
                    "vi": "một ngày mà hầu hết mọi người không đi làm hoặc đi học, đặc biệt là vì lễ kỷ niệm tôn giáo hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "The president's birthday was declared a national holiday.",
                        "vi": "Ngày sinh của tổng thống đã được tuyên bố là một ngày lễ quốc gia."
                    },
                    {
                        "en": "Today is a holiday in Wales.",
                        "vi": "Hôm nay là một ngày lễ ở xứ Wales."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time from late November to early January that includes Thanksgiving, Christmas, Hanukkah and New Year",
                    "vi": "thời gian từ cuối tháng 11 đến đầu tháng 1 bao gồm Lễ Tạ ơn, Giáng sinh, Hanukkah và Năm mới"
                },
                "examples": [
                    {
                        "en": "Happy Holidays!",
                        "vi": "Kỳ nghỉ vui vẻ!"
                    },
                    {
                        "en": "Thanksgiving is the traditional start of the holiday season for most Americans.",
                        "vi": "Lễ Tạ ơn là ngày bắt đầu truyền thống của kỳ nghỉ lễ đối với hầu hết người Mỹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "309c49965cc44a52b26faf6197895bce",
        "word": "schedule",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈʃedjuːl/",
            "us": "/ˈskedʒuːl/"
        },
        "nearby": [
            {
                "word": "sceptre",
                "pos": "noun"
            },
            {
                "word": "schadenfreude",
                "pos": "noun"
            },
            {
                "word": "schedule",
                "pos": "noun"
            },
            {
                "word": "schedule",
                "pos": "verb"
            },
            {
                "word": "scheduled caste",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plan that lists all the work that you have to do and when you must do each thing",
                    "vi": "một kế hoạch liệt kê tất cả công việc bạn phải làm và khi nào bạn phải làm từng việc"
                },
                "examples": [
                    {
                        "en": "I have a hectic schedule for the next few days.",
                        "vi": "Tôi có một lịch trình bận rộn trong vài ngày tới."
                    },
                    {
                        "en": "a busy/gruelling/punishing schedule",
                        "vi": "một lịch trình bận rộn / mệt mỏi / trừng phạt"
                    },
                    {
                        "en": "We're working to a tight schedule (= we have a lot of things to do in a short time).",
                        "vi": "Chúng tôi đang làm việc theo một lịch trình chặt chẽ (= chúng tôi có nhiều việc phải làm trong thời gian ngắn)."
                    },
                    {
                        "en": "He has taken some time out of his busy schedule to talk to us.",
                        "vi": "Anh ấy đã bớt chút thời gian ra khỏi lịch trình bận rộn của mình để nói chuyện với chúng tôi."
                    },
                    {
                        "en": "They have a very flexible work schedule.",
                        "vi": "Họ có một lịch trình làm việc rất linh hoạt."
                    },
                    {
                        "en": "I have no time available in my regular schedule.",
                        "vi": "Tôi không có thời gian trong lịch trình thông thường của mình."
                    },
                    {
                        "en": "on schedule Filming began on schedule (= at the planned time).",
                        "vi": "đúng lịch trình Việc quay phim bắt đầu đúng kế hoạch (= vào thời gian đã định)."
                    },
                    {
                        "en": "The project will be completed on schedule this summer.",
                        "vi": "Dự án sẽ hoàn thành đúng tiến độ vào mùa hè này."
                    },
                    {
                        "en": "ahead of schedule The new bridge has been finished two years ahead of schedule.",
                        "vi": "trước kế hoạch Cây cầu mới đã được hoàn thành trước thời hạn hai năm."
                    },
                    {
                        "en": "behind schedule The tunnel project has already fallen behind schedule.",
                        "vi": "chậm tiến độ Dự án đường hầm đã bị chậm tiến độ."
                    },
                    {
                        "en": "according to schedule At this stage everything is going according to schedule (= as planned).",
                        "vi": "theo lịch trình Ở giai đoạn này, mọi thứ đang diễn ra theo lịch trình (= theo kế hoạch)."
                    },
                    {
                        "en": "We are trying desperately to keep to our schedule.",
                        "vi": "Chúng tôi đang cố gắng hết sức để giữ đúng lịch trình của mình."
                    },
                    {
                        "en": "The countries have yet to set the schedule for the next round of talks.",
                        "vi": "Các nước vẫn chưa ấn định lịch trình cho vòng đàm phán tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chart showing the times at which trains, buses and planes leave and arrive",
                    "vi": "biểu đồ hiển thị thời gian tàu hỏa, xe buýt và máy bay khởi hành và đến nơi"
                },
                "examples": [
                    {
                        "en": "Connor checked the bus schedules for the day.",
                        "vi": "Connor đã kiểm tra lịch trình xe buýt trong ngày."
                    },
                    {
                        "en": "disruptions to flight schedules caused by the strike",
                        "vi": "gián đoạn lịch trình chuyến bay do cuộc đình công gây ra"
                    }
                ]
            },
            {
                "define": {
                    "en": "a chart or plan of the classes that a student or teacher has in school each week",
                    "vi": "biểu đồ hoặc kế hoạch của các lớp học mà học sinh hoặc giáo viên có trong trường mỗi tuần"
                },
                "examples": [
                    {
                        "en": "Besides a full school schedule, Kayla's week is jam-packed with other activities.",
                        "vi": "Bên cạnh lịch học dày đặc ở trường, một tuần của Kayla còn rất nhiều hoạt động khác."
                    },
                    {
                        "en": "What's your schedule like next semester?",
                        "vi": "Lịch trình của bạn như thế nào trong học kỳ tới?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of the television and radio programmes that are on a particular channel and the times that they start",
                    "vi": "danh sách các chương trình truyền hình và đài phát thanh trên một kênh cụ thể và thời gian chúng bắt đầu"
                },
                "examples": [
                    {
                        "en": "The channel's schedules are filled with old films and repeats.",
                        "vi": "Lịch trình của kênh chứa đầy các bộ phim cũ và các bộ phim lặp lại."
                    },
                    {
                        "en": "Channel 4 has published its spring schedules.",
                        "vi": "Kênh 4 đã công bố lịch trình mùa xuân của mình."
                    },
                    {
                        "en": "The show trebled ratings for the channel's afternoon schedule.",
                        "vi": "Chương trình tăng gấp ba lần xếp hạng cho lịch trình buổi chiều của kênh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written list of things, for example prices, rates or conditions",
                    "vi": "một danh sách bằng văn bản về những thứ, ví dụ như giá cả, tỷ lệ hoặc điều kiện"
                },
                "examples": [
                    {
                        "en": "tax schedules",
                        "vi": "lịch thuế"
                    }
                ]
            }
        ]
    },
    {
        "id": "77a2171beb724ce2a31207a29f9e0682",
        "word": "school day",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈskuːldeɪ/",
            "us": "/ˈskuːldeɪ/"
        },
        "nearby": [
            {
                "word": "schoolchild",
                "pos": "noun"
            },
            {
                "word": "school council",
                "pos": "noun"
            },
            {
                "word": "school day",
                "pos": "noun"
            },
            {
                "word": "school district",
                "pos": "noun"
            },
            {
                "word": "schoolfellow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a day of the week when students go to school",
                    "vi": "một ngày trong tuần khi học sinh đến trường"
                },
                "examples": [
                    {
                        "en": "I get up very early on school days.",
                        "vi": "Tôi dậy rất sớm vào những ngày đi học."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the day that students spend at school",
                    "vi": "thời gian trong ngày của học sinh ở trường"
                },
                "examples": [
                    {
                        "en": "The school day ends at 3 p.m.",
                        "vi": "Ngày học kết thúc lúc 3 giờ chiều"
                    },
                    {
                        "en": "Her school day started with a spelling test.",
                        "vi": "Ngày học của cô bắt đầu bằng một bài kiểm tra chính tả."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period in your life when you go to school",
                    "vi": "giai đoạn trong cuộc đời bạn khi bạn đi học"
                },
                "examples": [
                    {
                        "en": "She hadn't seen Laura since her schooldays.",
                        "vi": "Cô đã không gặp Laura kể từ những ngày còn đi học."
                    },
                    {
                        "en": "Her schooldays had definitely not been the happiest days of her life.",
                        "vi": "Những ngày đi học của cô chắc chắn không phải là những ngày hạnh phúc nhất trong cuộc đời cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "e6ba23165b2a47a4b8273f40ed0e53b5",
        "word": "timetable",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈtaɪmteɪbl/",
            "us": "/ˈtaɪmteɪbl/"
        },
        "nearby": [
            {
                "word": "timestamp",
                "pos": "verb"
            },
            {
                "word": "time switch",
                "pos": "noun"
            },
            {
                "word": "timetable",
                "pos": "noun"
            },
            {
                "word": "timetable",
                "pos": "verb"
            },
            {
                "word": "timetabling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a chart showing the times at which trains, buses and planes leave and arrive",
                    "vi": "biểu đồ hiển thị thời gian tàu hỏa, xe buýt và máy bay khởi hành và đến nơi"
                },
                "examples": [
                    {
                        "en": "a bus/train timetable",
                        "vi": "lịch trình xe buýt / xe lửa"
                    },
                    {
                        "en": "It said in the timetable that a train was due at 11.30.",
                        "vi": "Trong lịch trình có ghi rằng một chuyến tàu sẽ đến lúc 11h30."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chart or plan of the classes that a student or teacher has in school each week",
                    "vi": "biểu đồ hoặc kế hoạch của các lớp học mà học sinh hoặc giáo viên có trong trường mỗi tuần"
                },
                "examples": [
                    {
                        "en": "We have a new timetable each term.",
                        "vi": "Chúng tôi có một thời gian biểu mới cho mỗi học kỳ."
                    },
                    {
                        "en": "a full timetable of teaching",
                        "vi": "một thời gian biểu đầy đủ của việc giảng dạy"
                    },
                    {
                        "en": "Sport is no longer so important in the school timetable (= all the subjects that are taught at schools).",
                        "vi": "Thể thao không còn quá quan trọng trong thời khóa biểu ở trường (= tất cả các môn học được dạy ở trường)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a plan of when you expect or hope particular events to happen",
                    "vi": "một kế hoạch về thời điểm bạn mong đợi hoặc hy vọng các sự kiện cụ thể sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "I have a busy timetable this week (= I have planned to do many things).",
                        "vi": "Tôi có một thời gian biểu bận rộn trong tuần này (= Tôi đã lên kế hoạch làm nhiều việc)."
                    },
                    {
                        "en": "The government has set out its timetable for the peace talks.",
                        "vi": "Chính phủ đã đề ra thời gian biểu cho các cuộc đàm phán hòa bình."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ce4594b64a14f3391ef29f31f068c2e",
        "word": "uniform",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈjuːnɪfɔːm/",
            "us": "/ˈjuːnɪfɔːrm/"
        },
        "nearby": [
            {
                "word": "unification",
                "pos": "noun"
            },
            {
                "word": "Unification Church",
                "pos": "noun"
            },
            {
                "word": "uniform",
                "pos": "noun"
            },
            {
                "word": "uniform",
                "pos": "adjective"
            },
            {
                "word": "uniformed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the special set of clothes worn by all members of an organization or a group at work, or by children at school",
                    "vi": "bộ quần áo đặc biệt được mặc bởi tất cả các thành viên của một tổ chức hoặc một nhóm tại nơi làm việc, hoặc bởi trẻ em ở trường"
                },
                "examples": [
                    {
                        "en": "The hat is part of the school uniform.",
                        "vi": "Mũ là một phần của đồng phục học sinh."
                    },
                    {
                        "en": "a military uniform",
                        "vi": "một bộ quân phục"
                    },
                    {
                        "en": "Do you have to wear uniform?",
                        "vi": "Bạn có phải mặc đồng phục không?"
                    },
                    {
                        "en": "in (a) uniform He was dressed in the uniform of a Royal Navy officer.",
                        "vi": "trong (a) quân phục Anh ta mặc quân phục của một sĩ quan Hải quân Hoàng gia."
                    },
                    {
                        "en": "soldiers in uniform",
                        "vi": "những người lính trong quân phục"
                    },
                    {
                        "en": "a police/nurse's uniform",
                        "vi": "đồng phục cảnh sát / y tá"
                    },
                    {
                        "en": "an army uniform",
                        "vi": "một bộ quân phục"
                    },
                    {
                        "en": "a soldier out of uniform",
                        "vi": "một người lính mặc quân phục"
                    },
                    {
                        "en": "the uniform of the Parachute Regiment",
                        "vi": "quân phục của Trung đoàn Nhảy dù"
                    },
                    {
                        "en": "He quickly put on his uniform.",
                        "vi": "Anh nhanh chóng mặc đồng phục vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "the clothes worn by the members of a sports team when they are playing",
                    "vi": "quần áo của các thành viên của một đội thể thao khi họ đang chơi"
                },
                "examples": [
                    {
                        "en": "a striped baseball uniform",
                        "vi": "một bộ đồng phục bóng chày sọc"
                    },
                    {
                        "en": "the team’s away uniform (= that they use when playing games away from home)",
                        "vi": "đồng phục sân khách của đội (= mà họ sử dụng khi chơi trò chơi xa nhà)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the type of clothes that a person or group usually wears",
                    "vi": "loại quần áo mà một người hoặc một nhóm thường mặc"
                },
                "examples": [
                    {
                        "en": "my standard teenage uniform of sweatshirt and jeans",
                        "vi": "đồng phục tuổi teen tiêu chuẩn của tôi gồm áo len và quần jean"
                    },
                    {
                        "en": "the traditional banker’s uniform",
                        "vi": "đồng phục ngân hàng truyền thống"
                    },
                    {
                        "en": "They wore the standard uniform of the American office worker.",
                        "vi": "Họ mặc đồng phục tiêu chuẩn của nhân viên văn phòng Mỹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc788010d0d545be94715fca6a341d4b",
        "word": "vacation",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/veɪˈkeɪʃn/",
            "us": "/veɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "vacant possession",
                "pos": "noun"
            },
            {
                "word": "vacate",
                "pos": "verb"
            },
            {
                "word": "vacation",
                "pos": "noun"
            },
            {
                "word": "vacation",
                "pos": "verb"
            },
            {
                "word": "vacationer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time spent travelling or resting away from home",
                    "vi": "một khoảng thời gian đi du lịch hoặc nghỉ ngơi xa nhà"
                },
                "examples": [
                    {
                        "en": "on vacation They're on vacation in Hawaii right now.",
                        "vi": "trong kỳ nghỉ Họ đang đi nghỉ ở Hawaii ngay bây giờ."
                    },
                    {
                        "en": "I'm going on vacation for a couple of weeks.",
                        "vi": "Tôi sẽ đi nghỉ trong một vài tuần."
                    },
                    {
                        "en": "You look tired—you should take a vacation.",
                        "vi": "Trông bạn có vẻ mệt mỏi — bạn nên đi nghỉ."
                    },
                    {
                        "en": "We're planning a summer vacation to Europe next year.",
                        "vi": "Chúng tôi đang lên kế hoạch cho một kỳ nghỉ hè đến Châu Âu vào năm tới."
                    },
                    {
                        "en": "I just got back from a family vacation in New Orleans.",
                        "vi": "Tôi vừa trở về sau kỳ nghỉ cùng gia đình ở New Orleans."
                    },
                    {
                        "en": "The job includes two weeks' paid vacation.",
                        "vi": "Công việc bao gồm hai tuần nghỉ phép có lương."
                    },
                    {
                        "en": "a vacation home",
                        "vi": "một nhà nghỉ"
                    },
                    {
                        "en": "He had a lot of unused vacation time.",
                        "vi": "Anh ấy đã có rất nhiều thời gian nghỉ phép không sử dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) one of the periods of time when universities or courts of law are closed; (in the US) one of the periods of time when schools, colleges, universities or courts of law are closed",
                    "vi": "(ở Anh) một trong những khoảng thời gian các trường đại học hoặc tòa án luật đóng cửa; (ở Hoa Kỳ) một trong những khoảng thời gian các trường học, cao đẳng, đại học hoặc tòa án đóng cửa"
                },
                "examples": [
                    {
                        "en": "the Christmas/Easter/summer vacation",
                        "vi": "Giáng sinh / Phục sinh / kỳ nghỉ hè"
                    },
                    {
                        "en": "(British English) the long vacation (= the summer vacation)",
                        "vi": "(Tiếng Anh Anh) kỳ nghỉ dài (= kỳ nghỉ hè)"
                    },
                    {
                        "en": "during/in the vacation I got a full-time job during the vacation.",
                        "vi": "trong / trong kỳ nghỉ Tôi đã nhận được một công việc toàn thời gian trong kỳ nghỉ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb98d472675c4b33a28d5f1d21399071",
        "word": "assignment",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈsaɪnmənt/",
            "us": "/əˈsaɪnmənt/"
        },
        "nearby": [
            {
                "word": "assign",
                "pos": "verb"
            },
            {
                "word": "assignation",
                "pos": "noun"
            },
            {
                "word": "assignment",
                "pos": "noun"
            },
            {
                "word": "assimilate",
                "pos": "verb"
            },
            {
                "word": "assimilation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a task or piece of work that somebody is given to do, usually as part of their job or studies",
                    "vi": "một nhiệm vụ hoặc một phần công việc mà ai đó được giao làm, thường là một phần của công việc hoặc nghiên cứu của họ"
                },
                "examples": [
                    {
                        "en": "Students are required to complete all homework assignments.",
                        "vi": "Học sinh được yêu cầu hoàn thành tất cả các bài tập về nhà."
                    },
                    {
                        "en": "You will need to complete three written assignments per semester.",
                        "vi": "Bạn sẽ cần phải hoàn thành ba bài tập viết trong mỗi học kỳ."
                    },
                    {
                        "en": "a business/special assignment",
                        "vi": "một công việc kinh doanh / nhiệm vụ đặc biệt"
                    },
                    {
                        "en": "I had set myself a tough assignment.",
                        "vi": "Tôi đã đặt cho mình một nhiệm vụ khó khăn."
                    },
                    {
                        "en": "on an assignment She is in Greece on an assignment for one of the Sunday newspapers.",
                        "vi": "về một nhiệm vụ Cô ấy đang ở Hy Lạp để thực hiện một nhiệm vụ cho một trong những tờ báo Chủ nhật."
                    },
                    {
                        "en": "on assignment one of our reporters on assignment in China",
                        "vi": "về nhiệm vụ một trong các phóng viên của chúng tôi đi công tác ở Trung Quốc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of giving something to somebody; the act of giving somebody a particular task",
                    "vi": "hành động đưa một cái gì đó cho ai đó; hành động giao cho ai đó một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "his assignment to other duties in the same company",
                        "vi": "sự phân công của anh ấy cho các nhiệm vụ khác trong cùng một công ty"
                    }
                ]
            }
        ]
    },
    {
        "id": "84f0ff396bbd41b48fa225aa27dfeb3e",
        "word": "bell",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/bel/",
            "us": "/bel/"
        },
        "nearby": [
            {
                "word": "Belize",
                "pos": ""
            },
            {
                "word": "Belizean",
                "pos": "noun, adjective"
            },
            {
                "word": "bell",
                "pos": "noun"
            },
            {
                "word": "Alexander Graham Bell",
                "pos": ""
            },
            {
                "word": "Bella",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hollow metal object, often like a cup in shape, that makes a ringing sound when hit by a small piece of metal inside it; the sound that it makes",
                    "vi": "một vật thể rỗng bằng kim loại, thường có hình dạng giống như một chiếc cốc, phát ra tiếng kêu khi bị một mảnh kim loại nhỏ bên trong va chạm; âm thanh mà nó tạo ra"
                },
                "examples": [
                    {
                        "en": "A peal of church bells rang out in the distance.",
                        "vi": "Một tràng chuông nhà thờ vang lên ở đằng xa."
                    },
                    {
                        "en": "a bicycle bell",
                        "vi": "chuông xe đạp"
                    },
                    {
                        "en": "His voice came down the line as clear as a bell.",
                        "vi": "Giọng anh xuống dây rõ ràng như tiếng chuông."
                    },
                    {
                        "en": "the bell of a trumpet (= the part at the end like a bell in shape)",
                        "vi": "chuông kèn (= phần ở cuối giống hình quả chuông)"
                    },
                    {
                        "en": "The church bells rang out.",
                        "vi": "Chuông nhà thờ vang lên."
                    },
                    {
                        "en": "a bell-shaped flower",
                        "vi": "một bông hoa hình chuông"
                    },
                    {
                        "en": "Off in the distance a bell tolled two in the morning.",
                        "vi": "Ở đằng xa, một tiếng chuông báo hai giờ sáng."
                    },
                    {
                        "en": "a bell tower",
                        "vi": "tháp chuông"
                    },
                    {
                        "en": "wedding bells",
                        "vi": "chuông đám cưới"
                    },
                    {
                        "en": "The dancers wore bells on their ankles.",
                        "vi": "Các vũ công đeo chuông trên mắt cá chân của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an electrical device which makes a ringing sound when a button on it is pushed; the sound that it makes, used as a signal or a warning",
                    "vi": "một thiết bị điện tạo ra âm thanh đổ chuông khi nhấn một nút trên thiết bị đó; âm thanh mà nó tạo ra, được sử dụng làm tín hiệu hoặc cảnh báo"
                },
                "examples": [
                    {
                        "en": "Ring the bell to see if they're in.",
                        "vi": "Rung chuông để xem họ có tham gia hay không."
                    },
                    {
                        "en": "The bell's ringing!",
                        "vi": "Chuông đang reo!"
                    },
                    {
                        "en": "The bell went for the end of the lesson.",
                        "vi": "Chuông báo hết giờ học."
                    },
                    {
                        "en": "An alarm bell went off.",
                        "vi": "Chuông báo thức đã vang lên."
                    },
                    {
                        "en": "(figurative) Warning bells started ringing in her head as she sensed that something was wrong.",
                        "vi": "(nghĩa bóng) Chuông cảnh báo bắt đầu vang lên trong đầu cô khi cô cảm thấy có điều gì đó không ổn."
                    },
                    {
                        "en": "(figurative) This decision is going to sound a warning bell to other couples.",
                        "vi": "(nghĩa bóng) Quyết định này sẽ gióng lên hồi chuông cảnh báo cho các cặp đôi khác."
                    },
                    {
                        "en": "Saved by the bell! (= a bell that signals the end of something) I thought I'd have to sit here listening to you two argue forever.",
                        "vi": "Được chuông lưu lại! (= tiếng chuông báo hiệu chuyện gì đó đã kết thúc) Tôi đã nghĩ mình sẽ phải ngồi đây nghe hai người tranh luận mãi mãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you say that alarm bells are ringing, you mean that people are starting to feel worried and to suspect that something is wrong",
                    "vi": "nếu bạn nói rằng chuông báo thức đang reo, bạn có nghĩa là mọi người bắt đầu cảm thấy lo lắng và nghi ngờ rằng có điều gì đó không ổn"
                },
                "examples": [
                    {
                        "en": "The government’s proposal has set alarm bells ringing for people on low incomes.",
                        "vi": "Đề xuất của chính phủ đã gióng lên hồi chuông cảnh báo đối với những người có thu nhập thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to call somebody by phone",
                    "vi": "gọi cho ai đó qua điện thoại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show that you do not believe what somebody has just said",
                    "vi": "được sử dụng để cho thấy rằng bạn không tin những gì ai đó vừa nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to sound familiar to you, as though you have heard it before",
                    "vi": "nghe quen thuộc với bạn, như thể bạn đã nghe nó trước đây"
                },
                "examples": [
                    {
                        "en": "His name rings a bell but I can't think where we met.",
                        "vi": "Tên của anh ấy vang lên nhưng tôi không thể nghĩ chúng tôi đã gặp nhau ở đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "in perfect condition",
                    "vi": "trong điều kiện hoàn hảo"
                },
                "examples": [
                    {
                        "en": "The doctor said I was as sound as a bell.",
                        "vi": "Bác sĩ nói tôi nhẹ như tiếng chuông."
                    }
                ]
            }
        ]
    },
    {
        "id": "e87afd25f20347bfb70cc6ce8c521117",
        "word": "classwork",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈklɑːswɜːk/",
            "us": "/ˈklæswɜːrk/"
        },
        "nearby": [
            {
                "word": "class warfare",
                "pos": "noun"
            },
            {
                "word": "class warrior",
                "pos": "noun"
            },
            {
                "word": "classwork",
                "pos": "noun"
            },
            {
                "word": "classy",
                "pos": "adjective"
            },
            {
                "word": "clatter",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work that students do at school rather than at home",
                    "vi": "công việc học sinh làm ở trường hơn là ở nhà"
                },
                "examples": [
                    {
                        "en": "When you have finished your classwork, you may read a book.",
                        "vi": "Khi bạn hoàn thành bài tập trên lớp, bạn có thể đọc một cuốn sách."
                    },
                    {
                        "en": "Schools should ensure that classwork is challenging and demanding.",
                        "vi": "Các trường học nên đảm bảo rằng bài tập trên lớp có nhiều thách thức và đòi hỏi cao."
                    },
                    {
                        "en": "Students do lessons and classwork online during a snow day.",
                        "vi": "Học sinh làm bài và làm bài tập trên lớp trực tuyến trong một ngày tuyết rơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "58bfc4a7c50f4600bf57af071a8c4f20",
        "word": "exchange",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪksˈtʃeɪndʒ/",
            "us": "/ɪksˈtʃeɪndʒ/"
        },
        "nearby": [
            {
                "word": "excessive",
                "pos": "adjective"
            },
            {
                "word": "excessively",
                "pos": "adverb"
            },
            {
                "word": "exchange",
                "pos": "noun"
            },
            {
                "word": "exchange",
                "pos": "verb"
            },
            {
                "word": "exchangeable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of giving something to somebody or doing something for somebody and receiving something in return",
                    "vi": "một hành động cho một cái gì đó cho ai đó hoặc làm một cái gì đó cho ai đó và nhận lại một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The exchange of prisoners took place this morning.",
                        "vi": "Việc trao đổi tù nhân diễn ra vào sáng nay."
                    },
                    {
                        "en": "We need to promote an open exchange of ideas and information.",
                        "vi": "Chúng ta cần thúc đẩy trao đổi ý kiến và thông tin cởi mở."
                    },
                    {
                        "en": "an exchange of glances/insults",
                        "vi": "trao đổi ánh nhìn / lăng mạ"
                    },
                    {
                        "en": "an exchange of fire (= between enemy soldiers)",
                        "vi": "trao đổi hỏa lực (= giữa binh lính đối phương)"
                    },
                    {
                        "en": "I buy you lunch and you fix my computer. Is that a fair exchange?",
                        "vi": "Tôi mua cho bạn bữa trưa và bạn sửa máy tính của tôi. Đó có phải là một cuộc trao đổi công bằng?"
                    },
                    {
                        "en": "in exchange for something Wool and timber were sent to Egypt in exchange for linen or papyrus.",
                        "vi": "đổi lấy một thứ gì đó Len và gỗ được gửi đến Ai Cập để đổi lấy vải lanh hoặc giấy cói."
                    },
                    {
                        "en": "in exchange I'll type your report if you'll babysit in exchange.",
                        "vi": "đổi lại, tôi sẽ nhập báo cáo của bạn nếu đổi lại bạn sẽ trông trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of changing an amount of one currency for an equal value of another",
                    "vi": "quá trình thay đổi một lượng tiền này thành một giá trị tương đương của một loại tiền tệ khác"
                },
                "examples": [
                    {
                        "en": "currency exchange facilities",
                        "vi": "cơ sở trao đổi tiền tệ"
                    },
                    {
                        "en": "Where can I find the best exchange rate/rate of exchange?",
                        "vi": "Tôi có thể tìm tỷ giá hối đoái / tỷ giá hối đoái tốt nhất ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement when two people or groups from different countries visit each other’s homes or do each other’s jobs for a short time",
                    "vi": "một sự sắp xếp khi hai người hoặc nhóm từ các quốc gia khác nhau đến thăm nhà của nhau hoặc làm công việc của nhau trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "exchange (with somebody/something) Our school does an exchange with a school in France.",
                        "vi": "trao đổi (với ai đó / cái gì đó) Trường chúng tôi thực hiện trao đổi với một trường ở Pháp."
                    },
                    {
                        "en": "trade and cultural exchanges with China",
                        "vi": "giao lưu thương mại và văn hóa với Trung Quốc"
                    },
                    {
                        "en": "on an exchange Nick went on the French exchange.",
                        "vi": "trong một cuộc trao đổi Nick đã tham gia vào cuộc trao đổi tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a conversation or an argument",
                    "vi": "một cuộc trò chuyện hoặc một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "There was only time for a brief exchange.",
                        "vi": "Chỉ có thời gian cho một cuộc trao đổi ngắn."
                    },
                    {
                        "en": "exchange with somebody The prime minister was involved in a heated exchange with Opposition MPs.",
                        "vi": "trao đổi với ai đó Thủ tướng đã tham gia vào một cuộc trao đổi sôi nổi với các nghị sĩ đối lập."
                    },
                    {
                        "en": "exchange between A and B There was an angry exchange between the two players.",
                        "vi": "trao đổi giữa A và B Đã có một cuộc trao đổi giận dữ giữa hai người chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building where business people met in the past to buy and sell a particular type of goods",
                    "vi": "một tòa nhà nơi những người kinh doanh gặp nhau trong quá khứ để mua và bán một loại hàng hóa cụ thể"
                },
                "examples": [
                    {
                        "en": "the old Corn Exchange",
                        "vi": "trao đổi ngô cũ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where phone calls are connected so that people can speak to each other",
                    "vi": "nơi kết nối các cuộc gọi điện thoại để mọi người có thể nói chuyện với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c93eac213dc14e1c869509b4124b231b",
        "word": "semester",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/sɪˈmestə(r)/",
            "us": "/sɪˈmestər/"
        },
        "nearby": [
            {
                "word": "sememe",
                "pos": "noun"
            },
            {
                "word": "semen",
                "pos": "noun"
            },
            {
                "word": "semester",
                "pos": "noun"
            },
            {
                "word": "semi",
                "pos": "noun"
            },
            {
                "word": "semi-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the two periods that the school or college year is divided into",
                    "vi": "một trong hai giai đoạn mà năm học hoặc đại học được chia thành"
                },
                "examples": [
                    {
                        "en": "the spring/fall semester",
                        "vi": "học kỳ mùa xuân / mùa thu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d8ae3b95492147b8bfb7fd376ef2162f",
        "word": "sports day",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈspɔːts deɪ/",
            "us": "/ˈspɔːrts deɪ/"
        },
        "nearby": [
            {
                "word": "sportscaster",
                "pos": "noun"
            },
            {
                "word": "sports centre",
                "pos": "noun"
            },
            {
                "word": "sports day",
                "pos": "noun"
            },
            {
                "word": "sports drink",
                "pos": "noun"
            },
            {
                "word": "Sports Illustrated",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special day at school when there are no classes and children compete in sports events",
                    "vi": "một ngày đặc biệt ở trường khi không có lớp học và trẻ em thi đấu trong các sự kiện thể thao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bc5fb8f221f941bda8e4e93f69fc4c60",
        "word": "term",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tɜːm/",
            "us": "/tɜːrm/"
        },
        "nearby": [
            {
                "word": "teriyaki",
                "pos": "noun"
            },
            {
                "word": "'Studs' Terkel",
                "pos": ""
            },
            {
                "word": "term",
                "pos": "noun"
            },
            {
                "word": "term",
                "pos": "verb"
            },
            {
                "word": "termagant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or phrase used as the name of something, especially one connected with a particular type of language",
                    "vi": "một từ hoặc cụm từ được sử dụng làm tên của điều gì đó, đặc biệt là từ hoặc cụm từ được kết nối với một loại ngôn ngữ cụ thể"
                },
                "examples": [
                    {
                        "en": "a technical/legal/generic term",
                        "vi": "một thuật ngữ kỹ thuật / pháp lý / chung chung"
                    },
                    {
                        "en": "a glossary of terms",
                        "vi": "bảng chú giải thuật ngữ"
                    },
                    {
                        "en": "a term of abuse",
                        "vi": "một điều khoản lạm dụng"
                    },
                    {
                        "en": "What is the meaning of the term ‘globalization’?",
                        "vi": "Ý nghĩa của thuật ngữ 'toàn cầu hóa' là gì?"
                    },
                    {
                        "en": "William Gibson coined the term (= invented the term) ‘cyberspace’ in 1984.",
                        "vi": "William Gibson đã đặt ra thuật ngữ (= phát minh ra thuật ngữ) 'không gian mạng' vào năm 1984."
                    },
                    {
                        "en": "term for something ‘Old man’ is a slang term for ‘father’.",
                        "vi": "thuật ngữ cho một cái gì đó 'Ông già' là một thuật ngữ tiếng lóng chỉ \"cha\"."
                    },
                    {
                        "en": "The term ‘Generation X’ refers to the people born in the 1950s and 1960s.",
                        "vi": "Thuật ngữ 'Thế hệ X' dùng để chỉ những người sinh trong những năm 1950 và 1960."
                    },
                    {
                        "en": "‘Register’ is the term commonly used to describe different levels of formality in language.",
                        "vi": "Đăng ký' là thuật ngữ thường được sử dụng để mô tả các mức độ khác nhau của hình thức trong ngôn ngữ."
                    },
                    {
                        "en": "I would describe myself, for want of a better term, as a nerd.",
                        "vi": "Tôi muốn mô tả bản thân mình, vì muốn có một thuật ngữ tốt hơn, như một kẻ mọt sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "(especially in the UK) one of the three periods in the year during which classes are held in schools, universities, etc.",
                    "vi": "(đặc biệt là ở Vương quốc Anh) một trong ba kỳ trong năm mà các lớp học được tổ chức ở các trường học, trường đại học, v.v."
                },
                "examples": [
                    {
                        "en": "the spring/summer/autumn/fall term",
                        "vi": "học kỳ mùa xuân / mùa hè / mùa thu / mùa thu"
                    },
                    {
                        "en": "during term Many students now have paid employment during term.",
                        "vi": "trong học kỳ Nhiều sinh viên hiện đã có việc làm được trả lương trong học kỳ."
                    },
                    {
                        "en": "(British English) It's nearly the end of term.",
                        "vi": "(Anh Anh) Sắp hết kỳ rồi."
                    },
                    {
                        "en": "(North American English) It's nearly the end of the term.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Đã gần hết thời hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time for which something lasts; a fixed or limited time",
                    "vi": "một khoảng thời gian mà một cái gì đó kéo dài; thời gian cố định hoặc giới hạn"
                },
                "examples": [
                    {
                        "en": "during the president’s first term of/in office",
                        "vi": "trong nhiệm kỳ đầu tiên của tổng thống"
                    },
                    {
                        "en": "term as something a term as president/mayor/governor/prime minister",
                        "vi": "nhiệm kỳ như một cái gì đó một nhiệm kỳ như tổng thống / thị trưởng / thống đốc / thủ tướng"
                    },
                    {
                        "en": "term of something He was sentenced to a prison/jail term of 25 years for the offence.",
                        "vi": "thời hạn của điều gì đó Anh ta đã bị kết án tù giam / 25 năm tù cho tội phạm."
                    },
                    {
                        "en": "She served a five-year term of imprisonment.",
                        "vi": "Cô ấy đã bị phạt tù 5 năm."
                    },
                    {
                        "en": "The contract was for a fixed term of five years.",
                        "vi": "Hợp đồng có thời hạn cố định là 5 năm."
                    },
                    {
                        "en": "to extend the term of a loan",
                        "vi": "để kéo dài thời hạn của một khoản vay"
                    },
                    {
                        "en": "His presidential term expires at the end of May.",
                        "vi": "Nhiệm kỳ tổng thống của ông sẽ hết hạn vào cuối tháng Năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the end of a particular period of time, especially one for which something is expected to last",
                    "vi": "sự kết thúc của một khoảng thời gian cụ thể, đặc biệt là một khoảng thời gian mà điều gì đó dự kiến sẽ kéo dài"
                },
                "examples": [
                    {
                        "en": "His life had reached its natural term.",
                        "vi": "Cuộc sống của ông đã đạt đến thời hạn tự nhiên của nó."
                    },
                    {
                        "en": "This view of the economy is approaching its term (= it will soon be old-fashioned).",
                        "vi": "Quan điểm về nền kinh tế này đang đến gần thời hạn của nó (= nó sẽ sớm lỗi thời)."
                    },
                    {
                        "en": "(medical) The pregnancy went to full term (= lasted the normal length of time).",
                        "vi": "(y tế) Thai đã đủ tháng (= kéo dài khoảng thời gian bình thường)."
                    },
                    {
                        "en": "Her baby was born at term.",
                        "vi": "Con cô sinh đủ tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "each of the various parts in a series, an equation, etc.",
                    "vi": "mỗi phần khác nhau trong một chuỗi, một phương trình, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe what will happen a long, short, etc. time in the future",
                    "vi": "được sử dụng để mô tả những gì sẽ xảy ra trong thời gian dài, ngắn, v.v. trong tương lai"
                },
                "examples": [
                    {
                        "en": "Such a development seems unlikely, at least in the short term (= it will not happen for quite a long time).",
                        "vi": "Một sự phát triển như vậy có vẻ khó xảy ra, ít nhất là trong ngắn hạn (= nó sẽ không xảy ra trong một thời gian khá dài)."
                    },
                    {
                        "en": "In the longer term, children of depressed mothers are more likely to suffer from childhood depression.",
                        "vi": "Về lâu dài, con của những bà mẹ trầm cảm dễ bị trầm cảm ở tuổi thơ."
                    },
                    {
                        "en": "In the long term, our efforts will pay off.",
                        "vi": "Về lâu dài, nỗ lực của chúng tôi sẽ được đền đáp."
                    }
                ]
            }
        ]
    },
    {
        "id": "1a2b43bd6ceb4636860b491e41a37997",
        "word": "discipline",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɪsəplɪn/",
            "us": "/ˈdɪsəplɪn/"
        },
        "nearby": [
            {
                "word": "disciplinarian",
                "pos": "noun"
            },
            {
                "word": "disciplinary",
                "pos": "adjective"
            },
            {
                "word": "discipline",
                "pos": "noun"
            },
            {
                "word": "discipline",
                "pos": "verb"
            },
            {
                "word": "disciplined",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of training people to obey rules and orders and punishing them if they do not; the controlled behaviour or situation that is the result of this training",
                    "vi": "thực hành huấn luyện mọi người tuân theo các quy tắc và mệnh lệnh và trừng phạt họ nếu họ không làm; hành vi hoặc tình huống được kiểm soát là kết quả của khóa đào tạo này"
                },
                "examples": [
                    {
                        "en": "The school has a reputation for high standards of discipline.",
                        "vi": "Trường nổi tiếng về tiêu chuẩn kỷ luật cao."
                    },
                    {
                        "en": "Strict discipline is imposed on army recruits.",
                        "vi": "Kỷ luật nghiêm minh được áp dụng đối với các tân binh."
                    },
                    {
                        "en": "harsh/rigorous/rigid/iron discipline",
                        "vi": "kỷ luật khắc nghiệt / nghiêm khắc / cứng nhắc / sắt đá"
                    },
                    {
                        "en": "She keeps good discipline in class.",
                        "vi": "Cô ấy giữ kỉ luật tốt trong lớp."
                    },
                    {
                        "en": "to instill/enforce/impose/maintain discipline",
                        "vi": "thấm nhuần / thực thi / áp đặt / duy trì kỷ luật"
                    },
                    {
                        "en": "Lack of discipline at home meant that many pupils found it difficult to settle in to the ordered environment of the school.",
                        "vi": "Thiếu kỷ luật ở nhà có nghĩa là nhiều học sinh khó hòa nhập với môi trường trật tự của trường học."
                    },
                    {
                        "en": "a serious breach of discipline",
                        "vi": "vi phạm kỷ luật nghiêm trọng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a method of training your mind or body or of controlling your behaviour; an area of activity where this is necessary",
                    "vi": "một phương pháp rèn luyện tâm trí hoặc cơ thể của bạn hoặc kiểm soát hành vi của bạn; một lĩnh vực hoạt động mà điều này là cần thiết"
                },
                "examples": [
                    {
                        "en": "Yoga is a good discipline for learning to relax.",
                        "vi": "Yoga là một bộ môn tốt để học cách thư giãn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to control your behaviour or the way you live, work, etc.",
                    "vi": "khả năng kiểm soát hành vi của bạn hoặc cách bạn sống, làm việc, v.v."
                },
                "examples": [
                    {
                        "en": "He'll never get anywhere working for himself—he's got no discipline.",
                        "vi": "Anh ta sẽ không bao giờ đi đến đâu để làm việc cho chính mình - anh ta không có kỷ luật."
                    },
                    {
                        "en": "Her determination and discipline were admirable.",
                        "vi": "Sự quyết tâm và kỷ luật của cô ấy thật đáng khâm phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of knowledge; a subject that people study or are taught, especially in a university",
                    "vi": "một lĩnh vực kiến thức; một chủ đề mà mọi người nghiên cứu hoặc được giảng dạy, đặc biệt là trong trường đại học"
                },
                "examples": [
                    {
                        "en": "The new recruits were drawn from a range of academic disciplines.",
                        "vi": "Các tân binh được thu hút từ một loạt các ngành học."
                    }
                ]
            }
        ]
    },
    {
        "id": "7b0f023182e64f50a4b252515da6e048",
        "word": "discipline",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdɪsəplɪn/",
            "us": "/ˈdɪsəplɪn/"
        },
        "nearby": [
            {
                "word": "disciplinary",
                "pos": "adjective"
            },
            {
                "word": "discipline",
                "pos": "noun"
            },
            {
                "word": "discipline",
                "pos": "verb"
            },
            {
                "word": "disciplined",
                "pos": "adjective"
            },
            {
                "word": "disc jockey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to punish somebody for something they have done",
                    "vi": "trừng phạt ai đó vì điều gì đó họ đã làm"
                },
                "examples": [
                    {
                        "en": "The officers were disciplined for using racist language.",
                        "vi": "Các sĩ quan đã bị kỷ luật vì sử dụng ngôn ngữ phân biệt chủng tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to train somebody, especially a child, to obey particular rules and control the way they behave",
                    "vi": "để huấn luyện ai đó, đặc biệt là một đứa trẻ, tuân theo các quy tắc cụ thể và kiểm soát cách họ cư xử"
                },
                "examples": [
                    {
                        "en": "a guide to the best ways of disciplining your child",
                        "vi": "hướng dẫn về những cách tốt nhất để kỷ luật con bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to control the way you behave and make yourself do things that you believe you should do",
                    "vi": "để kiểm soát cách bạn cư xử và khiến bản thân làm những điều mà bạn tin rằng bạn nên làm"
                },
                "examples": [
                    {
                        "en": "discipline yourself Dieting is a matter of disciplining yourself.",
                        "vi": "kỷ luật bản thân Ăn kiêng là vấn đề kỷ luật bản thân."
                    },
                    {
                        "en": "discipline yourself to do something He disciplined himself to exercise at least three times a week.",
                        "vi": "kỷ luật bản thân để làm điều gì đó Anh ấy kỷ luật bản thân để tập thể dục ít nhất ba lần một tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "bffefff4dbb546bdb63e6a13901f433e",
        "word": "exercise book",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeksəsaɪz bʊk/",
            "us": "/ˈeksərsaɪz bʊk/"
        },
        "nearby": [
            {
                "word": "exercise ball",
                "pos": "noun"
            },
            {
                "word": "exercise bike",
                "pos": "noun"
            },
            {
                "word": "exercise book",
                "pos": "noun"
            },
            {
                "word": "exert",
                "pos": "verb"
            },
            {
                "word": "exertion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small book for students to write their work in",
                    "vi": "một cuốn sách nhỏ cho học sinh viết bài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a book with exercises in it, often with spaces for students to write answers in, to help them practise what they have learnt",
                    "vi": "một cuốn sách có các bài tập trong đó, thường có khoảng trống để học sinh viết câu trả lời, nhằm giúp các em thực hành những gì đã học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a66c8e87f4944709199deedf7b674bc",
        "word": "multiple-choice",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌmʌltɪpl ˈtʃɔɪs/",
            "us": "/ˌmʌltɪpl ˈtʃɔɪs/"
        },
        "nearby": [
            {
                "word": "multiple",
                "pos": "adjective"
            },
            {
                "word": "multiple",
                "pos": "noun"
            },
            {
                "word": "multiple-choice",
                "pos": "adjective"
            },
            {
                "word": "multiple personality disorder",
                "pos": "noun"
            },
            {
                "word": "multiple sclerosis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing several possible answers from which you must choose the correct one",
                    "vi": "hiển thị một số câu trả lời có thể có mà từ đó bạn phải chọn câu trả lời đúng"
                },
                "examples": [
                    {
                        "en": "a test with multiple choice questions",
                        "vi": "một bài kiểm tra với các câu hỏi trắc nghiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "57c8c107fd114213ad90f04367678ea6",
        "word": "period",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpɪəriəd/",
            "us": "/ˈpɪriəd/"
        },
        "nearby": [
            {
                "word": "perinatal",
                "pos": "adjective"
            },
            {
                "word": "perineum",
                "pos": "noun"
            },
            {
                "word": "period",
                "pos": "noun"
            },
            {
                "word": "period",
                "pos": "adverb"
            },
            {
                "word": "period",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a particular length of time",
                    "vi": "một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "a long/an extended period",
                        "vi": "một thời gian dài / kéo dài"
                    },
                    {
                        "en": "a short/brief period",
                        "vi": "một khoảng thời gian ngắn / ngắn ngủi"
                    },
                    {
                        "en": "period of something a period of transition/uncertainty/expansion",
                        "vi": "thời kỳ của một cái gì đó một thời kỳ chuyển đổi / không chắc chắn / mở rộng"
                    },
                    {
                        "en": "a period of two years/six months/four weeks",
                        "vi": "khoảng thời gian hai năm / sáu tháng / bốn tuần"
                    },
                    {
                        "en": "a two-year/six-month/four-week period",
                        "vi": "khoảng thời gian hai năm / sáu tháng / bốn tuần"
                    },
                    {
                        "en": "All these changes happened over a period of time.",
                        "vi": "Tất cả những thay đổi này đã xảy ra trong một khoảng thời gian."
                    },
                    {
                        "en": "A year-to-year lease has no fixed time period.",
                        "vi": "Hợp đồng thuê hàng năm không có thời gian cố định."
                    },
                    {
                        "en": "for a period The offer is available for a limited period only.",
                        "vi": "trong một khoảng thời gian Ưu đãi chỉ có sẵn trong một khoảng thời gian giới hạn."
                    },
                    {
                        "en": "This compares with a 4% increase for the same period last year.",
                        "vi": "Con số này so với mức tăng 4% của cùng kỳ năm ngoái."
                    },
                    {
                        "en": "The project will run for a six-month trial period.",
                        "vi": "Dự án sẽ chạy trong thời gian thử nghiệm sáu tháng."
                    },
                    {
                        "en": "over a period The hall will be closed over a 2-year period.",
                        "vi": "trong một thời gian Hội trường sẽ đóng cửa trong khoảng thời gian 2 năm."
                    },
                    {
                        "en": "during a period We know little of her life during that period.",
                        "vi": "trong một thời kỳ Chúng ta biết rất ít về cuộc đời của cô ấy trong thời kỳ đó."
                    },
                    {
                        "en": "The aim is to reduce traffic at peak periods.",
                        "vi": "Mục đích là để giảm lượng truy cập vào thời gian cao điểm."
                    },
                    {
                        "en": "Tomorrow will be cold with sunny periods.",
                        "vi": "Ngày mai trời se lạnh, có nắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a length of time in the life of a particular person or in the history of a particular country",
                    "vi": "một khoảng thời gian trong cuộc đời của một người cụ thể hoặc trong lịch sử của một quốc gia cụ thể"
                },
                "examples": [
                    {
                        "en": "Which period of history would you most like to have lived in?",
                        "vi": "Bạn muốn sống trong giai đoạn lịch sử nào nhất?"
                    },
                    {
                        "en": "This textbook covers the post-war period.",
                        "vi": "Cuốn sách giáo khoa này bao gồm thời kỳ sau chiến tranh."
                    },
                    {
                        "en": "The church dates from the Norman period.",
                        "vi": "Nhà thờ có từ thời Norman."
                    },
                    {
                        "en": "We are currently studying the early medieval period.",
                        "vi": "Chúng tôi hiện đang nghiên cứu về thời kỳ đầu thời trung cổ."
                    },
                    {
                        "en": "Like Picasso, she too had a blue period.",
                        "vi": "Giống như Picasso, cô ấy cũng có một thời kỳ xanh."
                    },
                    {
                        "en": "Most teenagers go through a period of rebelling.",
                        "vi": "Hầu hết thanh thiếu niên đều trải qua giai đoạn nổi loạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a length of time which is a division of an era. A period is divided into epochs.",
                    "vi": "một khoảng thời gian là sự phân chia của một thời đại. Một thời kỳ được chia thành các kỷ nguyên."
                },
                "examples": [
                    {
                        "en": "the Jurassic period",
                        "vi": "kỷ Jura"
                    },
                    {
                        "en": "Dinosaurs died out during the Cretaceous period.",
                        "vi": "Khủng long đã chết trong kỷ Phấn trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the parts that a day is divided into at a school, college, etc. for study",
                    "vi": "bất kỳ phần nào trong một ngày được chia thành ở trường học, trường cao đẳng, v.v. để học"
                },
                "examples": [
                    {
                        "en": "‘What do you have next period?’ ‘French.’",
                        "vi": "Bạn có kinh tiếp theo là gì?' 'Người Pháp.'"
                    },
                    {
                        "en": "a free/study period (= for private study)",
                        "vi": "một khoảng thời gian học tập / miễn phí (= dành cho nghiên cứu riêng tư)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the flow of blood each month from the body of a woman who is not pregnant",
                    "vi": "dòng chảy của máu mỗi tháng từ cơ thể của một người phụ nữ không mang thai"
                },
                "examples": [
                    {
                        "en": "period pains",
                        "vi": "đau kinh nguyệt"
                    },
                    {
                        "en": "monthly periods",
                        "vi": "chu kỳ hàng tháng"
                    },
                    {
                        "en": "When did you last have a period?",
                        "vi": "Lần gần đây nhất bạn có kinh là khi nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mark ( . ) used at the end of a sentence and in some abbreviations, for example e.g.",
                    "vi": "dấu (.) được sử dụng ở cuối câu và trong một số từ viết tắt, ví dụ như"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d652cb1e45fc4e6a8f55d0d1b8c55ed2",
        "word": "playtime",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpleɪtaɪm/",
            "us": "/ˈpleɪtaɪm/"
        },
        "nearby": [
            {
                "word": "Playtex",
                "pos": ""
            },
            {
                "word": "plaything",
                "pos": "noun"
            },
            {
                "word": "playtime",
                "pos": "noun"
            },
            {
                "word": "play up",
                "pos": "phrasal verb"
            },
            {
                "word": "play upon",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a time at school when teaching stops for a short time and children can play",
                    "vi": "thời gian ở trường khi việc giảng dạy dừng lại trong một thời gian ngắn và trẻ em có thể chơi"
                },
                "examples": [
                    {
                        "en": "The children always go outside at playtime.",
                        "vi": "Những đứa trẻ luôn đi ra ngoài vào giờ chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a time for playing and having fun",
                    "vi": "một thời gian để chơi và vui vẻ"
                },
                "examples": [
                    {
                        "en": "With so much homework to do, her playtime is now very limited.",
                        "vi": "Với rất nhiều bài tập về nhà phải làm, thời gian chơi của cô ấy giờ rất hạn chế."
                    }
                ]
            }
        ]
    },
    {
        "id": "f11f7d8b365b4c11a12ee9f6d34d5698",
        "word": "prize-giving",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpraɪz ɡɪvɪŋ/",
            "us": "/ˈpraɪz ɡɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "prizefighter",
                "pos": "noun"
            },
            {
                "word": "prizefighting",
                "pos": "noun"
            },
            {
                "word": "prize-giving",
                "pos": "noun"
            },
            {
                "word": "prizewinner",
                "pos": "noun"
            },
            {
                "word": "prizewinning",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony at which prizes are given to people who have done very good work",
                    "vi": "một buổi lễ trao giải thưởng cho những người đã làm việc rất tốt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b638bb196de94323947f251359adcf55",
        "word": "prom",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/prɒm/",
            "us": "/prɑːm/"
        },
        "nearby": [
            {
                "word": "prolongation",
                "pos": "noun"
            },
            {
                "word": "prolonged",
                "pos": "adjective"
            },
            {
                "word": "prom",
                "pos": "noun"
            },
            {
                "word": "promenade",
                "pos": "noun"
            },
            {
                "word": "promenade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the US) a formal dance, especially one that is held at a high school",
                    "vi": "(đặc biệt là ở Mỹ) một buổi khiêu vũ trang trọng, đặc biệt là một buổi khiêu vũ được tổ chức tại một trường trung học"
                },
                "examples": [
                    {
                        "en": "the senior prom",
                        "vi": "buổi dạ hội cấp cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "a promenade (= a public place for walking, usually a wide path next to the sea)",
                    "vi": "một lối đi dạo (= một nơi công cộng để đi bộ, thường là một con đường rộng bên cạnh biển)"
                },
                "examples": [
                    {
                        "en": "to walk along the prom",
                        "vi": "đi bộ dọc theo vũ hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "a concert at which many of the audience stand up or sit on the floor",
                    "vi": "một buổi hòa nhạc mà tại đó nhiều khán giả đứng lên hoặc ngồi trên sàn"
                },
                "examples": [
                    {
                        "en": "the last night of the proms",
                        "vi": "đêm cuối cùng của proms"
                    }
                ]
            }
        ]
    },
    {
        "id": "c8bf288c1f14449aae3acba8e3b739d0",
        "word": "register",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈredʒɪstə(r)/",
            "us": "/ˈredʒɪstər/"
        },
        "nearby": [
            {
                "word": "regional member",
                "pos": ""
            },
            {
                "word": "register",
                "pos": "verb"
            },
            {
                "word": "register",
                "pos": "noun"
            },
            {
                "word": "registered mail",
                "pos": "noun"
            },
            {
                "word": "registered nurse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official list or record of names, items, etc.; a book that contains such a list",
                    "vi": "một danh sách hoặc hồ sơ chính thức về tên, mục, v.v.; một cuốn sách có chứa một danh sách như vậy"
                },
                "examples": [
                    {
                        "en": "The bride and groom signed the register.",
                        "vi": "Cô dâu và chú rể ký tên vào sổ đăng ký."
                    },
                    {
                        "en": "Could you sign the hotel register please, sir?",
                        "vi": "Xin ông vui lòng ký vào sổ đăng ký khách sạn?"
                    },
                    {
                        "en": "register of somebody/something They keep a register of all those who have contributed to the fund.",
                        "vi": "sổ đăng ký của ai đó / cái gì đó Họ giữ sổ đăng ký của tất cả những người đã đóng góp vào quỹ."
                    },
                    {
                        "en": "on a register to be on the register of electors",
                        "vi": "trên sổ đăng ký để có mặt trong sổ đăng ký cử tri"
                    },
                    {
                        "en": "in a register an entry in a register",
                        "vi": "trong sổ đăng ký một mục nhập trong sổ đăng ký"
                    },
                    {
                        "en": "Income information will also appear in the register.",
                        "vi": "Thông tin thu nhập cũng sẽ xuất hiện trong sổ đăng ký."
                    },
                    {
                        "en": "(British English) The teacher took the register (= checked who was present at school).",
                        "vi": "(Tiếng Anh Anh) Giáo viên lấy sổ đăng ký (= kiểm tra xem ai có mặt ở trường)."
                    },
                    {
                        "en": "(British English) Dr Shaw was struck off the medical register for misconduct.",
                        "vi": "(Anh Anh) Bác sĩ Shaw đã bị gạch tên khỏi sổ đăng ký y tế vì hành vi sai trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "the range, or part of a range, of a human voice or a musical instrument",
                    "vi": "phạm vi, hoặc một phần của phạm vi, của giọng người hoặc nhạc cụ"
                },
                "examples": [
                    {
                        "en": "in the upper/middle/lower register",
                        "vi": "trong thanh ghi trên / giữa / dưới"
                    }
                ]
            },
            {
                "define": {
                    "en": "the level and style of a piece of writing or speech, that is usually appropriate to the situation that it is used in",
                    "vi": "mức độ và phong cách của một bài viết hoặc bài phát biểu, thường phù hợp với tình huống mà nó được sử dụng"
                },
                "examples": [
                    {
                        "en": "The essay suddenly switches from a formal to an informal register.",
                        "vi": "Bài luận đột ngột chuyển từ một bài chính thức sang một bài đăng ký không chính thức."
                    },
                    {
                        "en": "He has adopted an informal register so as not to alienate his audience.",
                        "vi": "Anh ấy đã thông qua một sổ đăng ký không chính thức để không xa lánh khán giả của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening, with a cover that you can have open or shut, that allows hot or cold air from a heating or cooling system into a room",
                    "vi": "một lỗ mở, với một nắp mà bạn có thể mở hoặc đóng, cho phép không khí nóng hoặc lạnh từ hệ thống sưởi hoặc làm mát vào phòng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a machine used in shops, restaurants, etc. for keeping money in, and that shows and records the amount of money received for each thing that is sold",
                    "vi": "một máy được sử dụng trong các cửa hàng, nhà hàng, v.v. để giữ tiền và hiển thị và ghi lại số tiền nhận được cho mỗi thứ được bán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "765520fc73044cd9a72e61ebf6d686d7",
        "word": "term time",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtɜːm taɪm/",
            "us": "/ˈtɜːrm taɪm/"
        },
        "nearby": [
            {
                "word": "terms",
                "pos": "noun"
            },
            {
                "word": "terms of reference",
                "pos": "noun"
            },
            {
                "word": "term time",
                "pos": "noun"
            },
            {
                "word": "term-time",
                "pos": "adjective"
            },
            {
                "word": "tern",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the period of time when classes are held at a school, college, or university, as opposed to the holidays",
                    "vi": "khoảng thời gian mà các lớp học được tổ chức tại một trường học, trường cao đẳng hoặc đại học, trái ngược với các ngày lễ"
                },
                "examples": [
                    {
                        "en": "I never went out in the evenings during term time.",
                        "vi": "Tôi không bao giờ đi ra ngoài vào buổi tối trong thời gian học kỳ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd7e836cc6e447bb9582809f13c46e76",
        "word": "textbook",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtekstbʊk/",
            "us": "/ˈtekstbʊk/"
        },
        "nearby": [
            {
                "word": "text",
                "pos": "noun"
            },
            {
                "word": "text",
                "pos": "verb"
            },
            {
                "word": "textbook",
                "pos": "noun"
            },
            {
                "word": "textbook",
                "pos": "adjective"
            },
            {
                "word": "text editor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book that teaches a particular subject and that is used especially in schools and colleges",
                    "vi": "một cuốn sách dạy một chủ đề cụ thể và được sử dụng đặc biệt trong các trường học và cao đẳng"
                },
                "examples": [
                    {
                        "en": "a school/medical/history textbook",
                        "vi": "sách giáo khoa về trường học / y tế / lịch sử"
                    }
                ]
            }
        ]
    },
    {
        "id": "e44bf5024b0f4b70aa729e49e7b31cea",
        "word": "assembly",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈsembli/",
            "us": "/əˈsembli/"
        },
        "nearby": [
            {
                "word": "assembler",
                "pos": "noun"
            },
            {
                "word": "Assemblies of God",
                "pos": "noun"
            },
            {
                "word": "assembly",
                "pos": "noun"
            },
            {
                "word": "assembly language",
                "pos": "noun"
            },
            {
                "word": "assembly line",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who have been elected to meet together regularly and make decisions or laws for a particular region or country",
                    "vi": "một nhóm người đã được bầu để họp cùng nhau thường xuyên và đưa ra quyết định hoặc luật cho một khu vực hoặc quốc gia cụ thể"
                },
                "examples": [
                    {
                        "en": "state/legislative/federal/local assemblies",
                        "vi": "hội đồng tiểu bang / lập pháp / liên bang / địa phương"
                    },
                    {
                        "en": "Power has been handed over to provincial and regional assemblies.",
                        "vi": "Điện đã được bàn giao cho các tổ hợp tỉnh và khu vực."
                    },
                    {
                        "en": "The national assembly has voted to adopt the budget.",
                        "vi": "Quốc hội đã biểu quyết thông qua ngân sách này."
                    },
                    {
                        "en": "the California Assembly",
                        "vi": "hội đồng California"
                    },
                    {
                        "en": "the UN General Assembly",
                        "vi": "Đại hội đồng LHQ"
                    },
                    {
                        "en": "assembly elections",
                        "vi": "bầu cử hội đồng"
                    },
                    {
                        "en": "an elected assembly",
                        "vi": "một hội đồng được bầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the meeting together of a group of people for a particular purpose; a group of people who meet together for a particular purpose",
                    "vi": "cuộc họp cùng nhau của một nhóm người vì một mục đích cụ thể; một nhóm người gặp nhau vì một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "They were fighting for freedom of speech and freedom of assembly.",
                        "vi": "Họ đã đấu tranh cho tự do ngôn luận và tự do hội họp."
                    },
                    {
                        "en": "He was to address a public assembly on the issue.",
                        "vi": "Anh ấy đã phát biểu trước một hội đồng công khai về vấn đề này."
                    },
                    {
                        "en": "an assembly point (= a place where people have been asked to meet)",
                        "vi": "một điểm tập hợp (= một nơi mà mọi người đã được yêu cầu gặp gỡ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a meeting of the teachers and students in a school, usually at the start of the day, to give information, discuss school events or say prayers together",
                    "vi": "một cuộc họp của giáo viên và học sinh trong một trường học, thường là vào đầu ngày, để cung cấp thông tin, thảo luận về các sự kiện của trường hoặc cùng nhau cầu nguyện"
                },
                "examples": [
                    {
                        "en": "The deputy head was taking (= leading) school assembly that day.",
                        "vi": "Ngày hôm đó, phó hiệu trưởng đang tham gia (= lãnh đạo) buổi họp của trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of putting together the parts of something such as a vehicle or piece of furniture",
                    "vi": "quá trình ghép các bộ phận của một thứ gì đó như xe cộ hoặc đồ đạc lại với nhau"
                },
                "examples": [
                    {
                        "en": "Putting the bookcase together should be a simple assembly job.",
                        "vi": "Đặt tủ sách lại với nhau nên là một công việc lắp ráp đơn giản."
                    },
                    {
                        "en": "a car assembly plant",
                        "vi": "một nhà máy lắp ráp ô tô"
                    },
                    {
                        "en": "the correct assembly of the parts",
                        "vi": "lắp ráp chính xác các bộ phận"
                    }
                ]
            }
        ]
    },
    {
        "id": "dd975d94ae754e0c8f9b502fb9281ac6",
        "word": "detention",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈtenʃn/",
            "us": "/dɪˈtenʃn/"
        },
        "nearby": [
            {
                "word": "detector",
                "pos": "noun"
            },
            {
                "word": "detente",
                "pos": "noun"
            },
            {
                "word": "detention",
                "pos": "noun"
            },
            {
                "word": "detention centre",
                "pos": "noun"
            },
            {
                "word": "detenu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being kept in a place, especially a prison, and prevented from leaving",
                    "vi": "tình trạng bị giam giữ tại một nơi, đặc biệt là nhà tù, và ngăn cản việc rời đi"
                },
                "examples": [
                    {
                        "en": "They were sentenced to 12 months' detention in a young offender institution.",
                        "vi": "Họ bị kết án 12 tháng giam giữ trong một trại giam dành cho phạm nhân trẻ tuổi."
                    },
                    {
                        "en": "police powers of arrest and detention",
                        "vi": "quyền hạn bắt và giam giữ của cảnh sát"
                    },
                    {
                        "en": "allegations of torture and detention without trial",
                        "vi": "cáo buộc tra tấn và giam giữ mà không cần xét xử"
                    },
                    {
                        "en": "a detention camp",
                        "vi": "trại tạm giam"
                    }
                ]
            },
            {
                "define": {
                    "en": "the punishment of being kept at school for a time after other students have gone home",
                    "vi": "hình phạt bị giữ lại trường một thời gian sau khi các học sinh khác đã về nhà"
                },
                "examples": [
                    {
                        "en": "They can’t give me (a) detention for this.",
                        "vi": "Họ không thể cho tôi (a) giam giữ vì việc này."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d8c9f683a884b139ade7fbf7595b976",
        "word": "field day",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfiːld deɪ/",
            "us": "/ˈfiːld deɪ/"
        },
        "nearby": [
            {
                "word": "field corn",
                "pos": "noun"
            },
            {
                "word": "fieldcraft",
                "pos": "noun"
            },
            {
                "word": "field day",
                "pos": "noun"
            },
            {
                "word": "fielder",
                "pos": "noun"
            },
            {
                "word": "field event",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special day at school when there are no classes and children compete in sports events",
                    "vi": "một ngày đặc biệt ở trường khi không có lớp học và trẻ em thi đấu trong các sự kiện thể thao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be given the opportunity to do something that you enjoy, especially something that other people do not approve of",
                    "vi": "được tạo cơ hội để làm điều gì đó mà bạn thích, đặc biệt là những điều mà người khác không tán thành"
                },
                "examples": [
                    {
                        "en": "The tabloid press had a field day with the latest government scandal.",
                        "vi": "Báo chí lá cải đã có một ngày thực địa với vụ bê bối mới nhất của chính phủ."
                    },
                    {
                        "en": "Shoplifters appear to have had a field day at the January sales.",
                        "vi": "Những người mua sắm dường như đã có một ngày thực địa tại đợt bán hàng tháng Giêng."
                    }
                ]
            }
        ]
    },
    {
        "id": "de8b00e5e7b14be2ab7f68ebf5cbbf92",
        "word": "field trip",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfiːld trɪp/",
            "us": "/ˈfiːld trɪp/"
        },
        "nearby": [
            {
                "word": "field-test",
                "pos": "verb"
            },
            {
                "word": "field trial",
                "pos": "noun"
            },
            {
                "word": "field trip",
                "pos": "noun"
            },
            {
                "word": "fieldwork",
                "pos": "noun"
            },
            {
                "word": "fieldworker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a journey made by a group of people, often students, to study something in its natural environment",
                    "vi": "một cuộc hành trình của một nhóm người, thường là sinh viên, để nghiên cứu điều gì đó trong môi trường tự nhiên của nó"
                },
                "examples": [
                    {
                        "en": "We went on a geology field trip.",
                        "vi": "Chúng tôi đã đi thực tế địa chất."
                    },
                    {
                        "en": "Delegates at the conference were taken on field trips to see the devastation.",
                        "vi": "Các đại biểu tham dự hội nghị đã được đi thực tế để xem sự tàn phá."
                    }
                ]
            }
        ]
    },
    {
        "id": "0bec4be03a684518bd9d620dcccb3094",
        "word": "fieldwork",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfiːldwɜːk/",
            "us": "/ˈfiːldwɜːrk/"
        },
        "nearby": [
            {
                "word": "field trial",
                "pos": "noun"
            },
            {
                "word": "field trip",
                "pos": "noun"
            },
            {
                "word": "fieldwork",
                "pos": "noun"
            },
            {
                "word": "fieldworker",
                "pos": "noun"
            },
            {
                "word": "fiend",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "research or study that is done in the real world rather than in a library or laboratory",
                    "vi": "nghiên cứu hoặc nghiên cứu được thực hiện trong thế giới thực thay vì trong thư viện hoặc phòng thí nghiệm"
                },
                "examples": [
                    {
                        "en": "Most of the fieldwork was carried out in Italy.",
                        "vi": "Hầu hết các cuộc điều tra thực địa được thực hiện ở Ý."
                    },
                    {
                        "en": "extensive fieldwork on chimpanzees",
                        "vi": "nghiên cứu thực địa sâu rộng về tinh tinh"
                    }
                ]
            }
        ]
    },
    {
        "id": "11c58c0b96d1401095fff6902c4d7437",
        "word": "form",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɔːm/",
            "us": "/fɔːrm/"
        },
        "nearby": [
            {
                "word": "forlorn",
                "pos": "adjective"
            },
            {
                "word": "forlornly",
                "pos": "adverb"
            },
            {
                "word": "form",
                "pos": "noun"
            },
            {
                "word": "form",
                "pos": "verb"
            },
            {
                "word": "formal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type or variety of something",
                    "vi": "một loại hoặc nhiều thứ gì đó"
                },
                "examples": [
                    {
                        "en": "all the millions of different life forms on the planet today",
                        "vi": "tất cả hàng triệu dạng sống khác nhau trên hành tinh ngày nay"
                    },
                    {
                        "en": "form of something forms of transport/government/entertainment",
                        "vi": "hình thức của một cái gì đó hình thức vận tải / chính phủ / giải trí"
                    },
                    {
                        "en": "one of the most common forms of cancer",
                        "vi": "một trong những dạng ung thư phổ biến nhất"
                    },
                    {
                        "en": "Swimming is one of the best forms of exercise.",
                        "vi": "Bơi lội là một trong những hình thức tập thể dục tốt nhất."
                    },
                    {
                        "en": "Along with talking and singing, drawing must be the oldest form of communication.",
                        "vi": "Cùng với nói và hát, vẽ phải là hình thức giao tiếp lâu đời nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of writing or saying a word that shows, for example, if it is plural or in a particular tense",
                    "vi": "một cách viết hoặc nói một từ cho thấy, ví dụ, nếu nó là số nhiều hoặc ở một thì cụ thể"
                },
                "examples": [
                    {
                        "en": "the infinitive form of the verb",
                        "vi": "dạng nguyên thể của động từ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way something is, seems, looks or is presented",
                    "vi": "cách cụ thể một cái gì đó, có vẻ như, trông hoặc được trình bày"
                },
                "examples": [
                    {
                        "en": "The disease can take several different forms.",
                        "vi": "Bệnh có thể có nhiều dạng khác nhau."
                    },
                    {
                        "en": "The training programme takes the form of a series of workshops.",
                        "vi": "Chương trình đào tạo dưới hình thức một chuỗi hội thảo."
                    },
                    {
                        "en": "We need to come to some form of agreement.",
                        "vi": "Chúng ta cần đi đến một số hình thức thỏa thuận."
                    },
                    {
                        "en": "in the form of somebody/something Help in the form of money will be very welcome.",
                        "vi": "dưới hình thức ai đó / cái gì đó Trợ giúp dưới hình thức tiền sẽ rất được hoan nghênh."
                    },
                    {
                        "en": "Help arrived in the form of two police officers.",
                        "vi": "Hai nhân viên cảnh sát đến giúp đỡ."
                    },
                    {
                        "en": "in… form Most political questions involve morality in some form or other.",
                        "vi": "ở… hình thức Hầu hết các câu hỏi chính trị liên quan đến đạo đức dưới hình thức này hay hình thức khác."
                    },
                    {
                        "en": "We prefer applications in electronic form.",
                        "vi": "Chúng tôi thích các ứng dụng dưới dạng điện tử."
                    },
                    {
                        "en": "Many collections of his cartoons appeared in book form.",
                        "vi": "Nhiều bộ sưu tập phim hoạt hình của ông đã xuất hiện dưới dạng sách."
                    },
                    {
                        "en": "Success can come in many forms.",
                        "vi": "Thành công có thể đến dưới nhiều hình thức."
                    },
                    {
                        "en": "I'm opposed to censorship in any shape or form.",
                        "vi": "Tôi phản đối việc kiểm duyệt dưới mọi hình thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official document containing questions and spaces for answers",
                    "vi": "một tài liệu chính thức chứa các câu hỏi và không gian cho câu trả lời"
                },
                "examples": [
                    {
                        "en": "an application/entry/order form",
                        "vi": "một đơn đăng ký / đơn đăng ký / đơn đặt hàng"
                    },
                    {
                        "en": "(especially British English) to fill in a form",
                        "vi": "(đặc biệt là tiếng Anh Anh) để điền vào biểu mẫu"
                    },
                    {
                        "en": "(especially North American English) to fill out a form",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để điền vào biểu mẫu"
                    },
                    {
                        "en": "I filled in/out a form on their website.",
                        "vi": "Tôi đã điền / điền vào một biểu mẫu trên trang web của họ."
                    },
                    {
                        "en": "to complete a form",
                        "vi": "để hoàn thành một biểu mẫu"
                    },
                    {
                        "en": "We asked them to read and sign consent forms.",
                        "vi": "Chúng tôi đã yêu cầu họ đọc và ký vào các mẫu đơn đồng ý."
                    },
                    {
                        "en": "(British English) a booking form",
                        "vi": "(Tiếng Anh Anh) một mẫu đặt phòng"
                    },
                    {
                        "en": "(North American English) a reservation form",
                        "vi": "(Tiếng Anh Bắc Mỹ) một biểu mẫu đặt trước"
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of somebody/something; a person or thing of which only the shape can be seen",
                    "vi": "hình dạng của ai đó / cái gì đó; một người hoặc một vật chỉ có thể nhìn thấy hình dạng"
                },
                "examples": [
                    {
                        "en": "The human form has changed little over the last 30 000 years.",
                        "vi": "Hình dạng con người đã thay đổi rất ít trong 30 000 năm qua."
                    },
                    {
                        "en": "Two weeks later the moth will emerge in its adult form.",
                        "vi": "Hai tuần sau, bướm đêm sẽ xuất hiện ở dạng trưởng thành."
                    },
                    {
                        "en": "They made out a shadowy form in front of them.",
                        "vi": "Họ làm ra một hình dạng mờ mịt trước mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the arrangement of parts in a whole, especially in a work of art or piece of writing",
                    "vi": "sự sắp xếp của các bộ phận trong một tổng thể, đặc biệt là trong một tác phẩm nghệ thuật hoặc một tác phẩm viết"
                },
                "examples": [
                    {
                        "en": "Shape and form are of greater importance to me than colour.",
                        "vi": "Hình dạng và hình thức quan trọng đối với tôi hơn màu sắc."
                    },
                    {
                        "en": "In a novel, form and content are equally important.",
                        "vi": "Trong một cuốn tiểu thuyết, hình thức và nội dung đều quan trọng như nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "how fit and healthy somebody is; the state of being fit and healthy",
                    "vi": "ai đó phù hợp và khỏe mạnh như thế nào; trạng thái khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "in… form After six months' training the whole team is in superb form.",
                        "vi": "ở… hình thức Sau sáu tháng tập luyện, toàn đội đang có phong độ tuyệt vời."
                    },
                    {
                        "en": "in form I really need to get back in form.",
                        "vi": "về hình thức, tôi thực sự cần lấy lại phong độ."
                    },
                    {
                        "en": "out of form The horse was clearly out of form.",
                        "vi": "ngoài hình thức Con ngựa rõ ràng là không hình thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "how well somebody/something is performing; the fact that somebody/something is performing well",
                    "vi": "ai đó / cái gì đó đang hoạt động tốt như thế nào; thực tế là ai đó / cái gì đó đang hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "Midfielder Elliott has shown disappointing form recently.",
                        "vi": "Trung vệ Elliott thể hiện phong độ đáng thất vọng trong thời gian gần đây."
                    },
                    {
                        "en": "She signalled her return to form with a convincing victory.",
                        "vi": "Cô báo hiệu sự trở lại phong độ của mình bằng một chiến thắng thuyết phục."
                    },
                    {
                        "en": "on form (British English) He's right on form (= performing well) as a crazy science teacher in his latest movie.",
                        "vi": "về hình thức (tiếng Anh Anh) Anh ấy đúng về hình thức (= hoạt động tốt) với vai một giáo viên khoa học điên rồ trong bộ phim mới nhất của anh ấy."
                    },
                    {
                        "en": "on… form The whole team was on good form and deserved the win.",
                        "vi": "trên… hình thức Toàn đội đã có phong độ tốt và xứng đáng giành chiến thắng."
                    },
                    {
                        "en": "On current/present form the party is heading for another election victory.",
                        "vi": "Ở hình thức hiện tại / hiện tại, đảng đang hướng tới một chiến thắng trong cuộc bầu cử khác."
                    },
                    {
                        "en": "in… form She was in great form (= happy and cheerful and full of energy) at the wedding party.",
                        "vi": "ở… hình thức Cô ấy có phong độ tuyệt vời (= vui vẻ, sảng khoái và tràn đầy năng lượng) tại bữa tiệc cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the usual way of doing something",
                    "vi": "cách thông thường để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What's the form when you apply for a research grant?",
                        "vi": "Biểu mẫu khi bạn xin tài trợ nghiên cứu là gì?"
                    },
                    {
                        "en": "conventional social forms",
                        "vi": "các hình thức xã hội thông thường"
                    },
                    {
                        "en": "True to form (= as he usually does) he arrived an hour late.",
                        "vi": "Đúng như hình thức (= như anh ấy thường làm) anh ấy đến muộn một tiếng đồng hồ."
                    },
                    {
                        "en": "Partners of employees are invited as a matter of form (= because that is the usual way things are done).",
                        "vi": "Đối tác của nhân viên được mời như một vấn đề về hình thức (= bởi vì đó là cách thông thường được thực hiện)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way of doing things that is socially acceptable/not socially acceptable",
                    "vi": "cách làm những việc được xã hội chấp nhận / không được xã hội chấp nhận"
                },
                "examples": [
                    {
                        "en": "When I was a boy it was always considered bad form to talk about food or money.",
                        "vi": "Khi tôi còn là một cậu bé, nói về thức ăn hoặc tiền bạc luôn bị coi là hình thức xấu."
                    },
                    {
                        "en": "Good form dictated that she should dress more casually in the country.",
                        "vi": "Hình thức tốt khiến cô ấy nên ăn mặc giản dị hơn khi ở trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a class in a school",
                    "vi": "một lớp học trong một trường học"
                },
                "examples": [
                    {
                        "en": "Who's your form teacher?",
                        "vi": "Giáo viên dạy mẫu của bạn là ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a student in the form mentioned at school",
                    "vi": "một học sinh trong hình thức được đề cập ở trường"
                },
                "examples": [
                    {
                        "en": "a third-former",
                        "vi": "người thứ ba"
                    }
                ]
            },
            {
                "define": {
                    "en": "of any type",
                    "vi": "thuộc bất kỳ loại nào"
                },
                "examples": [
                    {
                        "en": "I don't approve of violence in any shape or form.",
                        "vi": "Tôi không chấp nhận bạo lực dưới mọi hình thức."
                    },
                    {
                        "en": "I can't stand insects in any shape or form.",
                        "vi": "Tôi không thể chịu được côn trùng dưới bất kỳ hình dạng hay hình thức nào."
                    },
                    {
                        "en": "I do not condone bullying in any way, shape or form.",
                        "vi": "Tôi không dung túng cho việc bắt nạt dưới bất kỳ hình thức, hình thức nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gradually form into a particular shape; to gradually develop",
                    "vi": "để dần dần hình thành một hình dạng cụ thể; để dần dần phát triển"
                },
                "examples": [
                    {
                        "en": "In her body a new life was taking form.",
                        "vi": "Trong cơ thể cô, một sự sống mới đang hình thành."
                    }
                ]
            }
        ]
    },
    {
        "id": "f49a36189d794834bc838566b570f74b",
        "word": "half-term",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhɑːf ˈtɜːm/",
            "us": "/ˌhæf ˈtɜːrm/"
        },
        "nearby": [
            {
                "word": "half-staff",
                "pos": "noun"
            },
            {
                "word": "half step",
                "pos": "noun"
            },
            {
                "word": "half-term",
                "pos": "noun"
            },
            {
                "word": "half-timbered",
                "pos": "adjective"
            },
            {
                "word": "half-time",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in British schools) a short holiday in the middle of each term",
                    "vi": "(ở các trường học ở Anh) một kỳ nghỉ ngắn ngày vào giữa mỗi học kỳ"
                },
                "examples": [
                    {
                        "en": "the half-term break/holiday",
                        "vi": "kỳ nghỉ giữa kỳ / kỳ nghỉ"
                    },
                    {
                        "en": "What are you doing at half-term?",
                        "vi": "Bạn đang làm gì ở nửa nhiệm kỳ?"
                    },
                    {
                        "en": "It’s the half-term break next week.",
                        "vi": "Đó là kỳ nghỉ giữa kỳ vào tuần tới."
                    },
                    {
                        "en": "Your essays should be handed in before half-term.",
                        "vi": "Bài luận của bạn nên được nộp trước nửa học kỳ."
                    }
                ]
            }
        ]
    },
    {
        "id": "83a71a0e97a44fc0927746c32af418b3",
        "word": "mess around",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "message board",
                "pos": "noun"
            },
            {
                "word": "messaging",
                "pos": "noun"
            },
            {
                "word": "mess around",
                "pos": "phrasal verb"
            },
            {
                "word": "mess around with",
                "pos": "phrasal verb"
            },
            {
                "word": "messed-up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to behave in a silly and annoying way, especially instead of doing something useful",
                    "vi": "cư xử một cách ngớ ngẩn và khó chịu, đặc biệt là thay vì làm điều gì đó có ích"
                },
                "examples": [
                    {
                        "en": "Will you stop messing around and get on with some work?",
                        "vi": "Bạn sẽ ngừng lộn xộn và tiếp tục với một số công việc?"
                    },
                    {
                        "en": "I messed around in my first year at college.",
                        "vi": "Tôi đã lộn xộn trong năm đầu tiên ở trường đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time doing something for pleasure in a relaxed way",
                    "vi": "dành thời gian làm điều gì đó để giải trí một cách thoải mái"
                },
                "examples": [
                    {
                        "en": "We spent the day messing around on the river.",
                        "vi": "Chúng tôi đã dành cả ngày để lộn xộn trên sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody in an unfair and annoying way, especially by changing your mind a lot or not doing what you said you would",
                    "vi": "đối xử với ai đó theo cách không công bằng và khó chịu, đặc biệt là bằng cách thay đổi suy nghĩ của bạn rất nhiều hoặc không làm những gì bạn đã nói rằng bạn sẽ"
                },
                "examples": [
                    {
                        "en": "I’m sorry to mess you about but there are a few last-minute changes.",
                        "vi": "Tôi xin lỗi vì đã làm phiền bạn nhưng có một vài thay đổi vào phút cuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "05c1af0329fa4ba98856e4966d49a360",
        "word": "play truant",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtruːənt/",
            "us": "/ˈtruːənt/"
        },
        "nearby": [
            {
                "word": "truancy",
                "pos": "noun"
            },
            {
                "word": "truant",
                "pos": "verb"
            },
            {
                "word": "truant",
                "pos": "noun"
            },
            {
                "word": "truce",
                "pos": "noun"
            },
            {
                "word": "truck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child who stays away from school without permission",
                    "vi": "một đứa trẻ bỏ học mà không được phép"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stay away from school without permission",
                    "vi": "nghỉ học mà không được phép"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "614b1382b49142cca7d2375fb4245b67",
        "word": "registration",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌredʒɪˈstreɪʃn/",
            "us": "/ˌredʒɪˈstreɪʃn/"
        },
        "nearby": [
            {
                "word": "register office",
                "pos": "noun"
            },
            {
                "word": "registrar",
                "pos": "noun"
            },
            {
                "word": "registration",
                "pos": "noun"
            },
            {
                "word": "registration number",
                "pos": "noun"
            },
            {
                "word": "registration plate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of making an official record of something/somebody",
                    "vi": "hành động lập hồ sơ chính thức về một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "the registration of letters and parcels",
                        "vi": "đăng ký thư và bưu kiện"
                    },
                    {
                        "en": "the registration of students for a course",
                        "vi": "đăng ký của sinh viên cho một khóa học"
                    },
                    {
                        "en": "registration fees",
                        "vi": "phí đăng ký"
                    },
                    {
                        "en": "the registration of a child’s birth",
                        "vi": "đăng ký khai sinh của một đứa trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a document showing that an official record has been made of something",
                    "vi": "một tài liệu cho thấy rằng một hồ sơ chính thức đã được tạo ra từ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "my Democratic party registration",
                        "vi": "đăng ký đảng Dân chủ của tôi"
                    },
                    {
                        "en": "the information on the registration roll",
                        "vi": "thông tin trên cuộn đăng ký"
                    },
                    {
                        "en": "I traced my family history using the civil registration records.",
                        "vi": "Tôi truy tìm lịch sử gia đình của mình bằng cách sử dụng hồ sơ đăng ký hộ tịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the series of letters and numbers that are shown on a number plate at the front and back of a vehicle to identify it",
                    "vi": "một loạt các chữ cái và số được hiển thị trên biển số ở phía trước và phía sau của một chiếc xe để xác định nó"
                },
                "examples": [
                    {
                        "en": "The police are looking for a black car with German registration plates.",
                        "vi": "Cảnh sát đang truy tìm một chiếc ô tô màu đen có biển số đăng ký của Đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time when a teacher looks at the list of students on the class register and checks that the students are present",
                    "vi": "khi giáo viên xem danh sách học sinh trên lớp và kiểm tra học sinh có mặt không"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1c54c3b1ccd24b7a8e9e922ce5e681bc",
        "word": "sixth form",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɪksθ fɔːm/",
            "us": "/ˈsɪksθ fɔːrm/"
        },
        "nearby": [
            {
                "word": "sixth",
                "pos": "ordinal number"
            },
            {
                "word": "sixth",
                "pos": "noun"
            },
            {
                "word": "sixth form",
                "pos": "noun"
            },
            {
                "word": "sixth-form college",
                "pos": "noun"
            },
            {
                "word": "sixth-former",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the two final years at school for students between the ages of 16 and 18 who are preparing to take A levels (= advanced level exams)",
                    "vi": "hai năm cuối tại trường dành cho học sinh trong độ tuổi từ 16 đến 18 đang chuẩn bị thi A levels (= kỳ thi cấp độ nâng cao)"
                },
                "examples": [
                    {
                        "en": "Sue is in the sixth form now.",
                        "vi": "Bây giờ Sue đang ở dạng thứ sáu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6acefacba17e4dc8a8bbbda2aa12a9fb",
        "word": "syllabus",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɪləbəs/",
            "us": "/ˈsɪləbəs/"
        },
        "nearby": [
            {
                "word": "syllable-timed",
                "pos": "adjective"
            },
            {
                "word": "syllabub",
                "pos": "noun"
            },
            {
                "word": "syllabus",
                "pos": "noun"
            },
            {
                "word": "syllogism",
                "pos": "noun"
            },
            {
                "word": "syllogistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a list of the topics, books, etc. that students should study in a particular subject at school or college",
                    "vi": "danh sách các chủ đề, sách, v.v. mà sinh viên nên học trong một môn học cụ thể ở trường hoặc đại học"
                },
                "examples": [
                    {
                        "en": "on the syllabus American history will be on the syllabus next term.",
                        "vi": "trên giáo trình Lịch sử nước Mỹ sẽ có trong giáo trình học kỳ tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "48c691e180b643789fa422796b844147",
        "word": "tell off",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "telling-off",
                "pos": "noun"
            },
            {
                "word": "tell of",
                "pos": "phrasal verb"
            },
            {
                "word": "tell off",
                "pos": "phrasal verb"
            },
            {
                "word": "tell on",
                "pos": "phrasal verb"
            },
            {
                "word": "telltale",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak angrily to somebody for doing something wrong",
                    "vi": "nói chuyện giận dữ với ai đó vì đã làm sai điều gì đó"
                },
                "examples": [
                    {
                        "en": "I told the boys off for making so much noise.",
                        "vi": "Tôi đã nói với các chàng trai vì đã làm ồn quá nhiều."
                    },
                    {
                        "en": "Did you get told off?",
                        "vi": "Bạn đã bị nói ra?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3805cac278634ec585a442eeda89b817",
        "word": "truant",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtruːənt/",
            "us": "/ˈtruːənt/"
        },
        "nearby": [
            {
                "word": "troy",
                "pos": "noun"
            },
            {
                "word": "truancy",
                "pos": "noun"
            },
            {
                "word": "truant",
                "pos": "verb"
            },
            {
                "word": "truant",
                "pos": "noun"
            },
            {
                "word": "truce",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school without permission",
                    "vi": "nghỉ học mà không được phép"
                },
                "examples": [
                    {
                        "en": "A number of pupils have been truanting regularly.",
                        "vi": "Một số học sinh thường xuyên trốn học."
                    }
                ]
            }
        ]
    },
    {
        "id": "8cda40575c0949a6977db63abe64e627",
        "word": "blazer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbleɪzə(r)/",
            "us": "/ˈbleɪzər/"
        },
        "nearby": [
            {
                "word": "blaze",
                "pos": "verb"
            },
            {
                "word": "blaze",
                "pos": "noun"
            },
            {
                "word": "blazer",
                "pos": "noun"
            },
            {
                "word": "blaze up",
                "pos": "phrasal verb"
            },
            {
                "word": "blazing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a jacket, not worn with matching trousers, often showing the colours or badge of a club, school, team, etc.",
                    "vi": "áo khoác, không mặc với quần tây, thường hiển thị màu sắc hoặc huy hiệu của câu lạc bộ, trường học, đội, v.v."
                },
                "examples": [
                    {
                        "en": "He was smartly dressed in a blazer and slacks.",
                        "vi": "Anh ấy ăn mặc lịch sự với một chiếc áo blazer và quần lọt khe."
                    },
                    {
                        "en": "a school blazer",
                        "vi": "áo khoác đi học"
                    }
                ]
            }
        ]
    },
    {
        "id": "1a93ffc98de84837b92ecf8f68a27084",
        "word": "bunk off",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "the Battle of Bunker Hill",
                "pos": ""
            },
            {
                "word": "bunkhouse",
                "pos": "noun"
            },
            {
                "word": "bunk off",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off school",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off work",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school or work when you should be there; to leave school or work early",
                    "vi": "tránh xa trường học hoặc nơi làm việc khi bạn phải ở đó; nghỉ học hoặc đi làm sớm"
                },
                "examples": [
                    {
                        "en": "I’m going to bunk off this afternoon.",
                        "vi": "Chiều nay tôi sẽ xuống giường."
                    },
                    {
                        "en": "She had bunked off work all week.",
                        "vi": "Cô ấy đã nghỉ làm cả tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "27360b89cc754ab68a84c77bd0f98d43",
        "word": "bunk off school",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bunkhouse",
                "pos": "noun"
            },
            {
                "word": "bunk off",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off school",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off work",
                "pos": "phrasal verb"
            },
            {
                "word": "bunkum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school or work when you should be there; to leave school or work early",
                    "vi": "tránh xa trường học hoặc nơi làm việc khi bạn phải ở đó; nghỉ học hoặc đi làm sớm"
                },
                "examples": [
                    {
                        "en": "I’m going to bunk off this afternoon.",
                        "vi": "Chiều nay tôi sẽ xuống giường."
                    },
                    {
                        "en": "She had bunked off work all week.",
                        "vi": "Cô ấy đã nghỉ làm cả tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "1514025a62e245a793b3660bda3aa9e3",
        "word": "bunk off work",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bunk off",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off school",
                "pos": "phrasal verb"
            },
            {
                "word": "bunk off work",
                "pos": "phrasal verb"
            },
            {
                "word": "bunkum",
                "pos": "noun"
            },
            {
                "word": "bunny",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school or work when you should be there; to leave school or work early",
                    "vi": "tránh xa trường học hoặc nơi làm việc khi bạn phải ở đó; nghỉ học hoặc đi làm sớm"
                },
                "examples": [
                    {
                        "en": "I’m going to bunk off this afternoon.",
                        "vi": "Chiều nay tôi sẽ xuống giường."
                    },
                    {
                        "en": "She had bunked off work all week.",
                        "vi": "Cô ấy đã nghỉ làm cả tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "da0163f9138542baaef09e4a15b480ae",
        "word": "corporal punishment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɔːpərəl ˈpʌnɪʃmənt/",
            "us": "/ˌkɔːrpərəl ˈpʌnɪʃmənt/"
        },
        "nearby": [
            {
                "word": "corpora",
                "pos": "noun"
            },
            {
                "word": "corporal",
                "pos": "noun"
            },
            {
                "word": "corporal punishment",
                "pos": "noun"
            },
            {
                "word": "corporate",
                "pos": "adjective"
            },
            {
                "word": "corporate raider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the physical punishment of people, especially by hitting them",
                    "vi": "hình phạt thể xác của con người, đặc biệt là bằng cách đánh họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "78134194ad1545c39f0ead922f291a49",
        "word": "demerit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/diːˈmerɪt/",
            "us": "/diːˈmerɪt/"
        },
        "nearby": [
            {
                "word": "demerge",
                "pos": "verb"
            },
            {
                "word": "demerger",
                "pos": "noun"
            },
            {
                "word": "demerit",
                "pos": "noun"
            },
            {
                "word": "demesne",
                "pos": "noun"
            },
            {
                "word": "demi-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fault in something or a disadvantage of something",
                    "vi": "một lỗi trong một cái gì đó hoặc một cái gì đó bất lợi"
                },
                "examples": [
                    {
                        "en": "the merits and demerits of the scheme",
                        "vi": "giá trị và điểm tốt của kế hoạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark on somebody’s school record showing that they have done something wrong",
                    "vi": "một dấu hiệu trên học bạ của ai đó cho thấy rằng họ đã làm sai điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll get three demerits if you're caught smoking on school grounds.",
                        "vi": "Bạn sẽ nhận được ba giải thưởng nếu bạn bị bắt gặp hút thuốc trên sân trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "f0c3abfaf1dc43fab375f658811e967d",
        "word": "guidance counselor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡaɪdns kaʊnsələ(r)/",
            "us": "/ˈɡaɪdns kaʊnsələr/"
        },
        "nearby": [
            {
                "word": "GUI",
                "pos": "noun"
            },
            {
                "word": "guidance",
                "pos": "noun"
            },
            {
                "word": "guidance counselor",
                "pos": "noun"
            },
            {
                "word": "guide",
                "pos": "noun"
            },
            {
                "word": "guide",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who works in a school and is responsible for giving students advice about classes and helping them with personal problems",
                    "vi": "một người làm việc trong trường học và chịu trách nhiệm đưa ra lời khuyên cho học sinh về các lớp học và giúp họ giải quyết các vấn đề cá nhân"
                },
                "examples": [
                    {
                        "en": "I've got some ideas about how to get kids on the right path, so I'm becoming a guidance counselor.",
                        "vi": "Tôi có một số ý tưởng về cách đưa trẻ em đi đúng đường, vì vậy tôi đang trở thành một cố vấn hướng dẫn."
                    }
                ]
            }
        ]
    },
    {
        "id": "11ecd35476e44892b5e5381027fdf64f",
        "word": "gymslip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɪmslɪp/",
            "us": "/ˈdʒɪmslɪp/"
        },
        "nearby": [
            {
                "word": "gymnastics",
                "pos": "noun"
            },
            {
                "word": "gym shoe",
                "pos": "noun"
            },
            {
                "word": "gymslip",
                "pos": "noun"
            },
            {
                "word": "gynaecological",
                "pos": "adjective"
            },
            {
                "word": "gynaecologist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dress without arms worn over a shirt as a school uniform for girls",
                    "vi": "một chiếc váy không tay khoác ngoài áo sơ mi làm đồng phục học sinh cho nữ sinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "07d3f405a713403b96ef3384693a1b5d",
        "word": "house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/haʊs/",
            "us": "/haʊs/"
        },
        "nearby": [
            {
                "word": "hourly",
                "pos": "adjective"
            },
            {
                "word": "hourly",
                "pos": "adverb"
            },
            {
                "word": "house",
                "pos": "noun"
            },
            {
                "word": "house",
                "pos": "verb"
            },
            {
                "word": "house arrest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building for people to live in, usually for one family",
                    "vi": "một tòa nhà cho mọi người ở, thường là cho một gia đình"
                },
                "examples": [
                    {
                        "en": "in a house We live in a two-bedroom house.",
                        "vi": "trong một ngôi nhà Chúng tôi sống trong một ngôi nhà hai phòng ngủ."
                    },
                    {
                        "en": "in the house It was so hot outside we stayed in the house.",
                        "vi": "trong nhà Trời nóng quá, chúng tôi ở trong nhà."
                    },
                    {
                        "en": "into the house He went into the house.",
                        "vi": "vào nhà Anh ấy đã vào nhà."
                    },
                    {
                        "en": "out of the house I had to get out of the house.",
                        "vi": "ra khỏi nhà tôi phải ra khỏi nhà."
                    },
                    {
                        "en": "inside the house A light was on inside the house.",
                        "vi": "bên trong ngôi nhà Một ngọn đèn sáng bên trong ngôi nhà."
                    },
                    {
                        "en": "outside the house There was a police van parked outside the house.",
                        "vi": "bên ngoài ngôi nhà Có một chiếc xe cảnh sát đậu bên ngoài ngôi nhà."
                    },
                    {
                        "en": "at somebody's house Let's have a party at my house.",
                        "vi": "tại nhà của ai đó Hãy tổ chức một bữa tiệc tại nhà của tôi."
                    },
                    {
                        "en": "We need to build more houses in a way that respects the needs of the environment.",
                        "vi": "Chúng ta cần xây dựng nhiều ngôi nhà hơn theo cách tôn trọng nhu cầu của môi trường."
                    },
                    {
                        "en": "Investors were buying houses to rent them out.",
                        "vi": "Các nhà đầu tư đang mua nhà để cho thuê."
                    },
                    {
                        "en": "What time do you leave the house in the morning (= to go to work)?",
                        "vi": "Bạn ra khỏi nhà lúc mấy giờ vào buổi sáng (= đi làm)?"
                    },
                    {
                        "en": "(British English) We're moving house (= leaving our house and going to live in a different one).",
                        "vi": "(Tiếng Anh Anh) Chúng tôi đang chuyển nhà (= rời khỏi ngôi nhà của chúng tôi và đến sống ở một ngôi nhà khác)."
                    },
                    {
                        "en": "House prices (= prices of houses and flats) in London are still rising.",
                        "vi": "Giá nhà (= giá nhà và căn hộ) ở Luân Đôn vẫn đang tăng."
                    },
                    {
                        "en": "We went on a tour of the house and grounds (= for example, at a country house, open to the public).",
                        "vi": "Chúng tôi đã đi tham quan ngôi nhà và khu đất (= ví dụ: tại một ngôi nhà nông thôn, mở cửa cho công chúng)."
                    },
                    {
                        "en": "They went from house to house, begging for food.",
                        "vi": "Họ đi từ nhà này sang nhà khác, xin ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the people living in a house",
                    "vi": "tất cả những người sống trong một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "Be quiet or you'll wake the whole house!",
                        "vi": "Hãy im lặng nếu không bạn sẽ đánh thức cả nhà!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building used for a particular purpose, for example for holding meetings in or keeping animals or goods in",
                    "vi": "một tòa nhà được sử dụng cho một mục đích cụ thể, ví dụ như để tổ chức các cuộc họp hoặc giữ động vật hoặc hàng hóa trong"
                },
                "examples": [
                    {
                        "en": "an opera house",
                        "vi": "một nhà hát opera"
                    },
                    {
                        "en": "a henhouse",
                        "vi": "một chuồng gà"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of office buildings",
                    "vi": "được sử dụng trong tên của các tòa nhà văn phòng"
                },
                "examples": [
                    {
                        "en": "Their offices are on the second floor of Chester House.",
                        "vi": "Văn phòng của họ ở tầng hai của Chester House."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company involved in a particular kind of business; an institution of a particular kind",
                    "vi": "một công ty tham gia vào một loại hình kinh doanh cụ thể; một tổ chức của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "a fashion/banking/publishing house",
                        "vi": "thời trang / ngân hàng / nhà xuất bản"
                    },
                    {
                        "en": "a religious house (= a convent or a monastery)",
                        "vi": "một nhà tôn giáo (= một tu viện hoặc một tu viện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a restaurant",
                    "vi": "một nhà hàng"
                },
                "examples": [
                    {
                        "en": "a steakhouse",
                        "vi": "một nhà hàng bít tết"
                    },
                    {
                        "en": "a coffee house",
                        "vi": "một quán cà phê"
                    },
                    {
                        "en": "a bottle of house wine (= the cheapest wine available in a particular restaurant, sometimes not listed by name)",
                        "vi": "một chai rượu nhà (= loại rượu rẻ nhất có sẵn trong một nhà hàng cụ thể, đôi khi không được liệt kê theo tên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who meet to discuss and make the laws of a country",
                    "vi": "một nhóm người gặp nhau để thảo luận và đưa ra luật của một quốc gia"
                },
                "examples": [
                    {
                        "en": "Legislation requires approval by both houses of parliament.",
                        "vi": "Luật pháp đòi hỏi sự chấp thuận của cả hai viện của quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the House of Commons or the House of Lords in the UK; the House of Representatives in the US",
                    "vi": "Hạ viện hoặc Hạ viện ở Vương quốc Anh; Hạ viện ở Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of people discussing something in a formal debate",
                    "vi": "một nhóm người thảo luận điều gì đó trong một cuộc tranh luận chính thức"
                },
                "examples": [
                    {
                        "en": "I urge the house to vote against the motion.",
                        "vi": "Tôi kêu gọi cả nhà bỏ phiếu chống lại đề nghị này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a theatre where the audience sits; the audience at a particular performance",
                    "vi": "phần của một nhà hát, nơi khán giả ngồi; khán giả tại một buổi biểu diễn cụ thể"
                },
                "examples": [
                    {
                        "en": "playing to a full/packed/empty house (= to a large/small audience)",
                        "vi": "chơi với một ngôi nhà đầy đủ / chật kín / trống rỗng (= cho một lượng lớn / khán giả nhỏ)"
                    },
                    {
                        "en": "The spotlight faded and the house lights came up.",
                        "vi": "Ánh đèn sân khấu mờ dần và đèn nhà bật lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some British schools) an organized group of students of different ages who compete against other groups in sports competitions, etc. and who may, in boarding schools, live together in one building",
                    "vi": "(ở một số trường học ở Anh) một nhóm có tổ chức gồm các học sinh ở các độ tuổi khác nhau thi đấu với các nhóm khác trong các cuộc thi thể thao, v.v. và những người có thể, trong các trường nội trú, sống cùng nhau trong một tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an old and famous family",
                    "vi": "một gia đình lâu đời và nổi tiếng"
                },
                "examples": [
                    {
                        "en": "the House of Windsor (= the British royal family)",
                        "vi": "Nhà Windsor (= hoàng gia Anh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of electronic dance music with a fast beat",
                    "vi": "một loại nhạc dance điện tử với nhịp điệu nhanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make everyone laugh or cheer, especially at a performance in the theatre",
                    "vi": "để làm cho mọi người cười hoặc cổ vũ, đặc biệt là tại một buổi biểu diễn trong nhà hát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove people or things that are not necessary or wanted",
                    "vi": "để loại bỏ những người hoặc những thứ không cần thiết hoặc không muốn"
                },
                "examples": [
                    {
                        "en": "The new manager said he wanted to clean house.",
                        "vi": "Người quản lý mới nói rằng anh ấy muốn dọn dẹp nhà cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your house clean",
                    "vi": "để làm cho ngôi nhà của bạn sạch sẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to eat a lot of somebody else’s food",
                    "vi": "ăn nhiều thức ăn của người khác"
                },
                "examples": [
                    {
                        "en": "How much longer is he staying? He’s eating us out of house and home.",
                        "vi": "Anh ta sẽ ở lại bao lâu nữa? Anh ta đang ăn thịt chúng tôi ra khỏi nhà và nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become friends quickly and have a very friendly relationship",
                    "vi": "nhanh chóng trở thành bạn bè và có một mối quan hệ rất thân thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something or ask a question in a very complicated way instead of in a simple, direct way",
                    "vi": "để làm điều gì đó hoặc đặt một câu hỏi theo một cách rất phức tạp thay vì một cách đơn giản, trực tiếp"
                },
                "examples": [
                    {
                        "en": "You did go all round the houses didn’t you? Why not get straight to the point?",
                        "vi": "Bạn đã đi khắp các ngôi nhà phải không? Tại sao không đi thẳng vào vấn đề?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cook, clean and do all the other jobs around the house",
                    "vi": "nấu ăn, dọn dẹp và làm tất cả các công việc khác xung quanh nhà"
                },
                "examples": [
                    {
                        "en": "She kept house for her elderly parents.",
                        "vi": "Cô cất nhà cho cha mẹ già."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that everyone was very emotional about something",
                    "vi": "từng nói rằng mọi người đều rất xúc động về điều gì đó"
                },
                "examples": [
                    {
                        "en": "There wasn't a dry eye in the house when they announced their engagement.",
                        "vi": "Không có người nào thấy khô mắt khi họ tuyên bố đính hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "drinks or meals that are on the house are provided free by the pub or restaurant and you do not have to pay",
                    "vi": "đồ uống hoặc bữa ăn trong nhà được cung cấp miễn phí bởi quán rượu hoặc nhà hàng và bạn không phải trả tiền"
                },
                "examples": [
                    {
                        "en": "Have a drink on the house.",
                        "vi": "Vào nhà uống rượu đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should not criticize other people, because they will easily find ways of criticizing you",
                    "vi": "bạn không nên chỉ trích người khác, vì họ sẽ dễ dàng tìm cách chỉ trích bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play at being a family in its home",
                    "vi": "chơi để trở thành một gia đình trong ngôi nhà của nó"
                },
                "examples": [
                    {
                        "en": "The children were playing house, giving dinner to their dolls.",
                        "vi": "Những đứa trẻ đang chơi nhà, đưa bữa tối cho búp bê của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize your own business or improve your own behaviour before you try to criticize somebody else",
                    "vi": "tổ chức công việc kinh doanh của riêng bạn hoặc cải thiện hành vi của chính bạn trước khi bạn cố gắng chỉ trích người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very safe",
                    "vi": "rất an toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a place your home",
                    "vi": "để biến một nơi thành nhà của bạn"
                },
                "examples": [
                    {
                        "en": "They set up house together in a small flat in Brighton.",
                        "vi": "Họ cùng nhau dựng nhà trong một căn hộ nhỏ ở Brighton."
                    },
                    {
                        "en": "They want to set up house together.",
                        "vi": "Họ muốn thiết lập một ngôi nhà cùng nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "e46181e12c59404290d484a1f06d9ae7",
        "word": "lollipop lady",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒlipɒp leɪdi/",
            "us": "/ˈlɑːlipɑːp leɪdi/"
        },
        "nearby": [
            {
                "word": "loll",
                "pos": "verb"
            },
            {
                "word": "lollipop",
                "pos": "noun"
            },
            {
                "word": "lollipop lady",
                "pos": "noun"
            },
            {
                "word": "lollipop man",
                "pos": "noun"
            },
            {
                "word": "lollop",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman whose job is to help children cross a busy road on their way to and from school by holding up a sign on a stick telling traffic to stop",
                    "vi": "một người phụ nữ có công việc là giúp trẻ em băng qua một con đường đông đúc trên đường đến và đi học bằng cách giơ một biển báo trên một chiếc gậy yêu cầu giao thông dừng lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4ddf2c2f946c4084ac98e55e57c8ca80",
        "word": "lollipop man",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒlipɒp mæn/",
            "us": "/ˈlɑːlipɑːp mæn/"
        },
        "nearby": [
            {
                "word": "lollipop",
                "pos": "noun"
            },
            {
                "word": "lollipop lady",
                "pos": "noun"
            },
            {
                "word": "lollipop man",
                "pos": "noun"
            },
            {
                "word": "lollop",
                "pos": "verb"
            },
            {
                "word": "lolly",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man whose job is to help children cross a busy road on their way to and from school by holding up a sign on a stick telling traffic to stop",
                    "vi": "một người đàn ông có công việc là giúp trẻ em băng qua một con đường đông đúc trên đường đến và đi học bằng cách giơ một biển báo trên một chiếc gậy yêu cầu giao thông dừng lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5903075e86d4b8eb415ad734480e5ab",
        "word": "minus",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪnəs/",
            "us": "/ˈmaɪnəs/"
        },
        "nearby": [
            {
                "word": "minus",
                "pos": "preposition"
            },
            {
                "word": "minus",
                "pos": "noun"
            },
            {
                "word": "minus",
                "pos": "adjective"
            },
            {
                "word": "minuscule",
                "pos": "adjective"
            },
            {
                "word": "minute1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "lower than zero",
                    "vi": "thấp hơn 0"
                },
                "examples": [
                    {
                        "en": "a minus figure/number",
                        "vi": "một con số / số trừ"
                    }
                ]
            },
            {
                "define": {
                    "en": "making something seem negative and less attractive or good",
                    "vi": "làm cho một cái gì đó có vẻ tiêu cực và kém hấp dẫn hoặc tốt"
                },
                "examples": [
                    {
                        "en": "What are the car's minus points (= the disadvantages)?",
                        "vi": "Những điểm trừ (= những nhược điểm) của chiếc xe là gì?"
                    },
                    {
                        "en": "On the minus side, rented property is expensive and difficult to find.",
                        "vi": "Mặt trừ, tài sản cho thuê rất đắt và khó tìm."
                    }
                ]
            },
            {
                "define": {
                    "en": "slightly lower than the grade A, B, etc.",
                    "vi": "thấp hơn một chút so với loại A, B, v.v."
                },
                "examples": [
                    {
                        "en": "I got (a) B minus (B−) in the test.",
                        "vi": "Tôi lấy (a) B trừ (B−) trong bài kiểm tra."
                    }
                ]
            }
        ]
    },
    {
        "id": "b542f39538bf488ea5721f7443bd539d",
        "word": "play hookey",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʊki/",
            "us": "/ˈhʊki/"
        },
        "nearby": [
            {
                "word": "hooked",
                "pos": "adjective"
            },
            {
                "word": "hooker",
                "pos": "noun"
            },
            {
                "word": "hookey",
                "pos": ""
            },
            {
                "word": "hook shot",
                "pos": "noun"
            },
            {
                "word": "hook up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school without permission",
                    "vi": "nghỉ học mà không được phép"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c730fc03f51a4472a0c915fb3b9b3a20",
        "word": "play hooky",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʊki/",
            "us": "/ˈhʊki/"
        },
        "nearby": [
            {
                "word": "hook up with",
                "pos": "phrasal verb"
            },
            {
                "word": "hookworm",
                "pos": "noun"
            },
            {
                "word": "hooky",
                "pos": ""
            },
            {
                "word": "hooligan",
                "pos": "noun"
            },
            {
                "word": "hooliganism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stay away from school without permission",
                    "vi": "nghỉ học mà không được phép"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8c6ba404d38a49a48579315d859c169b",
        "word": "prospectus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈspektəs/",
            "us": "/prəˈspektəs/"
        },
        "nearby": [
            {
                "word": "prospective",
                "pos": "adjective"
            },
            {
                "word": "prospector",
                "pos": "noun"
            },
            {
                "word": "prospectus",
                "pos": "noun"
            },
            {
                "word": "prosper",
                "pos": "verb"
            },
            {
                "word": "prosperity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book, document or web page that gives information about a school, college, etc. in order to advertise it",
                    "vi": "một cuốn sách, tài liệu hoặc trang web cung cấp thông tin về trường học, trường đại học, v.v. để quảng cáo nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a document that gives information about a company’s shares before they are offered for sale",
                    "vi": "một tài liệu cung cấp thông tin về cổ phiếu của một công ty trước khi chúng được chào bán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1150c346f48a409f8a9d51a957c8bb1b",
        "word": "recess",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːses/",
            "us": "/ˈriːses/"
        },
        "nearby": [
            {
                "word": "receptivity",
                "pos": "noun"
            },
            {
                "word": "receptor",
                "pos": "noun"
            },
            {
                "word": "recess",
                "pos": "noun"
            },
            {
                "word": "recess",
                "pos": "verb"
            },
            {
                "word": "recession",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time during the year when the members of a parliament, committee, etc. do not meet",
                    "vi": "khoảng thời gian trong năm mà các thành viên của quốc hội, ủy ban, v.v. không họp"
                },
                "examples": [
                    {
                        "en": "Parliament went into its long summer recess.",
                        "vi": "Quốc hội đã bước vào kỳ nghỉ hè kéo dài."
                    },
                    {
                        "en": "in recess The court is in recess until October.",
                        "vi": "trong giờ giải lao Tòa án đang giải lao cho đến tháng Mười."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short break in a trial in court",
                    "vi": "nghỉ giải lao ngắn trong phiên tòa xét xử"
                },
                "examples": [
                    {
                        "en": "The judge called a short recess.",
                        "vi": "Thẩm phán gọi là một thời gian giải lao ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time between lessons at school",
                    "vi": "một khoảng thời gian giữa các bài học ở trường"
                },
                "examples": [
                    {
                        "en": "He wouldn't play with me at recess.",
                        "vi": "Anh ấy sẽ không chơi với tôi vào giờ giải lao."
                    },
                    {
                        "en": "I believe kids need more recess time.",
                        "vi": "Tôi tin rằng bọn trẻ cần nhiều thời gian giải lao hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a wall that is set further back than the rest of the wall, forming a space",
                    "vi": "một phần của bức tường lùi xa hơn phần còn lại của bức tường, tạo thành một khoảng trống"
                },
                "examples": [
                    {
                        "en": "a recess for books",
                        "vi": "giải lao cho sách"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a place that is furthest from the light and hard to see or get to",
                    "vi": "phần của một nơi xa ánh sáng nhất và khó có thể nhìn thấy hoặc đến được"
                },
                "examples": [
                    {
                        "en": "He stared into the dark recesses of the room.",
                        "vi": "Anh nhìn chằm chằm vào hốc tối của căn phòng."
                    },
                    {
                        "en": "(figurative) The doubt was still there, in the deep recesses of her mind.",
                        "vi": "(nghĩa bóng) Sự nghi ngờ vẫn còn đó, trong sâu thẳm tâm trí cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "69235eae0cf347039b2283af1a27e2a1",
        "word": "the school run",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈskuːl rʌn/",
            "us": "/ðə ˈskuːl rʌn/"
        },
        "nearby": [
            {
                "word": "schoolmistress",
                "pos": "noun"
            },
            {
                "word": "schoolroom",
                "pos": "noun"
            },
            {
                "word": "the school run",
                "pos": "noun"
            },
            {
                "word": "schoolteacher",
                "pos": "noun"
            },
            {
                "word": "school uniform",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the journey that parents make to take their children to school or to bring them home again",
                    "vi": "hành trình mà cha mẹ thực hiện để đưa con đến trường hoặc đưa chúng về nhà một lần nữa"
                },
                "examples": [
                    {
                        "en": "I have to get back in time to do the school run.",
                        "vi": "Tôi phải quay lại kịp thời để chạy trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "41d65e56e0764f9887ea7dac2202c953",
        "word": "session",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseʃn/",
            "us": "/ˈseʃn/"
        },
        "nearby": [
            {
                "word": "sesame",
                "pos": "noun"
            },
            {
                "word": "Sesame Street",
                "pos": ""
            },
            {
                "word": "session",
                "pos": "noun"
            },
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time that is spent doing a particular activity",
                    "vi": "một khoảng thời gian được dành để thực hiện một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "a training/practice session",
                        "vi": "một buổi đào tạo / thực hành"
                    },
                    {
                        "en": "a therapy/counselling/group session",
                        "vi": "một buổi trị liệu / tư vấn / nhóm"
                    },
                    {
                        "en": "a morning/afternoon session",
                        "vi": "một buổi sáng / buổi chiều"
                    },
                    {
                        "en": "a recording/jam session",
                        "vi": "một phiên ghi âm / kẹt xe"
                    },
                    {
                        "en": "The course is made up of 12 two-hour sessions.",
                        "vi": "Khóa học bao gồm 12 buổi học kéo dài hai giờ."
                    },
                    {
                        "en": "Two soccer fans plunged to their deaths after a heavy drinking session.",
                        "vi": "Hai cổ động viên bóng đá lao xuống vực tử vong sau một buổi nhậu nhẹt."
                    },
                    {
                        "en": "The club held football coaching sessions for children in the area.",
                        "vi": "Câu lạc bộ đã tổ chức các buổi huấn luyện bóng đá cho trẻ em trên địa bàn."
                    },
                    {
                        "en": "Participants will have the opportunity to attend sessions on a wide variety of topics.",
                        "vi": "Những người tham gia sẽ có cơ hội tham gia các phiên thảo luận về nhiều chủ đề khác nhau."
                    },
                    {
                        "en": "The literacy programme includes sessions on encouraging children to read.",
                        "vi": "Chương trình xóa mù chữ bao gồm các buổi khuyến khích trẻ em đọc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal meeting or series of meetings of a court, a parliament, etc.; a period of time when such meetings are held",
                    "vi": "một cuộc họp chính thức hoặc một loạt các cuộc họp của tòa án, quốc hội, v.v.; một khoảng thời gian khi các cuộc họp như vậy được tổ chức"
                },
                "examples": [
                    {
                        "en": "a session of the UN General Assembly",
                        "vi": "một phiên họp của Đại hội đồng LHQ"
                    },
                    {
                        "en": "The president addressed a joint session of Congress (= both the Senate and the House of Representatives).",
                        "vi": "Tổng thống phát biểu tại một phiên họp chung của Quốc hội (= cả Thượng viện và Hạ viện)."
                    },
                    {
                        "en": "a plenary session of the European Parliament",
                        "vi": "một phiên họp toàn thể của Nghị viện Châu Âu"
                    },
                    {
                        "en": "a special session of the US Supreme Court",
                        "vi": "một phiên họp đặc biệt của Tòa án tối cao Hoa Kỳ"
                    },
                    {
                        "en": "In the last legislative session, the two parties came close to agreement.",
                        "vi": "Trong phiên họp lập pháp cuối cùng, hai bên đã đi đến thống nhất."
                    },
                    {
                        "en": "in session The court is now in session.",
                        "vi": "trong phiên Tòa bây giờ đang trong phiên họp."
                    },
                    {
                        "en": "The committee met in closed session (= with nobody else present).",
                        "vi": "Ủy ban đã họp kín (= không có ai khác có mặt)."
                    },
                    {
                        "en": "an emergency session of Congress",
                        "vi": "một phiên họp khẩn cấp của Quốc hội"
                    },
                    {
                        "en": "the current parliamentary session",
                        "vi": "kỳ họp quốc hội hiện tại"
                    },
                    {
                        "en": "We still have a number of weeks before the current legislative session ends.",
                        "vi": "Chúng tôi vẫn còn một số tuần trước khi phiên họp lập pháp hiện tại kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a school or university year",
                    "vi": "một năm học hoặc đại học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an occasion when people meet to play music, especially Irish music, in a pub",
                    "vi": "một dịp khi mọi người gặp nhau để chơi nhạc, đặc biệt là nhạc Ailen, trong một quán rượu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "617fbf3b5f4940b49a78c66d25163ec3",
        "word": "stream",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/striːm/",
            "us": "/striːm/"
        },
        "nearby": [
            {
                "word": "streaker",
                "pos": "noun"
            },
            {
                "word": "streaky",
                "pos": "adjective"
            },
            {
                "word": "stream",
                "pos": "noun"
            },
            {
                "word": "stream",
                "pos": "verb"
            },
            {
                "word": "streamer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, narrow river",
                    "vi": "một con sông nhỏ hẹp"
                },
                "examples": [
                    {
                        "en": "a mountain stream",
                        "vi": "suối trên núi"
                    },
                    {
                        "en": "We waded across a shallow stream.",
                        "vi": "Chúng tôi lội qua một con suối cạn."
                    },
                    {
                        "en": "Our rivers and streams are polluted with a host of chemicals.",
                        "vi": "Các con sông và suối của chúng ta đang bị ô nhiễm bởi một loạt các chất hóa học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous flow of liquid or gas",
                    "vi": "một dòng chảy liên tục của chất lỏng hoặc khí"
                },
                "examples": [
                    {
                        "en": "a jet stream",
                        "vi": "một dòng máy bay phản lực"
                    },
                    {
                        "en": "stream of something A stream of blood flowed from the wound.",
                        "vi": "một dòng máu chảy ra từ vết thương."
                    },
                    {
                        "en": "He blew out a stream of cigar smoke.",
                        "vi": "Anh ta thổi ra một luồng khói xì gà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous flow of people or vehicles",
                    "vi": "dòng người hoặc phương tiện liên tục"
                },
                "examples": [
                    {
                        "en": "stream of something/somebody I've had a steady stream of visitors.",
                        "vi": "dòng thứ gì đó / ai đó Tôi đã có một lượng khách truy cập ổn định."
                    },
                    {
                        "en": "a continuous stream of people/traffic",
                        "vi": "một dòng người / giao thông liên tục"
                    },
                    {
                        "en": "in a stream Cars filed past in an endless stream.",
                        "vi": "trong một con suối Những chiếc xe chạy qua trong một dòng bất tận."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous supply of something; a large number of things that happen one after the other",
                    "vi": "một nguồn cung cấp liên tục của một cái gì đó; một số lượng lớn những điều xảy ra lần lượt"
                },
                "examples": [
                    {
                        "en": "By licensing their works, artists can create an ongoing revenue stream.",
                        "vi": "Bằng cách cấp phép cho các tác phẩm của họ, các nghệ sĩ có thể tạo ra một nguồn doanh thu liên tục."
                    },
                    {
                        "en": "The building needs to produce an income stream for the company.",
                        "vi": "Tòa nhà cần tạo ra một nguồn thu nhập cho công ty."
                    },
                    {
                        "en": "stream of something The agency provided me with a steady stream of work.",
                        "vi": "luồng gì đó Cơ quan đã cung cấp cho tôi một luồng công việc ổn định."
                    },
                    {
                        "en": "a constant stream of enquiries",
                        "vi": "một dòng yêu cầu liên tục"
                    },
                    {
                        "en": "Most of the letter consisted of a stream of abuse.",
                        "vi": "Hầu hết bức thư bao gồm một luồng lạm dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous flow of video or sound sent over the internet; a continuous flow of computer data or instructions",
                    "vi": "một luồng video hoặc âm thanh liên tục được gửi qua internet; một luồng dữ liệu máy tính hoặc hướng dẫn liên tục"
                },
                "examples": [
                    {
                        "en": "You can listen to the live audio stream.",
                        "vi": "Bạn có thể nghe luồng âm thanh trực tiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of students of the same age and level of ability in some schools",
                    "vi": "một nhóm học sinh ở cùng độ tuổi và trình độ khả năng ở một số trường"
                },
                "examples": [
                    {
                        "en": "She was put into the fast stream.",
                        "vi": "Cô được đưa vào dòng nước xiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in operation or available",
                    "vi": "đang hoạt động hoặc có sẵn"
                },
                "examples": [
                    {
                        "en": "The new computer system comes on stream next month.",
                        "vi": "Hệ thống máy tính mới sẽ được phát hành vào tháng tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "d866319e418c4f7bbb04cf4ea0e922e4",
        "word": "studious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstjuːdiəs/",
            "us": "/ˈstuːdiəs/"
        },
        "nearby": [
            {
                "word": "studied",
                "pos": "adjective"
            },
            {
                "word": "studio",
                "pos": "noun"
            },
            {
                "word": "studious",
                "pos": "adjective"
            },
            {
                "word": "studiously",
                "pos": "adverb"
            },
            {
                "word": "studmuffin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "spending a lot of time studying or reading",
                    "vi": "dành nhiều thời gian học hoặc đọc"
                },
                "examples": [
                    {
                        "en": "a studious young man",
                        "vi": "một thanh niên hiếu học"
                    },
                    {
                        "en": "He liked to wear glasses, which he thought made him look studious.",
                        "vi": "Anh ấy thích đeo kính, thứ mà anh ấy nghĩ khiến anh ấy trông rất chăm học."
                    },
                    {
                        "en": "She was a quiet, studious girl.",
                        "vi": "Cô là một cô gái trầm tính, chăm học."
                    }
                ]
            }
        ]
    },
    {
        "id": "58ff170bbec445d3bbe33c9235c871c0",
        "word": "taunt",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/tɔːnt/",
            "us": "/tɔːnt/"
        },
        "nearby": [
            {
                "word": "tau",
                "pos": "noun"
            },
            {
                "word": "taught",
                "pos": "verb"
            },
            {
                "word": "taunt",
                "pos": "verb"
            },
            {
                "word": "taunt",
                "pos": "noun"
            },
            {
                "word": "Taunton",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to make somebody angry or upset by saying unkind things about them, laughing at their failures, etc.",
                    "vi": "cố gắng làm ai đó tức giận hoặc khó chịu bằng cách nói những điều không hay về họ, cười nhạo những thất bại của họ, v.v."
                },
                "examples": [
                    {
                        "en": "The other kids continually taunted him about his size.",
                        "vi": "Những đứa trẻ khác liên tục chế nhạo anh ta về kích thước của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9411e5616484b01a457765c6b22cf59",
        "word": "taunt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tɔːnt/",
            "us": "/tɔːnt/"
        },
        "nearby": [
            {
                "word": "taught",
                "pos": "verb"
            },
            {
                "word": "taunt",
                "pos": "verb"
            },
            {
                "word": "taunt",
                "pos": "noun"
            },
            {
                "word": "Taunton",
                "pos": ""
            },
            {
                "word": "taupe",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an offensive or unkind remark that is intended to make somebody angry or upset",
                    "vi": "một nhận xét xúc phạm hoặc không tử tế nhằm mục đích làm cho ai đó tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Black players often had to endure racist taunts.",
                        "vi": "Các cầu thủ da đen thường xuyên phải hứng chịu những lời chế nhạo phân biệt chủng tộc."
                    },
                    {
                        "en": "She ignored his taunt.",
                        "vi": "Cô phớt lờ lời chế nhạo của anh."
                    },
                    {
                        "en": "Their taunts stung him into his best performance for the team yet.",
                        "vi": "Những lời chế nhạo của họ đã đưa anh ấy vào màn trình diễn tốt nhất của anh ấy cho đội bóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa3ace60af31426e978f90529c257cee",
        "word": "telling-off",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtelɪŋ ˈɒf/",
            "us": "/ˌtelɪŋ ˈɔːf/"
        },
        "nearby": [
            {
                "word": "telling",
                "pos": "adjective"
            },
            {
                "word": "tellingly",
                "pos": "adverb"
            },
            {
                "word": "telling-off",
                "pos": "noun"
            },
            {
                "word": "tell of",
                "pos": "phrasal verb"
            },
            {
                "word": "tell off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of speaking angrily to somebody, especially a child, because they have done something bad",
                    "vi": "hành động nói chuyện giận dữ với ai đó, đặc biệt là một đứa trẻ, bởi vì họ đã làm điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "The nurse gave him a telling-off for smoking in the hospital.",
                        "vi": "Y tá đã cấm anh ta hút thuốc trong bệnh viện."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1328206ffbc4db484309c5b0830f6de",
        "word": "tell on",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "tell of",
                "pos": "phrasal verb"
            },
            {
                "word": "tell off",
                "pos": "phrasal verb"
            },
            {
                "word": "tell on",
                "pos": "phrasal verb"
            },
            {
                "word": "telltale",
                "pos": "adjective"
            },
            {
                "word": "telltale",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell a person in authority about something bad that somebody has done",
                    "vi": "nói với một người có thẩm quyền về điều gì đó tồi tệ mà ai đó đã làm"
                },
                "examples": [
                    {
                        "en": "Promise not to tell on me!",
                        "vi": "Hãy hứa không kể về tôi!"
                    }
                ]
            }
        ]
    },
    {
        "id": "be5bc3f7308b4401be892d2f8255f2b8",
        "word": "yearbook",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈjɪəbʊk/",
            "us": "/ˈjɪrbʊk/"
        },
        "nearby": [
            {
                "word": "yeah",
                "pos": "exclamation"
            },
            {
                "word": "year",
                "pos": "noun"
            },
            {
                "word": "yearbook",
                "pos": "noun"
            },
            {
                "word": "year end",
                "pos": "noun"
            },
            {
                "word": "year-end",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book published once a year, giving details of events, etc. of the previous year, especially those connected with a particular area of activity",
                    "vi": "một cuốn sách được xuất bản mỗi năm một lần, cung cấp thông tin chi tiết về các sự kiện, v.v. của năm trước, đặc biệt là những sự kiện liên quan đến một lĩnh vực hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "The Artists’ and Writers’ Yearbook",
                        "vi": "Kỷ yếu của các nghệ sĩ và nhà văn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that is produced by the senior class in a school or college, containing photographs of students and details of school activities",
                    "vi": "một cuốn sách được sản xuất bởi lớp cuối cấp trong một trường học hoặc trường cao đẳng, chứa các bức ảnh của học sinh và thông tin chi tiết về các hoạt động của trường"
                },
                "examples": []
            }
        ]
    }
]